[
  {
    "title": "Engineering Education in the Age of Autonomous Machines",
    "abstract": "In the past few years, we have observed a huge supply-demand gap for\nautonomous driving engineers. The core problem is that autonomous driving is\nnot one single technology but rather a complex system integrating many\ntechnologies, and no one single academic department can provide comprehensive\neducation in this field. We advocate to create a cross-disciplinary program to\nexpose students with technical background in computer science, computer\nengineering, electrical engineering, as well as mechanical engineering. On top\nof the cross-disciplinary technical foundation, a capstone project that\nprovides students with hands-on experiences of working with a real autonomous\nvehicle is required to consolidate the technical foundation.",
    "authors": [
      "Shaoshan Liu",
      "Jean-Luc Gaudiot",
      "Hironori Kasahara"
    ],
    "publication_date": "2021-02-16T00:44:14Z",
    "arxiv_id": "http://arxiv.org/abs/2102.07900v1",
    "download_url": "http://arxiv.org/abs/2102.07900v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Numerical Method to Find the Optimal Thermodynamic Cycle in\n  Microscopic Heat Engine",
    "abstract": "Heat engines are fundamental physical objects to develop nonequilibrium\nthermodynamics. The thermodynamic performance of the heat engine is determined\nby the choice of cycle and time-dependence of parameters. Here, we propose a\nsystematic numerical method to find a heat engine cycle to optimize some target\nfunctions. We apply the method to heat engines with slowly varying parameters\nand show that the method works well. Our numerical method is based on the\ngenetic algorithm which is widely applied to various optimization problems.",
    "authors": [
      "Rongxing Xu"
    ],
    "publication_date": "2021-04-29T14:35:20Z",
    "arxiv_id": "http://arxiv.org/abs/2104.14373v1",
    "download_url": "http://arxiv.org/abs/2104.14373v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum-Enhanced Heat Engine Based on Superabsorption",
    "abstract": "We propose a quantum-enhanced heat engine with entanglement. The key feature\nof our scheme is superabsorption, which facilitates enhanced energy absorption\nby entangled qubits. Whereas a conventional engine with $N$ separable qubits\nprovides power with a scaling of $P = \\Theta (N)$, our engine uses\nsuperabsorption to provide power with a quantum scaling of $P = \\Theta(N^2)$.\nThis quantum heat engine also exhibits a scaling advantage over classical ones\ncomposed of $N$-particle Langevin systems. Our work elucidates the quantum\nproperties allowing for the enhancement of performance.",
    "authors": [
      "S. Kamimura",
      "H. Hakoshima",
      "Y. Matsuzaki",
      "K. Yoshida",
      "Y. Tokura"
    ],
    "publication_date": "2021-06-21T02:21:48Z",
    "arxiv_id": "http://arxiv.org/abs/2106.10813v2",
    "download_url": "http://arxiv.org/abs/2106.10813v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics education for energy transformation: a Stirling Engine\n  experiment",
    "abstract": "We present a thermodynamics experiment suitable for first year undergraduate\nstudents employing Stirling Engines to create a demonstration of energy\ntransformation and to measure the mechanical efficiency of such engines. Using\nan inexpensive transparent chambered Stirling Engine, students can connect\nconcepts such as the theoretical pressure-volume diagram with the physical\nmovements of the engine's pistons and the resultant useful output work of a\nspinning wheel. We found the majority of students successfully complete this\nexperiment obtaining results similar to when performed by the authors. In\naddition to the core thermodynamics lesson, this experiment incorporates DC\ncircuits, oscilloscopes, and data analysis so it can be integrated into a wider\nundergraduate physics course to combine the teaching of multiple subjects.",
    "authors": [
      "Will Yeadon",
      "Mark Quinn"
    ],
    "publication_date": "2021-05-17T20:21:51Z",
    "arxiv_id": "http://arxiv.org/abs/2105.08142v1",
    "download_url": "http://arxiv.org/abs/2105.08142v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards More Accountable Search Engines: Online Evaluation of\n  Representation Bias",
    "abstract": "Information availability affects people's behavior and perception of the\nworld. Notably, people rely on search engines to satisfy their need for\ninformation. Search engines deliver results relevant to user requests usually\nwithout being or making themselves accountable for the information they\ndeliver, which may harm people's lives and, in turn, society. This potential\nrisk urges the development of evaluation mechanisms of bias in order to empower\nthe user in judging the results of search engines. In this paper, we give a\npossible solution to measuring representation bias with respect to societal\nfeatures for search engines and apply it to evaluating the gender\nrepresentation bias for Google's Knowledge Graph Carousel for listing\noccupations.",
    "authors": [
      "Aldo Lipani",
      "Florina Piroi",
      "Emine Yilmaz"
    ],
    "publication_date": "2021-10-17T14:32:29Z",
    "arxiv_id": "http://arxiv.org/abs/2110.08835v1",
    "download_url": "http://arxiv.org/abs/2110.08835v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Brownian yet Non-Gaussian Heat Engine",
    "abstract": "We investigate the performance of a Brownian heat engine working in a\nheterogeneous thermal bath where the mobility fluctuates. Brownian particle is\ntrapped by the time-dependent harmonic potential, by changing the stiffness\ncoefficient and the bath temperatures, we perform a Stirling cycle. We\nnumerically evaluated the average work, power and efficiency. We compare our\nresults with the Brownian heat engine working in a homogeneous thermal bath. We\nfind that for the normal diffusive system, the performance of a Gaussian heat\nengine serves as an upper bound. We also observe that the non-Gaussian position\ndistribution decreases the stochastic heat engine performance.",
    "authors": [
      "I. Iyyappan",
      "Jetin E. Thomas",
      "Sibasish Ghosh"
    ],
    "publication_date": "2023-07-22T05:33:30Z",
    "arxiv_id": "http://arxiv.org/abs/2307.11985v2",
    "download_url": "http://arxiv.org/abs/2307.11985v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The thermodynamics governing 'endoreversible' engines",
    "abstract": "The thermodynamics of the Curzon-Ahlborn engine, which is a prototype of\nendoreversible engines, is elucidated. In particular, their criterion for\nadiabatic equilibration is revised. The so-called irreversibility of\nendoreversible engines arises from the selection of the coldest reservoir for\nheat rejection. Rather, if the reservoirs are allowed to come into thermal and\nmechanical contact, a mean value results which optimizes the work output and\nheat uptake, and is entirely reversible. The Carnot efficiency cannot be beaten\nbecause nothing is as cold as the coldest reservoir.",
    "authors": [
      "B. H. Lavenda"
    ],
    "publication_date": "2006-04-04T15:08:50Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0604094v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0604094v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficiency of Energy Transduction in a Molecular Chemical Engine",
    "abstract": "A simple model of the two-state ratchet type is proposed for molecular\nchemical engines that convert chemical free energy into mechanical work and\nvice versa. The engine works by catalyzing a chemical reaction and turning a\nrotor. Analytical expressions are obtained for the dependences of rotation and\nreaction rates on the concentrations of reactant and product molecules, from\nwhich the performance of the engine is analyzed. In particular, the efficiency\nof energy transduction is discussed in some detail.",
    "authors": [
      "Kazuo Sasaki",
      "Ryo Kanada",
      "Satoshi Amari"
    ],
    "publication_date": "2006-07-20T02:09:51Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0607506v2",
    "download_url": "http://arxiv.org/abs/cond-mat/0607506v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generalized thermodynamics of an autonomous micro-engine",
    "abstract": "We analyze an autonomous micro-engine as a closed quantum mechanical system,\nincluding the work it performs and the fuel it consumes. Our model system shows\nby example that it is possible to transfer energy steadily and spontaneously\nbetween fast and slow degrees of freedom, in analogy to the way combustion\nengines convert chemical energy into work. Having shown this possibility, we\nobserve close analogies between the closed-system quantum dynamics of our\nmicro-engine and the First and Second Law of Thermodynamics. From these\nanalogies we deduce a generalized formulation of thermodynamics that remains\nvalid on the micro-scale.",
    "authors": [
      "Lukas Gilz",
      "Eike P. Thesing",
      "James R. Anglin"
    ],
    "publication_date": "2013-04-11T07:31:46Z",
    "arxiv_id": "http://arxiv.org/abs/1304.3222v1",
    "download_url": "http://arxiv.org/abs/1304.3222v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The classical mechanics of autonomous microscopic engines",
    "abstract": "Even microscopic engines have hitherto been defined to require macroscopic\nelements such as heat reservoirs, but here we observe that what makes engines\nuseful is energy transfer across a large ratio of dynamical time scales\n(\"downconversion\"), and that small, closed dynamical systems which could\nperform steady downconversion (\"Hamiltonian daemons\") would fulfill the\npractical requirements of autonomous microscopic engines. We show that such\ndaemons are possible, and obey mechanical constraints comparable to, but\ndifferent from, the laws of thermodynamics.",
    "authors": [
      "Lukas Gilz",
      "Eike P. Thesing",
      "James R. Anglin"
    ],
    "publication_date": "2015-09-08T14:08:38Z",
    "arxiv_id": "http://arxiv.org/abs/1509.02778v1",
    "download_url": "http://arxiv.org/abs/1509.02778v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quasi-linear irreversible thermodynamics of a\n  low-temperature-differential kinematic Stirling heat engine",
    "abstract": "Low-temperature-differential (LTD) Stirling heat engines are able to operate\nwith a small temperature difference between low-temperature heat reservoirs\nthat exist in our daily lives, and thus they are considered to be an important\nsustainable energy technology. The author recently proposed a nonlinear\ndynamics model of an LTD kinematic Stirling heat engine to study the rotational\nmechanism of the engine [Y. Izumida, EPL \\textbf{121}, 50004 (2018)]. This\npaper presents our study of the nonequilibrium thermodynamics analysis of this\nengine model, where a load torque against which the engine does work is\nintroduced. We demonstrate that the engine's rotational state is in a\nquasi-linear response regime where the thermodynamic fluxes show a linear\ndependency on the thermodynamic forces. Significantly, it is found that the\nresponse coefficients of the quasi-linear relations are symmetric, which is\nsimilar to Onsager symmetry in linear irreversible thermodynamics. Based on\nthese relations, we formulate the maximum efficiency of the engine. We also\nelucidate that the symmetry of the quasi-linear response coefficients emerges\nby reflecting the (anti-)reciprocity of the Onsager kinetic coefficients\nidentified for the relaxation dynamics of the engine in the vicinity of an\nequilibrium state. We expect that the present study paves the way for\ndeveloping nonequilibrium thermodynamics of autonomous heat engines described\nas a nonlinear dynamical system.",
    "authors": [
      "Yuki Izumida"
    ],
    "publication_date": "2020-05-05T14:50:40Z",
    "arxiv_id": "http://arxiv.org/abs/2005.02253v3",
    "download_url": "http://arxiv.org/abs/2005.02253v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Proposal for Composite Quantum Electromagnetically Induced Transparency\n  Heat Engine Coupled by a Nanomechanical Mirror",
    "abstract": "This paper introduces a quantum heat engine model that utilizes an ultracold\natomic gas coupled with a nanomechanical mirror. The mirror's vibration induces\nan opto-mechanical sideband in the control field, affecting the behavior of the\ncold gas and subsequently influencing the output radiation of the engine. The\nmodel incorporates mirror vibration while omitting cavity confinement,\nestablishing a bridge between a multi-level atom-laser interacting system that\nplays with coherences and the mechanical vibration of the nanomechanical\nmirror, which jointly function as heat engines. Three distinct heat engine\nconfigurations are proposed: the first involves a vibration-free three-level\n$\\Lambda$-type system, the second introduces nanomechanical vibration to the\nthree-level $\\Lambda$-type system, and the third constitutes a composite engine\nthat combines the previous setups along with nanomechanical vibration. The\nspectral brightness of a three-level heat engine is diminished with mirror\nvibration, whereas for a composite heat engine, there is a slight enhancement\nin the brightness peak. However, the maximum brightness is attained when there\nis no vibration. Comparisons between the proposed model and an ideal system are\nmade regarding entropy balance, adhering to the constraints of the second law\nof thermodynamics. The model observed that when subjected to mirror vibration,\nthe proposed heat engines diverged from the characteristics expected in an\nideal heat engine.",
    "authors": [
      "Rejjak Laskar"
    ],
    "publication_date": "2024-07-21T09:22:27Z",
    "arxiv_id": "http://arxiv.org/abs/2407.15099v1",
    "download_url": "http://arxiv.org/abs/2407.15099v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On stepwise advancement of fractures and pressure oscillations in\n  saturated porous media",
    "abstract": "Comments to K.M. Pervaiz Fathima, Ren\\'e de Borst, Implications of single or\nmultiple pressure degrees of freedom at fracture in fluid saturated porous\nmedia, Engineering Fracture Mechanics, 213 (2019), 1-20.",
    "authors": [
      "Carlo Peruzzo",
      "Luciano Simoni",
      "Bernhard Schrefler"
    ],
    "publication_date": "2023-07-13T04:30:59Z",
    "arxiv_id": "http://arxiv.org/abs/2307.06960v1",
    "download_url": "http://arxiv.org/abs/2307.06960v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Exact Model of the Power/Efficiency Trade-Off While Approaching the\n  Carnot Limit",
    "abstract": "The Carnot heat engine sets an upper bound on the efficiency of a heat\nengine. As an ideal, reversible engine, a single cycle must be performed in\ninfinite time, and so the Carnot engine has zero power. However, there is\nnothing in principle forbidding the existence of a heat engine whose efficiency\napproaches that of Carnot while maintaining finite power. Such an engine must\nhave very special properties, some of which have been discussed in the\nliterature, in various limits. While recent theorems rule out a large class of\nengines from maintaining finite power at exactly the Carnot efficiency, the\napproach to the limit still merits close study. Presented here is an exactly\nsolvable model of such an approach that may serve as a laboratory for\nexploration of the underlying mechanisms. The equations of state have their\norigins in the extended thermodynamics of electrically charged black holes.",
    "authors": [
      "Clifford V. Johnson"
    ],
    "publication_date": "2017-03-17T17:28:03Z",
    "arxiv_id": "http://arxiv.org/abs/1703.06119v3",
    "download_url": "http://arxiv.org/abs/1703.06119v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Szilard Engines as Quantum Thermodynamical Systems",
    "abstract": "We analyze an engine whose working fluid consists of a single quantum\nparticle, paralleling Szilard's construction of a classical single-particle\nengine. Following his resolution of Maxwell's Second Law paradox using the\nlatter, which turned on physically instantiating the demon (control subsystem),\nthe quantum engine's design mirrors the classically-chaotic Szilard Map that\noperates a thermodynamic cycle of measurement, thermal-energy extraction, and\nmemory reset. Focusing on the thermodynamic costs to observe and control the\nparticle and comparing these in the quantum and classical limits, we detail the\nthermodynamic tradeoffs behind Landauer's Principle for\ninformation-processing-induced thermodynamic dissipation in the quantum and\nclassical regimes. In particular, and as found with the classical engine, we\nshow that the sum of the thermodynamic costs over a cycle obeys a generalized\nLandauer Principle, exactly balancing energy extraction from the heat bath.\nThus, the quantum engine obeys the Second Law. However, the quantum engine does\nso via substantially different mechanisms: classically measurement and erasure\ndetermine the thermodynamics, while in the quantum implementation the cost of\npartition insertion is key.",
    "authors": [
      "Maryam Ashrafi",
      "Kyle J. Ray",
      "Fabio Anza",
      "James P. Crutchfield"
    ],
    "publication_date": "2020-10-27T22:33:13Z",
    "arxiv_id": "http://arxiv.org/abs/2010.14652v2",
    "download_url": "http://arxiv.org/abs/2010.14652v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Collective effects on the performance and stability of quantum heat\n  engines",
    "abstract": "Recent predictions for quantum-mechanical enhancements in the operation of\nsmall heat engines have raised renewed interest in their study from both a\nfundamental perspective and in view of applications. One essential question is\nwhether collective effects may help to carry enhancements over larger scales,\nwhen increasing the number of systems composing the working substance of the\nengine. Such enhancements may consider not only power and efficiency, that is\nits performance, but, additionally, its constancy, i.e. the stability of the\nengine with respect to unavoidable environmental fluctuations. We explore this\nissue by introducing a many-body quantum heat engine model composed by spin\npairs working in continuous operation. We study how power, efficiency and\nconstancy scale with the number of spins composing the engine and introduce a\nwell-defined macroscopic limit where analytical expressions are obtained. Our\nresults predict power enhancements, both in finite-size and macroscopic cases,\nfor a broad range of system parameters and temperatures, without compromising\nthe engine efficiency, accompanied by coherence-enhanced constancy for finite\nsizes. We discuss these quantities in connection to Thermodynamic Uncertainty\nRelations (TUR).",
    "authors": [
      "Leonardo da Silva Souza",
      "Gonzalo Manzano",
      "Rosario Fazio",
      "Fernando Iemini"
    ],
    "publication_date": "2021-06-25T18:00:07Z",
    "arxiv_id": "http://arxiv.org/abs/2106.13817v2",
    "download_url": "http://arxiv.org/abs/2106.13817v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Equilibrium Chemical Engines",
    "abstract": "An equilibrium reversible cycle with a certain engine to transduce the energy\nof any chemical reaction into mechanical energy is proposed. The efficiency for\nchemical energy transduction is also defined so as to be compared with Carnot\nefficiency. Relevance to the study of protein motors is discussed. KEYWORDS:\nChemical thermodynamics, Engine, Efficiency, Molecular machine.",
    "authors": [
      "Tatsuo Shibata",
      "Shin-ichi Sasa"
    ],
    "publication_date": "1997-10-30T08:51:03Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9710328v1",
    "download_url": "http://arxiv.org/abs/cond-mat/9710328v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fluctuation Relation for Heat Engines",
    "abstract": "We derive the exact equality, referred to as the fluctuation relation for\nheat engines (FRHE), that relates statistics of heat extracted from one of the\ntwo heat baths and the work per one cycle of a heat engine operation. Carnot's\ninequality of classical thermodynamics follows as a direct consequence of the\nFRHE.",
    "authors": [
      "N. A. Sinitsyn"
    ],
    "publication_date": "2011-11-29T23:30:39Z",
    "arxiv_id": "http://arxiv.org/abs/1111.7014v1",
    "download_url": "http://arxiv.org/abs/1111.7014v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the maximum efficiency of realistic heat engines",
    "abstract": "In 1975, Courzon and Ahlborn studied a Carnot engine with thermal losses and\ngot an expression for its efficiency that described better the performance of\nactual heat machines than the traditional result due to Carnot. In their\noriginal derivation, time appears explicitly and this is disappointing in the\nframework of classical thermodynamics. In this note a derivation is given\nwithout any explicit reference to time.",
    "authors": [
      "E. N. Miranda"
    ],
    "publication_date": "2012-08-10T14:40:23Z",
    "arxiv_id": "http://arxiv.org/abs/1209.6300v1",
    "download_url": "http://arxiv.org/abs/1209.6300v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optomechanical elastomeric engine",
    "abstract": "Nematic elastomers contract along their director when heated or illuminated\n(in the case of photoelastomers). We present a conceptual design for an\nelastomer-based engine to extract mechanical work from heat or light. The\nmaterial parameters and the geometry of such an engine are explored, and it is\nshown that its efficiency can go up to 20%.",
    "authors": [
      "Milos Knezevic",
      "Mark Warner"
    ],
    "publication_date": "2013-10-17T09:58:02Z",
    "arxiv_id": "http://arxiv.org/abs/1310.4641v1",
    "download_url": "http://arxiv.org/abs/1310.4641v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimal work of quantum Szilard engine",
    "abstract": "We have found the optimal condition of the work performed by the quantum\nSzilard engine (SZE) containing multi-particles. Usually the optimal work of a\ncyclic engine is achieved when the whole thermodynamic process is reversible.\nAlthough the quantum SZE inherently contains an irreversible process, we can\nstill define effectively reversible protocol based upon the force of\ntime-forward and time-backward processes.",
    "authors": [
      "Hee Joon Jeon",
      "Sang Wook Kim"
    ],
    "publication_date": "2014-01-08T12:52:32Z",
    "arxiv_id": "http://arxiv.org/abs/1401.1685v1",
    "download_url": "http://arxiv.org/abs/1401.1685v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum heat engines with multiferroic working substance",
    "abstract": "The work provides an overview on some recent advances in the area of quantum\nthermodynamics and quantum heat engines. A particular emphasis is put on the\npossibility of constructing finite time quantum cycles and adiabatic shortcuts.\nWe discuss in details the particular quantum heat engines operating with a\nmultiferroic working substance.",
    "authors": [
      "L. Chotorlishvili",
      "M. Azimi",
      "S. Stagraczyński",
      "J. Berakdar"
    ],
    "publication_date": "2017-03-02T16:58:48Z",
    "arxiv_id": "http://arxiv.org/abs/1703.00855v1",
    "download_url": "http://arxiv.org/abs/1703.00855v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A CAD Tool for Linear Optics Design: A Controls Engineer's Geometric\n  Approach to Hill's Equation",
    "abstract": "The formulae relevant for the Linear Optics design of Synchrotrons are\nderived systematically from first principles, a straightforward exercise in\nHamiltonian Dynamics. Equipped with these, the relevant \"Use Cases\" are then\ncaptured for a streamlined approach. This will enable professionals -- Software\nEngineers -- to efficiently prototype & architect a CAD Tool for ditto;\nsomething which has been available to Mechanical Engineers since the mid-1960s.",
    "authors": [
      "J. Bengtsson",
      "W. Rogers",
      "T. Nicholls"
    ],
    "publication_date": "2021-09-29T16:28:22Z",
    "arxiv_id": "http://arxiv.org/abs/2109.15066v1",
    "download_url": "http://arxiv.org/abs/2109.15066v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A simple quantum heat engine",
    "abstract": "Quantum heat engines employ as working agents multi-level systems instead of\ngas-filled cylinders. We consider particularly two-level agents such as\nelectrons immersed in a magnetic field. Work is produced in that case when the\nelectrons are being carried from a high-magnetic-field region into a\nlow-magnetic-field region. In watermills, work is produced instead when some\namount of fluid drops from a high-altitude reservoir to a low-altitude\nreservoir. We show that this purely mechanical engine may in fact be considered\nas a two-level quantum heat engine, provided the fluid is viewed as consisting\nof n molecules of weight one and N-n molecules of weight zero. Weight-one\nmolecules are analogous to electrons in their higher energy state, while\nweight-zero molecules are analogous to electrons in their lower energy state.\nMore generally, fluids consist of non-interacting molecules of various weights.\nIt is shown that, not only the average value of the work produced per cycle,\nbut also its fluctuations, are the same for mechanical engines and quantum\n(Otto) heat engines. The reversible Carnot cycles are approached through the\nconsideration of multiple sub-reservoirs.",
    "authors": [
      "Jacques Arnaud",
      "Laurent Chusseau",
      "Fabrice Philippe"
    ],
    "publication_date": "2002-11-13T09:13:05Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0211072v2",
    "download_url": "http://arxiv.org/abs/quant-ph/0211072v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A mechanical autonomous stochastic heat engine",
    "abstract": "Stochastic heat engines are devices that generate work from random thermal\nmotion using a small number of highly fluctuating degrees of freedom. Proposals\nfor such devices have existed for more than a century and include the Maxwell\ndemon and the Feynman ratchet. Only recently have they been demonstrated\nexperimentally, using e.g., thermal cycles implemented in optical traps.\nHowever, the recent demonstrations of stochastic heat engines are\nnonautonomous, since they require an external control system that prescribes a\nheating and cooling cycle, and consume more energy than they produce. This\nReport presents a heat engine consisting of three coupled mechanical resonators\n(two ribbons and a cantilever) subject to a stochastic drive. The engine uses\ngeometric nonlinearities in the resonating ribbons to autonomously convert a\nrandom excitation into a low-entropy, nonpassive oscillation of the cantilever.\nThe engine presents the anomalous heat transport property of negative thermal\nconductivity, consisting in the ability to passively transfer energy from a\ncold reservoir to a hot reservoir.",
    "authors": [
      "Marc Serra-Garcia",
      "André Foehr",
      "Miguel Molerón",
      "Joseph Lydon",
      "Christopher Chong",
      "Chiara Daraio"
    ],
    "publication_date": "2016-01-27T12:43:22Z",
    "arxiv_id": "http://arxiv.org/abs/1601.07547v1",
    "download_url": "http://arxiv.org/abs/1601.07547v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanical bound for efficiency of quantum Otto heat engine",
    "abstract": "The second law of thermodynamics constrains that the efficiency of heat\nengines, classical or quantum, cannot be greater than the universal Carnot\nefficiency. We discover another bound for the efficiency of a quantum Otto heat\nengine consisting of a harmonic oscillator. Dynamics of the engine is governed\nby the Lindblad equation for the density matrix, which is mapped to the\nFokker-Planck equation for the quasi-probability distribution. Applying\nstochastic thermodynamics to the Fokker-Planck equation system, we obtain the\n$\\hbar$-dependent quantum mechanical bound for the efficiency. It turns out\nthat the bound is tighter than the Carnot efficiency. The engine achieves the\nbound in the low temperature limit where quantum effects dominate. Our work\ndemonstrates that quantum nature could suppress the performance of heat engines\nin terms of efficiency bound, work and power output.",
    "authors": [
      "Jong-Min Park",
      "Sangyun Lee",
      "Hyun-Myung Chun",
      "Jae Dong Noh"
    ],
    "publication_date": "2019-05-14T07:49:09Z",
    "arxiv_id": "http://arxiv.org/abs/1905.05432v1",
    "download_url": "http://arxiv.org/abs/1905.05432v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The efficiency of Quantum Mechanical Carnot Engine using the Woods Saxon\n  model",
    "abstract": "The quantum engine cycle serves as an analogous representation of classical\nheat engines for microscopic systems and the quantum regime of thermal devices\nis composed of a single element. In this work, the Quantum-Mechanical\nproperties of a non-linear quantum oscillator described by the Woods-Saxon [WS]\nmodel are examined. The Quantum-Mechanical analogue of the Carnot cycle was\nconstructed using changes in both the width L of the well and the quantum state\nof the potential well. The efficiency of the quantum engine, consisting of\nadiabatic and isothermal processes based on the Woods-Saxon [WS] potential is\nderived. The result is shown to be analogous to that of the classical engine\nand found to agree, within an appropriate limit, with existing results obtained\nfrom other potential models. This implies that the [WS] potential can be used\nas an alternative model in quantum engines.",
    "authors": [
      "E. O. Oladimeji",
      "T. T. Ibrahim",
      "A. N. Ikot",
      "J. D. Koffa",
      "H. O. Edogbanya",
      "E. C. Umeh",
      "J. O. Audu",
      "J. M. Uzer"
    ],
    "publication_date": "2022-03-04T20:41:56Z",
    "arxiv_id": "http://arxiv.org/abs/2203.02564v3",
    "download_url": "http://arxiv.org/abs/2203.02564v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical work extraction from an error-prone active dynamic Szilard\n  engine",
    "abstract": "Isothermal information engines operate by extracting net work from a single\nheat bath through measurement and feedback control. In this work, we analyze a\nrealistic active Szilard engine operating on a single active particle by means\nof steric interaction with an externally controlled mechanical element. In\nparticular, we provide a comprehensive study of how finite measurement accuracy\naffects the engine's work and power output, as well as the cost of operation.\nHaving established the existence of non-trivial optima for work and power\noutput, we study the dependence of their loci on the measurement error\nparameters and identify conditions for their positivity under one-shot and\ncyclic engine operation. By computing a suitably defined information\nefficiency, we also demonstrate that this engine design allows for the\nviolation of Landauer's bound on the efficiency of information-to-work\nconversion. Notably, the information efficiency for one-shot operation exhibits\na discontinuous transition and a non-monotonic dependence on the measurement\nprecision. Finally, we show that cyclic operation improves information\nefficiency by harvesting residual mutual information between successive\nmeasurements.",
    "authors": [
      "Luca Cocconi",
      "Paolo Malgaretti",
      "Holger Stark"
    ],
    "publication_date": "2025-05-14T16:19:05Z",
    "arxiv_id": "http://arxiv.org/abs/2505.09523v1",
    "download_url": "http://arxiv.org/abs/2505.09523v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Energetics of a simple microscopic heat engine",
    "abstract": "We model a microscopic heat engine as a particle hopping on a one-dimensional\nlattice in a periodic sawtooth potential, with or without load, assisted by the\nthermal kicks it gets from alternately placed hot and cold thermal baths. We\nfind analytic expressions for current and rate of heat flow when the engine\noperates at steady state. Three regions are identified where the model acts\neither as a heat engine or as a refrigerator or as neither of the two. At\nquasistatic limit both efficiency of the engine and coefficient of performance\nof the refrigerator go to that for Carnot engine and Carnot refrigerator,\nrespectively. We investigate efficiency of the engine at two operating\nconditions (at maximum power and at optimum value with respect to energy and\ntime) and compare them with those of the endoreversible and Carnot engines.",
    "authors": [
      "Mesfin Asfaw",
      "Mulugeta Bekele"
    ],
    "publication_date": "2005-03-23T14:42:25Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0503578v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0503578v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Autonomous Rotor Heat Engine",
    "abstract": "The triumph of heat engines is their ability to convert the disordered energy\nof thermal sources into useful mechanical motion. In recent years, much effort\nhas been devoted to generalizing thermodynamic notions to the quantum regime,\npartly motivated by the promise of surpassing classical heat engines. Here, we\ninstead adopt a bottom-up approach: we propose a realistic autonomous heat\nengine that can serve as a testbed for quantum effects in the context of\nthermodynamics. Our model draws inspiration from actual piston engines and is\nbuilt from closed-system Hamiltonians and weak bath coupling terms. We\nanalytically derive the performance of the engine in the classical regime via a\nset of nonlinear Langevin equations. In the quantum case, we perform numerical\nsimulations of the master equation. Finally, we perform a dynamic and\nthermodynamic analysis of the engine's behaviour for several parameter regimes\nin both the classical and quantum case, and find that the latter exhibits a\nconsistently lower efficiency due to additional noise.",
    "authors": [
      "Alexandre Roulet",
      "Stefan Nimmrichter",
      "Juan Miguel Arrazola",
      "Stella Seah",
      "Valerio Scarani"
    ],
    "publication_date": "2016-09-20T03:51:22Z",
    "arxiv_id": "http://arxiv.org/abs/1609.06011v2",
    "download_url": "http://arxiv.org/abs/1609.06011v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tuning the performance of a micrometer-sized Stirling engine through\n  reservoir engineering",
    "abstract": "Colloidal heat engines are paradigmatic models to understand the conversion\nof heat into work in a noisy environment - a domain where biological and\nsynthetic nano/micro machines function. While the operation of these engines\nacross thermal baths is well-understood, how they function across baths with\nnoise statistics that is non-Gaussian and also lacks memory, the simplest\ndeparture from equilibrium, remains unclear. Here we quantified the performance\nof a colloidal Stirling engine operating between an engineered\n\\textit{memoryless} non-Gaussian bath and a Gaussian one. In the quasistatic\nlimit, the non-Gaussian engine functioned like an equilibrium one as predicted\nby theory. On increasing the operating speed, due to the nature of noise\nstatistics, the onset of irreversibility for the non-Gaussian engine preceded\nits thermal counterpart and thus shifted the operating speed at which power is\nmaximum. The performance of nano/micro machines can be tuned by altering only\nthe nature of reservoir noise statistics.",
    "authors": [
      "Niloyendu Roy",
      "Nathan Leroux",
      "A K Sood",
      "Rajesh Ganapathy"
    ],
    "publication_date": "2021-01-21T08:55:33Z",
    "arxiv_id": "http://arxiv.org/abs/2101.08506v1",
    "download_url": "http://arxiv.org/abs/2101.08506v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A microscopic theory of Curzon-Ahlborn heat engine",
    "abstract": "Abstract The Curzon-Ahlborn (CA) efficiency, as the efficiency at the maximum\npower (EMP) of the endoreversible Carnot engine, has a significant impact on\nfinite-time thermodynamics. However, the CA engine model is based on many\nassumptions. In the past few decades, although a lot of efforts have been made,\na microscopic theory of the CA engine is still lacking. By adopting the method\nof the stochastic differential equation of energy, we formulate a microscopic\ntheory of the CA engine realized with an underdamped Brownian particle in a\nclass of non-harmonic potentials. This theory gives microscopic interpretation\nof all assumptions made by Curzon and Ahlborn, and thus puts the results about\nCA engine on a solid foundation. Also, based on this theory, we obtain\nanalytical expressions of the power and the efficiency statistics for the\nBrownian CA engine. Our research brings new perspectives to experimental\nstudies of finite-time microscopic heat engines featured with fluctuations.",
    "authors": [
      "Y. H. Chen",
      "Jin-Fu Chen",
      "Zhaoyu Fei",
      "H. T. Quan"
    ],
    "publication_date": "2021-08-09T15:50:45Z",
    "arxiv_id": "http://arxiv.org/abs/2108.04128v2",
    "download_url": "http://arxiv.org/abs/2108.04128v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Colossal power extraction from active cyclic Brownian information\n  engines",
    "abstract": "Brownian information engines can extract work from thermal fluctuations by\nutilizing information. So far, the studies on Brownian information engines\nconsider the system in a thermal bath; however, many processes in nature occur\nin a nonequilibrium setting, such as the suspensions of self-propelled\nmicroorganisms or cellular environments called an active bath. Here, we\nintroduce an archetypal model for Maxwell-demon type cyclic Brownian\ninformation engine operating in a Gaussian correlated active bath. The active\nengine can extract more work than its thermal counterpart, exceeding the bound\nset by the second law of information thermodynamics. We obtain a general\nintegral fluctuation theorem for the active engine that includes additional\nmutual information gained from the active bath with a unique effective\ntemperature. This effective description modifies the second law and provides a\nnew upper bound for the extracted work. Unlike the passive information engine\noperating in a thermal bath, the active information engine extracts colossal\npower that peaks at the finite cycle period. Our study provides fundamental\ninsights into the design and functioning of synthetic and biological submicron\nmotors in active baths under measurement and feedback control.",
    "authors": [
      "Govind Paneru",
      "Sandipan Dutta",
      "Hyuk Kyu Pak"
    ],
    "publication_date": "2022-03-25T09:48:18Z",
    "arxiv_id": "http://arxiv.org/abs/2203.13538v1",
    "download_url": "http://arxiv.org/abs/2203.13538v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SimJEB: Simulated Jet Engine Bracket Dataset",
    "abstract": "This paper introduces the Simulated Jet Engine Bracket Dataset (SimJEB): a\nnew, public collection of crowdsourced mechanical brackets and accompanying\nstructural simulations. SimJEB is applicable to a wide range of geometry\nprocessing tasks; the complexity of the shapes in SimJEB offer a challenge to\nautomated geometry cleaning and meshing, while categorical labels and\nstructural simulations facilitate classification and regression (i.e.\nengineering surrogate modeling). In contrast to existing shape collections,\nSimJEB's models are all designed for the same engineering function and thus\nhave consistent structural loads and support conditions. On the other hand,\nSimJEB models are more complex, diverse, and realistic than the synthetically\ngenerated datasets commonly used in parametric surrogate model evaluation. The\ndesigns in SimJEB were derived from submissions to the GrabCAD Jet Engine\nBracket Challenge: an open engineering design competition with over 700\nhand-designed CAD entries from 320 designers representing 56 countries. Each\nmodel has been cleaned, categorized, meshed, and simulated with finite element\nanalysis according to the original competition specifications. The result is a\ncollection of 381 diverse, high-quality and application-focused designs for\nadvancing geometric deep learning, engineering surrogate modeling, automated\ncleaning and related geometry processing tasks.",
    "authors": [
      "Eamon Whalen",
      "Azariah Beyene",
      "Caitlin Mueller"
    ],
    "publication_date": "2021-05-07T23:24:21Z",
    "arxiv_id": "http://arxiv.org/abs/2105.03534v2",
    "download_url": "http://arxiv.org/abs/2105.03534v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Development of an Undergraduate Quantum Engineering Degree",
    "abstract": "Quantum technology is exploding. Computing, communication, and sensing are\njust a few areas likely to see breakthroughs in the next few years. Worldwide,\nnational governments, industries, and universities are moving to create a new\nclass of workforce - the Quantum Engineers. Demand for such engineers is\npredicted to be in the tens of thousands within a five-year timescale. However,\nhow best to train this next generation of engineers is far from obvious.\nQuantum mechanics - long a pillar of traditional physics undergraduate degrees\n- must now be merged with traditional engineering offerings. This paper\ndiscusses the history, development, and first year of operation of the world's\nfirst undergraduate degree in quantum engineering. The main purpose of the\npaper is to inform the wider debate, now being held by many institutions\nworldwide, on how best to formally educate the Quantum Engineer.",
    "authors": [
      "A. S. Dzurak",
      "J. Epps",
      "A. Laucht",
      "R. Malaney",
      "A. Morello",
      "H. I. Nurdin",
      "J. J. Pla",
      "A. Saraiva",
      "C. H. Yang"
    ],
    "publication_date": "2021-10-25T02:10:30Z",
    "arxiv_id": "http://arxiv.org/abs/2110.12598v1",
    "download_url": "http://arxiv.org/abs/2110.12598v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effects of the self-propulsion parity on the efficiency of a\n  fuel-consuming active heat engine",
    "abstract": "We propose a thermodynamically consistent, analytically tractable model of\nsteady-state active heat engines driven by both temperature difference and a\nconstant chemical driving. While the engine follows the dynamics of the Active\nOrnstein-Uhlenbeck Particle, its self-propulsion stems from the mechanochemical\ncoupling with the fuel consumption dynamics, allowing for both even- and\nodd-parity self-propulsion forces. Using the standard methods of stochastic\nthermodynamics, we show that the entropy production of the engine satisfies the\nconventional Clausius relation, based on which we define the efficiency of the\nmodel that is bounded from above by the second law of thermodynamics. Using\nthis framework, we obtain exact expressions for the efficiency at maximum\npower. The results show that the engine performance has a nonmonotonic\ndependence on the magnitude of the chemical driving, and that the even-parity\n(odd-parity) engines perform better when the size of the engine is smaller\n(larger) than the persistence length of the active particle. We also discuss\nthe existence of a tighter upper bound on the efficiency of the odd-parity\nengines stemming from the detailed structure of the entropy production.",
    "authors": [
      "Yongjae Oh",
      "Yongjoo Baek"
    ],
    "publication_date": "2023-02-27T15:20:36Z",
    "arxiv_id": "http://arxiv.org/abs/2302.13870v2",
    "download_url": "http://arxiv.org/abs/2302.13870v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric characterization for cyclic heat engines far from equilibrium",
    "abstract": "Considerable attention has been devoted to microscopic heat engines in both\ntheoretical and experimental aspects. Notably, the fundamental limits\npertaining to power and efficiency, as well as the tradeoff relations between\nthese two quantities, have been intensively studied. This study aims to shed\nfurther light on the ultimate limits of heat engines by exploring the\nrelationship between the geometric length along the path of cyclic heat engines\noperating at arbitrary speeds and their power and efficiency. We establish a\ntradeoff relation between power and efficiency using the geometric length and\nthe timescale of the heat engine. Remarkably, because the geometric quantity\ncomprises experimentally accessible terms in classical cases, this relation is\nuseful for the inference of thermodynamic efficiency. Moreover, we reveal that\nthe power of a heat engine is always upper bounded by the product of its\ngeometric length and the statistics of energy. Our results provide a geometric\ncharacterization of the performance of cyclic heat engines, which is\nuniversally applicable to both classical and quantum heat engines operating far\nfrom equilibrium.",
    "authors": [
      "Tan Van Vu",
      "Keiji Saito"
    ],
    "publication_date": "2023-05-10T14:53:22Z",
    "arxiv_id": "http://arxiv.org/abs/2305.06219v2",
    "download_url": "http://arxiv.org/abs/2305.06219v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Imprecise Maxwell's Demon with Feedback Delay: An Exactly Solvable\n  Information Engine Model",
    "abstract": "A finite cycle time information engine based on a two-level system in contact\nwith a thermal reservoir is studied analytically. The model for the engine\nincorporates an error in measuring the system's state and time delay between\nthe measurement and the feedback process. The efficiency and power of the\nengine in steady state are derived as a function of level spacing, feedback\ndelay time, engine cycle time, and measurement error. For a fixed value of\nlevel spacing and feedback delay, there is an upper bound on measurement error\nsuch that the engine can extract positive work. This threshold value of error\nis found to be independent of the cycle time. For a range of values of level\nspacing and feedback delay time, efficiency has a non-monotonic dependence on\nthe measurement error, implying that there is an optimal measurement error for\nthe information engine to operate efficiently. At high temperatures and with\nprecise measurement, the engine's ability to extract positive work is extended\nover a larger range of feedback delay time.",
    "authors": [
      "Kiran V",
      "Toby Joseph"
    ],
    "publication_date": "2024-05-08T15:20:37Z",
    "arxiv_id": "http://arxiv.org/abs/2405.05123v2",
    "download_url": "http://arxiv.org/abs/2405.05123v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of underdamped Brownian collisional engines: New insights\n  and resonant phenomena",
    "abstract": "Collisional Brownian engines have been proposed as alternatives for\nnonequilibrium nanoscale engines. However, most studies have focused on the\nsimpler overdamped case, leaving the role of inertia much less explored. In\nthis work, we introduce the idea of collisional engines to underdamped Brownian\nparticles, where each stage is sequentially subjected to a distinct driving\nforce. A careful comparison between the performance of underdamped and\noverdamped Brownian work-to-work engines has been undertaken. The results show\nthat underdamped Brownian engines generally outperform their overdamped\ncounterparts. A key difference is the presence of a resonant regime in\nunderdamped engines, in which both efficiency and power output are enhanced\nacross a broad set of parameters. Our study highlights the importance of\ncarefully selecting dynamics and driving protocols to achieve optimal engine\nperformance.",
    "authors": [
      "Gustavo A. L. Forão",
      "Fernando S. Filho",
      "Bruno A. N. Akasaki",
      "Carlos E. Fiore"
    ],
    "publication_date": "2024-06-27T17:46:31Z",
    "arxiv_id": "http://arxiv.org/abs/2406.19365v2",
    "download_url": "http://arxiv.org/abs/2406.19365v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multiscale Discrete Dislocation Dynamics Plasticity",
    "abstract": "The Discrete Dislocation (DD) analysis and its computional modeling have been\nadvanced significantly over the past decade. This progress has been further\nmagnified by the idea to couple DD with continuum mechanics analysis in\nassociation with computational algorithms such as finite elements. This\ncoupling may pave the way to better understanding of the local response of\nmaterials at the micro scale and globally at the macroscale, increasing the\npotential for future applications in material, mechanical, structural and\nprocess engineering analyses.",
    "authors": [
      "H. M. Zbib",
      "M. Hiratani",
      "M. Shehade"
    ],
    "publication_date": "2005-09-20T23:57:45Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0509531v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0509531v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Role of the superposition principle for enhancing the efficiency of the\n  quantum-mechanical Carnot engine",
    "abstract": "A role of the superposition principle is discussed for the quantum-mechanical\nCarnot engine introduced by Bender, Brody, and Meister [J. Phys. A 33, 4427\n(2000)]. It is shown that the efficiency of the engine can be enhanced by\nsuperposition of quantum states. A finite-time process is also discussed, and\nthe condition of the maximum power output is presented. Interestingly, the\nefficiency at the maximum power is lower than that without superposition.",
    "authors": [
      "Sumiyoshi Abe",
      "Shinji Okuyama"
    ],
    "publication_date": "2012-01-03T16:35:16Z",
    "arxiv_id": "http://arxiv.org/abs/1201.0688v1",
    "download_url": "http://arxiv.org/abs/1201.0688v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magneto-strain-driven quantum engine on a graphene flake",
    "abstract": "We propose a novel conceptual design for a graphene-based quantum engine,\ndriven by a superposition of mechanical strain and an external magnetic field.\nEngineering of strain in a nanoscale graphene flake creates a gauge field with\nan associated uniform pseudo-magnetic field. The strain-induced pseudo-magnetic\nfield can be combined with a real magnetic field, leading to the emergence of\ndiscrete relativistic Landau levels within the single-particle picture. The\ninter-level distance and hence their statistical population can be modulated by\nquasi-statically tuning the magnetic field along a sequence of reversible\ntransformations that constitute a quantum mechanical analogue of the classical\nOtto cycle.",
    "authors": [
      "Francisco J. Peña",
      "Enrique Muñoz"
    ],
    "publication_date": "2015-05-15T21:41:44Z",
    "arxiv_id": "http://arxiv.org/abs/1505.04208v1",
    "download_url": "http://arxiv.org/abs/1505.04208v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling of NO sensitization of IC engines surrogate fuels auto-ignition\n  and combustion",
    "abstract": "This paper presents a new chemical kinetic model developed for the simulation\nof auto-ignition and combustion of engine surrogate fuel mixtures sensitized by\nthe presence of NOx. The chemical mechanism is based on the PRF auto-ignition\nmodel (n-heptane/iso-octane) of Buda et al. [1] and the NO/n-butane/n-pentane\nmodel of Glaude et al. [2]. The later mechanism has been taken as a reference\nfor the reactions of NOx with larger alcanes (n-heptane, iso-octane). A\ncoherent two components engine fuel surrogate mechanism has been generated\nwhich accounts for the influence of NOx on auto-ignition. The mechanism has\nbeen validated for temperatures between 700 K and 1100 K and pressures between\n1 and 10 atm covering the temperature and pressure ranges characteristic of\nengine post-oxidation thermodynamic conditions. Experiments used for validation\ninclude jet stirred reactor conditions for species evolution as a function of\ntemperature, as well as diesel HCCI engine experiments for auto-ignition delay\ntime measurements.",
    "authors": [
      "Jörg Anderlohr",
      "A. Pires Da Cruz",
      "Roda Bounaceur",
      "Frédérique Battin-Leclerc"
    ],
    "publication_date": "2009-03-25T14:25:16Z",
    "arxiv_id": "http://arxiv.org/abs/0903.4353v1",
    "download_url": "http://arxiv.org/abs/0903.4353v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Type Safe Extensible Programming",
    "abstract": "Software products evolve over time. Sometimes they evolve by adding new\nfeatures, and sometimes by either fixing bugs or replacing outdated\nimplementations with new ones. When software engineers fail to anticipate such\nevolution during development, they will eventually be forced to re-architect or\nre-build from scratch. Therefore, it has been common practice to prepare for\nchanges so that software products are extensible over their lifetimes. However,\nmaking software extensible is challenging because it is difficult to anticipate\nsuccessive changes and to provide adequate abstraction mechanisms over\npotential changes. Such extensibility mechanisms, furthermore, should not\ncompromise any existing functionality during extension. Software engineers\nwould benefit from a tool that provides a way to add extensions in a reliable\nway. It is natural to expect programming languages to serve this role.\nExtensible programming is one effort to address these issues.\n  In this thesis, we present type safe extensible programming using the MLPolyR\nlanguage. MLPolyR is an ML-like functional language whose type system provides\ntype-safe extensibility mechanisms at several levels. After presenting the\nlanguage, we will show how these extensibility mechanisms can be put to good\nuse in the context of product line engineering. Product line engineering is an\nemerging software engineering paradigm that aims to manage variations, which\noriginate from successive changes in software.",
    "authors": [
      "Wonseok Chae"
    ],
    "publication_date": "2009-10-14T16:08:29Z",
    "arxiv_id": "http://arxiv.org/abs/0910.2654v1",
    "download_url": "http://arxiv.org/abs/0910.2654v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Implementing black hole as efficient power plant",
    "abstract": "Treating the black hole molecules as working substance and considering its\nphase structure, we study the black hole heat engine by a charged anti-de\nSitter black hole. In the reduced temperature-entropy chart, it is found that\nthe work, heat, and efficiency of the engine are free of the black hole charge.\nApplying the Rankine cycle with or without a back pressure mechanism to the\nblack hole heat engine, the compact formula for the efficiency is obtained. And\nthe heat, work and efficiency are worked out. The result shows that the black\nhole engine working along the Rankine cycle with a back pressure mechanism has\na higher efficiency. This provides a novel and efficient mechanism to produce\nthe useful mechanical work, and such black hole heat engine may act as a\npossible energy source for the high energy astrophysical phenomena near the\nblack hole.",
    "authors": [
      "Shao-Wen Wei",
      "Yu-Xiao Liu"
    ],
    "publication_date": "2016-05-16T02:03:46Z",
    "arxiv_id": "http://arxiv.org/abs/1605.04629v2",
    "download_url": "http://arxiv.org/abs/1605.04629v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhanced Efficiency in Shear-Loaded Brownian Gyrators",
    "abstract": "A Brownian gyrator is a system in which a particle experiences thermal noise\nfrom two distinct heat baths. This nonequilibrium setup inherently generates a\nnonzero torque, leading to gyrating motion around a potential energy minimum.\nAs a minimal model for a heat engine, the Brownian gyrator provides valuable\ninsights into energy conversion and nonequilibrium dynamics. Here, we\ninvestigate the effect of an externally imposed shear flow on a Brownian\ngyrator, treating it as a mechanical load. The shear flow introduces a tunable\nmechanism that allows the system to operate either as a heat engine, extracting\nwork from the temperature gradient, or as a refrigerator, transferring heat\nfrom the colder to the hotter bath. Focusing on the heat engine regime, we\nanalytically derive the steady-state probability distribution to compute the\naverage torque exerted by the gyrator and quantify the mechanical power\nextracted from the shear. Our results show a remarkable increase in efficiency\ncompared to the standard Brownian gyrator without shear, approaching Carnot\nefficiency at maximum power. Surprisingly, we also find that while the system\ncan operate efficiently as a heat engine, it may become unstable before\nreaching the stall condition, highlighting a fundamental trade-off between\nefficiency and stability in shear-driven microscopic engines.",
    "authors": [
      "Iman Abdoli",
      "Abhinav Sharma",
      "Hartmut Löwen"
    ],
    "publication_date": "2025-02-26T15:30:37Z",
    "arxiv_id": "http://arxiv.org/abs/2502.19222v1",
    "download_url": "http://arxiv.org/abs/2502.19222v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A proposal of a concept for a balanced internal combustion engine\n  configuration",
    "abstract": "Conventional internal combustion engines (ICEs) inherently suffer from\nimbalances due to the reciprocating motion of their components, leading to\nvibrations, wear, and mechanical inefficiencies. In this paper, we propose a\nnovel engine configuration based on four interconnected hypocycloidal\nstraight-line mechanisms, designed to eliminate both translational force\nimbalances and torque fluctuations. We present the mechanical concept as a\nphysics problem, followed by theoretical calculations showing that the proposed\nsystem results in zero net force and torque due to its symmetric design. An\nexperimental prototype was constructed using CAD modeling and manufactured from\nacrylic glass. Measurements performed with an accelerometer confirm the\ntheoretical predictions: the engine remains stable during operation, and\nimbalances arise only when the piston synchrony is disrupted. Our results\ndemonstrate that such a configuration offers a mechanically balanced\nalternative to conventional ICE layouts, with potential applications in\nvibration-free piston-based engine designs.",
    "authors": [
      "István Gere",
      "Ovidiu-Florin Botos",
      "Liviu Ancutescu"
    ],
    "publication_date": "2025-04-11T10:28:42Z",
    "arxiv_id": "http://arxiv.org/abs/2504.08423v2",
    "download_url": "http://arxiv.org/abs/2504.08423v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Morphological, Topological and Mechanical Investigation of Gyroid,\n  Spinodoid and Dual-Lattice Algorithms as Structural Models of Trabecular Bone",
    "abstract": "In this study, we evaluate the performance of three algorithms as\ncomputational models of trabecular bone architecture, through systematic\nevaluation of morphometric, topological, and mechanical properties. Here, we\nconsider the widely-used gyroid lattice structure, the recently-developed\nspinodoid structure and a structure similar to Voronoi lattices introduced here\nas the dual-lattice. While all computational models were calibrated to recreate\nthe trabecular tissue volume (e.g., BV/TV), it was found that both the gyroid-\nand spinodoid-based structures showed substantial differences in many other\nmorphometric and topological parameters and, in turn, showed lower effective\nmechanical properties compared to trabecular bone. The newly-developed\ndual-lattice structures better captured both morphometric parameters and\nmechanical properties, despite certain differences being evident their\ntopological configuration compared to trabecular bone. Still, these\ncomputational algorithms provide useful platforms to investigate trabecular\nbone mechanics and for designing biomimetic structures, which could be produced\nthrough additive manufacturing for applications that include bone substitutes,\nscaffolds and porous implants. Furthermore, the software for the creation of\nthe structures has been added to the open source toolbox GIBBON and is\ntherefore freely available to the community.",
    "authors": [
      "Mahtab Vafaeefar",
      "Kevin M. Moerman",
      "Majid Kavousi",
      "Ted J. Vaughan"
    ],
    "publication_date": "2022-11-23T15:43:58Z",
    "arxiv_id": "http://arxiv.org/abs/2211.13036v1",
    "download_url": "http://arxiv.org/abs/2211.13036v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Landauer's Principle in a Quantum Szilard Engine Without Maxwell's Demon",
    "abstract": "Quantum Szilard engine constitutes an adequate interplay of thermodynamics,\ninformation theory and quantum mechanics. Szilard engines are in general\noperated by a Maxwell's Demon where Landauer's principle resolves the apparent\nparadoxes. Here we propose a Szilard engine setup without featuring an explicit\nMaxwell's demon. In a demonless Szilard engine, the acquisition of which-side\ninformation is not required, but erasure and the related heat dissipation still\ntake place implicitly by the very nature of the work extraction process. We see\nthat the insertion of the partition in a quantum Szilard engine does not\nlocalize the particle to one side, instead it creates a superposition state of\nthe particle being in both sides. To be able to extract work from the system,\nparticle has to be localized at one side. The localization occurs as a result\nof quantum measurement on the particle, which shows the importance of the\nmeasurement process regardless of whether one uses the acquired information or\nnot. In accordance with the Landauer's principle, localization by quantum\nmeasurement corresponds to a logically irreversible operation and for this\nreason it has to be accompanied by the corresponding heat dissipation. This\nshows the validity of the Landauer's principle even in quantum Szilard engines\nwithout Maxwell's demon. Furthermore, we take quantum confinement effects fully\ninto account to analyze the Szilard cycle in the quantum regime thoroughly and\nobtain highly accurate analytical expressions for work and heat exchanges. Our\nresults show that Landauer's principle holds the key role to understand the\nthermodynamics of the localization of the particle by quantum measurement,\nwhich explicitly saves the second law in demonless engines and shows that\nquantum-mechanical considerations are essential to reconcile thermodynamics and\ninformation theory.",
    "authors": [
      "Alhun Aydin",
      "Altug Sisman",
      "Ronnie Kosloff"
    ],
    "publication_date": "2019-08-09T16:35:20Z",
    "arxiv_id": "http://arxiv.org/abs/1908.04400v1",
    "download_url": "http://arxiv.org/abs/1908.04400v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]