[
  {
    "title": "Estimates for the number of visible galaxy-spanning civilizations and the cosmological expansion of life",
    "abstract": "If advanced civilizations appear in the universe with an ability and desire to expand, the entire universe can become saturated with life on a short timescale, even if such expanders appear rarely. Our presence in an apparently untouched Milky Way thus constrains the appearance rate of galaxy-spanning Kardashev type III (K3) civilizations, if it is assumed that some fraction of K3 civilizations will continue their expansion at intergalactic distances. We use this constraint to estimate the appearance rate of K3 civilizations for 81 cosmological scenarios by specifying the extent to which humanity is a statistical outlier. We find that in nearly all plausible scenarios, the distance to the nearest visible K3 is cosmological. In searches for K3 galaxies where the observable range is limited, we also find that the most likely detections tend to be expanding civilizations who have entered the observable range from farther away. An observation of K3 clusters is thus more likely than isolated K3 galaxies.",
    "authors": [
      "S. Jay Olson"
    ],
    "publication_date": "2015-07-21T20:03:52Z",
    "arxiv_id": "http://arxiv.org/abs/1507.05969v2",
    "download_url": "https://arxiv.org/abs/1507.05969v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some are observed, all leave traces: whole-population modeling of French elite civil servants' career paths",
    "abstract": "Elite civil servants may come and go between the public and private sectors throughout their career, a process of particular interest for the public and social scientists. However, data to document such processes are rarely completely available: we need inference tools that can account for many missing values. We consider public-private paths of elite French civil servants and introduce binary Markov switching models with Bayesian data augmentation. Our procedure relies on two complementary data sources: (1) detailed observations of some individual trajectories obtained from LinkedIn; (2) less informative ``traces'' left by all individuals in the administrative record, which we model for missing data imputation. This model class maintains the properties of hidden Markov models and enables a tailored sampler to target the posterior, yet allows for varying parameters across individuals and time. By integrating the two sources, we can consider the whole population rather than just a sample, and avoid the biases that would stem from using only a single source. We demonstrate this allows to properly test substantive hypotheses on career paths across a variety of public organizations. We notably show that the probability for ENA graduates to exit the public sector has not increased since 1990, but that the probability they return has increased. We identify three clusters of organizations, with distinct patterns of public-private behaviors.",
    "authors": [
      "Théo Voldoire",
      "Robin J. Ryder",
      "Ryan Lahfa"
    ],
    "publication_date": "2023-11-26T10:06:27Z",
    "arxiv_id": "http://arxiv.org/abs/2311.15257v3",
    "download_url": "https://arxiv.org/abs/2311.15257v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Design Ontology Supporting Model-based Systems-engineering Formalisms",
    "abstract": "Model-based systems engineering (MBSE) provides an important capability for managing the complexities of system development. MBSE empowers the formalisms of system architectures for supporting model-based requirement elicitation, specification, design, development, testing, fielding, etc. However, the modeling languages and techniques are quite heterogeneous, even within the same enterprise system, which creates difficulties for data interoperability. The discrepancies among data structures and language syntaxes make information exchange among MBSE models even more difficult, resulting in considerable information deviations when connecting data flows across the enterprise. For this reason, this paper presents an ontology based upon graphs, objects, points, properties, roles, and relationships with entensions (GOPPRRE), providing meta models that support the various lifecycle stages of MBSE formalisms. In particular, knowledge-graph models are developed to support unified model representations to further implement ontological data integration based on GOPPRRE throughout the entire lifecycle. The applicability of the MBSE formalism is verified using quantitative and qualitative approaches. Moreover, the GOPPRRE ontologies are generated from the MBSE language formalisms in a domain-specific modeling tool, \\textit{MetaGraph} in order to evaluate its availiablity. The results demonstrate that the proposed ontology supports both formal structures and the descriptive logic of the systems engineering lifecycle.",
    "authors": [
      "Lu Jinzhi",
      "Ma Junda",
      "Xiaochen Zheng",
      "Guoxin Wang",
      "Dimitris Kiritsis"
    ],
    "publication_date": "2020-10-15T09:45:35Z",
    "arxiv_id": "http://arxiv.org/abs/2010.07627v1",
    "download_url": "https://arxiv.org/abs/2010.07627v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Realistic Simulation Testbed of A Turbocharged Spark-Ignited Engine System: A Platform for the Evaluation of Fault Diagnosis Algorithms and Strategies",
    "abstract": "Research on fault diagnosis on highly nonlinear dynamic systems such as the engine of a vehicle have garnered huge interest in recent years, especially with the automotive industry heading towards self-driving technologies. This article presents a novel opensource simulation testbed of a turbocharged spark ignited (TCSI) petrol engine system for testing and evaluation of residuals generation and fault diagnosis methods. Designed and developed using Matlab/Simulink, the user interacts with the testbed using a GUI interface, where the engine can be realistically simulated using industrial-standard driving cycles such as the Worldwide harmonized Light vehicles Test Procedures (WLTP), the New European Driving Cycle (NEDC), the Extra-Urban Driving Cycle (EUDC), and EPA Federal Test Procedure (FTP-75). The engine is modeled using the mean value engine model (MVEM) and is controlled using a proportional-integral (PI)-based boost controller. The GUI interface also allows the user to induce one of the 11 faults of interest, so that their effects on the performance of the engine are better understood. This minimizes the risk of causing permanent damages to the engine and shortening its lifespan, should the tests be conducted onto the actual physical system. This simulation testbed will serve 16 as an excellent platform where researchers can generate critical data to develop and compare current and future research methods for fault diagnosis of automotive engine systems.",
    "authors": [
      "K. Y. Ng",
      "E. Frisk",
      "M. Krysander",
      "L. Eriksson"
    ],
    "publication_date": "2020-02-08T16:59:30Z",
    "arxiv_id": "http://arxiv.org/abs/2002.03201v1",
    "download_url": "https://arxiv.org/abs/2002.03201v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Affect of Software Developers: Common Misconceptions and Measurements",
    "abstract": "The study of affects (i.e., emotions, moods) in the workplace has received a lot of attention in the last 15 years. Despite the fact that software development has been shown to be intellectual, creative, and driven by cognitive activities, and that affects have a deep influence on cognitive activities, software engineering research lacks an understanding of the affects of software developers. This note provides (1) common misconceptions of affects when dealing with job satisfaction, motivation, commitment, well-being, and happiness; (2) validated measurement instruments for affect measurement; and (3) our recommendations when measuring the affects of software developers.",
    "authors": [
      "Daniel Graziotin",
      "Xiaofeng Wang",
      "Pekka Abrahamsson"
    ],
    "publication_date": "2015-05-18T09:13:49Z",
    "arxiv_id": "http://arxiv.org/abs/1505.04563v1",
    "download_url": "https://arxiv.org/abs/1505.04563v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "In Square Circle: Geometric Knowledge of the Indus Civilization",
    "abstract": "The earliest origins of mathematics in the Indian subcontinent is generally dated around 800-500 BCE when the {\\em Sulbasutras} are thought to have been written. In this article we suggest that mathematical thinking in South Asia, in particular, geometry, may have had an even earlier beginning - in the third millenium BCE. We base our hypothesis on the analysis of design patterns, such as complex space-filling tiling, seen on artifacts of the Indus Valley Civilization (also referred to as the Mature Harappan Civilization, 2500-1900 BCE) which speaks of a deep understanding of sophisticated geometric principles.",
    "authors": [
      "Sitabhra Sinha",
      "Nisha Yadav",
      "Mayank N. Vahia"
    ],
    "publication_date": "2011-12-29T06:02:40Z",
    "arxiv_id": "http://arxiv.org/abs/1112.6232v1",
    "download_url": "https://arxiv.org/abs/1112.6232v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Artificial neural networks in calibration of nonlinear mechanical models",
    "abstract": "Rapid development in numerical modelling of materials and the complexity of new models increases quickly together with their computational demands. Despite the growing performance of modern computers and clusters, calibration of such models from noisy experimental data remains a nontrivial and often computationally exhaustive task. The layered neural networks thus represent a robust and efficient technique to overcome the time-consuming simulations of a calibrated model. The potential of neural networks consists in simple implementation and high versatility in approximating nonlinear relationships. Therefore, there were several approaches proposed to accelerate the calibration of nonlinear models by neural networks. This contribution reviews and compares three possible strategies based on approximating (i) model response, (ii) inverse relationship between the model response and its parameters and (iii) error function quantifying how well the model fits the data. The advantages and drawbacks of particular strategies are demonstrated on the calibration of four parameters of the affinity hydration model from simulated data as well as from experimental measurements. This model is highly nonlinear, but computationally cheap thus allowing its calibration without any approximation and better quantification of results obtained by the examined calibration strategies. The paper can be thus viewed as a guide intended for the engineers to help them select an appropriate strategy in their particular calibration problems.",
    "authors": [
      "Tomáš Mareš",
      "Eliška Janouchová",
      "Anna Kučerová"
    ],
    "publication_date": "2015-02-04T22:24:35Z",
    "arxiv_id": "http://arxiv.org/abs/1502.01380v2",
    "download_url": "https://arxiv.org/abs/1502.01380v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Looking Beyond Content: Skill development for engineers",
    "abstract": "Current concerns over reforming engineering education have focused attention on helping students develop skills and an adaptive expertise. Phenomenological guidelines for instruction along these lines can be understood as arising out of an emerging theory of thinking and learning built on results in the neural, cognitive, and behavioral sciences. We outline this framework and consider some of its implications for one example: developing a more detailed understanding of the specific skill of using mathematics in modeling physical situations. This approach provides theoretical underpinnings for some best-practice instructional methods designed to help students develop this skill and providesguidance for further research in the area.",
    "authors": [
      "Edward F. Redish",
      "Karl A. Smith"
    ],
    "publication_date": "2008-02-20T21:49:20Z",
    "arxiv_id": "http://arxiv.org/abs/0802.2950v1",
    "download_url": "https://arxiv.org/abs/0802.2950v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gain-loss-engineering: a new platform for extreme anisotropic thermal photon tunneling",
    "abstract": "We explore a novel approach to achieving anisotropic thermal photon tunneling, inspired by the concept of parity-time symmetry in quantum physics. Our method leverages the modulation of constitutive optical parameters, oscillating between loss and gain regimes. This modulation reveals a variety of distinct effects in thermal photon behavior and dispersion. Specifically, we identify complex tunneling modes through gain-loss engineering, which include thermal photonic defect states and Fermi-arc-like phenomena, which surpass those achievable through traditional polariton engineering. Our research also elucidates the laws governing the evolution of radiative energy in the presence of gain and loss interactions, and highlights the unexpected inefficacy of gain in enhancing thermal photon energy transport compared to systems characterized solely by loss. This study not only broadens our understanding of thermal photon tunneling but also establishes a versatile platform for manipulating photon energy transport, with potential applications in thermal management, heat science, and the development of advanced energy devices.",
    "authors": [
      "Cheng-Long Zhou",
      "Yu-Chen Peng",
      "Yong Zhang",
      "Hong-Liang Yi",
      "Mauro Antezza",
      "Vincenzo Galdi"
    ],
    "publication_date": "2024-05-25T07:48:07Z",
    "arxiv_id": "http://arxiv.org/abs/2405.16109v1",
    "download_url": "https://arxiv.org/abs/2405.16109v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding the role of single-board computers in engineering and computer science education: A systematic literature review",
    "abstract": "In the last decade, Single-Board Computers (SBCs) have been employed more frequently in engineering and computer science both to technical and educational levels. Several factors such as the versatility, the low-cost, and the possibility to enhance the learning process through technology have contributed to the educators and students usually employ these devices. However, the implications, possibilities, and constraints of these devices in engineering and Computer Science (CS) education have not been explored in detail. In this systematic literature review, we explore how the SBCs are employed in engineering and computer science and what educational results are derived from their usage in the period 2010-2020 at tertiary education. For that, 154 studies were selected out of n=605 collected from the academic databases Ei Compendex, ERIC, and Inspec. The analysis was carried-out in two phases, identifying, e.g., areas of application, learning outcomes, and students and researchers' perceptions. The results mainly indicate the following aspects: (1) The areas of laboratories and e-learning, computing education, robotics, Internet of Things (IoT), and persons with disabilities gather the studies in the review. (2) Researchers highlight the importance of the SBCs to transform the curricula in engineering and CS for the students to learn complex topics through experimentation in hands-on activities. (3) The typical cognitive learning outcomes reported by the authors are the improvement of the students' grades and the technical skills regarding the topics in the courses. Concerning the affective learning outcomes, the increase of interest, motivation, and engagement are commonly reported by the authors.",
    "authors": [
      "Jonathan Álvarez Ariza",
      "Heyson Baez"
    ],
    "publication_date": "2022-03-30T18:34:03Z",
    "arxiv_id": "http://arxiv.org/abs/2203.16604v1",
    "download_url": "https://arxiv.org/abs/2203.16604v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards a Systems Engineering based Automotive Product Engineering Process",
    "abstract": "Deficit and redundancies in existing automotive product development hinder a systems engineering based development. In this paper we discuss a methodical procedure to eliminate deficits in the current product development and in turn to enable the introduction of a new systems engineering based development methodology. As the core part of our approach, we discuss how to transform an opaque heterogeneous product development to a homogenous consistent product development taking into account existing disciplines. Our approach paves the way to achieve a process structure that is more amenable to verification and validation. We show the effectiveness of our proposed solution approach on an automotive use case.",
    "authors": [
      "Hassan Hage",
      "Vahid Hashemi",
      "Frank Mantwill"
    ],
    "publication_date": "2020-07-23T10:08:42Z",
    "arxiv_id": "http://arxiv.org/abs/2007.11897v1",
    "download_url": "https://arxiv.org/abs/2007.11897v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Capabilities for Better ML Engineering",
    "abstract": "In spite of machine learning's rapid growth, its engineering support is scattered in many forms, and tends to favor certain engineering stages, stakeholders, and evaluation preferences. We envision a capability-based framework, which uses fine-grained specifications for ML model behaviors to unite existing efforts towards better ML engineering. We use concrete scenarios (model design, debugging, and maintenance) to articulate capabilities' broad applications across various different dimensions, and their impact on building safer, more generalizable and more trustworthy models that reflect human needs. Through preliminary experiments, we show capabilities' potential for reflecting model generalizability, which can provide guidance for ML engineering process. We discuss challenges and opportunities for capabilities' integration into ML engineering.",
    "authors": [
      "Chenyang Yang",
      "Rachel Brower-Sinning",
      "Grace A. Lewis",
      "Christian Kästner",
      "Tongshuang Wu"
    ],
    "publication_date": "2022-11-11T18:50:21Z",
    "arxiv_id": "http://arxiv.org/abs/2211.06409v2",
    "download_url": "https://arxiv.org/abs/2211.06409v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "AppealCase: A Dataset and Benchmark for Civil Case Appeal Scenarios",
    "abstract": "Recent advances in LegalAI have primarily focused on individual case judgment analysis, often overlooking the critical appellate process within the judicial system. Appeals serve as a core mechanism for error correction and ensuring fair trials, making them highly significant both in practice and in research. To address this gap, we present the AppealCase dataset, consisting of 10,000 pairs of real-world, matched first-instance and second-instance documents across 91 categories of civil cases. The dataset also includes detailed annotations along five dimensions central to appellate review: judgment reversals, reversal reasons, cited legal provisions, claim-level decisions, and whether there is new information in the second instance. Based on these annotations, we propose five novel LegalAI tasks and conduct a comprehensive evaluation across 20 mainstream models. Experimental results reveal that all current models achieve less than 50% F1 scores on the judgment reversal prediction task, highlighting the complexity and challenge of the appeal scenario. We hope that the AppealCase dataset will spur further research in LegalAI for appellate case analysis and contribute to improving consistency in judicial decision-making.",
    "authors": [
      "Yuting Huang",
      "Meitong Guo",
      "Yiquan Wu",
      "Ang Li",
      "Xiaozhong Liu",
      "Keting Yin",
      "Changlong Sun",
      "Fei Wu",
      "Kun Kuang"
    ],
    "publication_date": "2025-05-22T10:50:33Z",
    "arxiv_id": "http://arxiv.org/abs/2505.16514v2",
    "download_url": "https://arxiv.org/abs/2505.16514v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A mismatch between self-efficacy and performance: Undergraduate women in engineering tend to have lower self-efficacy despite earning higher grades than men",
    "abstract": "There is a significant underrepresentation of women in many Science, Technology, Engineering, and Mathematics (STEM) majors and careers. Prior research has shown that self-efficacy can be a critical factor in student learning, and that there is a tendency for women to have lower self-efficacy than men in STEM disciplines. This study investigates gender differences in the relationship between engineering students' self-efficacy and course grades in foundational courses. By focusing on engineering students, we examined these gender differences simultaneously in four STEM disciplines (mathematics, engineering, physics, and chemistry) among the same population. Using survey data collected longitudinally at three time points and course grade data from five cohorts of engineering students at a large US-based research university, effect sizes of gender differences are calculated using Cohen's d on two measures: responses to survey items on discipline-specific self-efficacy and course grades in all first-year foundational courses and second-year mathematics courses. In engineering, physics, and mathematics courses, we find sizeable discrepancies between self-efficacy and performance, with men appearing significantly more confident than women despite small or reverse direction differences in grades. In chemistry, women earn higher grades and have higher self-efficacy. The patterns are consistent across courses within each discipline. All self-efficacy gender differences close by the fourth year except physics self-efficacy. The disconnect between self-efficacy and course grades across subjects provides useful clues for targeted interventions to promote equitable learning environments. The most extreme disconnect occurs in physics and may help explain the severe underrepresentation of women in \"physics-heavy\" engineering disciplines, highlighting the importance of such interventions.",
    "authors": [
      "Kyle M. Whitcomb",
      "Z. Yasemin Kalender",
      "Timothy J. Nokes-Malach",
      "Christian D. Schunn",
      "Chandralekha Singh"
    ],
    "publication_date": "2020-03-12T20:25:40Z",
    "arxiv_id": "http://arxiv.org/abs/2003.06006v1",
    "download_url": "https://arxiv.org/abs/2003.06006v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generative Software Engineering",
    "abstract": "The rapid development of deep learning techniques, improved computational power, and the availability of vast training data have led to significant advancements in pre-trained models and large language models (LLMs). Pre-trained models based on architectures such as BERT and Transformer, as well as LLMs like ChatGPT, have demonstrated remarkable language capabilities and found applications in Software engineering. Software engineering tasks can be divided into many categories, among which generative tasks are the most concern by researchers, where pre-trained models and LLMs possess powerful language representation and contextual awareness capabilities, enabling them to leverage diverse training data and adapt to generative tasks through fine-tuning, transfer learning, and prompt engineering. These advantages make them effective tools in generative tasks and have demonstrated excellent performance. In this paper, we present a comprehensive literature review of generative tasks in SE using pre-trained models and LLMs. We accurately categorize SE generative tasks based on software engineering methodologies and summarize the advanced pre-trained models and LLMs involved, as well as the datasets and evaluation metrics used. Additionally, we identify key strengths, weaknesses, and gaps in existing approaches, and propose potential research directions. This review aims to provide researchers and practitioners with an in-depth analysis and guidance on the application of pre-trained models and LLMs in generative tasks within SE.",
    "authors": [
      "Yuan Huang",
      "Yinan Chen",
      "Xiangping Chen",
      "Junqi Chen",
      "Rui Peng",
      "Zhicao Tang",
      "Jinbo Huang",
      "Furen Xu",
      "Zibin Zheng"
    ],
    "publication_date": "2024-03-05T01:37:37Z",
    "arxiv_id": "http://arxiv.org/abs/2403.02583v2",
    "download_url": "https://arxiv.org/abs/2403.02583v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Review of Vibration-Based Damage Detection in Civil Structures: From Traditional Methods to Machine Learning and Deep Learning Applications",
    "abstract": "Monitoring structural damage is extremely important for sustaining and preserving the service life of civil structures. While successful monitoring provides resolute and staunch information on the health, serviceability, integrity and safety of structures; maintaining continuous performance of a structure depends highly on monitoring the occurrence, formation and propagation of damage. Damage may accumulate on structures due to different environmental and human-induced factors. Numerous monitoring and detection approaches have been developed to provide practical means for early warning against structural damage or any type of anomaly. Considerable effort has been put into vibration-based methods, which utilize the vibration response of the monitored structure to assess its condition and identify structural damage. Meanwhile, with emerging computing power and sensing technology in the last decade, Machine Learning (ML) and especially Deep Learning (DL) algorithms have become more feasible and extensively used in vibration-based structural damage detection with elegant performance and often with rigorous accuracy. While there have been multiple review studies published on vibration-based structural damage detection, there has not been a study where the transition from traditional methods to ML and DL methods are described and discussed. This paper aims to fulfill this gap by presenting the highlights of the traditional methods and provide a comprehensive review of the most recent applications of ML and DL algorithms utilized for vibration-based structural damage detection in civil structures.",
    "authors": [
      "Onur Avci",
      "Osama Abdeljaber",
      "Serkan Kiranyaz",
      "Mohammed Hussein",
      "Moncef Gabbouj",
      "Daniel J. Inman"
    ],
    "publication_date": "2020-04-09T05:39:21Z",
    "arxiv_id": "http://arxiv.org/abs/2004.04373v1",
    "download_url": "https://arxiv.org/abs/2004.04373v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Should there be more women in science and engineering?",
    "abstract": "Many people hold this truth to be self-evident, that there should be more female students in science and engineering. Typical arguments include possible benefits to women, possible benefits to the economy, and the unfairness of the current female under-representation. However, these justifications are never explicitly and thoroughly presented. Clearly stating and scrutinizing them, we show that they in fact have logical flaws. When made consistent, these arguments do not unconditionally justify enrolling more women in scientific disciplines. In particular, what women want must be taken into account. Outreach programs towards K-12 girls must therefore purport to allow them to choose a field freely, rather than try to draw as many of them to scientific disciplines as possible. This change of mindset must be accompanied by a close examination of the purpose and effects of these programs.\n  Keywords: female students, higher education, university, ethics, policy, outreach programs, minority students",
    "authors": [
      "Mathieu Bouville"
    ],
    "publication_date": "2006-11-09T19:48:47Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0611089v3",
    "download_url": "https://arxiv.org/abs/physics/0611089v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Development of formal models, algorithms, procedures, engineering and functioning of the software system \"Instrumental complex for ontological engineering purpose\"",
    "abstract": "The given paper considered a generalized model representation of the software system \"Instrumental complex for ontological engineering purpose\". Represented complete software system development process. Developed relevant formal models of the software system \"Instrumental complex for ontological engineering purpose\", represented as mathematical expressions, UML diagrams, and also described the three-tier architecture of the software system \"Instrumental complex for ontological engineering purpose\" in a client-server environment.",
    "authors": [
      "A. V. Palagin",
      "N. G. Petrenko",
      "V. Yu. Velychko",
      "K. S. Malakhov"
    ],
    "publication_date": "2018-03-24T07:14:00Z",
    "arxiv_id": "http://arxiv.org/abs/1803.10684v2",
    "download_url": "https://arxiv.org/abs/1803.10684v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering solutions for non-stationary gas pipeline reconstruction and emergency management",
    "abstract": "The reconstruction, management, and optimization of gas pipelines is of significant importance for solving modern engineering problems. This paper presents innovative methodologies aimed at the effective reconstruction of gas pipelines under unstable conditions. The research encompasses the application of machine learning and optimization algorithms, targeting the enhancement of system reliability and the optimization of interventions during emergencies. The findings of the study present engineering solutions aimed at addressing the challenges in real-world applications by comparing the performance of various algorithms. Consequently, this work contributes to the advancement of cutting-edge approaches in the field of engineering and opens new perspectives for future research. A highly reliable and efficient technological Figure has been proposed for managing emergency processes in gas transportation based on the principles of the reconstruction phase. For complex gas pipeline systems, new approaches have been investigated for the modernization of existing control process monitoring systems. These approaches are based on modern achievements in control theory and information technology, aiming to select emergency and technological modes. One of the pressing issues is to develop a method to minimize the transmission time of measured and controlled data on non-stationary flow parameters of gas networks to dispatcher control centers. Therefore, the reporting Figures obtained for creating a reliable information base for dispatcher centers using modern methods to efficiently manage the gas dynamic processes of non-stationary modes are of particular importance.",
    "authors": [
      "Ilgar Aliyev"
    ],
    "publication_date": "2025-04-09T14:05:44Z",
    "arxiv_id": "http://arxiv.org/abs/2504.06904v1",
    "download_url": "https://arxiv.org/abs/2504.06904v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Essence Theory of Software Engineering - Large-Scale Classroom Experiences from 450+ Software Engineering BSc Students",
    "abstract": "Software Engineering as an industry is highly diverse in terms of development methods and practices. Practitioners employ a myriad of methods and tend to further tailor them by e.g. omitting some practices or rules. This diversity in development methods poses a challenge for software engineering education, creating a gap between education and industry. General theories such as the Essence Theory of Software Engineering can help bridge this gap by presenting software engineering students with higher-level frameworks upon which to build an understanding of software engineering methods and practical project work. In this paper, we study Essence in an educational setting to evaluate its usefulness for software engineering students while also investigating barriers to its adoption in this context. To this end, we observe 102 student teams utilize Essence in practical software engineering projects during a semester long, project-based course.",
    "authors": [
      "Kai-Kristian Kemell",
      "Anh Nguyen-Duc",
      "Xiaofeng Wang",
      "Juhanki Risku",
      "Pekka Abrahamsson"
    ],
    "publication_date": "2018-09-24T10:11:32Z",
    "arxiv_id": "http://arxiv.org/abs/1809.08827v1",
    "download_url": "https://arxiv.org/abs/1809.08827v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Identifying relevant Factors of Requirements Quality: an industrial Case Study",
    "abstract": "[Context and Motivation]: The quality of requirements specifications impacts subsequent, dependent software engineering activities. Requirements quality defects like ambiguous statements can result in incomplete or wrong features and even lead to budget overrun or project failure. [Problem]: Attempts at measuring the impact of requirements quality have been held back by the vast amount of interacting factors. Requirements quality research lacks an understanding of which factors are relevant in practice. [Principal Ideas and Results]: We conduct a case study considering data from both interview transcripts and issue reports to identify relevant factors of requirements quality. The results include 17 factors and 11 interaction effects relevant to the case company. [Contribution]: The results contribute empirical evidence that (1) strengthens existing requirements engineering theories and (2) advances industry-relevant requirements quality research.",
    "authors": [
      "Julian Frattini"
    ],
    "publication_date": "2024-02-01T13:45:06Z",
    "arxiv_id": "http://arxiv.org/abs/2402.00594v2",
    "download_url": "https://arxiv.org/abs/2402.00594v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Guidelines for Systematic Mapping Studies in Security Engineering",
    "abstract": "Security engineering in the software lifecycle aims at protecting information and systems to guarantee confidentiality, integrity, and availability. As security engineering matures and the number of research papers grows, there is an increasing need for papers that summarize results and provide an overview of the area. A systematic mapping study \"maps\" a research area by classifying papers to identify which topics are well-studied and which need additional study. Therefore, systematic mapping studies are becoming increasingly important in security engineering. This chapter provides methodological support for systematic mapping studies in security engineering based on examples from published security engineering papers. Because security engineering is similar to software engineering in that it bridges research and practice, researchers can use the same basic systematic mapping process, as follows: (1) study planning, (2) searching for studies, (3) study selection, (4) study quality assessment, (5) data extraction, (6) data classification, (7) data analysis, and (8) reporting of results. We use published mapping studies to describe the tailoring of this process for security engineering. In addition to guidance on how to perform systematic mapping studies in security engineering, this chapter should increase awareness in the security engineering community of the need for additional mapping studies.",
    "authors": [
      "Michael Felderer",
      "Jeffrey C. Carver"
    ],
    "publication_date": "2018-01-21T12:12:35Z",
    "arxiv_id": "http://arxiv.org/abs/1801.06810v1",
    "download_url": "https://arxiv.org/abs/1801.06810v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Agile Software Engineering and Systems Engineering at SKA Scale",
    "abstract": "Systems Engineering (SE) is the set of processes and documentation required for successfully realising large-scale engineering projects, but the classical approach is not a good fit for software-intensive projects, especially when the needs of the different stakeholders are not fully known from the beginning, and requirement priorities might change. The SKA is the ultimate software-enabled telescope, with enormous amounts of computing hardware and software required to perform its data reduction. We give an overview of the system and software engineering processes in the SKA1 development, and the tension between classical and agile SE.",
    "authors": [
      "Juande Santander-Vela"
    ],
    "publication_date": "2017-11-30T20:20:42Z",
    "arxiv_id": "http://arxiv.org/abs/1712.00061v2",
    "download_url": "https://arxiv.org/abs/1712.00061v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Limits of Detecting Extraterrestrial Civilizations",
    "abstract": "The search for extraterrestrial intelligence (SETI) is a scientific endeavor which struggles with unique issues -- a strong indeterminacy in what data to look for and when to do so. This has led to attempts at finding both fundamental limits of the communication between extraterrestrial intelligence and human civilizations, as well as benchmarks so as to predict what kinds of signals we might most expect. Previous work has been formulated in terms of the information-theoretic task of communication, but we instead argue it should be viewed as a detection problem, specifically one-shot (asymmetric) hypothesis testing. With this new interpretation, we develop fundamental limits as well as provide simple examples of how to use this framework to analyze and benchmark different possible signals from extraterrestrial civilizations. We show that electromagnetic signaling for detection requires much less power than for communication, that detection as a function of power can be non-linear, and that much of the analysis in this framework may be addressed using computationally efficient optimization problems, thereby demonstrating tools for further inquiry.",
    "authors": [
      "Ian George",
      "Xinan Chen",
      "Lav R. Varshney"
    ],
    "publication_date": "2021-07-20T22:53:00Z",
    "arxiv_id": "http://arxiv.org/abs/2107.09794v1",
    "download_url": "https://arxiv.org/abs/2107.09794v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Digital Twins for Software Engineering Processes",
    "abstract": "Digital twins promise a better understanding and use of complex systems. To this end, they represent these systems at their runtime and may interact with them to control their processes. Software engineering is a wicked challenge in which stakeholders from many domains collaborate to produce software artifacts together. In the presence of skilled software engineer shortage, our vision is to leverage DTs as means for better rep- resenting, understanding, and optimizing software engineering processes to (i) enable software experts making the best use of their time and (ii) support domain experts in producing high-quality software. This paper outlines why this would be beneficial, what such a digital twin could look like, and what is missing for realizing and deploying software engineering digital twins.",
    "authors": [
      "Robin Kimmel",
      "Judith Michael",
      "Andreas Wortmann",
      "Jingxi Zhang"
    ],
    "publication_date": "2025-10-07T10:39:22Z",
    "arxiv_id": "http://arxiv.org/abs/2510.05768v1",
    "download_url": "https://arxiv.org/abs/2510.05768v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Are Delayed Issues Harder to Resolve? Revisiting Cost-to-Fix of Defects throughout the Lifecycle",
    "abstract": "Many practitioners and academics believe in a delayed issue effect (DIE); i.e. the longer an issue lingers in the system, the more effort it requires to resolve. This belief is often used to justify major investments in new development processes that promise to retire more issues sooner.\n  This paper tests for the delayed issue effect in 171 software projects conducted around the world in the period from 2006--2014. To the best of our knowledge, this is the largest study yet published on this effect. We found no evidence for the delayed issue effect; i.e. the effort to resolve issues in a later phase was not consistently or substantially greater than when issues were resolved soon after their introduction.\n  This paper documents the above study and explores reasons for this mismatch between this common rule of thumb and empirical data. In summary, DIE is not some constant across all projects. Rather, DIE might be an historical relic that occurs intermittently only in certain kinds of projects. This is a significant result since it predicts that new development processes that promise to faster retire more issues will not have a guaranteed return on investment (depending on the context where applied), and that a long-held truth in software engineering should not be considered a global truism.",
    "authors": [
      "Tim Menzies",
      "William Nichols",
      "Forrest Shull",
      "Lucas Layman"
    ],
    "publication_date": "2016-09-16T00:14:32Z",
    "arxiv_id": "http://arxiv.org/abs/1609.04886v1",
    "download_url": "https://arxiv.org/abs/1609.04886v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interconnected Linguistic Architecture",
    "abstract": "The context of the reported research is the documentation of software technologies such as object/relational mappers, web-application frameworks, or code generators. We assume that documentation should model a macroscopic view on usage scenarios of technologies in terms of involved artifacts, leveraged software languages, data flows, conformance relationships, and others. In previous work, we referred to such documentation also as 'linguistic architecture'. The corresponding models may also be referred to as 'megamodels' while adopting this term from the technological space of modeling/model-driven engineering.\nThis work is an inquiry into making such documentation less abstract and more effective by means of connecting (mega)models, systems, and developer experience in several ways.\nTo this end, we adopt an approach that is primarily based on prototyping (i.e., implementa- tion of a megamodeling infrastructure with all conceivable connections) and experimentation with showcases (i.e., documentation of concrete software technologies).\nThe knowledge gained by this research is a notion of interconnected linguistic architecture on the grounds of connecting primary model elements, inferred model elements, static and runtime system artifacts, traceability links, system contexts, knowledge resources, plugged interpretations of model elements, and IDE views. A corresponding suite of aspects of interconnected linguistic architecture is systematically described.\nAs to the grounding of this research, we describe a literature survey which tracks scattered occurrences and thus demonstrates the relevance of the identified aspects of interconnected linguistic architecture. Further, we describe the MegaL/Xtext+IDE infrastructure which realizes interconnected linguistic architecture.\nThe importance of this work lies in providing more formal (ontologically rich, navigable, verifiable) documentation of software technologies helping developers to better understand how to use technologies in new systems (prescriptive mode) or how technologies are used in existing systems (descriptive mode).",
    "authors": [
      "Johannes Härtel",
      "Lukas Härtel",
      "Ralf Lämmel",
      "Andrei Varanovich",
      "Marcel Heinz"
    ],
    "publication_date": "2017-01-27T17:17:11Z",
    "arxiv_id": "http://arxiv.org/abs/1701.08122v1",
    "download_url": "https://arxiv.org/abs/1701.08122v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deep Learning-based Software Engineering: Progress, Challenges, and Opportunities",
    "abstract": "Researchers have recently achieved significant advances in deep learning techniques, which in turn has substantially advanced other research disciplines, such as natural language processing, image processing, speech recognition, and software engineering. Various deep learning techniques have been successfully employed to facilitate software engineering tasks, including code generation, software refactoring, and fault localization. Many papers have also been presented in top conferences and journals, demonstrating the applications of deep learning techniques in resolving various software engineering tasks. However, although several surveys have provided overall pictures of the application of deep learning techniques in software engineering, they focus more on learning techniques, that is, what kind of deep learning techniques are employed and how deep models are trained or fine-tuned for software engineering tasks. We still lack surveys explaining the advances of subareas in software engineering driven by deep learning techniques, as well as challenges and opportunities in each subarea. To this end, in this paper, we present the first task-oriented survey on deep learning-based software engineering. It covers twelve major software engineering subareas significantly impacted by deep learning techniques. Such subareas spread out the through the whole lifecycle of software development and maintenance, including requirements engineering, software development, testing, maintenance, and developer collaboration. As we believe that deep learning may provide an opportunity to revolutionize the whole discipline of software engineering, providing one survey covering as many subareas as possible in software engineering can help future research push forward the frontier of deep learning-based software engineering more systematically.",
    "authors": [
      "Xiangping Chen",
      "Xing Hu",
      "Yuan Huang",
      "He Jiang",
      "Weixing Ji",
      "Yanjie Jiang",
      "Yanyan Jiang",
      "Bo Liu",
      "Hui Liu",
      "Xiaochen Li",
      "Xiaoli Lian",
      "Guozhu Meng",
      "Xin Peng",
      "Hailong Sun",
      "Lin Shi",
      "Bo Wang",
      "Chong Wang",
      "Jiayi Wang",
      "Tiantian Wang",
      "Jifeng Xuan",
      "Xin Xia",
      "Yibiao Yang",
      "Yixin Yang",
      "Li Zhang",
      "Yuming Zhou",
      "Lu Zhang"
    ],
    "publication_date": "2024-10-17T00:46:00Z",
    "arxiv_id": "http://arxiv.org/abs/2410.13110v1",
    "download_url": "https://arxiv.org/abs/2410.13110v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering Trustworthy Software: A Mission for LLMs",
    "abstract": "LLMs are transforming software engineering by accelerating development, reducing complexity, and cutting costs. When fully integrated into the software lifecycle they will drive design, development and deployment while facilitating early bug detection, continuous improvement, and rapid resolution of critical issues. However, trustworthy LLM-driven software engineering requires addressing multiple challenges such as accuracy, scalability, bias, and explainability.",
    "authors": [
      "Marco Vieira"
    ],
    "publication_date": "2024-11-27T01:30:44Z",
    "arxiv_id": "http://arxiv.org/abs/2411.17981v1",
    "download_url": "https://arxiv.org/abs/2411.17981v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ArduCode: Predictive Framework for Automation Engineering",
    "abstract": "Automation engineering is the task of integrating, via software, various sensors, actuators, and controls for automating a real-world process. Today, automation engineering is supported by a suite of software tools including integrated development environments (IDE), hardware configurators, compilers, and runtimes. These tools focus on the automation code itself, but leave the automation engineer unassisted in their decision making. This can lead to increased time for software development because of imperfections in decision making leading to multiple iterations between software and hardware. To address this, this paper defines multiple challenges often faced in automation engineering and propose solutions using machine learning to assist engineers tackle such challenges. We show that machine learning can be leveraged to assist the automation engineer in classifying automation, finding similar code snippets, and reasoning about the hardware selection of sensors and actuators. We validate our architecture on two real datasets consisting of 2,927 Arduino projects, and 683 Programmable Logic Controller (PLC) projects. Our results show that paragraph embedding techniques can be utilized to classify automation using code snippets with precision close to human annotation, giving an F1-score of 72%. Further, we show that such embedding techniques can help us find similar code snippets with high accuracy. Finally, we use autoencoder models for hardware recommendation and achieve a p@3 of 0.79 and p@5 of 0.95.",
    "authors": [
      "Arquimedes Canedo",
      "Palash Goyal",
      "Di Huang",
      "Amit Pandey",
      "Gustavo Quiros"
    ],
    "publication_date": "2019-09-06T20:19:05Z",
    "arxiv_id": "http://arxiv.org/abs/1909.04503v4",
    "download_url": "https://arxiv.org/abs/1909.04503v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Team Composition in Software Engineering Education",
    "abstract": "One of the objectives of software engineering education is to make students to learn essential teamwork skills. This is done by having the students work in groups for course assignments. Student team composition plays a vital role in this, as it significantly affects learning outcomes, what is learned, and how. The study presented in this paper aims to better understand the student team composition in software engineering education and investigate the factors affecting it in the international software engineering education context. Those factors should be taken into consideration by software engineering teachers when they design group work assignments in their courses. In this paper, the initial findings of the ongoing Action research study are presented. The results give some identified principles that should be considered when designing student team composition in software engineering courses.",
    "authors": [
      "Sajid Ibrahim Hashmi",
      "Jouni Markkula"
    ],
    "publication_date": "2023-06-14T11:00:05Z",
    "arxiv_id": "http://arxiv.org/abs/2306.08431v1",
    "download_url": "https://arxiv.org/abs/2306.08431v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuous Software Engineering in the Wild",
    "abstract": "Software is becoming a critical component of most products and organizational functions. The ability to continuously improve software determines how well the organization can respond to market opportunities. Continuous software engineering promises numerous advantages over sprint-based or plan-driven development. However, implementing a continuous software engineering pipeline in an existing organization is challenging.\n  In this invited position paper, we discuss the adoption challenges and argue for a more systematic methodology to drive the adoption of continuous engineering. Our discussion is based on ongoing work with several industrial partners as well as experience reported in both state-of-practice and state-of-the-art.\n  We conclude that the adoption of continuous software engineering primarily requires analysis of the organization, its goals, and constraints. One size does not fit all purposes, meaning that many of the principles behind continuous engineering are relevant for most organizations, but the level of realization and the benefits may still vary. The main hindrances to continuous flow of software arise from sub-optimal organizational structures and the lack of alignment. Once those are removed, the organization can implement automation to further improve the software delivery.",
    "authors": [
      "Eriks Klotins",
      "Tony Gorschek"
    ],
    "publication_date": "2022-03-23T13:39:31Z",
    "arxiv_id": "http://arxiv.org/abs/2203.12409v2",
    "download_url": "https://arxiv.org/abs/2203.12409v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Process Algebra Software Engineering Environment",
    "abstract": "In previous work we described how the process algebra based language PSF can be used in software engineering, using the ToolBus, a coordination architecture also based on process algebra, as implementation model. In this article we summarize that work and describe the software development process more formally by presenting the tools we use in this process in a CASE setting, leading to the PSF-ToolBus software engineering environment. We generalize the refine step in this environment towards a process algebra based software engineering workbench of which several instances can be combined to form an environment.",
    "authors": [
      "B. Diertens"
    ],
    "publication_date": "2008-06-17T09:20:54Z",
    "arxiv_id": "http://arxiv.org/abs/0806.2730v1",
    "download_url": "https://arxiv.org/abs/0806.2730v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spreadsheet Engineering: A Research Framework",
    "abstract": "Spreadsheet engineering adapts the lessons of software engineering to spreadsheets, providing eight principles as a framework for organizing spreadsheet programming recommendations. Spreadsheets raise issues inadequately addressed by software engineering. Spreadsheets are a powerful modeling language, allowing strategic rapid model change, and enabling exploratory modeling. Spreadsheets users learn slowly with experience because they focus on the problem domain not programming. The heterogeneity of spreadsheet users requires a taxonomy to guide recommendations. Deployment of best practices is difficult and merits research.",
    "authors": [
      "Thomas A. Grossman"
    ],
    "publication_date": "2007-11-04T19:24:57Z",
    "arxiv_id": "http://arxiv.org/abs/0711.0538v1",
    "download_url": "https://arxiv.org/abs/0711.0538v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Brief Overview of Novel Approaches in Designing High Performance VCOs",
    "abstract": "Not only a voltage controlled oscillator (VCO) is one of the most significant component of every telecommunication system, but also it has been widely used in many other high-speed systems. In fact, a VCO has an important role in system operation, in other word, VCO is the heart of a system which gives existence to it. Nowadays, designing a high performance VCO for different applications is a challenging task for engineers. Moreover, up to now many designs and solutions have been proposed by the scientists to improve the performance of VCOs to be exploited in different cutting-edge applications. In this paper I will give a brief overview of the new techniques in designing high performance VCOs. Furthermore, the results of the proposed solutions have been compared with each other to see which method has advantages over the others.",
    "authors": [
      "Omid Reyhani-Galangashi"
    ],
    "publication_date": "2018-12-14T17:06:24Z",
    "arxiv_id": "http://arxiv.org/abs/1812.06029v1",
    "download_url": "https://arxiv.org/abs/1812.06029v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Business Maturity Model of Software Product Line Engineering",
    "abstract": "In the recent past, software product line engineering has become one of the most promising practices in software industry with the potential to substantially increase the software development productivity. Software product line engineering approach spans the dimensions of business, architecture, software engineering process and organization. The increasing popularity of software product line engineering in the software industry necessitates a process maturity evaluation methodology. Accordingly, this paper presents a business maturity model of software product line, which is a methodology to evaluate the current maturity of the business dimension of a software product line in an organization. This model examines the coordination between product line engineering and the business aspects of software product line. It evaluates the maturity of the business dimension of software product line as a function of how a set of business practices are aligned with product line engineering in an organization. Using the model presented in this paper, we conducted two case studies and reported the assessment results. This research contributes towards establishing a comprehensive and unified strategy for a process maturity evaluation of software product lines.",
    "authors": [
      "Faheem Ahmed",
      "Luiz Fernando Capretz"
    ],
    "publication_date": "2015-07-24T15:57:41Z",
    "arxiv_id": "http://arxiv.org/abs/1507.06897v1",
    "download_url": "https://arxiv.org/abs/1507.06897v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering Antipatterns in Start-Ups",
    "abstract": "Software start-up failures are often explained with poor business model, market issues, insufficient funding, or simply a bad product idea. However, inadequacies in software product engineering are relatively little explored and could be a significant contributing factor to high start-up failure rate. In this paper we present analysis of 88 start-up experience reports. The analysis is presented in a form of three anti-patterns illustrating common symptoms, actual causes, and potential countermeasures of engineering inadequacies. The three anti-patterns are: product uncertainty comprising of issues in requirements engineering, poor product quality comprising of inadequacies in product quality, and team breakup comprising of team issues. The anti-patterns show that challenges and failure scenarios that appear to be business or market-related can actually originate from inadequacies in product engineering.",
    "authors": [
      "Eriks Klotins",
      "Michael Unterkalmsteiner",
      "Tony Gorschek"
    ],
    "publication_date": "2023-11-20T19:30:34Z",
    "arxiv_id": "http://arxiv.org/abs/2311.12132v1",
    "download_url": "https://arxiv.org/abs/2311.12132v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Fermi Paradox and the Aurora Effect: Exo-civilization Settlement, Expansion and Steady States",
    "abstract": "We model the settlement of the galaxy by space-faring civilizations in order to address issues related to the Fermi Paradox. We explore the problem in a way that avoids assumptions about the intent and motivation of any exo-civilization seeking to settle other planetary systems. We first consider the speed of an advancing settlement via probes of finite velocity and range to determine if the galaxy can become inhabited with space-faring civilizations on timescales shorter than its age. We also include the effect of stellar motions on the long term behavior of the settlement front which adds a diffusive component to its advance. The results of these models demonstrate that the Milky Way can be readily 'filled-in' with settled stellar systems under conservative assumptions about interstellar spacecraft velocities and launch rates. We then consider the question of the galactic steady-state achieved in terms of the fraction of settled planets. We do this by considering the effect of finite settlement civilization lifetimes on the steady states. We find a range of parameters for which the galaxy supports a population of interstellar space-faring civilizations even though some settleable systems are uninhabited. Both results point to ways in which Earth might remain unvisited in the midst of an inhabited galaxy. Finally we consider how our results can be combined with the finite horizon for evidence of previous settlements in Earth's geologic record. Our steady-state model can constrain the probabilities for an Earth visit by a settling civilization before a given time horizon. These results break the link between Hart's famous \"Fact A\" (no interstellar visitors on Earth now) and the conclusion that humans must, therefore, be the only technological civilization in the galaxy.",
    "authors": [
      "Jonathan Carroll-Nellenback",
      "Adam Frank",
      "Jason Wright",
      "Caleb Scharf"
    ],
    "publication_date": "2019-02-12T15:40:24Z",
    "arxiv_id": "http://arxiv.org/abs/1902.04450v2",
    "download_url": "https://arxiv.org/abs/1902.04450v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chrono DEM-Engine: A Discrete Element Method dual-GPU simulator with customizable contact forces and element shape",
    "abstract": "This paper introduces DEM-Engine, a new submodule of Project Chrono, that is designed to carry out Discrete Element Method (DEM) simulations. Based on spherical primitive shapes, DEM-Engine can simulate polydisperse granular materials and handle complex shapes generated as assemblies of primitives, referred to as clumps. DEM-Engine has a multi-tier parallelized structure that is optimized to operate simultaneously on two GPUs. The code uses custom-defined data types to reduce memory footprint and increase bandwidth. A novel \"delayed contact detection\" algorithm allows the decoupling of the contact detection and force computation, thus splitting the workload into two asynchronous GPU streams. DEM-Engine uses just-in-time compilation to support user-defined contact force models. This paper discusses its C++ and Python interfaces and presents a variety of numerical tests, in which impact forces, complex-shaped particle flows, and a custom force model are validated considering well-known benchmark cases. Additionally, the full potential of the simulator is demonstrated for the investigation of extraterrestrial rover mobility on granular terrain. The chosen case study demonstrates that large-scale co-simulations (comprising 11 million elements) spanning 15 seconds, in conjunction with an external multi-body dynamics system, can be efficiently executed within a day. Lastly, a performance test suggests that DEM-Engine displays linear scaling up to 150 million elements on two NVIDIA A100 GPUs.",
    "authors": [
      "Ruochun Zhang",
      "Bonaventura Tagliafierro",
      "Colin Vanden Heuvel",
      "Shlok Sabarwal",
      "Luning Bakke",
      "Yulong Yue",
      "Xin Wei",
      "Radu Serban",
      "Dan Negrut"
    ],
    "publication_date": "2023-11-08T12:48:35Z",
    "arxiv_id": "http://arxiv.org/abs/2311.04648v2",
    "download_url": "https://arxiv.org/abs/2311.04648v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Agentic AI Software Engineers: Programming with Trust",
    "abstract": "Large Language Models (LLMs) have shown surprising proficiency in generating code snippets, promising to automate large parts of software engineering via artificial intelligence (AI). We argue that successfully deploying AI software engineers requires a level of trust equal to or even greater than the trust established by human-driven software engineering practices. The recent trend toward LLM agents offers a path toward integrating the power of LLMs to create new code with the power of analysis tools to increase trust in the code. This opinion piece comments on whether LLM agents could dominate software engineering workflows in the future and whether the focus of programming will shift from programming at scale to programming with trust.",
    "authors": [
      "Abhik Roychoudhury",
      "Corina Pasareanu",
      "Michael Pradel",
      "Baishakhi Ray"
    ],
    "publication_date": "2025-02-19T14:28:42Z",
    "arxiv_id": "http://arxiv.org/abs/2502.13767v4",
    "download_url": "https://arxiv.org/abs/2502.13767v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The General Index of Software Engineering Papers",
    "abstract": "We introduce the General Index of Software Engineering Papers, a dataset of fulltext-indexed papers from the most prominent scientific venues in the field of Software Engineering. The dataset includes both complete bibliographic information and indexed ngrams (sequence of contiguous words after removal of stopwords and non-words, for a total of 577 276 382 unique n-grams in this release) with length 1 to 5 for 44 581 papers retrieved from 34 venues over the 1971-2020 period.The dataset serves use cases in the field of meta-research, allowing to introspect the output of software engineering research even when access to papers or scholarly search engines is not possible (e.g., due to contractual reasons). The dataset also contributes to making such analyses reproducible and independently verifiable, as opposed to what happens when they are conducted using 3rd-party and non-open scholarly indexing services.The dataset is available as a portable Postgres database dump and released as open data.",
    "authors": [
      "Zeinab Abou Khalil",
      "Stefano Zacchiroli"
    ],
    "publication_date": "2022-04-07T06:52:35Z",
    "arxiv_id": "http://arxiv.org/abs/2204.03254v1",
    "download_url": "https://arxiv.org/abs/2204.03254v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Theory of Regulatory Compliance for Requirements Engineering",
    "abstract": "Regulatory compliance is increasingly being addressed in the practice of requirements engineering as a main stream concern. This paper points out a gap in the theoretical foundations of regulatory compliance, and presents a theory that states (i) what it means for requirements to be compliant, (ii) the compliance problem, i.e., the problem that the engineer should resolve in order to verify whether requirements are compliant, and (iii) testable hypotheses (predictions) about how compliance of requirements is verified. The theory is instantiated by presenting a requirements engineering framework that implements its principles, and is exemplified on a real-world case study.",
    "authors": [
      "Ivan Jureta",
      "Alberto Siena",
      "John Mylopoulos",
      "Anna Perini",
      "Angelo Susi"
    ],
    "publication_date": "2010-02-19T10:55:39Z",
    "arxiv_id": "http://arxiv.org/abs/1002.3711v1",
    "download_url": "https://arxiv.org/abs/1002.3711v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Leveraging Generative AI: Improving Software Metadata Classification with Generated Code-Comment Pairs",
    "abstract": "In software development, code comments play a crucial role in enhancing code comprehension and collaboration. This research paper addresses the challenge of objectively classifying code comments as \"Useful\" or \"Not Useful.\" We propose a novel solution that harnesses contextualized embeddings, particularly BERT, to automate this classification process. We address this task by incorporating generated code and comment pairs. The initial dataset comprised 9048 pairs of code and comments written in C, labeled as either Useful or Not Useful. To augment this dataset, we sourced an additional 739 lines of code-comment pairs and generated labels using a Large Language Model Architecture, specifically BERT. The primary objective was to build classification models that can effectively differentiate between useful and not useful code comments. Various machine learning algorithms were employed, including Logistic Regression, Decision Tree, K-Nearest Neighbors (KNN), Support Vector Machine (SVM), Gradient Boosting, Random Forest, and a Neural Network. Each algorithm was evaluated using precision, recall, and F1-score metrics, both with the original seed dataset and the augmented dataset. This study showcases the potential of generative AI for enhancing binary code comment quality classification models, providing valuable insights for software developers and researchers in the field of natural language processing and software engineering.",
    "authors": [
      "Samah Syed",
      "Angel Deborah S"
    ],
    "publication_date": "2023-10-14T12:09:43Z",
    "arxiv_id": "http://arxiv.org/abs/2311.03365v1",
    "download_url": "https://arxiv.org/abs/2311.03365v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Integrating Design Thinking for a Human-centered Requirements Engineering",
    "abstract": "In this position paper, we elaborate on the possibilities and needs to integrate Design Thinking into Requirements Engineering. We draw from our research and project experiences to compare what is understood as Design Thinking and Requirements Engineering considering their involved artifacts. We suggest three approaches for tailoring and integrating Design Thinking and Requirements Engineering with complementary synergies and point at open challenges for research and practice.",
    "authors": [
      "Jennifer Hehn",
      "Daniel Mendez",
      "Falk Uebernickel",
      "Walter Brenner",
      "Manfred Broy"
    ],
    "publication_date": "2019-08-20T08:45:45Z",
    "arxiv_id": "http://arxiv.org/abs/1908.07223v2",
    "download_url": "https://arxiv.org/abs/1908.07223v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software and Security Engineering in Digital Transformation",
    "abstract": "Digital transformation is a hot topic in the current global environment as a large number of organizations have been working to adopt digital solutions. Software engineering has also emerged to be a more important role as a large number of systems, either traditional or smart, are dependent on the software that collects, store, and process data. The role of software engineers has also become crucial in digital transformation. In this regard, this paper aims to examine the trends of software engineering and the role of software engineers in digital transformation. In addition to this, this paper also examines the importance of secure software development in digital transformation. It can be concluded that software engineering is an integral part of digital transformation as all digital systems make use of software to perform their functions efficiently. Software act as a bridge between digital systems and humans to use the systems interactively and efficiently.",
    "authors": [
      "Mamdouh Alenezi"
    ],
    "publication_date": "2021-12-16T04:57:42Z",
    "arxiv_id": "http://arxiv.org/abs/2201.01359v1",
    "download_url": "https://arxiv.org/abs/2201.01359v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Essencery - A Tool for Essentializing Software Engineering Practices",
    "abstract": "Software Engineering practitioners work using highly diverse methods and practices, and general theories in software engineering are lacking. One attempt at creating a common ground in the area of software engineering methodologies has been the Essence Theory of Software Engineering, which can be considered a method-agnostic project management tool for software engineering. Essence supports the use of any development practices and provides a framework for building a suitable method for any software engineering context. However, Essence presently suffers from low practitioner adoption that is partially considered to be caused by a lack of proper tooling. In this paper, we present Essencery, a tool for essentializing software engineering methods and practices using the Essence graphical syntax. Essencery aims to facilitate adoption of Essence among potential future users. We present an empirical evaluation of the tool by means of a qualitative, quasi-formal experiment and, based on the experiment, confirm that the tool is easy to use and useful for its intended purpose.",
    "authors": [
      "Arthur Evensen",
      "Kai-Kristian Kemell",
      "Xiaofeng Wang",
      "Juhani Risku",
      "Pekka Abrahamsson"
    ],
    "publication_date": "2018-08-08T11:05:08Z",
    "arxiv_id": "http://arxiv.org/abs/1808.02723v1",
    "download_url": "https://arxiv.org/abs/1808.02723v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chaos Engineering",
    "abstract": "Modern software-based services are implemented as distributed systems with complex behavior and failure modes. Many large tech organizations are using experimentation to verify the reliability of such systems. We use the term \"Chaos Engineering\" to refer to this approach, and discuss the underlying principles and how to use it to run experiments.",
    "authors": [
      "Ali Basiri",
      "Niosha Behnam",
      "Ruud de Rooij",
      "Lorin Hochstein",
      "Luke Kosewski",
      "Justin Reynolds",
      "Casey Rosenthal"
    ],
    "publication_date": "2017-02-20T03:21:59Z",
    "arxiv_id": "http://arxiv.org/abs/1702.05843v1",
    "download_url": "https://arxiv.org/abs/1702.05843v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Generalized Evolutionary Metaheuristic (GEM) Algorithm for Engineering Optimization",
    "abstract": "Many optimization problems in engineering and industrial design applications can be formulated as optimization problems with highly nonlinear objectives, subject to multiple complex constraints. Solving such optimization problems requires sophisticated algorithms and optimization techniques. A major trend in recent years is the use of nature-inspired metaheustic algorithms (NIMA). Despite the popularity of nature-inspired metaheuristic algorithms, there are still some challenging issues and open problems to be resolved. Two main issues related to current NIMAs are: there are over 540 algorithms in the literature, and there is no unified framework to understand the search mechanisms of different algorithms. Therefore, this paper attempts to analyse some similarities and differences among different algorithms and then presents a generalized evolutionary metaheuristic (GEM) in an attempt to unify some of the existing algorithms. After a brief discussion of some insights into nature-inspired algorithms and some open problems, we propose a generalized evolutionary metaheuristic algorithm to unify more than 20 different algorithms so as to understand their main steps and search mechanisms. We then test the unified GEM using 15 test benchmarks to validate its performance. Finally, further research topics are briefly discussed.",
    "authors": [
      "Xin-She Yang"
    ],
    "publication_date": "2024-07-02T09:55:15Z",
    "arxiv_id": "http://arxiv.org/abs/2407.02113v1",
    "download_url": "https://arxiv.org/abs/2407.02113v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Code Generation for Machine Learning using Model-Driven Engineering and SysML",
    "abstract": "Data-driven engineering refers to systematic data collection and processing using machine learning to improve engineering systems. Currently, the implementation of data-driven engineering relies on fundamental data science and software engineering skills. At the same time, model-based engineering is gaining relevance for the engineering of complex systems. In previous work, a model-based engineering approach integrating the formalization of machine learning tasks using the general-purpose modeling language SysML is presented. However, formalized machine learning tasks still require the implementation in a specialized programming languages like Python. Therefore, this work aims to facilitate the implementation of data-driven engineering in practice by extending the previous work of formalizing machine learning tasks by integrating model transformation to generate executable code. The method focuses on the modifiability and maintainability of the model transformation so that extensions and changes to the code generation can be integrated without requiring modifications to the code generator. The presented method is evaluated for feasibility in a case study to predict weather forecasts. Based thereon, quality attributes of model transformations are assessed and discussed. Results demonstrate the flexibility and the simplicity of the method reducing efforts for implementation. Further, the work builds a theoretical basis for standardizing data-driven engineering implementation in practice.",
    "authors": [
      "Simon Raedler",
      "Matthias Rupp",
      "Eugen Rigger",
      "Stefanie Rinderle-Ma"
    ],
    "publication_date": "2023-07-10T15:00:20Z",
    "arxiv_id": "http://arxiv.org/abs/2307.05584v1",
    "download_url": "https://arxiv.org/abs/2307.05584v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "JCLEC-MO: a Java suite for solving many-objective optimization engineering problems",
    "abstract": "Although metaheuristics have been widely recognized as efficient techniques to solve real-world optimization problems, implementing them from scratch remains difficult for domain-specific experts without programming skills. In this scenario, metaheuristic optimization frameworks are a practical alternative as they provide a variety of algorithms composed of customized elements, as well as experimental support. Recently, many engineering problems require to optimize multiple or even many objectives, increasing the interest in appropriate metaheuristic algorithms and frameworks that might integrate new specific requirements while maintaining the generality and reusability principles they were conceived for. Based on this idea, this paper introduces JCLEC-MO, a Java framework for both multi- and many-objective optimization that enables engineers to apply, or adapt, a great number of multi-objective algorithms with little coding effort. A case study is developed and explained to show how JCLEC-MO can be used to address many-objective engineering problems, often requiring the inclusion of domain-specific elements, and to analyze experimental outcomes by means of conveniently connected R utilities.",
    "authors": [
      "Aurora Ramírez",
      "José Raúl Romero",
      "Carlos García-Martínez",
      "Sebastián Ventura"
    ],
    "publication_date": "2024-02-28T17:38:01Z",
    "arxiv_id": "http://arxiv.org/abs/2402.18616v1",
    "download_url": "https://arxiv.org/abs/2402.18616v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The continuous accumulation of civilization core in the cycle of elements-creature, benefits and weapons",
    "abstract": "The comprehensive strength of a country varies from strong to weak, divided into three condition: descending, periodicity destruction or rapidly rising, Exploring the differences can solve the development crisis. the most important things for a country are interests, weapons and creature, corresponding to money, technology and people. The ship industry has two attribute of financial benefits and technological weapons. Commercial ships can transport massive commodity and warships carry updating of massive technological weapons; But a new core: equity incentives have emerged, and it has helped the rapid development of the computer industry. This article uses comparative analysis and comparative historical analysis to observe the changes in the United States and China after the mutual circulation of two elements and the double circulation of three elements in history, such as the growth rates of GDP and patent applications. Then, it summarizes the changes brought by the core of civilization to the country.Through this article, it can be concluded that the core of civilization consists of ships, equity incentives, record-wisdom method; Through the circulation of new elements, a country can transform into civilizations with three cycles, achieving mutual circulation among the three and enhancing endogenous power; The core of civilization can enhance the stability of economic development, prevent economic crises, and achieve a more balanced civilization.",
    "authors": [
      "Hongfa Zi",
      "Zhen Liu"
    ],
    "publication_date": "2024-08-21T03:51:40Z",
    "arxiv_id": "http://arxiv.org/abs/2408.11317v8",
    "download_url": "https://arxiv.org/abs/2408.11317v8",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Are we visible to advanced alien civilizations?",
    "abstract": "We considered the question of how our artificial constructions are visible to advanced extraterrestrial civilizations. Taking the universality of the laws of physics, we found that the maximum distance where the detection is possible is of the order of $3000$ ly and under certain conditions Type-II advanced alien societies might be able to resolve this problem.",
    "authors": [
      "Z. N. Osmanov"
    ],
    "publication_date": "2023-08-16T22:24:19Z",
    "arxiv_id": "http://arxiv.org/abs/2308.08689v1",
    "download_url": "https://arxiv.org/abs/2308.08689v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Augmenting software engineering with AI and developing it further towards AI-assisted model-driven software engineering",
    "abstract": "The effectiveness of model-driven software engineering (MDSE) has been successfully demonstrated in the context of complex software; however, it has not been widely adopted due to the requisite efforts associated with model development and maintenance, as well as the specific modelling competencies required for MDSE. Concurrently, artificial intelligence (AI) methods, particularly deep learning methods, have demonstrated considerable abilities when applied to the huge code bases accessible on open-source coding platforms. The so-called big code provides the basis for significant advances in empirical software engineering, as well as in the automation of coding processes and improvements in software quality with the use of AI. The objective of this paper is to facilitate a synthesis between these two significant domains of software engineering (SE), namely models and AI in SE. The paper provides an overview of the current state of AI-augmented software engineering and develops a corresponding taxonomy, ai4se. In light of the aforementioned considerations, a vision of AI-assisted big models in SE is put forth, with the aim of capitalising on the advantages inherent to both approaches in the context of software development. Finally, the pair modelling paradigm is proposed for adoption by the MDSE industry.",
    "authors": [
      "Ina K. Schieferdecker"
    ],
    "publication_date": "2024-09-26T16:49:57Z",
    "arxiv_id": "http://arxiv.org/abs/2409.18048v3",
    "download_url": "https://arxiv.org/abs/2409.18048v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data-Driven Search-based Software Engineering",
    "abstract": "This paper introduces Data-Driven Search-based Software Engineering (DSE), which combines insights from Mining Software Repositories (MSR) and Search-based Software Engineering (SBSE). While MSR formulates software engineering problems as data mining problems, SBSE reformulates SE problems as optimization problems and use meta-heuristic algorithms to solve them. Both MSR and SBSE share the common goal of providing insights to improve software engineering. The algorithms used in these two areas also have intrinsic relationships. We, therefore, argue that combining these two fields is useful for situations (a) which require learning from a large data source or (b) when optimizers need to know the lay of the land to find better solutions, faster.\n  This paper aims to answer the following three questions: (1) What are the various topics addressed by DSE? (2) What types of data are used by the researchers in this area? (3) What research approaches do researchers use? The paper briefly sets out to act as a practical guide to develop new DSE techniques and also to serve as a teaching resource.\n  This paper also presents a resource (tiny.cc/data-se) for exploring DSE. The resource contains 89 artifacts which are related to DSE, divided into 13 groups such as requirements engineering, software product lines, software processes. All the materials in this repository have been used in recent software engineering papers; i.e., for all this material, there exist baseline results against which researchers can comparatively assess their new ideas.",
    "authors": [
      "Vivek Nair",
      "Amritanshu Agrawal",
      "Jianfeng Chen",
      "Wei Fu",
      "George Mathew",
      "Tim Menzies",
      "Leandro Minku",
      "Markus Wagner",
      "Zhe Yu"
    ],
    "publication_date": "2018-01-30T22:15:06Z",
    "arxiv_id": "http://arxiv.org/abs/1801.10241v2",
    "download_url": "https://arxiv.org/abs/1801.10241v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "RPSE: Reification as Paradigm of Software Engineering",
    "abstract": "The paper introduces RPSE, Reification as a Paradigm of Software Engineering, and enumerates the most important theoretical and practical problems of the development and application of this paradigm. Main thesis: Software engineering is the reification (materialization of ideas) via the transformation of mental models into code executed on computers . Within the proposed paradigm: 1.All basic processes of software engineering are concrete variants (implementations) of the process of constructing chains of mental and material models I1, I2,..In, M1, M2, ..Mm. The last most specific model in this chain is, as a rule, program code. 2.The essence of software engineering is the construction of such chains. 3.All main issues of optimizing the development, its cost, and quality can be reduced to the optimization of construction of the corresponding chain of models.",
    "authors": [
      "Viktor Sirotin"
    ],
    "publication_date": "2018-10-03T18:34:23Z",
    "arxiv_id": "http://arxiv.org/abs/1810.01904v1",
    "download_url": "https://arxiv.org/abs/1810.01904v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering und Software Engineering Forschung im Zeitalter der Digitalisierung",
    "abstract": "Digitization not only affects society, it also requires a redefinition of the location of computer science and computer scientists, as the science journalist Yogeshwar suggests. Since all official aspects of digitalization are based on software, this article is intended to attempt to redefine the role of software engineering and its research. Software-based products, systems or services are influencing all areas of life and are a critical component and central innovation driver of digitization in all areas of life. Scientifically, there are new opportunities and challenges for software engineering as a driving discipline in the development of any technical innovation. However, the chances must not be sacrificed to the competition for bibliometric numbers as an end in themselves.",
    "authors": [
      "Michael Felderer",
      "Ralf Reussner",
      "Bernhard Rumpe"
    ],
    "publication_date": "2020-02-25T12:46:20Z",
    "arxiv_id": "http://arxiv.org/abs/2002.10835v1",
    "download_url": "https://arxiv.org/abs/2002.10835v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Design and Selection of Additional Residuals to Enhance Fault Isolation of a Turbocharged Spark Ignited Engine System",
    "abstract": "This paper presents a method to enhance fault isolation without adding physical sensors on a turbocharged spark ignited petrol engine system by designing additional residuals from an initial observer-based residuals setup. The best candidates from all potential additional residuals are selected using the concept of sequential residual generation to ensure best fault isolation performance for the least number of additional residuals required. A simulation testbed is used to generate realistic engine data for the design of the additional residuals and the fault isolation performance is verified using structural analysis method.",
    "authors": [
      "K. Y. Ng",
      "E. Frisk",
      "M. Krysander"
    ],
    "publication_date": "2020-02-08T17:40:48Z",
    "arxiv_id": "http://arxiv.org/abs/2002.03207v2",
    "download_url": "https://arxiv.org/abs/2002.03207v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multi-modal Learning for WebAssembly Reverse Engineering",
    "abstract": "The increasing adoption of WebAssembly (Wasm) for performance-critical and security-sensitive tasks drives the demand for WebAssembly program comprehension and reverse engineering. Recent studies have introduced machine learning (ML)-based WebAssembly reverse engineering tools. Yet, the generalization of task-specific ML solutions remains challenging, because their effectiveness hinges on the availability of an ample supply of high-quality task-specific labeled data. Moreover, previous works overlook the high-level semantics present in source code and its documentation. Acknowledging the abundance of available source code with documentation, which can be compiled into WebAssembly, we propose to learn representations of them concurrently and harness their mutual relationships for effective WebAssembly reverse engineering.\n  In this paper, we present WasmRev, the first multi-modal pre-trained language model for WebAssembly reverse engineering. WasmRev is pre-trained using self-supervised learning on a large-scale multi-modal corpus encompassing source code, code documentation and the compiled WebAssembly, without requiring labeled data. WasmRev incorporates three tailored multi-modal pre-training tasks to capture various characteristics of WebAssembly and cross-modal relationships. WasmRev is only trained once to produce general-purpose representations that can broadly support WebAssembly reverse engineering tasks through few-shot fine-tuning with much less labeled data, improving data efficiency. We fine-tune WasmRev onto three important reverse engineering tasks: type recovery, function purpose identification and WebAssembly summarization. Our results show that WasmRev pre-trained on the corpus of multi-modal samples establishes a robust foundation for these tasks, achieving high task accuracy and outperforming the state-of-the-art ML methods for WebAssembly reverse engineering.",
    "authors": [
      "Hanxian Huang",
      "Jishen Zhao"
    ],
    "publication_date": "2024-04-04T03:03:38Z",
    "arxiv_id": "http://arxiv.org/abs/2404.03171v1",
    "download_url": "https://arxiv.org/abs/2404.03171v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Surveying Vulnerable Populations: A Case Study of Civil Society Organizations",
    "abstract": "Compared to organizations in other sectors, civil society organizations (CSOs) are particularly vulnerable to security and privacy threats, as they lack adequate resources and expertise to defend themselves. At the same time, their security needs and practices have not gained much attention among researchers, and existing solutions designed for the average users do not consider the contexts in which CSO employees operate. As part of our preliminary work, we conducted an anonymous online survey with 102 CSO employees to collect information about their perceived risks of different security and privacy threats, and their self-reported mitigation strategies. The design of our preliminary survey accounted for the unique requirements of our target population by establishing trust with respondents, using anonymity-preserving incentive strategies, and distributing the survey with the help of a trusted intermediary. However, by carefully examining our methods and the feedback received from respondents, we uncovered several issues with our methodology, including the length of the survey, the framing of the questions, and the design of the recruitment email. We hope that the discussion presented in this paper will inform and assist researchers and practitioners working on understanding and improving the security and privacy of CSOs.",
    "authors": [
      "Nikita Samarin",
      "Alisa Frik",
      "Sean Brooks",
      "Coye Cheshire",
      "Serge Egelman"
    ],
    "publication_date": "2020-03-19T05:30:21Z",
    "arxiv_id": "http://arxiv.org/abs/2003.08580v2",
    "download_url": "https://arxiv.org/abs/2003.08580v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering design optimisation using tabu search",
    "abstract": "This paper describes an optimisation methodology that has been specifically developed for engineering design problems. The methodology is based on a Tabu search (TS) algorithm that has been shown to find high quality solutions with a relatively low number of objective function evaluations. Whilst the methodology was originally intended for a small range of design problems it has since been successfully applied to problems from different domains with no alteration to the underlying method. This paper describes the method and its application to three different problems. The first is from the field of structural design, the second relates to the design of electromagnetic pole shapes and the third involves the design of turbomachinery blades.",
    "authors": [
      "Andy M. Connor",
      "P. John Clarkson",
      "Shahrokh Shahpar",
      "Paul Leonard"
    ],
    "publication_date": "2016-06-19T23:33:35Z",
    "arxiv_id": "http://arxiv.org/abs/1606.05924v1",
    "download_url": "https://arxiv.org/abs/1606.05924v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Call to Promote Soft Skills in Software Engineering",
    "abstract": "We have been thinking about other aspects of software engineering for many years; the missing link in engineering software is the soft skills set, essential in the software development process. Although soft skills are among the most important aspects in the creation of software, they are often overlooked by educators and practitioners. One of the main reasons for the oversight is that soft skills are usually related to social and personality factors, i.e., teamwork, motivation, commitment, leadership, multi-culturalism, emotions, interpersonal skills, etc. This editorial is a manifesto declaring the importance of soft skills in software engineering with the intention to draw professionals attention to these topics. We have approached this issue by mentioning what we know about the field, what we believe to be evident, and which topics need further investigation. Important references to back up our claims are also included. Software engineers take pride in the depth of their technical expertise, which separates them from the crowd. But, what makes a good software engineer? First, it is the technical knowledge of relevant methodologies and techniques (i.e. hard skills), as well as the skills necessary for applying that knowledge in practice. Second, but nonetheless important, it is a set of soft skills, in particular collaboration, communication, problem-solving and similar interpersonal and critical thinking skills that are expected from software engineering professionals. In other words, software engineers need both hard and soft skills in order to be successful at the workplace.",
    "authors": [
      "Luiz Fernando Capretz",
      "Faheem Ahmed"
    ],
    "publication_date": "2018-12-12T21:17:10Z",
    "arxiv_id": "http://arxiv.org/abs/1901.01819v1",
    "download_url": "https://arxiv.org/abs/1901.01819v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software-Intensive Product Engineering in Start-Ups: A Taxonomy",
    "abstract": "Software start-ups are new companies aiming to launch an innovative product to mass markets fast with minimal resources. However, most start-ups fail before realizing their potential. Poor software engineering, among other factors, could be a significant contributor to the challenges that start-ups experience. Little is known about the engineering context in start-up companies. On the surface, start-ups are characterized by uncertainty, high risk, and minimal resources. However, such a characterization isn't granular enough to support identification of specific engineering challenges and to devise start-up-specific engineering practices. The first step toward an understanding of software engineering in start-ups is the definition of a Start-Up Context Map - a taxonomy of engineering practices, environment factors, and goals influencing the engineering process. This map aims to support further research on the field and serve as an engineering decision support tool for start-ups. This article is part of a theme issue on Process Improvement.",
    "authors": [
      "Eriks Klotins",
      "Michael Unterkalmsteiner",
      "Tony Gorschek"
    ],
    "publication_date": "2023-09-28T18:42:56Z",
    "arxiv_id": "http://arxiv.org/abs/2309.16793v1",
    "download_url": "https://arxiv.org/abs/2309.16793v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Artificial Intelligence for Software Engineering: the Road Ahead",
    "abstract": "In order to handle the increasing complexity of software systems, Artificial Intelligence (AI) has been applied to various areas of software engineering, including requirements engineering, coding, testing, and debugging. This has led to the emergence of AI for Software Engineering as a distinct research area within the field of software engineering. With the development of quantum computing, the field of Quantum AI (QAI) is arising, enhancing the performance of classical AI and holding significant potential for solving classical software engineering problems. Some initial applications of QAI in software engineering have already emerged, such as test case optimization. However, the path ahead remains open, offering ample opportunities to solve complex software engineering problems cost-effectively with QAI. To this end, this paper presents a roadmap towards the application of QAI in software engineering. Specifically, we consider two of the main categories of QAI, i.e., quantum optimization algorithms and quantum machine learning. For each software engineering phase, we discuss how these QAI approaches can address some of the tasks associated with that phase. Moreover, we provide an overview of some of the possible challenges that need to be addressed to make the application of QAI for software engineering successful.",
    "authors": [
      "Xinyi Wang",
      "Shaukat Ali",
      "Paolo Arcaini"
    ],
    "publication_date": "2025-05-07T20:47:18Z",
    "arxiv_id": "http://arxiv.org/abs/2505.04797v2",
    "download_url": "https://arxiv.org/abs/2505.04797v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tactical communication systems based on civil standards: Modeling in the MiXiM framework",
    "abstract": "In this paper, new work is presented belonging to an ongoing study, which evaluates civil communication standards as potential candidates for the future military Wide Band Waveforms (WBWFs). After an evaluation process of possible candidates presented in [2], the selection process in [1] showed that the IEEE 802.11n OFDM could be a possible military WBWF candidate, but it should be further investigated first in order to enhance or even replace critical modules. According to this, some critical modules of the physical layer has been further analyzed in [3] regarding the susceptibility of the OFDM signal under jammer influences. However, the critical modules of the MAC layer (e.g., probabilistic medium access CSMA/CA) have not been analysed. In fact, it was only suggested in [2] to replace this medium access by the better suited Unified Slot Allocation Protocol - Multiple Access (USAP-MA) [4]. In this regard, the present contribution describes the design paradigms of the new MAC layer and explains how the proposed WBWF candidate has been modelled within the MiXiM Framework of the OMNeT++ simulator.",
    "authors": [
      "Humberto Escudero Argumanez",
      "Matthias Tschauner"
    ],
    "publication_date": "2014-09-03T09:26:11Z",
    "arxiv_id": "http://arxiv.org/abs/1409.1006v1",
    "download_url": "https://arxiv.org/abs/1409.1006v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How Rare Are Extraterrestrial Civilizations and When Did They Emerge?",
    "abstract": "It is shown that, contrary to an existing claim, the near equality between the lifetime of the sun and the timescale of biological evolution on earth does not necessarily imply that extraterrestrial civilizations are exceedingly rare. Furthermore, on the basis of simple assumptions it is demonstrated that a near equality between these two timescales may be the most probable relation. A calculation of the cosmic history of carbon production which is based on the recently determined history of the star formation rate suggests that the most likely time for intelligent civilizations to emerge in the universe, was when the universe was already older then about 10 billion years (for an assumed current age of about 13 billion years).",
    "authors": [
      "Mario Livio"
    ],
    "publication_date": "1998-08-21T19:43:00Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/9808237v1",
    "download_url": "https://arxiv.org/abs/astro-ph/9808237v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Circular Systems Engineering",
    "abstract": "The perception of the value and propriety of modern engineered systems is changing. In addition to their functional and extra-functional properties, nowadays' systems are also evaluated by their sustainability properties. The next generation of systems will be characterized by an overall elevated sustainability -- including their post-life, driven by efficient value retention mechanisms. Current systems engineering practices fall short of supporting these ambitions and need to be revised appropriately. In this paper, we introduce the concept of circular systems engineering, a novel paradigm for systems sustainability, and define two principles to successfully implement it: end-to-end sustainability and bipartite sustainability. We outline typical organizational evolution patterns that lead to the implementation and adoption of circularity principles, and outline key challenges and research opportunities.",
    "authors": [
      "Istvan David",
      "Dominik Bork",
      "Gerti Kappel"
    ],
    "publication_date": "2023-06-30T17:09:44Z",
    "arxiv_id": "http://arxiv.org/abs/2306.17808v4",
    "download_url": "https://arxiv.org/abs/2306.17808v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prompt Less, Smile More: MTP with Semantic Engineering in Lieu of Prompt Engineering",
    "abstract": "AI-Integrated programming is emerging as a foundational paradigm for building intelligent systems with large language models (LLMs). Recent approaches such as Meaning Typed Programming (MTP) automate prompt generation by leveraging the semantics already present in code. However, many real-world applications depend on contextual cues, developer intent, and domain-specific reasoning that extend beyond what static code semantics alone can express. To address this limitation, we introduce Semantic Engineering, a lightweight method for enriching program semantics so that LLM-based systems can more accurately reflect developer intent without requiring full manual prompt design. We present Semantic Context Annotations (SemTexts), a language-level mechanism that allows developers to embed natural-language context directly into program constructs. Integrated into the Jac programming language, Semantic Engineering extends MTP to incorporate these enriched semantics during prompt generation. We further introduce a benchmark suite designed to reflect realistic AI-Integrated application scenarios. Our evaluation shows that Semantic Engineering substantially improves prompt fidelity, achieving performance comparable to Prompt Engineering while requiring significantly less developer effort.",
    "authors": [
      "Jayanaka L. Dantanarayana",
      "Savini Kashmira",
      "Thakee Nathees",
      "Zichen Zhang",
      "Krisztian Flautner",
      "Lingjia Tang",
      "Jason Mars"
    ],
    "publication_date": "2025-11-24T18:58:22Z",
    "arxiv_id": "http://arxiv.org/abs/2511.19427v1",
    "download_url": "https://arxiv.org/abs/2511.19427v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering for OpenHarmony: A Research Roadmap",
    "abstract": "Mobile software engineering has been a hot research topic for decades. Our fellow researchers have proposed various approaches (with over 7,000 publications for Android alone) in this field that essentially contributed to the great success of the current mobile ecosystem. Existing research efforts mainly focus on popular mobile platforms, namely Android and iOS. OpenHarmony, a newly open-sourced mobile platform, has rarely been considered, although it is the one requiring the most attention as OpenHarmony is expected to occupy one-third of the market in China (if not in the world). To fill the gap, we present to the mobile software engineering community a research roadmap for encouraging our fellow researchers to contribute promising approaches to OpenHarmony. Specifically, we start by presenting a literature review of mobile software engineering, attempting to understand what problems have been targeted by the mobile community and how they have been resolved. We then summarize the existing (limited) achievements of OpenHarmony and subsequently highlight the research gap between Android/iOS and OpenHarmony. This research gap eventually helps in forming the roadmap for conducting software engineering research for OpenHarmony.",
    "authors": [
      "Li Li",
      "Xiang Gao",
      "Hailong Sun",
      "Chunming Hu",
      "Xiaoyu Sun",
      "Haoyu Wang",
      "Haipeng Cai",
      "Ting Su",
      "Xiapu Luo",
      "Tegawendé F. Bissyandé",
      "Jacques Klein",
      "John Grundy",
      "Tao Xie",
      "Haibo Chen",
      "Huaimin Wang"
    ],
    "publication_date": "2023-11-02T15:27:09Z",
    "arxiv_id": "http://arxiv.org/abs/2311.01311v2",
    "download_url": "https://arxiv.org/abs/2311.01311v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Upper limits on the probability of an interstellar civilization arising in the local Solar neighborhood",
    "abstract": "At this point in time, there is very little empirical evidence on the likelihood of a space-faring species originating in the biosphere of a habitable world. However, there is a tension between the expectation that such a probability is relatively high (given our own origins on Earth), and the lack of any basis for believing the Solar System has ever been visited by an extraterrestrial colonization effort. This paper seeks to place upper limits on the probability of an interstellar civilization arising on a habitable planet in its stellar system, using a percolation model to simulate the progress of such a hypothetical civilization's colonization efforts in the local Solar neighborhood. To be as realistic as possible, the actual physical positions and characteristics of all stars within 40 parsecs of the Solar System are used as possible colony sites in the percolation process. If an interstellar civilization is very likely to have such colonization programs, and they can travel over large distances, then the upper bound on the likelihood of such a species arising per habitable world is on the order of $10^{-3}$; on the other hand, if civilizations are not prone to colonize their neighbors, or do not travel very far, then the upper limiting probability is much larger, even of order one.",
    "authors": [
      "Daniel Cartin"
    ],
    "publication_date": "2015-01-22T14:05:23Z",
    "arxiv_id": "http://arxiv.org/abs/1501.05904v1",
    "download_url": "https://arxiv.org/abs/1501.05904v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SELM: Software Engineering of Machine Learning Models",
    "abstract": "One of the pillars of any machine learning model is its concepts. Using software engineering, we can engineer these concepts and then develop and expand them. In this article, we present a SELM framework for Software Engineering of machine Learning Models. We then evaluate this framework through a case study. Using the SELM framework, we can improve a machine learning process efficiency and provide more accuracy in learning with less processing hardware resources and a smaller training dataset. This issue highlights the importance of an interdisciplinary approach to machine learning. Therefore, in this article, we have provided interdisciplinary teams' proposals for machine learning.",
    "authors": [
      "Nafiseh Jafari",
      "Mohammad Reza Besharati",
      "Mohammad Izadi",
      "Maryam Hourali"
    ],
    "publication_date": "2021-03-20T21:43:24Z",
    "arxiv_id": "http://arxiv.org/abs/2103.11249v1",
    "download_url": "https://arxiv.org/abs/2103.11249v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Team-oriented Consistency Checking of Heterogeneous Engineering Artifacts",
    "abstract": "Consistency checking of interdependent heterogeneous engineering artifacts, such as requirements, specifications, and code, is a challenging task in large-scale engineering projects. The lack of team-oriented solutions allowing a multitude of project stakeholders to collaborate in a consistent manner is thus becoming a critical problem. In this context, this work proposes an approach for team-oriented consistency checking of collaboratively developed heterogeneous engineering artifacts.",
    "authors": [
      "Michael Alexander Tröls",
      "Atif Mashkoor",
      "Alexander Egyed"
    ],
    "publication_date": "2021-03-27T09:37:51Z",
    "arxiv_id": "http://arxiv.org/abs/2103.14860v1",
    "download_url": "https://arxiv.org/abs/2103.14860v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Minimal conditions for survival of technological civilizations in the face of stellar evolution",
    "abstract": "The ease of interstellar rocket travel is an issue with implications for the long term fate of our own and other civilizations and for the much-debated number of technological civilizations in the Galaxy. We show that the physical barrier to interstellar travel can be greatly reduced if voyagers are patient, and wait for the close passage of another star. For a representative time of $\\sim$1 Gyr, characteristic of the remaining time that Earth will remain habitable, one anticipates a passage of another star within $\\sim 1500$~AU. This lowers the travel time for interstellar migration by $\\sim$ two orders of magnitude compared with calculated travel times based on distances comparable to average interstellar separations (i.e., $\\sim$1 pc) in the solar vicinity. We consider the implications for how long-lived civilizations may respond to stellar evolution, including the case of stars in wide binaries, and the difficulties of identifying systems currently undergoing a relevant close encounter.\n  Assuming that life originates only around G-type stars, but migrates primarily to lower mass hosts when the original system becomes uninhabitable, the fraction of extant technological civilizations that exist as diaspora can be comparable to the fraction that still orbit their original host stars.",
    "authors": [
      "Brad Hansen",
      "Ben Zuckerman"
    ],
    "publication_date": "2021-02-10T19:22:19Z",
    "arxiv_id": "http://arxiv.org/abs/2102.05703v1",
    "download_url": "https://arxiv.org/abs/2102.05703v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "VIEW: A Virtual Interactive Web-based Learning Environment for Engineering",
    "abstract": "The use of computer-aided and web-based educational technologies such as Virtual Learning Environments (VLE) has increased significantly in the recent past. One example of such a VLE is Virtual Interactive Engineering on the Web (VIEW). VIEW is a 3D virtual, interactive, student centered, framework of web-based modules based on the Extensible 3D standard. These modules are dedicated to the improvement of student success and learning. In this paper, an overview of the recent developments in VIEW along with associated assessment results is presented. An experimental study was also performed to compare the learning experience and performance of students in a physical dissection activity vs. that in a virtual dissection activity using a VIEW module. The results of this study show that students can meet given learning objectives and that there is limited difference in their learning and performance irrespective of a physical or virtual setting.",
    "authors": [
      "Priya T. Goeser",
      "Felix G. Hamza-Lup",
      "Wayne M. Johnson",
      "Dirk Scharfer"
    ],
    "publication_date": "2018-11-19T02:22:10Z",
    "arxiv_id": "http://arxiv.org/abs/1811.07463v1",
    "download_url": "https://arxiv.org/abs/1811.07463v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Identifying and Consolidating Knowledge Engineering Requirements",
    "abstract": "Knowledge engineering is the process of creating and maintaining knowledge-producing systems. Throughout the history of computer science and AI, knowledge engineering workflows have been widely used because high-quality knowledge is assumed to be crucial for reliable intelligent agents. However, the landscape of knowledge engineering has changed, presenting four challenges: unaddressed stakeholder requirements, mismatched technologies, adoption barriers for new organizations, and misalignment with software engineering practices. In this paper, we propose to address these challenges by developing a reference architecture using a mainstream software methodology. By studying the requirements of different stakeholders and eras, we identify 23 essential quality attributes for evaluating reference architectures. We assess three candidate architectures from recent literature based on these attributes. Finally, we discuss the next steps towards a comprehensive reference architecture, including prioritizing quality attributes, integrating components with complementary strengths, and supporting missing socio-technical requirements. As this endeavor requires a collaborative effort, we invite all knowledge engineering researchers and practitioners to join us.",
    "authors": [
      "Bradley P. Allen",
      "Filip Ilievski",
      "Saurav Joshi"
    ],
    "publication_date": "2023-06-27T00:26:15Z",
    "arxiv_id": "http://arxiv.org/abs/2306.15124v1",
    "download_url": "https://arxiv.org/abs/2306.15124v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "AI for software engineering: from probable to provable",
    "abstract": "Vibe coding, the much-touted use of AI techniques for programming, faces two overwhelming obstacles: the difficulty of specifying goals (\"prompt engineering\" is a form of requirements engineering, one of the toughest disciplines of software engineering); and the hallucination phenomenon. Programs are only useful if they are correct or very close to correct.\n  The solution? Combine the creativity of artificial intelligence with the rigor of formal specification methods and the power of formal program verification, supported by modern proof tools.",
    "authors": [
      "Bertrand Meyer"
    ],
    "publication_date": "2025-11-28T13:14:45Z",
    "arxiv_id": "http://arxiv.org/abs/2511.23159v1",
    "download_url": "https://arxiv.org/abs/2511.23159v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Challenges and Paths Towards AI for Software Engineering",
    "abstract": "AI for software engineering has made remarkable progress recently, becoming a notable success within generative AI. Despite this, there are still many challenges that need to be addressed before automated software engineering reaches its full potential. It should be possible to reach high levels of automation where humans can focus on the critical decisions of what to build and how to balance difficult tradeoffs while most routine development effort is automated away. Reaching this level of automation will require substantial research and engineering efforts across academia and industry. In this paper, we aim to discuss progress towards this in a threefold manner. First, we provide a structured taxonomy of concrete tasks in AI for software engineering, emphasizing the many other tasks in software engineering beyond code generation and completion. Second, we outline several key bottlenecks that limit current approaches. Finally, we provide an opinionated list of promising research directions toward making progress on these bottlenecks, hoping to inspire future research in this rapidly maturing field.",
    "authors": [
      "Alex Gu",
      "Naman Jain",
      "Wen-Ding Li",
      "Manish Shetty",
      "Yijia Shao",
      "Ziyang Li",
      "Diyi Yang",
      "Kevin Ellis",
      "Koushik Sen",
      "Armando Solar-Lezama"
    ],
    "publication_date": "2025-03-28T17:17:57Z",
    "arxiv_id": "http://arxiv.org/abs/2503.22625v1",
    "download_url": "https://arxiv.org/abs/2503.22625v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A high-performance interactive computing framework for engineering applications",
    "abstract": "To harness the potential of advanced computing technologies, efficient (real time) analysis of large amounts of data is as essential as are front-line simulations. In order to optimise this process, experts need to be supported by appropriate tools that allow to interactively guide both the computation and data exploration of the underlying simulation code. The main challenge is to seamlessly feed the user requirements back into the simulation. State-of-the-art attempts to achieve this, have resulted in the insertion of so-called check- and break-points at fixed places in the code. Depending on the size of the problem, this can still compromise the benefits of such an attempt, thus, preventing the experience of real interactive computing. To leverage the concept for a broader scope of applications, it is essential that a user receives an immediate response from the simulation to his or her changes. Our generic integration framework, targeted to the needs of the computational engineering domain, supports distributed computations as well as on-the-fly visualisation in order to reduce latency and enable a high degree of interactivity with only minor code modifications. Namely, the regular course of the simulation coupled to our framework is interrupted in small, cyclic intervals followed by a check for updates. When new data is received, the simulation restarts automatically with the updated settings (boundary conditions, simulation parameters, etc.). To obtain rapid, albeit approximate feedback from the simulation in case of perpetual user interaction, a multi-hierarchical approach is advantageous. Within several different engineering test cases, we will demonstrate the flexibility and the effectiveness of our approach.",
    "authors": [
      "Jovana Knežević",
      "Ralf-Peter Mundani",
      "Ernst Rank"
    ],
    "publication_date": "2018-07-02T16:08:03Z",
    "arxiv_id": "http://arxiv.org/abs/1807.00769v1",
    "download_url": "https://arxiv.org/abs/1807.00769v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Software Engineering: Landscapes and Horizons",
    "abstract": "Quantum software plays a critical role in exploiting the full potential of quantum computing systems. As a result, it has been drawing increasing attention recently. This paper defines the term \"quantum software engineering\" and introduces a quantum software life cycle. The paper also gives a generic view of quantum software engineering and discusses the quantum software engineering processes, methods, and tools. Based on these, the paper provides a comprehensive survey of the current state of the art in the field and presents the challenges and opportunities we face. The survey summarizes the technology available in the various phases of the quantum software life cycle, including quantum software requirements analysis, design, implementation, test, and maintenance. It also covers the crucial issues of quantum software reuse and measurement.",
    "authors": [
      "Jianjun Zhao"
    ],
    "publication_date": "2020-07-14T14:13:44Z",
    "arxiv_id": "http://arxiv.org/abs/2007.07047v2",
    "download_url": "https://arxiv.org/abs/2007.07047v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Four presumed gaps in the software engineering research community's knowledge",
    "abstract": "Background: The state of the art in software engineering consists of a myriad of contributions and the gaps between them; it is difficult to characterize.\n  Questions: In order to help understanding the state of the art, can we identify gaps in our knowledge that are at a very general, widely relevant level? Which research directions do these gaps suggest?\n  Method: 54 expert interviews with senior members of the ICSE community, evaluated qualitatively using elements of Grounded Theory Methodology.\n  Results: Our understanding of complexity, of good-enoughness, and of developers' strengths is underdeveloped. Some other relevant factors' relevance is apparently not clear. Software engineering is not yet an evidence-based discipline.\n  Conclusion: More software engineering research should concern itself with emergence phenomena, with how engineering tradeoffs are made, with the assumptions underlying research works, and with creating certain taxonomies. Such work would also allow software engineering to become more evidence-based.",
    "authors": [
      "Lutz Prechelt"
    ],
    "publication_date": "2019-11-22T11:00:46Z",
    "arxiv_id": "http://arxiv.org/abs/1911.09971v1",
    "download_url": "https://arxiv.org/abs/1911.09971v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Industry Best Practices in Robotics Software Engineering",
    "abstract": "Robotics software is pushing the limits of software engineering practice. The 3rd International Workshop on Robotics Software Engineering held a panel on \"the best practices for robotic software engineering\". This article shares the key takeaways that emerged from the discussion among the panelists and the workshop, ranging from architecting practices at the NASA/Caltech Jet Propulsion Laboratory, model-driven development at Bosch, development and testing of autonomous driving systems at Waymo, and testing of robotics software at XITASO. Researchers and practitioners can build on the contents of this paper to gain a fresh perspective on their activities and focus on the most pressing practices and challenges in developing robotics software today.",
    "authors": [
      "Robert Bocchino",
      "Arne Nordmann",
      "Allison Thackston",
      "Andreas Angerer",
      "Federico Ciccozzi",
      "Ivano Malavolta",
      "Andreas Wortmann"
    ],
    "publication_date": "2022-12-09T14:31:44Z",
    "arxiv_id": "http://arxiv.org/abs/2212.04877v1",
    "download_url": "https://arxiv.org/abs/2212.04877v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering Practice in the Development of Deep Learning Applications",
    "abstract": "Deep-Learning(DL) applications have been widely employed to assist in various tasks. They are constructed based on a data-driven programming paradigm that is different from conventional software applications. Given the increasing popularity and importance of DL applications, software engineering practitioners have some techniques specifically for them. However, little research is conducted to identify the challenges and lacks in practice. To fill this gap, in this paper, we surveyed 195 practitioners to understand their insight and experience in the software engineering practice of DL applications. Specifically, we asked the respondents to identify lacks and challenges in the practice of the development life cycle of DL applications. The results present 13 findings that provide us with a better understanding of software engineering practice of DL applications. Further, we distil these findings into 7 actionable recommendations for software engineering researchers and practitioners to improve the development of DL applications.",
    "authors": [
      "Xufan Zhang",
      "Yilin Yang",
      "Yang Feng",
      "Zhenyu Chen"
    ],
    "publication_date": "2019-10-08T01:30:28Z",
    "arxiv_id": "http://arxiv.org/abs/1910.03156v1",
    "download_url": "https://arxiv.org/abs/1910.03156v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Model-Driven Engineering of Self-Adaptive Software with EUREMA",
    "abstract": "The development of self-adaptive software requires the engineering of an adaptation engine that controls the underlying adaptable software by feedback loops. The engine often describes the adaptation by runtime models representing the adaptable software and by activities such as analysis and planning that use these models. To systematically address the interplay between runtime models and adaptation activities, runtime megamodels have been proposed. A runtime megamodel is a specific model capturing runtime models and adaptation activities. In this article, we go one step further and present an executable modeling language for ExecUtable RuntimE MegAmodels (EUREMA) that eases the development of adaptation engines by following a model-driven engineering approach. We provide a domain-specific modeling language and a runtime interpreter for adaptation engines, in particular feedback loops. Megamodels are kept alive at runtime and by interpreting them, they are directly executed to run feedback loops. Additionally, they can be dynamically adjusted to adapt feedback loops. Thus, EUREMA supports development by making feedback loops explicit at a higher level of abstraction and it enables solutions where multiple feedback loops interact or operate on top of each other and self-adaptation co-exists with offline adaptation for evolution.",
    "authors": [
      "Thomas Vogel",
      "Holger Giese"
    ],
    "publication_date": "2018-05-17T18:24:11Z",
    "arxiv_id": "http://arxiv.org/abs/1805.07353v1",
    "download_url": "https://arxiv.org/abs/1805.07353v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Psychological Types of Brazilian Software Engineering Students",
    "abstract": "The aim of this investigation was to establish the personality profile of Brazilian software engineering students according to the MBTI. This study also shows that the software engineering field attracts students of some types more than other types, for instance: Is, Ps, IPs, TPs, and INs are significantly represented in that group as opposed to E, Js, EJs, TJs, ENs.",
    "authors": [
      "Luiz Fernando Capretz"
    ],
    "publication_date": "2015-11-27T22:39:55Z",
    "arxiv_id": "http://arxiv.org/abs/1511.08845v1",
    "download_url": "https://arxiv.org/abs/1511.08845v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "LS-DYNA Machine Learning-based Multiscale Method for Nonlinear Modeling of Short Fiber-Reinforced Composites",
    "abstract": "Short-fiber-reinforced composites (SFRC) are high-performance engineering materials for lightweight structural applications in the automotive and electronics industries. Typically, SFRC structures are manufactured by injection molding, which induces heterogeneous microstructures, and the resulting nonlinear anisotropic behaviors are challenging to predict by conventional micromechanical analyses. In this work, we present a machine learning-based multiscale method by integrating injection molding-induced microstructures, material homogenization, and Deep Material Network (DMN) in the finite element simulation software LS-DYNA for structural analysis of SFRC. DMN is a physics-embedded machine learning model that learns the microscale material morphologies hidden in representative volume elements of composites through offline training. By coupling DMN with finite elements, we have developed a highly accurate and efficient data-driven approach, which predicts nonlinear behaviors of composite materials and structures at a computational speed orders-of-magnitude faster than the high-fidelity direct numerical simulation. To model industrial-scale SFRC products, transfer learning is utilized to generate a unified DMN database, which effectively captures the effects of injection molding-induced fiber orientations and volume fractions on the overall composite properties. Numerical examples are presented to demonstrate the promising performance of this LS-DYNA machine learning-based multiscale method for SFRC modeling.",
    "authors": [
      "Haoyan Wei",
      "C. T. Wu",
      "Wei Hu",
      "Tung-Huan Su",
      "Hitoshi Oura",
      "Masato Nishi",
      "Tadashi Naito",
      "Stan Chung",
      "Leo Shen"
    ],
    "publication_date": "2023-01-06T22:33:19Z",
    "arxiv_id": "http://arxiv.org/abs/2301.02738v1",
    "download_url": "https://arxiv.org/abs/2301.02738v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Standardizing Knowledge Engineering Practices with a Reference Architecture",
    "abstract": "Knowledge engineering is the process of creating and maintaining knowledge-producing systems. Throughout the history of computer science and AI, knowledge engineering workflows have been widely used given the importance of high-quality knowledge for reliable intelligent agents. Meanwhile, the scope of knowledge engineering, as apparent from its target tasks and use cases, has been shifting, together with its paradigms such as expert systems, semantic web, and language modeling. The intended use cases and supported user requirements between these paradigms have not been analyzed globally, as new paradigms often satisfy prior pain points while possibly introducing new ones. The recent abstraction of systemic patterns into a boxology provides an opening for aligning the requirements and use cases of knowledge engineering with the systems, components, and software that can satisfy them best. This paper proposes a vision of harmonizing the best practices in the field of knowledge engineering by leveraging the software engineering methodology of creating reference architectures. We describe how a reference architecture can be iteratively designed and implemented to associate user needs with recurring systemic patterns, building on top of existing knowledge engineering workflows and boxologies. We provide a six-step roadmap that can enable the development of such an architecture, providing an initial design and outcome of the definition of architectural scope, selection of information sources, and analysis. We expect that following through on this vision will lead to well-grounded reference architectures for knowledge engineering, will advance the ongoing initiatives of organizing the neurosymbolic knowledge engineering space, and will build new links to the software architectures and data science communities.",
    "authors": [
      "Bradley P. Allen",
      "Filip Ilievski"
    ],
    "publication_date": "2024-04-04T17:46:32Z",
    "arxiv_id": "http://arxiv.org/abs/2404.03624v1",
    "download_url": "https://arxiv.org/abs/2404.03624v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Empirical Software Engineering: From Discipline to Interdiscipline",
    "abstract": "Empirical software engineering has received much attention in recent years and coined the shift from a more design-science-driven engineering discipline to an insight-oriented, and theory-centric one. Yet, we still face many challenges, among which some increase the need for interdisciplinary research. This is especially true for the investigation of human-centric aspects of software engineering. Although we can already observe an increased recognition of the need for more interdisciplinary research in (empirical) software engineering, such research configurations come with challenges barely discussed from a scientific point of view. In this position paper, we critically reflect upon the epistemological setting of empirical software engineering and elaborate its configuration as an Interdiscipline. In particular, we (1) elaborate a pragmatic view on empirical research for software engineering reflecting a cyclic process for knowledge creation, (2) motivate a path towards symmetrical interdisciplinary research, and (3) adopt five rules of thumb from other interdisciplinary collaborations in our field before concluding with new emerging challenges. This shall support stopping to treating empirical software engineering as a developing discipline moving towards a paradigmatic stage of normal science, but as a configuration of symmetric interdisciplinary teams and research methods.",
    "authors": [
      "Daniel Méndez Fernández",
      "Jan-Hendrik Passoth"
    ],
    "publication_date": "2018-05-21T21:55:24Z",
    "arxiv_id": "http://arxiv.org/abs/1805.08302v3",
    "download_url": "https://arxiv.org/abs/1805.08302v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Retrieval Augmented Generation using Engineering Design Knowledge",
    "abstract": "Aiming to support Retrieval Augmented Generation (RAG) in the design process, we present a method to identify explicit, engineering design facts - {head entity :: relationship :: tail entity} from patented artefact descriptions. Given a sentence with a pair of entities (based on noun phrases) marked in a unique manner, our method extracts the relationship that is explicitly communicated in the sentence. For this task, we create a dataset of 375,084 examples and fine-tune language models for relation identification (token classification) and elicitation (sequence-to-sequence). The token classification approach achieves up to 99.7 % accuracy. Upon applying the method to a domain of 4,870 fan system patents, we populate a knowledge base of over 2.93 million facts. Using this knowledge base, we demonstrate how Large Language Models (LLMs) are guided by explicit facts to synthesise knowledge and generate technical and cohesive responses when sought out for knowledge retrieval tasks in the design process.",
    "authors": [
      "L. Siddharth",
      "Jianxi Luo"
    ],
    "publication_date": "2023-07-13T17:25:28Z",
    "arxiv_id": "http://arxiv.org/abs/2307.06985v10",
    "download_url": "https://arxiv.org/abs/2307.06985v10",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Mesh of Civilizations and International Email Flows",
    "abstract": "In The Clash of Civilizations, Samuel Huntington argued that the primary axis of global conflict was no longer ideological or economic but cultural and religious, and that this division would characterize the \"battle lines of the future.\" In contrast to the \"top down\" approach in previous research focused on the relations among nation states, we focused on the flows of interpersonal communication as a bottom-up view of international alignments. To that end, we mapped the locations of the world's countries in global email networks to see if we could detect cultural fault lines. Using IP-geolocation on a worldwide anonymized dataset obtained from a large Internet company, we constructed a global email network. In computing email flows we employ a novel rescaling procedure to account for differences due to uneven adoption of a particular Internet service across the world. Our analysis shows that email flows are consistent with Huntington's thesis. In addition to location in Huntington's \"civilizations,\" our results also attest to the importance of both cultural and economic factors in the patterning of inter-country communication ties.",
    "authors": [
      "Bogdan State",
      "Patrick Park",
      "Ingmar Weber",
      "Yelena Mejova",
      "Michael Macy"
    ],
    "publication_date": "2013-02-28T23:29:11Z",
    "arxiv_id": "http://arxiv.org/abs/1303.0045v2",
    "download_url": "https://arxiv.org/abs/1303.0045v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thinging for Software Engineers",
    "abstract": "The aim of this paper is to promote the terms thing and thinging (which refers to the act of defining a boundary around some portion of reality and labeling it with a name) as valued notions that play an important role in software engineering modeling. Additionally, we attempt to furnish operational definitions for terms thing, object, process, and thinging. The substantive discussion is based on the conception of an (abstract) machine, named the Thinging Machine (TM), used in several research works. The TM creates, processes, receives, releases, and transfers things. Accordingly, a diagrammatic representation of the TM is used to model reality. In the discussion section, this paper clarifies interesting issues related to conceptual modeling in software engineering. The substance of this paper and its conclusion suggest that thinging should be more meaningfully emphasized as a valuable research and teaching topic, at least in the requirement analysis phase of the software development cycle.",
    "authors": [
      "Sabah Al-Fedaghi"
    ],
    "publication_date": "2018-07-27T15:12:38Z",
    "arxiv_id": "http://arxiv.org/abs/1807.10673v1",
    "download_url": "https://arxiv.org/abs/1807.10673v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Social Science Theories in Software Engineering Research",
    "abstract": "As software engineering research becomes more concerned with the psychological, sociological and managerial aspects of software development, relevant theories from reference disciplines are increasingly important for understanding the field's core phenomena of interest. However, the degree to which software engineering research draws on relevant social sciences remains unclear. This study therefore investigates the use of social science theories in five influential software engineering journals over 13 years. It analyzes not only the extent of theory use but also what, how and where these theories are used. While 87 different theories are used, less than two percent of papers use a social science theory, most theories are used in only one paper, most social sciences are ignored, and the theories are rarely tested for applicability to software engineering contexts. Ignoring relevant social science theories may (1) undermine the community's ability to generate, elaborate and maintain a cumulative body of knowledge; and (2) lead to oversimplified models of software engineering phenomena. More attention to theory is needed for software engineering to mature as a scientific discipline.",
    "authors": [
      "Tobias Lorey",
      "Paul Ralph",
      "Michael Felderer"
    ],
    "publication_date": "2022-02-15T15:47:26Z",
    "arxiv_id": "http://arxiv.org/abs/2202.07519v1",
    "download_url": "https://arxiv.org/abs/2202.07519v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data Engineering for HPC with Python",
    "abstract": "Data engineering is becoming an increasingly important part of scientific discoveries with the adoption of deep learning and machine learning. Data engineering deals with a variety of data formats, storage, data extraction, transformation, and data movements. One goal of data engineering is to transform data from original data to vector/matrix/tensor formats accepted by deep learning and machine learning applications. There are many structures such as tables, graphs, and trees to represent data in these data engineering phases. Among them, tables are a versatile and commonly used format to load and process data. In this paper, we present a distributed Python API based on table abstraction for representing and processing data. Unlike existing state-of-the-art data engineering tools written purely in Python, our solution adopts high performance compute kernels in C++, with an in-memory table representation with Cython-based Python bindings. In the core system, we use MPI for distributed memory computations with a data-parallel approach for processing large datasets in HPC clusters.",
    "authors": [
      "Vibhatha Abeykoon",
      "Niranda Perera",
      "Chathura Widanage",
      "Supun Kamburugamuve",
      "Thejaka Amila Kanewala",
      "Hasara Maithree",
      "Pulasthi Wickramasinghe",
      "Ahmet Uyar",
      "Geoffrey Fox"
    ],
    "publication_date": "2020-10-13T11:53:11Z",
    "arxiv_id": "http://arxiv.org/abs/2010.06312v1",
    "download_url": "https://arxiv.org/abs/2010.06312v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Teaching Model-based Requirements Engineering to Industry Professionals: An Experience Report",
    "abstract": "The use of conceptual models to foster requirements engineering has been proposed and evaluated as beneficial for several decades. For instance, goal-oriented requirements engineering or the specification of scenarios are commonly done using conceptual models. Bringing such model-based requirements engineering approaches into industrial practice typically requires industrial training. In this paper, we report lessons learned from a training program for teaching industry professionals model-based requirements engineering. Particularly, we as educators and learners report experiences from designing the training program, conducting the actual training, and applying the instructed material in our day-to-day work. From these findings we provide guidelines for educators designing requirements engineering courses for industry professionals.",
    "authors": [
      "Marian Daun",
      "Jennifer Brings",
      "Marcel Goger",
      "Walter Koch",
      "Thorsten Weyer"
    ],
    "publication_date": "2021-03-07T19:40:14Z",
    "arxiv_id": "http://arxiv.org/abs/2103.04433v1",
    "download_url": "https://arxiv.org/abs/2103.04433v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering Timeline: major areas of interest and multidisciplinary trends",
    "abstract": "Society today cannot run without software and by extension, without Software Engineering. Since this discipline emerged in 1968, practitioners have learned valuable lessons that have contributed to current practices. Some have become outdated but many are still relevant and widely used. From the personal and incomplete perspective of the authors, this paper not only reviews the major milestones and areas of interest in the Software Engineering timeline helping software engineers to appreciate the state of things, but also tries to give some insights into the trends that this complex engineering will see in the near future.",
    "authors": [
      "Isabel M. del Águila",
      "José del Sagrado",
      "Joaquín Cañadas"
    ],
    "publication_date": "2020-02-24T10:57:45Z",
    "arxiv_id": "http://arxiv.org/abs/2002.10163v1",
    "download_url": "https://arxiv.org/abs/2002.10163v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Total Recall, Language Processing, and Software Engineering",
    "abstract": "A broad class of software engineering problems can be generalized as the \"total recall problem\". This short paper claims that identifying and exploring total recall language processing problems in software engineering is an important task with wide applicability.\n  To make that case, we show that by applying and adapting the state of the art active learning and text mining, solutions of the total recall problem, can help solve two important software engineering tasks: (a) supporting large literature reviews and (b) identifying software security vulnerabilities. Furthermore, we conjecture that (c) test case prioritization and (d) static warning identification can also be categorized as the total recall problem.\n  The widespread applicability of \"total recall\" to software engineering suggests that there exists some underlying framework that encompasses not just natural language processing, but a wide range of important software engineering tasks.",
    "authors": [
      "Zhe Yu",
      "Tim Menzies"
    ],
    "publication_date": "2018-08-31T19:37:20Z",
    "arxiv_id": "http://arxiv.org/abs/1809.00039v1",
    "download_url": "https://arxiv.org/abs/1809.00039v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]