[
  {
    "title": "Extreme-temperature single-particle heat engine",
    "abstract": "Carnot famously showed that engine operation is chiefly characterised by the\nmagnitude of the temperature ratio $T_\\mathrm{h}/T_\\mathrm{c}$ between its hot\nand cold reservoirs. While temperature ratios ranging between $1.3-2.8$ and\n$2-10$ are common in macroscopic commercial engines and engines operating in\nthe microscopic regime, respectively, the quest is to test thermodynamics at\nits extremes. Here we present the hottest engine on earth, with temperature\nratios as high as $110$. We achieve this by realising an underdamped\nsingle-particle engine using a charged microparticle that is electrically\nlevitated under vacuum conditions. Noisy electric fields are used to synthesise\nreservoir temperatures in excess of $10^7$ K. As a result, giant fluctuations\nshow up in all thermodynamic quantities of the engine, such as heat exchange\nand efficiency. Moreover, we find that the particle experiences an effective\nposition dependent temperature, which gives rise to dynamics that drastically\ndeviates from that of standard Brownian motion. We develop a theoretical model\naccounting for the effects of this multiplicative noise and find excellent\nagreement with the measured dynamics. The high level of control over the\npresented experimental platform opens the door to emulate the stochastic\ndynamics of cellular and biological processes, and provides thermodynamic\ninsight required for the development of nanotechnologies.",
    "authors": [
      "Molly Message",
      "Federico Cerisola",
      "Jonathan D. Pritchett",
      "Katie O'Flynn",
      "Yugang Ren",
      "Muddassar Rashid",
      "Janet Anders",
      "James Millen"
    ],
    "publication_date": "2025-01-07T10:23:43Z",
    "arxiv_id": "http://arxiv.org/abs/2501.03677v1",
    "download_url": "http://arxiv.org/abs/2501.03677v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simplest AB-Thermonuclear Space Propulsion and Electric Generator",
    "abstract": "The author applies, develops and researches mini-sized Micro- AB\nThermonuclear Reactors for space propulsion and space power systems. These\nsmall engines directly convert the high speed charged particles produced in the\nthermonuclear reactor into vehicle thrust or vehicle electricity with maximum\nefficiency. The simplest AB-thermonuclear propulsion offered allows spaceships\nto reach speeds of 20,000 50,000 km/s (1/6 of light speed) for fuel ratio 0.1\nand produces a huge amount of useful electric energy. Offered propulsion system\npermits flight to any planet of our Solar system in short time and to the\nnearest non-Sun stars by E-being or intellectual robots during a single human\nlife period.\n  Key words: AB-propulsion, thermonuclear propulsion, space propulsion,\nthermonuclear power system.",
    "authors": [
      "Alexander Bolonkin"
    ],
    "publication_date": "2007-01-19T17:58:46Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0701226v1",
    "download_url": "http://arxiv.org/abs/physics/0701226v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MCBs versus Fuses in Low-Voltage Applications: Critical Analysis Using\n  the 3-AND Convergence Classifier",
    "abstract": "The protection of any electrical installation is one of the most important\nconsiderations in the field of electrical engineering. The electrical\ninstallation should be protected against hazards such as overload current and\nshort circuit current conditions. The protection devices studied in this paper\nare the Miniature Circuit Breaker (MCB) and the High Rupturing Capacity (HRC)\nFuse. Using a new tool known as the 3-AND Convergence Classifier, it was\nobserved that the MCB is the most reliable in terms of offering protection\nagainst the damage caused by overload currents and the destruction caused by\nshort circuit currents.",
    "authors": [
      "Ishmael S. Msiza",
      "Mehmood Haffejee"
    ],
    "publication_date": "2007-09-22T18:48:36Z",
    "arxiv_id": "http://arxiv.org/abs/0709.3594v1",
    "download_url": "http://arxiv.org/abs/0709.3594v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electric field noise above surfaces: a model for heating rate scaling\n  law in ion traps",
    "abstract": "We present a model for the scaling laws of the electric field noise spectral\ndensity as a function of the distance, $d$, above a conducting surface. Our\nanalytical approach models the patch potentials by introducing a correlation\nlength, $\\zeta$, of the electric potential on the surface. The predicted\nscaling laws are in excellent agreement with two different classes of\nexperiments (cold trapped ions and cantilevers), that span at least four orders\nof magnitude of $d$. According to this model, heating rate in miniature ion\ntraps could be greatly reduced by proper material engineering.",
    "authors": [
      "Romain Dubessy",
      "Thomas Coudreau",
      "Luca Guidoni"
    ],
    "publication_date": "2008-12-17T20:00:11Z",
    "arxiv_id": "http://arxiv.org/abs/0812.3380v1",
    "download_url": "http://arxiv.org/abs/0812.3380v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrical conductivity of collapsed multilayer graphene tubes",
    "abstract": "Synthesis of multilayer graphene on copper wires by a chemical vapor\ndeposition method is reported. After copper etching, the multilayer tube\ncollapses forming stripes of graphitic films, their electrical conductance as a\nfunction of temperature indicate a semiconductor-like behavior. Using the\nmultilayer graphene stripes, a cross junction is built and owing to its\nelectrical behavior we propose that a tunneling process exists in the device.",
    "authors": [
      "D. Mendoza"
    ],
    "publication_date": "2011-10-17T21:01:03Z",
    "arxiv_id": "http://arxiv.org/abs/1110.3822v3",
    "download_url": "http://arxiv.org/abs/1110.3822v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fast and robust spin manipulation in a quantum dot by electric fields",
    "abstract": "We apply an invariant-based inverse engineering method to control by\ntime-dependent electric fields electron spin dynamics in a quantum dot with\nspin-orbit coupling in a weak magnetic field. The designed electric fields\nprovide a shortcut to adiabatic processes that flips the spin rapidly, thus\navoiding decoherence effects. This approach, being robust with respect to the\ndevice-dependent noise, can open new possibilities for the spin-based quantum\ninformation processing.",
    "authors": [
      "Yue Ban",
      "Xi Chen",
      "E. Ya Sherman",
      "J. G. Muga"
    ],
    "publication_date": "2012-08-24T02:17:27Z",
    "arxiv_id": "http://arxiv.org/abs/1208.4890v2",
    "download_url": "http://arxiv.org/abs/1208.4890v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A bimetal and electret-based converter for thermal energy harvesting",
    "abstract": "This paper presents a new device able to turn thermal gradients into\nelectricity by using a bimetal-based heat engine coupled to an electrostatic\nconverter. A two-steps conversion is performed: (i) a curved bimetallic strip\nturns the thermal gradient into a mechanical movement (thermal-to-mechanical\nconversion) that is (ii) then converted into electricity thanks to an\nelectret-based electrostatic converter (mechanical-to-electrical conversion).\nAn output power up to 5.5uW on a hot source at 50{\\deg}C has already been\nreached, validating this new concept.",
    "authors": [
      "S. Boisseau",
      "G. Despesse",
      "S. Monfray",
      "O. Puscasu",
      "T. Skotnicki"
    ],
    "publication_date": "2012-12-04T07:54:44Z",
    "arxiv_id": "http://arxiv.org/abs/1212.0852v1",
    "download_url": "http://arxiv.org/abs/1212.0852v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Revealing cracks inside conductive bodies by electric surface\n  measurements",
    "abstract": "An algorithm is introduced for using electrical surface measurements to\ndetect and monitor cracks inside a two-dimensional conductive body. The\ntechnique is based on transforming the probing functions of the classical\nenclosure method by the Kelvin transform. The transform makes it possible to\nuse virtual discs for probing the interior of the body using electric\nmeasurements performed on a flat surface. Theoretical results are presented to\nenable probing of the full domain to create a profile indicating cracks in the\ndomain. Feasibility of the method is demonstrated with a simulated model of\nattaching metal sheets together by resistance spot welding.",
    "authors": [
      "Andreas Hauptmann",
      "Masaru Ikehata",
      "Hiromichi Itou",
      "Samuli Siltanen"
    ],
    "publication_date": "2018-07-04T12:23:06Z",
    "arxiv_id": "http://arxiv.org/abs/1807.01538v1",
    "download_url": "http://arxiv.org/abs/1807.01538v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrical Impedance Tomography based on Genetic Algorithm",
    "abstract": "In this paper, we applies GA algorithm into Electrical Impedance Tomography\n(EIT) application. We first outline the EIT problem as an optimization problem\nand define a target optimization function. Then we show how the GA algorithm as\nan alternative searching algorithm can be used for solving EIT inverse problem.\nIn this paper, we explore evolutionary methods such as GA algorithms combined\nwith various regularization operators to solve EIT inverse computing problem.\n  Key words: Electrical Impedance Tomography (EIT), GA, Tikhonov operator ,\nMumford-Shah operator, Particle Swarm Optimization(PSO), Back Propagation(BP).",
    "authors": [
      "Mingyong Zhou"
    ],
    "publication_date": "2019-01-14T07:01:36Z",
    "arxiv_id": "http://arxiv.org/abs/1901.04872v1",
    "download_url": "http://arxiv.org/abs/1901.04872v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrical Impedance Tomography with Box Constraint for Skull\n  Conductivity Estimation",
    "abstract": "Unknown electric conductivities of human tissues is a common issue in medical\nengineering. Electrical impedance tomography (EIT) is an imaging modality that\ncan be used to determine these conductivities in vivo from boundary\nmeasurements. In this paper, we demonstrate that local conductivity values of\ndifferent skull segments can be solved from EIT measurements with the help of a\nbox constraint. Based on our numerical results, the accuracy of the results\ndepended on the locations of the current carrying electrodes and the signal to\nnoise ratio of the measurements. Particularly, the conductivity values of the\nskull segments that located below the current carrying electrodes were\nreconstructed more accurately.",
    "authors": [
      "Ville Rimpilainen",
      "Theodoros Samaras",
      "Alexandra Koulouri"
    ],
    "publication_date": "2020-01-31T13:47:48Z",
    "arxiv_id": "http://arxiv.org/abs/2001.11830v1",
    "download_url": "http://arxiv.org/abs/2001.11830v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the stability of harmonic mortar methods with application to electric\n  machines",
    "abstract": "Harmonic stator-rotor coupling offers a promising approach for the\ninterconnection of rotating subsystems in the simulation of electric machines.\nThis paper studies the stability of discretization schemes based on harmonic\ncoupling in the framework of mortar methods for Poisson-like problems. A\ngeneral criterion is derived that allows to ensure the relevant inf-sup\nstability condition for a variety of specific discretization approaches,\nincluding finite-element methods and isogeometric analysis with harmonic mortar\ncoupling. The validity and sharpness of the theoretical results is demonstrated\nby numerical tests.",
    "authors": [
      "Herbert Egger",
      "Mané Harutyunyan",
      "Melina Merkel",
      "Sebastian Schöps"
    ],
    "publication_date": "2020-05-25T10:48:25Z",
    "arxiv_id": "http://arxiv.org/abs/2005.12020v1",
    "download_url": "http://arxiv.org/abs/2005.12020v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magic trapping of a Rydberg ion with a diminished static polarizability",
    "abstract": "Highly excited Rydberg states are usually extremely polarizable and\nexceedingly sensitive to electric fields. Because of this Rydberg ions confined\nin electric fields have state-dependent trapping potentials. We engineer a\nRydberg state that is insensitive to electric fields by coupling two Rydberg\nstates with static polarizabilities of opposite sign, in this way we achieve\nstate-independent magic trapping. We show that the magically-trapped ion can be\ncoherently excited to the Rydberg state without the need for control of the\nion's motion.",
    "authors": [
      "Fabian Pokorny",
      "Chi Zhang",
      "Gerard Higgins",
      "Markus Hennrich"
    ],
    "publication_date": "2020-05-25T21:57:31Z",
    "arxiv_id": "http://arxiv.org/abs/2005.12422v1",
    "download_url": "http://arxiv.org/abs/2005.12422v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Laserless quantum gates for electric dipoles in thermal motion",
    "abstract": "Internal states of polar molecules can be controlled by microwave-frequency\nelectric dipole transitions. If the applied microwave electric field has a\nspatial gradient, these transitions also affect the motion of these dipolar\nparticles. This capability can be used to engineer phonon-mediated quantum\ngates between e.g. trapped polar molecular ion qubits without laser\nillumination and without the need for cooling near the motional ground state.\nThe result is a high-speed quantum processing toolbox for dipoles in thermal\nmotion that combines the precision microwave control of solid-state qubits with\nthe long coherence times of trapped ion qubits.",
    "authors": [
      "Eric R. Hudson",
      "Wesley C. Campbell"
    ],
    "publication_date": "2020-11-16T23:22:45Z",
    "arxiv_id": "http://arxiv.org/abs/2011.08330v1",
    "download_url": "http://arxiv.org/abs/2011.08330v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Hybrid Model for Forecasting Short-Term Electricity Demand",
    "abstract": "Currently the UK Electric market is guided by load (demand) forecasts\npublished every thirty minutes by the regulator. A key factor in predicting\ndemand is weather conditions, with forecasts published every hour. We present\nHYENA: a hybrid predictive model that combines feature engineering (selection\nof the candidate predictor features), mobile-window predictors and finally LSTM\nencoder-decoders to achieve higher accuracy with respect to mainstream models\nfrom the literature. HYENA decreased MAPE loss by 16\\% and RMSE loss by 10\\%\nover the best available benchmark model, thus establishing a new state of the\nart for the UK electric load (and price) forecasting.",
    "authors": [
      "Maria Eleni Athanasopoulou",
      "Justina Deveikyte",
      "Alan Mosca",
      "Ilaria Peri",
      "Alessandro Provetti"
    ],
    "publication_date": "2022-05-20T22:13:25Z",
    "arxiv_id": "http://arxiv.org/abs/2205.10449v1",
    "download_url": "http://arxiv.org/abs/2205.10449v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electric double layer effect in an extreme near-field heat transfer\n  between metal surfaces",
    "abstract": "Calculations of heat transfer between two plates of gold in an extreme near\nfield is performed taking into account the existence of the electric double\nlayer on metal surfaces. For d < 3nm the double layer contribution exceeds the\npredictions of the conversional theory of the heat transfer by several orders\nof magnitudes. This effect is due to a coupling between the radiation electric\nfield and the double layer dipole moment. The results obtained can be used for\nthe heat management at the nanoscale by intentionally changing the parameters\nof surface dipoles with the help of engineering.",
    "authors": [
      "A. I. Volokitin"
    ],
    "publication_date": "2020-08-17T04:42:59Z",
    "arxiv_id": "http://arxiv.org/abs/2008.07084v3",
    "download_url": "http://arxiv.org/abs/2008.07084v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum geometry and dipolar dynamics in the orbital magneto-electric\n  effect",
    "abstract": "We show that the orbital magneto-electric effect (OME) -- the generation of a\nsteady-state orbital angular momentum density -- is partly the result of a\nnonequilibrium dipole moment generated via Zitterbewegung and proportional to\nthe quantum metric. For tilted massive Dirac fermions this dipole gives the\nonly contribution to the OME in the insulating case, while the intrinsic and\nextrinsic OMEs occur for different electric field orientations, yielding an\nexperimental detection method. Our results suggest quantum metric engineering\nas a route towards maximizing orbital torques.",
    "authors": [
      "James H. Cullen",
      "Daniel P. Arovas",
      "Roberto Raimondi",
      "Dimitrie Culcer"
    ],
    "publication_date": "2025-05-05T18:00:05Z",
    "arxiv_id": "http://arxiv.org/abs/2505.02911v2",
    "download_url": "http://arxiv.org/abs/2505.02911v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Low frequency noise statistics for the breakdown characterization of\n  ultra-thin gate oxides",
    "abstract": "We have investigated the statistics of low frequency noise in the tunneling\ncurrent of ultrathin oxides (2.5nm-4nm) in metal oxide semiconductor capacitors\nas a function of the applied voltage stress. The statistical analysis includes\n(i) non-Gaussianity (nG), which is a measure of the degree of temporal\ncorrelation in the noise, and (ii) ratio of integrated noise power to the DC\nleakage current (R). The occurrence of high peaks in nG indicates the\nappearance of new percolation paths, and the subsequent conduction through\nthese paths is indicated by R. Our results show that the nG and R\ncharacteristics are generic for the oxides of different thickness and growth\nquality and have the potential, in conjunction with leakage itself, of being\nused as a prognosticator of oxide reliability.",
    "authors": [
      "N. Z. Butt",
      "A. M. Chang",
      "H. Raza",
      "R. Bashir",
      "J. Liu",
      "D. L. Kwong"
    ],
    "publication_date": "2005-08-16T17:10:48Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0508370v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0508370v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "USBcat - Towards an Intrusion Surveillance Toolset",
    "abstract": "This paper identifies an intrusion surveillance framework which provides an\nanalyst with the ability to investigate and monitor cyber-attacks in a covert\nmanner. Where cyber-attacks are perpetrated for the purposes of espionage the\nability to understand an adversary's techniques and objectives are an important\nelement in network and computer security. With the appropriate toolset,\nsecurity investigators would be permitted to perform both live and stealthy\ncounter-intelligence operations by observing the behaviour and communications\nof the intruder. Subsequently a more complete picture of the attacker's\nidentity, objectives, capabilities, and infiltration could be formulated than\nis possible with present technologies. This research focused on developing an\nextensible framework to permit the covert investigation of malware.\nAdditionally, a Universal Serial Bus (USB) Mass Storage Device (MSD) based\ncovert channel was designed to enable remote command and control of the\nframework. The work was validated through the design, implementation and\ntesting of a toolset.",
    "authors": [
      "Chris Chapman",
      "Scott Knight",
      "Tom Dean"
    ],
    "publication_date": "2014-10-16T05:53:54Z",
    "arxiv_id": "http://arxiv.org/abs/1410.4304v1",
    "download_url": "http://arxiv.org/abs/1410.4304v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pedestrian-Aware Engine Management Strategies for Plug-in Hybrid\n  Electric Vehicles",
    "abstract": "Electric Vehicles (EVs) and Plug-in Hybrid Electric Vehicles (PHEVs) are\nincreasingly being seen as a means of mitigating the pressing concerns of\ntraffic-related pollution. While hybrid vehicles are usually designed with the\nobjective of minimising fuel consumption, in this paper we propose engine\nmanagement strategies that also take into account environmental effects of the\nvehicles to pedestrians outside of the vehicles. Specifically, we present\noptimisation based engine energy management strategies for PHEVs, that attempt\nto minimise the environmental impact of pedestrians along the route of the\nvehicle, while taking account of route dependent uncertainties. We implement\nthe proposed approach in a real PHEV, and evaluate the performance in a\nhardware-in-the-loop platform. A variety of simulation results are given to\nillustrate the efficacy of our proposed approach.",
    "authors": [
      "Yingqi Gu",
      "Mingming Liu",
      "Joe Naoum-Sawaya",
      "Emanuele Crisostomi",
      "Giovanni Russo",
      "Robert Shorten"
    ],
    "publication_date": "2016-12-22T12:20:21Z",
    "arxiv_id": "http://arxiv.org/abs/1612.07568v2",
    "download_url": "http://arxiv.org/abs/1612.07568v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How an Electrical Engineer Became an Artificial Intelligence Researcher,\n  a Multiphase Active Contours Analysis",
    "abstract": "This essay examines how what is considered to be artificial intelligence (AI)\nhas changed over time and come to intersect with the expertise of the author.\nInitially, AI developed on a separate trajectory, both topically and\ninstitutionally, from pattern recognition, neural information processing,\ndecision and control systems, and allied topics by focusing on symbolic systems\nwithin computer science departments rather than on continuous systems in\nelectrical engineering departments. The separate evolutions continued\nthroughout the author's lifetime, with some crossover in reinforcement learning\nand graphical models, but were shocked into converging by the virality of deep\nlearning, thus making an electrical engineer into an AI researcher. Now that\nthis convergence has happened, opportunity exists to pursue an agenda that\ncombines learning and reasoning bridged by interpretable machine learning\nmodels.",
    "authors": [
      "Kush R. Varshney"
    ],
    "publication_date": "2018-03-29T21:11:32Z",
    "arxiv_id": "http://arxiv.org/abs/1803.11261v1",
    "download_url": "http://arxiv.org/abs/1803.11261v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hairy black holes and holographic heat engine",
    "abstract": "By considering AdS charged black hole in the context of extended\nthermodynamic as the working substance we use it as a heat engine. We\ninvestigate the effect of hairy charge on the evolution of efficiency and\nCarnot efficiency along with electric charge. Because of interesting\nthermodynamic behavior of hairy black holes it would be natural to know their\neffects when we use black hole as a heat engine. We show that the hairy charge\nincreases the efficiency, and so maximum temperature would be happened for\nbigger Maxwell charge when this hairy charge grows. For the fixed electric\ncharges, the efficiency has a minimum value. In fact all critical points\ndescribe physical states except when the charge removed. If the electric charge\ntakes a zero value then the hairy charge must be negative. We also seek\nbehavior of the system for large charges which is provided a model with\nlow-temperature thermodynamics.",
    "authors": [
      "Hossein Ghaffarnejad",
      "Emad Yaraie",
      "Mohammad Farsam",
      "Kazuharu Bamba"
    ],
    "publication_date": "2018-09-26T16:35:46Z",
    "arxiv_id": "http://arxiv.org/abs/1809.10142v3",
    "download_url": "http://arxiv.org/abs/1809.10142v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Amplitude and phase control of guided modes excitation from a single\n  dipole source:engineering far- and near-field directionality",
    "abstract": "The design of far-field radiation diagrams from combined electric and\nmagnetic dipolar sources has recently found applications in nanophotonic\nmetasurfaces that realize tailored reflection and refraction. Such dipolar\nsources also exhibit important near-field evanescent coupling properties with\napplications in polarimetry and quantum optics. Here we introduce a rigorous\ntheoretical framework for engineering the angular spectra encompassing both\nfar- and near-fields of electric and magnetic sources and develop a unified\ndescription of both free space and guided mode directional radiation. The\napproach uses the full parametric space of six complex-valued components of\nmagnetic and electric dipoles in order to engineer constructive or destructive\nnear-field interference. Such dipolar sources can be realized with dielectric\nor plasmonic nanoparticles. We show how a single dipolar source can be designed\nto achieve the selective coupling to multiple waveguide modes and far-field\nsimultaneously with a desired amplitude, phase, and direction.",
    "authors": [
      "Michela F. Picardi",
      "Anatoly V. Zayats",
      "Francisco J. Rodríguez-Fortuño"
    ],
    "publication_date": "2019-07-15T16:29:52Z",
    "arxiv_id": "http://arxiv.org/abs/1907.06573v1",
    "download_url": "http://arxiv.org/abs/1907.06573v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modulated Signals in Chemical Reaction Networks",
    "abstract": "Electrical engineering and molecular programming share many of the same\nmathematical foundations. In this paper, we show how to send multiple signals\nthrough a single pair of chemical species using modulation and demodulation\ntechniques found in electrical engineering. Key to our construction, we provide\nchemical implementations of classical linear band-pass and low-pass filters\nwith induced differential equations that are identical to their electrical\nengineering counterparts. We show how to modulate \\emph{arbitrary} independent\ninput signals with different carrier frequencies for transmission through a\nshared medium. Specific signals in the medium can then be isolated and\ndemodulated using band-pass and low-pass filters. Such programmable chemical\nband-pass filters also offer a way to monitor chemical systems to verify that\nthey are operating between a prescribed set of frequencies.",
    "authors": [
      "Titus H. Klinge",
      "James I. Lathrop"
    ],
    "publication_date": "2020-09-14T19:30:22Z",
    "arxiv_id": "http://arxiv.org/abs/2009.06703v1",
    "download_url": "http://arxiv.org/abs/2009.06703v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Separating the Expressive Power of Propositional Dynamic and Modal\n  Fixpoint Logics",
    "abstract": "We investigate the expressive power of the two main kinds of program logics\nfor complex, non-regular program properties found in the literature: those\nextending propositional dynamic logic (PDL), and those extending the modal\nmu-calculus. This is inspired by the recent discovery of a decidable program\nlogic called Visibly Pushdown Fixpoint Logic with Chop which extends both the\nmodal mu-calculus and PDL over visibly pushdown languages, which, so far,\nconstituted the ends of two pillars of decidable program logics.\n  Here we show that this logic is not only more expressive than either of its\ntwo fragments, but in fact even more expressive than their union. Hence, the\ndecidability border amongst program logics has been properly pushed up. We\ncomplete the picture by providing results separating all the PDL-based and\nmodal fixpoint logics with regular, visibly pushdown and arbitrary context-free\nconstructions.",
    "authors": [
      "Eric Alsmann",
      "Florian Bruse",
      "Martin Lange"
    ],
    "publication_date": "2021-08-24T02:39:21Z",
    "arxiv_id": "http://arxiv.org/abs/2108.10490v1",
    "download_url": "http://arxiv.org/abs/2108.10490v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Scaling Analysis in a Multi-Energy System",
    "abstract": "This paper presents a scaling study on the planning phase of a multi-energy\nsystem (MES), which is becoming increasingly prominent in the energy sector.\nThe research aims to investigate the interactions and challenges associated\nwith integrating heat and electrical systems and scaling their components. In\nthis context, interaction between these two domains are investigated and the\nsize of the distributed energy resources in the MES is scaled to examine the\nimpact of sizing on the integrating networks and their controlling system. To\nachieve this, the paper uses sensitivity analysis and a meta-modeling\ntechnique, both incorporated in a toolbox for scaling analysis. These\nmethodologies are validated through simulations, and the results obtained from\nthe simulations can contribute to the advancement of MESs and their\nimplementation in laboratory and field testing.",
    "authors": [
      "Jan Soeren Schwarz",
      "Minh Cong Pham",
      "Quoc Tuan Tran",
      "Kai Heussen"
    ],
    "publication_date": "2024-10-23T06:57:25Z",
    "arxiv_id": "http://arxiv.org/abs/2410.17603v1",
    "download_url": "http://arxiv.org/abs/2410.17603v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Imaging electrical activity of neurons with metamaterial nanosensors",
    "abstract": "A technology for recording electrical activity of large neuron populations at\narbitrary depth in brain tissues with less than cell spatial and millisecond\ntemporal resolutions was the most craving dream of neuroscientists and a long\npursued goal of engineers for decades. Even though many imaging techniques have\nbeen devised up to date, none of them is capable to deliver either\nquantitatively valid data nor able to meet contradictory requirements posed for\nsensors to be safe, non-invasive and reliably working either within cultured\ncell populations or during chronic implantations in vivo. In my research\nproject, I design and justify a novel nanobiosensors, capable to detect and\noptically report the electric fields across cellular membrane and investigate\nproperties of that specially engineered plasmonic nanoantennas. In the\nfollowing literature survey, I observe the current state of electrophysiology\nmethods and after recalling the basics of fluorescence, discuss benefits and\ndrawbacks of today's voltage sensitive labelling and electric fields imaging\nmethods. This review is wrapped up by a brief outlook of prospective\napplications of this technology.",
    "authors": [
      "Roman V. Beletskiy"
    ],
    "publication_date": "2013-08-30T02:11:22Z",
    "arxiv_id": "http://arxiv.org/abs/1308.6636v1",
    "download_url": "http://arxiv.org/abs/1308.6636v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering the magnetic anisotropy of atomic-scale nanostructure under\n  electric field",
    "abstract": "Atomic-scale magnetic nanostructures are promising candidates for future\ninformation processing devices. Utilizing external electric field to manipulate\ntheir magnetic properties is an especially thrilling project. Here, by careful\nidentifying different contributions of each atomic orbital to the magnetic\nanisotropy energy (MAE) of the ferromagnetic metal films, we argue that it is\npossible to engineer both the MAE and the magnetic response to the electric\nfield of atomic-scale magnetic nanostructures. Taking the iron monolayer as a\nmatrix, we propose several interesting iron nanostructures with dramatically\ndifferent magnetic properties. Such nanostructures could exhibit strong\nmagnetoelectric effect. Our work may open a new avenue to the artificial design\nof electrically controlled magnetic devices.",
    "authors": [
      "Wanjiao Zhu",
      "Hang-Chen Ding",
      "Wen-Yi Tong",
      "Shi-Jing Gong",
      "Xiangang Wan",
      "Chun-Gang Duan"
    ],
    "publication_date": "2015-08-17T03:45:04Z",
    "arxiv_id": "http://arxiv.org/abs/1508.03917v1",
    "download_url": "http://arxiv.org/abs/1508.03917v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Phase Transition in Quantum Heat Engine Cycles",
    "abstract": "We explore signatures of a topological phase transition (TPT) in the work and\nefficiency of a quantum heat engine, which uses a single layer topological\ninsulator, stanene, in an external electric field as a working substance. The\nmagnitude of the electric field controls the trivial and topological insulator\nphases of the stanene. We investigate the effects of TPT in two types of\nthermodynamic cycles, with and without adiabatic stages. For the adiabatic\ncase, we examine a quantum Otto cycle. We find that at the critical point of\nTPT both work and efficiency plots with respect to the strength of the electric\nfield exhibit a kink. For a non-adiabatic case, we consider an idealized\nStirling type cycle with two isothermal and two isoelectric processes. We find\nno signatures of the TPT unless a voltage bias is introduced to restrict the\ninvolved energy bands to the electronic manifold above the Fermi level. In this\ncase, either above or below the critical point, both work and efficiency become\nzero depending on the relative magnitudes of the electric fields in the\nisoelectric stages.",
    "authors": [
      "Mojde Fadaie",
      "Elif Yunt",
      "Özgür E. Müstecaplıoğlu"
    ],
    "publication_date": "2018-06-27T23:57:19Z",
    "arxiv_id": "http://arxiv.org/abs/1806.10717v2",
    "download_url": "http://arxiv.org/abs/1806.10717v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling and Simulation of Solar Photovoltaic Cell for the Generation of\n  Electricity in UAE",
    "abstract": "This paper proposes the implementation of a circuit based simulation for a\nSolar Photovoltaic (PV) cell in order to get the maximum power output. The\nmodel is established based on the mathematical model of the PV module. As the\nPV cell is used to determine the physical and electrical behavior of the cell\ncorresponding to environmental factors such as temperature and solar\nirradiance, this paper evaluates thirty years solar irradiation data in United\nArab Emirates (UAE), also analyzes the performance parameters of PV cell for\nseveral locations. Based on the Shockley diode equation, a solar PV module is\npresented. However, to analyze the performance parameters, Solarex MSX 120, a\ntypical 120W module is selected. The mathematical model for the chosen module\nis executed in Matlab. The consequence of this paper reflects the effects of\nvariation of solar irradiation on PV cell within UAE. Conclusively, this paper\ndetermines the convenient places for implementing the large scale solar PV\nmodules within UAE.",
    "authors": [
      "Shadman Sakib",
      "Md. Abu Bakr Siddique"
    ],
    "publication_date": "2019-02-26T12:16:36Z",
    "arxiv_id": "http://arxiv.org/abs/1903.10308v3",
    "download_url": "http://arxiv.org/abs/1903.10308v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Plasma gun for medical applications: engineering an equivalent\n  electrical target of human body and deciphering relevant electrical\n  parameters",
    "abstract": "Simulations and experimental works have been carried out in a complementary\nway to engineer a basic material target mimicking the same dielectric\nproperties of the human body. It includes a resistor in parallel with a\ncapacitor, whose values (Rh=1500 {\\Omega} and Ch=100 pF) are estimated in\nregard of parameters commonly utilized upon in vivo campaigns (frequency=30\nkHz, gap=10 mm, high voltage electrode surface=12.6 mm2). This equivalent\nelectrical human body (EEHB) circuit can be used as a reference and realistic\ntarget to calibrate electrical properties of therapeutic plasma sources before\ntheir utilization on patients. In this letter, we consider a configuration\nwhere this EEHB target interacts with a plasma gun (PG). Plasma power\nmeasurements performed in such configuration clearly indicate two operating\nmodes depending on the value of the supplied voltage. Hence, the plasma gun\ngenerates pulsed atmospheric plasma streams likely to present therapeutic\ninterest for voltages comprised between 3.0 and 8.5 kV while for higher values,\ntransient arcs of thermal plasma are generated and represent substantial risks\nfor the patient.",
    "authors": [
      "Florian Judée",
      "Thierry Dufour"
    ],
    "publication_date": "2019-11-24T16:22:13Z",
    "arxiv_id": "http://arxiv.org/abs/1911.10565v1",
    "download_url": "http://arxiv.org/abs/1911.10565v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fusing electrical and elasticity imaging",
    "abstract": "Electrical and elasticity imaging are promising modalities for a suite of\ndifferent applications including medical tomography, non-destructive testing,\nand structural health monitoring. These emerging modalities are capable of\nproviding remote, non-invasive, and low cost opportunities. Unfortunately, both\nmodalities are severely ill-posed nonlinear inverse problems, susceptive to\nnoise and modelling errors. Nevertheless, the ability to incorporate\ncomplimentary data sets obtained simultaneously offers mutually-beneficial\ninformation. By fusing electrical and elastic modalities as a joint problem we\nare afforded the possibility to stabilise the inversion process via the\nutilisation of auxiliary information from both modalities as well as joint\nstructural operators. In this study, we will discuss a possible approach to\ncombine electrical and elasticity imaging in a joint reconstruction problem\ngiving rise to novel multi-modality applications for use in both medical and\nstructural engineering.",
    "authors": [
      "Andreas Hauptmann",
      "Danny Smyl"
    ],
    "publication_date": "2020-10-14T07:19:10Z",
    "arxiv_id": "http://arxiv.org/abs/2010.06847v2",
    "download_url": "http://arxiv.org/abs/2010.06847v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$G$-deviations of polygons and their applications in Electric Power\n  Engineering",
    "abstract": "For any metric space $X$ endowed with the action of a group $G$, and two\n$n$-gons $\\vec x=(x_1,\\dots,x_n)\\in X^n$ and $\\vec y=(y_1,\\dots,y_n)\\in X^n$ in\n$X$, we introduce the $G$-deviation $d(G\\vec x,\\vec y\\,)$ of $\\vec x$ from\n$\\vec y$ as the distance in $X^n$ from $\\vec y$ to the $G$-orbit $G\\vec x$ of\n$\\vec x$ in the $n$-th power $X^n$ of $X$. For some groups $G$ of affine\ntransformations of the complex plane, we deduce simple-to-apply formulas for\ncalculating the $G$-derviation between $n$-gons on the complex plane. We apply\nthese formulas for defining new measures of asymmetry of triangles. These new\nmeasures can be applied in Electric Power Engineering for evaluating the\nquality of 3-phase electric power. One of such measures, namely the affine\ndeviation, is espressible via the unbalance degree, which is a standard\ncharacteristic of quality of three-phase electric power.",
    "authors": [
      "Taras Banakh",
      "Olena Hryniv",
      "Vasyl Hudym"
    ],
    "publication_date": "2021-06-05T12:03:21Z",
    "arxiv_id": "http://arxiv.org/abs/2106.02877v1",
    "download_url": "http://arxiv.org/abs/2106.02877v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High Dielectric Sheet to reduce Electric Fields and Flatten Magnetic\n  Fields in Self-decoupled Radiofrequency coils for MR Imaging",
    "abstract": "High impedance RF coils, such as self-decoupled coils, reduce the\nelectromagnetic coupling between the coil elements and eliminates the use of\ncomplex decoupling technologies. Although the high impedance design promises\nexcellent decoupling between the coil elements, it also results in high\nelectric fields across the RF coil, leading to potential safety problems during\nimaging. It also causes B1 field asymmetry, ultimately leading to difficulties\nin imaging quantification. In this study, we propose and investigate using a\nhigh dielectric sheet to reduce the electric fields across the coil and achieve\nexcellent electromagnetic decoupling among the coil elements, thereby ensuring\nsafer MRI at ultra-high fields and maintaining high imaging performance.",
    "authors": [
      "Aditya Bhosale",
      "Xiaoliang Zhang"
    ],
    "publication_date": "2022-05-30T03:38:06Z",
    "arxiv_id": "http://arxiv.org/abs/2205.14830v1",
    "download_url": "http://arxiv.org/abs/2205.14830v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Functional Component Descriptions for Electrical Circuits based on\n  Semantic Technology Reasoning",
    "abstract": "Circuit diagrams have been used in electrical engineering for decades to\ndescribe the wiring of devices and facilities. They depict electrical\ncomponents in a symbolic and graph-based manner. While the circuit design is\nusually performed electronically, there are still legacy paper-based diagrams\nthat require digitization in order to be used in CAE systems. Generally,\nknowledge on specific circuits may be lost between engineering projects, making\nit hard for domain novices to understand a given circuit design. The\ngraph-based nature of these documents can be exploited by semantic\ntechnology-based reasoning in order to generate human-understandable\ndescriptions of their functional principles. More precisely, each electrical\ncomponent (e.g. a diode) of a circuit may be assigned a high-level function\nlabel which describes its purpose within the device (e.g. flyback diode for\nreverse voltage protection). In this paper, forward chaining rules are used for\nsuch a generation. The described approach is applicable for both CAE-based\ncircuits as well as raw circuits yielded by an image understanding pipeline.\nThe viability of the approach is demonstrated by application to an existing set\nof circuits.",
    "authors": [
      "Johannes Bayer",
      "Mina Karami Zadeh",
      "Markus Schröder",
      "Andreas Dengel"
    ],
    "publication_date": "2022-06-23T13:22:52Z",
    "arxiv_id": "http://arxiv.org/abs/2209.05533v1",
    "download_url": "http://arxiv.org/abs/2209.05533v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Elucidating the Influence of Native Defects on Electrical and Optical\n  Properties in Semiconducting Oxides: An Experimental and Theoretical\n  Investigation",
    "abstract": "Defect engineering using self-doping or creating vacancies in polycrystalline\noxide based materials has profound influence on optical absorption, UV photo\ndetection, and electrical switching. However, defects induced semiconducting\noxide devices show enhancement in photo detection and photosensitivity, and\nhence still remain interesting in the field of optoelectronics. In this study,\ndefect engineering in semiconducting oxide materials is discussed along with\ntheir roles in optoelectronic device-based applications. Theoretical\ninvestigations have been done for identifying defect states by performing\nfirst-principles electronic structure calculations, employing the\ndensity-functional theory. Particularly, in this work, we have focused on\nprobing the defect-induced changes in optical and electrical processes by means\nof experimental as well as computational investigations. Hence, systematic\nexperimental measurements of optical absorption, electrical switching, charge\ndensity, and photocurrent in defect-rich semiconducting oxide samples have been\nperformed. Our results suggest that defects can lead to enhancement of\noptoelectronic properties such as photocurrent, switching speed, optical\nabsorption, etc. for semiconducting oxide based devices.",
    "authors": [
      "Shashi Pandey",
      "Alok Shukla",
      "Anurag Tripathi"
    ],
    "publication_date": "2021-12-11T07:39:00Z",
    "arxiv_id": "http://arxiv.org/abs/2112.05926v1",
    "download_url": "http://arxiv.org/abs/2112.05926v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering artificial atomic systems of giant electric dipole moment",
    "abstract": "The electric dipole moment (EDM) plays a crucial role in determining the\ninteraction strength of an atom with electric fields, making it paramount to\nquantum technologies based on coherent atomic control. We propose a scheme for\nengineering the potential in a Paul trap to realize a two-level quantum system\nwith a giant EDM formed by the motional states of a trapped electron. We show\nthat, under realistic experimental conditions, the EDM can significantly exceed\nthe ones attainable with Rydberg atoms. Furthermore, we show that such\nartificial atomic dipoles can be efficiently initialized, readout, and\ncoherently controlled, thereby providing a potential platform for quantum\ntechnologies such as ultrahigh-sensitivity electric-field sensing.",
    "authors": [
      "Baiyi Yu",
      "Yaoming Chu",
      "Ralf Betzholz",
      "Shaoliang Zhang",
      "Jianming Cai"
    ],
    "publication_date": "2023-04-21T04:07:51Z",
    "arxiv_id": "http://arxiv.org/abs/2304.10735v1",
    "download_url": "http://arxiv.org/abs/2304.10735v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrical engineering of topological magnetism in two-dimensional\n  heterobilayers",
    "abstract": "The emergence of topological magnetism in two-dimensional (2D) van der Waals\n(vdW) magnetic materials promoted 2D heterostructures as key building-blocks of\ndevices for information technology based on topological concepts. Here, we\ndemonstrate the all-electric switching of the topological nature of individual\nmagnetic objects emerging in 2D vdW heterobillayers. We show from the first\nprinciples that an external electric field modifies the vdW gap between CrTe\n$_2$ and (Rh, Ti)Te$_2$ layers and alters the underlying magnetic interactions.\nThis enables switching between ferromagnetic skyrmions and meron pairs in the\nCrTe$_2$/RhTe$_2$ heterobilayer while it enhances the stability of frustrated\nantiferromagnetic merons in the CrTe$_2$/TiTe$_2$ heterobilayer. We envision\nthat the electrical engineering of distinct topological magnetic solitons in a\nsingle device could pave the way for novel energy-efficient mechanisms to store\nand transmit information with applications in spintronics.",
    "authors": [
      "Nihad Abuawwad",
      "Manuel dos Santos Dias",
      "Hazem Abusara",
      "Samir Lounis"
    ],
    "publication_date": "2023-11-02T15:11:02Z",
    "arxiv_id": "http://arxiv.org/abs/2311.01294v1",
    "download_url": "http://arxiv.org/abs/2311.01294v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Explainability-Driven Feature Engineering for Mid-Term Electricity Load\n  Forecasting in ERCOT's SCENT Region",
    "abstract": "Accurate load forecasting is essential to the operation of modern electric\npower systems. Given the sensitivity of electricity demand to weather\nvariability and temporal dynamics, capturing non-linear patterns is essential\nfor long-term planning. This paper presents a comparative analysis of machine\nlearning models, Linear Regression, XGBoost, LightGBM, and Long Short-Term\nMemory (LSTM), for forecasting system-wide electricity load up to one year in\nadvance. Midterm forecasting has shown to be crucial for maintenance\nscheduling, resource allocation, financial forecasting, and market\nparticipation. The paper places a focus on the use of a method called \"Shapley\nAdditive Explanations\" (SHAP) to improve model explainability. SHAP enables the\nquantification of feature contributions, guiding informed feature engineering\nand improving both model transparency and forecasting accuracy.",
    "authors": [
      "Abhiram Bhupatiraju",
      "Sung Bum Ahn"
    ],
    "publication_date": "2025-07-29T20:36:24Z",
    "arxiv_id": "http://arxiv.org/abs/2507.22220v1",
    "download_url": "http://arxiv.org/abs/2507.22220v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-Abelian Electric Field and Zitterbewegung on a Photonic Frequency\n  Chain",
    "abstract": "The synthetic frequency dimension, which realizes fictitious spatial\ndimensions from the spectral degree of freedom, has emerged as a promising\nplatform for engineering artificial gauge fields in studying quantum\nsimulations and topological physics with photons. A current central task for\nfrequency-domain photons is the creation and manipulation of nontrivial\nnon-Abelian field strength tensors and observing their governing dynamics.\nHere, we experimentally demonstrate a miniaturized scheme for creating\nnon-Abelian electric fields in a photonic frequency chain using a\npolarization-multiplexed, time-modulated ring resonator. By engineering\nspin-orbit coupling via modulation dephasing, polarization rotation, and\npolarization retardation, we achieve programmable control over synthetic\nFloquet bands and their quasimomentum spin-resolved textures. Leveraging\nself-heterodyne coherent detection, we demonstrate Zitterbewegung -- a\ntrembling motion of photons -- induced by non-Abelian electric fields on the\nfrequency chain. We further observe the interference between Zitterbewegung and\nBloch oscillations arising from the coexistence of non-Abelian and Abelian\nelectric fields. Our work bridges synthetic dimensions with non-Abelian gauge\ntheory for versatile photonic emulation of relativistic quantum mechanics and\nspinor dynamics, and can be instrumental in applications like frequency-domain\noptical computation and multimodal frequency comb control.",
    "authors": [
      "Shu Yang",
      "Bengy Tsz Tsun Wong",
      "Yi Yang"
    ],
    "publication_date": "2025-09-11T09:44:36Z",
    "arxiv_id": "http://arxiv.org/abs/2509.09304v1",
    "download_url": "http://arxiv.org/abs/2509.09304v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Allocation of locally generated electricity in renewable energy\n  communities",
    "abstract": "Local electricity markets represent a way of supplementing traditional\nretailing contracts for end consumers -- among these markets, the renewable\nenergy community has gained momentum over the last few years. This paper\nproposes a practical and readily to be adopted modelling solution for these\ncommunities, one that allows their members to share the economic benefits\nderived from them. The proposed solution relies on an \\emph{ex-post} allocation\nof the electricity that is generated within energy communities (i.e., local\nelectricity) based on the optimisation of \\emph{repartition keys}. Repartition\nkeys are therefore optimally computed to represent the proportion of total\nlocal electricity to be allocated to each community member, and aim to minimise\nthe sum of electricity bills of all community members. Since the optimisation\ntakes place \\emph{ex-post} the repartition keys do not modify the actual\nelectricity flows, but rather the financial flows of the community members.\nThen, the billing process of the community will take these keys into account to\ncorrectly send the electricity bills to each member. Building on this concept,\nwe also introduce two additions to the basic algorithm to enhance the stability\nof the community, which a global bill minimisation may fail to ensure (e.g.,\nvery asymmetrical solutions between members may lead to some of them opting\nout).",
    "authors": [
      "Miguel Manuel de Villena",
      "Samy Aittahar",
      "Sebastien Mathieu",
      "Ioannis Boukas",
      "Eric Vermeulen",
      "Damien Ernst"
    ],
    "publication_date": "2020-09-09T21:51:38Z",
    "arxiv_id": "http://arxiv.org/abs/2009.05411v2",
    "download_url": "http://arxiv.org/abs/2009.05411v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An electromechanically coupled beam model for dielectric elastomer\n  actuators",
    "abstract": "In this work, the Cosserat formulation of geometrically exact beam dynamics\nis extended by adding the electric potential as an additional degree of freedom\nto account for the electromechanical coupling in the Dielectric Elastomer\nActuators (DEAs). To be able to generate complex beam deformations via\ndielectric actuator, a linear distribution of electric potential on the beam\ncross section is proposed. Based on this electric potential, the electric field\nand the strain-like electrical variable are defined for the beam, where the\nstrain-like electrical variable is work-conjugated to the electric\ndisplacement. The electromechanically coupled strain energy for the beam is\nderived consistently from continuum electromechanics, which leads to the direct\napplication of the material models in the continuum to the beam model. The\nelectromechanically coupled problem in beam dynamics is first spatially\nsemidiscretized by 1D finite elements and then solved via variational time\nintegration. By applying different electrical boundary conditions, different\ndeformations of the beam are obtained in the numerical examples, including\ncontraction, shear, bending and torsion. The damping effect induced by the\nviscosity as well as the total energy of the beam are evaluated. The\ndeformations of the electromechanically coupled beam model are compared with\nthe results of the 3D finite element model, where a good agreement of the\ndeformations in the beam model and that in the 3D finite element model is\nobserved. However, less degrees of freedom are required to resolve the complex\ndeformations in the beam model.",
    "authors": [
      "Dengpeng Huang",
      "Sigrid Leyendecker"
    ],
    "publication_date": "2021-02-15T14:32:29Z",
    "arxiv_id": "http://arxiv.org/abs/2103.06373v1",
    "download_url": "http://arxiv.org/abs/2103.06373v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrostatic AB-Ramjet Space Propulsion",
    "abstract": "A new electrostatic ramjet space engine is proposed and analyzed. The upper\natmosphere (85 -1000 km) is extremely dense in ions (millions per cubic cm).\nThe interplanetary medium contains positive protons from the solar wind. A\ncharged ball collects the ions (protons) from the surrounding area and a\nspecial electric engine accelerates the ions to achieve thrust or decelerates\nthe ions to achieve drag. The thrust may have a magnitude of several Newtons.\nIf the ions are decelerated, the engine produces a drag and generates\nelectrical energy. The theory of the new engine is developed. It is shown that\nthe proposed engine driven by a solar battery (or other energy source) can not\nonly support satellites in their orbit for a very long time but can also work\nas a launcher of space apparatus. The latter capability includes launch to high\norbit, to the Moon, to far space, or to the Earth atmosphere (as a return\nthruster for space apparatus or as a killer of space debris). The proposed\nramjet is very useful in interplanetary trips to far planets because it can\nsimultaneously produce thrust or drag and large electric energy using the solar\nwind. Two scenarios, launch into the upper Earth atmosphere and an\ninterplanetary trip, are simulated and the results illustrate the excellent\npossibilities of the new concept.",
    "authors": [
      "Alexander Bolonkin"
    ],
    "publication_date": "2007-01-08T18:52:04Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0701072v1",
    "download_url": "http://arxiv.org/abs/physics/0701072v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrically tunable Floquet Weyl photon emission from Dirac semimetal\n  Cd3As2",
    "abstract": "The ability to optically engineer the Dirac band and electrically control the\nFermi level in two-dimensional (2D) Dirac systems, such as graphene, has\nsignificantly advanced quantum technologies. However, similar tunability has\nremained elusive in three-dimensional Dirac systems. In this work, we\ndemonstrate both optical and electrical tunability of the band structure in the\n3D Dirac semimetal Cd3As2. Photoexcitation with circularly polarized light\nbreaks time-reversal symmetry, lifting the degeneracy at Dirac points to\ntransform the material into a Floquet Weyl semimetal with chiral Weyl nodes.\nThis transition induces nonzero Berry curvature, giving rise to\nhelicity-dependent transverse anomalous photocurrents, detectable through\nterahertz emission at normal incidence. Furthermore, applying an external\nelectric field displaces the Fermi level away from the Dirac point, enlarging\nthe Dirac cone projection leading to a reduced density of states of Fermi arcs.\nAs a result, we achieve precise electrical control over Floquet band\nengineering, resulting in a large modulation of THz emission. Moreover, at\noblique incidence, the circular photon-drag effect induces helicity-dependent\nlongitudinal photocurrents. Simultaneous generation and manipulation of both\nlongitudinal and transverse photocurrents enable precise control of the\nhelicity of emitted THz pulses. These results pave the way for electric\nfield-controlled Floquet Weyl THz sources, offering significant potential for\napplications in quantum computing and low-power electronics.",
    "authors": [
      "Sobhan Subhra Mishra",
      "Thomas CaiWei Tan",
      "Manoj Gupta",
      "Faxian Xiu",
      "Ranjan Singh"
    ],
    "publication_date": "2025-01-27T21:00:20Z",
    "arxiv_id": "http://arxiv.org/abs/2501.16498v1",
    "download_url": "http://arxiv.org/abs/2501.16498v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hybrid Microwave-Cavity Heat Engine",
    "abstract": "We propose and analyze the use of hybrid microwave cavities as quantum heat\nengines. A possible realization consists of two macroscopically separated\nquantum dot conductors coupled capacitively to the fundamental mode of a\nmicrowave cavity. We demonstrate that an electrical current can be induced in\none conductor through cavity-mediated processes by heating up the other\nconductor. The heat engine can reach Carnot efficiency with optimal conversion\nof heat to work. When the system delivers the maximum power, the efficiency can\nbe a large fraction of the Carnot efficiency. The heat engine functions even\nwith moderate electronic relaxation and dephasing in the quantum dots. We\nprovide detailed estimates for the electrical current and output power using\nrealistic parameters.",
    "authors": [
      "Christian Bergenfeldt",
      "Peter Samuelsson",
      "Björn Sothmann",
      "Christian Flindt",
      "Markus Büttiker"
    ],
    "publication_date": "2013-07-18T05:13:53Z",
    "arxiv_id": "http://arxiv.org/abs/1307.4833v2",
    "download_url": "http://arxiv.org/abs/1307.4833v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-temperature ferroelectricity in SrTiO$_{3}$ crystals",
    "abstract": "SrTiO$_{3}$ is known to be an incipient ferroelectric. It is thought that\nferroelectric stability in SrTiO$_{3}$ is suppressed by a delicate competition\nwith quantum fluctuation and antiferrodistortion. The ferroelectric phase can,\nhowever, be stabilized by doping, isotope manipulation and strain engineering\netc. Till date ferroelectricity in SrTiO$_{3}$ thin films was observed to exist\nup to room temperature -- that was when the films were grown on specially\nengineered substrates using complex growth techniques. It was possible to write\nand erase ferroelectric domains on the specially engineered films at room\ntemperature. Here, we show remarkably similar ferroelectric behavior in bulk\n(110) single crystals of SrTiO$_{3}$ with no special engineering well above\nroom temperature using piezoresponse force microscopy. Hysteretic switching of\nlocal electric polarization was observed and electrically active domains could\nbe written and erased using lithographic techniques at remarkably high\ntemperatures up to $420K$.",
    "authors": [
      "Ashima Arora",
      "Goutam Sheet"
    ],
    "publication_date": "2014-04-21T19:11:22Z",
    "arxiv_id": "http://arxiv.org/abs/1404.5272v1",
    "download_url": "http://arxiv.org/abs/1404.5272v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering matter interactions using squeezed vacuum",
    "abstract": "Virtually all interactions that are relevant for atomic and condensed matter\nphysics are mediated by quantum fluctuations of the electromagnetic field\nvacuum. Consequently, controlling the vacuum fluctuations can be used to\nengineer the strength and the range of interactions. Recent experiments have\nused this premise to demonstrate novel quantum phases or entangling gates by\nembedding electric dipoles in photonic cavities or waveguides, which modify the\nelectromagnetic fluctuations. Here, we show theoretically that the enhanced\nfluctuations in the anti-squeezed quadrature of a squeezed vacuum state allows\nfor engineering interactions between electric dipoles without the need for a\nphotonic structure. Thus, the strength and range of the interactions can be\nengineered in a time-dependent way by changing the spatial profile of the\nsqueezed vacuum in a travelling-wave geometry, which also allows the\nimplementation of chiral dissipative interactions. Using experimentally\nrealized squeezing parameters and including realistic losses, we predict single\natom cooperativities $C$ of up to 10 for the squeezed vacuum enhanced\ninteractions.",
    "authors": [
      "Sina Zeytinoglu",
      "Atac Imamoglu",
      "Sebastian Huber"
    ],
    "publication_date": "2016-08-09T20:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/1608.02937v2",
    "download_url": "http://arxiv.org/abs/1608.02937v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Single-Item Fashion Recommender: Towards Cross-Domain Recommendations",
    "abstract": "Nowadays, recommender systems and search engines play an integral role in\nfashion e-commerce. Still, many challenges lie ahead, and this study tries to\ntackle some. This article first suggests a content-based fashion recommender\nsystem that uses a parallel neural network to take a single fashion item shop\nimage as input and make in-shop recommendations by listing similar items\navailable in the store. Next, the same structure is enhanced to personalize the\nresults based on user preferences. This work then introduces a background\naugmentation technique that makes the system more robust to out-of-domain\nqueries, enabling it to make street-to-shop recommendations using only a\ntraining set of catalog shop images. Moreover, the last contribution of this\npaper is a new evaluation metric for recommendation tasks called\nobjective-guided human score. This method is an entirely customizable framework\nthat produces interpretable, comparable scores from subjective evaluations of\nhuman scorers.",
    "authors": [
      "Seyed Omid Mohammadi",
      "Hossein Bodaghi",
      "Ahmad Kalhor"
    ],
    "publication_date": "2021-11-01T08:15:31Z",
    "arxiv_id": "http://arxiv.org/abs/2111.00758v2",
    "download_url": "http://arxiv.org/abs/2111.00758v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Superconducting Spintronic Heat Engine",
    "abstract": "Heat engines are key devices that convert thermal energy into usable energy.\nStrong thermoelectricity, at the basis of electrical heat engines, is present\nin superconducting spin tunnel barriers at cryogenic temperatures where\nconventional semiconducting or metallic technologies cease to work. Here we\nrealize a superconducting spintronic heat engine consisting of a ferromagnetic\ninsulator/superconductor/insulator/ferromagnet tunnel junction\n(EuS/Al/AlO$_x$/Co). The efficiency of the engine is quantified for bath\ntemperatures ranging from 25 mK up to 800 mK, and at different load\nresistances. Moreover, we show that the sign of the generated thermoelectric\nvoltage can be inverted according to the parallel or anti-parallel orientation\nof the two ferromagnetic layers, EuS and Co. This realizes a thermoelectric\nspin valve controlling the sign and strength of the Seebeck coefficient,\nthereby implementing a thermoelectric memory cell. We propose a theoretical\nmodel that allows describing the experimental data and predicts the engine\nefficiency for different device parameters.",
    "authors": [
      "Clodoaldo I. L. de Araujo",
      "Pauli Virtanen",
      "Maria Spies",
      "Carmen González-Orellana",
      "Samuel Kerschbaumer",
      "Maxim Ilyn",
      "Celia Rogero",
      "Tero T. Heikkilä",
      "Francesco Giazotto",
      "E. Strambini"
    ],
    "publication_date": "2023-10-27T13:23:48Z",
    "arxiv_id": "http://arxiv.org/abs/2310.18132v1",
    "download_url": "http://arxiv.org/abs/2310.18132v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]