[
  {
    "title": "Towards chemical accuracy with shallow quantum circuits: A\n  Clifford-based Hamiltonian engineering approach",
    "abstract": "Achieving chemical accuracy with shallow quantum circuits is a significant\nchallenge in quantum computational chemistry, particularly for near-term\nquantum devices. In this work, we present a Clifford-based Hamiltonian\nengineering algorithm, namely CHEM, that addresses the trade-off between\ncircuit depth and accuracy. Based on variational quantum eigensolver and\nhardware-efficient ansatz, our method designs Clifford-based Hamiltonian\ntransformation that (1) ensures a set of initial circuit parameters\ncorresponding to the Hartree--Fock energy can be generated, (2) effectively\nmaximizes the initial energy gradient with respect to circuit parameters, (3)\nimposes negligible overhead for classical processing and does not require\nadditional quantum resources, and (4) is compatible with any circuit topology.\nWe demonstrate the efficacy of our approach using a quantum hardware emulator,\nachieving chemical accuracy for systems as large as 12 qubits with fewer than\n30 two-qubit gates. Our Clifford-based Hamiltonian engineering approach offers\na promising avenue for practical quantum computational chemistry on near-term\nquantum devices.",
    "authors": [
      "Jiace Sun",
      "Lixue Cheng",
      "Weitang Li"
    ],
    "publication_date": "2023-06-21T06:49:56Z",
    "arxiv_id": "http://arxiv.org/abs/2306.12053v3",
    "download_url": "http://arxiv.org/abs/2306.12053v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sensitivity Assessment of Multi-Criteria Decision-Making Methods in\n  Chemical Engineering Optimization Applications",
    "abstract": "This chapter assesses the sensitivity of multi-criteria decision-making\n(MCDM) methods to modifications within the decision or objective matrix (DOM)\nin the context of chemical engineering optimization applications. Employing\neight common or recent MCDM methods and three weighting methods, this study\nevaluates the impact of three specific DOM alterations: linear transformation\nof an objective (LTO), reciprocal objective reformulation (ROR), and the\nremoval of alternatives (RA). Our comprehensive analysis reveals that the\nweights generated by entropy method are more sensitive to the examined\nmodifications compared to the criteria importance through intercriteria\ncorrelation (CRITIC) and standard deviation (StDev) methods. ROR is found to\nhave the largest effect on the ranking of alternatives. Moreover, certain\nmethods, gray relational analysis (GRA) without any weights, multi-attributive\nborder approximation area comparison (MABAC), combinative distance-based\nassessment (CODAS), and simple additive weighting (SAW) with entropy or CRITIC\nweights, and CODAS, SAW, and technique for order of preference by similarity to\nideal solution (TOPSIS) with StDev weight are more robust to DOM modifications.\nThis investigation not only corroborates the findings from the previous study,\nbut also offers insights into the stability and reliability of MCDM methods in\nthe context of chemical engineering.",
    "authors": [
      "Seyed Reza Nabavi",
      "Zhiyuan Wang",
      "Gade Pandu Rangaiah"
    ],
    "publication_date": "2024-03-18T08:42:53Z",
    "arxiv_id": "http://arxiv.org/abs/2403.11569v1",
    "download_url": "http://arxiv.org/abs/2403.11569v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multi-Criteria Decision Making in Chemical and Process Engineering:\n  Methods, Progress and Potential",
    "abstract": "Multi-criteria decision making (MCDM) is necessary for choosing one from the\navailable alternatives (or from the obtained Pareto-optimal solutions for\nmulti-objective optimization), where the performance of each alternative is\nquantified against several criteria (or objectives). This paper presents a\ncomprehensive review of the application of MCDM methods in chemical and process\nengineering. It systematically outlines the essential steps in MCDM, including\nthe various normalization, weighting, and MCDM methods that are critical to the\ndecision-making. The review draws on published papers identified through a\nsearch in the SCOPUS database, focusing on works by authors with more\ncontributions to the field. Each selected paper is analyzed based on the MCDM,\nnormalization and weighting methods used. Additionally, this paper introduces\ntwo readily available programs for performing MCDM calculations. In short, it\nprovides insights into MCDM steps and methods, highlights their applications in\nchemical engineering, and discusses the challenges and prospects in this area.",
    "authors": [
      "Zhiyuan Wang",
      "Seyed Reza Nabavi",
      "Gade Pandu Rangaiah"
    ],
    "publication_date": "2024-10-08T06:17:41Z",
    "arxiv_id": "http://arxiv.org/abs/2410.05713v2",
    "download_url": "http://arxiv.org/abs/2410.05713v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Chemical Engines: Pseudo-Static Processes and the Mechanism of\n  Energy Transduction",
    "abstract": "We propose a simple theoretical model for a molecular chemical engine that\ncatalyzes a chemical reaction and converts the free energy released by the\nreaction into mechanical work. Binding and unbinding processes of reactant and\nproduct molecules to and from the engine are explicitly taken into account. The\nwork delivered by the engine is calculated analytically for infinitely slow\n(``pseudo-static'') processes, which can be reversible (quasi-static) or\nirreversible, controlled by an external agent. It is shown that the work larger\nthan the maximum value limited by the second law of thermodynamics can be\nobtained in a single cycle of operation by chance, although the statistical\naverage of the work never exceeds this limit and the maximum work is delivered\nif the process is reversible. The mechanism of the energy transductionis also\ndiscussed.",
    "authors": [
      "Kazuo Sasaki"
    ],
    "publication_date": "2005-08-01T08:42:14Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0508037v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0508037v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Michaelis-Menten at 100 and allosterism at 50: driving molecular motors\n  in a hailstorm with noisy ATPase engines and allosteric transmission",
    "abstract": "Cytoskeletal motor proteins move on filamentous tracks by converting input\nchemical energy that they derive by catalyzing the hydrolysis of ATP. The\nATPase site is the analog of an engine and hydrolysis of ATP is the analog of\nburning of chemical fuel. Moreover, the functional role of a segment of the\nmotor is analogous to that of the transmission system of an automobile that\nconsists of shaft, gear, clutch, etc. The operation of the engine is\nintrinsically \"noisy\" and the motor faces a molecular \"hailstorm\" in the\naqueous medium. In this commemorative article, we celebrate the centenary of\nMichaelis and Menten's landmark paper of 1913 and the golden jubilee of Monod\net al.'s classic paper of 1963 by highlighting their relevance in explaining\nthe operational mechanisms of the engine and the transmission system,\nrespectively, of cytoskeletal motors.",
    "authors": [
      "Debashish Chowdhury"
    ],
    "publication_date": "2017-05-30T14:10:15Z",
    "arxiv_id": "http://arxiv.org/abs/1705.10653v1",
    "download_url": "http://arxiv.org/abs/1705.10653v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Machine Learning in Thermodynamics: Prediction of Activity Coefficients\n  by Matrix Completion",
    "abstract": "Activity coefficients, which are a measure of the non-ideality of liquid\nmixtures, are a key property in chemical engineering with relevance to modeling\nchemical and phase equilibria as well as transport processes. Although\nexperimental data on thousands of binary mixtures are available, prediction\nmethods are needed to calculate the activity coefficients in many relevant\nmixtures that have not been explored to-date. In this report, we propose a\nprobabilistic matrix factorization model for predicting the activity\ncoefficients in arbitrary binary mixtures. Although no physical descriptors for\nthe considered components were used, our method outperforms the\nstate-of-the-art method that has been refined over three decades while\nrequiring much less training effort. This opens perspectives to novel methods\nfor predicting physico-chemical properties of binary mixtures with the\npotential to revolutionize modeling and simulation in chemical engineering.",
    "authors": [
      "Fabian Jirasek",
      "Rodrigo A. S. Alves",
      "Julie Damay",
      "Robert A. Vandermeulen",
      "Robert Bamler",
      "Michael Bortz",
      "Stephan Mandt",
      "Marius Kloft",
      "Hans Hasse"
    ],
    "publication_date": "2020-01-29T03:16:23Z",
    "arxiv_id": "http://arxiv.org/abs/2001.10675v1",
    "download_url": "http://arxiv.org/abs/2001.10675v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Applications of Machine Learning to Optimizing Polyolefin Manufacturing",
    "abstract": "This chapter is a preprint from our book by , focusing on leveraging machine\nlearning (ML) in chemical and polyolefin manufacturing optimization. It's\ncrafted for both novices and seasoned professionals keen on the latest ML\napplications in chemical processes. We trace the evolution of AI and ML in\nchemical industries, delineate core ML components, and provide resources for ML\nbeginners. A detailed discussion on various ML methods is presented, covering\nregression, classification, and unsupervised learning techniques, with\nperformance metrics and examples. Ensemble methods, deep learning networks,\nincluding MLP, DNNs, RNNs, CNNs, and transformers, are explored for their\ngrowing role in chemical applications. Practical workshops guide readers\nthrough predictive modeling using advanced ML algorithms. The chapter\nculminates with insights into science-guided ML, advocating for a hybrid\napproach that enhances model accuracy. The extensive bibliography offers\nresources for further research and practical implementation. This chapter aims\nto be a thorough primer on ML's practical application in chemical engineering,\nparticularly for polyolefin production, and sets the stage for continued\nlearning in subsequent chapters. Please cite the original work [169,170] when\nreferencing.",
    "authors": [
      "Niket Sharma",
      "Y. A. Liu"
    ],
    "publication_date": "2024-01-18T06:57:05Z",
    "arxiv_id": "http://arxiv.org/abs/2401.09753v1",
    "download_url": "http://arxiv.org/abs/2401.09753v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum thermochemical engines",
    "abstract": "Conversion of chemical energy into mechanical work is the fundamental\nmechanism of several natural phenomena at the nanoscale, like molecular\nmachines and Brownian motors. Quantum mechanical effects are relevant for\noptimising these processes and to implement them at the atomic scale. This\npaper focuses on engines that transform chemical work into mechanical work\nthrough energy and particle exchanges with thermal sources at different\nchemical potentials. Irreversibility is introduced by modelling the engine\ntransformations with finite-time dynamics generated by a time-depending quantum\nmaster equation. Quantum degenerate gases provide maximum efficiency for\nreversible engines, whereas the classical limit implies small efficiency. For\nirreversible engines, both the output power and the efficiency at maximum power\nare much larger in the quantum regime than in the classical limit. The analysis\nof ideal homogeneous gases grasps the impact of quantum statistics on the above\nperformances, which persists in the presence of interactions and more general\ntrapping. The performance dependence on different types of Bose-Einstein\nCondensates (BECs) is also studied. BECs under considerations are standard BECs\nwith a finite fraction of particles in the ground state, and generalised BECs\nwhere eigenstates with parallel momenta, or those with coplanar momenta are\nmacroscopically occupied according to the confinement anisotropy. Quantum\nstatistics is therefore a resource for enhanced performances of converting\nchemical into mechanical work.",
    "authors": [
      "Ugo Marzolino"
    ],
    "publication_date": "2022-08-08T13:41:04Z",
    "arxiv_id": "http://arxiv.org/abs/2208.04132v2",
    "download_url": "http://arxiv.org/abs/2208.04132v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Prescriptive to Predictive: an Interdisciplinary Perspective on the\n  Future of Computational Chemistry",
    "abstract": "Reliable predictions of the behaviour of chemical systems are essential\nacross many industries, from nanoscale engineering over validation of advanced\nmaterials to nanotoxicity assessment in health and medicine. For the future we\ntherefore envision a paradigm shift for the design of chemical simulations\nacross all length scales from a prescriptive to a predictive and quantitative\nscience. This paper presents an integrative perspective about the\nstate-of-the-art of modelling in computational and theoretical chemistry with\nexamples from data- and equation-based models. Extension to include reliable\nrisk assessments and quality control are discussed. To specify and broaden the\nconcept of chemical accuracy in the design cycle of reliable and robust\nmolecular simulations the fields of computational chemistry, physics,\nmathematics, visualisation science, and engineering are bridged. Methods from\nelectronic structure calculations serve as examples to explain how\nuncertainties arise: through assumed mechanisms in form of equations, model\nparameters, algorithms, and numerical implementations. We provide a full\nclassification of uncertainties throughout the chemical modelling cycle and\ndiscuss how the associated risks can be mitigated. Further, we apply our\nstatements to molecular dynamics and partial differential equations based\napproaches. An overview of methods from numerical mathematics and statistics\nprovides strategies to analyse risks and potential errors in the design of new\nmaterials and compounds. We also touch on methods for validation and\nverification. In the conclusion we address cross-disciplinary open challenges.\nIn future the quantitative analysis of where simulations and their prognosis\nfail will open doors towards predictive materials engineering and chemical\nmodelling.",
    "authors": [
      "Judith B. Rommel"
    ],
    "publication_date": "2021-03-04T10:27:27Z",
    "arxiv_id": "http://arxiv.org/abs/2103.02933v1",
    "download_url": "http://arxiv.org/abs/2103.02933v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Synchronization of coupled maps and stable, dissipative windows",
    "abstract": "Synchronization among globally coupled, chaotic map lattices can be related\nto stable periodic windows in isolated chaotic maps. This relation provides a\nsimple predictive tool for the understanding of complicated behavior in coupled\nphysical, chemical and biological systems.",
    "authors": [
      "Troy Shinbrot"
    ],
    "publication_date": "1993-06-09T14:27:23Z",
    "arxiv_id": "http://arxiv.org/abs/chao-dyn/9306004v1",
    "download_url": "http://arxiv.org/abs/chao-dyn/9306004v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integrating Chemistry Knowledge in Large Language Models via Prompt\n  Engineering",
    "abstract": "This paper presents a study on the integration of domain-specific knowledge\nin prompt engineering to enhance the performance of large language models\n(LLMs) in scientific domains. A benchmark dataset is curated to encapsulate the\nintricate physical-chemical properties of small molecules, their drugability\nfor pharmacology, alongside the functional attributes of enzymes and crystal\nmaterials, underscoring the relevance and applicability across biological and\nchemical domains.The proposed domain-knowledge embedded prompt engineering\nmethod outperforms traditional prompt engineering strategies on various\nmetrics, including capability, accuracy, F1 score, and hallucination drop. The\neffectiveness of the method is demonstrated through case studies on complex\nmaterials including the MacMillan catalyst, paclitaxel, and lithium cobalt\noxide. The results suggest that domain-knowledge prompts can guide LLMs to\ngenerate more accurate and relevant responses, highlighting the potential of\nLLMs as powerful tools for scientific discovery and innovation when equipped\nwith domain-specific prompts. The study also discusses limitations and future\ndirections for domain-specific prompt engineering development.",
    "authors": [
      "Hongxuan Liu",
      "Haoyu Yin",
      "Zhiyao Luo",
      "Xiaonan Wang"
    ],
    "publication_date": "2024-04-22T16:55:44Z",
    "arxiv_id": "http://arxiv.org/abs/2404.14467v1",
    "download_url": "http://arxiv.org/abs/2404.14467v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Out-of-equilibrium quantum thermochemical engine with one-dimensional\n  Bose gas",
    "abstract": "We theoretically explore the finite-time performance of a quantum\nthermochemical engine using a harmonically trapped 1D Bose gas in the\nquasicondensate regime as the working fluid. Operating on an Otto cycle, the\nengine's unitary work strokes involve quenches of interatomic interactions,\ntreating the fluid as a closed many-body quantum system evolving dynamically\nfrom an initial thermal state. During thermalization strokes, the fluid is an\nopen system in diffusive contact with a reservoir, enabling both heat and\nparticle exchange. Using a c--field approach, we demonstrate that the engine\noperates via chemical work, driven by particle flow from the hot reservoir. The\nengine's performance is analyzed in two regimes: (i) the out-of-equilibrium\nregime, maximizing power at reduced efficiency, and (ii) the quasistatic limit,\nachieving maximum efficiency but zero power due to slow driving. Remarkably,\nchemical work enables maximum efficiency even in sudden quench regime, offering\na favorable trade-off between power and efficiency. Finally, we connect this\nwork to prior research, showing that a zero-temperature adiabatic cycle\nprovides an upper bound for efficiency and work at finite temperatures.",
    "authors": [
      "Vijit V. Nautiyal"
    ],
    "publication_date": "2024-11-20T05:15:20Z",
    "arxiv_id": "http://arxiv.org/abs/2411.13041v2",
    "download_url": "http://arxiv.org/abs/2411.13041v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chem-R: Learning to Reason as a Chemist",
    "abstract": "Although large language models (LLMs) have significant potential to advance\nchemical discovery, current LLMs lack core chemical knowledge, produce\nunreliable reasoning trajectories, and exhibit suboptimal performance across\ndiverse chemical tasks. To address these challenges, we propose Chem-R, a\ngeneralizable Chemical Reasoning model designed to emulate the deliberative\nprocesses of chemists. Chem-R is trained through a three-phase framework that\nprogressively builds advanced reasoning capabilities, including: 1) Chemical\nFoundation Training, which establishes core chemical knowledge. 2) Chemical\nReasoning Protocol Distillation, incorporating structured, expert-like\nreasoning traces to guide systematic and reliable problem solving. 3)\nMulti-task Group Relative Policy Optimization that optimizes the model for\nbalanced performance across diverse molecular- and reaction-level tasks. This\nstructured pipeline enables Chem-R to achieve state-of-the-art performance on\ncomprehensive benchmarks, surpassing leading large language models, including\nGemini-2.5-Pro and DeepSeek-R1, by up to 32% on molecular tasks and 48% on\nreaction tasks. Meanwhile, Chem-R also consistently outperforms the existing\nchemical foundation models across both molecular and reaction level tasks.\nThese results highlight Chem-R's robust generalization, interpretability, and\npotential as a foundation for next-generation AI-driven chemical discovery. The\ncode and model are available at https://github.com/davidweidawang/Chem-R.",
    "authors": [
      "Weida Wang",
      "Benteng Chen",
      "Di Zhang",
      "Wanhao Liu",
      "Shuchen Pu",
      "Ben Gao",
      "Jin Zeng",
      "Xiaoyong Wei",
      "Tianshu Yu",
      "Shuzhou Sun",
      "Tianfan Fu",
      "Wanli Ouyang",
      "Lei Bai",
      "Jiatong Li",
      "Zifu Wang",
      "Yuqiang Li",
      "Shufei Zhang"
    ],
    "publication_date": "2025-10-19T15:27:13Z",
    "arxiv_id": "http://arxiv.org/abs/2510.16880v2",
    "download_url": "http://arxiv.org/abs/2510.16880v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Discrete Four Stroke Quantum Heat Engine Exploring the Origin of\n  Friction",
    "abstract": "The optimal power performance of a first principle quantum heat engine model\nshows friction-like phenomena when the internal fluid Hamiltonian does not\ncommute with the external control field. The model is based on interacting\ntwo-level-systems where the external magnetic field serves as a control\nvariable.",
    "authors": [
      "Ronnie Kosloff",
      "Tova Feldmann"
    ],
    "publication_date": "2001-11-12T13:39:37Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0111098v1",
    "download_url": "http://arxiv.org/abs/physics/0111098v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Critique of some thermodynamic proofs based on the pump-engine couple",
    "abstract": "We argue that all the common thermodynamic proofs based on the pump-engine\ncouple possess an inherent circularity and hence are of doubtful value. In\ncertain cases, ways of avoiding them are suggested. In others, the difficulties\nare discussed. Particularly, we emphasize that a neat proof of Carnot theorems\nrequires the entropic formulation of the second law.",
    "authors": [
      "Kamal Bhattacharyya"
    ],
    "publication_date": "2008-03-25T06:07:53Z",
    "arxiv_id": "http://arxiv.org/abs/0803.3494v1",
    "download_url": "http://arxiv.org/abs/0803.3494v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Performance of discrete heat engines and heat pumps in finite time",
    "abstract": "The performance in finite time of a discrete heat engine with internal\nfriction is analyzed. The working fluid of the engine is composed of an\nensemble of noninteracting two level systems. External work is applied by\nchanging the external field and thus the internal energy levels. The friction\ninduces a minimal cycle time. The power output of the engine is optimized with\nrespect to time allocation between the contact time with the hot and cold baths\nas well as the adiabats. The engine's performance is also optimized with\nrespect to the external fields. By reversing the cycle of operation a heat pump\nis constructed. The performance of the engine as a heat pump is also optimized.\nBy varying the time allocation between the adiabats and the contact time with\nthe reservoir a universal behavior can be identified. The optimal performance\nof the engine when the cold bath is approaching absolute zero is studied. It is\nfound that the optimal cooling rate converges linearly to zero when the\ntemperature approaches absolute zero.",
    "authors": [
      "Tova Feldmann",
      "Ronnie Kosloff"
    ],
    "publication_date": "2000-03-02T12:06:37Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0003007v1",
    "download_url": "http://arxiv.org/abs/physics/0003007v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Laterally-confined two-dimensional electron gases in self-patterned\n  LaAlO3/SrTiO3 interfaces",
    "abstract": "A bottom-up process has been used to engineer the LaAlO3/SrTiO3 interface\natomic composition and locally confine the two-dimensional electron gas to\nlateral sizes in the order of 100 nm. This is achieved by using SrTiO3(001)\nsubstrate surfaces with self-patterned chemical termination, which is\nreplicated by the LaAlO3 layer, resulting in a modulated LaO/TiO2 and AlO2/SrO\ninterface composition. We demonstrate the confinement of the conducting\ninterface forming either long-range ordered nanometric stripes or isolated\nregions. Our results demonstrate that engineering the interface chemical\ntermination is a suitable strategy towards nanoscale lateral confinement of\ntwo-dimensional high-mobility systems.",
    "authors": [
      "M. Foerster",
      "R. Bachelet",
      "V. Laukhin",
      "J. Fontcuberta",
      "G. Herranz",
      "F. Sanchez"
    ],
    "publication_date": "2014-01-22T11:50:56Z",
    "arxiv_id": "http://arxiv.org/abs/1401.5633v1",
    "download_url": "http://arxiv.org/abs/1401.5633v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bifurcation analysis of the conversion degrees in systems based on the\n  cascade of tank reactors",
    "abstract": "The scope of the paper is the analysis of the possibility of increasing\nconversion in different types of systems based on continuous stirred tank\nreactors. A numerical model of the cascade with constant direction of material\nflow is tested, a model of changes of direction flow and a relaxation model.\nThe analysis is conducted by means of parametric continuation method and\nnumerical simulation, with the designation of bifurcation diagrams and time\nseries. An essential impact of the relaxation method on the increase of the\nconversion degree is indicated.",
    "authors": [
      "Marek Berezowski"
    ],
    "publication_date": "2016-03-22T16:25:02Z",
    "arxiv_id": "http://arxiv.org/abs/1603.09614v1",
    "download_url": "http://arxiv.org/abs/1603.09614v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The parametric continuation method for determining steady state diagrams",
    "abstract": "The paper discusses a simple method of using the parametric continuation\nmethod to designate complex diagrams of steady states. The main advantage of\nthe discussed approach is the fact that it does not require the installation of\nhuge professional IT systems. The deliberations are illustrated by examples of\na reactor models described by the algebraic and differential equations. Both\nmodels render solutions in the form of the so called multiple steady states.",
    "authors": [
      "Marek Berezowski"
    ],
    "publication_date": "2016-04-18T18:17:31Z",
    "arxiv_id": "http://arxiv.org/abs/1604.07229v2",
    "download_url": "http://arxiv.org/abs/1604.07229v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deep Reinforcement Learning for Process Synthesis",
    "abstract": "This paper demonstrates the application of reinforcement learning (RL) to\nprocess synthesis by presenting Distillation Gym, a set of RL environments in\nwhich an RL agent is tasked with designing a distillation train, given a user\ndefined multi-component feed stream. Distillation Gym interfaces with a process\nsimulator (COCO and ChemSep) to simulate the environment. A demonstration of\ntwo distillation problem examples are discussed in this paper (a Benzene,\nToluene, P-xylene separation problem and a hydrocarbon separation problem), in\nwhich a deep RL agent is successfully able to learn within Distillation Gym to\nproduce reasonable designs. Finally, this paper proposes the creation of\nChemical Engineering Gym, an all-purpose reinforcement learning software\ntoolkit for chemical engineering process synthesis.",
    "authors": [
      "Laurence Illing Midgley"
    ],
    "publication_date": "2020-09-23T11:34:35Z",
    "arxiv_id": "http://arxiv.org/abs/2009.13265v1",
    "download_url": "http://arxiv.org/abs/2009.13265v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data Analysis using Riemannian Geometry and Applications to Chemical\n  Engineering",
    "abstract": "We explore the use of tools from Riemannian geometry for the analysis of\nsymmetric positive definite matrices (SPD). An SPD matrix is a versatile data\nrepresentation that is commonly used in chemical engineering (e.g.,\ncovariance/correlation/Hessian matrices and images) and powerful techniques are\navailable for its analysis (e.g., principal component analysis). A key\nobservation that motivates this work is that SPD matrices live on a Riemannian\nmanifold and that implementing techniques that exploit this basic property can\nyield significant benefits in data-centric tasks such classification and\ndimensionality reduction. We demonstrate this via a couple of case studies that\nconduct anomaly detection in the context of process monitoring and image\nanalysis.",
    "authors": [
      "Alexander Smith",
      "Benjamin Laubach",
      "Ivan Castillo",
      "Victor M. Zavala"
    ],
    "publication_date": "2022-03-23T15:09:42Z",
    "arxiv_id": "http://arxiv.org/abs/2203.12471v1",
    "download_url": "http://arxiv.org/abs/2203.12471v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simplifying the Jacobian Criterion for precluding multistationarity in\n  chemical reaction networks",
    "abstract": "Chemical reaction networks taken with mass-action kinetics are dynamical\nsystems that arise in chemical engineering and systems biology. In general,\ndetermining whether a chemical reaction network admits multiple steady states\nis difficult, as this requires determining existence of multiple positive\nsolutions to a large system of polynomials with unknown coefficients. However,\nin certain cases, various easy criteria can be applied. One such test is the\nJacobian Criterion, due to Craciun and Feinberg, which gives sufficient\nconditions for ruling out the possibility of multiple steady states. A chemical\nreaction network is said to pass the Jacobian Criterion if all terms in the\ndeterminant expansion of its parametrized Jacobian matrix have the same sign.\nIn this article, we present a procedure which simplifies the application of the\nJacobian Criterion, and as a result, we identify a new class of networks for\nwhich multiple steady states is precluded: those in which all chemical species\nhave total molecularity of at most two. The total molecularity of a species\nrefers to the sum of all of its stoichiometric coefficients in the network. We\nillustrate our results by examining enzyme catalysis networks.",
    "authors": [
      "Badal Joshi",
      "Anne Shiu"
    ],
    "publication_date": "2011-06-08T15:04:17Z",
    "arxiv_id": "http://arxiv.org/abs/1106.1578v2",
    "download_url": "http://arxiv.org/abs/1106.1578v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Global Controllability of Chemical Reactions",
    "abstract": "Controllability of chemical reactions is an important problem in chemical\nengineering science. In control theory, analysis of the controllability of\nlinear systems is well-founded, however the dynamics of chemical reactions is\nusually nonlinear. Global controllability properties of chemical reactions are\nanalyzed here based on the Lie-algebra of the vector fields associated to\nelementary reactions. A chemical reaction is controllable almost everywhere if\nall the reaction rate coefficients can be used as control inputs. The problem\nwhere one can not control all the reaction rate coefficients is also analyzed.\nThe reaction steps whose reaction rate coefficients need to be control inputs\nare identified. A general definition of consecutive reactions is given, and it\nturns out that they are controllable almost everywhere by using the reaction\nrate coefficient of only one reaction step as control input.",
    "authors": [
      "Dániel András Drexler",
      "János Tóth"
    ],
    "publication_date": "2015-08-13T14:29:03Z",
    "arxiv_id": "http://arxiv.org/abs/1508.03228v1",
    "download_url": "http://arxiv.org/abs/1508.03228v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algorithmic Complexity and Reprogrammability of Chemical Structure\n  Networks",
    "abstract": "Here we address the challenge of profiling causal properties and tracking the\ntransformation of chemical compounds from an algorithmic perspective. We\nexplore the potential of applying a computational interventional calculus based\non the principles of algorithmic probability to chemical structure networks. We\nprofile the sensitivity of the elements and covalent bonds in a chemical\nstructure network algorithmically, asking whether reprogrammability affords\ninformation about thermodynamic and chemical processes involved in the\ntransformation of different compound classes. We arrive at numerical results\nsuggesting a correspondence between some physical, structural and functional\nproperties. Our methods are capable of separating chemical classes that reflect\nfunctional and natural differences without considering any information about\natomic and molecular properties. We conclude that these methods, with their\nlinks to chemoinformatics via algorithmic, probability hold promise for future\nresearch.",
    "authors": [
      "Hector Zenil",
      "Narsis A. Kiani",
      "Ming-Mei Shang",
      "Jesper Tegnér"
    ],
    "publication_date": "2018-02-16T07:52:47Z",
    "arxiv_id": "http://arxiv.org/abs/1802.05856v3",
    "download_url": "http://arxiv.org/abs/1802.05856v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-local Chemical Potential Modulation in Topological Insulators Via\n  Electric Field Driven Trapped Charge Migration",
    "abstract": "Topological insulators (TIs) host unusual surface states with Dirac\ndispersion and helical spin texture and hold high potentials for novel\napplications in spintronics and quantum computing. Control of the chemical\npotential in these materials is challenging but crucial to realizing the hotly\npursued exotic physics, including efficient spin generation1,2, Majorana\nFermions3-5, and exciton condensation6,7. Here we report a simple and effective\nmethod that can in-situ tune the chemical potential of single-crystal\nBi2-xSbxSe3 nanoribbons, with a magnitude significantly larger than traditional\nelectrostatic gating. An electric field parallel to a device channel can shift\nthe chemical potential across the Dirac point, both inside and outside the\nchannel. We attribute this non-local reversible modulation of chemical\npotential to electric-field-induced charge hopping among defect states, further\nsupported by photocurrent mapping. Our approach enables engineering chemical\npotential distributions in TIs and opens up tremendous opportunities for\ninvestigating fundamental transport mechanisms of charge and composite\nparticles in these materials.",
    "authors": [
      "Yasen Hou",
      "Rui Xiao",
      "Senlei Li",
      "Lang Wang",
      "Dong Yu"
    ],
    "publication_date": "2020-04-04T04:21:55Z",
    "arxiv_id": "http://arxiv.org/abs/2004.01847v1",
    "download_url": "http://arxiv.org/abs/2004.01847v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Detailed Balanced Chemical Reaction Networks as Generalized Boltzmann\n  Machines",
    "abstract": "Can a micron sized sack of interacting molecules understand, and adapt to a\nconstantly-fluctuating environment? Cellular life provides an existence proof\nin the affirmative, but the principles that allow for life's existence are far\nfrom being proven. One challenge in engineering and understanding biochemical\ncomputation is the intrinsic noise due to chemical fluctuations. In this paper,\nwe draw insights from machine learning theory, chemical reaction network\ntheory, and statistical physics to show that the broad and biologically\nrelevant class of detailed balanced chemical reaction networks is capable of\nrepresenting and conditioning complex distributions. These results illustrate\nhow a biochemical computer can use intrinsic chemical noise to perform complex\ncomputations. Furthermore, we use our explicit physical model to derive\nthermodynamic costs of inference.",
    "authors": [
      "William Poole",
      "Thomas Ouldridge",
      "Manoj Gopalkrishnan",
      "Erik Winfree"
    ],
    "publication_date": "2022-05-12T18:59:43Z",
    "arxiv_id": "http://arxiv.org/abs/2205.06313v1",
    "download_url": "http://arxiv.org/abs/2205.06313v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Heterogeneous Nucleation and Growth of Sessile Chemically Active\n  Droplets",
    "abstract": "Droplets are essential for spatially controlling biomolecules in cells. To\nwork properly, cells need to control the emergence and morphology of droplets.\nOn the one hand, driven chemical reactions can affect droplets profoundly. For\ninstance, reactions can control how droplets nucleate and how large they grow.\nOn the other hand, droplets coexist with various organelles and other\nstructures inside cells, which could affect their nucleation and morphology. To\nunderstand the interplay of these two aspects, we study a continuous field\ntheory of active phase separation. Our numerical simulations reveal that\nreactions suppress nucleation while attractive walls enhance it. Intriguingly,\nthese two effects are coupled, leading to shapes that deviate substantially\nfrom the spherical caps predicted for passive systems. These distortions result\nfrom anisotropic fluxes responding to the boundary conditions dictated by the\nYoung-Dupr\\'e equation. Interestingly, an electrostatic analogy of chemical\nreactions confirms these effects. We thus demonstrate how driven chemical\nreactions affect the emergence and morphology of droplets, which could be\ncrucial for understanding biological cells and improving technical\napplications, e.g., in chemical engineering.",
    "authors": [
      "Noah Ziethen",
      "David Zwicker"
    ],
    "publication_date": "2024-03-13T14:06:53Z",
    "arxiv_id": "http://arxiv.org/abs/2403.08555v1",
    "download_url": "http://arxiv.org/abs/2403.08555v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Foundation Models for the Industrial Forecasting of Chemical\n  Kinetics",
    "abstract": "Scientific Machine Learning is transforming traditional engineering\nindustries by enhancing the efficiency of existing technologies and\naccelerating innovation, particularly in modeling chemical reactions. Despite\nrecent advancements, the issue of solving stiff chemically reacting problems\nwithin computational fluid dynamics remains a significant issue. In this study\nwe propose a novel approach utilizing a multi-layer-perceptron mixer\narchitecture (MLP-Mixer) to model the time-series of stiff chemical kinetics.\nWe evaluate this method using the ROBER system, a benchmark model in chemical\nkinetics, to compare its performance with traditional numerical techniques.\nThis study provides insight into the industrial utility of the recently\ndeveloped MLP-Mixer architecture to model chemical kinetics and provides\nmotivation for such neural architecture to be used as a base for time-series\nfoundation models.",
    "authors": [
      "Imran Nasim",
      "Joaõ Lucas de Sousa Almeida"
    ],
    "publication_date": "2024-08-20T10:43:09Z",
    "arxiv_id": "http://arxiv.org/abs/2408.10720v1",
    "download_url": "http://arxiv.org/abs/2408.10720v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Machine Learning in Chemical Process Design",
    "abstract": "We present a perspective on molecular machine learning (ML) in the field of\nchemical process engineering. Recently, molecular ML has demonstrated great\npotential in (i) providing highly accurate predictions for properties of pure\ncomponents and their mixtures, and (ii) exploring the chemical space for new\nmolecular structures. We review current state-of-the-art molecular ML models\nand discuss research directions that promise further advancements. This\nincludes ML methods, such as graph neural networks and transformers, which can\nbe further advanced through the incorporation of physicochemical knowledge in a\nhybrid or physics-informed fashion. Then, we consider leveraging molecular ML\nat the chemical process scale, which is highly desirable yet rather unexplored.\nWe discuss how molecular ML can be integrated into process design and\noptimization formulations, promising to accelerate the identification of novel\nmolecules and processes. To this end, it will be essential to create molecule\nand process design benchmarks and practically validate proposed candidates,\npossibly in collaboration with the chemical industry.",
    "authors": [
      "Jan G. Rittig",
      "Manuel Dahmen",
      "Martin Grohe",
      "Philippe Schwaller",
      "Alexander Mitsos"
    ],
    "publication_date": "2025-08-28T08:14:33Z",
    "arxiv_id": "http://arxiv.org/abs/2508.20527v2",
    "download_url": "http://arxiv.org/abs/2508.20527v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dynamics of filaments of scroll waves",
    "abstract": "This has been written as a chapter for \"Engineering Chemical Complexity II\",\nand as such does not have an abstract.",
    "authors": [
      "Vadim N. Biktashev",
      "Irina V. Biktasheva"
    ],
    "publication_date": "2014-03-26T12:40:04Z",
    "arxiv_id": "http://arxiv.org/abs/1403.6654v1",
    "download_url": "http://arxiv.org/abs/1403.6654v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A thermodynamic parallel of the Braess road-network paradox",
    "abstract": "We provide here a thermodynamic analog of the Braess road-network paradox\nwith irreversible engines working between reservoirs that are placed at\nvertices of the network. Paradoxes of different kinds reappear, emphasizing the\nspecialty of the network.",
    "authors": [
      "Kamal Bhattacharyya"
    ],
    "publication_date": "2017-03-07T05:01:37Z",
    "arxiv_id": "http://arxiv.org/abs/1703.02213v1",
    "download_url": "http://arxiv.org/abs/1703.02213v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bibliometric analysis of the world scientific production in Chemical\n  Engineering during 2000-2011. Part 3: Analysis of research trends and hot\n  topics",
    "abstract": "A comprehensive bibliometric analysis of the scientific production of\nChemical Engineering area has been carried out using the Web of Science\ndatabase for the period 2000-2011 through three complementary studies. Part 3\nhas analyzed the distribution of words in article titles, keyword plus and\nauthor keywords of both total scientific production and the 1,000 most cited\npublications. The main areas of Chemical Engineering have been identified; they\nare mainly related to chemical reaction engineering such as catalysis,\nreactors, kinetics, and unit operations such as adsorption. Furthermore, a\ntotal of ten hotspots in the area have been identified: hydrogen as a new\nenergy vector, wastewater treatments, carbon dioxide (capture and\nsequestration), photocatalysis, nanoparticles, biodiesel, nanotubes, ionic\nliquids, advanced oxidation processes, membranes, fuel cells and the use of\nbiomass as raw material (e.g. bioethanol, energy production, etc.). Results\nobtained suggest thematic areas and research trends can be easier analyzed\nthrough the most cited publications, decreasing significantly the time\nnecessary for these analyses. Words in article title, keyword plus and author\nkeywords are complementary, however, author keywords are suggested as the\nsource of most useful data. Compared to other strategies, the author keywords\nare more valuable for identifying research areas and trends, and the total\nnumber of words to be analyzed is lower. Whatever the case, authors recommend a\nrevision of the results obtained by experts in the area to avoid inaccurate\nresults and get the most meaningful information.",
    "authors": [
      "Ruben Miranda",
      "Esther Garcia-Carpintero"
    ],
    "publication_date": "2020-12-31T11:33:26Z",
    "arxiv_id": "http://arxiv.org/abs/2012.15558v1",
    "download_url": "http://arxiv.org/abs/2012.15558v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A computational model for the design of a nitrous oxide--paraffin wax\n  hybrid rocket engine",
    "abstract": "A computational model is developed to assist the design of the first hybrid\nrocket engine of the McGill Rocket Team, using liquid nitrous oxide as an\noxidizer and solid paraffin wax as a fuel. The model is developed in three\nphases: In the first phase, a steady-state model which neglects transient\nperformance decrease of the hybrid engine is considered. The steady-state model\nconsiders: a constant oxidizer mass flow rate; a combustion chamber in chemical\nequilibrium; a one-dimensional isentropic nozzle; and a one-dimensional\nconstant-thrust rocket ascent. The steady-state model is used to conduct\nparametric studies on engine performance as a function of design parameters\nsuch as: oxidizer mass flow rate, fuel grain dimensions, and nozzle dimensions.\nThe engine design point is selected to optimize specific impulse, given\nphysical and structural constraints of the system. In the second phase, an\nunsteady model incorporating transient performance decrease of the hybrid\nengine is considered. The transient model considers: a self-pressurizing\noxidizer tank in quasi-steady liquid-vapor equilibrium; a combustion chamber in\nquasi-steady chemical equilibrium; a one-dimensional non-isentropic nozzle; and\na one-dimensional rocket ascent model. The transient performance profile of the\nengine is established, and the unsteady model is used to predict propellant\nrequirements for the launch vehicle, given a target apogee of 3048 m (10,000\nft). In the third stage, the unsteady model is compared to hot fire testing\ndata of the McGill Rocket Team. Semi-empirical parameters used in the\nformulation are calibrated against testing data, and the validity of the model\nis assessed.",
    "authors": [
      "Joel Jean-Philyppe"
    ],
    "publication_date": "2023-02-13T22:25:35Z",
    "arxiv_id": "http://arxiv.org/abs/2302.06725v1",
    "download_url": "http://arxiv.org/abs/2302.06725v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A finite-time quantum Otto engine with tunnel coupled one-dimensional\n  Bose gases",
    "abstract": "We undertake a theoretical study of a finite-time quantum Otto engine cycle\ndriven by inter-particle interactions in a weakly interacting one-dimensional\nBose gas in the quasicondensate regime. Utilizing a $c$-field approach, we\nsimulate the entire Otto cycle, i.e. the two work strokes and the two\nequilibration strokes. More specifically, the interaction-induced work strokes\nare modelled by treating the working fluid as an isolated quantum many-body\nsystem undergoing unitary evolution. The equilibration strokes, on the other\nhand, are modelled by treating the working fluid as an open quantum system\ntunnel-coupled to another quasicondensate which acts as either the hot or cold\nreservoir, albeit of finite size. We find that, unlike a uniform 1D Bose gas, a\nharmonically trapped quasicondensate cannot operate purely as a \\emph{heat}\nengine; instead, the engine operation is enabled by additional \\emph{chemical}\nwork performed on the working fluid, facilitated by the inflow of particles\nfrom the hot reservoir. The microscopic treatment of dynamics during\nequilibration strokes enables us to evaluate the characteristic operational\ntime scales of this Otto chemical engine, crucial for characterizing its power\noutput, without any \\emph{ad hoc} assumptions about typical thermalization\ntimescales. We analyse the performance and quantify the figures of merit of the\nproposed Otto chemical engine, finding that it offers a favourable trade-off\nbetween efficiency and power output, particularly when the interaction-induced\nwork strokes are implemented via a sudden quench. We further demonstrate that\nin the sudden quench regime, the engine operates with an efficiency close to\nthe near-adiabatic (near maximum efficiency) limit, while concurrently\nachieving maximum power output.",
    "authors": [
      "V. V. Nautiyal",
      "R. S. Watson",
      "K. V. Kheruntsyan"
    ],
    "publication_date": "2024-04-25T09:54:21Z",
    "arxiv_id": "http://arxiv.org/abs/2404.16470v1",
    "download_url": "http://arxiv.org/abs/2404.16470v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Asymptotology of Chemical Reaction Networks",
    "abstract": "The concept of the limiting step is extended to the asymptotology of\nmultiscale reaction networks. Complete theory for linear networks with well\nseparated reaction rate constants is developed. We present algorithms for\nexplicit approximations of eigenvalues and eigenvectors of kinetic matrix.\nAccuracy of estimates is proven. Performance of the algorithms is demonstrated\non simple examples. Application of algorithms to nonlinear systems is\ndiscussed.",
    "authors": [
      "A. N. Gorban",
      "O. Radulescu",
      "A. Y. Zinovyev"
    ],
    "publication_date": "2009-03-29T17:21:31Z",
    "arxiv_id": "http://arxiv.org/abs/0903.5072v2",
    "download_url": "http://arxiv.org/abs/0903.5072v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Measuring Method of a Surface Property inside the Pore: Application of\n  Kelvin's equation",
    "abstract": "Surface analyses inside the nanopore, micropore, and a very narrow pipe are\nimportant topics for development of the chemical engineering. Here, we propose\na measuring method which evaluates the surface coverage of the chemically\nmodified pore surface and the corrosion rate of the inner surface of the narrow\npipe, etc. The method uses Kelvin's equation that expresses saturated vapor\npressure of a liquid in the pore (pipe). The surface coverage and the corrosion\nrate are calculated by measuring saturated vapor pressure of the liquid in the\npore and the pipe, respectively. In this letter, we explain the concept of the\nmethod briefly.",
    "authors": [
      "Ken-ichi Amano"
    ],
    "publication_date": "2015-04-05T11:50:12Z",
    "arxiv_id": "http://arxiv.org/abs/1504.01114v1",
    "download_url": "http://arxiv.org/abs/1504.01114v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Identification of the oscillation period of chemical reactors by chaotic\n  sampling of the conversion degree",
    "abstract": "To stabilize the periodic operation of a chemical reactor the oscillation\nperiod should be determined precisely in real time. The method discussed in the\npaper is based on adaptive sampling of the state variable with the use of\nchaotic mapping to itself. It enables precise determination of the oscillation\nperiod in real time and could be used for a proper control system, that can\nsuccessfully control the process and maintain the oscillation period at a set\nlevel. The method was applied to a tank reactor and tubular reactor with\nrecycle.",
    "authors": [
      "Marcin Lawnik",
      "Marek Berezowski"
    ],
    "publication_date": "2016-03-12T01:59:02Z",
    "arxiv_id": "http://arxiv.org/abs/1603.03844v1",
    "download_url": "http://arxiv.org/abs/1603.03844v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Impact of Extrinsic Interface Traps and Doping Atoms on Conductivity of\n  Graphene Field Effect Devices",
    "abstract": "Near-interfacial oxide traps and chemical impurities on the graphene surface\nor at the graphene-dielectric interface can be a source of intentional or\nunintentional doping of graphene sheet. The efficiency of such chemical doping\ncan vary in a wide range depending on parameters of graphene field effect\ndevices. Mechanisms of such sensitivity of doping efficiency to the device\ncharacteristics need to be understood. The objective of this paper is to\ntheoretically derive the analytical relations, adapted to the explicit\ncalculation of graphene chemical doping.",
    "authors": [
      "G. I. Zebrev",
      "S. A. Shostachenko"
    ],
    "publication_date": "2019-06-25T12:37:50Z",
    "arxiv_id": "http://arxiv.org/abs/1906.10476v1",
    "download_url": "http://arxiv.org/abs/1906.10476v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Error detection on quantum computers improves accuracy of chemical\n  calculations",
    "abstract": "A major milestone of quantum error correction is to achieve the\nfault-tolerance threshold beyond which quantum computers can be made\narbitrarily accurate. This requires extraordinary resources and engineering\nefforts. We show that even without achieving full fault tolerance, quantum\nerror detection is already useful on the current generation of quantum\nhardware. We demonstrate this experimentally by executing an end-to-end\nchemical calculation for the hydrogen molecule encoded in the [[4, 2, 2]]\nquantum error-detecting code. The encoded calculation with logical qubits\nsignificantly improves the accuracy of the molecular ground-state energy.",
    "authors": [
      "Miroslav Urbanek",
      "Benjamin Nachman",
      "Wibe A. de Jong"
    ],
    "publication_date": "2019-09-30T22:04:43Z",
    "arxiv_id": "http://arxiv.org/abs/1910.00129v2",
    "download_url": "http://arxiv.org/abs/1910.00129v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A thermodynamically consistent chemical spiking neuron capable of\n  autonomous Hebbian learning",
    "abstract": "We propose a fully autonomous, thermodynamically consistent set of chemical\nreactions that implements a spiking neuron. This chemical neuron is able to\nlearn input patterns in a Hebbian fashion. The system is scalable to\narbitrarily many input channels. We demonstrate its performance in learning\nfrequency biases in the input as well as correlations between different input\nchannels. Efficient computation of time-correlations requires a highly\nnon-linear activation function. The resource requirements of a non-linear\nactivation function are discussed. In addition to the thermodynamically\nconsistent model of the CN, we also propose a biologically plausible version\nthat could be engineered in a synthetic biology context.",
    "authors": [
      "Jakub Fil",
      "Dominique Chu"
    ],
    "publication_date": "2020-09-28T10:43:13Z",
    "arxiv_id": "http://arxiv.org/abs/2009.13207v1",
    "download_url": "http://arxiv.org/abs/2009.13207v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Heuristics and Uncertainty Quantification in Rational and Inverse\n  Compound and Catalyst Design",
    "abstract": "The goal of inverse (quantum) approaches is to devise methods and approaches\ncapable of efficiently searching chemical space in such a way that the design\nof novel materials and compounds with specific properties is as direct and\nefficient as possible. Here, we review the current state of the field with a\nfocus on the most recent developments. We discuss the importance of heuristic\nrules and human intuition for rational compound design. Moreover, we elaborate\non options for reliable uncertainty quantification for computational results,\nwhich is crucial for a truly predictive application of any in silico method.",
    "authors": [
      "Thomas Weymuth",
      "Markus Reiher"
    ],
    "publication_date": "2022-03-17T13:37:40Z",
    "arxiv_id": "http://arxiv.org/abs/2203.09315v1",
    "download_url": "http://arxiv.org/abs/2203.09315v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computational Modeling for the Activation Cycle of G-proteins by\n  G-protein-coupled Receptors",
    "abstract": "In this paper, we survey five different computational modeling methods. For\ncomparison, we use the activation cycle of G-proteins that regulate cellular\nsignaling events downstream of G-protein-coupled receptors (GPCRs) as a driving\nexample. Starting from an existing Ordinary Differential Equations (ODEs)\nmodel, we implement the G-protein cycle in the stochastic Pi-calculus using\nSPiM, as Petri-nets using Cell Illustrator, in the Kappa Language using\nCellucidate, and in Bio-PEPA using the Bio-PEPA eclipse plug in. We also\nprovide a high-level notation to abstract away from communication primitives\nthat may be unfamiliar to the average biologist, and we show how to translate\nhigh-level programs into stochastic Pi-calculus processes and chemical\nreactions.",
    "authors": [
      "Yifei Bao",
      "Adriana Compagnoni",
      "Joseph Glavy",
      "Tommy White"
    ],
    "publication_date": "2010-11-02T01:29:21Z",
    "arxiv_id": "http://arxiv.org/abs/1011.0490v1",
    "download_url": "http://arxiv.org/abs/1011.0490v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Regime-Specific Multi-Objective Variational Principle of Compromise in\n  Competition at Mesoscales",
    "abstract": "The energy-minimization multiscale (EMMS) principle of compromise in\ncompetition is believed to be generally applicable for all mesoscale problems\nat different levels in the real world, spanning from elementary particles to\nthe universe. This stimulated a fundamental proposition of the concept of\nmesoscience. This article discusses a potential universality of the\nregime-specific multi-objective variational feature of this underlying\nprinciple through case studies in chemical engineering. It is also elucidated\nwhy the currently available variational principles are not applicable to the\nmesoscale problems. The paper concludes with prospects on future study.",
    "authors": [
      "Jinghai Li",
      "Wenlai Huang",
      "Jianhua Chen",
      "Wei Ge",
      "Chaofeng Hou"
    ],
    "publication_date": "2017-08-31T11:27:10Z",
    "arxiv_id": "http://arxiv.org/abs/1708.09671v1",
    "download_url": "http://arxiv.org/abs/1708.09671v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Two-phase approaches to optimal model-based design of experiments: how\n  many experiments and which ones?",
    "abstract": "Model-based experimental design is attracting increasing attention in\nchemical process engineering. Typically, an iterative procedure is pursued: an\napproximate model is devised, prescribed experiments are then performed and the\nresulting data is exploited to refine the model. To help to reduce the cost of\ntrial-and-error approaches, strategies for model-based design of experiments\nsuggest experimental points where the expected gain in information for the\nmodel is the largest. It requires the resolution of a large nonlinear,\ngenerally nonconvex, optimization problem, whose solution may greatly depend on\nthe starting point. We present two discretization strategies that can assist\nthe experimenter in setting the number of relevant experiments and performing\nan optimal selection, and we compare them against two pattern-based strategies\nthat are independent of the problem. The validity of the approaches is\ndemonstrated on an academic example and two test problems from chemical\nengineering including a vapor liquid equilibrium and reaction kinetics.",
    "authors": [
      "Charlie Vanaret",
      "Philipp Seufert",
      "Jan Schwientek",
      "Gleb Karpov",
      "Gleb Ryzhakov",
      "Ivan Oseledets",
      "Norbert Asprion",
      "Michael Bortz"
    ],
    "publication_date": "2021-01-22T17:07:11Z",
    "arxiv_id": "http://arxiv.org/abs/2101.09219v1",
    "download_url": "http://arxiv.org/abs/2101.09219v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards edge engineering of two-dimensional layered transition-metal\n  dichalcogenides by chemical vapor deposition",
    "abstract": "The manipulation of edge configurations and structures in atomically thin\ntransition metal dichalcogenides (TMDs) for versatile functionalization has\nattracted intensive interest in recent years. The chemical vapor deposition\n(CVD) approach has shown promise for TMD edge engineering of atomic edge\nconfigurations (1H, 1T or 1T'-zigzag or armchair edges), as well as diverse\nedge morphologies (1D nanoribbons, 2D dendrites, 3D spirals, etc). These\nrich-edge TMD layers offer versatile candidates for probing the physical and\nchemical properties, and exploring new applications in electronics,\noptoelectronics, catalysis, sensing and quantum field. In this review, we\npresent an overview of the current state-of-the-art in the manipulation of TMD\natomic edges and edge-rich structures using CVD. We highlight the vast range of\nunique properties associated with these edge configurations and structures and\nprovide insights into the opportunities afforded by such edge-functionalized\ncrystals. The objective of this review is to motivate further research and\ndevelopment efforts in using CVD as a scalable approach to harness the benefits\nof such crystal-edge engineering.",
    "authors": [
      "Wei Fu",
      "Mark John",
      "Thathsara D. Maddumapatabandi",
      "Fabio Bussolotti",
      "Yong Sean Yau",
      "Ming Lin",
      "Kuan Eng Johnson Goh"
    ],
    "publication_date": "2024-04-25T22:55:14Z",
    "arxiv_id": "http://arxiv.org/abs/2404.17074v1",
    "download_url": "http://arxiv.org/abs/2404.17074v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modification of adhesion between microparticles and engineered silicon\n  surfaces",
    "abstract": "A key challenge in performing experiments with microparticles is controlling\ntheir adhesion to substrates. For example, levitation of a microparticle\ninitially resting on a surface requires overcoming the surface adhesion forces\nto deliver the microparticle into a mechanical potential acting as a trap. By\nengineering the surface of silicon substrates, we aim to decrease the adhesion\nforce between a metallic microparticle and the silicon surface. To this end, we\ninvestigate different methods of surface engineering that are based on\nchemical, physical, or physio-chemical modifications of the surface of silicon.\nWe give quantitative results on the detachment force, finding a correlation\nbetween the water contact angle and the mean detachment force, indicating that\nhydrophobic surfaces are desired for low microparticle adhesion. We develop\nsurface preparations decreasing the mean detachment force by more than a factor\nof three, or the force at which 50% of particles move by more than a factor of\nsix, the compared to an untreated silicon surface. Our results will enable\nreliable levitation of microparticles and are relevant for experiments\nrequiring low adhesion between microparticles and a surface.",
    "authors": [
      "Fabian Resare",
      "Somiya Islam Soke",
      "Witlef Wieczorek"
    ],
    "publication_date": "2025-08-19T14:48:12Z",
    "arxiv_id": "http://arxiv.org/abs/2508.13887v1",
    "download_url": "http://arxiv.org/abs/2508.13887v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Surrogate-Based Optimization Techniques for Process Systems Engineering",
    "abstract": "Optimization plays an important role in chemical engineering, impacting\ncost-effectiveness, resource utilization, product quality, and process\nsustainability metrics. This chapter broadly focuses on data-driven\noptimization, particularly, on model-based derivative-free techniques, also\nknown as surrogate-based optimization. The chapter introduces readers to the\ntheory and practical considerations of various algorithms, complemented by a\nperformance assessment across multiple dimensions, test functions, and two\nchemical engineering case studies: a stochastic high-dimensional reactor\ncontrol study and a low-dimensional constrained stochastic reactor optimization\nstudy. This assessment sheds light on each algorithm's performance and\nsuitability for diverse applications. Additionally, each algorithm is\naccompanied by background information, mathematical foundations, and algorithm\ndescriptions. Among the discussed algorithms are Bayesian Optimization (BO),\nincluding state-of-the-art TuRBO, Constrained Optimization by Linear\nApproximation (COBYLA), the Ensemble Tree Model Optimization Tool (ENTMOOT)\nwhich uses decision trees as surrogates, Stable Noisy Optimization by Branch\nand Fit (SNOBFIT), methods that use radial basis functions such as DYCORS and\nSRBFStrategy, Constrained Optimization by Quadratic Approximations (COBYQA), as\nwell as a few others recognized for their effectiveness in surrogate-based\noptimization. By combining theory with practice, this chapter equips readers\nwith the knowledge to integrate surrogate-based optimization techniques into\nchemical engineering. The overarching aim is to highlight the advantages of\nsurrogate-based optimization, introduce state-of-the-art algorithms, and\nprovide guidance for successful implementation within process systems\nengineering.",
    "authors": [
      "Mathias Neufang",
      "Emma Pajak",
      "Damien van de Berg",
      "Ye Seol Lee",
      "Ehecatl Antonio del Rio Chanona"
    ],
    "publication_date": "2024-12-18T15:29:05Z",
    "arxiv_id": "http://arxiv.org/abs/2412.13948v1",
    "download_url": "http://arxiv.org/abs/2412.13948v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]