[
  {
    "title": "Dissipative heat engine is thermodynamically inconsistent",
    "abstract": "A heat engine operating on the basis of the Carnot cycle is considered, where\nthe mechanical work performed is dissipated within the engine at the\ntemperature of the warmer isotherm and the resulting heat is added to the\nengine together with an external heat input. The resulting work performed by\nthe engine per cycle is increased at the expense of dissipated work produced in\nthe previous cycle. It is shown that such a dissipative heat engine is\nthermodynamically inconsistent violating the first and second laws of\nthermodynamics. The existing physical models employing the dissipative heat\nengine concept, in particular, the heat engine model of hurricane development,\nare physically invalid.",
    "authors": [
      "A. M. Makarieva",
      "V. G. Gorshkov"
    ],
    "publication_date": "2009-10-05T13:16:43Z",
    "arxiv_id": "http://arxiv.org/abs/0910.0543v1",
    "download_url": "http://arxiv.org/abs/0910.0543v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficiency of the general quantum-mechanical Carnot engine",
    "abstract": "A quantum-mechanical analog of the Carnot engine reversibly working at\nvanishing temperature, shortly termed the quantum-mechanical Carnot engine, is\ndiscussed. A general formula for the efficiency of such an engine with an\narbitrary confining potential is presented. Its expression is purely given in\nterms of the structure of the energy spectrum. Dependency of the efficiency on\nthe form of a potential as an analog of the working material in thermodynamics\nimplies nonuniversality of the engine. This may be due to the absence of the\nsecond-law-like principle in pure-state quantum mechanics.",
    "authors": [
      "Sumiyoshi Abe"
    ],
    "publication_date": "2012-08-10T17:15:53Z",
    "arxiv_id": "http://arxiv.org/abs/1208.2222v2",
    "download_url": "http://arxiv.org/abs/1208.2222v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Revisiting Endo-reversible Carnot engine: Extending the Yvon engine",
    "abstract": "A famous paper [Am. J. Phys. 43, 22 (1975)] unveiled the efficiency at\nmaximum power (EMP) of the endo-reversible Carnot heat engine, now commonly\nreferred to as the Curzon-Ahlborn (CA) engine, pioneering finite-time\nthermodynamics. Historically, despite the significance of the CA engine,\nsimilar findings had emerged at an earlier time, such as the Yvon engine\nproposed by J. Yvon in 1955 sharing the exact same EMP. However, the special\nsetup of the Yvon engine has circumscribed its broader influence. This paper\nextends the Yvon engine model to achieve a level of generality comparable to\nthat of the CA engine. A rigorous comparison reveals that the extended Yvon\nengine and CA engine represent the steady-state and cyclic forms of the\nendo-reversible Carnot heat engine, respectively, and are equivalent. Our work\nprovides a pedagogical example for the teaching of thermodynamics and\nengineering thermodynamics, given that the simple and lucid derivation of the\nextended Yvon engine helps students initiate their understanding of\nnon-equilibrium thermodynamics.",
    "authors": [
      "Xiu-Hua Zhao",
      "Yu-Han Ma"
    ],
    "publication_date": "2024-12-18T15:08:56Z",
    "arxiv_id": "http://arxiv.org/abs/2412.13925v2",
    "download_url": "http://arxiv.org/abs/2412.13925v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Abstract models for heat engines",
    "abstract": "We retrospect three abstract models for heat engines which include a classic\nabstract model in textbook of thermal physics, a primary abstract model for\nfinite-time heat engines, and a refined abstract model for finite-time heat\nengines. The detailed models of heat engines in literature of finite-time\nthermodynamics may be mapped into the refined abstract model. The future\ndevelopments based on the refined abstract model are also surveyed.",
    "authors": [
      "Z. C. Tu"
    ],
    "publication_date": "2020-10-12T06:41:43Z",
    "arxiv_id": "http://arxiv.org/abs/2010.05477v1",
    "download_url": "http://arxiv.org/abs/2010.05477v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum-mechanical engine models and their efficiencies",
    "abstract": "Based on quantum thermodynamic processes, we make a quantum-mechanical (QM)\nextension of the typical heat engine cycles, such as the Carnot, Brayton, Otto,\nand Diesel cycles, etc. The temperature is not included in these QM engine\ncycles, as lies in the fact that the concept of energy is well-defined in\nquantum mechanics, temperature \\emph{a priori} is not. These QM engine cycles\nare implemented by an ideal or interacting system with an arbitrary number of\nparticles confined in an arbitrary power-law trap. As a result, a relation\nbetween the quantum adiabatic exponent and trap exponent is found. The\nefficiency of a given QM engine cycle is similar to that of its classical\ncounterpart, thereby identifying the universality of the efficiency.",
    "authors": [
      "Jianhui Wang",
      "Yongli Ma",
      "Jizhou He"
    ],
    "publication_date": "2013-02-03T09:58:37Z",
    "arxiv_id": "http://arxiv.org/abs/1302.0469v1",
    "download_url": "http://arxiv.org/abs/1302.0469v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Analog of Carnot Engine",
    "abstract": "In order to build a quantum analog of traditional Carnot engine, a common\nchoice is replacing the two thermodynamic adiabatic processes with two quantum\nmechanical adiabatic processes. In general, such quantum Carnot engine has six\nstrokes. We analyze the efficiency of such six-stroke quantum Carnot engine in\na perturbative way.",
    "authors": [
      "Chung-Yang Wang"
    ],
    "publication_date": "2017-10-28T09:46:02Z",
    "arxiv_id": "http://arxiv.org/abs/1710.10435v1",
    "download_url": "http://arxiv.org/abs/1710.10435v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stationary engines in and beyond the linear response regime at the\n  Carnot efficiency",
    "abstract": "The condition for stationary engines to attain the Carnot efficiency in and\nbeyond the linear response regime is investigated. We find that this condition\nfor finite-size engines is significantly different from that for macroscopic\nengines in the thermodynamic limit. For the case of finite-size engines, the\ntight-coupling condition in the linear response regime directly implies the\nattainability of the Carnot efficiency beyond the linear response regime.\nContrary to this, for the case of macroscopic engines in the thermodynamic\nlimit, there are three types of mechanisms to attain the Carnot efficiency. One\nmechanism allows engines to attain the Carnot efficiency only in the linear\nresponse limit, while other two mechanisms enable engines to attain the Carnot\nefficiency beyond the linear response regime. These three mechanisms are\nclassified by introducing tight-coupling window.",
    "authors": [
      "Naoto Shiraishi"
    ],
    "publication_date": "2017-03-10T11:00:45Z",
    "arxiv_id": "http://arxiv.org/abs/1703.03621v2",
    "download_url": "http://arxiv.org/abs/1703.03621v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanical Carnot engine",
    "abstract": "A cyclic thermodynamic heat engine runs most efficiently if it is reversible.\nCarnot constructed such a reversible heat engine by combining adiabatic and\nisothermal processes for a system containing an ideal gas. Here, we present an\nexample of a cyclic engine based on a single quantum-mechanical particle\nconfined to a potential well. The efficiency of this engine is shown to equal\nthe Carnot efficiency because quantum dynamics is reversible. The quantum heat\nengine has a cycle consisting of adiabatic and isothermal quantum processes\nthat are close analogues of the corresponding classical processes.",
    "authors": [
      "C. M. Bender",
      "D. C. Brody",
      "B. K. Meister"
    ],
    "publication_date": "2000-07-03T15:51:42Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0007002v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0007002v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "One-particle engine with a porous piston",
    "abstract": "We propose a variation of the classical Szilard engine that uses a porous\npiston. Such an engine requires neither information about the position of the\nparticle, nor the removal and subsequent insertion of the piston when resetting\nthe engine to continue doing work by lifting a mass against a gravitational\nfield. Though the engine operates in contact with a single thermal reservoir,\nthe reset mechanism acts as a second reservoir, dissipating energy when a mass\nthat has been lifted by the engine is removed to initiate a new operation\ncycle.",
    "authors": [
      "Carlos E. Álvarez",
      "Manuel Camargo",
      "Gabriel Téllez"
    ],
    "publication_date": "2022-08-17T16:28:42Z",
    "arxiv_id": "http://arxiv.org/abs/2208.08389v1",
    "download_url": "http://arxiv.org/abs/2208.08389v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Assessing Large Language Models in Mechanical Engineering Education: A\n  Study on Mechanics-Focused Conceptual Understanding",
    "abstract": "This study is a pioneering endeavor to investigate the capabilities of Large\nLanguage Models (LLMs) in addressing conceptual questions within the domain of\nmechanical engineering with a focus on mechanics. Our examination involves a\nmanually crafted exam encompassing 126 multiple-choice questions, spanning\nvarious aspects of mechanics courses, including Fluid Mechanics, Mechanical\nVibration, Engineering Statics and Dynamics, Mechanics of Materials, Theory of\nElasticity, and Continuum Mechanics. Three LLMs, including ChatGPT (GPT-3.5),\nChatGPT (GPT-4), and Claude (Claude-2.1), were subjected to evaluation against\nengineering faculties and students with or without mechanical engineering\nbackground. The findings reveal GPT-4's superior performance over the other two\nLLMs and human cohorts in answering questions across various mechanics topics,\nexcept for Continuum Mechanics. This signals the potential future improvements\nfor GPT models in handling symbolic calculations and tensor analyses. The\nperformances of LLMs were all significantly improved with explanations prompted\nprior to direct responses, underscoring the crucial role of prompt engineering.\nInterestingly, GPT-3.5 demonstrates improved performance with prompts covering\na broader domain, while GPT-4 excels with prompts focusing on specific\nsubjects. Finally, GPT-4 exhibits notable advancements in mitigating input\nbias, as evidenced by guessing preferences for humans. This study unveils the\nsubstantial potential of LLMs as highly knowledgeable assistants in both\nmechanical pedagogy and scientific research.",
    "authors": [
      "Jie Tian",
      "Jixin Hou",
      "Zihao Wu",
      "Peng Shu",
      "Zhengliang Liu",
      "Yujie Xiang",
      "Beikang Gu",
      "Nicholas Filla",
      "Yiwei Li",
      "Ning Liu",
      "Xianyan Chen",
      "Keke Tang",
      "Tianming Liu",
      "Xianqiao Wang"
    ],
    "publication_date": "2024-01-13T19:19:04Z",
    "arxiv_id": "http://arxiv.org/abs/2401.12983v1",
    "download_url": "http://arxiv.org/abs/2401.12983v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Review into Data Science and Its Approaches in Mechanical Engineering",
    "abstract": "Nowadays it is inevitable to use intelligent systems to improve the\nperformance and optimization of different components of devices or factories.\nFurthermore, it's so essential to have appropriate predictions to make better\ndecisions in businesses, medical studies, and engineering studies, etc. One of\nthe newest and most widely used of these methods is a field called Data Science\nthat all of the scientists, engineers, and factories need to learn and use in\ntheir careers. This article briefly introduced data science and reviewed its\nmethods, especially it's usages in mechanical engineering and challenges and\nways of developing data science in mechanical engineering. In the introduction,\ndifferent definitions of data science and its background in technology\nreviewed. In the following, data science methodology which is the process that\na data scientist needs to do in its works been discussed. Further, some\nresearches in the mechanical engineering area that used data science methods in\ntheir studies, are reviewed. Eventually, it has been discussed according to the\nsubjects that have been reviewed in the article, why it is necessary to use\ndata science in mechanical engineering researches and projects.",
    "authors": [
      "Ashkan Yousefi Zadeh",
      "Meysam Shahbazy"
    ],
    "publication_date": "2020-12-30T23:05:29Z",
    "arxiv_id": "http://arxiv.org/abs/2012.15358v1",
    "download_url": "http://arxiv.org/abs/2012.15358v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bridging Quantum Mechanics and Computing: A Primer for Software\n  Engineers",
    "abstract": "Quantum mechanics, the fundamental theory that governs the behaviour of\nmatter and energy at microscopic scales, forms the foundation of quantum\ncomputing and quantum information science. As quantum technologies progress,\nsoftware engineers must develop a conceptual understanding of quantum mechanics\nto grasp its implications for computing. This article focuses on fundamental\nquantum mechanics principles for software engineers, including wave-particle\nduality, superposition, entanglement, quantum states, and quantum measurement.\nUnlike traditional physics-oriented discussions, this article focuses on\ncomputational perspectives, assisting software professionals in bridging the\ngap between classical computing and emerging quantum paradigms.",
    "authors": [
      "Arvind W Kiwelekar"
    ],
    "publication_date": "2025-02-22T09:01:00Z",
    "arxiv_id": "http://arxiv.org/abs/2502.16154v1",
    "download_url": "http://arxiv.org/abs/2502.16154v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Correlation-powered Information Engines and the Thermodynamics of\n  Self-Correction",
    "abstract": "Information engines can use structured environments as a resource to generate\nwork by randomizing ordered inputs and leveraging the increased Shannon entropy\nto transfer energy from a thermal reservoir to a work reservoir. We give a\nbroadly applicable expression for the work production of an information engine,\ngenerally modeled as a memoryful channel that communicates inputs to outputs as\nit interacts with an evolving environment. The expression establishes that an\ninformation engine must have more than one memory state in order to leverage\ninput environment correlations. To emphasize this functioning, we designed an\ninformation engine powered solely by temporal correlations and not by\nstatistical biases, as employed by previous engines. Key to this is the\nengine's ability to synchronize---the engine automatically returns to a desired\ndynamical phase when thrown into an unwanted, dissipative phase by corruptions\nin the input---that is, by unanticipated environmental fluctuations. This\nself-correcting mechanism is robust up to a critical level of corruption,\nbeyond which the system fails to act as an engine. We give explicit analytical\nexpressions for both work and critical corruption level and summarize engine\nperformance via a thermodynamic-function phase diagram over engine control\nparameters. The results reveal a new thermodynamic mechanism based on\nnonergodicity that underlies error correction as it operates to support\nresilient engineered and biological systems.",
    "authors": [
      "Alexander B. Boyd",
      "Dibyendu Mandal",
      "James P. Crutchfield"
    ],
    "publication_date": "2016-06-27T22:43:55Z",
    "arxiv_id": "http://arxiv.org/abs/1606.08506v2",
    "download_url": "http://arxiv.org/abs/1606.08506v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Using Blippar Augmented Reality Browser in the Practical Training of\n  Mechanical Engineers",
    "abstract": "The purpose of the study is to justify the expediency of using the Blippar\naugmented reality browser for professional and practical training of future\nmechanical engineers. Tasks of the research: to analyze the expediency of using\naugmented reality tools in the professional training of bachelors of applied\nmechanics; to carry out the selection of augmented reality tools, which is\nexpedient to use in the training of future engineer mechanics; to develop\neducational materials using the chosen augmented reality tools. The object of\nthe study is the professional training of future mechanical engineers. The\nsubject of the study is the use of the augmented reality tools in the\nprofessional training of bachelors of applied mechanics. The paper analyzes the\nrelevance and expediency of the use of the augmented reality tools in the\nprofessional training of future mechanical engineers. It is determined that the\naugmented reality tools will promote the development of ICT competence and\ngraphic competence of bachelors of applied mechanics The model of the use of\nthe augmented reality tools in the training of future mechanical engineers is\nproposed. As the main tool, the Blippar browser and Blippbuilder's cloud-based\nscript development tool are chosen. An example of the creation of markers and\nscenes of augmented reality using the selected tools is given. The advantages\nand disadvantages of used tools are indicated. The proposed learning tools and\nmethods can be applied to vocational and practical training of mechanical\nengineers.",
    "authors": [
      "Andrii Striuk",
      "Maryna Rassovytska",
      "Svitlana Shokaliuk"
    ],
    "publication_date": "2018-07-01T06:51:23Z",
    "arxiv_id": "http://arxiv.org/abs/1807.00279v1",
    "download_url": "http://arxiv.org/abs/1807.00279v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Experimental characterization of autonomous heat engine based on minimal\n  dynamical-system model",
    "abstract": "The autonomous heat engine is a model system of autonomous nonequilibrium\nsystems like biological cells, exploiting nonequilibrium flow for operations.\nAs the Carnot engine has essentially contributed to the equilibrium\nthermodynamics, autonomous heat engine is expected to play a critical role in\nthe challenge of constructing nonequilibrium thermodynamics. However, the high\ncomplexity of the engine involving an intricate coupling among heat, gas flow,\nand mechanics has prevented simple modeling. Here, we experimentally\ncharacterized the nonequilibrium dynamics and thermodynamics of a\nlow-temperature-differential Stirling engine, which is a model autonomous heat\nengine. Our experiments demonstrated that the core engine dynamics are\nquantitatively described by a minimal dynamical model with only two degrees of\nfreedom. The model proposes a novel concept that illustrates the engine as a\nthermodynamic pendulum driven by a thermodynamic force. This work will open a\nnew approach to explore the nonequilibrium thermodynamics of autonomous systems\nbased on a simple dynamical system.",
    "authors": [
      "Shoichi Toyabe",
      "Yuki Izumida"
    ],
    "publication_date": "2019-11-07T08:59:17Z",
    "arxiv_id": "http://arxiv.org/abs/1911.02810v3",
    "download_url": "http://arxiv.org/abs/1911.02810v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lossless Brownian information engine",
    "abstract": "We report on a lossless information engine that converts nearly all available\ninformation from an error-free feedback protocol into mechanical work.\nCombining high-precision detection at resolution of 1 nm with ultrafast\nfeedback control, the engine is tuned to extract the maximum work from\ninformation on the position of a Brownian particle. We show that the work\nproduced by the engine achieves a bound set by a generalized second law of\nthermodynamics, demonstrating for the first time the sharpness of this bound.\nWe validate a generalized Jarzynski equality for error-free feedback-controlled\ninformation engines.",
    "authors": [
      "Govind Paneru",
      "Dong Yun Lee",
      "Tsvi Tlusty",
      "Hyuk Kyu Pak"
    ],
    "publication_date": "2018-02-06T09:58:52Z",
    "arxiv_id": "http://arxiv.org/abs/1802.01868v1",
    "download_url": "http://arxiv.org/abs/1802.01868v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information Arbitrage in Bipartite Heat Engines",
    "abstract": "Heat engines and information engines have each historically served as\nmotivating examples for the development of thermodynamics. While these two\ntypes of systems are typically thought of as two separate kinds of machines,\nrecent empirical studies of specific systems have hinted at possible\nconnections between the two. Inspired by molecular machines in the cellular\nenvironment, which in many cases have separate components in contact with\ndistinct sources of fluctuations, we study bipartite heat engines. We show that\na bipartite heat engine can only produce net output work by acting as an\ninformation engine. Conversely, information engines can only extract more work\nthan the work consumed to power them if they have access to different sources\nof fluctuations, i.e., act as heat engines. We illustrate these findings first\nthrough an analogy to economics and a cyclically controlled 2D ideal gas. We\nthen explore two analytically tractable model systems in more detail: a\nBrownian-gyrator heat engine which we show can be reinterpreted as a\nfeedback-cooling information engine, and a quantum-dot information engine which\ncan be reinterpreted as a thermoelectric heat engine. Our results suggest\ndesign principles for both heat engines and information engines at the\nnanoscale, and ultimately imply constraints on how free-energy transduction is\ncarried out in biological molecular machines.",
    "authors": [
      "Matthew P. Leighton",
      "Jannik Ehrich",
      "David A. Sivak"
    ],
    "publication_date": "2023-08-11T18:00:54Z",
    "arxiv_id": "http://arxiv.org/abs/2308.06325v2",
    "download_url": "http://arxiv.org/abs/2308.06325v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Fluidyne engine",
    "abstract": "The Fluidyne is a two-part hot-air engine, which has the peculiarity that\nboth its power piston and displacer are liquids. Both parts operate in tandem\nwith the common working gas (air) transferring energy from the displacer to the\npiston side, from which work is extracted. We describe analytically the\nthermodynamics of the Fluidyne engine using the approach previously developed\nfor the Stirling engine. We obtain explicit expressions for the amplitude of\nthe power piston movement and for the working gas temperatures and pressure as\nfunctions of the engine parameters. We also study numerically the power and\nefficiency of the engine in terms of the phase shift between the motions of\npiston and displacer.",
    "authors": [
      "Alejandro Romanelli"
    ],
    "publication_date": "2018-12-26T13:56:36Z",
    "arxiv_id": "http://arxiv.org/abs/1812.11100v1",
    "download_url": "http://arxiv.org/abs/1812.11100v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Power-efficiency-stability trade-off in quantum information engines",
    "abstract": "Efficiency and power are two central measures of the performance of thermal\nmachines. We here study the power-efficiency-stability trade-off in a\nfinite-time quantum Carnot information engine, in which an information\nreservoir replaces the usual cold bath of a quantum Carnot engine. We\nanalytically evaluate mean and variance of the work output, and demonstrate\nthat maximum efficiency can be reached at both finite work output and finite\nwork output fluctuations. We additionally show that the relative work output\nfluctuations may be smaller than those of the corresponding Carnot heat engine.\nThis result implies that the finite-time quantum Carnot information engine can\nbe more stable than the quantum Carnot heat engine, an important property for\npractical applications.",
    "authors": [
      "Milton Aguilar",
      "Cüneyt Ünal",
      "Eric Lutz"
    ],
    "publication_date": "2025-09-05T08:19:44Z",
    "arxiv_id": "http://arxiv.org/abs/2509.04901v1",
    "download_url": "http://arxiv.org/abs/2509.04901v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Experience in engineering of scientific software: The case of an\n  optimization software for oil pipelines",
    "abstract": "Development of scientific and engineering software is usually different and\ncould be more challenging than the development of conventional enterprise\nsoftware. The authors were involved in a technology-transfer project between\nacademia and industry which focused on engineering, development and testing of\na software for optimization of pumping energy costs for oil pipelines. Experts\nwith different skillsets (mechanical, power and software engineers) were\ninvolved. Given the complex nature of the software (a sophisticated underlying\noptimization model) and having experts from different fields, there were\nchallenges in various software engineering aspects of the software system\n(e.g., requirements and testing). We report our observations and experience in\naddressing those challenges during our technology-transfer project, and aim to\nadd to the existing body of experience and evidence in engineering of\nscientific and engineering software. We believe that our observations,\nexperience and lessons learnt could be useful for other researchers and\npractitioners in engineering of other scientific and engineering software\nsystems.",
    "authors": [
      "Vahid Garousi",
      "Ehsan Abbasi",
      "Bedir Tekinerdogan"
    ],
    "publication_date": "2020-03-01T11:25:29Z",
    "arxiv_id": "http://arxiv.org/abs/2003.00463v1",
    "download_url": "http://arxiv.org/abs/2003.00463v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Single-Temperature Quantum Engine Without Feedback Control",
    "abstract": "A cyclically working quantum mechanical engine that operates at a single\ntemperature is proposed. Its energy input is delivered by a quantum\nmeasurement. The functioning of the engine does not require any feedback\ncontrol. We analyze work, heat, and the efficiency of the engine for the case\nof a working substance that is governed by the laws of quantum mechanics and\nthat can be adiabatically compressed and dilated. The obtained general\nexpressions are exemplified for a spin in an adiabatically changing magnetic\nfield and a particle moving in a potential with slowly changing shape.",
    "authors": [
      "Juyeon Yi",
      "Peter Talkner",
      "Yong Woon Kim"
    ],
    "publication_date": "2017-03-13T12:30:24Z",
    "arxiv_id": "http://arxiv.org/abs/1703.04359v1",
    "download_url": "http://arxiv.org/abs/1703.04359v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The efficiency of simple Quantum Engine Stirling and Ericsson cycle",
    "abstract": "The quantum engine cycle serves as an analogous representation of the\nmacroscopic nature of heat engines and the quantum regime of thermal devices\ncomposed of a single element. In this work, we follow the formalism of a\nquantum engine proposed by Bender et al. [1] where they observed quantum Carnot\ncycle with a single particle of mass m confined to an infinite one-dimensional\npotential well of width L as a working medium. Using this model, a\nquantum-mechanical analogue of the Stirling cycle [SC] and Ericsson cycle [EC]\nhave been constructed through changes of both, the width of the well and its\nquantum state. The efficiency of quantum engines is derived, which is found to\nbe analogous to classical thermodynamic engines. Keywords: Quantum\nthermodynamics, Quantum mechanics, Ericsson cycle, Stirling cycle, Quantum heat\nengines, Nano-engines.",
    "authors": [
      "Oladimeji Enock",
      "Umeh Emmanuel",
      "Abamba Oghenetega"
    ],
    "publication_date": "2020-10-04T13:22:52Z",
    "arxiv_id": "http://arxiv.org/abs/2010.01581v1",
    "download_url": "http://arxiv.org/abs/2010.01581v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bath engineering enhanced quantum critical engines",
    "abstract": "Driving a quantum system across quantum critical points leads to\nnon-adiabatic excitations in the system. This in turn may adversely affect the\nfunctioning of a quantum machine which uses a quantum critical substance as its\nworking medium. Here we propose a bath-engineered quantum engine (BEQE), in\nwhich we use the Kibble--Zurek mechanism and critical scaling laws to formulate\na protocol for enhancing the performance of finite-time quantum engines\noperating close to quantum phase transitions. In the case of free fermionic\nsystems, BEQE enables finite-time engines to outperform engines operating in\nthe presence of shortcuts to adiabaticity, and even infinite-time engines under\nsuitable conditions, thus showing the remarkable advantages offered by this\ntechnique. Open questions remain regarding the use of BEQE based on\nnon-integrable models.",
    "authors": [
      "Revathy B. S.",
      "Victor Mukherjee",
      "Uma Divakaran"
    ],
    "publication_date": "2022-08-13T05:53:40Z",
    "arxiv_id": "http://arxiv.org/abs/2208.06578v2",
    "download_url": "http://arxiv.org/abs/2208.06578v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formal Quantum Software Engineering: Introducing the Formal Methods of\n  Software Engineering to Quantum Computing",
    "abstract": "Quantum computing (QC) represents the future of computing systems, but the\ntools for reasoning about the quantum model of computation, in which the laws\nobeyed are those on the quantum mechanical scale, are still a mix of linear\nalgebra and Dirac notation; two subjects more suitable for physicists, rather\nthan computer scientists and software engineers. On this ground, we believe it\nis possible to provide a more intuitive approach to thinking and writing about\nquantum computing systems, in order to simplify the design of quantum\nalgorithms and the development of quantum software. In this paper, we move the\nfirst step in such direction, introducing a specification language as the tool\nto represent the operations of a quantum computer via axiomatic definitions, by\nadopting the same symbolisms and reasoning principles used by formal methods in\nsoftware engineering. We name this approach formal quantum software engineering\n(F-QSE). This work assumes familiarity with the basic principles of quantum\nmechanics (QM), with the use of Zed (Z) which is a formal language of software\nengineering (SE), and with the notation and techniques of first-order logic\n(FOL) and functional programming (FP).",
    "authors": [
      "Carmelo R. Cartiere"
    ],
    "publication_date": "2021-11-14T22:11:26Z",
    "arxiv_id": "http://arxiv.org/abs/2111.08426v1",
    "download_url": "http://arxiv.org/abs/2111.08426v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A photonic quantum engine driven by superradiance",
    "abstract": "Performance of nano- and micro-scale heat engines can be improved with a help\nfrom quantum mechanical phenomena. Recently, heat reservoirs with quantum\ncoherence have been proposed to enhance engine performance beyond the Carnot\nlimit even with a single reservoir. However, no physical realizations have been\nachieved so far. Here, we report the first proof-of-principle experimental\ndemonstration of a photonic quantum engine driven by superradiance employing a\nsingle heat reservoir composed of atoms and photonic vacuum. Reservoir atoms\nprepared in a quantum coherent superposition state underwent superradiance\nwhile traversing the cavity. This led to about 40-fold increase of the\neffective engine temperature, resulting in a near-unity engine efficiency.\nMoreover, the observed engine output power grew quadratically with respect to\nthe atomic injection rate. Our work can be utilized in quantum mechanical heat\ntransfer as well as in boosting engine powers, opening a pathway to development\nof photomechanical devices that run on quantum coherence embedded in heat\nbaths.",
    "authors": [
      "Jinuk Kim",
      "Seung-hoon Oh",
      "Daeho Yang",
      "Junki Kim",
      "Moonjoo Lee",
      "Kyungwon An"
    ],
    "publication_date": "2024-06-22T02:23:38Z",
    "arxiv_id": "http://arxiv.org/abs/2406.15710v1",
    "download_url": "http://arxiv.org/abs/2406.15710v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Anyonic Quantum Carnot Engine",
    "abstract": "Combining two disparate lines of thought like thermodynamics and quantum\nmechanics yields surprising results. The resulting idea of quantum\nthermodynamic engines holds promise for harvesting novel sources of energy of\npurely quantum origin, like quantum statistics, to extract mechanical work from\nmacroscopic quantum systems like Bose-Einstein condensates. It also allows one\nto explore thermodynamic thinking to `small' systems consisting only a few\nparticles in quantum theory. In an earlier paper we had studied the quantum\nOtto engine using a small number of one-dimensional anyons as the medium to\ndrive the thermodynamic engine. In this sequel, we study the gold-standard of\nthermodynamic engines, namely the Carnot engine, using two-dimensional anyons\nas the medium. An explicit expression is derived for the efficiency of the\nanyonic quantum Carnot engine.",
    "authors": [
      "H S Mani",
      "N Ramadas",
      "V V Sreedhar"
    ],
    "publication_date": "2025-04-29T09:49:28Z",
    "arxiv_id": "http://arxiv.org/abs/2504.20596v1",
    "download_url": "http://arxiv.org/abs/2504.20596v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical Orthosis Mechanism to Facilitate the Extension of the Leg",
    "abstract": "This paper presents the design of a mechanism to help people using mechanical\northoses to extend their legs easily and lock the knee joint of their orthosis.\nMany people living with spinal cord injury are living with paraplegia and thus\nneed orthoses to be able to stand and walk. Mechanical orthoses are common\ntypes of orthopedic devices. This paper proposes to add a mechanism that\ncreates a lever arm just below the knee joint to help the user extend the leg.\nThe development of the mechanism is first presented, then followed by the\nresults of the tests that were conducted.",
    "authors": [
      "Gabrielle Lemire",
      "Thierry Laliberté",
      "Alexandre Campeau-Lecours"
    ],
    "publication_date": "2020-10-14T00:42:45Z",
    "arxiv_id": "http://arxiv.org/abs/2010.06751v1",
    "download_url": "http://arxiv.org/abs/2010.06751v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanism Design Theory in Control Engineering: A Tutorial and Overview\n  of Applications in Communication, Power Grid, Transportation, and Security\n  Systems",
    "abstract": "This article provides an introduction to the theory of mechanism design and\nits application to engineering problems. Our aim is to provide the fundamental\nprinciples of the theory of mechanism design for control engineers and\ntheorists along with the state-of-the-art methods in engineering applications.\nWe start our exposition with a brief overview of game theory highlighting the\nkey notions that are necessary to introduce mechanism design, and then we offer\na comprehensive discussion of the principles in mechanism design. Finally, we\nexplore four key applications of mechanism design in engineering, i.e.,\ncommunication networks, power grids, transportation, and security systems.",
    "authors": [
      "Ioannis Vasileios Chremos",
      "Andreas A. Malikopoulos"
    ],
    "publication_date": "2022-12-01T18:40:50Z",
    "arxiv_id": "http://arxiv.org/abs/2212.00756v1",
    "download_url": "http://arxiv.org/abs/2212.00756v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Improving transferability between different engineering stages in the\n  development of automated material flow modules",
    "abstract": "For improving flexibility and robustness of the engineering of automated\nproduction systems (aPS) in case of extending, reducing or modifying parts,\nseveral approaches propose an encapsulation and clustering of related\nfunctions, e.g. from the electrical, mechanical or software engineering, based\non a modular architecture. Considering the development of these modules, there\nare different stages, e.g. module planning or functional engineering, which\nhave to be completed. A reference model that addresses the different stages for\nthe engineering of aPS is proposed by AutomationML. Due to these different\nstages and the integration of several engineering disciplines, e.g. mechanical,\nelectrical/electronic or software engineering, information not limited to one\ndiscipline are stored redundantly increasing the effort to transfer information\nand the risk of inconsistency. Although, data formats for the storage and\nexchange of plant engineering information exist, e.g. AutomationML, fixed\ndomain specific structures and relations of the information, e.g. for automated\nmaterial flow systems (aMFS), are missing. This paper presents the integration\nof a meta model into the development of modules for aMFS to improve the\ntransferability and consistency of information between the different\nengineering stages and the increasing level of detail from the coarse-grained\nplant planning to the fine-grained functional engineering.",
    "authors": [
      "Daniel Regulin",
      "Thomas Aicher",
      "Birgit Vogel-Heuser"
    ],
    "publication_date": "2022-12-09T13:50:52Z",
    "arxiv_id": "http://arxiv.org/abs/2212.04854v1",
    "download_url": "http://arxiv.org/abs/2212.04854v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A controllable anti-P-pseudo-Hermitian mechanical system and its\n  application",
    "abstract": "A novel anti-P-pseudo-Hermitian mechanical system that integrates\npiezoelectric actuators and sensors with non-reciprocal coupling into\nmechanical beams is proposed. This configuration enables the system to exhibit\nprogrammable exceptional points (EPs), which are critical for enhancing\nsensitivity in sensing applications. Our theoretical analysis, supported by\nnumerical simulations and experimental validation, demonstrates the system's\ncapability to detect minute mass variations and identify surface cracks with\nhigh precision. This advancement not only contributes to the field of\nnon-Hermitian physics but also paves the way for the development of\nnext-generation mechanical sensors leveraging EP physics.",
    "authors": [
      "Yanzheng Wang",
      "Jianlei Zhao",
      "Qian Wu",
      "Xiaoming Zhou",
      "Heng Jiang",
      "Weiqiu Chen",
      "Mu Wang",
      "Guoliang Huang"
    ],
    "publication_date": "2025-10-09T08:11:26Z",
    "arxiv_id": "http://arxiv.org/abs/2510.07918v1",
    "download_url": "http://arxiv.org/abs/2510.07918v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hidden symmetries and nonlinear constitutive relations for\n  tight-coupling heat engines",
    "abstract": "Typical heat engines exhibit a kind of homotypy: The heat exchanges between a\ncyclic heat engine and its two heat reservoirs abide by the same function type;\nthe forward and backward flows of an autonomous heat engine also conform to the\nsame function type. This homotypy mathematically reflects in the existence of\nhidden symmetries for heat engines. The heat exchanges between the cyclic heat\nengine and its two reservoirs are dual under the joint transformation of parity\ninversion and time-reversal operation. Similarly, the forward and backward\nflows in the autonomous heat engine are also dual under the parity inversion.\nWith the consideration of these hidden symmetries, we derive a generic\nnonlinear constitutive relation up to the quadratic order for tight-coupling\ncyclic heat engines and that for tight-coupling autonomous heat engines,\nrespectively.",
    "authors": [
      "Shiqi Sheng",
      "Z. C. Tu"
    ],
    "publication_date": "2015-01-15T03:25:32Z",
    "arxiv_id": "http://arxiv.org/abs/1501.03563v2",
    "download_url": "http://arxiv.org/abs/1501.03563v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Holographic Heat Engines as Quantum Heat Engines",
    "abstract": "Certain solutions of Einstein's equations in anti-de Sitter spacetime can be\nengineered, using extended gravitational thermodynamics, to yield `holographic\nheat engines', devices that turn heat into useful mechanical work. On the other\nhand, there are constructions (both experimental and theoretical) where a\nseries of operations is performed on a small quantum system, defining what are\nknown as `quantum heat engines'. We propose that certain holographic heat\nengines can be considered models of quantum heat engines, and the possible\nfruitfulness of this connection is discussed. Motivated by features of quantum\nheat engines that take a quantum system through analogues of certain classic\nthermodynamic cycles, some black hole Otto and Diesel cycles are presented and\nexplored for the first time. In the expected regime of overlap, our Otto\nefficiency formulae are of the form exhibited by quantum and classical heat\nengines.",
    "authors": [
      "Clifford V. Johnson"
    ],
    "publication_date": "2019-05-22T23:12:18Z",
    "arxiv_id": "http://arxiv.org/abs/1905.09399v1",
    "download_url": "http://arxiv.org/abs/1905.09399v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of one and two-qubit nonequilibrium heat engines running\n  between squeezed thermal reservoirs",
    "abstract": "Quantum heat engines form an active field of research due to their potential\napplications. There are several phenomena that are unique to the quantum\nregime, some of which are known to give these engines an edge over their\nclassical counterparts. In this work, we focus on the study of one and\ntwo-qubit finite-time Otto engines interacting with squeezed thermal baths, and\ndiscuss their important distinctions as well as the advantage of using the\ntwo-qubit engine. In particular, the two-qubit engine offers an interesting\nstudy of the interplay between the degree of squeezing and that of the\ncoherence between the two qubits. We find that the two-qubit engine generally\nyields higher power than its one-qubit counterpart. The effective temperature\nof the squeezed baths can be calculated both for the one and two-qubit engines,\nand they tend to show an exponential growth with increase in squeezing\nparameters $r_h$ and $r_c$. It is also observed that by tuning the squeezing\nparameters, the machine can be made to work either in the engine or in the\nrefrigerator mode. Additional effects due to the change in the inter-qubit\nseparation have been studied.",
    "authors": [
      "Ashutosh Kumar",
      "Trilochan Bagarti",
      "Sourabh Lahiri",
      "Subhashish Banerjee"
    ],
    "publication_date": "2022-09-14T05:51:34Z",
    "arxiv_id": "http://arxiv.org/abs/2209.06433v1",
    "download_url": "http://arxiv.org/abs/2209.06433v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering Meets Systems Engineering: Conceptual Modeling\n  Applied to Engineering Operations",
    "abstract": "Models are fundamentally crucial to many scientific fields, including\nsoftware engineering, systems engineering, enterprise modeling, and business\nmodeling. This paper focuses on diagrammatic conceptual modeling, as opposed to\nmathematical or computational models, wherein a conceptual model is a\ntranslation of reality processes into an abstract mechanism that has similar\nstructure and parallel events of the external processes. Although various\nmodeling approaches exist, including UML (Unified Modeling Language) in\nsoftware engineering and its dialect, SysML (System Modeling Language), in\nsystems engineering, several difficulties arise in such models, including the\nproblem of model multiplicity that is related to the lack an integrated view of\nstructure and behavior. This paper generalizes conceptual modeling to be\napplied in organizations at large. According to authorities, the so-called\norganization theory portrays organizations as machine-like systems. As a\nmachine, an organization coordinates its parts to transform inputs into\noutputs. Therefore, we synthesize the notion of an organization as a machine\nand apply a new modeling methodology called thinging machine (TM) to real\nengineering operations. The results show the viability of the TM methodology\nserving as a foundation for high-level modelling of systems.",
    "authors": [
      "Sabah Al-Fedaghi",
      "Mahdi Modhaffar"
    ],
    "publication_date": "2021-10-26T20:02:33Z",
    "arxiv_id": "http://arxiv.org/abs/2110.13995v1",
    "download_url": "http://arxiv.org/abs/2110.13995v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimization analysis of an endoreversible quantum heat engine with\n  efficient power function",
    "abstract": "We study the optimal performance of an endoreversible quantum dot heat\nengine, in which the heat transfer between the system and baths is mediated by\nqubits, operating under the conditions of a trade-off objective function known\nas maximum efficient power function defined by the product of power and\nefficiency of the engine. First, we numerically study the optimization of the\nefficient power function for the engine under consideration. Then, we obtain\nsome analytic results by applying hightemperature limit and compare the\nperformance of the engine at maximum efficient power functionto the engine\noperating in the maximum power regime. We find that the engine operating at\nmaximum efficient power function produces at least 88.89% of the maximum power\noutput while at the same time reduces the power loss due to entropy production\nby considerable amount. We conclude by studying the stochastic simulations of\nthe efficiency of the engine in maximum power and maximum efficient power\nregime. We find that the engine operating at maximum power is subjected to less\npower fluctuations as compared to the on one operating at maximum efficient\npower function.",
    "authors": [
      "Kirandeep Kaur",
      "Anmol Jain",
      "Love Sahajbir Singh",
      "Rakesh Singla",
      "Shishram Rebari"
    ],
    "publication_date": "2023-01-10T12:09:54Z",
    "arxiv_id": "http://arxiv.org/abs/2301.03927v1",
    "download_url": "http://arxiv.org/abs/2301.03927v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Brain-Inspired Spike Echo State Network Dynamics for Aero-Engine\n  Intelligent Fault Prediction",
    "abstract": "Aero-engine fault prediction aims to accurately predict the development trend\nof the future state of aero-engines, so as to diagnose faults in advance.\nTraditional aero-engine parameter prediction methods mainly use the nonlinear\nmapping relationship of time series data but generally ignore the adequate\nspatiotemporal features contained in aero-engine data. To this end, we propose\na brain-inspired spike echo state network (Spike-ESN) model for aero-engine\nintelligent fault prediction, which is used to effectively capture the\nevolution process of aero-engine time series data in the framework of\nspatiotemporal dynamics. In the proposed approach, we design a spike input\nlayer based on Poisson distribution inspired by the spike neural encoding\nmechanism of biological neurons, which can extract the useful temporal\ncharacteristics in aero-engine sequence data. Then, the temporal\ncharacteristics are input into a spike reservoir through the current\ncalculation method of spike accumulation in neurons, which projects the data\ninto a high-dimensional sparse space. In addition, we use the ridge regression\nmethod to read out the internal state of the spike reservoir. Finally, the\nexperimental results of aero-engine states prediction demonstrate the\nsuperiority and potential of the proposed method.",
    "authors": [
      "Mo-Ran Liu",
      "Tao Sun",
      "Xi-Ming Sun"
    ],
    "publication_date": "2024-06-14T04:06:17Z",
    "arxiv_id": "http://arxiv.org/abs/2406.12918v1",
    "download_url": "http://arxiv.org/abs/2406.12918v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ergotropic advantage in a measurement-fueled quantum heat engine",
    "abstract": "This paper investigates a coupled two-qubits heat engine fueled by\ngeneralized measurements of the spin components and using a single heat\nreservoir as sink. Our model extends the four-stroke engine proposed by Yi and\ncoworkers [Phys. Rev. E {\\bf 96}, 022108 (2017)] by introducing an\nergotropy-extracting stroke, resulting in a five-stroke cycle. For measurements\nalong z-z directions, we find two possible occupation distributions that yield\nan active state and the ergotropic stroke improves the performance of the\nengine over the four-stroke cycle. Further, the three-stroke engine (without\nthe adiabatic strokes) yields the same performance as the five-stroke engine.\nFor arbitrary working medium and non-selective measurements, we prove that the\ntotal work output of a five-stroke engine is equal to the sum of the work\noutputs of the corresponding four-stroke and three-stroke engines. For\nmeasurement directions other than z-z, there may be many possible orderings of\nthe post-measurement probabilities that yield an active state. However, as we\nillustrate for specific cases (x-x and x-z directions), a definite ordering is\nobtained with the projective measurements. Thus, we find that the five-stroke\nengine exploiting ergotropy outperforms both its four-stroke as well as\nthree-stroke counterparts.",
    "authors": [
      "Sidhant Jakhar",
      "Ramandeep S. Johal"
    ],
    "publication_date": "2025-09-11T12:31:25Z",
    "arxiv_id": "http://arxiv.org/abs/2509.09402v1",
    "download_url": "http://arxiv.org/abs/2509.09402v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A stochastic heat engine driven using a nonlinear protocol",
    "abstract": "A colloidal particle confined in a time-dependent optical trap can function\nas a microscopic heat engine, with optimization strategies playing a crucial\nrole in enhancing its performance. In this study, we numerically investigate a\nStirling heat engine operating in both passive and active environments using a\nprotocol inspired by the Engineered Swift Equilibration (ESE) method. This\napproach differs from the standard process and focuses on enhancing engine\nefficiency, particularly at short time scales. We analyze various fluctuating\nparameters throughout the cycle to validate the robustness of the engine, and\ndemonstrate a significant enhancement in performance compared to conventional\nStirling engines. Most crucially, we observe that the nonlinear protocol can\neven transform a heat-pump-like operation into a genuine heat engine under\nstrong activity, thereby surpassing bounds imposed on efficiency by\nhigh-temperature and quasi-static conditions. Finally, the proposed protocol is\ndesigned with experimental feasibility in mind, making it a promising framework\nfor the practical realization of efficient microscopic heat engines.",
    "authors": [
      "Amrutayani Panda",
      "Biswajit Das",
      "Shuvojit Paul",
      "Arnab Saha",
      "Ayan Banerjee"
    ],
    "publication_date": "2025-09-19T14:05:27Z",
    "arxiv_id": "http://arxiv.org/abs/2509.15992v1",
    "download_url": "http://arxiv.org/abs/2509.15992v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Squeezed thermal reservoirs as a resource for a nano-mechanical engine\n  beyond the Carnot limit",
    "abstract": "The efficient conversion of thermal energy to mechanical work by a heat\nengine is an ongoing technological challenge. Since the pioneering work of\nCarnot, it is known that the efficiency of heat engines is bounded by a\nfundamental upper limit, the Carnot limit. Theoretical studies suggest that\nheat engines may be operated beyond the Carnot limit by exploiting stationary,\nnon-equilibrium reservoirs that are characterized by a temperature as well as\nfurther parameters. In a proof-of-principle experiment, we demonstrate that the\nefficiency of a nano-beam heat engine coupled to squeezed thermal noise is not\nbounded by the standard Carnot limit. Remarkably, we also show that it is\npossible to design a cyclic process that allows for extraction of mechanical\nwork from a single squeezed thermal reservoir. Our results demonstrate a\nqualitatively new regime of non-equilibrium thermodynamics at small scales and\nprovide a new perspective on the design of efficient, highly miniaturized\nengines.",
    "authors": [
      "Jan Klaers",
      "Stefan Faelt",
      "Atac Imamoglu",
      "Emre Togan"
    ],
    "publication_date": "2017-03-29T13:19:20Z",
    "arxiv_id": "http://arxiv.org/abs/1703.10024v2",
    "download_url": "http://arxiv.org/abs/1703.10024v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Poschl-Teller Like Description of Quantum Mechanical Carnot Engine",
    "abstract": "In this work an example of a cyclic engine based on a quantum-mechanical\nproperties of the strongly non linear quantum oscillator described by the\nPoschl-Teller [PT] model is examined. Using the [PT] model as shown in our\nearlier works [1-4], a quantum-mechanical analog of Carnot cycle (i.e quantum\nheat engine) has been constructed through the changes of both, the width L of\nthe well and its quantum state. This quantum heat engine has a cycle consisting\nof adiabatic and isothermal quantum processes. The efficiency of the quantum\nengine based on the Poschl-Teller-like potential is derived and it is analogous\nto classical thermodynamic engines.",
    "authors": [
      "E. O. Oladimeji",
      "S. O. Owolabi Solomon",
      "J. T. Adeleke"
    ],
    "publication_date": "2019-06-09T22:58:43Z",
    "arxiv_id": "http://arxiv.org/abs/1906.03734v3",
    "download_url": "http://arxiv.org/abs/1906.03734v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical Engineers Training in Using Cloud and Mobile Services in\n  Professional Activity",
    "abstract": "The purpose of this article is to identify mobile and cloud services of\nmechanical engineers professional activity and the principles of their use in\nhigher technical education. There have been defined the criteria for evaluation\nof the tools for edu-cational and professional activities. On the basis of this\ncriteria, more than 30 var-ious cloud services and mobile applications have\nbeen analyzed. The analysis has shown that the use of Autodesk cloud services\nand their integration with cloud services Google is appropriate for\nprofessional and practical training of special-ists in applied mechanics, and\nit promotes an effective development of mechanical engineers ICT competence.\nThe learning tools integrated system model was pro-posed.",
    "authors": [
      "Maryna Rassovytska",
      "Andrii Striuk"
    ],
    "publication_date": "2018-07-01T11:11:12Z",
    "arxiv_id": "http://arxiv.org/abs/1807.00313v1",
    "download_url": "http://arxiv.org/abs/1807.00313v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficiency bounds for nonequilibrium heat engines",
    "abstract": "We analyze the efficiency of thermal engines (either quantum or classical)\nworking with a single heat reservoir like atmosphere. The engine first gets an\nenergy intake, which can be done in arbitrary non-equilibrium way e.g.\ncombustion of fuel. Then the engine performs the work and returns to the\ninitial state. We distinguish two general classes of engines where the working\nbody first equilibrates within itself and then performs the work (ergodic\nengine) or when it performs the work before equilibrating (non-ergodic engine).\nWe show that in both cases the second law of thermodynamics limits their\nefficiency. For ergodic engines we find a rigorous upper bound for the\nefficiency, which is strictly smaller than the equivalent Carnot efficiency.\nI.e. the Carnot efficiency can be never achieved in single reservoir heat\nengines. For non-ergodic engines the efficiency can be higher and can exceed\nthe equilibrium Carnot bound. By extending the fundamental thermodynamic\nrelation to nonequilibrium processes, we find a rigorous thermodynamic bound\nfor the efficiency of both ergodic and non-ergodic engines and show that it is\ngiven by the relative entropy of the non-equilibrium and initial equilibrium\ndistributions.These results suggest a new general strategy for designing more\nefficient engines. We illustrate our ideas by using simple examples.",
    "authors": [
      "Pankaj Mehta",
      "Anatoli Polkovnikov"
    ],
    "publication_date": "2012-07-24T20:40:57Z",
    "arxiv_id": "http://arxiv.org/abs/1207.5818v2",
    "download_url": "http://arxiv.org/abs/1207.5818v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "InAs three quantum dots as working substance for quantum heat engine",
    "abstract": "Heat engines are considered a valuable resource for modern society. The\ndevelopment of these systems leads to the production of heat engines with high\nefficiency despite their small size, called quantum heat engines. Among these,\nthe quantum Otto cycle which is considered a fundamental thermodynamic cycle in\nclassical heat engines, has also found applications in the realm of quantum\nheat engines. In this paper, we consider three InAs quantum dots as a working\nsubstance, which allows the engine to operate at very small scales, in the\npresence of an electric field, and the Forster mechanism, which describes the\ntransfer of energy between quantum dots and affects thus the engine's behavior.\nIn this regard, we study the behavior of the work performed by the engine and\nthe entanglement in the system as the Forster parameter is varied. We find that\nthe work performed by the engine is affected by the Forster interaction and the\nelectric field and that the entanglement in the system also changed as the\nForster parameter was changed. Finally, we study the influence of entanglement\non the work performed by the engine. We find and discuss the intricate relation\nbetween the entanglement and the performance of the engine.",
    "authors": [
      "H. Ait Mansour",
      "F. El Ayachi",
      "M. Faqir",
      "M. Elbaz"
    ],
    "publication_date": "2023-09-19T23:04:09Z",
    "arxiv_id": "http://arxiv.org/abs/2309.10958v1",
    "download_url": "http://arxiv.org/abs/2309.10958v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sorption heat engines: simple inanimate negative entropy generators",
    "abstract": "The name 'sorption heat engines' is proposed for simple negative entropy\ngenerators that are driven by thermal cycling and work on alternating\nadsorption and desorption. These generators are in general not explicitly\nrecognized as heat engines. Their mechanism is applicable to the fields of\nengineering, physics, chemistry, geology, and biology, in particular the origin\nof life. Four kinds of sorption heat engines are distinguished depending on the\noccurrence of changes in the adsorbent or adsorbate during the thermal cycle.",
    "authors": [
      "Anthonie W. J. Muller",
      "Dirk Schulze-Makuch"
    ],
    "publication_date": "2005-07-23T17:53:59Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0507173v4",
    "download_url": "http://arxiv.org/abs/physics/0507173v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Attainability of Carnot Efficiency with Autonomous Engines",
    "abstract": "The maximum efficiency of autonomous engines with finite chemical potential\ndifference is investigated. We show that without a particular type of\nsingularity autonomous engines cannot attain the Carnot efficiency. In\naddition, we demonstrate that a special autonomous engine with the singularity\nattains the Carnot efficiency even if it is macroscopic. Our results clearly\nillustrate that the singularity plays a crucial role for the maximum efficiency\nof autonomous engines.",
    "authors": [
      "Naoto Shiraishi"
    ],
    "publication_date": "2015-07-06T11:26:23Z",
    "arxiv_id": "http://arxiv.org/abs/1507.01396v3",
    "download_url": "http://arxiv.org/abs/1507.01396v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric Heat Engines Featuring Power that Grows with Efficiency",
    "abstract": "Thermodynamics places a limit on the efficiency of heat engines, but not on\ntheir output power or on how the power and efficiency change with the engine's\ncycle time. In this manuscript, we develop a geometrical description of the\npower and efficiency as a function of the cycle time, applicable to an\nimportant class of heat engine models. This geometrical description is used to\ndesign engine protocols that attain both the maximal power and maximal\nefficiency at the fast driving limit. Furthermore, using this method we also\nprove that no protocol can exactly attain the Carnot efficiency at non-zero\npower.",
    "authors": [
      "Oren Raz",
      "Yigit Subaşı",
      "Rami Pugatch"
    ],
    "publication_date": "2016-02-23T02:40:03Z",
    "arxiv_id": "http://arxiv.org/abs/1602.07016v1",
    "download_url": "http://arxiv.org/abs/1602.07016v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Irreversible thermodynamic analysis and application for molecular heat\n  engines",
    "abstract": "The aim of this paper is to determine lost works in a molecular engine and\ncompare results with macro (classical) heat engines. Firstly, irreversible\nthermodynamics are reviewed for macro and molecular cycles. Secondly,\nirreversible thermodynamics approaches are applied for a quantum heat engine\nwith -1/2 spin system. Finally, lost works are determined for considered system\nand results show that macro and molecular heat engines obey same limitations.\nMoreover, a quantum thermodynamic approach is suggested in order to explain the\nresults previously obtained from an atomic viewpoint.",
    "authors": [
      "Umberto Lucia",
      "Emin Açıkkalp"
    ],
    "publication_date": "2017-06-01T10:21:28Z",
    "arxiv_id": "http://arxiv.org/abs/1706.01956v1",
    "download_url": "http://arxiv.org/abs/1706.01956v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Endoreversible Otto engines at maximal power",
    "abstract": "Despite its idealizations, thermodynamics has proven its power as a\npredictive theory for practical applications. In particular, the Curzon-Ahlborn\nefficiency provides a benchmark for any real engine operating at maximal power.\nHere we further develop the analysis of endoreversible Otto engines. For a\ngeneric class of working mediums, whose internal energy is proportional to some\npower of the temperature, we find that no engine can achieve the Carnot\nefficiency at finite power. However, we also find that for the specific example\nof photonic engines the efficiency at maximal power is larger than the\nCurzon-Ahlborn efficiency.",
    "authors": [
      "Zackary Smith",
      "P. S. Pal",
      "Sebastian Deffner"
    ],
    "publication_date": "2020-03-24T19:57:47Z",
    "arxiv_id": "http://arxiv.org/abs/2003.11093v2",
    "download_url": "http://arxiv.org/abs/2003.11093v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]