[
  {
    "title": "Teaching Introductory Electrical Engineering Course to CS Students in a\n  Russian University",
    "abstract": "This article is about the author's experience with developing and teaching an\nintroductory electrical engineering course for students of Faculty (department)\nof Information Technology of a Russian university. The curriculum of this\ndepartment conforms to typical computer science curricula of US engineering\nschools with a noticeable omission of comparable electrical engineering\ncourses. When developing the course, I did my best to pay attention to learning\npreferences of the department's student body. I also hoped to contribute to a\ndegree to meeting labor market demands for developers of electrical engineering\nCAD software. As for inspiration, I was enchanted with ideas of the Mead &\nConway revolution, albeit indirectly related to my enterprise.",
    "authors": [
      "Vladimir Vasilich Tregub"
    ],
    "publication_date": "2011-07-19T17:36:18Z",
    "arxiv_id": "http://arxiv.org/abs/1107.3785v1",
    "download_url": "http://arxiv.org/abs/1107.3785v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "AB Space Engine",
    "abstract": "On 4 January 2007 the author published the article Wireless Transfer of\nElectricity in Outer Space in http://arxiv.org wherein he offered and\nresearched a new revolutionary method of transferring electric energy in space.\nIn that same article, he offered a new engine which produces a large thrust\nwithout throwing away large amounts of reaction mass (unlike the conventional\nrocket engine).\n  In the current article, the author develops the theory of this kind of\nimpulse engine and computes a sample project which shows the big possibilities\nopened by this new AB-Space Engine. The AB-Space Engine gets the energy from\nground-mounted power; a planet electric station can transfer electricity up to\n1000 millions (and more) of kilometers by plasma wires. Author shows that\nAB-Space Engine can produce thrust of 10 tons (and more). That can accelerate a\nspace ship to some thousands of kilometers/second. AB-Space Engine has a\nstaggering specific impulse owing to the very small mass expended. The AB-Space\nEngine reacts not by expulsion of its own mass (unlike rocket engine) but\nagainst the mass of its planet of origin (located perhaps a thousand of\nmillions of kilometers away) through the magnetic field of its plasma cable.\nFor creating this plasma cable the AB-Space Engine spends only some kg of\nhydrogen.",
    "authors": [
      "Alexander Bolonkin"
    ],
    "publication_date": "2008-03-02T00:49:09Z",
    "arxiv_id": "http://arxiv.org/abs/0803.0089v1",
    "download_url": "http://arxiv.org/abs/0803.0089v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modelling Electricity Consumption in Office Buildings: An Agent Based\n  Approach",
    "abstract": "In this paper, we develop an agent-based model which integrates four\nimportant elements, i.e. organisational energy management policies/regulations,\nenergy management technologies, electric appliances and equipment, and human\nbehaviour, to simulate the electricity consumption in office buildings. Based\non a case study, we use this model to test the effectiveness of different\nelectricity management strategies, and solve practical office electricity\nconsumption problems. This paper theoretically contributes to an integration of\nthe four elements involved in the complex organisational issue of office\nelectricity consumption, and practically contributes to an application of an\nagent-based approach for office building electricity consumption study.",
    "authors": [
      "Tao Zhang",
      "Peer-Olaf Siebers",
      "Uwe Aickelin"
    ],
    "publication_date": "2013-05-31T15:01:01Z",
    "arxiv_id": "http://arxiv.org/abs/1305.7437v1",
    "download_url": "http://arxiv.org/abs/1305.7437v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimal efficiency and power and their trade-off in three-terminal\n  quantum thermoelectric engines with two output electric currents",
    "abstract": "We establish a theory of optimal efficiency and power for three-terminal\nthermoelectric engines which have two independent output electric currents and\none input heat current. This set-up goes beyond the conventional heat engines\nwith only one output electric current. For such a set-up, we derive the optimal\nefficiency and power and their trade-off for three-terminal heat engines with\nand without time-reversal symmetry. The formalism goes beyond the known optimal\nefficiency and power for systems with or without time-reversal symmetry,\nshowing interesting features that have not been revealed before. A concrete\nexample of quantum-dot heat engine is studied to show that the current set-up\ncan have much improved efficiency and power compared with previous set-ups with\nonly one output electric current. Our analytical results also apply for\nthermoelectric heat engines with multiple output electric currents, providing\nan alternative scheme toward future high-performance thermoelectric materials.",
    "authors": [
      "Jincheng Lu",
      "Yefeng Liu",
      "Rongqian Wang",
      "Chen Wang",
      "Jian-Hua Jiang"
    ],
    "publication_date": "2019-05-27T06:31:15Z",
    "arxiv_id": "http://arxiv.org/abs/1905.10992v1",
    "download_url": "http://arxiv.org/abs/1905.10992v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electric cars, assessment of green nature vis a vis conventional fuel\n  driven cars",
    "abstract": "A comprehensive analysis of energy requirements and emissions associated with\nelectric vehicles, ranging from mining and making the rare-earth magnets\nrequired in electric motor to assembling the Li-ion battery, including charging\nand regular running of the electric vehicles has been performed. A simple,\nanalytical procedure is used to determine the embodied energy and emissions.\nThe objective is to assess the potential of electric cars to reduce green house\ngases emission to limit global warming to < 1.5 degrees C by the Year 2050 as\nper IPCC recommendations and also to compare them with conventional fuel driven\ncars. The combined embodied energy for Nd- and Dy-metals production which are\nrequired in electric motors and battery assembly for 150 million cars,\nprojected to be on the road in the year 2050 is ~ 1500 TWh and the CO2\nemissions is found to be > 600 MT. The emissions includes carbon intensity of\nelectrical energy required to run these electric vehicles. The projected\nemissions due to fossil fuels, gasoline production as well as burning it in\ncombustion engines however is only 412 MT, far less than that due to electric\nvehicles. The main contributor to emissions from electric vehicles is the\nbattery assembling process which releases ~ 379 MT of CO2-e gases. The\nemissions from both electric vehicles as well as combustion engine vehicles\nscale linearly with the number of vehicles, indicating that a breakeven is not\npossible with the currently available manufacturing technologies. These results\nclearly show that significant technological developments have to take place in\nelectric vehicles so that they become environmentally better placed compared to\ncombustion engine based cars.",
    "authors": [
      "Satish Vitta"
    ],
    "publication_date": "2021-04-29T12:15:05Z",
    "arxiv_id": "http://arxiv.org/abs/2104.14287v1",
    "download_url": "http://arxiv.org/abs/2104.14287v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strain-engineering the Schottky barrier and electrical transport on MoS2",
    "abstract": "Strain provides an effective means to tune the electrical properties while\nretaining the native chemical composition of the material. Unlike\nthree-dimensional solids, two-dimensional materials withstand higher levels of\nelastic strain making it easier to tune various electrical properties to suit\nthe technology needs. In this work we explore the effect of uniaxial\ntensile-strain on the electrical transport properties of bi- and few-layered\nMoS2, a promising 2D semiconductor. Raman shifts corresponding to the in-plane\nvibrational modes show a redshift with strain indicating a softening of the\nin-plane phonon modes. Photo luminescence measurements reveal a redshift in the\ndirect and the indirect emission peaks signalling a reduction in the material\nbandgap. Transport measurements show a substantial enhancement in the\nelectrical conductivity with a high piezoresistive gauge factor of ~ 321\nsuperior to that for Silicon for our bi-layered device. The simulations\nconducted over the experimental findings reveal a substantial reduction of the\nSchottky barrier height at the electrical contacts in addition to the\nresistance of MoS2. Our studies reveal that strain is an important and\nversatile ingredient to tune the electrical properties of 2D materials and also\ncan be used to engineer high-efficiency electrical contacts for future device\nengineering.",
    "authors": [
      "Ashby Phillip John",
      "Arya Thenapparambil",
      "Madhu Thalakulam"
    ],
    "publication_date": "2020-04-10T14:50:57Z",
    "arxiv_id": "http://arxiv.org/abs/2004.05061v1",
    "download_url": "http://arxiv.org/abs/2004.05061v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The arctic electric power stations are the decision of energy,\n  environmental and climate problems",
    "abstract": "In this paper we propose the decision of energy, environmental and climate\nproblems of the society with the help of arctic electric power stations. Such\nstations can provide the electricity to the whole of Europe and Asian, this can\nsave from dependence on oil and gas. This method of producing electricity is\ncompletely ecologically safe. Keywords: electrical engineering, power station,\ndesign, generator, renewable, energy system",
    "authors": [
      "B. M. Ovchinnikov",
      "Yu. B. Ovchinnikov",
      "V. V. Parusov"
    ],
    "publication_date": "2021-12-14T13:16:30Z",
    "arxiv_id": "http://arxiv.org/abs/2112.12069v1",
    "download_url": "http://arxiv.org/abs/2112.12069v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electronic structures of defective BN nanotubes under transverse\n  electric fields",
    "abstract": "We investigate the electronic structures of some defective boron nitride\nnanotubes (BNNTs) under transverse electric fields within density-functional\ntheory. (16,0) BNNTs with antisite, carbon substitution, single vacancy, and\nStone-Wales 5775 defects are studied. Under transverse electric fields, the\nband gaps of the defective BNNTs are reduced, similar to the pristine ones. The\nenergy levels of the defect states vary with the transverse electric field\ndirections, due to the different electrostatic potential shift at the defect\nsites induced by the electric fields. Therefore, besides electronic structure\nand optical property engineering, the transverse electric field can be used to\nidentify the defect positions in BNNTs.",
    "authors": [
      "Shuanglin Hu",
      "Zhenyu Li",
      "X. C. Zeng",
      "Jinlong Yang"
    ],
    "publication_date": "2008-04-14T13:07:35Z",
    "arxiv_id": "http://arxiv.org/abs/0804.2171v1",
    "download_url": "http://arxiv.org/abs/0804.2171v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A discussion on the critical electric Rayleigh number for AC\n  electrokinetic flow of binary fluids in a divergent microchannel",
    "abstract": "Electrokinetic (EK) flow is a type of flow driven or manipulated by electric\nbody forces, influenced by various factors such as electric field intensity,\nelectric field form, frequency, electric permittivity/conductivity, fluid\nviscosity and etc. The diversity of dimensionless control parameters, such as\nthe electric Rayleigh number, complicates the comparison of EK flow stability.\nConsequently, comparing the performance and cost of micromixers or reactors\nbased on EK flow is challenging, posing an obstacle to their industrial and\nengineering applications. In this investigation, we theoretically derived a new\nelectric Rayleigh number ($Ra_e$) that quantifies the relationship among\nelectric body forces, fluid viscosity, and ion diffusivity, based on a tanh\nmodel of electric conductivity distribution. The calculation results indicate\nthat the new $Ra_e$ exhibits richer variation with the control parameters and\nbetter consistency with previous experimental reports. We further conducted\nexperimental studies on the critical electric Rayleigh number ($Ra_{ec}$) of AC\nEK flow of binary fluids in a divergent microchannel. The experimental\nvariations align well with the theoretical predictions, particularly the\nexistence of an optimal AC frequency and electric conductivity ratio,\ndemonstrating that the tanh model can better elucidate the underlying physics\nof EK flow. With the new electric Rayleigh number, we found that EK flow in the\ndesigned divergent microchannel has a much smaller $Ra_{ec}$ than previously\nreported, indicating that EK flow is more unstable and thus more suitable for\napplications in micromixers or reactors in industry and engineering.",
    "authors": [
      "Jinan Pang",
      "Yu Han",
      "Bo Sun",
      "Wei Zhao"
    ],
    "publication_date": "2024-07-30T13:10:13Z",
    "arxiv_id": "http://arxiv.org/abs/2407.20803v1",
    "download_url": "http://arxiv.org/abs/2407.20803v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electric Power Enhancement using Spin-Polarized Fuel in Fusion Power\n  Plants",
    "abstract": "Using a range of fusion power plant (FPP) concepts, we demonstrate that\nspin-polarized fuel (SPF) can significantly enhance net electric power output,\noften by many multiples. Notably, the electric power gain from SPF generally\nexceeds the corresponding increase in thermal fusion power. Plants close to\nengineering breakeven stand to benefit most, where even modest boosts in fusion\npower produce disproportionately larger gains in net electricity. As a\nrepresentative example, a 25% increase in fusion power via SPF could allow an\nITER-like device (with an added turbine to recover thermal fusion power) to\nachieve engineering breakeven. These findings strongly motivate the development\nof spin-polarized fuel for FPPs.",
    "authors": [
      "J. F. Parisi",
      "A. Diallo"
    ],
    "publication_date": "2025-02-21T21:11:16Z",
    "arxiv_id": "http://arxiv.org/abs/2502.15941v1",
    "download_url": "http://arxiv.org/abs/2502.15941v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electric Field Propagation Through Singular Value Decomposition",
    "abstract": "We demonstrate that the singular value decomposition algorithm in conjunction\nwith the fast Fourier transform or finite difference procedures provides a\nstraightforward and accurate method for rapidly propagating electric fields in\nthe one-way Helmholtz formalism.",
    "authors": [
      "David Yevick"
    ],
    "publication_date": "2020-01-24T09:29:12Z",
    "arxiv_id": "http://arxiv.org/abs/2001.09842v1",
    "download_url": "http://arxiv.org/abs/2001.09842v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "AITEE -- Agentic Tutor for Electrical Engineering",
    "abstract": "Intelligent tutoring systems combined with large language models offer a\npromising approach to address students' diverse needs and promote\nself-efficacious learning. While large language models possess good\nfoundational knowledge of electrical engineering basics, they remain\ninsufficiently capable of addressing specific questions about electrical\ncircuits. In this paper, we present AITEE, an agent-based tutoring system for\nelectrical engineering designed to accompany students throughout their learning\nprocess, offer individualized support, and promote self-directed learning.\nAITEE supports both hand-drawn and digital circuits through an adapted circuit\nreconstruction process, enabling natural interaction with students. Our novel\ngraph-based similarity measure identifies relevant context from lecture\nmaterials through a retrieval augmented generation approach, while parallel\nSpice simulation further enhances accuracy in applying solution methodologies.\nThe system implements a Socratic dialogue to foster learner autonomy through\nguided questioning. Experimental evaluations demonstrate that AITEE\nsignificantly outperforms baseline approaches in domain-specific knowledge\napplication, with even medium-sized LLM models showing acceptable performance.\nOur results highlight the potential of agentic tutors to deliver scalable,\npersonalized, and effective learning environments for electrical engineering\neducation.",
    "authors": [
      "Christopher Knievel",
      "Alexander Bernhardt",
      "Christian Bernhardt"
    ],
    "publication_date": "2025-05-27T10:07:05Z",
    "arxiv_id": "http://arxiv.org/abs/2505.21582v1",
    "download_url": "http://arxiv.org/abs/2505.21582v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Random Matrices",
    "abstract": "We review elementary properties of random matrices and discuss widely used\nmathematical methods for both hermitian and nonhermitian random matrix\nensembles. Applications to a wide range of physics problems are summarized.\nThis paper originally appeared as an article in the Wiley Encyclopedia of\nElectrical and Electronics Engineering.",
    "authors": [
      "M. A. Stephanov",
      "J. J. M. Verbaarschot",
      "T. Wettig"
    ],
    "publication_date": "2005-09-26T15:15:16Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/0509286v1",
    "download_url": "http://arxiv.org/abs/hep-ph/0509286v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Advanced Power Transmission of the Future",
    "abstract": "Electric power is a vital ingredient of modern society. This article is\nwritten to provide an insight into the physics and engineering that go into the\ntransmission of electric power and its potential modernization. Topics covered\nwill be Transmission and Distribution, Comparing Overhead and Underground\nDelivery, Pros and Cons of Underground Delivery, Superconducting Transmission,\nCryorisistive Delivery, Hyperconductivity, and Metal-Plated Graphite Fibers.",
    "authors": [
      "Mario Rabinowitz"
    ],
    "publication_date": "2003-04-19T02:01:50Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0304070v1",
    "download_url": "http://arxiv.org/abs/physics/0304070v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Improved Power System of the Future",
    "abstract": "This paper is intended to provide an insight into physics and engineering\nthat can modernize electric power systems. Topics covered are Flexible ac\ntransmission systems (FACTS), Custom Power, Greatly improved Capacitors,\nElectrical Insulation, Distribution Cables, Improved Polymeric Insulation,\nUnderground Vault Explosions, Fault Location, Smart Cables, Neutral and Ground,\nCorrosion and Protection, Conventional Transformers, Compact Transformers,\nFerroresonance, and Solid State Transformers.",
    "authors": [
      "Mario Rabinowitz"
    ],
    "publication_date": "2003-04-22T20:52:28Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0304083v1",
    "download_url": "http://arxiv.org/abs/physics/0304083v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Otto heat engine based on a multiferroic chain working substance",
    "abstract": "We study a quantum Otto engine operating on the basis of a helical spin- 1/2\nmultiferroic chain with strongly coupled magnetic and ferroelectric order\nparameters. The presence of a finite spin chirality in the working substance\nenables steering of the cycle by an external electric field that couples to the\nelectric polarization. We observe a direct connection between the chirality,\nthe entanglement and the efficiency of the engine. An electric-field dependent\nthreshold temperature is identified above which the pair correlations in the\nsystem, as quantified by the thermal entanglement, diminish. In contrast to the\npair correlations, the collective many-body thermal entanglement is less\nsensitive to the electric field, and in the high temperature limit converges to\na constant value. We also discuss the correlations between the threshold\ntemperature of the pair entanglement, the spin chirality and the minimum of the\nfidelities in relation to the electric and magnetic fields. The efficiency of\nthe quantum Otto cycle shows a saturation plateau with increasing electric\nfield amplitude.",
    "authors": [
      "Maryam Azimi",
      "Levan Chotorlishvili",
      "Sunil K. Mishra",
      "Temo Vekua",
      "Wolfgang Hübner",
      "Jamal Berakdar"
    ],
    "publication_date": "2014-05-16T13:34:25Z",
    "arxiv_id": "http://arxiv.org/abs/1405.4162v2",
    "download_url": "http://arxiv.org/abs/1405.4162v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Performance comparison of pulse-pair and wavelets methods for the pulse\n  Doppler weather radar spectrum",
    "abstract": "In the civilian aviation field, the radar detection of hazardous weather\nphenomena (winds) is very important. This detection will allow the avoidance of\nthese phenomena and consequently will enhance the safety of flights. In this\nwork, we have used the wavelets method to estimate the mean velocity of winds.\nThe results showed that the application of this method is promising compared\nwith the classical estimators (pulse-pair, Fourier).",
    "authors": [
      "Mohand Lagha",
      "Mohamed Tikhemirine",
      "Said Bergheul",
      "Tahar Rezoug",
      "Maamar Bettayeb"
    ],
    "publication_date": "2012-01-26T08:28:26Z",
    "arxiv_id": "http://arxiv.org/abs/1201.5453v1",
    "download_url": "http://arxiv.org/abs/1201.5453v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "QRMW: Quantum representation of multi wavelength images",
    "abstract": "In this study, we propose quantum representation of multi wavelength images\n(QRMW) which gives preparation and retrieving procedures of quantum images.\nProposed QRMW model represents multi-channel and 2^n x 2^m images. Also, we\npresent image comparison and some image operations based on QRMW model.\nComparing our model with the models in literature, QRMW model has less time\ncomplexity. Also QRMW model uses fewer qubits than existing models in the\nliterature.",
    "authors": [
      "Engin Şahin",
      "İhsan Yilmaz"
    ],
    "publication_date": "2018-01-31T08:41:16Z",
    "arxiv_id": "http://arxiv.org/abs/1801.10349v1",
    "download_url": "http://arxiv.org/abs/1801.10349v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin current and electrical polarization in GaN double-barrier\n  structures",
    "abstract": "Tunnel spin polarization in a piezoelectric AlGaN/GaN double barrier\nstructure is calculated. It is shown that the piezoelectric field and the\nspontaneous electrical polarization increase an efficiency of the tunnel spin\ninjection. The relation between the electrical polarization and the spin\norientation allows engineering a zero magnetic field spin injection\nmanipulating the lattice-mismatch strain with an Al-content in the barriers.",
    "authors": [
      "V. I. Litvinov"
    ],
    "publication_date": "2007-06-21T23:57:17Z",
    "arxiv_id": "http://arxiv.org/abs/0706.3240v1",
    "download_url": "http://arxiv.org/abs/0706.3240v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The unitary theory of the electrical powers",
    "abstract": "General physics approach is applied to analysis of power components in\nelectrical systems under sinusoidal and non-sinusoidal conditions. Physical\nessence of active, reactive and distorting powers are determinate. It is shown\nthat the all three powers are the different aspects of the same physical\nphenomenon: mechanical action per time of Coulomb forces or inertial forces.",
    "authors": [
      "Gheorghe Mihai"
    ],
    "publication_date": "2009-04-07T14:28:44Z",
    "arxiv_id": "http://arxiv.org/abs/0904.1152v1",
    "download_url": "http://arxiv.org/abs/0904.1152v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cointegration of the Daily Electric Power System Load and the Weather",
    "abstract": "The paper makes a thermal predictive analysis of the electric power system\nsecurity for a day ahead. This predictive analysis is set as a thermal\ncomputation of the expected security. This computation is obtained by\ncointegrating the daily electric power systen load and the weather, by finding\nthe daily electric power system thermodynamics and by introducing tests for\nthis thermodynamics. The predictive analysis made shows the electricity\nconsumers' wisdom.",
    "authors": [
      "Stefan Z. Stefanov"
    ],
    "publication_date": "2007-06-08T07:04:24Z",
    "arxiv_id": "http://arxiv.org/abs/0706.1119v2",
    "download_url": "http://arxiv.org/abs/0706.1119v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Theoretical modeling of dendrite growth from conductive wire\n  electropolymerization",
    "abstract": "Electropolymerization is a bottom-up materials engineering process of micro\nand nano-scale that utilizes electrical signals to deposit conducting\ndendrites' morphologies by a redox reaction in the liquid phase. It resembles\nsynaptogenesis in the brain, in which electrical stimulation in the brain\ncauses the formation of synapses from the cellular neural composites. The\nstrategy has been recently explored for neuromorphic engineering by\nestablishing link between the electrical signals and the dendrites' shapes.\nSince the geometry of these structures determines their electrochemical\nproperties, understanding the mechanisms that regulate the polymer assembly\nunder electrically programmed conditions is an important aspect. In this\nmanuscript, we simulate this phenomenon using mesoscale simulations, taking\ninto account the important features of spatial-temporal potential mapping based\non the time-varying signal, the motion of charged particles in the liquid due\nto the electric field, and the attachment of particles on the electrode. The\nstudy helps in visualizing the motion of particles in different electrical\nconditions, which is not possible to probe experimentally. Consistent with the\nexperiments, the higher AC frequency of electrical activities favors linear\nwire-like growth, while lower frequency leads to more dense and fractal\ndendrites growth, and voltage offset leads to asymmetrical growth. We find that\ndendrites' shape and growth process systematically depend on particle\nconcentration and random scattering. We discover that the different dendrites'\narchitectures are associated with different Laplace and diffusion fields, which\ngovern the monomers trajectory and subsequent dendrites' growth. Such\nunconventional engineering routes could have a variety of applications from\nneuromorphic engineering to bottom-up computing strategies.",
    "authors": [
      "Ankush Kumar",
      "Kamila Janzakova",
      "Yannick Coffinier",
      "Sébastien Pecqueur",
      "Fabien Alibart"
    ],
    "publication_date": "2021-07-07T17:35:49Z",
    "arxiv_id": "http://arxiv.org/abs/2107.03372v1",
    "download_url": "http://arxiv.org/abs/2107.03372v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "LLM-Enhanced Feature Engineering for Multi-Factor Electricity Price\n  Predictions",
    "abstract": "Accurately forecasting electricity price volatility is crucial for effective\nrisk management and decision-making. Traditional forecasting models often fall\nshort in capturing the complex, non-linear dynamics of electricity markets,\nparticularly when external factors like weather conditions and market\nvolatility are involved. These limitations hinder their ability to provide\nreliable predictions in markets with high volatility, such as the New South\nWales (NSW) electricity market. To address these challenges, we introduce FAEP,\na Feature-Augmented Electricity Price Prediction framework. FAEP leverages\nLarge Language Models (LLMs) combined with advanced feature engineering to\nenhance prediction accuracy. By incorporating external features such as weather\ndata and price volatility jumps, and utilizing Retrieval-Augmented Generation\n(RAG) for effective feature extraction, FAEP overcomes the shortcomings of\ntraditional approaches. A hybrid XGBoost-LSTM model in FAEP further refines\nthese augmented features, resulting in a more robust prediction framework.\nExperimental results demonstrate that FAEP achieves state-of-art (SOTA)\nperformance compared to other electricity price prediction models in the\nAustralian New South Wale electricity market, showcasing the efficiency of\nLLM-enhanced feature engineering and hybrid machine learning architectures.",
    "authors": [
      "Haochen Xue",
      "Chenghao Liu",
      "Chong Zhang",
      "Yuxuan Chen",
      "Angxiao Zong",
      "Zhaodong Wu",
      "Yulong Li",
      "Jiayi Liu",
      "Kaiyu Liang",
      "Zhixiang Lu",
      "Ruobing Li",
      "Jionglong Su"
    ],
    "publication_date": "2025-05-17T07:56:01Z",
    "arxiv_id": "http://arxiv.org/abs/2505.11890v1",
    "download_url": "http://arxiv.org/abs/2505.11890v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Two-dimensional Inside-out Eaton Lens: Wave Properties and Design",
    "abstract": "Department of Electrical Engineering, Pennsylvania State University,\nUniversity Park, PA 16802",
    "authors": [
      "Yong Zeng",
      "Douglas H. Werner"
    ],
    "publication_date": "2011-05-26T16:30:00Z",
    "arxiv_id": "http://arxiv.org/abs/1105.5340v1",
    "download_url": "http://arxiv.org/abs/1105.5340v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Estimation and Verification of Partially-Observed Discrete-Event Systems",
    "abstract": "This article considers state estimation and veri cation problems for an\nimportant class of man-made cyber-physical systems called Discrete-Event\nSystems (DES).",
    "authors": [
      "Xiang Yin"
    ],
    "publication_date": "2019-03-27T13:25:48Z",
    "arxiv_id": "http://arxiv.org/abs/1903.11413v1",
    "download_url": "http://arxiv.org/abs/1903.11413v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Semiconductor-to-metal transition in bilayer MoSi$_2$N$_4$ and\n  WSi$_2$N$_4$ with strain and electric field",
    "abstract": "With exceptional electrical and mechanical properties and at the same time\nair-stability, layered MoSi2N4 has recently draw great attention. However, band\nstructure engineering via strain and electric field, which is vital for\npractical applications, has not yet been explored. In this work, we show that\nthe biaxial strain and external electric field are effective ways for the band\ngap engineering of bilayer MoSi$_2$N$_4$ and WSi$_2$N$_4$. It is found that\nstrain can lead to indirect band gap to direct band gap transition. On the\nother hand, electric field can result in semiconductor to metal transition. Our\nstudy provides insights into the band structure engineering of bilayer\nMoSi$_2$N$_4$ and WSi$_2$N$_4$ and would pave the way for its future\nnanoelectronics and optoelectronics applications.",
    "authors": [
      "Qingyun Wu",
      "Liemao Cao",
      "Yee Sin Ang",
      "Lay Kee Ang"
    ],
    "publication_date": "2021-01-17T04:58:28Z",
    "arxiv_id": "http://arxiv.org/abs/2101.06591v1",
    "download_url": "http://arxiv.org/abs/2101.06591v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fast spin control in a two-electron double quantum dot by dynamical\n  invariants",
    "abstract": "Inverse engineering of electric fields has been recently proposed to achieve\nfast and robust spin control in a single-electron quantum dot with spin-orbit\ncoupling. In this paper we design, by inverse engineering based on\nLewis-Riesenfeld invariants, time-dependent electric fields to realize fast\ntransitions in the selected singlet-triplet subspace of a two-electron double\nquantum dot. We apply two-mode driving schemes, directly employing the\nLewis-Riesenfeld phases, to minimize the electric field necessary to design\nflexible protocols and perform spin manipulation on the chosen timescale.",
    "authors": [
      "Yue Ban",
      "Xi Chen",
      "J. G. Muga",
      "E. Ya Sherman"
    ],
    "publication_date": "2013-09-07T23:21:07Z",
    "arxiv_id": "http://arxiv.org/abs/1309.1916v1",
    "download_url": "http://arxiv.org/abs/1309.1916v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering of Chern number of topological bands in bilayer graphene by\n  in-plane magnetic field and electrical bias",
    "abstract": "Based on the full Hamiltonian of bilayer graphene, phase transitions are\nrealized by the change of the in-plane magnetic field and the electrical bias\nin bilayer graphene. We show that the engineering of Chern numbers of four\nbands is possible by an applied in-plane magnetic field and an electrical bias\nin bilayer graphene. Our results are promising for the exploration of new\ntopological phenomena in 2D materials.",
    "authors": [
      "Narjes Kheirabadi"
    ],
    "publication_date": "2023-11-01T06:50:40Z",
    "arxiv_id": "http://arxiv.org/abs/2311.00331v2",
    "download_url": "http://arxiv.org/abs/2311.00331v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Support of Study on Engineering Technology from Physics and Mathematics",
    "abstract": "An approach that provides students with an ability to transfer learning in\nphysics and mathematics to the engineering-technology courses through\ne-teaching and e-learning process is proposed. E-modules of courses in\nmathematics, physics, computer systems technology, and electrical and\ntelecommunications engineering technology have been developed. These modules\nbeing used in the Blackboard and Web-based communications systems create a\nvirtual interdisciplinary learning community, which helps the students to\ntransfer knowledge from physics and mathematics to their study in engineering\ntechnology.",
    "authors": [
      "Djafar K. Mynbaev",
      "Candido Cabo",
      "Roman Ya. Kezerashvili",
      "Janet Liou-Mark"
    ],
    "publication_date": "2008-07-12T11:43:38Z",
    "arxiv_id": "http://arxiv.org/abs/0807.1950v1",
    "download_url": "http://arxiv.org/abs/0807.1950v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermal and Electrical Properties of Hybrid Composites with Graphene and\n  Boron Nitride Fillers",
    "abstract": "We report on the thermal and electrical properties of hybrid epoxy composites\nwith graphene and boron nitride fillers. The thicknesses, lateral dimensions,\nand aspect ratios of each filler material were intentionally selected for\ngeometric similarity to one another, in contrast to prior studies that utilized\ndissimilar filler geometries to achieve a \"synergistic\" effect. We demonstrate\nthat the electrically-conductive graphene and electrically-insulating boron\nnitride fillers allow one to effectively engineer the thermal and electrical\nconductivities of their resulting composites. By varying the constituent\nfraction of boron nitride to graphene in a composite with ~44% total filler\nloading, one can tune the thermal conductivity enhancement from a factor of x15\nto x35 and increase the electrical conductivity by many orders of magnitude.\nThe obtained results are important for the development of next-generation\nthermal interface materials with controllable electrical properties necessary\nfor applications requiring either electrical grounding or insulation.",
    "authors": [
      "Jacob S. Lewis",
      "Zahra Barani",
      "Andres Sanchez Magana",
      "Fariborz Kargar",
      "Alexander A. Balandin"
    ],
    "publication_date": "2019-03-04T00:38:59Z",
    "arxiv_id": "http://arxiv.org/abs/1903.01025v1",
    "download_url": "http://arxiv.org/abs/1903.01025v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Perceived Advantage in Perspective Application of Integrated Choice and\n  Latent Variable Model to Capture Electric Vehicles Perceived Advantage from\n  Consumers Perspective",
    "abstract": "Relative advantage, or the degree to which a new technology is perceived to\nbe better over the existing technology it supersedes, has a significant impact\non individuals decision of adopting to the new technology. This paper\ninvestigates the impact of electric vehicles perceived advantage over the\nconventional internal combustion engine vehicles, from consumers perspective,\non their decision to select electric vehicles. Data is obtained from a stated\npreference survey from 1176 residents in New South Wales, Australia. The\ncollected data is used to estimate an integrated choice and latent variable\nmodel of electric vehicle choice, which incorporates the perceived advantage of\nelectric vehicles in the form of latent variables in the utility function. The\ndesign of the electric vehicle, impact on the environment, and safety are three\nidentified advantages from consumers point of view. The model is used to\nsimulate the effectiveness of various policies to promote electric vehicles on\ndifferent cohorts. Rebate on the purchase price is found to be the most\neffective strategy to promote electric vehicles adoption.",
    "authors": [
      "Milad Ghasri",
      "Ali Ardeshiri",
      "Taha Rashidi"
    ],
    "publication_date": "2019-05-28T04:41:42Z",
    "arxiv_id": "http://arxiv.org/abs/1905.11606v2",
    "download_url": "http://arxiv.org/abs/1905.11606v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Guiding and confining of light in a two-dimensional synthetic space\n  using electric fields",
    "abstract": "Synthetic dimensions provide a promising platform for photonic quantum\nsimulations. Manipulating the flow of photons in these dimensions requires an\nelectric field. However, photons do not have charge and do not directly\ninteract with electric fields. Therefore, alternative approaches are needed to\nrealize electric fields in photonics. One approach is to use engineered gauge\nfields that can mimic the effect of electric fields and produce the same\ndynamical behavior. Here, we demonstrate such an electric field for photons\npropagating in a two-dimensional synthetic space. We achieve this using a\nlinearly time-varying gauge field generated by direction-dependent phase\nmodulations. We show that the generated electric field leads to Bloch\noscillations and the revival of the state after a certain number of steps\ndependent on the field strength. We measure the probability of the revival and\ndemonstrate good agreement between the observed values and the theoretically\npredicted results. Furthermore, by applying a nonuniform electric field, we\nshow the possibility of waveguiding photons. Ultimately, our results open up\nnew opportunities for manipulating the propagation of photons with potential\napplications in photonic quantum simulations.",
    "authors": [
      "Hamidreza Chalabi",
      "Sabyasachi Barik",
      "Sunil Mittal",
      "Thomas E. Murphy",
      "Mohammad Hafezi",
      "Edo Waks"
    ],
    "publication_date": "2019-11-24T02:22:52Z",
    "arxiv_id": "http://arxiv.org/abs/1911.10446v2",
    "download_url": "http://arxiv.org/abs/1911.10446v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strain-engineered inverse charge-funnelling in layered semiconductors",
    "abstract": "The control of charges in a circuit due to an external electric field is\nubiquitous to the exchange, storage and manipulation of information in a wide\nrange of applications, from electronic circuits to synapses in neural cells.\nConversely, the ability to grow clean interfaces between materials has been a\nstepping stone for engineering built-in electric fields largely exploited in\nmodern photovoltaics and opto-electronics. The emergence of atomically thin\nsemiconductors is now enabling new ways to attain electric fields and unveil\nnovel charge transport mechanisms. Here, we report the first direct electrical\nobservation of the inverse charge-funnel effect enabled by deterministic and\nspatially resolved strain-induced electric fields in a thin sheet of HfS2. We\ndemonstrate that charges driven by these spatially varying electric fields in\nthe channel of a phototransistor lead to a 350% enhancement in the\nresponsivity. These findings could enable the informed design of highly\nefficient photovoltaic cells.",
    "authors": [
      "Adolfo De Sanctis",
      "Iddo Amit",
      "Steven P. Hepplestone",
      "Monica F. Craciun",
      "Saverio Russo"
    ],
    "publication_date": "2018-01-29T10:27:01Z",
    "arxiv_id": "http://arxiv.org/abs/1801.09434v1",
    "download_url": "http://arxiv.org/abs/1801.09434v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strain and electric-field control of spin-spin interactions in monolayer\n  CrI$_3$",
    "abstract": "We investigate the impact of mechanical strains and a perpendicular electric\nfield on the electronic and magnetic ground-state properties of two-dimensional\nmonolayer CrI$_3$ using density functional theory. We propose a minimal spin\nmodel Hamiltonian, consisting of symmetric isotropic exchange interactions,\nmagnetic anisotropy energy, and Dzyaloshinskii-Moriya (DM) interactions, to\ncapture most pertinent magnetic properties of the system. We compute the\nmechanical strain and electric field dependence of various spin-spin\ninteractions. Our results show that both the amplitudes and signs of the\nexchange interactions can be engineered by means of strain, while the electric\nfield affects only their amplitudes. However, strain and electric fields affect\nboth the directions and amplitudes of the DM vectors. The amplitude of the\nmagnetic anisotropy energy can also be substantially modified by an applied\nstrain. We show that in comparison with an electric field, strain can be more\nefficiently used to manipulate the magnetic and electronic properties of the\nsystem. Notably, such systematic tuning of the spin interactions is essential\nfor the engineering of room-temperature spintronic nanodevices.",
    "authors": [
      "Sahar Izadi Vishkayi",
      "Zahra Torbatian",
      "Alireza Qaiumzadeh",
      "Reza Asgari"
    ],
    "publication_date": "2020-05-21T08:50:58Z",
    "arxiv_id": "http://arxiv.org/abs/2005.10520v1",
    "download_url": "http://arxiv.org/abs/2005.10520v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Luminescent solar power: PV/thermal hybrid electricity generation for\n  cost effective dispatchable solar energy",
    "abstract": "The challenge in solar energy today is not the cost of photovoltaic (PV)\nelectricity generation, already competing with fossil fuel prices, but rather\nutility-scale energy storage and flexibility in supply. Low-cost thermal energy\nstorage (TES) exists but relies on expensive heat engines. Here, we introduce\nthe concept of luminescent solar power (LSP), where sunlight is absorbed in a\nphotoluminescent (PL) absorber, followed by red-shifted PL emission matched to\nan adjacent PV cell's band-edge. This way the PV cell operates nearly as\nefficiently as under direct illumination, but with minimal excessive heat. The\nPL-absorber temperature rises due to thermalization, allowing it to store the\nexcessive heat, which can later be converted into electricity. Tailored\nluminescent materials that support an additional 1.5kWh PV-electricity for\nevery 1 kWh of (virtual) heat engine-electricity, with a dynamic shift between\nthe two sources are experimentally demonstrated. Such an ideal hybrid system\nmay lead to a potential reduction in the cost of electricity for a base-load\nsolution.",
    "authors": [
      "Shimry Haviv",
      "Natali Revivo",
      "Nimrod Kruger",
      "Assaf Manor",
      "Bagrat Khachatryan",
      "Michael Shustov",
      "Carmel Rotschild"
    ],
    "publication_date": "2020-12-13T12:13:20Z",
    "arxiv_id": "http://arxiv.org/abs/2012.08314v1",
    "download_url": "http://arxiv.org/abs/2012.08314v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysis and Modeling of the Hybrid Vessel's Electrical Power System",
    "abstract": "With the maritime industry poised on the cusp of a hybrid revolution, the\ndesign and analysis of advanced vessel systems have become paramount for\nengineers. This paper presents AC and DC electrical hybrid power system models\nin ETAP, the simulation software that can be adapted to engineer future hybrid\nvessels. These models are also a step towards a digital twin model that can\nhelp in troubleshooting and preventing issues, reducing risk and engineering\ntime. The testing of the models is focused on time domain analysis,\nshort-circuit currents, and protection \\& coordination. The models are based on\nactual vessels and manufacturer parameters are used where available.",
    "authors": [
      "Matthijs Mosselaar",
      "Zoran Malbašić",
      "Aihui Fu",
      "Aleksandra Lekić"
    ],
    "publication_date": "2024-09-30T06:39:33Z",
    "arxiv_id": "http://arxiv.org/abs/2409.19996v1",
    "download_url": "http://arxiv.org/abs/2409.19996v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "AB Levitator and Electricity Storage",
    "abstract": "The author researched this new idea - support of flight by any aerial\nvehicles at significant altitude solely by the magnetic field of the planet. It\nis shown that current technology allows humans to create a light propulsion (AB\nengine) which does not depend on air, water or ground terrain. Simultaniosly,\nthis revolutionary thruster is a device for the storage of electricity which is\nextracted and is replenished (during braking) from/into the storage with 100\npercent efficiency. The relative weight ratio of this engine is 0.01 - 0.1\n(from thrust). For some types of AB engine (toroidal form) the thrust easily\nmay be changed in any direction without turning of engine.\n  The author computed many projects using different versions of offered AB\nengine: small device for levitation-flight of a human (including flight from\nEarth to Outer Space), fly VTOL car (track), big VTOL aircrat, suspended low\naltitude stationary satellite, powerful Space Shuttle-like booster for travel\nto the Moon and Mars without spending energy (spended energy is replenished in\nbraking when ship returns from other planet to its point of origin), using\nAB-devices in military, in sea-going ships (submarimes), in energy industry\n(for example. as small storage of electric energy) and so on. The vehicles\nequipped with AB propulsion can take flight for days and cover distances of\ntens thousands of kilometers at hypersonic or extra-atmosphere space speeds.\n  The work contains tens of inventions and innovations which solves problems\nand breaks limitations which appear in solution of these very complex\nrevolutionary ideas.\n  Key word: AB levitator, levitation, non-rocket outer space flight, electric\nenergy storage, AB propulsion, AB engine, Bolonkin.",
    "authors": [
      "Alexander Bolonkin"
    ],
    "publication_date": "2007-03-01T18:31:34Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0703013v1",
    "download_url": "http://arxiv.org/abs/physics/0703013v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Fast Tree Algorithm for Electric Field Calculation in Electrical\n  Discharge Simulations",
    "abstract": "The simulation of electrical discharges has been attracting a great deal of\nattention. In such simulations, the electric field computation dominates the\ncomputational time. In this paper, we propose a fast tree algorithm that helps\nto reduce the time complexity from $O(N^2)$ (from using direct summation) to\n$O(N\\log N)$. The implementation details are discussed and the time complexity\nis analyzed. A rigorous error estimation shows the error of the tree algorithm\ndecays exponentially with the number of truncation terms and can be controlled\nadaptively. Numerical examples are presented to validate the accuracy and\nefficiency of the algorithm.",
    "authors": [
      "Chijie Zhuang",
      "Yong Zhang",
      "Xin Zhou",
      "Rong Zeng",
      "Jinliang He",
      "Lei Liu"
    ],
    "publication_date": "2017-10-16T15:24:12Z",
    "arxiv_id": "http://arxiv.org/abs/1710.05781v1",
    "download_url": "http://arxiv.org/abs/1710.05781v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Recent Progress in Optimization of Multiband Electrical Filters",
    "abstract": "The best uniform rational approximation of the \\emph{sign} function on two\nintervals was explicitly found by Russian mathematician E.I. Zolotar\\\"ev in\n1877. The progress in math eventually led to the progress in technology: half a\ncentury later German electrical engineer and physicist W.Cauer has invented\nlow- and high-pass electrical filters known today as elliptic or\nCauer-Zolotar\\\"ev filters and possessing the unbeatable quality. We discuss a\nrecently developed approach for the solution of optimization problem naturally\narising in the synthesis of multi-band (analogue, digital or microwave)\nelectrical filters. The approach is based on techniques from algebraic geometry\nand generalizes the effective representation of Zolotar\\\"ev fraction.",
    "authors": [
      "Andrei Bogatyrëv"
    ],
    "publication_date": "2018-06-13T13:18:09Z",
    "arxiv_id": "http://arxiv.org/abs/1806.05020v1",
    "download_url": "http://arxiv.org/abs/1806.05020v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electricity consumption forecasting method based on MPSO-BP neural\n  network model",
    "abstract": "This paper deals with the problem of the electricity consumption forecasting\nmethod. An MPSO-BP (modified particle swarm optimization-back propagation)\nneural network model is constructed based on the history data of a mineral\ncompany of Anshan in China. The simulation showed that the convergence of the\nalgorithm and forecasting accuracy using the obtained model are better than\nthose of other traditional ones, such as BP, PSO, fuzzy neural network and so\non. Then we predict the electricity consumption of each month in 2017 based on\nthe MPSO-BP neural network model.",
    "authors": [
      "Youshan Zhang",
      "Liangdong Guo",
      "Qi Li",
      "Junhui Li"
    ],
    "publication_date": "2018-10-21T03:16:22Z",
    "arxiv_id": "http://arxiv.org/abs/1810.08886v1",
    "download_url": "http://arxiv.org/abs/1810.08886v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum body in uniform electric fields",
    "abstract": "The advent in this century of nano and microelectronics requires, by part of\nphysicists and engineers, the need of an explanation of electrical phenomena\nsuch as the interaction of a body with external electric fields at its atomic\nlevel,i.e. where is the case of the appearance of the quantum nature of\nphenomena involved in the projecting of nano an micro devices. It is mainly\nfocused in this article the problem of calculating eigenstates of quantum\nmatter interacting with a uniform external electric field, whose solution is\nreported via a DFT(Density Functional Theory) variational approach[3,4].",
    "authors": [
      "S. Selenu"
    ],
    "publication_date": "2020-11-23T16:20:36Z",
    "arxiv_id": "http://arxiv.org/abs/2011.11511v1",
    "download_url": "http://arxiv.org/abs/2011.11511v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonreciprocal electromagnetic wave manipulation via a single reflection",
    "abstract": "Electric field manipulation plays a key role in applications such as electron\nacceleration, nonlinear light-matter interaction, and radiation engineering.\nNonreciprocal materials, such as Weyl semimetals, enable the manipulation of\nthe electric field in a full photonic manner, owing to their intrinsic\ntime-reversal symmetry breaking, leading to asymmetric material response for\nphotons with +k and -k momenta. Here, the results suggest that a simple planar\ninterface between semi-infinite air and a nonreciprocal material can achieve\nspatio-temporal manipulation of the electric field. In particular, this work\npresents three compelling scenarios for electromagnetic wave manipulation:\nradiation pattern redistribution (with closed-form expressions provided),\ncarrier-envelope phase control, and spatial profile control. The presented\nresults pave the way for electric field manipulation using pattern-free\nnonreciprocal materials.",
    "authors": [
      "Lu Wang"
    ],
    "publication_date": "2023-06-29T09:43:00Z",
    "arxiv_id": "http://arxiv.org/abs/2306.16807v1",
    "download_url": "http://arxiv.org/abs/2306.16807v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Yaw Stability Control System Development and Implementation for a Fully\n  Electric Vehicle",
    "abstract": "There is growing interest in fully electric vehicles in the automotive\nindustry as it becomes increasingly more difficult to meet new and upcoming\nemission regulations based on internal combustion engines. Fully electric\nvehicles do not have an internal combustion engine. Hence, drive torque change\nfor a traction control system and for a yaw stability control system has to be\nthrough the electric motor used for traction. The regenerative braking\ncapability of fully electric vehicles has to be taken into account in designing\nbraking controllers like ABS and yaw stability control through differential\nbraking. Fully electric vehicles are usually lighter vehicles with different\ndynamic characteristics than that of their predecessors using internal\ncombustion engines. As such, their yaw stability control systems have to be\nre-designed and tested. This paper reports the initial results of ongoing work\non yaw stability controller design for a fully electric vehicle. Two different\nimplementations on a research prototype fully electric light commercial vehicle\nare considered. The first implementation uses the production yaw stability\ncontrol system in the internal combustion engine powered conventional vehicle.\nThe drive torque change commands from the production ECU are read, modified and\nsent to the electric motor driver in trying to mimic the conventional vehicle.\nThe differential braking commands are the same as in the conventional vehicle.\nIn the second implementation, a generic yaw stability control system that\ncalculates and issues its own drive torque change commands and differential\nbraking commands is designed and implemented. Offline simulations on a\nvalidated model and a hardware-in-the-loop simulation system are used in\ndesigning the yaw stability control system.",
    "authors": [
      "Kerim Kahraman",
      "Mutlu Senturk",
      "Mumin Tolga Emirler",
      "Ismail Meric Can Uygan",
      "Bilin Aksun-Guvenc",
      "Levent Guvenc",
      "Baris Efendioglu"
    ],
    "publication_date": "2020-12-08T20:14:29Z",
    "arxiv_id": "http://arxiv.org/abs/2012.04719v2",
    "download_url": "http://arxiv.org/abs/2012.04719v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electronics and photonics: two sciences in the benefit of solar energy\n  conversion",
    "abstract": "This paper gives a personal global point of view on two sciences: electronics\nand photonics towards plasmonics and solar energy conversion. The new research\ndirections in these two sciences are pointed out by comparison and in the\nperspective of future new solar devices. A parallel and the equivalence between\nelectronics and photonics are presented. Starting from electron in electronics,\nphoton, solitons and plasmons in photonics, electrical cables - optical fibers,\nplasmonic wave guides, electrical circuits - optical circuits, electrical\ntransistors - optical transistors, plasmonster, electrical generators - pulsed\nlasers and spasers, photonics gets step by step all the tools already existing\nin electronics. Solar energy could be converted in many ways, the most known is\nthe conversion in electricity. Today we need that the energy is in form of\nelectricity because most of the apparatus that we use are based on electricity:\ninformatics, motors, etc. However, the progress in photonics with optical\ncircuits, optical transistors etc., shows that the photonics informatics could\nbe possible. Also the optical manipulation and optical engines concept were\nalready demonstrated experimentally. If the laser propulsion will be achieved,\nand the optical engines will work, the question that will rise tomorrow is:\n\"Shall we still use the electricity in the future? What will be the solar\ndevices tomorrow?\"",
    "authors": [
      "M. Girtan"
    ],
    "publication_date": "2012-09-14T22:21:38Z",
    "arxiv_id": "http://arxiv.org/abs/1209.3337v1",
    "download_url": "http://arxiv.org/abs/1209.3337v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Derivation of Chaotic Dynamics from Montgomery Conjecture and Its\n  Interpretation as an Electrical System",
    "abstract": "In this paper, we present an innovative derivation of chaotic dynamics rooted\nin the Montgomery conjecture, specifically addressing the pair correlation of\nRiemann zeta function zeros. Our exploration unveils a recursive relation\ninspired by the conjecture, manifesting chaotic behavior. Remarkably, we\ninterpret this derived chaotic dynamics as a unique representation of an\nelectrical system, providing a novel perspective within the domain of\nelectrical engineering. Beyond this groundbreaking derivation, our study delves\ninto the potential applications of chaos theory, bifurcation analysis, and\nentropy within the framework of this electrical system. We scrutinize the\nimplications of chaos for signal processing, conduct stability analysis through\nbifurcation studies, and investigate the role of entropy in quantifying the\nrandomness or predictability of electrical signals. Additionally, we explore\nenergy distribution aspects within the electrical system, shedding light on how\nchaotic dynamics influence energy dissipation and allocation. In the course of\nour research, a new finding emerged, contributing to our understanding of the\nderived chaotic dynamics. This discovery enhances the applicability of our\nframework within electrical engineering, paving the way for innovative\napplications and deeper explorations in the realm of system dynamics. Moreover,\nwe draw comparisons with the dynamics presented in our recent paper published\nin the European Physical Journal, specifically addressing Yitang Zhang's\ncontributions. This comparative analysis further underscores the unique\ncharacteristics and potential applications of the derived chaotic dynamics.\nThis study not only elucidates the intricate connection between chaotic\ndynamics and number theory but also offers a transformative perspective that\nextends the boundaries of conventional electrical system analysis",
    "authors": [
      "Zeraoulia Rafik"
    ],
    "publication_date": "2024-03-16T01:11:07Z",
    "arxiv_id": "http://arxiv.org/abs/2406.12863v1",
    "download_url": "http://arxiv.org/abs/2406.12863v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]