[
  {
    "title": "Non-Volatile Magnonic Logic Circuits Engineering",
    "abstract": "We propose a concept of magnetic logic circuits engineering, which takes an\nadvantage of magnetization as a computational state variable and exploits spin\nwaves for information transmission. The circuits consist of magneto-electric\ncells connected via spin wave buses. We present the result of numerical\nmodeling showing the magneto-electric cell switching as a function of the\namplitude as well as the phase of the spin wave. The phase-dependent switching\nmakes it possible to engineer logic gates by exploiting spin wave buses as\npassive logic elements providing a certain phase-shift to the propagating spin\nwaves. We present a library of logic gates consisting of magneto-electric cells\nand spin wave buses providing 0 or p phase shifts. The utilization of phases in\naddition to amplitudes is a powerful tool which let us construct logic circuits\nwith a fewer number of elements than required for CMOS technology. As an\nexample, we present the design of the magnonic Full Adder Circuit comprising\nonly 5 magneto-electric cells. The proposed concept may provide a route to more\nfunctional wave-based logic circuitry with capabilities far beyond the limits\nof the traditional transistor-based approach.",
    "authors": [
      "Alexander Khitun",
      "Kang L. Wang"
    ],
    "publication_date": "2010-12-21T19:17:55Z",
    "arxiv_id": "http://arxiv.org/abs/1012.4768v1",
    "download_url": "http://arxiv.org/abs/1012.4768v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lorentz Force Electrical Impedance Tomography",
    "abstract": "This article describes a method called Lorentz Force Electrical Impedance\nTomography. The electrical conductivity of biological tissues can be measured\nthrough their sonication in a magnetic field: the vibration of the tissues\ninside the field induces an electrical current by Lorentz force. This current,\ndetected by electrodes placed around the sample, is proportional to the\nultrasonic pressure, to the strength of the magnetic field and to the\nelectrical conductivity gradient along the acoustic axis. By focusing at\ndifferent places inside the sample, a map of the electrical conductivity\ngradient can be established. In this study experiments were conducted on a\ngelatin phantom and on a beef sample, successively placed in a 300 mT magnetic\nfield and sonicated with an ultrasonic transducer focused at 21 cm emitting 500\nkHz bursts. Although all interfaces are not visible, in this exploratory study\na good correlation is observed between the electrical conductivity image and\nthe ultrasonic image. This method offers an alternative to detecting\npathologies invisible to standard ultrasonography.",
    "authors": [
      "Pol Grasland-Mongrain",
      "Jean-Martial Mari",
      "Jean-Yves Chapelon",
      "Cyril Lafon"
    ],
    "publication_date": "2014-02-11T17:44:28Z",
    "arxiv_id": "http://arxiv.org/abs/1402.2573v1",
    "download_url": "http://arxiv.org/abs/1402.2573v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Imaging electric field dynamics with graphene optoelectronics",
    "abstract": "The use of electric fields for signalling and control in liquids is\nwidespread, spanning bioelectric activity in cells to electrical manipulation\nof microstructures in lab-on-a-chip devices. However, an appropriate tool to\nresolve the spatio-temporal distribution of electric fields over a large\ndynamic range has yet to be developed. Here we present a label-free method to\nimage local electric fields in real time and under ambient conditions. Our\ntechnique combines the unique gate-variable optical transitions of graphene\nwith a critically coupled planar waveguide platform that enables highly\nsensitive detection of local electric fields with a voltage sensitivity of a\nfew microvolts, a spatial resolution of tens of micrometres and a frequency\nresponse over tens of kilohertz. Our imaging platform enables parallel\ndetection of electric fields over a large field of view and can be tailored to\nbroad applications spanning lab-on-a-chip device engineering to analysis of\nbioelectric phenomena.",
    "authors": [
      "Jason Horng",
      "Halleh B. Balch",
      "Allister F. McGuire",
      "Hsin-Zon Tsai",
      "Patrick R. Forrester",
      "Michael F. Crommie",
      "Bianxiao Cui",
      "Feng Wang"
    ],
    "publication_date": "2019-11-20T17:36:06Z",
    "arxiv_id": "http://arxiv.org/abs/1911.09055v1",
    "download_url": "http://arxiv.org/abs/1911.09055v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electric field control for experiments with atoms in Rydberg states",
    "abstract": "Atoms excited to Rydberg states have recently emerged as a valuable resource\nin neutral atom platforms for quantum computation, quantum simulation, and\nquantum information processing. Atoms in Rydberg states have large\npolarizabilities, making them highly sensitive to electric fields. Therefore,\nstray electric fields can decohere these atoms, in addition to compromising the\nfidelity of engineered interactions between them. It is therefore essential to\ncancel these stray electric fields. Here we present a novel, simple, and\nhighly-compact electrode assembly, implemented in a glass cell-based vacuum\nchamber design, for stray electric field cancellation. The electrode assembly\nallows for full 3D control of the electric field in the vicinity of the atoms\nwhile blocking almost no optical access. We experimentally demonstrate the\ncancellation of stray electric fields to better than 10 mV/cm using this\nelectrode assembly.",
    "authors": [
      "Aishik Panja",
      "Yupeng Wang",
      "Xinghan Wang",
      "Junjie Wang",
      "Sarthak Subhankar",
      "Qi-Yu Liang"
    ],
    "publication_date": "2024-09-18T10:38:00Z",
    "arxiv_id": "http://arxiv.org/abs/2409.11865v1",
    "download_url": "http://arxiv.org/abs/2409.11865v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficiency at maximum power of thermally coupled heat engines",
    "abstract": "We study the efficiency at maximum power of two coupled heat engines, using\nthermoelectric generators (TEGs) as engines. Assuming that the heat and\nelectric charge fluxes in the TEGs are strongly coupled, we simulate\nnumerically the dependence of the behavior of the global system on the\nelectrical load resistance of each generator in order to obtain the working\ncondition that permits maximization of the output power. It turns out that this\ncondition is not unique. We derive a simple analytic expression giving the\nrelation between the electrical load resistance of each generator permitting\noutput power maximization. We then focuse on the efficiency at maximum power\n(EMP) of the whole system to demonstrate that the Curzon-Ahlborn efficiency may\nnot always be recovered: the EMP varies with the specific working conditions of\neach generator but remains in the range predicted by irreversible\nthermodynamics theory. We finally discuss our results in light of non-ideal\nCarnot engine behavior.",
    "authors": [
      "Y. Apertet",
      "H. Ouerdane",
      "C. Goupil",
      "Ph. Lecoeur"
    ],
    "publication_date": "2012-03-01T12:12:29Z",
    "arxiv_id": "http://arxiv.org/abs/1203.0165v1",
    "download_url": "http://arxiv.org/abs/1203.0165v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interface Engineering in La0.67Sr0.33MnO3-SrTiO3 Heterostructures",
    "abstract": "Interface engineering is an extremely useful tool for systematically\ninvestigating materials and the various ways materials interact with each\nother. We describe different interface engineering strategies designed to\nreveal the origin of the electric and magnetic dead-layer at La0.67Sr0.33MnO3\ninterfaces. La0.67Sr0.33MnO3 is a key example of a strongly correlated\nperoskite oxide material in which a subtle balance of competing interactions\ngives rise to a ferromagnetic metallic groundstate. This balance, however, is\neasily disrupted at interfaces. We systematically vary the dopant profile, the\ndisorder and the oxygen octahedra rotations at the interface to investigate\nwhich mechanism is responsible for the dead layer. We find that the magnetic\ndead layer can be completely eliminated by compositional interface engineering\nsuch that the polar discontinuity at the interface is removed. This, however,\nleaves the electrical dead-layer largely intact. We find that deformations in\nthe oxygen octahedra network at the interface are the dominant cause for the\nelectrical dead layer.",
    "authors": [
      "Hans Boschker",
      "Zhaoliang Liao",
      "Mark Huijben",
      "Gertjan Koster",
      "Guus Rijnders"
    ],
    "publication_date": "2016-09-16T10:03:37Z",
    "arxiv_id": "http://arxiv.org/abs/1609.04976v1",
    "download_url": "http://arxiv.org/abs/1609.04976v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Open-source software for electrical engineering applications requiring\n  consideration of electrodynamics: elecode",
    "abstract": "The work presents elecode, open-source software for various electrical\nengineering applications that require considering electromagnetic processes.\nThe primary focus of the software is power engineering applications. However,\nthe software does not impose any specific limitations preventing other uses. In\ncontrast to other open-source software based on the Finite Difference Time\nDomain (FDTD) method, elecode implements various thin wire modeling techniques\nwhich allow simulating complex objects consisting of wires. In addition,\nimplemented graphical user interface (GUI) helps modify models conveniently.\nThe software provides auxiliary numerical methods for simulations and\nmeasurements of the electrical soil properties, allows conducting\nlightning-related simulations (including those involving isolation breakdown\nmodels), and calculations of grounding characteristics. The part of the code\nresponsible for FDTD simulations is well tested in previous works. Recently,\nthe code was rewritten in order to add a convenient interface for using it as a\nlibrary, command-line program, or GUI program. Finally, the code was released\nunder an open-source license. The main capabilities of the software are\ndescribed in the work. Several simulation examples covering main software\nfeatures are presented. elecode is available at\nhttps://gitlab.com/dmika/elecode.",
    "authors": [
      "Dmitry Kuklin"
    ],
    "publication_date": "2022-07-10T14:30:46Z",
    "arxiv_id": "http://arxiv.org/abs/2207.06908v2",
    "download_url": "http://arxiv.org/abs/2207.06908v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Research and innovative design of a zeroemissions vehicle by\n  multidisciplinary student teams in multi-years",
    "abstract": "This paper presents a unique learning and research experience for students\nfrom mechanical and electrical engineering majors in a course on senior design\nprojects involving research and development, design and production of a\nproof-of-concept electric vehicle, the ZEM (Zero EMissions) vehicle. The ZEM\nvehicle combined positive aspects and latest technologies in electric vehicle\ndesign,solar-electric power conversions, and ergonomic human power into one\naffordable and environmentally sustainable vehicle for urban transportation.\nThe 43 mechanical and 10 electrical engineering majors plus 7 students from\nbusiness participated in this multidisciplinary project spanned over two\nacademic years. The students involved in this multiyear endeavor gained\nvaluable experiences in real-world working environment with multifunctional and\nmulti-year sub-groups. The success of this new attempt in conducting senior\ndesign projects classes have set a model for faculty members in the authors'\nuniversity in conducting similar courses.",
    "authors": [
      "Raymond K. Yee",
      "Tai-Ran Hsu",
      "Thuy T. Le"
    ],
    "publication_date": "2013-11-23T17:39:31Z",
    "arxiv_id": "http://arxiv.org/abs/1311.6026v1",
    "download_url": "http://arxiv.org/abs/1311.6026v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Challenge of Non-Technical Loss Detection using Artificial\n  Intelligence: A Survey",
    "abstract": "Detection of non-technical losses (NTL) which include electricity theft,\nfaulty meters or billing errors has attracted increasing attention from\nresearchers in electrical engineering and computer science. NTLs cause\nsignificant harm to the economy, as in some countries they may range up to 40%\nof the total electricity distributed. The predominant research direction is\nemploying artificial intelligence to predict whether a customer causes NTL.\nThis paper first provides an overview of how NTLs are defined and their impact\non economies, which include loss of revenue and profit of electricity providers\nand decrease of the stability and reliability of electrical power grids. It\nthen surveys the state-of-the-art research efforts in a up-to-date and\ncomprehensive review of algorithms, features and data sets used. It finally\nidentifies the key scientific and engineering challenges in NTL detection and\nsuggests how they could be addressed in the future.",
    "authors": [
      "Patrick Glauner",
      "Jorge Augusto Meira",
      "Petko Valtchev",
      "Radu State",
      "Franck Bettinger"
    ],
    "publication_date": "2016-06-02T11:14:47Z",
    "arxiv_id": "http://arxiv.org/abs/1606.00626v3",
    "download_url": "http://arxiv.org/abs/1606.00626v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling of Electrical Resistivity of Soil Based on Geotechnical\n  Properties",
    "abstract": "Determining the relationship between the electrical resistivity of soil and\nits geotechnical properties is an important engineering problem. This study\naims to develop methodology for finding the best model that can be used to\npredict the electrical resistivity of soil, based on knowing its geotechnical\nproperties. The research develops several linear models, three non-linear\nmodels, and three artificial neural network models (ANN). These models are\napplied to the experimental data set comprises 864 observations and five\nvariables. The results show that there are significant exponential negative\nrelationships between the electrical resistivity of soil and its geotechnical\nproperties. The most accurate prediction values are obtained using the ANN\nmodel. The cross-validation analysis confirms the high precision of the\nselected predictive model. This research is the first rigorous systematic\nanalysis and comparison of difference methodologies in ground electrical\nresistivity studies. It provides practical guidelines and examples of design,\ndevelopment and testing non-linear relationships in engineering intelligent\nsystems and applications.",
    "authors": [
      "Bandar Alsharari",
      "Andriy Olenko",
      "Hossam Abuel-Naga"
    ],
    "publication_date": "2019-10-03T07:03:17Z",
    "arxiv_id": "http://arxiv.org/abs/1910.01325v1",
    "download_url": "http://arxiv.org/abs/1910.01325v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cooperative optical wavefront engineering with atomic arrays",
    "abstract": "Natural materials typically interact weakly with the magnetic component of\nlight which greatly limits their applications. This has led to the development\nof artificial metamaterials and metasurfaces. However, natural atoms, where\nonly electric dipole transitions are relevant at optical frequencies, can\ncooperatively respond to light to form collective excitations with strong\nmagnetic, as well as electric, interactions, together with corresponding\nelectric and magnetic mirror reflection properties. By combining the electric\nand magnetic collective degrees of freedom we show that ultrathin planar arrays\nof atoms can be utilized as atomic lenses to focus light to subwavelength spots\nat the diffraction limit, to steer light at different angles allowing for\noptical sorting, and as converters between different angular momentum states.\nThe method is based on coherently superposing induced electric and magnetic\ndipoles to engineer a quantum nanophotonic Huygens' surface of atoms, giving\nfull $2\\pi$ phase control over the transmission, with close to zero reflection.",
    "authors": [
      "Kyle E. Ballantine",
      "Janne Ruostekoski"
    ],
    "publication_date": "2021-12-22T13:22:51Z",
    "arxiv_id": "http://arxiv.org/abs/2112.11866v1",
    "download_url": "http://arxiv.org/abs/2112.11866v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Decarbonizing Indian Electricity Grid",
    "abstract": "India, being one of the fastest growing economies of the world, must take a\nsustainable path for development. India is responsible for 7 percent of global\nCO2 emissions. The electricity sector accounts for nearly 35 percent of\nemissions from the country. The switch from fossil fuels to renewable sources\nis the key in decarbonizing this sector and is considered as the crucial step\nfor climate mitigation. This research investigates the potential of renewable\nenergy sources; wind, solar and hydro. The optimization model developed in this\nstudy analyzes various scenarios for the transition to a sustainable future.\nThe results show that India aims to achieve 450 GW of installed capacity from\nRES is far from a Net Zero future. Results confirm that India has the potential\nto meet 100 percent of electricity demand in 2030 from RES including wind,\nsolar and hydro. Introducing Social Cost of Carbon is a viable option to reduce\nemissions in India. However, due to the low cost of coal, high coal taxes do\nnot lead to reduced emissions.",
    "authors": [
      "Parvathy Sobha"
    ],
    "publication_date": "2022-11-07T16:51:50Z",
    "arxiv_id": "http://arxiv.org/abs/2211.05934v1",
    "download_url": "http://arxiv.org/abs/2211.05934v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Explainable Dual-Attention Tabular Transformer for Soil Electrical\n  Resistivity Prediction: A Decision Support Framework for High-Voltage\n  Substation Construction",
    "abstract": "This research introduces a novel dual-attention transformer architecture for\npredicting soil electrical resistivity, a critical parameter for high-voltage\nsubstation construction. Our model employs attention mechanisms operating\nacross both features and data batches, enhanced by feature embedding layers\nthat project inputs into higher-dimensional spaces. We implements Particle\nSwarm Optimization for hyperparameter tuning, systematically optimizing\nembedding dimensions, attention heads, and neural network architecture. The\nproposed architecture achieves superior predictive performance (Mean Absolute\nPercentage Error: 0.63%) compared to recent state of the art models for tabular\ndata. Crucially, our model maintains explainability through SHapley Additive\nexPlanations value analysis, revealing that fine particle content and dry\ndensity are the most influential parameters affecting soil resistivity. We\ndevelopes a web-based application implementing this model to provide engineers\nwith an accessible decision support framework that bridges geotechnical and\nelectrical engineering requirements for the Electricity Generating Authority of\nThailand. This integrated approach satisfies both structural stability and\nelectrical safety standards, improving construction efficiency and safety\ncompliance in high-voltage infrastructure implementation.",
    "authors": [
      "Warat Kongkitkul",
      "Sompote Youwai",
      "Warut Sakulpojworachai"
    ],
    "publication_date": "2025-03-17T04:30:32Z",
    "arxiv_id": "http://arxiv.org/abs/2504.02834v1",
    "download_url": "http://arxiv.org/abs/2504.02834v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-Fidelity Model of Stand-Alone Diesel Electric Generator with Hybrid\n  Turbine-Governor Configuration for Microgrid Studies",
    "abstract": "Diesel electric generators are an inherent part of remote hybrid microgrids\nfound in remote regions of the world that provide primary frequency response\n(PFR) to restore system frequency during load or generation changes. However,\nwith inverter-based resources (IBR) integration into microgrids, the IBR\ncontrol provides a fast frequency response (FFR) to restore the system\nfrequency. Hence, supplementing PFR with FFR requires a sophisticated control\nsystem and a high fidelity diesel electric generator model to design these\ncontrol systems. In this work, a high-fidelity model of a diesel electric\ngenerator is developed. Its parameters are tuned using a surrogate optimization\nalgorithm by emulating its response during a load change to a 400 kVA\nCaterpillar C-15 diesel generator, similar to those found in remote microgrids.\nThe diesel electric generator model consists of a synchronous machine, DC4B\nexcitation with V/Hz limiter, and a proposed modified IEEE GGOV1\nengine-governor model (GGOV1D). The performance of the GGOV1D is compared with\nsimple, Woodward DEGOV, and a standard IEEE GGOV1 engine-governor model.\nResults show that error in the diesel electric generator's response to load\nchanges using the GGOV1D model is lower with an improved frequency response\nduring the arresting and rebound period than the other engine-governor models.",
    "authors": [
      "Chinmay Shah",
      "Mariko Shirazi",
      "Richard Wies",
      "Phylicia Cicilio",
      "Timothy Hansen",
      "Reinaldo Tonkoski"
    ],
    "publication_date": "2022-04-29T05:56:06Z",
    "arxiv_id": "http://arxiv.org/abs/2204.13894v1",
    "download_url": "http://arxiv.org/abs/2204.13894v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Impact of Artificial Intelligence on Electrical and Electronics\n  Engineering Productivity in the Construction Industry",
    "abstract": "Artificial intelligence (AI) can revolutionize the development industry,\nprimarily electrical and electronics engineering. By automating recurring\nduties, AI can grow productivity and efficiency in creating. For instance, AI\ncan research constructing designs, discover capability troubles, and generate\nanswers, reducing the effort and time required for manual analysis. AI also can\nbe used to optimize electricity consumption in buildings, which is a critical\ndifficulty in the construction enterprise. Via machines gaining knowledge of\nalgorithms to investigate electricity usage patterns, AI can discover areas\nwherein power may be stored and offer guidelines for enhancements. This can\nresult in significant value financial savings and reduced carbon emissions.\nMoreover, AI may be used to improve the protection of creation websites. By\nstudying statistics from sensors and cameras, AI can locate capacity dangers\nand alert workers to take suitable action. This could help save you from\ninjuries and accidents on production sites, lowering the chance for workers and\nenhancing overall safety in the enterprise. The impact of AI on electric and\nelectronics engineering productivity inside the creation industry is enormous.\nAI can transform how we layout, build, and function buildings by automating\nordinary duties, optimising electricity intake, and enhancing safety. However,\nensuring that AI is used ethically and responsibly and that the advantages are\nshared fairly throughout the enterprise is essential.",
    "authors": [
      "Nwosu Obinnaya Chikezie Victor"
    ],
    "publication_date": "2023-10-05T15:14:48Z",
    "arxiv_id": "http://arxiv.org/abs/2310.03591v1",
    "download_url": "http://arxiv.org/abs/2310.03591v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Applications of Dynamical Systems in Engineering",
    "abstract": "This paper presents the current possible applications of Dynamical Systems in\nEngineering. The applications of chaos, fractals have proven to be an exciting\nand fruitful endeavor. These applications are highly diverse ranging over such\nfields as Electrical, Electronics and Computer Engineering. Dynamical Systems\ntheory describes general patterns found in the solution of systems of nonlinear\nequations. The theory focuses upon those equations representing the change of\nprocesses in time. This paper offers the issue of applying dynamical systems\nmethods to a wider circle of Engineering problems. There are three components\nto our approach: ongoing and possible applications of Fractals, Chaos Theory\nand Dynamical Systems. Some basic and useful computer simulation of Dynamical\nSystem related problems have been shown also.",
    "authors": [
      "Yousuf Ibrahim Khan"
    ],
    "publication_date": "2013-04-18T20:54:14Z",
    "arxiv_id": "http://arxiv.org/abs/1304.5251v1",
    "download_url": "http://arxiv.org/abs/1304.5251v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Impedance operator description of a meta--surface with electric and\n  magnetic dipoles",
    "abstract": "A meta-surface made of a collection of nano-resonators characterized an\nelectric dipole and a magnetic dipole was studied in the regime where the\nwavelength is large with respect to the size of the resonators. An effective\ndescription in terms of an impedance operator was derived.",
    "authors": [
      "Didier Felbacq"
    ],
    "publication_date": "2015-07-28T11:57:47Z",
    "arxiv_id": "http://arxiv.org/abs/1507.07736v1",
    "download_url": "http://arxiv.org/abs/1507.07736v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimizing Retrieval-Augmented Generation for Electrical Engineering: A\n  Case Study on ABB Circuit Breakers",
    "abstract": "Integrating Retrieval Augmented Generation (RAG) with Large Language Models\n(LLMs) has shown the potential to provide precise, contextually relevant\nresponses in knowledge intensive domains. This study investigates the\nap-plication of RAG for ABB circuit breakers, focusing on accuracy,\nreliability, and contextual relevance in high-stakes engineering environments.\nBy leveraging tailored datasets, advanced embedding models, and optimized\nchunking strategies, the research addresses challenges in data retrieval and\ncontextual alignment unique to engineering documentation. Key contributions\ninclude the development of a domain-specific dataset for ABB circuit breakers\nand the evaluation of three RAG pipelines: OpenAI GPT4o, Cohere, and Anthropic\nClaude. Advanced chunking methods, such as paragraph-based and title-aware\nsegmentation, are assessed for their impact on retrieval accuracy and response\ngeneration. Results demonstrate that while certain configurations achieve high\nprecision and relevancy, limitations persist in ensuring factual faithfulness\nand completeness, critical in engineering contexts. This work underscores the\nneed for iterative improvements in RAG systems to meet the stringent demands of\nelectrical engineering tasks, including design, troubleshooting, and\noperational decision-making. The findings in this paper help advance research\nof AI in highly technical domains such as electrical engineering.",
    "authors": [
      "Salahuddin Alawadhi",
      "Noorhan Abbas"
    ],
    "publication_date": "2025-05-23T06:21:37Z",
    "arxiv_id": "http://arxiv.org/abs/2505.17520v1",
    "download_url": "http://arxiv.org/abs/2505.17520v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding electric field control of electronic and optical\n  properties of strongly-coupled multi-layer quantum dot molecules",
    "abstract": "Strongly-coupled quantum dot molecules (QDMs) are widely deployed in the\ndesign of a variety of optoelectronic, photovoltaic, and quantum information\ndevices. An efficient and optimized performance of these devices demands\nengineering of the electronic and optical properties of the underlying QDMs.\nThe application of electric fields offers a knob to realise such control over\nthe QDM characteristics for a desired device operation. We perform\nmulti-million-atom atomistic tight-binding calculations to study the influence\nof electric fields on the electron and hole wave function confinements and\nsymmetries, the ground-state transition energies, the band-gap wavelengths, and\nthe optical transition modes. The electrical fields both parallel ($\\vec{E_p}$)\nand anti-parallel ($\\vec{E_a}$) to the growth direction are investigated to\nprovide a comprehensive guide on the understanding of the electric field\neffects. The strain-induced asymmetry of the hybridized electron states is\nfound to be weak and can be balanced by applying a small $\\vec{E_a}$ electric\nfield, of the order of 1 KV/cm. The strong interdot couplings completely break\ndown at large electric fields, leading to single QD states confined at the\nopposite edges of the QDM. This mimics a transformation from a type-I band\nstructure to a type-II band structure for the QDMs, which is a critical\nrequirement for the design of intermediate-band solar cells (IBSC). The\nanalysis of the field-dependent ground-state transition energies reveal that\nthe QDM can be operated both as a high dipole moment device by applying large\nelectric fields and as a high polarizibility device under the application of\nsmall electric field magnitudes. [abstract is truncated to fit the character\ncount of arXiv]",
    "authors": [
      "Muhammad Usman"
    ],
    "publication_date": "2015-08-24T21:59:30Z",
    "arxiv_id": "http://arxiv.org/abs/1508.05981v1",
    "download_url": "http://arxiv.org/abs/1508.05981v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering and Economic Analysis for Electric Vehicle Charging\n  Infrastructure --- Placement, Pricing, and Market Design",
    "abstract": "This dissertation is to study the interplay between large-scale electric\nvehicle (EV) charging and the power system. We address three important issues\npertaining to EV charging and integration into the power system: (1) charging\nstation placement, (2) pricing policy and energy management strategy, and (3)\nelectricity trading market and distribution network design to facilitate\nintegrating EV and renewable energy source (RES) into the power system.\n  For charging station placement problem, we propose a multi-stage consumer\nbehavior based placement strategy with incremental EV penetration rates and\nmodel the EV charging industry as an oligopoly where the entire market is\ndominated by a few charging service providers (oligopolists). The optimal\nplacement policy for each service provider is obtained by solving a Bayesian\ngame.\n  For pricing and energy management of EV charging stations, we provide\nguidelines for charging service providers to determine charging price and\nmanage electricity reserve to balance the competing objectives of improving\nprofitability, enhancing customer satisfaction, and reducing impact on the\npower system. Two algorithms --- stochastic dynamic programming (SDP) algorithm\nand greedy algorithm (benchmark algorithm) are applied to derive the pricing\nand electricity procurement strategy.\n  We design a novel electricity trading market and distribution network, which\nsupports seamless RES integration, grid to vehicle (G2V), vehicle to grid\n(V2G), vehicle to vehicle (V2V), and distributed generation (DG) and storage.\nWe apply a sharing economy model to the electricity sector to stimulate\ndifferent entities to exchange and monetize their underutilized electricity. A\nfitness-score (FS)-based supply-demand matching algorithm is developed by\nconsidering consumer surplus, electricity network congestion, and economic\ndispatch.",
    "authors": [
      "Chao Luo"
    ],
    "publication_date": "2018-08-12T06:05:08Z",
    "arxiv_id": "http://arxiv.org/abs/1808.03897v1",
    "download_url": "http://arxiv.org/abs/1808.03897v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A novel ML-fuzzy control system for optimizing PHEV fuel efficiency and\n  extending electric range under diverse driving conditions",
    "abstract": "Aiming for a greener transportation future, this study introduces an\ninnovative control system for plug-in hybrid electric vehicles (PHEVs) that\nutilizes machine learning (ML) techniques to forecast energy usage in the pure\nelectric mode of the vehicle and optimize power allocation across different\noperational modes, including pure electric, series hybrid, parallel hybrid, and\ninternal combustion operation. The fuzzy logic decision-making process governs\nthe vehicle control system. The performance was assessed under various driving\nconditions. Key findings include a significant enhancement in pure electric\nmode efficiency, achieving an extended full-electric range of approximately 84\nkilometers on an 80% utilization of a 20-kWh battery pack. During the WLTC\ndriving cycle, the control system reduced fuel consumption to 2.86 L/100km,\nrepresenting a 20% reduction in gasoline-equivalent fuel consumption.\nEvaluations of vehicle performance at discrete driving speeds, highlighted\neffective energy management, with the vehicle battery charging at lower speeds\nand discharging at higher speeds, showing optimized energy recovery and\nconsumption strategies. Initial battery charge levels notably influenced\nvehicle performance. A 90% initial charge enabled prolonged all-electric\noperation, minimizing fuel consumption to 2 L/100km less than that of the base\ncontrol system. Real-world driving pattern analysis revealed significant\nvariations, with shorter, slower cycles requiring lower fuel consumption due to\nprioritized electric propulsion, while longer, faster cycles increased internal\ncombustion engine usage. The control system also adapted to different battery\nstate of health (SOH) conditions, with higher SOH facilitating extended\nelectric mode usage, reducing total fuel consumption by up to 2.87 L/100km.",
    "authors": [
      "Mehrdad Raeesi",
      "Saba Mansour",
      "Sina Changizian"
    ],
    "publication_date": "2024-12-12T17:47:19Z",
    "arxiv_id": "http://arxiv.org/abs/2412.09499v1",
    "download_url": "http://arxiv.org/abs/2412.09499v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Superconducting Power Generation",
    "abstract": "The superconducting ac generator has the greatest potential for large-scale\ncommercial application of superconductivity that can benefit the public.\nElectric power is a vital ingredient of modern society, and generation may be\nconsidered to be the vital ingredient of a power system. This articles gives\nbackground, and an insight into the physics and engineering of superconducting\npower generation.",
    "authors": [
      "Mario Rabinowitz"
    ],
    "publication_date": "2003-02-20T01:21:58Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0302067v1",
    "download_url": "http://arxiv.org/abs/physics/0302067v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formal Semantics of the Kconfig Language",
    "abstract": "The Kconfig language defines a set of symbols that are assigned a value in a\nconfiguration. We describe the semantics of the Kconfig language according to\nthe behavior exhibited in the xconfig configurator. We assume an abstract\nsyntax representation for concepts in the Kconfig language and delegate the\ndetails of the translation from concrete to abstract syntaxes to a later\ndocument.",
    "authors": [
      "Steven She",
      "Thorsten Berger"
    ],
    "publication_date": "2022-09-11T18:49:43Z",
    "arxiv_id": "http://arxiv.org/abs/2209.04916v1",
    "download_url": "http://arxiv.org/abs/2209.04916v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Novel Approach for Optimal Trajectory Design with Multiple Operation\n  Modes of Propulsion System, Part 2",
    "abstract": "Equipping a spacecraft with multiple solar-powered electric engines (of the\nsame or different types) compounds the task of optimal trajectory design due to\npresence of both real-valued inputs (power input to each engine in addition to\nthe direction of thrust vector) and discrete variables (number of active\nengines). Each engine can be switched on/off independently and \"optimal\"\noperating power of each engine depends on the available solar power, which\ndepends on the distance from the Sun. Application of the Composite Smooth\nControl (CSC) framework to a heliocentric fuel-optimal trajectory optimization\nfrom the Earth to the comet 67P/Churyumov-Gerasimenko is demonstrated, which\npresents a new approach to deal with multiple-engine problems. Operation of\nengine clusters with 4, 6, 10 and even 20 engines of the same type can be\noptimized. Moreover, engine clusters with different/mixed electric engines are\nconsidered with either 2, 3 or 4 different types of engines. Remarkably, the\nCSC framework allows us 1) to reduce the original multi-point boundary-value\nproblem to a two-point boundary-value problem (TPBVP), and 2) to solve the\nresulting TPBVPs using a single-shooting solution scheme and with a random\ninitialization of the missing costates. While the approach we present is a\ncontinuous neighbor of the discontinuous extremals, we show that the\ndiscontinuous necessary conditions are satisfied in the asymptotic limit. We\nbelieve this is the first indirect method to accommodate a multi-mode control\nof this level of complexity with realistic engine performance curves. The\nresults are interesting and promising for dealing with a large family of such\nchallenging multi-mode optimal control problems.",
    "authors": [
      "Ehsan Taheri",
      "John L. Junkins",
      "Ilya Kolmanovsky",
      "Anouck Girard"
    ],
    "publication_date": "2019-10-21T13:00:09Z",
    "arxiv_id": "http://arxiv.org/abs/1910.09330v1",
    "download_url": "http://arxiv.org/abs/1910.09330v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Transdisciplinary electric power grid science",
    "abstract": "The 20th-century engineering feat that most improved the quality of human\nlife, the electric power system, now faces discipline-spanning challenges that\nthreaten that distinction. So multilayered and complex that they resemble\necosystems, power grids face risks from their interdependent cyber, physical,\nsocial and economic layers. Only with a holistic understanding of the dynamics\nof electricity infrastructure and human operators, automatic controls,\nelectricity markets, weather, climate and policy can we fortify worldwide\naccess to electricity.",
    "authors": [
      "Charles D. Brummitt",
      "Paul D. H. Hines",
      "Ian Dobson",
      "Cristopher Moore",
      "Raissa M. D'Souza"
    ],
    "publication_date": "2013-07-27T20:36:47Z",
    "arxiv_id": "http://arxiv.org/abs/1307.7305v1",
    "download_url": "http://arxiv.org/abs/1307.7305v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Second harmonic generation with plasmonic metasurfaces: direct\n  comparison of electric and magnetic resonances",
    "abstract": "Plasmonic resonances in metallic nanostructures have been shown to\ndrastically enhance local electromagnetic fields, and thereby increase the\nefficiency of nonlinear optical phenomena, such as second harmonic generation\n(SHG). While it has been experimentally observed that enhanced fields can\nsignificantly boost SHG, to date it proved difficult to probe electrical and\nmagnetic resonances in one and the same nanostructure. This however is\nnecessary to directly compare relative contributions of electrical and magnetic\ncomponents of SHG enhancement. In this paper we report an experimental study of\na metasurface capable of providing electrical and magnetic resonant SHG\nenhancement for TM polarization. Our metasurface could be engineered such that\nthe peak frequencies of electrical and magnetic resonances could be adjusted\nindependently. We used this feature to distinguish their relative\ncontributions. Experimentally it was observed that the magnetic resonance\nprovides only 50% as much enhancement to SHG as compared to the electric\nresonance. In addition aligning both resonances in frequency results in\nconversion efficiency of 1.32 x 10^(-10).",
    "authors": [
      "Rohith Chandrasekar",
      "Naresh K. Emani",
      "Alexei Lagutchev",
      "Vladimir M. Shalaev",
      "Cristian Ciraci",
      "David R. Smith",
      "Alexander V. Kildishev"
    ],
    "publication_date": "2015-09-29T18:06:52Z",
    "arxiv_id": "http://arxiv.org/abs/1509.08871v1",
    "download_url": "http://arxiv.org/abs/1509.08871v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Plug-in Electric Vehicle Charging Congestion Analysis Using Taxi Travel\n  Data in the Central Area of Beijing",
    "abstract": "Recharging a plug-in electric vehicle is more time-consuming than refueling\nan internal combustion engine vehicle. As a result, charging stations may face\nserious congestion problems during peak traffic hours in the near future with\nthe rapid growth of plug-in electric vehicle population. Considering that\ndrivers' time costs are usually expensive, charging congestion will be a\ndominant factor that affect a charging station's quality of service. Hence, it\nis indispensable to conduct adequate congestion analysis when designing\ncharging stations in order to guarantee acceptable quality of service in the\nfuture. This paper proposes a data-driven approach for charging congestion\nanalysis of plug-in electric vehicle charging stations. Based on a data-driven\nplug-in electric vehicle charging station planning model, we adopt the queuing\ntheory to model and analyze the charging congestion phenomenon in these\nplanning results. We simulate and analyze the proposed method for charging\nstations servicing shared-use electric taxis in the central area of Beijing\nleveraging real-world taxi travel data.",
    "authors": [
      "Huimiao Chen",
      "Hongcai Zhang",
      "Zechun Hu",
      "Yunyi Liang",
      "Haocheng Luo",
      "Yinhai Wang"
    ],
    "publication_date": "2017-12-19T06:43:58Z",
    "arxiv_id": "http://arxiv.org/abs/1712.07300v1",
    "download_url": "http://arxiv.org/abs/1712.07300v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimal Scheduling of Flexible Power-to-X Technologies in the Day-ahead\n  Electricity Market",
    "abstract": "The ambitious CO2 emission targets of the Paris agreements are achievable\nonly with renewable energy, CO2-free power generation, new policies, and\nplanning. The main motivation of this paper is that future green fuels from\npower-to-X assets should be produced from power with the lowest possible\nemissions while still keeping the cost of electricity low. To this end we\npropose a power-to-X scheduling framework that is capable of co-optimizing CO2\nemission intensity and electricity prices in the day-ahead electricity market\nscheduling. Three realistic models for local production units are developed for\nflexible dispatch and the impact on electricity market scheduling is examined.\nFurthermore, the possible benefits of using CO2 emission intensity and\nelectricity prices trade-off in scheduling are discussed. We find that there is\na non-linear trade-off between CO2 emission intensity and cost, favoring a\nweighted optimization between the two objectives.",
    "authors": [
      "Neeraj Dhanraj Bokde",
      "Tim T Pedersen",
      "Gorm Bruun Andresen"
    ],
    "publication_date": "2021-10-19T08:30:04Z",
    "arxiv_id": "http://arxiv.org/abs/2110.09800v1",
    "download_url": "http://arxiv.org/abs/2110.09800v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electric field funnels for guiding charged nanoparticles. Simple models\n  for exact solutions",
    "abstract": "Static electric fields can be configured to guide charged nanoparticles along\nthe electric field lines. Some field line configurations can focus the\nnanoparticles to prescribed places thus acting as electric funnels. Despite the\nimportance of funnels for nanoprinting , there is a lack of formulation and\nunderstanding. We present two solvable models in two dimensions (2D) as far as\nit allows one to use the complex plane for exact calculation of the field\nlines. One model deals with two fixed dipoles such that the external electric\nfield tries to squeeze through between them thus forming a funnel. The other\none deals with a couple of parallel conducting plates with a hole where the\nexternal field comes through also creating a funnel. The results obtained may\nbe useful for configuring the electric field for nanoprinting engineering.",
    "authors": [
      "Peter V Pikhitsa"
    ],
    "publication_date": "2022-07-28T12:38:00Z",
    "arxiv_id": "http://arxiv.org/abs/2207.14045v3",
    "download_url": "http://arxiv.org/abs/2207.14045v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electric-Field-Induced Second-Harmonic Generation",
    "abstract": "Second-harmonic generation (SHG) is a fundamental nonlinear optical process\nwidely used in photonics; however, it is strictly forbidden in the bulk of\ncentrosymmetric materials due to their inversion symmetry. Nevertheless,\napplying an external electric field breaks this inversion symmetry. It induces\nan effective second-order nonlinear response known as the\nelectric-field-induced second-harmonic generation (EFISH) effect. This\nmechanism enables SHG even in centrosymmetric media and provides a powerful\ntool for dynamic and electrically tunable nonlinear nanophotonics. This review\npresents a comprehensive overview of the EFISH effect, covering the\nfundamentals, various material platforms (including bulk semiconductor\ncrystals, ferroelectrics, van der Waals materials, and polymers), as well as\ndiverse strategies for electric field engineering. It further distinguishs\nEFISH from related effects such as current-induced SHG and the quantum-confined\nStark effect, and highlight emerging applications of EFISH in tunable photonic\ndevices, carrier dynamics probing, and nonlinear optical modulation across\noptical, electronic, and THz regimes. Finally, key challenges and perspectives\nfor the future development of electrically controlled nonlinear optical systems\nare outlined.",
    "authors": [
      "Hangkai Fan",
      "Alexey Proskurin",
      "Mingzhao Song",
      "Yuri Kivshar",
      "Andrey Bogdanov"
    ],
    "publication_date": "2025-07-12T14:49:13Z",
    "arxiv_id": "http://arxiv.org/abs/2507.09306v1",
    "download_url": "http://arxiv.org/abs/2507.09306v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PriceFM: Foundation Model for Probabilistic Electricity Price\n  Forecasting",
    "abstract": "Electricity price forecasting in Europe presents unique challenges due to the\ncontinent's increasingly integrated and physically interconnected power market.\nWhile recent advances in deep learning and foundation models have led to\nsubstantial improvements in general time series forecasting, most existing\napproaches fail to capture the complex spatial interdependencies and\nuncertainty inherent in electricity markets. In this paper, we address these\nlimitations by introducing a comprehensive and up-to-date dataset across 24\nEuropean countries (38 regions), spanning from 2022-01-01 to 2025-01-01.\nBuilding on this groundwork, we propose PriceFM, a spatiotemporal foundation\nmodel that integrates graph-based inductive biases to capture spatial\ninterdependencies across interconnected electricity markets. The model is\ndesigned for multi-region, multi-timestep, and multi-quantile probabilistic\nelectricity price forecasting. Extensive experiments and ablation studies\nconfirm the model's effectiveness, consistently outperforming competitive\nbaselines and highlighting the importance of spatial context in electricity\nmarkets. The project page is at: https://runyao-yu.github.io/PriceFM/.",
    "authors": [
      "Runyao Yu",
      "Chenhui Gu",
      "Jochen Stiasny",
      "Qingsong Wen",
      "Wasim Sarwar Dilov",
      "Lianlian Qi",
      "Jochen L. Cremer"
    ],
    "publication_date": "2025-08-06T20:55:56Z",
    "arxiv_id": "http://arxiv.org/abs/2508.04875v2",
    "download_url": "http://arxiv.org/abs/2508.04875v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magnetic Particles",
    "abstract": "We present an overview of the subject of Magnetic Particles, starting at a\nlevel suitable for advanced high-school students and ending at a level suitable\nfor current practitioners in the field. The sub-topics covered include: Types\nof Magnetic Materials, Relationships Between the Vector Fields, Magnetic\nEnergies, Dynamics of Magnetic Particles, and Magnetocaloric Effects.",
    "authors": [
      "M. A. Novotny",
      "P. A. Rikvold"
    ],
    "publication_date": "1998-06-05T18:42:44Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9806082v1",
    "download_url": "http://arxiv.org/abs/cond-mat/9806082v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quasi-one-dimensional ballistic ring in crossed high-frequency electric\n  fields",
    "abstract": "We study electron dynamics in a quasi-one-dimensional ballistic ring driven\nby two crossed high-frequency electric fields parallel to the ring plane. The\naveraged dipole moment and emission intensity are calculated. The emission\npolarization coincides with the direction of one of the fields. A possibility\nis shown of the polarization switching to perpendicular direction under changes\nin the field amplitudes and frequencies.",
    "authors": [
      "E. M. Epshtein",
      "E. G. Fedorov",
      "G. M. Shmelev"
    ],
    "publication_date": "2004-04-26T09:57:23Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0404611v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0404611v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "General Relativity in Electrical Engineering",
    "abstract": "In electrical engineering metamaterials have been developed that offer\nunprecedented control over electromagnetic fields. Here we show that general\nrelativity lends the theoretical tools for designing devices made of such\nversatile materials. Given a desired device function, the theory describes the\nelectromagnetic properties that turn this function into fact. We consider media\nthat facilitate space-time transformations and include negative refraction. Our\ntheory unifies the concepts operating behind the scenes of perfect invisibility\ndevices, perfect lenses, the optical Aharonov-Bohm effect and electromagnetic\nanalogs of the event horizon, and may lead to further applications.",
    "authors": [
      "Ulf Leonhardt",
      "Thomas G. Philbin"
    ],
    "publication_date": "2006-07-17T12:54:52Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0607418v2",
    "download_url": "http://arxiv.org/abs/cond-mat/0607418v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Power Systems of the Future",
    "abstract": "Electric power is a vital ingredient of modern society. This paper in\nconjunction with previous papers was written to provide an insight into the\nphysics and engineering that go into electric power systems and their\nmodernization. Topics covered here are Direct Current; Superconducting\nGenerators; Energy Storage; Voltage Sags; Grid Stability, Power System Planning\nand Operations; Biological Effects of Electromagnetic Fields; Dispersed\nGeneration; Information Superhighway Synergy; Distribution Automation;\nConclusion.",
    "authors": [
      "Mario Rabinowitz"
    ],
    "publication_date": "2003-04-30T18:15:31Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0304116v1",
    "download_url": "http://arxiv.org/abs/physics/0304116v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Antarctica: A Southern Hemisphere Windpower Station?",
    "abstract": "The International Polar Year commences in 2007. We offer a macroproject plan\nto generate a large amount of electricity on the continent of Antarctica by\nusing sail-like wind dams incorporating air turbines. Electricity can be used\nto make exploration and exploitation efforts on Antarctica easier. We offer the\ntechnical specifications for the Fabric Aerial Dam and indicate some of the\ngeographical facts underpinning our macro-engineering proposal.",
    "authors": [
      "Alexander A. Bolonkin",
      "Richard B. Cathcart"
    ],
    "publication_date": "2007-01-04T16:05:51Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0701055v1",
    "download_url": "http://arxiv.org/abs/physics/0701055v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Wavelets for Single Carrier Communications",
    "abstract": "This paper and the following presentation aim to provide a report regarding\nthe seminar presentation given on 23.02.2011 as a part of the postgraduate\nseminar course S-88.4223 Wavelets in Communications lectured by Dr. Sumesh\nParameswaran at Aalto University School of Electrical Engineering. In\nparticular, the topic on \"wavelets for single carrier communications\" has been\nconsidered herein. Furthermore, a summary of wavelets in Single Carrier\n(SC)-FDMA Systems is as well provided.",
    "authors": [
      "Omer Bulakci"
    ],
    "publication_date": "2012-02-06T11:01:25Z",
    "arxiv_id": "http://arxiv.org/abs/1202.1100v1",
    "download_url": "http://arxiv.org/abs/1202.1100v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Age group and gender recognition from human facial images",
    "abstract": "This work presents an automatic human gender and age group recognition system\nbased on human facial images. It makes an extensive experiment with row pixel\nintensity valued features and Discrete Cosine Transform (DCT) coefficient\nfeatures with Principal Component Analysis and k-Nearest Neighbor\nclassification to identify the best recognition approach. The final results\nshow approaches using DCT coefficient outperform their counter parts resulting\nin a 99% correct gender recognition rate and 68% correct age group recognition\nrate (considering four distinct age groups) in unseen test images. Detailed\nexperimental settings and obtained results are clearly presented and explained\nin this report.",
    "authors": [
      "Tizita Nesibu Shewaye"
    ],
    "publication_date": "2013-03-29T20:32:04Z",
    "arxiv_id": "http://arxiv.org/abs/1304.0019v1",
    "download_url": "http://arxiv.org/abs/1304.0019v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Proceedings Scholar Metrics: H Index of proceedings on Computer Science,\n  Electrical & Electronic Engineering, and Communications according to Google\n  Scholar Metrics (2010-2014)",
    "abstract": "The objective of this report is to present a list of proceedings\n(conferences, workshops, symposia, meetings) in the areas of Computer Science,\nElectrical & Electronic Engineering, and Communications covered by Google\nScholar Metrics and ranked according to their h-index. Google Scholar Metrics\nonly displays publications that have published at least 100 papers and have\nreceived at least one citation in the last five years (2010-2014). The searches\nwere conducted between the 8th and 10th of December, 2015. A total of 1501\nproceedings have been identified",
    "authors": [
      "Alberto Martn-Martn",
      "Juan Manuel Aylln",
      "Enrique Ordua-Malea",
      "Emilio Delgado Lpez-Czar"
    ],
    "publication_date": "2016-06-17T12:12:47Z",
    "arxiv_id": "http://arxiv.org/abs/1606.05341v1",
    "download_url": "http://arxiv.org/abs/1606.05341v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comment on Jackson's analysis of electric charge quantization due to\n  interaction with Dirac's magnetic monopole",
    "abstract": "In J.D. Jackson's Classical Electrodynamics textbook, the analysis of Dirac's\ncharge quantization condition in the presence of a magnetic monopole has a\nmathematical omission and an all too brief physical argument that might mislead\nsome students. This paper presents a detailed derivation of Jackson's main\nresult, explains the significance of the missing term, and highlights the close\nconnection between Jackson's findings and Dirac's original argument.",
    "authors": [
      "Masud Mansuripur"
    ],
    "publication_date": "2017-01-03T06:08:21Z",
    "arxiv_id": "http://arxiv.org/abs/1701.00592v1",
    "download_url": "http://arxiv.org/abs/1701.00592v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thick GaN film stress-induced self-separation",
    "abstract": "Cracking of thick GaN films on sapphire substrates during the cooling down\nafter the growth was studied. The cracking was suppressed by increasing the\nfilm-to-substrate thickness ratio and by using an intermediate carbon buffer\nlayer, that reduced the binding energy between the GaN film and the substrate.\nWafer-scale self-separation of thick GaN films has been demonstrated.",
    "authors": [
      "Vladislav Voronenkov",
      "Andrey Leonidov",
      "Yuri Lelikov",
      "Andrey Zubrilov",
      "Yuri Shreter"
    ],
    "publication_date": "2019-02-09T18:13:51Z",
    "arxiv_id": "http://arxiv.org/abs/1902.03463v2",
    "download_url": "http://arxiv.org/abs/1902.03463v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermal noise engines",
    "abstract": "Electrical heat engines driven by the Johnson-Nyquist noise of resistors are\nintroduced. They utilize Coulomb's law and the fluctuation-dissipation theorem\nof statistical physics that is the reverse phenomenon of heat dissipation in a\nresistor. No steams, gases, liquids, photons, combustion, phase transition, or\nexhaust/pollution are present here. In these engines, instead of heat\nreservoirs, cylinders, pistons and valves, resistors, capacitors and switches\nare the building elements. For the best performance, a large number of parallel\nengines must be integrated to run in a synchronized fashion and the\ncharacteristic size of the elementary engine must be at the 10 nanometers\nscale. At room temperature, in the most idealistic case, a two-dimensional\nensemble of engines of 25 nanometer characteristic size integrated on a 2.5x2.5\ncm silicon wafer with 12 Celsius temperature difference between the warm-source\nand the cold-sink would produce a specific power of about 0.4 Watt. Regular and\ncoherent (correlated-cylinder states) versions are shown and both of them can\nwork in either four-stroke or two-stroke modes. The coherent engines have\nproperties that correspond to coherent quantum heat engines without the\npresence of quantum coherence. In the idealistic case, all these engines have\nCarnot efficiency, which is the highest possible efficiency of any heat engine,\nwithout violating the second law of thermodynamics.",
    "authors": [
      "Laszlo B. Kish"
    ],
    "publication_date": "2010-09-29T17:04:31Z",
    "arxiv_id": "http://arxiv.org/abs/1009.5942v6",
    "download_url": "http://arxiv.org/abs/1009.5942v6",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From local force-flux relationships to internal dissipations and their\n  impact on heat engine performance: The illustrative case of a thermoelectric\n  generator",
    "abstract": "We present an in-depth analysis of the sometimes understated role of the\nprinciple of energy conservation in linear irreversible thermodynamics. Our\ncase study is that of a thermoelectric generator (TEG), which is a heat engine\nof choice in irreversible thermodynamics, owing to the coupling between the\nelectrical and heat fluxes. We show why Onsager's reciprocal relations must be\nconsidered locally and how internal dissipative processes emerge from the\nextension of these relations to a global scale: the linear behavior of a heat\nengine at the local scale is associated with a dissipation process that must\npartake in the global energy balance. We discuss the consequences of internal\ndissipations on the so-called efficiency at maximum power, in the light of our\ncomparative analyses of exoreversibility and endoreversibility on the one hand,\nand of two classes of heat engines, autonomous and periodically-driven, on the\nother hand. Finally, basing our analysis on energy conservation, we also\ndiscuss recent works which claim the possibility to overcome the traditional\nboundaries on efficiency imposed by finite-time thermodynamics in\nthermoelectric systems with broken time-reversal symmetry; this we do by\nintroducing a \"thermal\" thermopower and an \"electrical\" thermopower which\npermits an analysis of the thermoelectric response of the TEG considering a\npossible dissymmetry between the electrical/thermal and the thermal/electrical\ncouplings.",
    "authors": [
      "Yann Apertet",
      "Henni Ouerdane",
      "Christophe Goupil",
      "Philippe Lecoeur"
    ],
    "publication_date": "2013-06-20T09:30:11Z",
    "arxiv_id": "http://arxiv.org/abs/1306.4800v2",
    "download_url": "http://arxiv.org/abs/1306.4800v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Microfluidic tools for assaying immune cell function",
    "abstract": "Joel Voldman is a professor in the Electrical Engineering and Computer\nScience Department at MIT. Here he describes his labs efforts to develop\nmicrofluidic devices for cell manipulation and analysis.",
    "authors": [
      "Joel Voldman"
    ],
    "publication_date": "2018-01-10T11:40:17Z",
    "arxiv_id": "http://arxiv.org/abs/1802.05609v1",
    "download_url": "http://arxiv.org/abs/1802.05609v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strong Purcell enhancement of an optical magnetic dipole transition",
    "abstract": "Engineering the local density of states with nanophotonic structures is a\npowerful tool to control light-matter interactions via the Purcell effect. At\noptical frequencies, control over the electric field density of states is\ntypically used to couple to and manipulate electric dipole transitions.\nHowever, it is also possible to engineer the magnetic density of states to\ncontrol magnetic dipole transitions. In this work, we experimentally\ndemonstrate the optical magnetic Purcell effect using a single rare earth ion\ncoupled to a nanophotonic cavity. We engineer a new single photon emitter,\nEr$^{3+}$ in MgO, where the electric dipole decay rate is strongly suppressed\nby the cubic site symmetry, giving rise to a nearly pure magnetic dipole\noptical transition. This allows the unambiguous determination of a magnetic\nPurcell factor $P_m=1040 \\pm 30$. We further extend this technique to realize a\nmagnetic dipole spin-photon interface, performing optical spin initialization\nand readout of a single Er$^{3+}$ electron spin. This work demonstrates the\nfundamental equivalence of electric and magnetic density of states engineering,\nand provides a new tool for controlling light-matter interactions for a broader\nclass of emitters.",
    "authors": [
      "Sebastian P. Horvath",
      "Christopher M. Phenicie",
      "Salim Ourari",
      "Mehmet T. Uysal",
      "Songtao Chen",
      "ukasz Dusanowski",
      "Mouktik Raha",
      "Paul Stevenson",
      "Adam T. Turflinger",
      "Robert J. Cava",
      "Nathalie P. de Leon",
      "Jeff D. Thompson"
    ],
    "publication_date": "2023-07-06T14:37:58Z",
    "arxiv_id": "http://arxiv.org/abs/2307.03022v1",
    "download_url": "http://arxiv.org/abs/2307.03022v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nanoscale electrostatic control in ferroelectric thin films through\n  lattice chemistry",
    "abstract": "Nanoscale electrostatic control of oxide interfaces enables physical\nphenomena and exotic functionalities beyond the realm of the bulk material. In\ntechnologically-relevant ferroelectric thin films, the interface-mediated\npolarization control is usually exerted by engineering the depolarizing field.\nHere, in contrast, we introduce polarizing surfaces and lattice chemistry\nengineering as an alternative strategy. Specifically, we engineer the\nelectric-dipole ordering in ferroelectric oxide heterostructures by exploiting\nthe charged sheets of the layered Aurivillius model system. By tracking in-situ\nthe formation of the Aurivillius charged Bi$_{2}$O$_{2}$ sheets, we reveal\ntheir polarizing effect leading to the characteristic Aurivillius out-of-plane\nantipolar ordering. Next, we use the polarizing Bi$_{2}$O$_{2}$ stacking as a\nversatile electrostatic environment to create new electric dipole\nconfigurations. We insert multiferroic BiFeO$_3$ into the Aurivillius framework\nto stabilize a ferrielectric-like non-collinear electric-dipole order in the\nfinal heterostructure while maintaining the antiferromagnetic order of\nBiFeO$_3$. We thus demonstrate that engineering the lattice chemistry\nstabilizes unconventional ferroic orderings at the nanoscale, a strategy that\nmay be expanded beyond the realm of electrically ordered materials.",
    "authors": [
      "Ipek Efe",
      "Alexander Vogel",
      "William S. Huxter",
      "Elzbieta Gradauskaite",
      "Iaroslav Gaponenko",
      "Patrycja Paruch",
      "Christian L. Degen",
      "Marta D. Rossell",
      "Manfred Fiebig",
      "Morgan Trassin"
    ],
    "publication_date": "2025-03-11T16:53:40Z",
    "arxiv_id": "http://arxiv.org/abs/2503.08613v1",
    "download_url": "http://arxiv.org/abs/2503.08613v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strain Engineering of van Hove Singularity and Coupled Itinerant\n  Ferromagnetism in Quasi-2D Oxide Superlattices",
    "abstract": "Engineering van Hove singularities (vHss) near the Fermi level, if feasible,\noffers a powerful route to control exotic quantum phases in electronic and\nmagnetic behaviors. However, conventional approaches, which rely primarily on\nchemical and electrical doping, focus mainly on local electrical or optical\nmeasurements, limiting their applicability to coupled functionalities. In this\nstudy, a vHs-induced insulator-metal transition coupled with a ferromagnetic\nphase transition was empirically achieved in atomically designed quasi-2D\nSrRuO3 (SRO) superlattices via epitaxial strain engineering, which has not been\nobserved in conventional 3D SRO systems. Theoretical calculations revealed that\nepitaxial strain effectively modulates the strength and energy positions of vHs\nof specific Ru orbitals, driving correlated phase transitions in the electronic\nand magnetic ground states. X-ray absorption spectroscopy confirmed the\nanisotropic electronic structure of quasi-2D SRO modulated by epitaxial strain.\nMagneto-optic Kerr effect and electrical transport measurements demonstrated\nmodulated magnetic and electronic phases. Furthermore, magneto-electrical\nmeasurements detected significant anomalous Hall effect signals and\nferromagnetic magnetoresistance, indicating the presence of magnetically\ncoupled charge carriers in the 2D metallic regime. This study establishes\nstrain engineering as a promising platform for tuning vHss and resultant\nitinerant ferromagnetism of low-dimensional correlated quantum systems.",
    "authors": [
      "Seung Gyo Jeong",
      "Minjae Kim",
      "Jin Young Oh",
      "Youngeun Ham",
      "In Hyeok Choi",
      "Seong Won Cho",
      "Jihyun Kim",
      "Huimin Jeong",
      "Byungmin Sohn",
      "Tuson Park",
      "Suyoun Lee",
      "Jong Seok Lee",
      "Deok-Yong Cho",
      "Bongjae Kim",
      "Woo Seok Choi"
    ],
    "publication_date": "2025-10-28T14:34:32Z",
    "arxiv_id": "http://arxiv.org/abs/2510.24465v1",
    "download_url": "http://arxiv.org/abs/2510.24465v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Science Challenges in Low Temperature Plasma Science and Engineering:\n  Enabling a Future Based on Electricity through Non-Equilibrium Plasma\n  Chemistry",
    "abstract": "The science and technology of Low Temperature Plasmas (LTPs) harbor dynamic\nand versatile methods of converting the potential energy of electricity to\nchemical reactivity, thereby enabling the Future Based on Renewable Electricity\n(FBRE). Research on LTPs connects fields as diverse as engineering, plasma\nphysics, biology and medicine, and so LTPs embody the definition of convergent\nresearch. This research will give rise to sustainable products, carbon neutral\nchemicals, medical advances, recovered resources, advanced materials, improved\nfood and water security, and environmental stewardship. LTP science, if\nproperly stewarded, has the potential to develop technologies capable of\nconverting electricity into chemical reactivity and new materials at the scale,\nefficiency, and selectivity required to meet the needs of a rapidly changing\nsociety in a sustainable way. To achieve these goals, significant scientific\nchallenges must be addressed and a programmatic home for LTPs established. The\nworkshop, Science Challenges in Low Temperature Plasma Science and Engineering:\nEnabling a Future Based on Electricity through Non-Equilibrium Plasma\nChemistry, was held at the NSF in August 2016 to develop a roadmap reflecting\nthe highest impact, highest return scientific challenges in LTPs in the context\nof controlling chemical reactivity for a sustainable future. This report\nsummarizes their findings of the Workshop.",
    "authors": [
      "Selma Mededovic Thagard",
      "Mohan Sankaran",
      "Mark J. Kushner"
    ],
    "publication_date": "2019-11-16T18:32:49Z",
    "arxiv_id": "http://arxiv.org/abs/1911.07076v1",
    "download_url": "http://arxiv.org/abs/1911.07076v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]