[
  {
    "title": "Three-dimensional discrete Boltzmann models for compressible flows in and out of equilibrium",
    "abstract": "We present a series of three-dimensional discrete Boltzmann (DB) models for compressible flows in and out of equilibrium. The key formulating technique is the construction of discrete equilibrium distribution function through inversely solving the kinetic moment relations that it satisfies. The crucial physical requirement is that all the used kinetic moment relations must be consistent with the non-equilibrium statistical mechanics. The necessity of such a kinetic model is that, with increasing the complexity of flows, the dynamical characterization of non-equilibrium state and the understanding of the constitutive relations need higher order kinetic moments and their evolution. The DB models at the Euler and Navier-Stokes levels proposed by this scheme are validated by several well-known benchmarks, ranging from one-dimension to three-dimension. Particularly, when the local Mach number, temperature ratio, and pressure ratio are as large as $10^2$, $10^4$, and $10^5$, respectively, the simulation results are still in excellent agreement with the Riemann solutions. How to model deeper thermodynamic non-equilibrium flows by DB is indicated. Via the DB method, it convenient to simulate nonequilibrium flows without knowing exact form of the hydrodynamic equations.",
    "authors": [
      "Yanbiao Gan",
      "Aiguo Xu",
      "Guangcai Zhang",
      "Huilin Lai"
    ],
    "publication_date": "2017-10-25T03:31:42Z",
    "arxiv_id": "http://arxiv.org/abs/1710.09065v1",
    "download_url": "https://arxiv.org/abs/1710.09065v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Using Mechanical Turk to Build Machine Translation Evaluation Sets",
    "abstract": "Building machine translation (MT) test sets is a relatively expensive task. As MT becomes increasingly desired for more and more language pairs and more and more domains, it becomes necessary to build test sets for each case. In this paper, we investigate using Amazon's Mechanical Turk (MTurk) to make MT test sets cheaply. We find that MTurk can be used to make test sets much cheaper than professionally-produced test sets. More importantly, in experiments with multiple MT systems, we find that the MTurk-produced test sets yield essentially the same conclusions regarding system performance as the professionally-produced test sets yield.",
    "authors": [
      "Michael Bloodgood",
      "Chris Callison-Burch"
    ],
    "publication_date": "2014-10-20T22:28:55Z",
    "arxiv_id": "http://arxiv.org/abs/1410.5491v1",
    "download_url": "https://arxiv.org/abs/1410.5491v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]