[
  {
    "title": "Mechanical feedback in the high-frequency limit",
    "abstract": "We investigate strong mechanical feedback for the single-electron tunneling device coupled to an underdamped harmonic oscillator in the high-frequency case, when the mechanical energy of the oscillator exceeds the tunnel rate, and for weak coupling. In the strong feedback regime, the mechanical oscillations oscillated by the telegraph signal from the SET in their turn modify the electric current. In contrast to the earlier results for the low frequencies, the current noise in not enhanced above the Poisson value.",
    "authors": [
      "R. El Boubsi",
      "O. Usmani",
      "Ya. M. Blanter"
    ],
    "publication_date": "2008-02-29T18:04:20Z",
    "arxiv_id": "http://arxiv.org/abs/0802.4442v1",
    "download_url": "https://arxiv.org/abs/0802.4442v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shape related constraints aware generation of Mechanical Designs through Deep Convolutional GAN",
    "abstract": "Mechanical product engineering often must comply with manufacturing or geometric constraints related to the shaping process. Mechanical design hence should rely on robust and fast tools to explore complex shapes, typically for design for additive manufacturing (DfAM). Topology optimization is such a powerful tool, yet integrating geometric constraints (shape-related) into it is hard. In this work, we leverage machine learning capability to handle complex geometric and spatial correlations to integrate into the mechanical design process geometry-related constraints at the conceptual level. More precisely, we explore the generative capabilities of recent Deep Learning architectures to enhance mechanical designs, typically for additive manufacturing. In this work, we build a generative Deep-Learning-based approach of topology optimization integrating mechanical conditions in addition to one typical manufacturing condition (the complexity of a design i.e. a geometrical condition). The approach is a dual-discriminator GAN: a generator that takes as input the mechanical and geometrical conditions and outputs a 2D structure and two discriminators, one to ensure that the generated structure follows the mechanical constraints and the other to assess the geometrical constraint. We also explore the generation of designs with a non-uniform material distribution and show promising results. Finally, We evaluate the generated designs with an objective evaluation of all wanted aspects: the mechanical as well as the geometrical constraints.",
    "authors": [
      "Waad Almasri",
      "Dimitri Bettebghor",
      "Fakhreddine Ababsa",
      "Florence Danglade"
    ],
    "publication_date": "2020-10-22T16:09:19Z",
    "arxiv_id": "http://arxiv.org/abs/2010.11833v1",
    "download_url": "https://arxiv.org/abs/2010.11833v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lunaport: Math, Mechanics & Transport",
    "abstract": "Issues for transport facilities on the lunar surface related to science, engineering, architecture, and human-factors are discussed. Logistic decisions made in the next decade may be crucial to financial success. In addition to outlining some of the problems and their relations with math and computation, the paper provides useful resources for decision-makers, scientists, and engineers.",
    "authors": [
      "Paul C. Kainen"
    ],
    "publication_date": "2021-07-30T04:04:54Z",
    "arxiv_id": "http://arxiv.org/abs/2107.14423v3",
    "download_url": "https://arxiv.org/abs/2107.14423v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical engineering of photon blockades in a cavity optomechanical system",
    "abstract": "We propose to mechanically control photon blockades (PB) in an optomechanical system with driving oscillators. We show that by tuning the mechanical driving parameters we achieve selective single-photon blockade (1PB) or two-photon blockade (2PB) as well as simultaneous 1PB and 2PB at the same frequency. This mechanical engineering of 1PB and 2PB can be understood from the anharmonic energy levels due to the modulation of the mechanical driving. In contrast to the optomechanical systems without any mechanical driving featuring PB only for specific optical detuning, our results can be useful for achieving novel photon sources with multi-frequency. Our work also opens up new route to mechanically engineer quantum states exhibiting highly nonclassical photon statistics.",
    "authors": [
      "Cuilu Zhai",
      "Ran Huang",
      "Baijun Li",
      "Hui Jing",
      "Le-Man Kuang"
    ],
    "publication_date": "2019-01-23T00:05:12Z",
    "arxiv_id": "http://arxiv.org/abs/1901.07654v1",
    "download_url": "https://arxiv.org/abs/1901.07654v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical modeling of the maturation process for tissue-engineered implants: application to biohybrid heart valves",
    "abstract": "The development of tissue-engineered cardiovascular implants can improve the lives of large segments of our society who suffer from cardiovascular diseases. Regenerative tissues are fabricated using a process called tissue maturation. Furthermore, it is highly challenging to produce cardiovascular regenerative implants with sufficient mechanical strength to withstand the loading conditions within the human body. Therefore, biohybrid implants for which the regenerative tissue is reinforced by standard reinforcement material (e.g. textile or 3d printed scaffold) can be an interesting solution. In silico models can significantly contribute to characterizing, designing, and optimizing biohybrid implants. The first step towards this goal is to develop a computational model for the maturation process of tissue-engineered implants. This paper focuses on the mechanical modeling of textile-reinforced tissue-engineered cardiovascular implants. First, we propose an energy-based approach to compute the collagen evolution during the maturation process. Then, we apply the concept of structural tensors to model the anisotropic behavior of the extracellular matrix and the textile scaffold. Next, the newly developed material model is embedded into a special solid-shell finite element formulation with reduced integration. Finally, we use our framework to compute two structural problems: a pressurized shell construct and a tubular-shaped heart valve. The results show the ability of the model to predict collagen growth in response to the boundary conditions applied during the maturation process. Consequently, we can predict the implant's mechanical response, such as the deformation and stresses of the implant.",
    "authors": [
      "Mahmoud Sesa",
      "Hagen Holthusen",
      "Lukas Lamm",
      "Christian Böhm",
      "Tim Brepols",
      "Stefan Jockenhövel",
      "Stefanie Reese"
    ],
    "publication_date": "2023-07-23T21:55:46Z",
    "arxiv_id": "http://arxiv.org/abs/2307.12439v1",
    "download_url": "https://arxiv.org/abs/2307.12439v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical and dielectric response of microcomposites of the type: ferroelastic-dielectric",
    "abstract": "Dynamic dielectric and mechanical responses of the microcomposites of the ferroelastic-dielectric type were studied in this paper. The mechanical inclusions-matrix interactions have influence on the mechanical moduli of the composite. We have studied a mechanical response of the composite which consists of the material M and of the other material I in which dispersion of mechanic moduli of particles is present. The inclusions of the dielectric material in the ferroelastic matrix has the effect on the dielectric response of the microcomposite. We have found conditions for which the inclusions have the effect of enhancement of the dielectric response. Results of low frequency dielectric constant and dielectric loss in orthorhombic $ Al_{2}(WO_{4})_{3}$ show for polycrystalline material, where voids play the role of the dielectric material, their linear increasing dependence on increasing hydrostatic pressure p. These facts are qualitatively explained within our theory.",
    "authors": [
      "O. Hudak",
      "W. Schranz",
      "M. Hudak"
    ],
    "publication_date": "2006-04-26T15:11:08Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0604590v2",
    "download_url": "https://arxiv.org/abs/cond-mat/0604590v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magnetic cooling and vibration isolation of a sub-kHz mechanical resonator",
    "abstract": "We report recent progress towards the realization of a sub-mK, low-vibration environment at the bottom stage of a dry dilution refrigerator for use in mechanical tests of quantum mechanics. Using adiabatic nuclear demagnetization, we have cooled a silicon cantilever force sensor to $T\\approx 1$ mK. The temperature of the tip-holder of the cantilever chip was determined via a primary magnetic flux noise thermometer. The quality factor of the cantilever continues to increase with decreasing temperature, reaching $Q\\approx 4\\cdot 10^4$ at $2$ mK. To demonstrate that the vibration isolation is not compromised, we report the detection of the thermal motion of the cantilever down to $T \\approx 20$ mK, only limited by the coupling to the SQUID readout circuit. We discuss feasible improvements that will allow us to probe unexplored regions of the parameter space of continuous spontaneous localization models.",
    "authors": [
      "Bernard van Heck",
      "Tim Fuchs",
      "Jaimy Plugge",
      "Wim A. Bosch",
      "Tjerk H. Oosterkamp"
    ],
    "publication_date": "2022-08-24T19:30:20Z",
    "arxiv_id": "http://arxiv.org/abs/2208.11750v2",
    "download_url": "https://arxiv.org/abs/2208.11750v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular motors: design, mechanism and control",
    "abstract": "Biological functions in each animal cell depend on coordinated operations of a wide variety of molecular motors. Some of the these motors transport cargo to their respective destinations whereas some others are mobile workshops which synthesize macromolecules while moving on their tracks. Some other motors are designed to function as packers and movers. All these motors require input energy for performing their mechanical works and operate under conditions far from thermodynamic equilibrium. The typical size of these motors and the forces they generate are of the order of nano-meters and pico-Newtons, respectively. They are subjected to random bombardments by the molecules of the surrounding aqueous medium and, therefore, follow noisy trajectories. Because of their small inertia, their movements in the viscous intracellular space exhibits features that are characteristics of hydrodynamics at low Reynold's number. In this article we discuss how theoretical modeling and computer simulations of these machines by physicists are providing insight into their mechanisms which engineers can exploit to design and control artificial nano-motors.",
    "authors": [
      "Debashish Chowdhury"
    ],
    "publication_date": "2007-09-12T11:02:08Z",
    "arxiv_id": "http://arxiv.org/abs/0709.1800v2",
    "download_url": "https://arxiv.org/abs/0709.1800v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimization of a relativistic quantum mechanical engine",
    "abstract": "We present an optimal analysis for a quantum mechanical engine working between two energy baths within the framework of relativistic quantum mechanics, adopting a first-order correction. This quantum mechanical engine, with the direct energy leakage between the energy baths, consists of two adiabatic and two isoenergetic processes and uses a three-level system of two non-interacting fermions as its working substance. Assuming that the potential wall moves at a finite speed, we derive the expression of power output and, in particular, reproduce the expression for the efficiency at maximum power.",
    "authors": [
      "Francisco J. Peña",
      "Michel Ferré",
      "Pedro Orellana René G. Rojas",
      "P. Vargas"
    ],
    "publication_date": "2016-03-13T22:38:47Z",
    "arxiv_id": "http://arxiv.org/abs/1603.04084v3",
    "download_url": "https://arxiv.org/abs/1603.04084v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Influence of Gd-rich precipitates on the martensitic transformation, magnetocaloric effect and mechanical properties of Ni-Mn-In Heusler alloys -- A comparative study",
    "abstract": "A multi-stimuli cooling cycle can be used to increase the cyclic caloric performance of multicaloric materials like Ni-Mn-In Heusler alloys. However, the use of a uniaxial compressive stress as an additional external stimulus to a magnetic field requires good mechanical stability. Improvement of mechanical stability and strength by doping has been shown in several studies. However, doping is always accompanied by grain refinement and a change in transition temperature. This raises the question of the extent to which mechanical strength is related to grain refinement, transition temperature, or precipitates. This study shows a direct comparison between a single-phase Ni-Mn-Sn and a two-phase Gd-doped Ni-Mn-In alloy with the same transition temperature and grain size. It is shown that the excellent magnetocaloric properties of the Ni-Mn-In matrix are maintained with doping. The isothermal entropy change and adiabatic temperature change are reduced by only 15% in the two-phase Ni-Mn-In-Heusler alloy compared to the single-phase alloy, which is resulting from a slight increase in thermal hysteresis and the width of the transition. Due to the same grain size and transition temperature, this effect can be directly related to the precipitates. The introduction of Gd precipitates leads to a 100% improvement in mechanical strength, which is significantly lower than the improvement observed for Ni-Mn-In alloys with grain refinement and Gd precipitates. This reveals that a significant contribution to the improved mechanical stability in Gd-doped Heusler alloys is related to grain refinement.",
    "authors": [
      "Franziska Scheibel",
      "Wei Liu",
      "Lukas Pfeuffer",
      "Navid Shayanfar",
      "Andreas Taubel",
      "Konstantin P. Skokov",
      "Stefan Riegg",
      "Yuye Wu",
      "Oliver Gutfleisch"
    ],
    "publication_date": "2023-02-22T15:22:39Z",
    "arxiv_id": "http://arxiv.org/abs/2302.11439v1",
    "download_url": "https://arxiv.org/abs/2302.11439v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data Publishing in Mechanics and Dynamics: Challenges, Guidelines, and Examples from Engineering Design",
    "abstract": "Data-based methods have gained increasing importance in engineering, especially but not only driven by successes with deep artificial neural networks. Success stories are prevalent, e.g., in areas such as data-driven modeling, control and automation, as well as surrogate modeling for accelerated simulation. Beyond engineering, generative and large-language models are increasingly helping with tasks that, previously, were solely associated with creative human processes. Thus, it seems timely to seek artificial-intelligence-support for engineering design tasks to automate, help with, or accelerate purpose-built designs of engineering systems, e.g., in mechanics and dynamics, where design so far requires a lot of specialized knowledge. However, research-wise, compared to established, predominantly first-principles-based methods, the datasets used for training, validation, and test become an almost inherent part of the overall methodology. Thus, data publishing becomes just as important in (data-driven) engineering science as appropriate descriptions of conventional methodology in publications in the past. This article analyzes the value and challenges of data publishing in mechanics and dynamics, in particular regarding engineering design tasks, showing that the latter raise also challenges and considerations not typical in fields where data-driven methods have been booming originally. Possible ways to deal with these challenges are discussed and a set of examples from across different design problems shows how data publishing can be put into practice. The analysis, discussions, and examples are based on the research experience made in a priority program of the German research foundation focusing on research on artificially intelligent design assistants in mechanics and dynamics.",
    "authors": [
      "Henrik Ebel",
      "Jan van Delden",
      "Timo Lüddecke",
      "Aditya Borse",
      "Rutwik Gulakala",
      "Marcus Stoffel",
      "Manish Yadav",
      "Merten Stender",
      "Leon Schindler",
      "Kristin Miriam de Payrebrune",
      "Maximilian Raff",
      "C. David Remy",
      "Benedict Röder",
      "Rohit Raj",
      "Tobias Rentschler",
      "Alexander Tismer",
      "Stefan Riedelbauch",
      "Peter Eberhard"
    ],
    "publication_date": "2024-10-07T18:26:05Z",
    "arxiv_id": "http://arxiv.org/abs/2410.18358v2",
    "download_url": "https://arxiv.org/abs/2410.18358v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A numerical investigation of the mechanics of intracranial aneurysms walls: Assessing the influence of tissue hyperelastic laws and heterogeneous properties on the stress and stretch fields",
    "abstract": "Numerical simulations have been extensively used in the past two decades for the study of intracranial aneurysms (IAs), a dangerous disease that occurs in the arteries that reach the brain. They may affect up to 10 % of the world's population, with up to 50 % mortality rate, in case of rupture. Physically, the blood flow inside IAs should be modeled as a fluid-solid interaction problem. However, the large majority of those works have focused on the hemodynamics of the intra-aneurysmal flow, while ignoring the wall tissue's mechanical response entirely, through rigid-wall modeling, or using limited modeling assumptions for the tissue mechanics. One of the explanations is the scarce data on the properties of IAs walls, thus limiting the use of better modeling options. Unfortunately, this situation is still the case, thus our present study investigates the effect of different modeling approaches to simulate the motion of an IA. We used three hyperelastic laws and two different ways of modeling the wall thickness and tissue mechanical properties -- one assumed that both were uniform while the other accounted for the heterogeneity of the wall by using a \"hemodynamics-driven\" approach in which both thickness and material constants varied spatially with the cardiac-cycle-averaged hemodynamics. Pulsatile numerical simulations, with patient-specific vascular geometries harboring IAs, were carried out using the one-way fluid-solid interaction solution strategy, in which the blood flow is solved and applied as the driving force of the wall motion. We found that different wall morphology models yield smaller absolute differences in the mechanical response than different hyperelastic laws. Furthermore, the stretch levels of IAs walls were more sensitive to the hyperelastic and material constants than the stress. These findings could be used to guide modeling decisions on IA simulations.",
    "authors": [
      "Iago Oliveira",
      "Philip Cardiff",
      "Carlos E. Baccin",
      "José Gasche"
    ],
    "publication_date": "2022-10-11T16:09:32Z",
    "arxiv_id": "http://arxiv.org/abs/2210.05575v1",
    "download_url": "https://arxiv.org/abs/2210.05575v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Optomechanical Quantum State Reconstruction of Mechanical Motion",
    "abstract": "Utilizing the tools of quantum optics to prepare and manipulate quantum states of motion of a mechanical resonator is currently one of the most promising routes to explore non-classicality at a macroscopic scale. An important quantum optomechanical tool yet to be experimentally demonstrated is the ability to perform complete quantum state reconstruction. Here, after providing a brief introduction to quantum states in phase space, we review and contrast the current proposals for state reconstruction of mechanical motional states and discuss experimental progress. Furthermore, we show that mechanical quadrature tomography using back-action-evading interactions gives an $s$-parameterized Wigner function where the numerical parameter $s$ is directly related to the optomechanical measurement strength. We also discuss the effects of classical noise in the optical probe for both state reconstruction and state preparation by measurement.",
    "authors": [
      "M. R. Vanner",
      "I. Pikovski",
      "M. S. Kim"
    ],
    "publication_date": "2014-06-04T11:50:58Z",
    "arxiv_id": "http://arxiv.org/abs/1406.1013v3",
    "download_url": "https://arxiv.org/abs/1406.1013v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical and Dielectric Response of PZT and Tetragonal to Monoclinic Phase Transition: I. Theory",
    "abstract": "The PZT material near the morphotropic phase boundary where a monoclinic phase was observed is studied. A theory of the tetragonal to monoclinic phase transition was developed within the Landau free energy approach. The phase transition from the tetragonal to the monoclinic phase is of the first order near the second order. Dielectric response near the phase transition from the tetragonal to the monoclinic phase was studied for the crystal and for the ceramic and polycrystalline material taking into account the diagonal 33 and the off diagonal 31 components of susceptibility. The later diverges at temperature of stability boundary for the monoclinic phase, and it is zero in the tetragonal phase. Such a behavior is not observed in the effective dielectric static constant for ceramics and polycrystalline materials. We explain absence of a large contribution of the off diagonal susceptibility by a grain structure of the material. Above the percolation transition the off diagonal contribution to the effective susceptibility is not present. Effective susceptibility which is decreasing in tetragonal phase is in the monoclinic phase also decreasing, however below phase transition temperature the decrease is slower. A quantitative theoretical behavior of dielectric susceptibility for both phases is found. Mechanical response of PZT material to a uniaxial stress is studied theoreticaly for both phases. Observed temperature behavior of it, a well around the transition temperature from the tetragonal to monoclinic phase transition, is qualitatively explained.",
    "authors": [
      "O. Hudak",
      "F. Cordero",
      "F. Craciun"
    ],
    "publication_date": "2006-09-10T16:57:52Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0609226v2",
    "download_url": "https://arxiv.org/abs/cond-mat/0609226v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]