[
  {
    "title": "Theoretical foundations and covariant balances for chemical engineering\n  applications with electromagnetic field",
    "abstract": "A covariant formalism is used in order to examine the status of Maxwell\nequations and to unify the concept of balances, for all chemical engineering\napplications in relation with electrodynamics. The resulting formal structure\nserves as a discussion in studying the determinism of electromagnetic systems,\nand examining the theoretical foundations for a general classification of\nchemical engineering applications when non-conservative forces are concerned. A\nstrategy for modeling such applications is then sketched and the balances for\nthe main conserved and non-conserved extensive quantities are then summarized\nin their covariant and classical forms.",
    "authors": [
      "Cornet Jean-François"
    ],
    "publication_date": "2020-10-14T15:36:44Z",
    "arxiv_id": "http://arxiv.org/abs/2010.07165v1",
    "download_url": "http://arxiv.org/abs/2010.07165v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How can potential engineers seek and discover their genuine vocations?",
    "abstract": "The article describes what constitutes chemical engineering and its branches\nare in plain language. It outlines what to expect when one enrolls in a\nchemical engineering program as an undergraduate or graduate student. This may\ninclude core subjects to take, skillset to master, and other essential\nexpertise that might be useful in the workplace. The discussion continues with\ncareer options for enthusiastic chemical engineers and how these young and\nearly careers graduates could discover their reason for well-being and life\npurpose as aspiring chemical engineers.",
    "authors": [
      "N. Karjanto"
    ],
    "publication_date": "2022-03-03T08:54:19Z",
    "arxiv_id": "http://arxiv.org/abs/2203.01574v1",
    "download_url": "http://arxiv.org/abs/2203.01574v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Physics-Constrained Machine Learning for Chemical Engineering",
    "abstract": "Physics-constrained machine learning (PCML) combines physical models with\ndata-driven approaches to improve reliability, generalizability, and\ninterpretability. Although PCML has shown significant benefits in diverse\nscientific and engineering domains, technical and intellectual challenges\nhinder its applicability in complex chemical engineering applications. Key\ndifficulties include determining the amount and type of physical knowledge to\nembed, designing effective fusion strategies with ML, scaling models to large\ndatasets and simulators, and quantifying predictive uncertainty. This\nperspective summarizes recent developments and highlights\nchallenges/opportunities in applying PCML to chemical engineering, emphasizing\non closed-loop experimental design, real-time dynamics and control, and\nhandling of multi-scale phenomena.",
    "authors": [
      "Angan Mukherjee",
      "Victor M. Zavala"
    ],
    "publication_date": "2025-08-28T10:52:01Z",
    "arxiv_id": "http://arxiv.org/abs/2508.20649v1",
    "download_url": "http://arxiv.org/abs/2508.20649v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Federated Learning from Molecules to Processes: A Perspective",
    "abstract": "We present a perspective on federated learning in chemical engineering that\nenvisions collaborative efforts in machine learning (ML) developments within\nthe chemical industry. Large amounts of chemical and process data are\nproprietary to chemical companies and are therefore locked in data silos,\nhindering the training of ML models on large data sets in chemical engineering.\nRecently, the concept of federated learning has gained increasing attention in\nML research, enabling organizations to jointly train machine learning models\nwithout disclosure of their individual data. We discuss potential applications\nof federated learning in several fields of chemical engineering, from the\nmolecular to the process scale. In addition, we apply federated learning in two\nexemplary case studies that simulate practical scenarios of multiple chemical\ncompanies holding proprietary data sets: (i) prediction of binary mixture\nactivity coefficients with graph neural networks and (ii) system identification\nof a distillation column with autoencoders. Our results indicate that ML models\njointly trained with federated learning yield significantly higher accuracy\nthan models trained by each chemical company individually and can perform\nsimilarly to models trained on combined datasets from all companies. Federated\nlearning has therefore great potential to advance ML models in chemical\nengineering while respecting corporate data privacy, making it promising for\nfuture industrial applications.",
    "authors": [
      "Jan G. Rittig",
      "Clemens Kortmann"
    ],
    "publication_date": "2025-06-23T11:27:34Z",
    "arxiv_id": "http://arxiv.org/abs/2506.18525v1",
    "download_url": "http://arxiv.org/abs/2506.18525v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multi-agent systems for chemical engineering: A review and perspective",
    "abstract": "Large language model (LLM)-based multi-agent systems (MASs) are a recent but\nrapidly evolving technology with the potential to transform chemical\nengineering by decomposing complex workflows into teams of collaborative agents\nwith specialized knowledge and tools. This review surveys the state-of-the-art\nof MAS within chemical engineering. While early studies demonstrate promising\nresults, scientific challenges remain, including the design of tailored\narchitectures, integration of heterogeneous data modalities, development of\nfoundation models with domain-specific modalities, and strategies for ensuring\ntransparency, safety, and environmental impact. As a young but fast-moving\nfield, MASs offer exciting opportunities to rethink chemical engineering\nworkflows.",
    "authors": [
      "Sophia Rupprecht",
      "Qinghe Gao",
      "Tanuj Karia",
      "Artur M. Schweidtmann"
    ],
    "publication_date": "2025-08-11T11:55:18Z",
    "arxiv_id": "http://arxiv.org/abs/2508.07880v1",
    "download_url": "http://arxiv.org/abs/2508.07880v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Kaemika app, Integrating protocols and chemical simulation",
    "abstract": "Kaemika is an app available on the four major app stores. It provides\ndeterministic and stochastic simulation, supporting natural chemical notation\nenhanced with recursive and conditional generation of chemical reaction\nnetworks. It has a liquid-handling protocol sublanguage compiled to a virtual\ndigital microfluidic device. Chemical and microfluidic simulations can be\ninterleaved for full experimental-cycle modeling. A novel and unambiguous\nrepresentation of directed multigraphs is used to lay out chemical reaction\nnetworks in graphical form.",
    "authors": [
      "Luca Cardelli"
    ],
    "publication_date": "2020-05-16T20:47:07Z",
    "arxiv_id": "http://arxiv.org/abs/2005.08097v1",
    "download_url": "http://arxiv.org/abs/2005.08097v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Maximizing information from chemical engineering data sets: Applications\n  to machine learning",
    "abstract": "It is well-documented how artificial intelligence can have (and already is\nhaving) a big impact on chemical engineering. But classical machine learning\napproaches may be weak for many chemical engineering applications. This review\ndiscusses how challenging data characteristics arise in chemical engineering\napplications. We identify four characteristics of data arising in chemical\nengineering applications that make applying classical artificial intelligence\napproaches difficult: (1) high variance, low volume data, (2) low variance,\nhigh volume data, (3) noisy/corrupt/missing data, and (4) restricted data with\nphysics-based limitations. For each of these four data characteristics, we\ndiscuss applications where these data characteristics arise and show how\ncurrent chemical engineering research is extending the fields of data science\nand machine learning to incorporate these challenges. Finally, we identify\nseveral challenges for future research.",
    "authors": [
      "Alexander Thebelt",
      "Johannes Wiebe",
      "Jan Kronqvist",
      "Calvin Tsay",
      "Ruth Misener"
    ],
    "publication_date": "2022-01-25T01:25:45Z",
    "arxiv_id": "http://arxiv.org/abs/2201.10035v1",
    "download_url": "http://arxiv.org/abs/2201.10035v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Microfluidics for Chemical Synthesis: Flow Chemistry",
    "abstract": "Klavs F. Jensen is Warren K. Lewis Professor in Chemical Engineering and\nMaterials Science and Engineering at the Massachusetts Institute of Technology.\nHere he describes the use of microfluidics for chemical synthesis, from the\nearly demonstration examples to the current efforts with automated droplet\nmicrofluidic screening and optimization techniques.",
    "authors": [
      "Klavs F. Jensen"
    ],
    "publication_date": "2018-01-10T11:42:01Z",
    "arxiv_id": "http://arxiv.org/abs/1802.05611v1",
    "download_url": "http://arxiv.org/abs/1802.05611v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Free Energy and Internal Combustion Engine Cycles",
    "abstract": "The performance of one type (Carnot) of Internal Combustion Engine (ICE)\ncycle is analyzed within the framework of thermodynamic free energies. ICE\nperformance is different from that of an External Combustion Engine (ECE) which\nis dictated by Carnot's rule.",
    "authors": [
      "William D. Harris"
    ],
    "publication_date": "2012-01-11T00:38:49Z",
    "arxiv_id": "http://arxiv.org/abs/1205.0177v1",
    "download_url": "http://arxiv.org/abs/1205.0177v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A large language model system for the field of chemical engineering\n  technology",
    "abstract": "The development of chemical engineering technology is a\n  multi-stage process that encompasses laboratory research, scaling up,\n  and industrial deployment. This process demands interdisciplinary col\nlaboration and typically incurs significant time and economic costs. To\n  tackle these challenges, we have developed a system based on ChemELLM\n  in this work. This system enables users to interact freely with the chem ical\nengineering model, establishing a new paradigm for AI-driven in novation and\naccelerating technological advancements in the chemical\n  sector.If you would like to experience our system, please visit our official\n  website at: https://chemindustry.iflytek.com/chat.",
    "authors": [
      "Heng Zhang",
      "Jibin Zhou",
      "Feiyang Xu",
      "Jian Cui",
      "Yi Li",
      "Fan Yang",
      "Hao Wang",
      "Xin Li",
      "Mao Ye"
    ],
    "publication_date": "2025-09-08T03:40:03Z",
    "arxiv_id": "http://arxiv.org/abs/2509.07034v1",
    "download_url": "http://arxiv.org/abs/2509.07034v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Model reduction in chemical dynamics: slow invariant manifolds, singular\n  perturbations, thermodynamic estimates, and analysis of reaction graph",
    "abstract": "The paper has two goals:\n  It presents basic ideas, notions, and methods for reduction of reaction\nkinetics models: quasi-steady-state, quasi-equilibrium, slow invariant\nmanifolds, and limiting steps.\n  It describes briefly the current state of the art and some latest\nachievements in the broad area of model reduction in chemical and biochemical\nkinetics, including new results in methods of invariant manifolds, computation\nsingular perturbation, bottleneck methods, asymptotology, tropical\nequilibration, and reaction mechanism skeletonisation.",
    "authors": [
      "A. N. Gorban"
    ],
    "publication_date": "2018-02-15T20:17:28Z",
    "arxiv_id": "http://arxiv.org/abs/1802.05745v1",
    "download_url": "http://arxiv.org/abs/1802.05745v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Value and Use of Data in Chemical Engineering Practice",
    "abstract": "The ability to generate, organize, analyze, understand and leverage data for\nsound decision making is a central activity of chemical engineers. Chemical\nengineers are responsible for the safe, profitable and environmentally friendly\noperation of chemical facilities; thus, they are expected to be good at\ndesigning and operating chemical processes. To this end, they make use of\nmodels which involves planning and conducting experiments in the laboratory or\na pilot plant, analyzing the generated data and making use of it for designing\nlarge scale industrial systems. In an operating plant, they need to analyze\ndata so as to achieve maximum efficiencies, reduce the use of precious natural\nresources, minimize environmental degradation, keep the plant safe as well as\nto help generate value for the customers and stakeholders. This chapter\nprovides a non-technical view of how chemical engineers translate data to the\nbest possible decisions that result in reliable, safe and profitable process\ndesign and operations.",
    "authors": [
      "Suparna Samavedham",
      "S. Lakshminarayanan"
    ],
    "publication_date": "2022-08-05T11:04:58Z",
    "arxiv_id": "http://arxiv.org/abs/2208.03105v1",
    "download_url": "http://arxiv.org/abs/2208.03105v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Computationally Efficient, Robust Methodology for Evaluating Chemical\n  Timescales with Detailed Chemical Kinetics",
    "abstract": "Turbulent reacting flows occur in a variety of engineering applications such\nas chemical reactors and power generating equipment (gas turbines and internal\ncombustion engines). Turbulent reacting flows are characterized by two main\ntimescales, namely, flow timescales and chemical (or reaction) timescales.\nUnderstanding the relative timescales of flow and reaction kinetics plays an\nimportant role, not only in the choice of models required for the accurate\nsimulation of these devices but also their design/optimization studies. There\nare several definitions of chemical timescales, which can largely be classified\nas algebraic or eigenvalue-based methods. The computational complexity (and\nhence cost) depends on the method of evaluation of the chemical timescales and\nsize of the chemical reaction mechanism. The computational cost and robustness\nof the methodology of evaluating the reaction times scales is an important\nconsideration in large-scale multi-dimensional simulations using detailed\nchemical mechanisms. In this work, we present a computational efficient and\nrobust methodology to evaluate chemical timescales based on the algebraic\nmethod. Comparison of this novel methodology with other traditional methods is\npresented for a range of fuel-air mixtures, pressures and temperatures\nconditions. Additionally, chemical timescales are also presented for fuel-air\nmixtures at conditions of relevance to power generating equipment. The proposed\nmethod showed the same temporal characteristics as the eigenvalue-based methods\nwith no additional computational cost for all the 1cases studied. The proposed\nmethod thus has the potential for use with multidimensional turbulent reacting\nflow simulations which require the computation of the Damkohler number.",
    "authors": [
      "S. M. Aithal"
    ],
    "publication_date": "2022-10-07T14:33:17Z",
    "arxiv_id": "http://arxiv.org/abs/2210.04894v1",
    "download_url": "http://arxiv.org/abs/2210.04894v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Covalent pathways in engineering h-BN supported graphene",
    "abstract": "Cross-planar di-vacancies (CPDVs) within stacked graphene hexagonal boron\nnitride (h-BN) heterostructures provide stabilized covalent links to bridge\nadjacent graphene and h-BN sheets. It was shown that the CPDVs serve as focal\npoints for cross-planar atom transport between graphene and h-BN, and the\nchemical nature of interlayer links along with associated cross-planar\nmigration pathways at these defects can be predictively manipulated through\nmodulation of the chemical environment and charge engineering, to achieve\nconsistent B or N doping and simultaneous healing of graphene. The present\nstudy proposed a viable approach integrating irradiation, chemical and charge\nengineering, to produce high-quality graphene with tunable electronic and\nelectrochemical properties, using the h-BN substrate.",
    "authors": [
      "Bin Ouyang",
      "Jun Song"
    ],
    "publication_date": "2015-03-07T22:26:42Z",
    "arxiv_id": "http://arxiv.org/abs/1503.02219v1",
    "download_url": "http://arxiv.org/abs/1503.02219v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficiency and Fluctuation in Tight-Coupling Model of Molecular Motor",
    "abstract": "A simple tight-coupling model of a molecular chemical engine is proposed. The\nefficiency of the chemical engine and its average velocity can be explicitly\ncalculated. The diffusion constant is evaluated approximately using the\nfluctuation theorem. Langevin simulations with stochastic boundary conditions\nare performed and the numerical results are compared with theoretical\ncalculations.",
    "authors": [
      "Hidetsugu Sakaguchi"
    ],
    "publication_date": "2006-05-08T10:27:22Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0605185v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0605185v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cyber Academia-Chemical Engineering (CA-ChemE): A Living Digital Town\n  for Self-Directed Research Evolution and Emergent Scientific Discovery",
    "abstract": "The rapid advancement of artificial intelligence (AI) has demonstrated\nsubstantial potential in chemical engineering, yet existing AI systems remain\nlimited in interdisciplinary collaboration and exploration of uncharted\nproblems. To address these issues, we present the Cyber Academia-Chemical\nEngineering (CA-ChemE) system, a living digital town that enables self-directed\nresearch evolution and emergent scientific discovery through multi-agent\ncollaboration. By integrating domain-specific knowledge bases, knowledge\nenhancement technologies, and collaboration agents, the system successfully\nconstructs an intelligent ecosystem capable of deep professional reasoning and\nefficient interdisciplinary collaboration. Our findings demonstrate that\nknowledge base-enabled enhancement mechanisms improved dialogue quality scores\nby 10-15% on average across all seven expert agents, fundamentally ensuring\ntechnical judgments are grounded in verifiable scientific evidence. However, we\nobserved a critical bottleneck in cross-domain collaboration efficiency,\nprompting the introduction of a Collaboration Agent (CA) equipped with ontology\nengineering capabilities. CA's intervention achieved 8.5% improvements for\ndistant-domain expert pairs compared to only 0.8% for domain-proximate pairs -\na 10.6-fold difference - unveiling the \"diminished collaborative efficiency\ncaused by knowledge-base gaps\" effect. This study demonstrates how carefully\ndesigned multi-agent architectures can provide a viable pathway toward\nautonomous scientific discovery in chemical engineering.",
    "authors": [
      "Zekun Jiang",
      "Chunming Xu",
      "Tianhang Zhou"
    ],
    "publication_date": "2025-10-01T05:26:55Z",
    "arxiv_id": "http://arxiv.org/abs/2510.01293v1",
    "download_url": "http://arxiv.org/abs/2510.01293v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficiency at maximum power of a chemical engine",
    "abstract": "A cyclically operating chemical engine is considered that converts chemical\nenergy into mechanical work. The working fluid is a gas of finite-sized\nspherical particles interacting through elastic hard collisions. For a generic\ntransport law for particle uptake and release, the efficiency at maximum power\n$\\eta$ takes the form 1/2+c\\Delta \\mu + O(\\Delta \\mu^2), with 1/2 a universal\nconstant and $\\Delta \\mu$ the chemical potential difference between the\nparticle reservoirs. The linear coefficient c is zero for engines featuring a\nso-called left/right symmetry or particle fluxes that are antisymmetric in the\napplied chemical potential difference. Remarkably, the leading constant in\n$\\eta$ is non-universal with respect to an exceptional modification of the\ntransport law. For a nonlinear transport model we obtain \\eta = 1/(\\theta +1),\nwith \\theta >0 the power of $\\Delta \\mu$ in the transport equation",
    "authors": [
      "Hans Hooyberghs",
      "Bart Cleuren",
      "Alberto Salazar",
      "Joseph O. Indekeu",
      "Christian Van den Broeck"
    ],
    "publication_date": "2013-06-17T14:05:01Z",
    "arxiv_id": "http://arxiv.org/abs/1306.3866v2",
    "download_url": "http://arxiv.org/abs/1306.3866v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Foundation Model for Chemical Reactor Modeling: Meta-Learning\n  with Physics-Informed Adaptation",
    "abstract": "Developing accurate models for chemical reactors is often challenging due to\nthe complexity of reaction kinetics and process dynamics. Traditional\napproaches require retraining models for each new system, limiting\ngeneralizability and efficiency. In this work, we take a step toward foundation\nmodels for chemical reactor modeling by introducing a neural network framework\nthat generalizes across diverse reactor types and rapidly adapts to new\nchemical processes. Our approach leverages meta-learning to pretrain the model\non a broad set of reactor dynamics, enabling efficient adaptation to unseen\nreactions with minimal data. To further enhance generalizability, we\nincorporate physics-informed fine-tuning, ensuring physically consistent\nadaptation to new reactor conditions. Our framework is evaluated across three\ninteger-order fundamental reactor types - continuous stirred tank reactors,\nbatch reactors, and plug flow reactors - demonstrating superior few-shot\nadaptation compared to conventional data-driven, physics-informed, and transfer\nlearning approaches. By combining meta-learning with physics-informed\nadaptation, this work lays the foundation for a generalizable modeling\nframework, advancing the development of foundation models for chemical\nengineering applications. Source code is available at\nhttps://github.com/killingbear999/chemical-reactor-foundation-model.",
    "authors": [
      "Zihao Wang",
      "Zhe Wu"
    ],
    "publication_date": "2024-05-20T03:26:58Z",
    "arxiv_id": "http://arxiv.org/abs/2405.11752v3",
    "download_url": "http://arxiv.org/abs/2405.11752v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engines with ideal efficiency and nonzero power for sublinear transport\n  laws",
    "abstract": "It is known that an engine with ideal efficiency ($\\eta =1$ for a chemical\nengine and $e = e_{\\rm Carnot}$ for a thermal one) has zero power because a\nreversible cycle takes an infinite time. However, at least from a theoretical\npoint of view, it is possible to conceive (irreversible) engines with nonzero\npower that can reach ideal efficiency. Here this is achieved by replacing the\nusual linear transport law by a sublinear one and taking the step-function\nlimit for the particle current (chemical engine) or heat current (thermal\nengine) versus the applied force. It is shown that in taking this limit exact\nthermodynamic inequalities relating the currents to the entropy production are\nnot violated.",
    "authors": [
      "Jesper Koning",
      "Joseph O. Indekeu"
    ],
    "publication_date": "2016-11-21T15:58:08Z",
    "arxiv_id": "http://arxiv.org/abs/1611.06856v1",
    "download_url": "http://arxiv.org/abs/1611.06856v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rule-based autocorrection of Piping and Instrumentation Diagrams (P&IDs)\n  on graphs",
    "abstract": "A piping and instrumentation diagram (P&ID) is a central reference document\nin chemical process engineering. Currently, chemical engineers manually review\nP&IDs through visual inspection to find and rectify errors. However,\nengineering projects can involve hundreds to thousands of P&ID pages, creating\na significant revision workload. This study proposes a rule-based method to\nsupport engineers with error detection and correction in P&IDs. The method is\nbased on a graph representation of P&IDs, enabling automated error detection\nand correction, i.e., autocorrection, through rule graphs. We use our pyDEXPI\nPython package to generate P&ID graphs from DEXPI-standard P&IDs. In this\nstudy, we developed 33 rules based on chemical engineering knowledge and\nheuristics, with five selected rules demonstrated as examples. A case study on\nan illustrative P&ID validates the reliability and effectiveness of the\nrule-based autocorrection method in revising P&IDs.",
    "authors": [
      "Lukas Schulze Balhorn",
      "Niels Seijsener",
      "Kevin Dao",
      "Minji Kim",
      "Dominik P. Goldstein",
      "Ge H. M. Driessen",
      "Artur M. Schweidtmann"
    ],
    "publication_date": "2025-02-18T09:35:09Z",
    "arxiv_id": "http://arxiv.org/abs/2502.18493v1",
    "download_url": "http://arxiv.org/abs/2502.18493v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prompt Engineering for Transformer-based Chemical Similarity Search\n  Identifies Structurally Distinct Functional Analogues",
    "abstract": "Chemical similarity searches are widely used in-silico methods for\nidentifying new drug-like molecules. These methods have historically relied on\nstructure-based comparisons to compute molecular similarity. Here, we use a\nchemical language model to create a vector-based chemical search. We extend\nimplementations by creating a prompt engineering strategy that utilizes two\ndifferent chemical string representation algorithms: one for the query and the\nother for the database. We explore this method by reviewing the search results\nfrom five drug-like query molecules (penicillin G, nirmatrelvir, zidovudine,\nlysergic acid diethylamide, and fentanyl) and three dye-like query molecules\n(acid blue 25, avobenzone, and 2-diphenylaminocarbazole). We find that this\nnovel method identifies molecules that are functionally similar to the query,\nindicated by the associated patent literature, and that many of these molecules\nare structurally distinct from the query, making them unlikely to be found with\ntraditional chemical similarity search methods. This method may aid in the\ndiscovery of novel structural classes of molecules that achieve target\nfunctionality.",
    "authors": [
      "Clayton W. Kosonocky",
      "Aaron L. Feller",
      "Claus O. Wilke",
      "Andrew D. Ellington"
    ],
    "publication_date": "2023-05-17T13:37:15Z",
    "arxiv_id": "http://arxiv.org/abs/2305.16330v1",
    "download_url": "http://arxiv.org/abs/2305.16330v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A single layer artificial neural network with engineered bacteria",
    "abstract": "The abstract mathematical rules of artificial neural network (ANN) are\nimplemented through computation using electronic computers, photonics and\nin-vitro DNA computation. Here we demonstrate the physical realization of ANN\nin living bacterial cells. We created a single layer ANN using engineered\nbacteria, where a single bacterium works as an artificial neuron and\ndemonstrated a 2-to-4 decoder and a 1-to-2 de-multiplexer for processing\nchemical signals. The inputs were extracellular chemical signals, which\nlinearly combined and got processed through a non-linear log-sigmoid activation\nfunction to produce fluorescent protein outputs. The activation function was\ngenerated by synthetic genetic circuits, and for each artificial neuron, the\nweight and bias values were adjusted manually by engineering the molecular\ninteractions within the bacterial neuron to represent a specific logical\nfunction. The artificial bacterial neurons were connected as ANN architectures\nto implement a 2-to-4 chemical decoder and a 1-to-2 chemical de-multiplexer. To\nour knowledge, this is the first ANN created by artificial bacterial neurons.\nThus, it may open up a new direction in ANN research, where engineered\nbiological cells can be used as ANN enabled hardware.",
    "authors": [
      "Kathakali Sarkar",
      "Deepro Bonnerjee",
      "Sangram Bagh"
    ],
    "publication_date": "2020-01-03T11:46:00Z",
    "arxiv_id": "http://arxiv.org/abs/2001.00792v1",
    "download_url": "http://arxiv.org/abs/2001.00792v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bond Graph Modelling of Chemiosmotic Biomolecular Energy Transduction",
    "abstract": "Engineering systems modelling and analysis based on the bond graph approach\nhas been applied to biomolecular systems. In this context, the notion of a\nFaraday-equivalent chemical potential is introduced which allows chemical\npotential to be expressed in an analogous manner to electrical volts thus\nallowing engineering intuition to be applied to biomolecular systems. Redox\nreactions, and their representation by half-reactions, are key components of\nbiological systems which involve both electrical and chemical domains. A bond\ngraph interpretation of redox reactions is given which combines bond graphs\nwith the Faraday- equivalent chemical potential. This approach is particularly\nrelevant when the biomolecular system implements chemoelectrical transduction -\nfor example chemiosmosis within the key metabolic pathway of mitochondria:\noxidative phosphorylation. An alternative way of implementing computational\nmodularity using bond graphs is introduced and used to give a physically based\nmodel of the mitochondrial electron transport chain. To illustrate the overall\napproach, this model is analysed using the Faraday-equivalent chemical\npotential approach and engineering intuition is used to guide affinity\nequalisation: a energy based analysis of the mitochondrial electron transport\nchain.",
    "authors": [
      "Peter Gawthrop"
    ],
    "publication_date": "2016-11-14T06:57:38Z",
    "arxiv_id": "http://arxiv.org/abs/1611.04264v2",
    "download_url": "http://arxiv.org/abs/1611.04264v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineered Bacteria Computationally Solve Chemically Generated 2X2 Maze\n  Problems",
    "abstract": "Maze generating and solving are challenging problems in mathematics and\ncomputing. Here we generated simple 2X2 maze problems applying four chemicals\nand created a set of engineered bacteria, which in a mixed population worked as\na computational solver for any such problem. The input-output matrices of a\nmathematical maze were mapped through a truth table, where the logic values of\nfour chemical inputs determined the sixteen different 2X2 maze problems on a\nchemical space. Our engineered bacteria, which consisted of six different\ngenetic logic circuits and distributed among six cell populations processed the\nchemical information and solved the problems by expressing or not expressing\nfour different fluorescent proteins. The three available solutions were\nvisualized by glowing bacteria and for the thirteen no solution cases no\nbacteria glowed. Thus, our system not only solved the maze problems but also\nshowed the number of solvable and unsolvable problems. This work presented a\nnew and abstract cellular computational way towards maze problems and may have\nsignificance in biocomputation and synthetic biology.",
    "authors": [
      "Kathakali Sarkar",
      "Deepro Bonnerjee",
      "Sangram Bagh"
    ],
    "publication_date": "2021-06-18T02:49:36Z",
    "arxiv_id": "http://arxiv.org/abs/2106.09882v1",
    "download_url": "http://arxiv.org/abs/2106.09882v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data augmentation for machine learning of chemical process flowsheets",
    "abstract": "Artificial intelligence has great potential for accelerating the design and\nengineering of chemical processes. Recently, we have shown that\ntransformer-based language models can learn to auto-complete chemical process\nflowsheets using the SFILES 2.0 string notation. Also, we showed that language\ntranslation models can be used to translate Process Flow Diagrams (PFDs) into\nProcess and Instrumentation Diagrams (P&IDs). However, artificial intelligence\nmethods require big data and flowsheet data is currently limited. To mitigate\nthis challenge of limited data, we propose a new data augmentation methodology\nfor flowsheet data that is represented in the SFILES 2.0 notation. We show that\nthe proposed data augmentation improves the performance of artificial\nintelligence-based process design models. In our case study flowsheet data\naugmentation improved the prediction uncertainty of the flowsheet\nautocompletion model by 14.7%. In the future, our flowsheet data augmentation\ncan be used for other machine learning algorithms on chemical process\nflowsheets that are based on SFILES notation.",
    "authors": [
      "Lukas Schulze Balhorn",
      "Edwin Hirtreiter",
      "Lynn Luderer",
      "Artur M. Schweidtmann"
    ],
    "publication_date": "2023-02-07T10:35:24Z",
    "arxiv_id": "http://arxiv.org/abs/2302.03379v1",
    "download_url": "http://arxiv.org/abs/2302.03379v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Power-Efficiency Constraint for Chemical Motors",
    "abstract": "Chemical gradients provide the primordial energy for biological functions by\ndriving the mechanical movement of microscopic engines. Their thermodynamic\nproperties remain elusive, especially concerning the dynamic change in energy\ndemand in biological systems. In this article, we derive a constraint relation\nbetween the output power and the conversion efficiency for a chemically fueled\nsteady-state rotary motor analogous to the $\\mathrm{F}_o$ motor of ATPase. We\nfind that the efficiency at maximum power is half of the maximum quasi static\nefficiency. These findings shall aid in the understanding of natural chemical\nengines and inspire the manual design and control of chemically fueled\nmicroscale engines.",
    "authors": [
      "Ruo-Xun Zhai",
      "Hui Dong"
    ],
    "publication_date": "2024-04-28T14:19:52Z",
    "arxiv_id": "http://arxiv.org/abs/2404.18195v4",
    "download_url": "http://arxiv.org/abs/2404.18195v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Computing: Fundamentals, Trends and Perspectives for Chemical\n  and Biochemical Engineers",
    "abstract": "We use the benefits and components of classical computers every day. However,\nthere are many types of problems which, as they grow in size, their\ncomputational complexity grows larger than classical computers will ever be\nable to solve. Quantum computing (QC) is a computation model that uses quantum\nphysical properties to solve such problems. QC is at the early stage of\nlarge-scale adoption in various industry domains to take advantage of the\nalgorithmic speed-ups it has to offer. It can be applied in a variety of areas,\nsuch as computer science, mathematics, chemical and biochemical engineering,\nand the financial industry. The main goal of this paper is to give an overview\nto chemical and biochemical researchers and engineers who may not be familiar\nwith quantum computation. Thus, the paper begins by explaining the fundamental\nconcepts of QC. The second contribution this publication tries to tackle is the\nfact that the chemical engineering literature still lacks a comprehensive\nreview of the recent advances of QC. Therefore, this article reviews and\nsummarizes the state of the art to gain insight into how quantum computation\ncan benefit and optimize chemical engineering issues. A bibliography analysis\ncovers the comprehensive literature in QC and analyzes quantum computing\nresearch in chemical engineering on various publication topics, using Clarivate\nanalytics covering the years 1990 to 2020. After the bibliographic analysis,\nrelevant applications of QC in chemical and biochemical engineering are\nhighlighted and a conclusion offers an outlook of future directions within the\nfield.",
    "authors": [
      "Amirhossein Nourbakhsh",
      "Mark Nicholas Jones",
      "Kaur Kristjuhan",
      "Deborah Carberry",
      "Jay Karon",
      "Christian Beenfeldt",
      "Kyarash Shahriari",
      "Martin P. Andersson",
      "Mojgan A. Jadidi",
      "Seyed Soheil Mansouri"
    ],
    "publication_date": "2022-01-08T12:49:57Z",
    "arxiv_id": "http://arxiv.org/abs/2201.02823v1",
    "download_url": "http://arxiv.org/abs/2201.02823v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A simple denoising algorithm using wavelet transform",
    "abstract": "Submission withdrawn because the authors erroneously submitted a revised\nversion as a new submission, see nlin.CD/0002028.",
    "authors": [
      "Manojit Roy",
      "V. Ravi Kumar",
      "B. D. Kulkarni",
      "John Sanderson",
      "Martin Rhodes",
      "Michel vander Stappen"
    ],
    "publication_date": "1999-12-29T17:34:04Z",
    "arxiv_id": "http://arxiv.org/abs/chao-dyn/9912038v2",
    "download_url": "http://arxiv.org/abs/chao-dyn/9912038v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Autonomous Discovery of Unknown Reaction Pathways from Data by Chemical\n  Reaction Neural Network",
    "abstract": "Chemical reactions occur in energy, environmental, biological, and many other\nnatural systems, and the inference of the reaction networks is essential to\nunderstand and design the chemical processes in engineering and life sciences.\nYet, revealing the reaction pathways for complex systems and processes is still\nchallenging due to the lack of knowledge of the involved species and reactions.\nHere, we present a neural network approach that autonomously discovers reaction\npathways from the time-resolved species concentration data. The proposed\nChemical Reaction Neural Network (CRNN), by design, satisfies the fundamental\nphysics laws, including the Law of Mass Action and the Arrhenius Law.\nConsequently, the CRNN is physically interpretable such that the reaction\npathways can be interpreted, and the kinetic parameters can be quantified\nsimultaneously from the weights of the neural network. The inference of the\nchemical pathways is accomplished by training the CRNN with species\nconcentration data via stochastic gradient descent. We demonstrate the\nsuccessful implementations and the robustness of the approach in elucidating\nthe chemical reaction pathways of several chemical engineering and biochemical\nsystems. The autonomous inference by the CRNN approach precludes the need for\nexpert knowledge in proposing candidate networks and addresses the curse of\ndimensionality in complex systems. The physical interpretability also makes the\nCRNN capable of not only fitting the data for a given system but also\ndeveloping knowledge of unknown pathways that could be generalized to similar\nchemical systems.",
    "authors": [
      "Weiqi Ji",
      "Sili Deng"
    ],
    "publication_date": "2020-02-20T23:36:46Z",
    "arxiv_id": "http://arxiv.org/abs/2002.09062v2",
    "download_url": "http://arxiv.org/abs/2002.09062v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Navigating Chemical-Linguistic Sharing Space with Heterogeneous\n  Molecular Encoding",
    "abstract": "Chemical language models (CLMs) are prominent for their effectiveness in\nexploring chemical space and enabling molecular engineering. However, while\nexploring chemical-linguistic space, CLMs suffer from the gap between natural\nlanguage and molecular representations. This challenge is primarily due to the\ninherent modeling differences between molecules and texts: molecules operate\nunified modeling to learn chemical space, while natural language sequentially\nmodels the semantic space. Additionally, the limited availability of\nhigh-quality text-to-molecule datasets further exacerbates this challenge. To\naddress the problem, we first verified the information bias in molecular\nrepresentations from different perspectives. We then developed the\nHeterogeneous Molecular Encoding (HME) framework, a unified molecular encoder\ncompressing the molecular features from fragment sequence, topology, and\nconformation with Q-learning. To better model chemical-linguistic space, we\nfurther constructed the MCMoD dataset, which contains over one million\nmolecules with various conditions, including properties, fragments, and\ndescriptions. Experimentally, HME promotes CLMs to achieve chemical-linguistic\nsharing space exploration: (1) chemical space exploration with linguistic\nguidance, where HME achieves significant improvements (+8.9\\% FCD) for\nmolecular design in multiple constraints, even in zero-shot scenarios; (2)\nlinguistic space exploration with molecular guidance, where HME generates\ntextual descriptions with high qualities (+11.6\\% BLEU) for molecules. These\nresults highlight the precision of HME in handling multi-objective and\ncross-domain tasks, as well as its remarkable generalization capability on\nunseen task combinations. HME offers a new perspective on navigating\nchemical-linguistic sharing space, advancing the potential of CLMs in both\nfundamental research and practical applications in chemistry.",
    "authors": [
      "Liuzhenghao Lv",
      "Hao Li",
      "Yu Wang",
      "Zhiyuan Yan",
      "Zijun Chen",
      "Zongying Lin",
      "Li Yuan",
      "Yonghong Tian"
    ],
    "publication_date": "2024-12-30T11:54:22Z",
    "arxiv_id": "http://arxiv.org/abs/2412.20888v2",
    "download_url": "http://arxiv.org/abs/2412.20888v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling of autoignition and NO sensitization for the oxidation of IC\n  engine surrogate fuels",
    "abstract": "This paper presents an approch for modeling with one single kinetic mechanism\nthe chemistry of the autoignition and combustion processes inside an internal\ncombustion engine, as well as the chemical kinetics governing the\npost-oxidation of unburned hydrocarbons in engine exhaust gases. Therefore a\nnew kinetic model was developed, valid over a wide range of temperatures\nincluding the negative temperature coefficient regime. The model simulates the\nautoignition and the oxidation of engine surrogate fuels composed of n-heptane,\niso-octane and toluene, which are sensitized by the presence of nitric oxides.\nThe new model was obtained from previously published mechanisms for the\noxidation of alkanes and toluene where the coupling reactions describing\ninteractions between hydrocarbons and NOx were added. The mechanism was\nvalidated against a wide range of experimental data obtained in jet-stirred\nreactors, rapid compression machines, shock tubes and homogenous charge\ncompression ignition engines. Flow rate and sensitivity analysis were performed\nin order to explain the low temperature chemical kinetics, especially the\nimpact of NOx on hydrocarbon oxidation.",
    "authors": [
      "Jörg Anderlohr",
      "Roda Bounaceur",
      "A. Pires Da Cruz",
      "Frédérique Battin-Leclerc"
    ],
    "publication_date": "2009-03-23T08:43:37Z",
    "arxiv_id": "http://arxiv.org/abs/0903.3809v1",
    "download_url": "http://arxiv.org/abs/0903.3809v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A general efficiency relation for molecular machines",
    "abstract": "Living systems efficiently use chemical fuel to do work, process information,\nand assemble patterns despite thermal noise. Whether high efficiency arises\nfrom general principles or specific fine-tuning is unknown. Here, applying a\nrecent mapping from nonequilibrium systems to battery-resistor circuits, I\nderive an analytic expression for the efficiency of any dissipative molecular\nmachine driven by one or a series of chemical potential differences. This\nexpression disentangles the chemical potential from the machine's details,\nwhose effect on the efficiency is fully specified by a constant called the load\nresistance. The efficiency passes through a switch-like inflection point if the\nbalance between chemical potential and load resistance exceeds thermal noise.\nTherefore, dissipative chemical engines qualitatively differ from heat engines,\nwhich lack threshold behavior. This explains all-or-none dynein stepping with\nincreasing ATP concentration observed in single-molecule experiments. These\nresults indicate that biomolecular energy transduction is efficient not because\nof idosyncratic optimization of the biomolecules themselves, but rather because\nthe concentration of chemical fuel is kept above a threshold level within\ncells.",
    "authors": [
      "Milo M Lin"
    ],
    "publication_date": "2022-10-10T00:47:22Z",
    "arxiv_id": "http://arxiv.org/abs/2210.04380v1",
    "download_url": "http://arxiv.org/abs/2210.04380v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards chemical accuracy for chemi- and physisorption with an efficient\n  density functional",
    "abstract": "Understanding molecular adsorption on surfaces underpins many problems in\nchemistry and materials science. Accurately and efficiently describing the\nadsorption has been a challenging task for first-principles methods as the\nprocess can involve both short-range chemical bond formations and long-range\nphysical interactions, e.g., the van der Waals (vdW) interaction. Density\nfunctional theory presents an appealing choice for modeling adsorption\nreactions, though calculations with many exchange correlation density\nfunctional approximations struggle to accurately describe both chemical and\nphysical molecular adsorptions. Here, we propose an efficient density\nfunctional approximation that is accurate for both chemical and physical\nadsorption by concurrently optimizing its semilocal component and the\nlong-range vdW correction against the prototypical adsorption CO/Pt(111) and\nAr$_2$ binding energy curve. The resulting functional opens the door to\naccurate and efficient modeling of general molecular adsorption.",
    "authors": [
      "Manish Kothakonda",
      "Ruiqi Zhang",
      "Jinliang Ning",
      "James Furness",
      "Abhirup Patra",
      "Qing Zhao",
      "Jianwei Sun"
    ],
    "publication_date": "2024-10-15T04:09:00Z",
    "arxiv_id": "http://arxiv.org/abs/2410.11248v2",
    "download_url": "http://arxiv.org/abs/2410.11248v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Federated Learning in Chemical Engineering: A Tutorial on a Framework\n  for Privacy-Preserving Collaboration Across Distributed Data Sources",
    "abstract": "Federated Learning (FL) is a decentralized machine learning approach that has\ngained attention for its potential to enable collaborative model training\nacross clients while protecting data privacy, making it an attractive solution\nfor the chemical industry. This work aims to provide the chemical engineering\ncommunity with an accessible introduction to the discipline. Supported by a\nhands-on tutorial and a comprehensive collection of examples, it explores the\napplication of FL in tasks such as manufacturing optimization, multimodal data\nintegration, and drug discovery while addressing the unique challenges of\nprotecting proprietary information and managing distributed datasets. The\ntutorial was built using key frameworks such as $\\texttt{Flower}$ and\n$\\texttt{TensorFlow Federated}$ and was designed to provide chemical engineers\nwith the right tools to adopt FL in their specific needs. We compare the\nperformance of FL against centralized learning across three different datasets\nrelevant to chemical engineering applications, demonstrating that FL will often\nmaintain or improve classification performance, particularly for complex and\nheterogeneous data. We conclude with an outlook on the open challenges in\nfederated learning to be tackled and current approaches designed to remediate\nand improve this framework.",
    "authors": [
      "Siddhant Dutta",
      "Iago Leal de Freitas",
      "Pedro Maciel Xavier",
      "Claudio Miceli de Farias",
      "David Esteban Bernal Neira"
    ],
    "publication_date": "2024-11-23T13:16:06Z",
    "arxiv_id": "http://arxiv.org/abs/2411.16737v2",
    "download_url": "http://arxiv.org/abs/2411.16737v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Locally-Deployed Chain-of-Thought (CoT) Reasoning Model in Chemical\n  Engineering: Starting from 30 Experimental Data",
    "abstract": "In the field of chemical engineering, traditional data-processing and\nprediction methods face significant challenges. Machine-learning and\nlarge-language models (LLMs) also have their respective limitations. This paper\nexplores the application of the Chain-of-Thought (CoT) reasoning model in\nchemical engineering, starting from 30 experimental data points. By integrating\ntraditional surrogate models like Gaussian processes and random forests with\npowerful LLMs such as DeepSeek-R1, a hierarchical architecture is proposed. Two\nCoT-building methods, Large Language Model-Chain of Thought (LLM-CoT) and\nMachine Learning-Large Language Model-Chain of Thought (ML-LLM-CoT), are\nstudied. The LLM-CoT combines local models DeepSeek-r1:14b and Qwen2:7b with\nOllama. The ML-LLM-CoT integrates a pre-trained Gaussian ML model with the\nLLM-based CoT framework. Our results show that during construction, ML-LLM-CoT\nis more efficient. It only has 2 points that require rethink and a total of 4\nrethink times, while LLM-CoT has 5 points that need to be re-thought and 34\ntotal rethink times. In predicting the solubility of 20 molecules with\ndissimilar structures, the number of molecules with a prediction deviation\nhigher than 100\\% for the Gaussian model, LLM-CoT, and ML-LLM-CoT is 7, 6, and\n4 respectively. These results indicate that ML-LLM-CoT performs better in\ncontrolling the number of high-deviation molecules, optimizing the average\ndeviation, and achieving a higher success rate in solubility judgment,\nproviding a more reliable method for chemical engineering and molecular\nproperty prediction. This study breaks through the limitations of traditional\nmethods and offers new solutions for rapid property prediction and process\noptimization in chemical engineering.",
    "authors": [
      "Tianhang Zhou",
      "Yingchun Niu",
      "Xingying Lan",
      "Chunming Xu"
    ],
    "publication_date": "2025-02-17T23:43:48Z",
    "arxiv_id": "http://arxiv.org/abs/2502.12383v1",
    "download_url": "http://arxiv.org/abs/2502.12383v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Life at low Reynolds number isn't such a drag",
    "abstract": "The following is an unedited version of two short articles that are\nforthcoming in Nature Chemical Engineering. Inspired by Purcell's classic\nlecture \"Life at low Reynolds number\", I discuss how scaling arguments,\ndimensional analysis, and fundamental concepts from chemical engineering\nscience can be used to quantitatively describe microbial swimming -- thereby\nhelping to better understand biological systems and inspiring new engineering\nadvances in turn.",
    "authors": [
      "Sujit S. Datta"
    ],
    "publication_date": "2024-10-28T01:05:46Z",
    "arxiv_id": "http://arxiv.org/abs/2410.20648v2",
    "download_url": "http://arxiv.org/abs/2410.20648v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Methods of nonlinear kinetics",
    "abstract": "Nonlinear kinetic equations are reviewed for a wide audience of specialists\nand postgraduate students in physics, mathematical physics, material science,\nchemical engineering and interdisciplinary research. Contents: The Boltzmann\nequation, Phenomenology and Quasi-chemical representation of the Boltzmann\nequation, Kinetic models, Discrete velocity models, Direct simulation, Lattice\nGas and Lattice Boltzmann models, Minimal Boltzmann models for flows at low\nKnudsen number, Other kinetic equations: The Enskog equation for hard spheres,\nThe Vlasov equation, The Fokker-Planck equation, Equations of chemical kinetics\nand their reduction.",
    "authors": [
      "A. N. Gorban",
      "I. V. Karlin"
    ],
    "publication_date": "2003-06-03T12:48:56Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0306062v4",
    "download_url": "http://arxiv.org/abs/cond-mat/0306062v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SMILES2Vec: An Interpretable General-Purpose Deep Neural Network for\n  Predicting Chemical Properties",
    "abstract": "Chemical databases store information in text representations, and the SMILES\nformat is a universal standard used in many cheminformatics software. Encoded\nin each SMILES string is structural information that can be used to predict\ncomplex chemical properties. In this work, we develop SMILES2vec, a deep RNN\nthat automatically learns features from SMILES to predict chemical properties,\nwithout the need for additional explicit feature engineering. Using Bayesian\noptimization methods to tune the network architecture, we show that an\noptimized SMILES2vec model can serve as a general-purpose neural network for\npredicting distinct chemical properties including toxicity, activity,\nsolubility and solvation energy, while also outperforming contemporary MLP\nneural networks that uses engineered features. Furthermore, we demonstrate\nproof-of-concept of interpretability by developing an explanation mask that\nlocalizes on the most important characters used in making a prediction. When\ntested on the solubility dataset, it identified specific parts of a chemical\nthat is consistent with established first-principles knowledge with an accuracy\nof 88%. Our work demonstrates that neural networks can learn technically\naccurate chemical concept and provide state-of-the-art accuracy, making\ninterpretable deep neural networks a useful tool of relevance to the chemical\nindustry.",
    "authors": [
      "Garrett B. Goh",
      "Nathan O. Hodas",
      "Charles Siegel",
      "Abhinav Vishnu"
    ],
    "publication_date": "2017-12-06T04:29:28Z",
    "arxiv_id": "http://arxiv.org/abs/1712.02034v2",
    "download_url": "http://arxiv.org/abs/1712.02034v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A novel method for inference of chemical compounds with prescribed\n  topological substructures based on integer programming",
    "abstract": "Analysis of chemical graphs is becoming a major research topic in\ncomputational molecular biology due to its potential applications to drug\ndesign. One of the major approaches in such a study is inverse quantitative\nstructure activity/property relationships (inverse QSAR/QSPR) analysis, which\nis to infer chemical structures from given chemical activities/properties.\nRecently, a novel framework has been proposed for inverse QSAR/QSPR using both\nartificial neural networks (ANN) and mixed integer linear programming (MILP).\nThis method consists of a prediction phase and an inverse prediction phase. In\nthe first phase, a feature vector $f(G)$ of a chemical graph $G$ is introduced\nand a prediction function $\\psi_{\\mathcal{N}}$ on a chemical property $\\pi$ is\nconstructed with an ANN $\\mathcal{N}$. In the second phase, given a target\nvalue $y^*$ of the chemical property $\\pi$, a feature vector $x^*$ is inferred\nby solving an MILP formulated from the trained ANN $\\mathcal{N}$ so that\n$\\psi_{\\mathcal{N}}(x^*)$ is equal to $y^*$ and then a set of chemical\nstructures $G^*$ such that $f(G^*)= x^*$ is enumerated by a graph enumeration\nalgorithm. The framework has been applied to chemical compounds with a rather\nabstract topological structure such as acyclic or monocyclic graphs and graphs\nwith a specified polymer topology with cycle index up to 2.\n  In this paper, we propose a new flexible modeling method to the framework so\nthat we can specify a topological substructure of graphs and a partial\nassignment of chemical elements and bond-multiplicity to a target graph.",
    "authors": [
      "Tatsuya Akutsu",
      "Hiroshi Nagamochi"
    ],
    "publication_date": "2020-09-29T01:49:28Z",
    "arxiv_id": "http://arxiv.org/abs/2010.09203v4",
    "download_url": "http://arxiv.org/abs/2010.09203v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Kinetic and Thermodynamic Descriptions of Open Systems of Complex\n  Chemical Reactions with Multiple Scales",
    "abstract": "The general theory of a complex system of nonlinear chemical reactions is a\nprimary language of chemistry that includes chemical engineering and cellular\nbiochemistry. Its significance as an analytical framework, however, has not\nbeen fully appreciated outside the community of physical chemists. In this\nreview, we discuss the latest advances in the kinetics and Gibbsian\nthermodynamics of chemical reactions in a spatially homogeneous aqueous\nsolution with a multiscale perspective on complex systems. From the microscopic\nlevel of single reaction events which are purely stochastic in continuous time,\none at a time among a set of molecules, to the macroscopic chemical reaction\nsystems in bulk in terms of deterministic rate equations, the mathematical\ndescriptions of kinetic models for chemical reactions at different levels are\npresented in detail, with rigorous mathematical justifications presented. In\nparallel with the kinetics of chemical reactions, the irreversible\nthermodynamics of open systems and the stochastic thermodynamics along\nreactions trajectories are reviewed thoroughly. As a novel feature, the\nmathematical theory of large deviations is shown to play a pivotal role in the\nthermodynamics of chemical reactions in equilibrium and in irreversible\nprocesses. This review is expected to stimulate interests in and help defining\nmultiscale phenomena and nonequilibrium thermodynamics in many research fields\non population dynamics of interacting species using chemical reactions as an\nanalytic paradigm.",
    "authors": [
      "Liu Hong",
      "Hong Qian"
    ],
    "publication_date": "2025-10-20T10:04:52Z",
    "arxiv_id": "http://arxiv.org/abs/2510.17365v1",
    "download_url": "http://arxiv.org/abs/2510.17365v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electron-irradiation-facilitated production of chemically homogenized\n  nanotwins in nanolaminated carbides",
    "abstract": "Twin boundaries have been exploited to stabilize ultrafine grains and improve\nthe mechanical properties of nanomaterials. The production of twin boundaries\nand nanotwins is however prohibitively challenging in carbide ceramics. Using\nscanning transmission electron microscopes as a unique platform for\natomic-scale structure engineering, we demonstrate that twin platelets could be\nproduced in carbides by engineering antisite defects. Antisite defects at metal\nsites in various layered ternary carbides are collectively and controllably\ngenerated and the metal elements are homogenized by electron irradiation, which\ntransforms the twin-like lamellae into nanotwin platelets. Accompanying the\nchemical homogenization, {\\alpha}-Ti3AlC2 transforms to unconventional\n\\b{eta}-Ti3AlC2. The chemical homogeneity and the width of the twin platelets\ncan be tuned by the dose and energy of bombarding electrons. Chemically\nhomogenized nanotwins can boost the hardness by ~45%. Our results provide a new\nway to produce ultrathin (<5 nm) nanotwin platelets in scientifically and\ntechnologically important carbide materials and showcase the feasibility of\ndefect engineering by an angstrom-sized electron probe.",
    "authors": [
      "Hui Zhang",
      "Qianqian Jin",
      "Tao Hu",
      "Xiaochun Liu",
      "Zezhong Zhang",
      "Chunfeng Hu",
      "Yanchun Zhou",
      "Yu Han",
      "Xiaohui Wang"
    ],
    "publication_date": "2023-02-09T17:07:40Z",
    "arxiv_id": "http://arxiv.org/abs/2302.04773v1",
    "download_url": "http://arxiv.org/abs/2302.04773v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]