[
  {
    "title": "Gravity-capillary waves on the free surface of a liquid dielectric in a tangential electric field",
    "abstract": "Processes of propagation and interaction of nonlinear gravity-capillary waves on the free surface of a deep non-conducting liquid with high dielectric constant under the action of a tangential electric field are numerically simulated. The computational method is based on the time-dependent conformal transformation of the region occupied by the fluid into a half-plane. In the limit of a strong electric field, when the gravitational and capillary forces are negligibly small, there exists an exact analytical solution of the electro-hydrodynamic equations describing propagation without distortions of nonlinear surface waves along (or against) the electric field direction. In the situation where gravity and capillarity are taken into account, the results of numerical simulations indeed show that, for large external field, the waves traveling in a given direction tend to preserve their shape. In the limit of a strong electric field, the interaction of counter-propagating waves leads to the formation of regions, where the electrostatic and dynamic pressures undergo a discontinuity, and the curvature of the surface increases infinitely. The Fourier spectrum of the surface perturbations tends to the power-law distribution (k^-2). In the case of a finite electric field, the wave interaction results in a radiation of massive cascade of small-scale capillary waves that causes the chaotic behavior of the system. The investigated mechanism of interaction between oppositely-traveling waves can enhance development of the capillary turbulence of the fluid surface.",
    "authors": [
      "Evgeny A. Kochurin",
      "Nikolay M. Zubarev"
    ],
    "publication_date": "2018-01-12T10:44:15Z",
    "arxiv_id": "http://arxiv.org/abs/1801.04129v1",
    "download_url": "https://arxiv.org/abs/1801.04129v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimal Scheduling of Electric Vehicles Charging in low-Voltage Distribution Systems",
    "abstract": "Uncoordinated charging of large-scale electric vehicles (EVs) will have a negative impact on the secure and economic operation of the power system, especially at the distribution level. Given that the charging load of EVs can be controlled to some extent, research on the optimal charging control of EVs has been extensively carried out. In this paper, two possible smart charging scenarios in China are studied: centralized optimal charging operated by an aggregator and decentralized optimal charging managed by individual users. Under the assumption that the aggregators and individual users only concern the economic benefits, new load peaks will arise under time of use (TOU) pricing which is extensively employed in China. To solve this problem, a simple incentive mechanism is proposed for centralized optimal charging while a rolling-update pricing scheme is devised for decentralized optimal charging. The original optimal charging models are modified to account for the developed schemes. Simulated tests corroborate the efficacy of optimal scheduling for charging EVs in various scenarios.",
    "authors": [
      "Shaolun Xu",
      "Liang Zhang",
      "Zheng Yan",
      "Donghan Feng",
      "Gang Wang",
      "Xiaobo Zhao"
    ],
    "publication_date": "2014-10-15T00:20:10Z",
    "arxiv_id": "http://arxiv.org/abs/1410.3899v3",
    "download_url": "https://arxiv.org/abs/1410.3899v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Strategy for Power System Stability Improvement via Controlled Charge/Discharge of Plug-in Electric Vehicles",
    "abstract": "Plug-in electrical vehicles (PEV) are capable of both grid-to-vehicle (G2V) and vehicle-to-grid (V2G) power transfer. The advantages of developing V2G include an additional revenue stream for cleaner vehicles, increased stability and reliability of the electric grid, lower electric system costs, and eventually, inexpensive storage and backup for renewable electricity. Here we show how smart control of PEVs can improve the stability of power grids using only local frequency measurements. We evaluate the proposed control strategy on the IEEE Case 3 and the IEEE New England power systems. The results show that V2G leads to improved steady-state stability, larger region of stability, reduced frequency and voltage fluctuations during transients and longer critical clearing times.",
    "authors": [
      "Andrej Gajduk",
      "Vladimir Zdraveski",
      "Lasko Basnarkov",
      "Mirko Todorovski",
      "Ljupco Kocarev"
    ],
    "publication_date": "2015-06-22T13:09:24Z",
    "arxiv_id": "http://arxiv.org/abs/1506.07097v1",
    "download_url": "https://arxiv.org/abs/1506.07097v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]