[
  {
    "title": "Defining Civilization utilizing Anthropic Reasoning",
    "abstract": "We utilize anthropic reasoning to demonstrate that we are typical observers of our reference class under a self-sampling assumption by investigating the definition of what a civilization is. With reference to the conflict between such reasoning and the observational lack of extra-terrestrial intelligent life, we conclude that a part of our theoretical understanding of the Universe will be at fault.",
    "authors": [
      "Kevin A. Pimbblet"
    ],
    "publication_date": "2003-07-30T06:10:45Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0307146v1",
    "download_url": "https://arxiv.org/abs/physics/0307146v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Six Potential Game-Changers in Cyber Security: Towards Priorities in Cyber Science and Engineering",
    "abstract": "The fields of study encompassed by cyber science and engineering are broad and poorly defined at this time. As national governments and research communities increase their recognition of the importance, urgency and technical richness of these disciplines, a question of priorities arises: what specific sub-areas of research should be the foci of attention and funding? In this paper we point to an approach to answering this question. We explore results of a recent workshop that postulated possible game-changers or disruptive changes that might occur in cyber security within the next 15 years. We suggest that such game-changers may be useful in focusing attention of research communities on high-priority topics. Indeed, if a drastic, important change is likely to occur, should we not focus our research efforts on the nature and ramifications of the phenomena pertaining to that change? We illustrate each of the game-changers examples of related current research, and then offer recommendations for advancement of cyber science and engineering with respect to each of the six game-changers.",
    "authors": [
      "Alexander Kott",
      "Ananthram Swami",
      "Patrick McDaniel"
    ],
    "publication_date": "2015-11-02T14:13:24Z",
    "arxiv_id": "http://arxiv.org/abs/1511.00509v1",
    "download_url": "https://arxiv.org/abs/1511.00509v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bus Factor Explorer",
    "abstract": "Bus factor (BF) is a metric that tracks knowledge distribution in a project. It is the minimal number of engineers that have to leave for a project to stall. Despite the fact that there are several algorithms for calculating the bus factor, only a few tools allow easy calculation of bus factor and convenient analysis of results for projects hosted on Git-based providers.\n  We introduce Bus Factor Explorer, a web application that provides an interface and an API to compute, export, and explore the Bus Factor metric via treemap visualization, simulation mode, and chart editor. It supports repositories hosted on GitHub and enables functionality to search repositories in the interface and process many repositories at the same time. Our tool allows users to identify the files and subsystems at risk of stalling in the event of developer turnover by analyzing the VCS history. The application and its source code are publicly available on GitHub at https://github.com/JetBrains-Research/bus-factor-explorer. The demonstration video can be found on YouTube: https://youtu.be/uIoV79N14z8",
    "authors": [
      "Egor Klimov",
      "Muhammad Umair Ahmed",
      "Nikolai Sviridov",
      "Pouria Derakhshanfar",
      "Eray Tüzün",
      "Vladimir Kovalenko"
    ],
    "publication_date": "2024-03-12T19:21:48Z",
    "arxiv_id": "http://arxiv.org/abs/2403.08038v1",
    "download_url": "https://arxiv.org/abs/2403.08038v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generative AI and Empirical Software Engineering: A Paradigm Shift",
    "abstract": "The adoption of large language models (LLMs) and autonomous agents in software engineering marks an enduring paradigm shift. These systems create new opportunities for tool design, workflow orchestration, and empirical observation, while fundamentally reshaping the roles of developers and the artifacts they produce. Although traditional empirical methods remain central to software engineering research, the rapid evolution of AI introduces new data modalities, alters causal assumptions, and challenges foundational constructs such as \"developer\", \"artifact\", and \"interaction\". As humans and AI agents increasingly co-create, the boundaries between social and technical actors blur, and the reproducibility of findings becomes contingent on model updates and prompt contexts. This vision paper examines how the integration of LLMs into software engineering disrupts established research paradigms. We discuss how it transforms the phenomena we study, the methods and theories we rely on, the data we analyze, and the threats to validity that arise in dynamic AI-mediated environments. Our aim is to help the empirical software engineering community adapt its questions, instruments, and validation standards to a future in which AI systems are not merely tools, but active collaborators shaping software engineering and its study.",
    "authors": [
      "Christoph Treude",
      "Margaret-Anne Storey"
    ],
    "publication_date": "2025-02-12T04:13:07Z",
    "arxiv_id": "http://arxiv.org/abs/2502.08108v2",
    "download_url": "https://arxiv.org/abs/2502.08108v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Intelligent Systems and Robotics: Revolutionizing Engineering Industries",
    "abstract": "A mix of intelligent systems and robotics is making engineering industries much more efficient, precise and able to adapt. How artificial intelligence (AI), machine learning (ML) and autonomous robotic technologies are changing manufacturing, civil, electrical and mechanical engineering is discussed in this paper. Based on recent findings and a suggested way to evaluate intelligent robotic systems in industry, we give an overview of how their use impacts productivity, safety and operational costs. Experience and case studies confirm the benefits this area brings and the problems that have yet to be solved. The findings indicate that intelligent robotics involves more than a technology change; it introduces important new methods in engineering.",
    "authors": [
      "Sathish Krishna Anumula",
      "Sivaramkumar Ponnarangan",
      "Faizal Nujumudeen",
      "Ms. Nilakshi Deka",
      "S. Balamuralitharan",
      "M Venkatesh"
    ],
    "publication_date": "2025-11-10T15:44:33Z",
    "arxiv_id": "http://arxiv.org/abs/2512.00033v1",
    "download_url": "https://arxiv.org/abs/2512.00033v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Risk-Taking Software Engineer: A Framed Portrait",
    "abstract": "Background: Risk-taking is prevalent in a host of activities performed by software engineers on a daily basis, yet there is scant research on it. Aims and Method: We study if software engineers' risk-taking is affected by framing effects and by software engineers' personality. To this end, we perform a survey experiment with 124 software engineers. Results: We find that framing substantially affects their risk-taking. None of the \"Big Five\" personality traits are related to risk-taking in software engineers after correcting for multiple testing. Conclusions: Software engineers and their managers must be aware of framing effects and account for them properly.",
    "authors": [
      "Lorenz Graf-Vlachy"
    ],
    "publication_date": "2023-01-21T09:05:24Z",
    "arxiv_id": "http://arxiv.org/abs/2301.08923v1",
    "download_url": "https://arxiv.org/abs/2301.08923v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Joint Deep Reversible Regression Model and Physics-Informed Unsupervised Learning for Temperature Field Reconstruction",
    "abstract": "Temperature monitoring during the life time of heat source components in engineering systems becomes essential to guarantee the normal work and the working life of these components. However, prior methods, which mainly use the interpolate estimation to reconstruct the temperature field from limited monitoring points, require large amounts of temperature tensors for an accurate estimation. This may decrease the availability and reliability of the system and sharply increase the monitoring cost. To solve this problem, this work develops a novel physics-informed deep reversible regression models for temperature field reconstruction of heat-source systems (TFR-HSS), which can better reconstruct the temperature field with limited monitoring points unsupervisedly. First, we define the TFR-HSS task mathematically, and numerically model the task, and hence transform the task as an image-to-image regression problem. Then this work develops the deep reversible regression model which can better learn the physical information, especially over the boundary. Finally, considering the physical characteristics of heat conduction as well as the boundary conditions, this work proposes the physics-informed reconstruction loss including four training losses and jointly learns the deep surrogate model with these losses unsupervisedly. Experimental studies have conducted over typical two-dimensional heat-source systems to demonstrate the effectiveness of the proposed method.",
    "authors": [
      "Zhiqiang Gong",
      "Weien Zhou",
      "Jun Zhang",
      "Wei Peng",
      "Wen Yao"
    ],
    "publication_date": "2021-06-22T17:01:53Z",
    "arxiv_id": "http://arxiv.org/abs/2106.11929v5",
    "download_url": "https://arxiv.org/abs/2106.11929v5",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Team UTSA-NLP at SemEval 2024 Task 5: Prompt Ensembling for Argument Reasoning in Civil Procedures with GPT4",
    "abstract": "In this paper, we present our system for the SemEval Task 5, The Legal Argument Reasoning Task in Civil Procedure Challenge. Legal argument reasoning is an essential skill that all law students must master. Moreover, it is important to develop natural language processing solutions that can reason about a question given terse domain-specific contextual information. Our system explores a prompt-based solution using GPT4 to reason over legal arguments. We also evaluate an ensemble of prompting strategies, including chain-of-thought reasoning and in-context learning. Overall, our system results in a Macro F1 of .8095 on the validation dataset and .7315 (5th out of 21 teams) on the final test set. Code for this project is available at https://github.com/danschumac1/CivilPromptReasoningGPT4.",
    "authors": [
      "Dan Schumacher",
      "Anthony Rios"
    ],
    "publication_date": "2024-04-02T13:55:05Z",
    "arxiv_id": "http://arxiv.org/abs/2404.01961v1",
    "download_url": "https://arxiv.org/abs/2404.01961v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chaos Engineering in the Wild: Findings from GitHub",
    "abstract": "Chaos engineering aims to improve the resilience of software systems by intentionally injecting faults to identify and address system weaknesses that cause outages in production environments. Although many tools for chaos engineering exist, their practical adoption is not yet explored. This study examines 971 GitHub repositories that incorporate 10 popular chaos engineering tools to identify patterns and trends in their use. The analysis reveals that Toxiproxy and Chaos Mesh are the most frequently used, showing consistent growth since 2016 and reflecting increasing adoption in cloud-native development. The release of new chaos engineering tools peaked in 2018, followed by a shift toward refinement and integration, with Chaos Mesh and LitmusChaos leading in ongoing development activity. Software development is the most frequent application (58.0%), followed by unclassified purposes (16.2%), teaching (10.3%), learning (9.9%), and research (5.7%). Development-focused repositories tend to have higher activity, particularly for Toxiproxy and Chaos Mesh, highlighting their industrial relevance. Fault injection scenarios mainly address network disruptions (40.9%) and instance termination (32.7%), while application-level faults remain underrepresented (3.0%), highlighting for future exploration.",
    "authors": [
      "Joshua Owotogbe",
      "Indika Kumara",
      "Dario Di Nucci",
      "Damian Andrew Tamburri",
      "Willem-Jan van den Heuvel"
    ],
    "publication_date": "2025-05-19T18:53:25Z",
    "arxiv_id": "http://arxiv.org/abs/2505.13654v1",
    "download_url": "https://arxiv.org/abs/2505.13654v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Combining Learning from Human Feedback and Knowledge Engineering to Solve Hierarchical Tasks in Minecraft",
    "abstract": "Real-world tasks of interest are generally poorly defined by human-readable descriptions and have no pre-defined reward signals unless it is defined by a human designer. Conversely, data-driven algorithms are often designed to solve a specific, narrowly defined, task with performance metrics that drives the agent's learning. In this work, we present the solution that won first place and was awarded the most human-like agent in the 2021 NeurIPS Competition MineRL BASALT Challenge: Learning from Human Feedback in Minecraft, which challenged participants to use human data to solve four tasks defined only by a natural language description and no reward function. Our approach uses the available human demonstration data to train an imitation learning policy for navigation and additional human feedback to train an image classifier. These modules, combined with an estimated odometry map, become a powerful state-machine designed to utilize human knowledge in a natural hierarchical paradigm. We compare this hybrid intelligence approach to both end-to-end machine learning and pure engineered solutions, which are then judged by human evaluators. Codebase is available at https://github.com/viniciusguigo/kairos_minerl_basalt.",
    "authors": [
      "Vinicius G. Goecks",
      "Nicholas Waytowich",
      "David Watkins-Valls",
      "Bharat Prakash"
    ],
    "publication_date": "2021-12-07T04:12:23Z",
    "arxiv_id": "http://arxiv.org/abs/2112.03482v2",
    "download_url": "https://arxiv.org/abs/2112.03482v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Academic Search Engines: Constraints, Bugs, and Recommendation",
    "abstract": "Background: Academic search engines (i.e., digital libraries and indexers) play an increasingly important role in systematic reviews however these engines do not seem to effectively support such reviews, e.g., researchers confront usability issues with the engines when conducting their searches. Aims: To investigate whether the usability issues are bugs (i.e., faults in the search engines) or constraints, and to provide recommendations to search-engine providers and researchers on how to tackle these issues. Method: Using snowball-sampling from tertiary studies, we identify a set of 621 secondary studies in software engineering. By physically re-attempting the searches for all of these 621 studies, we effectively conduct regression testing for 42 search engines. Results: We identify 13 bugs for eight engines, and also identify other constraints. We provide recommendations for tackling these issues. Conclusions: There is still a considerable gap between the search-needs of researchers and the usability of academic search engines. It is not clear whether search-engine developers are aware of this gap. Also, the evaluation, by academics, of academic search engines has not kept pace with the development, by search-engine providers, of those search engines. Thus, the gap between evaluation and development makes it harder to properly understand the gap between the search-needs of researchers and search-features of the search engines.",
    "authors": [
      "Zheng Li",
      "Austen Rainer"
    ],
    "publication_date": "2022-11-01T10:16:25Z",
    "arxiv_id": "http://arxiv.org/abs/2211.00361v1",
    "download_url": "https://arxiv.org/abs/2211.00361v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Black holes as tools for quantum computing by advanced extraterrestrial civilizations",
    "abstract": "We explain that black holes are the most efficient capacitors of quantum information. It is thereby expected that all sufficiently advanced civilizations ultimately employ black holes in their quantum computers. The accompanying Hawking radiation is democratic in particle species. Due to this, the alien quantum computers will radiate in ordinary particles such as neutrinos and photons within the range of potential sensitivity of our detectors. This offers a new avenue for SETI, including the civilizations entirely composed of hidden particles species interacting with our world exclusively through gravity.",
    "authors": [
      "Gia Dvali",
      "Zaza N. Osmanov"
    ],
    "publication_date": "2023-01-19T18:54:11Z",
    "arxiv_id": "http://arxiv.org/abs/2301.09575v3",
    "download_url": "https://arxiv.org/abs/2301.09575v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering problems in machine learning systems",
    "abstract": "Fatal accidents are a major issue hindering the wide acceptance of safety-critical systems that employ machine learning and deep learning models, such as automated driving vehicles. In order to use machine learning in a safety-critical system, it is necessary to demonstrate the safety and security of the system through engineering processes. However, thus far, no such widely accepted engineering concepts or frameworks have been established for these systems. The key to using a machine learning model in a deductively engineered system is decomposing the data-driven training of machine learning models into requirement, design, and verification, particularly for machine learning models used in safety-critical systems. Simultaneously, open problems and relevant technical fields are not organized in a manner that enables researchers to select a theme and work on it. In this study, we identify, classify, and explore the open problems in engineering (safety-critical) machine learning systems --- that is, in terms of requirement, design, and verification of machine learning models and systems --- as well as discuss related works and research directions, using automated driving vehicles as an example. Our results show that machine learning models are characterized by a lack of requirements specification, lack of design specification, lack of interpretability, and lack of robustness. We also perform a gap analysis on a conventional system quality standard SQuARE with the characteristics of machine learning models to study quality models for machine learning systems. We find that a lack of requirements specification and lack of robustness have the greatest impact on conventional quality models.",
    "authors": [
      "Hiroshi Kuwajima",
      "Hirotoshi Yasuoka",
      "Toshihiro Nakae"
    ],
    "publication_date": "2019-04-01T13:57:27Z",
    "arxiv_id": "http://arxiv.org/abs/1904.00001v2",
    "download_url": "https://arxiv.org/abs/1904.00001v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On a Factorial Knowledge Architecture for Data Science-powered Software Engineering",
    "abstract": "Given the data-intensive and collaborative trend in science, the software engineering community also pays increasing attention to obtaining valuable and useful insights from data repositories. Nevertheless, applying data science to software engineering (e.g., mining software repositories) can be blindfold and meaningless, if lacking a suitable knowledge architecture (KA). By observing that software engineering practices are generally recorded through a set of factors (e.g., programmer capacity, different environmental conditions, etc.) involved in various software project aspects, we propose a factor-based hierarchical KA of software engineering to help maximize the value of software repositories and inspire future software data-driven studies. In particular, it is the organized factors and their relationships that help guide software engineering knowledge mining, while the mined knowledge will in turn be indexed/managed through the relevant factors and their interactions. This paper explains our idea about the factorial KA and concisely demonstrates a KA component, i.e. the early-version KA of software product engineering. Once fully scoped, this proposed KA will supplement the well-known SWEBOK in terms of both the factor-centric knowledge management and the coverage/implication of potential software engineering knowledge.",
    "authors": [
      "Zheng Li"
    ],
    "publication_date": "2021-03-02T00:57:49Z",
    "arxiv_id": "http://arxiv.org/abs/2103.01387v1",
    "download_url": "https://arxiv.org/abs/2103.01387v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards ML Engineering: A Brief History Of TensorFlow Extended (TFX)",
    "abstract": "Software Engineering, as a discipline, has matured over the past 5+ decades. The modern world heavily depends on it, so the increased maturity of Software Engineering was an eventuality. Practices like testing and reliable technologies help make Software Engineering reliable enough to build industries upon. Meanwhile, Machine Learning (ML) has also grown over the past 2+ decades. ML is used more and more for research, experimentation and production workloads. ML now commonly powers widely-used products integral to our lives. But ML Engineering, as a discipline, has not widely matured as much as its Software Engineering ancestor. Can we take what we have learned and help the nascent field of applied ML evolve into ML Engineering the way Programming evolved into Software Engineering [1]? In this article we will give a whirlwind tour of Sibyl [2] and TensorFlow Extended (TFX) [3], two successive end-to-end (E2E) ML platforms at Alphabet. We will share the lessons learned from over a decade of applied ML built on these platforms, explain both their similarities and their differences, and expand on the shifts (both mental and technical) that helped us on our journey. In addition, we will highlight some of the capabilities of TFX that help realize several aspects of ML Engineering. We argue that in order to unlock the gains ML can bring, organizations should advance the maturity of their ML teams by investing in robust ML infrastructure and promoting ML Engineering education. We also recommend that before focusing on cutting-edge ML modeling techniques, product leaders should invest more time in adopting interoperable ML platforms for their organizations. In closing, we will also share a glimpse into the future of TFX.",
    "authors": [
      "Konstantinos",
      "Katsiapis",
      "Abhijit Karmarkar",
      "Ahmet Altay",
      "Aleksandr Zaks",
      "Neoklis Polyzotis",
      "Anusha Ramesh",
      "Ben Mathes",
      "Gautam Vasudevan",
      "Irene Giannoumis",
      "Jarek Wilkiewicz",
      "Jiri Simsa",
      "Justin Hong",
      "Mitch Trott",
      "Noé Lutz",
      "Pavel A. Dournov",
      "Robert Crowe",
      "Sarah Sirajuddin",
      "Tris Brian Warkentin",
      "Zhitao Li"
    ],
    "publication_date": "2020-09-28T23:29:07Z",
    "arxiv_id": "http://arxiv.org/abs/2010.02013v2",
    "download_url": "https://arxiv.org/abs/2010.02013v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Qualitative software engineering research -- reflections and guidelines",
    "abstract": "Researchers are increasingly recognizing the importance of human aspects in software development. Since qualitative methods are used to explore human behavior in-depth, we believe that studies using such methods will become more common. Existing qualitative software engineering guidelines do not cover the full breadth of qualitative methods and the knowledge on how to use them like in social sciences.\n  The purpose of this study was to extend the software engineering community's current body of knowledge regarding available qualitative methods and their quality assurance frameworks, and to provide recommendations and guidelines for their use. With the support of an epistemological argument and a survey of the literature, we suggest that future research would benefit from (1) utilizing a broader set of research methods, (2) more strongly emphasizing reflexivity, and (3) employing qualitative guidelines and quality criteria.\n  We present an overview of three qualitative methods commonly used in social sciences but rarely seen in software engineering research, namely interpretative phenomenological analysis, narrative analysis, and discourse analysis. Furthermore, we discuss the meaning of reflexivity in relation to the software engineering context and suggest means of fostering it.\n  Our paper will help software engineering researchers better select and then guide the application of a broader set of qualitative research methods.",
    "authors": [
      "Per Lenberg",
      "Robert Feldt",
      "Lucas Gren",
      "Lars Göran Wallgren Tengberg",
      "Inga Tidefors",
      "Daniel Graziotin"
    ],
    "publication_date": "2017-12-22T08:40:19Z",
    "arxiv_id": "http://arxiv.org/abs/1712.08341v3",
    "download_url": "https://arxiv.org/abs/1712.08341v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the validity of pre-trained transformers for natural language processing in the software engineering domain",
    "abstract": "Transformers are the current state-of-the-art of natural language processing in many domains and are using traction within software engineering research as well. Such models are pre-trained on large amounts of data, usually from the general domain. However, we only have a limited understanding regarding the validity of transformers within the software engineering domain, i.e., how good such models are at understanding words and sentences within a software engineering context and how this improves the state-of-the-art. Within this article, we shed light on this complex, but crucial issue. We compare BERT transformer models trained with software engineering data with transformers based on general domain data in multiple dimensions: their vocabulary, their ability to understand which words are missing, and their performance in classification tasks. Our results show that for tasks that require understanding of the software engineering context, pre-training with software engineering data is valuable, while general domain models are sufficient for general language understanding, also within the software engineering domain.",
    "authors": [
      "Julian von der Mosel",
      "Alexander Trautsch",
      "Steffen Herbold"
    ],
    "publication_date": "2021-09-10T08:46:31Z",
    "arxiv_id": "http://arxiv.org/abs/2109.04738v2",
    "download_url": "https://arxiv.org/abs/2109.04738v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Green Prompt Engineering: Investigating the Energy Impact of Prompt Design in Software Engineering",
    "abstract": "Language Models are increasingly applied in software engineering, yet their inference raises growing environmental concerns. Prior work has examined hardware choices and prompt length, but little attention has been paid to linguistic complexity as a sustainability factor. This paper introduces Green Prompt Engineering, framing linguistic complexity as a design dimension that can influence energy consumption and performance. We conduct an empirical study on requirement classification using open-source Small Language Models, varying the readability of prompts. Our results reveal that readability affects environmental sustainability and performance, exposing trade-offs between them. For practitioners, simpler prompts can reduce energy costs without a significant F1-score loss; for researchers, it opens a path toward guidelines and studies on sustainable prompt design within the Green AI agenda.",
    "authors": [
      "Vincenzo De Martino",
      "Mohammad Amin Zadenoori",
      "Xavier Franch",
      "Alessio Ferrari"
    ],
    "publication_date": "2025-09-26T13:19:33Z",
    "arxiv_id": "http://arxiv.org/abs/2509.22320v1",
    "download_url": "https://arxiv.org/abs/2509.22320v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Upper limits on transmitter rate of extragalactic civilizations placed by Breakthrough Listen observations",
    "abstract": "The Search for Extra-Terrestrial Intelligence (SETI) has been conducted for over sixty years, yet no technosignatures have been identified. Previous studies have focused on stars in our galaxy, with few searches in the extragalactic Universe despite a larger volume being available. Civilizations capable of harvesting energy from a star or a galaxy are classified as KII or KIII on the Kardashev scale, respectively. Technosignatures from such advanced civilizations would be extremely luminous and detectable by current radio telescopes, even from distant galaxies. To explore the frontier of extragalactic SETI, we investigate the likely prevalence of extragalactic civilizations possessing a radio transmitter, known as the transmitter rate, based on observational results from the Breakthrough Listen (BL) observations. We calculated the transmitter rate by considering the background galaxies in the field of view of target stars in BL observations. We used a statistical method to derive the total mass of stars in those background galaxies from a galaxy stellar mass function. Our statistical method suggests that less than one in hundreds of trillions of extragalactic civilizations within 969 Mpc possess a radio transmitter above 7.7$\\times$10$^{26}$ W of power, assuming one civilization per one-solar-mass stellar system. Additionally, we cross-matched the BL survey fields with the WISE$\\times$SuperCOSMOS Photometric Redshift Catalogue and compared with the statistical method. Our result sets the strictest limits to date on the transmitter rate at such high power levels, emphasizing the high efficiency of searching for radio transmitters in galaxies and the rarity of technologically advanced civilizations in our Universe.",
    "authors": [
      "Yuri Uno",
      "Tetsuya Hashimoto",
      "Tomotsugu Goto",
      "Simon C. -C. Ho",
      "Tzu-Yin Hsu",
      "Ross Burns"
    ],
    "publication_date": "2023-04-05T21:39:43Z",
    "arxiv_id": "http://arxiv.org/abs/2304.02756v2",
    "download_url": "https://arxiv.org/abs/2304.02756v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Many-Objective Software Remodularization using NSGA-III",
    "abstract": "Software systems nowadays are complex and difficult to maintain due to continuous changes and bad design choices. To handle the complexity of systems, software products are, in general, decomposed in terms of packages/modules containing classes that are dependent. However, it is challenging to automatically remodularize systems to improve their maintainability. The majority of existing remodularization work mainly satisfy one objective which is improving the structure of packages by optimizing coupling and cohesion. In addition, most of existing studies are limited to only few operation types such as move class and split packages. Many other objectives, such as the design semantics, reducing the number of changes and maximizing the consistency with development change history, are important to improve the quality of the software by remodularizing it. In this paper, we propose a novel many-objective search-based approach using NSGA-III. The process aims at finding the optimal remodularization solutions that improve the structure of packages, minimize the number of changes, preserve semantics coherence, and re-use the history of changes. We evaluate the efficiency of our approach using four different open-source systems and one automotive industry project, provided by our industrial partner, through a quantitative and qualitative study conducted with software engineers.",
    "authors": [
      "Mohamed Wiem Mkaouer",
      "Marouane Kessentini",
      "Adnan Shaout",
      "Patrice Koligheu",
      "Slim Bechikh",
      "Kalyanmoy Deb",
      "Ali Ouni"
    ],
    "publication_date": "2020-05-13T18:34:15Z",
    "arxiv_id": "http://arxiv.org/abs/2005.06510v1",
    "download_url": "https://arxiv.org/abs/2005.06510v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generative Artificial Intelligence for Software Engineering -- A Research Agenda",
    "abstract": "Generative Artificial Intelligence (GenAI) tools have become increasingly prevalent in software development, offering assistance to various managerial and technical project activities. Notable examples of these tools include OpenAIs ChatGPT, GitHub Copilot, and Amazon CodeWhisperer. Although many recent publications have explored and evaluated the application of GenAI, a comprehensive understanding of the current development, applications, limitations, and open challenges remains unclear to many. Particularly, we do not have an overall picture of the current state of GenAI technology in practical software engineering usage scenarios. We conducted a literature review and focus groups for a duration of five months to develop a research agenda on GenAI for Software Engineering. We identified 78 open Research Questions (RQs) in 11 areas of Software Engineering. Our results show that it is possible to explore the adoption of GenAI in partial automation and support decision-making in all software development activities. While the current literature is skewed toward software implementation, quality assurance and software maintenance, other areas, such as requirements engineering, software design, and software engineering education, would need further research attention. Common considerations when implementing GenAI include industry-level assessment, dependability and accuracy, data accessibility, transparency, and sustainability aspects associated with the technology. GenAI is bringing significant changes to the field of software engineering. Nevertheless, the state of research on the topic still remains immature. We believe that this research agenda holds significance and practical value for informing both researchers and practitioners about current applications and guiding future research.",
    "authors": [
      "Anh Nguyen-Duc",
      "Beatriz Cabrero-Daniel",
      "Adam Przybylek",
      "Chetan Arora",
      "Dron Khanna",
      "Tomas Herda",
      "Usman Rafiq",
      "Jorge Melegati",
      "Eduardo Guerra",
      "Kai-Kristian Kemell",
      "Mika Saari",
      "Zheying Zhang",
      "Huy Le",
      "Tho Quan",
      "Pekka Abrahamsson"
    ],
    "publication_date": "2023-10-28T09:14:39Z",
    "arxiv_id": "http://arxiv.org/abs/2310.18648v1",
    "download_url": "https://arxiv.org/abs/2310.18648v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Aligning Models with Their Realization through Model-based Systems Engineering",
    "abstract": "In this paper, we propose a method for aligning models with their realization through the application of model-based systems engineering. Our approach is divided into three steps. (1) Firstly, we leverage domain expertise and the Unified Architecture Framework to establish a reference model that fundamentally describes some domain. (2) Subsequently, we instantiate the reference model as specific models tailored to different scenarios within the domain. (3) Finally, we incorporate corresponding run logic directly into both the reference model and the specific models. In total, we thus provide a practical means to ensure that every implementation result is justified by business demand. We demonstrate our approach using the example of maritime object detection as a specific application (specific model / implementation element) of automatic target recognition as a service reoccurring in various forms (reference model element). Our approach facilitates a more seamless integration of models and implementation, fostering enhanced Business-IT alignment.",
    "authors": [
      "Lovis Justin Immanuel Zenz",
      "Erik Heiland",
      "Peter Hillmann",
      "Andreas Karcher"
    ],
    "publication_date": "2024-06-18T06:50:36Z",
    "arxiv_id": "http://arxiv.org/abs/2407.09513v1",
    "download_url": "https://arxiv.org/abs/2407.09513v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Performance Engineering for Foundation Model-Powered Software (FMware)",
    "abstract": "The rise of Foundation Models (FMs) like Large Language Models (LLMs) is revolutionizing software development. Despite the impressive prototypes, transforming FMware into production-ready products demands complex engineering across various domains. A critical but overlooked aspect is performance engineering, which aims at ensuring FMware meets performance goals such as throughput and latency to avoid user dissatisfaction and financial loss. Often, performance considerations are an afterthought, leading to costly optimization efforts post-deployment. FMware's high computational resource demands highlight the need for efficient hardware use. Continuous performance engineering is essential to prevent degradation. This paper highlights the significance of Software Performance Engineering (SPE) in FMware, identifying four key challenges: cognitive architecture design, communication protocols, tuning and optimization, and deployment. These challenges are based on literature surveys and experiences from developing an in-house FMware system. We discuss problems, current practices, and innovative paths for the software engineering community.",
    "authors": [
      "Haoxiang Zhang",
      "Shi Chang",
      "Arthur Leung",
      "Kishanthan Thangarajah",
      "Boyuan Chen",
      "Hanan Lutfiyya",
      "Ahmed E. Hassan"
    ],
    "publication_date": "2024-11-14T16:42:19Z",
    "arxiv_id": "http://arxiv.org/abs/2411.09580v1",
    "download_url": "https://arxiv.org/abs/2411.09580v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Attributes of a Great Requirements Engineer",
    "abstract": "[Context and Motivation] Several studies have investigated attributes of great software practitioners. However, the investigation of such attributes is still missing in Requirements Engineering (RE). The current knowledge on attributes of great software practitioners might not be easily translated to the context of RE because its activities are, usually, less technical and more human-centered than other software engineering activities. [Question/Problem] This work aims to investigate which are the attributes of great requirements engineers, the relationship between them, and strategies that can be employed to obtain these attributes. We follow a method composed of a survey with 18 practitioners and follow up interviews with 11 of them. [Principal Ideas/Results] Investigative ability in talking to stakeholders, judicious, and understand the business are the most commonly mentioned attributes amongst the set of 22 attributes identified, which were grouped into four categories. We also found 38 strategies to improve RE skills. Examples are training, talking to all stakeholders, and acquiring domain knowledge. [Contribution] The attributes, their categories, and relationships are organized into a map. The relations between attributes and strategies are represented in a Sankey diagram. Software practitioners can use our findings to improve their understanding about the role and responsibilities of requirements engineers.",
    "authors": [
      "Larissa Barbosa",
      "Sávio Freire",
      "Rita S. P. Maciel",
      "Manoel Mendonça",
      "Marcos Kalinowski",
      "Zadia Codabux",
      "Rodrigo Spínola"
    ],
    "publication_date": "2024-11-01T18:33:24Z",
    "arxiv_id": "http://arxiv.org/abs/2411.00966v1",
    "download_url": "https://arxiv.org/abs/2411.00966v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deconcentration of Attention: Addressing the Complexity of Software Engineering",
    "abstract": "This article attempts to describe specific mental techniques that are related to resolving very complex tasks in software engineering. This subject may be familiar to some software specialists to different extents; however, there is currently no common consensus and popular terminology for this subject area. In this article, the area is charted from a practical usability perspective.\n  This article also proposes to treat software engineering itself as research on human thinking because software is meant to simulate thinking.",
    "authors": [
      "Igor Kusakov"
    ],
    "publication_date": "2012-01-27T10:11:23Z",
    "arxiv_id": "http://arxiv.org/abs/1201.5735v1",
    "download_url": "https://arxiv.org/abs/1201.5735v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rapid Reviews in Software Engineering",
    "abstract": "Integrating research evidence into practice is one of the main goals of Evidence-Based Software Engineering (EBSE). Secondary studies, one of the main EBSE products, are intended to summarize the best research evidence and make them easily consumable by practitioners. However, recent studies show that some secondary studies lack connections with software engineering practice. In this chapter, we present the concept of Rapid Reviews, which are lightweight secondary studies focused on delivering evidence to practitioners in a timely manner. Rapid reviews support practitioners in their decision-making, and should be conducted bounded to a practical problem, inserted into a practical context. Thus, Rapid Reviews can be easily integrated in a knowledge/technology transfer initiative. After describing the basic concepts, we present the results and experiences of conducting two Rapid Reviews. We also provide guidelines to help researchers and practitioners who want to conduct Rapid Reviews, and we finally discuss topics that my concern the research community about the feasibility of Rapid Reviews as an Evidence-Based method. In conclusion, we believe Rapid Reviews might interest researchers and practitioners working in the intersection between software engineering research and practice.",
    "authors": [
      "Bruno Cartaxo",
      "Gustavo Pinto",
      "Sergio Soares"
    ],
    "publication_date": "2020-03-22T21:55:44Z",
    "arxiv_id": "http://arxiv.org/abs/2003.10006v1",
    "download_url": "https://arxiv.org/abs/2003.10006v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Flipped Classroom Approach to Teaching Empirical Software Engineering",
    "abstract": "Contribution: A flipped classroom approach to teaching empirical software engineering increases student learning by providing more time for active learning in class. Background: There is a need for longitudinal studies of the flipped classroom approach in general. Although a few cross-sectional studies show that a flipped classroom approach can increase student learning by providing more time for other in-class activities, such as active learning, such studies are also rare in the context of teaching software engineering. Intended outcomes: To assess the usefulness of a flipped classroom approach in teaching software engineering. Application design: The study was conducted at an international Master's program in Sweden, given in English, and partially replicated at a university in Africa. Findings: The results suggest that students' academic success, as measured by their exam grades, can be improved by introducing a flipped classroom to teach software engineering topics, but this may not extend to their subjective liking of the material, as measured by student evaluations. Furthermore, the effect of the change in teaching methodology was not replicated when changing the teaching team.",
    "authors": [
      "Lucas Gren"
    ],
    "publication_date": "2019-12-08T19:32:17Z",
    "arxiv_id": "http://arxiv.org/abs/1912.03746v2",
    "download_url": "https://arxiv.org/abs/1912.03746v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "\"PROCESS\": a systems code for fusion power plants - Part 2:Engineering",
    "abstract": "PROCESS is a reactor systems code - it assesses the engineering and economic viability of a hypothetical fusion power station using simple models of all parts of a reactor system. PROCESS allows the user to choose which constraints to impose and which to ignore, so when evaluating the results it is vital to study the list of constraints used. New algorithms submitted by collaborators can be incorporated - for example safety, first wall erosion, and fatigue life will be crucial and are not yet taken into account. This paper describes algorithms relating to the engineering aspects of the plant. The toroidal field (TF) coils and the central solenoid are assumed by default to be wound from niobium-tin superconductor with the same properties as the ITER conductors. The winding temperature and induced voltage during a quench provide a limit on the current density in the TF coils. Upper limits are placed on the stresses in the structural materials of the TF coil, using a simple two-layer model of the inboard leg of the coil. The thermal efficiency of the plant can be estimated using the maximum coolant temperature, and the capacity factor is derived from estimates of the planned and unplanned downtime, and the duty cycle if the reactor is pulsed. An example of a pulsed power plant is given.",
    "authors": [
      "M Kovari",
      "F. Fox",
      "C. Harrington",
      "R. Kembleton",
      "P. Knight",
      "H. Lux",
      "J. Morris"
    ],
    "publication_date": "2016-01-21T15:05:25Z",
    "arxiv_id": "http://arxiv.org/abs/1601.06147v1",
    "download_url": "https://arxiv.org/abs/1601.06147v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prompt Design and Engineering: Introduction and Advanced Methods",
    "abstract": "Prompt design and engineering has rapidly become essential for maximizing the potential of large language models. In this paper, we introduce core concepts, advanced techniques like Chain-of-Thought and Reflection, and the principles behind building LLM-based agents. Finally, we provide a survey of tools for prompt engineers.",
    "authors": [
      "Xavier Amatriain"
    ],
    "publication_date": "2024-01-24T06:20:18Z",
    "arxiv_id": "http://arxiv.org/abs/2401.14423v4",
    "download_url": "https://arxiv.org/abs/2401.14423v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Supporting Requirements Engineering Research that Industry Needs: The Naming the Pain in Requirements Engineering Initiative",
    "abstract": "In light of the 40th jubilee of Requirements Engineering (RE), roughly 40 experts met in Switzerland to discuss where our discipline stands today. As of today, the common view is, indisputably, that RE as a discipline is stable and respected, as pointed out by Sarah Gregory when covering the seminar in her column to which articles like this one are invited to present ongoing research. However, it is also evident that after 40 years of promising research, conducting research that industry needs is still an ongoing challenge. Research that industry needs means research that solves industrial problems practitioners face; but do we really understand those problems? Here, I want to recapitulate on this research challenge and outline an initiative, the Naming the Pain in Requirements Engineering Initiative, that aims at tackling this problem.",
    "authors": [
      "Daniel Méndez Fernández"
    ],
    "publication_date": "2017-10-12T17:30:07Z",
    "arxiv_id": "http://arxiv.org/abs/1710.04630v1",
    "download_url": "https://arxiv.org/abs/1710.04630v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Verbal Autopsy in Civil Registration and Vital Statistics: The Symptom-Cause Information Archive",
    "abstract": "The burden of disease is fundamental to understanding, prioritizing, and monitoring public health interventions. Cause of death is required to calculate the burden of disease, but in many parts of the developing world deaths are neither detected nor given a cause. Verbal autopsy is a feasible way of assigning a cause to a death based on an interview with those who cared for the person who died. As civil registration and vital statistics systems improve in the developing world, verbal autopsy is playing and increasingly important role in providing information about cause of death and the burden of disease. This note motivates the creation of a global symptom-cause archive containing reference deaths with both a verbal autopsy and a cause assigned through an independent mechanism. This archive could provide training and validation data for refining, developing, and testing machine-based algorithms to automate cause assignment from verbal autopsy data. This, in turn, would improve the comparability of machine-assigned causes and provide a means to fine-tune individual cause assignment within specific contexts.",
    "authors": [
      "Samuel J. Clark",
      "Martin W. Bratschi",
      "Philip Setel",
      "Carla Abouzahr",
      "Don de Savigny",
      "Zehang Li",
      "Tyler McCormick",
      "Peter Byass",
      "Daniel Chandramohan"
    ],
    "publication_date": "2019-10-01T14:07:40Z",
    "arxiv_id": "http://arxiv.org/abs/1910.00405v2",
    "download_url": "https://arxiv.org/abs/1910.00405v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhancing Collaboration for Software Engineers through Matching",
    "abstract": "In recent years, the field of software engineering has experienced a considerable increase in demand for competent experts, resulting in an increased demand for platforms that connect software engineers and facilitate collaboration. In response to this necessity, in this paper we present a project to solve the lack of a proper one-stop connection platform for software engineers and promoting collaborative learning and upskilling. The idea of the project is to develop a web-based application (NEXAS) that would facilitate connecting and collaborating between software engineers. The application would perform algorithmic matching to suggest user connections based on their technical profiles and interests. The users can filter profiles, discover open projects, and form collaboration groups. Using this application will enable users to connect with peers having similar interests, thereby creating a community network tailored exclusively for software engineers.",
    "authors": [
      "Nayaab Azim",
      "Sadath Ullah Khan Mohammed",
      "Evan Phaup",
      "Adeyemi Aina"
    ],
    "publication_date": "2025-02-22T18:20:52Z",
    "arxiv_id": "http://arxiv.org/abs/2502.16316v1",
    "download_url": "https://arxiv.org/abs/2502.16316v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pulse-engineered Controlled-V gate and its applications on superconducting quantum device",
    "abstract": "In this paper, we demonstrate that, by employing OpenPulse design kit for IBM superconducting quantum devices, the controlled-V gate (CV gate) can be implemented in about half the gate time to the controlled-X (CX or CNOT gate) and consequently 65.5\\% reduced gate time compared to the CX-based implementation of CV. Then, based on the theory of Cartan decomposition, we characterize the set of all two-qubit gates implemented with only two or three CV gates; using pulse-engineered CV gates enables us to implement these gates with shorter gate time and possibly better gate fidelity than the CX-based one, as actually demonstrated in two examples. Moreover, we showcase the improvement of linearly-coupled three-qubit Toffoli gate, by implementing it with the pulse-engineered CV gate, both in gate time and the averaged output-state fidelity. These results imply the importance of our CV gate implementation technique, which, as an additional option for the basis gate set design, may shorten the overall computation time and consequently improve the precision of several quantum algorithms executed on a real device.",
    "authors": [
      "Takahiko Satoh",
      "Shun Oomura",
      "Michihiko Sugawara",
      "Naoki Yamamoto"
    ],
    "publication_date": "2021-02-11T16:56:56Z",
    "arxiv_id": "http://arxiv.org/abs/2102.06117v3",
    "download_url": "https://arxiv.org/abs/2102.06117v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Can GPT-4 Replicate Empirical Software Engineering Research?",
    "abstract": "Empirical software engineering research on production systems has brought forth a better understanding of the software engineering process for practitioners and researchers alike. However, only a small subset of production systems is studied, limiting the impact of this research. While software engineering practitioners could benefit from replicating research on their own data, this poses its own set of challenges, since performing replications requires a deep understanding of research methodologies and subtle nuances in software engineering data. Given that large language models (LLMs), such as GPT-4, show promise in tackling both software engineering- and science-related tasks, these models could help replicate and thus democratize empirical software engineering research.\n  In this paper, we examine GPT-4's abilities to perform replications of empirical software engineering research on new data. We study their ability to surface assumptions made in empirical software engineering research methodologies, as well as their ability to plan and generate code for analysis pipelines on seven empirical software engineering papers. We perform a user study with 14 participants with software engineering research expertise, who evaluate GPT-4-generated assumptions and analysis plans (i.e., a list of module specifications) from the papers. We find that GPT-4 is able to surface correct assumptions, but struggles to generate ones that apply common knowledge about software engineering data. In a manual analysis of the generated code, we find that the GPT-4-generated code contains correct high-level logic, given a subset of the methodology. However, the code contains many small implementation-level errors, reflecting a lack of software engineering knowledge. Our findings have implications for leveraging LLMs for software engineering research as well as practitioner data scientists in software teams.",
    "authors": [
      "Jenny T. Liang",
      "Carmen Badea",
      "Christian Bird",
      "Robert DeLine",
      "Denae Ford",
      "Nicole Forsgren",
      "Thomas Zimmermann"
    ],
    "publication_date": "2023-10-03T01:27:23Z",
    "arxiv_id": "http://arxiv.org/abs/2310.01727v3",
    "download_url": "https://arxiv.org/abs/2310.01727v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Archimedes-AUEB at SemEval-2024 Task 5: LLM explains Civil Procedure",
    "abstract": "The SemEval task on Argument Reasoning in Civil Procedure is challenging in that it requires understanding legal concepts and inferring complex arguments. Currently, most Large Language Models (LLM) excelling in the legal realm are principally purposed for classification tasks, hence their reasoning rationale is subject to contention. The approach we advocate involves using a powerful teacher-LLM (ChatGPT) to extend the training dataset with explanations and generate synthetic data. The resulting data are then leveraged to fine-tune a small student-LLM. Contrary to previous work, our explanations are not directly derived from the teacher's internal knowledge. Instead they are grounded in authentic human analyses, therefore delivering a superior reasoning signal. Additionally, a new `mutation' method generates artificial data instances inspired from existing ones. We are publicly releasing the explanations as an extension to the original dataset, along with the synthetic dataset and the prompts that were used to generate both. Our system ranked 15th in the SemEval competition. It outperforms its own teacher and can produce explanations aligned with the original human analyses, as verified by legal experts.",
    "authors": [
      "Odysseas S. Chlapanis",
      "Ion Androutsopoulos",
      "Dimitrios Galanis"
    ],
    "publication_date": "2024-05-14T11:04:16Z",
    "arxiv_id": "http://arxiv.org/abs/2405.08502v1",
    "download_url": "https://arxiv.org/abs/2405.08502v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fuzzy Mutation Embedded Hybrids of Gravitational Search and Particle Swarm Optimization Methods for Engineering Design Problems",
    "abstract": "Gravitational Search Algorithm (GSA) and Particle Swarm Optimization (PSO) are nature-inspired, swarm-based optimization algorithms respectively. Though they have been widely used for single-objective optimization since their inception, they suffer from premature convergence. Even though the hybrids of GSA and PSO perform much better, the problem remains. Hence, to solve this issue we have proposed a fuzzy mutation model for two hybrid versions of PSO and GSA - Gravitational Particle Swarm (GPS) and PSOGSA. The developed algorithms are called Mutation based GPS (MGPS) and Mutation based PSOGSA (MPSOGSA). The mutation operator is based on a fuzzy model where the probability of mutation has been calculated based on the closeness of particle to population centroid and improvement in the particle value. We have evaluated these two new algorithms on 23 benchmark functions of three categories (unimodal, multi-modal and multi-modal with fixed dimension). The experimental outcome shows that our proposed model outperforms their corresponding ancestors, MGPS outperforms GPS 13 out of 23 times (56.52%) and MPSOGSA outperforms PSOGSA 17 times out of 23 (73.91 %). We have also compared our results against those of recent optimization algorithms such as Sine Cosine Algorithm (SCA), Opposition-Based SCA, and Volleyball Premier League Algorithm (VPL). In addition, we have applied our proposed algorithms on some classic engineering design problems and the outcomes are satisfactory. The related codes of the proposed algorithms can be found in this link: Fuzzy-Mutation-Embedded-Hybrids-of-GSA-and-PSO.",
    "authors": [
      "Devroop Kar",
      "Manosij Ghosh",
      "Ritam Guha",
      "Ram Sarkar",
      "Laura García-Hernández",
      "Ajith Abraham"
    ],
    "publication_date": "2020-05-10T07:42:36Z",
    "arxiv_id": "http://arxiv.org/abs/2005.04599v1",
    "download_url": "https://arxiv.org/abs/2005.04599v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Web-based modeling tool for the SEMAT Essence theory of Software Engineering",
    "abstract": "As opposed to more mature subjects, software engineering lacks general theories to establish its foundations as a discipline. The Essence Theory of software engineering (Essence) has been proposed by the Software Engineering Methods and Theory (SEMAT) initiative. Essence goal is to develop a theoretically sound basis for software engineering practice and its wide adoption. Essence is yet far from reaching academic and industry adoption. Reasons include a struggle to foresee its utilization potential and the lack of tools implementing it. SEMAT Accelerator (SematAcc) is a Web-positioning tool for a software engineering endeavor, which implements the SEMAT's Essence kernel. SematAcc allows using Essence, thus helping to understand it. The tool enables teaching, adopting, and researching Essence in controlled experiments and case studies.",
    "authors": [
      "Daniel Graziotin",
      "Pekka Abrahamsson"
    ],
    "publication_date": "2013-07-08T13:00:36Z",
    "arxiv_id": "http://arxiv.org/abs/1307.2075v2",
    "download_url": "https://arxiv.org/abs/1307.2075v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reliability Testing Strategy - Reliability in Software Engineering",
    "abstract": "This paper presents the core principles of reliability in software engineering - outlining why reliability testing is critical and specifying the process of measuring reliability. The paper provides insight for both novice and experts in the software engineering field for assessing failure intensity as well as predicting failure of software systems. Measurements are conducted by utilizing information from an operational profile to further enhance a test plan and test cases, all of which this paper demonstrates how to implement.",
    "authors": [
      "Kevin Taylor-Sakyi"
    ],
    "publication_date": "2016-05-03T21:33:11Z",
    "arxiv_id": "http://arxiv.org/abs/1605.01097v1",
    "download_url": "https://arxiv.org/abs/1605.01097v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Survey of Software Engineering Practices in Turkey (extended version)",
    "abstract": "Context: Understanding the types of software engineering practices and techniques used in the industry is important. There is a wide spectrum in terms of the types and maturity of software engineering practices conducted in each software team and company. To characterize the type of software engineering practices conducted in software firms, a variety of surveys have been conducted in different countries and regions. Turkey has a vibrant software industry and it is important to characterize and understand the state of software engineering practices in this industry. Objective: Our objective is to characterize and grasp a high-level view on type of software engineering practices in the Turkish software industry. Among the software engineering practices that we have surveyed in this study are the followings: software requirements, design, development, testing, maintenance, configuration management, release planning and support practices. The current survey is the most comprehensive of its type ever conducted in the context of Turkish software industry. Method: To achieve the above objective, we systematically designed an online survey with 46 questions based on our past experience in the Canadian and Turkish contexts and using the Software Engineering Body of Knowledge (SWEBOK). 202 practicing software engineers from the Turkish software industry participated in the survey. We analyze and report in this paper the results of the questions. Whenever possible, we also compare the trends and results of our survey with the results of a similar 2010 survey conducted in the Canadian software industry.",
    "authors": [
      "Vahid Garousi",
      "Ahmet Coşkunçay",
      "Aysu Betin-Can",
      "Onur Demirörs"
    ],
    "publication_date": "2014-12-15T15:58:15Z",
    "arxiv_id": "http://arxiv.org/abs/1412.4648v2",
    "download_url": "https://arxiv.org/abs/1412.4648v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Progression Model of Software Engineering Goals, Challenges, and Practices in Start-Ups",
    "abstract": "Context: Software start-ups are emerging as suppliers of innovation and software-intensive products. However, traditional software engineering practices are not evaluated in the context, nor adopted to goals and challenges of start-ups. As a result, there is insufficient support for software engineering in the start-up context. Objective: We aim to collect data related to engineering goals, challenges, and practices in start-up companies to ascertain trends and patterns characterizing engineering work in start-ups. Such data allows researchers to understand better how goals and challenges are related to practices. This understanding can then inform future studies aimed at designing solutions addressing those goals and challenges. Besides, these trends and patterns can be useful for practitioners to make more informed decisions in their engineering practice. Method: We use a case survey method to gather first-hand, in-depth experiences from a large sample of software start-ups. We use open coding and cross-case analysis to describe and identify patterns, and corroborate the findings with statistical analysis. Results: We analyze 84 start-up cases and identify 16 goals, 9 challenges, and 16 engineering practices that are common among start-ups. We have mapped these goals, challenges, and practices to start-up life-cycle stages (inception, stabilization, growth, and maturity). Thus, creating the progression model guiding software engineering efforts in start-ups. Conclusions: We conclude that start-ups to a large extent face the same challenges and use the same practices as established companies. However, the primary software engineering challenge in start-ups is to evolve multiple process areas at once, with a little margin for serious errors.",
    "authors": [
      "Eriks Klotins",
      "Michael Unterkalmsteiner",
      "Panagiota Chatzipetrou",
      "Tony Gorschek",
      "Rafael Prikladnicki",
      "Nirnaya Tripathi",
      "Leandro Bento Pompermaier"
    ],
    "publication_date": "2023-12-12T09:36:43Z",
    "arxiv_id": "http://arxiv.org/abs/2312.07106v1",
    "download_url": "https://arxiv.org/abs/2312.07106v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering Autonomous Driving Software",
    "abstract": "A larger number of people with heterogeneous knowledge and skills running a project together needs an adaptable, target, and skill-specific engineering process. This especially holds for a project to develop a highly innovative, autonomously driving vehicle to participate in the 2007 DARPA Urban Challenge. In this contribution, we present essential elements of a software and systems engineering process to develop a so-called artificial intelligence capable of driving autonomously in complex urban situations. The process itself includes agile concepts, like a test first approach, continuous integration of all software modules, and a reliable release and configuration management assisted by software tools in integrated development environments. However, one of the most important elements for an efficient and stringent development is the ability to efficiently test the behavior of the developed system in a flexible and modular system simulation for urban situations both interactively and unattendedly. We call this the simulate first approach.",
    "authors": [
      "Christian Berger",
      "Bernhard Rumpe"
    ],
    "publication_date": "2014-09-22T11:48:35Z",
    "arxiv_id": "http://arxiv.org/abs/1409.6579v1",
    "download_url": "https://arxiv.org/abs/1409.6579v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evidence Profiles for Validity Threats in Program Comprehension Experiments",
    "abstract": "Searching for clues, gathering evidence, and reviewing case files are all techniques used by criminal investigators to draw sound conclusions and avoid wrongful convictions. Similarly, in software engineering (SE) research, we can develop sound methodologies and mitigate threats to validity by basing study design decisions on evidence.\n  Echoing a recent call for the empirical evaluation of design decisions in program comprehension experiments, we conducted a 2-phases study consisting of systematic literature searches, snowballing, and thematic synthesis. We found out (1) which validity threat categories are most often discussed in primary studies of code comprehension, and we collected evidence to build (2) the evidence profiles for the three most commonly reported threats to validity.\n  We discovered that few mentions of validity threats in primary studies (31 of 409) included a reference to supporting evidence. For the three most commonly mentioned threats, namely the influence of programming experience, program length, and the selected comprehension measures, almost all cited studies (17 of 18) did not meet our criteria for evidence. We show that for many threats to validity that are currently assumed to be influential across all studies, their actual impact may depend on the design and context of each specific study.\n  Researchers should discuss threats to validity within the context of their particular study and support their discussions with evidence. The present paper can be one resource for evidence, and we call for more meta-studies of this type to be conducted, which will then inform design decisions in primary studies. Further, although we have applied our methodology in the context of program comprehension, our approach can also be used in other SE research areas to enable evidence-based experiment design decisions and meaningful discussions of threats to validity.",
    "authors": [
      "Marvin Muñoz Barón",
      "Marvin Wyrich",
      "Daniel Graziotin",
      "Stefan Wagner"
    ],
    "publication_date": "2023-01-25T13:03:00Z",
    "arxiv_id": "http://arxiv.org/abs/2301.10563v1",
    "download_url": "https://arxiv.org/abs/2301.10563v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards an Engineering Workflow Management System for Asset Administration Shells using BPMN",
    "abstract": "The integration of Industry 4.0 technologies into engineering workflows is an essential step toward automating and optimizing plant and process engineering processes. The Asset Administration Shell (AAS) serves as a key enabler for creating interoperable Digital Twins that facilitate engineering data exchange and automation. This paper explores the use of AAS within engineering workflows, particularly in combination with Business Process Model and Notation (BPMN) to define structured and automated processes. We propose a distributed AAS copy-on-write infrastructure that enhances security and scalability while enabling seamless cross organizational collaboration. We also introduce a workflow management prototype automating AAS operations and engineering workflows, improving efficiency and traceability.",
    "authors": [
      "Sten Grüner",
      "Nafise Eskandani"
    ],
    "publication_date": "2025-07-10T06:49:53Z",
    "arxiv_id": "http://arxiv.org/abs/2507.07468v1",
    "download_url": "https://arxiv.org/abs/2507.07468v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysis of Student-LLM Interaction in a Software Engineering Project",
    "abstract": "Large Language Models (LLMs) are becoming increasingly competent across various domains, educators are showing a growing interest in integrating these LLMs into the learning process. Especially in software engineering, LLMs have demonstrated qualitatively better capabilities in code summarization, code generation, and debugging. Despite various research on LLMs for software engineering tasks in practice, limited research captures the benefits of LLMs for pedagogical advancements and their impact on the student learning process. To this extent, we analyze 126 undergraduate students' interaction with an AI assistant during a 13-week semester to understand the benefits of AI for software engineering learning. We analyze the conversations, code generated, code utilized, and the human intervention levels to integrate the code into the code base.\n  Our findings suggest that students prefer ChatGPT over CoPilot. Our analysis also finds that ChatGPT generates responses with lower computational complexity compared to CoPilot. Furthermore, conversational-based interaction helps improve the quality of the code generated compared to auto-generated code. Early adoption of LLMs in software engineering is crucial to remain competitive in the rapidly developing landscape. Hence, the next generation of software engineers must acquire the necessary skills to interact with AI to improve productivity.",
    "authors": [
      "Agrawal Naman",
      "Ridwan Shariffdeen",
      "Guanlin Wang",
      "Sanka Rasnayaka",
      "Ganesh Neelakanta Iyer"
    ],
    "publication_date": "2025-02-03T11:44:00Z",
    "arxiv_id": "http://arxiv.org/abs/2502.01273v1",
    "download_url": "https://arxiv.org/abs/2502.01273v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chaos Engineering: A Multi-Vocal Literature Review",
    "abstract": "Organizations, particularly medium and large enterprises, typically rely heavily on complex, distributed systems to deliver critical services and products. However, the growing complexity of these systems poses challenges in ensuring service availability, performance, and reliability. Traditional resilience testing methods often fail to capture the intricate interactions and failure modes of modern systems. Chaos Engineering addresses these challenges by proactively testing how systems in production behave under turbulent conditions, allowing developers to uncover and resolve potential issues before they escalate into outages. Though chaos engineering has received growing attention from researchers and practitioners alike, we observed a lack of reviews that synthesize insights from both academic and grey literature. Hence, we conducted a Multivocal Literature Review (MLR) on chaos engineering to address this research gap by systematically analyzing 96 academic and grey literature sources published between January 2016 and April 2024. We first used the chosen sources to derive a unified definition of chaos engineering and to identify key functionalities, components, and adoption drivers. We also developed a taxonomy for chaos engineering platforms and compared the relevant tools using it. Finally, we analyzed the current state of chaos engineering research and identified several open research issues.",
    "authors": [
      "Joshua Owotogbe",
      "Indika Kumara",
      "Willem-Jan Van Den Heuvel",
      "Damian Andrew Tamburri"
    ],
    "publication_date": "2024-12-02T11:57:24Z",
    "arxiv_id": "http://arxiv.org/abs/2412.01416v2",
    "download_url": "https://arxiv.org/abs/2412.01416v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SyDRA: An Approach to Understand Game Engine Architecture",
    "abstract": "Game engines are tools to facilitate video game development. They provide graphics, sound, and physics simulation features, which would have to be otherwise implemented by developers. Even though essential for modern commercial video game development, game engines are complex and developers often struggle to understand their architecture, leading to maintainability and evolution issues that negatively affect video game productions. In this paper, we present the Subsystem-Dependency Recovery Approach (SyDRA), which helps game engine developers understand game engine architecture and therefore make informed game engine development choices. By applying this approach to 10 open-source game engines, we obtain architectural models that can be used to compare game engine architectures and identify and solve issues of excessive coupling and folder nesting. Through a controlled experiment, we show that the inspection of the architectural models derived from SyDRA enables developers to complete tasks related to architectural understanding and impact analysis in less time and with higher correctness than without these models.",
    "authors": [
      "Gabriel C. Ullmann",
      "Yann-Gaël Guéhéneuc",
      "Fabio Petrillo",
      "Nicolas Anquetil",
      "Cristiano Politowski"
    ],
    "publication_date": "2024-06-08T14:40:29Z",
    "arxiv_id": "http://arxiv.org/abs/2406.05487v2",
    "download_url": "https://arxiv.org/abs/2406.05487v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Action Research Can Swing the Balance in Experimental Software Engineering",
    "abstract": "In general, professionals still ignore scientific evidence in place of expert opinions in most of their decision-making. For this reason, it is still common to see the adoption of new software technologies in the field without any scientific basis or well-grounded criteria, but on the opinions of experts. Experimental Software Engineering is of paramount importance to provide the foundations to understand the limits and applicability of software technologies. The need to better observe and understand the practice of Software Engineering leads us to look for alternative experimental approaches to support our studies. Different research strategies can be used to explore different Software Engineering practices. Action Research can be seen as one alternative to intensify the conducting of important experimental studies with results of great value while investigating the Software Engineering practices in depth. In this paper, a discussion on the use of Action Research in Software Engineering is presented. Aiming at better explaining the application of Action Research, an experimental study (in vivo) on the investigation of the subjective decisions of software developers, concerned with the refactoring of source code to improve source code quality in a distributed software development context is depicted. In addition, some guidance on how to accomplish an Action Research study in Software Engineering supplement the discussions.",
    "authors": [
      "Paulo Sergio Medeiros dos Santos",
      "Guilherme Horta Travassos"
    ],
    "publication_date": "2013-06-11T03:47:35Z",
    "arxiv_id": "http://arxiv.org/abs/1306.2414v1",
    "download_url": "https://arxiv.org/abs/1306.2414v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Game Engine Comparative Anatomy",
    "abstract": "Video game developers use game engines as a tool to manage complex aspects of game development. While engines play a big role in the success of games, to the best of our knowledge, they are often developed in isolation, in a closed-source manner, without architectural discussions, comparison, and collaboration among projects. In this work in progress, we compare the call graphs of two open-source engines: Godot 3.4.4 and Urho3D 1.8. While static analysis tools could provide us with a general picture without precise call graph paths, the use of a profiler such as Callgrind allows us to also view the call order and frequency. These graphs give us insight into the engines' designs. We showed that, by using Callgrind, we can obtain a high-level view of an engine's architecture, which can be used to understand it. In future work, we intend to apply both dynamic and static analysis to other open-source engines to understand architectural patterns and their impact on aspects such as performance and maintenance.",
    "authors": [
      "Gabriel C. Ullmann",
      "Cristiano Politowski",
      "Yann-Gaël Guéhéneuc",
      "Fabio Petrillo"
    ],
    "publication_date": "2022-07-13T18:48:10Z",
    "arxiv_id": "http://arxiv.org/abs/2207.06473v1",
    "download_url": "https://arxiv.org/abs/2207.06473v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards an Understanding of Large Language Models in Software Engineering Tasks",
    "abstract": "Large Language Models (LLMs) have drawn widespread attention and research due to their astounding performance in text generation and reasoning tasks. Derivative products, like ChatGPT, have been extensively deployed and highly sought after. Meanwhile, the evaluation and optimization of LLMs in software engineering tasks, such as code generation, have become a research focus. However, there is still a lack of systematic research on applying and evaluating LLMs in software engineering. Therefore, this paper comprehensively investigate and collate the research and products combining LLMs with software engineering, aiming to answer two questions: (1) What are the current integrations of LLMs with software engineering? (2) Can LLMs effectively handle software engineering tasks? To find the answers, we have collected related literature as extensively as possible from seven mainstream databases and selected 123 timely papers published starting from 2022 for analysis. We have categorized these papers in detail and reviewed the current research status of LLMs from the perspective of seven major software engineering tasks, hoping this will help researchers better grasp the research trends and address the issues when applying LLMs. Meanwhile, we have also organized and presented papers with evaluation content to reveal the performance and effectiveness of LLMs in various software engineering tasks, guiding researchers and developers to optimize.",
    "authors": [
      "Zibin Zheng",
      "Kaiwen Ning",
      "Qingyuan Zhong",
      "Jiachi Chen",
      "Wenqing Chen",
      "Lianghong Guo",
      "Weicheng Wang",
      "Yanlin Wang"
    ],
    "publication_date": "2023-08-22T12:37:29Z",
    "arxiv_id": "http://arxiv.org/abs/2308.11396v3",
    "download_url": "https://arxiv.org/abs/2308.11396v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Avoiding the Great Filter: Predicting the Timeline for Humanity to Reach Kardashev Type I Civilization",
    "abstract": "The level of technological development of any civilization can be gaged in large part by the amount of energy they produce for their use, but also encompasses that civilization's stewardship of their home world. Following the Kardashev definition, a Type I civilization is able to store and use all the energy available on its planet. In this study, we develop a model based on Carl Sagan's K formula and use this model to analyze the consumption and energy supply of the three most important energy sources: fossil fuels (e.g., coal, oil, natural gas, crude, NGL and feedstocks), nuclear energy and renewable energy. We also consider environmental limitations suggested by United Nations Framework Convention on Climate Change, the International Energy Agency, and those specific to our calculations to predict when humanity will reach the level of a Kardashev scale Type I civilization. Our findings suggest that the best estimate for this day will not come until year 2371.",
    "authors": [
      "Jonathan H. Jiang",
      "Fuyang Feng",
      "Philip E. Rosen",
      "Kristen A. Fahy",
      "Antong Zhang",
      "Piotr Obacz",
      "Prithwis Das",
      "Zong-Hong Zhu"
    ],
    "publication_date": "2022-03-24T17:45:08Z",
    "arxiv_id": "http://arxiv.org/abs/2204.07070v1",
    "download_url": "https://arxiv.org/abs/2204.07070v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hidden Populations in Software Engineering: Challenges, Lessons Learned, and Opportunities",
    "abstract": "The growing emphasis on studying equity, diversity, and inclusion within software engineering has amplified the need to explore hidden populations within this field. Exploring hidden populations becomes important to obtain invaluable insights into the experiences, challenges, and perspectives of underrepresented groups in software engineering and, therefore, devise strategies to make the software industry more diverse. However, studying these hidden populations presents multifaceted challenges, including the complexities associated with identifying and engaging participants due to their marginalized status. In this paper, we discuss our experiences and lessons learned while conducting multiple studies involving hidden populations in software engineering. We emphasize the importance of recognizing and addressing these challenges within the software engineering research community to foster a more inclusive and comprehensive understanding of diverse populations of software professionals.",
    "authors": [
      "Ronnie de Souza Santos",
      "Kiev Gama"
    ],
    "publication_date": "2024-01-17T21:32:31Z",
    "arxiv_id": "http://arxiv.org/abs/2401.09608v1",
    "download_url": "https://arxiv.org/abs/2401.09608v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "With Great Power Comes Great Responsibility: The Role of Software Engineers",
    "abstract": "The landscape of software engineering is evolving rapidly amidst the digital transformation and the ascendancy of AI, leading to profound shifts in the role and responsibilities of software engineers. This evolution encompasses both immediate changes, such as the adoption of Language Model-based approaches in coding, and deeper shifts driven by the profound societal and environmental impacts of technology. Despite the urgency, there persists a lag in adapting to these evolving roles. By fostering ongoing discourse and reflection on Software Engineers role and responsibilities, this vision paper seeks to cultivate a new generation of software engineers equipped to navigate the complexities and ethical considerations inherent in their evolving profession.",
    "authors": [
      "Stefanie Betz",
      "Birgit Penzenstadler"
    ],
    "publication_date": "2024-07-11T19:12:52Z",
    "arxiv_id": "http://arxiv.org/abs/2407.08823v1",
    "download_url": "https://arxiv.org/abs/2407.08823v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Emotions in Requirements Engineering: A Systematic Mapping Study",
    "abstract": "The purpose of requirements engineering (RE) is to make sure that the expectations and needs of the stakeholders of a software system are met. Emotional needs can be captured as emotional requirements that represent how the end user should feel when using the system. Differently from functional and quality (non-functional) requirements, emotional requirements have received relatively less attention from the RE community. This study is motivated by the need to explore and map the literature on emotional requirements. The study applies the systematic mapping study technique for surveying and analyzing the available literature to identify the most relevant publications on emotional requirements. We identified 34 publications that address a wide spectrum of practices concerned with engineering emotional requirements. The identified publications were analyzed with respect to the application domains, instruments used for eliciting and artefacts used for representing emotional requirements, and the state of the practice in emotion-related requirements engineering. This analysis serves to identify research gaps and research directions in engineering emotional requirements. To the best of the knowledge by the authors, no other similar study has been conducted on emotional requirements.",
    "authors": [
      "Tahira Iqbal",
      "Hina Anwar",
      "Syazwanie Filzah",
      "Mohammad Gharib",
      "Kerli Moose",
      "Kuldar Taveter"
    ],
    "publication_date": "2023-05-25T14:24:36Z",
    "arxiv_id": "http://arxiv.org/abs/2305.16091v1",
    "download_url": "https://arxiv.org/abs/2305.16091v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Taxonomy for Tools, Processes and Languages in Automotive Software Engineering",
    "abstract": "Within the growing domain of software engineering in the automotive sector, the number of used tools, processes, methods and languages has increased distinctly in the past years. To be able to choose proper methods for particular development use cases, factors like the intended use, key-features and possible limitations have to be evaluated. This requires a taxonomy that aids the decision making. An analysis of the main existing taxonomies revealed two major deficiencies: the lack of the automotive focus and the limitation to particular engineering method types. To face this, a graphical taxonomy is proposed based on two well-established engineering approaches and enriched with additional classification information. It provides a self-evident and -explanatory overview and comparison technique for engineering methods in the automotive domain. The taxonomy is applied to common automotive engineering methods. The resulting diagram classifies each method and enables the reader to select appropriate solutions for given project requirements.",
    "authors": [
      "Florian Bock",
      "Daniel Homm",
      "Sebastian Siegl",
      "Reinhard German"
    ],
    "publication_date": "2016-01-14T09:46:06Z",
    "arxiv_id": "http://arxiv.org/abs/1601.03528v1",
    "download_url": "https://arxiv.org/abs/1601.03528v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Architecture for Software Engineering Gamification",
    "abstract": "Gamification has been applied in software engineering to improve quality and results by increasing people's motivation and engagement. A systematic mapping has identified research gaps in the field, one of them being the difficulty of creating an integrated gamified environment comprising all the tools of an organization, since most existing gamified tools are custom developments or prototypes. In this paper, we propose a gamification software architecture that allows us to transform the work environment of a software organization into an integrated gamified environment, i.e., the organization can maintain its tools, and the rewards obtained by the users for their actions in different tools will mount up. We developed a gamification engine based on our proposal, and we carried out a case study in which we applied it in a real software development company. The case study shows that the gamification engine has allowed the company to create a gamified workplace by integrating custom developed tools and off-the-shelf tools such as Redmine, TestLink, or JUnit, with the gamification engine. Two main advantages can be highlighted: (i) our solution allows the organization to maintain its current tools, and (ii) the rewards for actions in any tool accumulate in a centralized gamified environment.",
    "authors": [
      "Óscar Pedreira",
      "Félix García",
      "Mario Piattini",
      "Alejandro Cortiñas",
      "Ana Cerdeira-Pena"
    ],
    "publication_date": "2024-01-31T23:23:52Z",
    "arxiv_id": "http://arxiv.org/abs/2402.00233v1",
    "download_url": "https://arxiv.org/abs/2402.00233v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Conceptual Framework for Requirements Engineering of Pretrained-Model-Enabled Systems",
    "abstract": "Recent advances in large pretrained models have led to their widespread integration as core components in modern software systems. The trend is expected to continue in the foreseeable future. Unlike traditional software systems governed by deterministic logic, systems powered by pretrained models exhibit distinctive and emergent characteristics, such as ambiguous capability boundaries, context-dependent behavior, and continuous evolution. These properties fundamentally challenge long-standing assumptions in requirements engineering, including functional decomposability and behavioral predictability. This paper investigates this problem and advocates for a rethinking of existing requirements engineering methodologies. We propose a conceptual framework tailored to requirements engineering of pretrained-model-enabled software systems and outline several promising research directions within this framework. This vision helps provide a guide for researchers and practitioners to tackle the emerging challenges in requirements engineering of pretrained-model-enabled systems.",
    "authors": [
      "Dongming Jin",
      "Zhi Jin",
      "Linyu Li",
      "Xiaohong Chen"
    ],
    "publication_date": "2025-07-17T13:06:25Z",
    "arxiv_id": "http://arxiv.org/abs/2507.13095v1",
    "download_url": "https://arxiv.org/abs/2507.13095v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Requirements Engineering Methods: A Classification Framework and Research Challenges",
    "abstract": "Requirements Engineering Methods (REMs) support Requirements Engineering (RE) tasks, from elicitation, through modeling and analysis, to validation and evolution of requirements. Despite the growing interest to design, validate and teach REMs, it remains unclear what components REMs should have. A classification framework for REMs is proposed. It distinguishes REMs based on the domain-independent properties of their components. The classification framework is intended to facilitate (i) analysis, teaching and extension of existing REMs, (ii) engineering and validation of new REMs, and (iii) identifying research challenges in REM design. The framework should help clarify further the relations between REM and other concepts of interest in and to RE, including Requirements Problem and Solution, Requirements Modeling Language, and Formal Method.",
    "authors": [
      "Ivan Jureta"
    ],
    "publication_date": "2012-03-08T09:30:58Z",
    "arxiv_id": "http://arxiv.org/abs/1203.1717v1",
    "download_url": "https://arxiv.org/abs/1203.1717v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering for IoT-Driven Data Analytics Applications",
    "abstract": "Internet of Things Driven Data Analytics (IoT-DA) has the potential to excel data-driven operationalisation of smart environments. However, limited research exists on how IoT-DA applications are designed, implemented, operationalised, and evolved in the context of software and system engineering life-cycle. This article empirically derives a framework that could be used to systematically investigate the role of software engineering (SE) processes and their underlying practices to engineer IoT-DA applications. First, using existing frameworks and taxonomies, we develop an evaluation framework to evaluate software processes, methods, and other artefacts of SE for IoT-DA. Secondly, we perform a systematic mapping study to qualitatively select 16 processes (from academic research and industrial solutions) of SE for IoT-DA. Thirdly, we apply our developed evaluation framework based on 17 distinct criterion (a.k.a. process activities) for fine-grained investigation of each of the 16 SE processes. Fourthly, we apply our proposed framework on a case study to demonstrate development of an IoT-DA healthcare application. Finally, we highlight key challenges, recommended practices, and the lessons learnt based on framework's support for process-centric software engineering of IoT-DA. The results of this research can facilitate researchers and practitioners to engineer emerging and next-generation of IoT-DA software applications.",
    "authors": [
      "Aakash Ahmad",
      "Mahdi Fahmideh",
      "Ahmed B. Altamimi",
      "Iyad Katib",
      "Aiiad Albeshri",
      "Abdulrahman Alreshidi",
      "Adwan Alanazi",
      "Rashid Mehmood"
    ],
    "publication_date": "2021-03-20T14:53:00Z",
    "arxiv_id": "http://arxiv.org/abs/2103.11192v1",
    "download_url": "https://arxiv.org/abs/2103.11192v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ethnic Conflicts, Civil War and Economic Growth: Region-Level Evidence from former Yugoslavia",
    "abstract": "We investigate the long-term impact of civil war on subnational economic growth across 78 regions in five former Yugoslav republics from 1950 to 2015. Leveraging the outbreak of ethnic tensions and the onset of conflict, we construct counterfactual growth trajectories using a robust region-level donor pool from 28 conflict-free countries. Applying a hybrid synthetic control and difference-in-differences approach, we find that the war in former Yugoslavia inflicted unprecedented regional per capita GDP losses estimated at 38 percent, with substantial regional heterogeneity. The most war-affected regions suffered prolonged and permanent economic declines, while capital cities experienced more transitory effects. Our results are robust to extensive variety of specification tests, placebo analyses, and falsification exercises. Notably, ethnic tensions between Serbs and Croats explain up to 40 percent of the observed variation in economic losses, underscoring the deep and lasting influence of ethnic divisions on economic impacts of the armed conflicts.",
    "authors": [
      "Aleksandar Keseljevic",
      "Stefan Nikolic",
      "Rok Spruk"
    ],
    "publication_date": "2025-05-05T07:56:11Z",
    "arxiv_id": "http://arxiv.org/abs/2505.02431v1",
    "download_url": "https://arxiv.org/abs/2505.02431v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mixed-Variable Requirements Roadmaps and their Role in the Requirements Engineering of Adaptive Systems",
    "abstract": "The requirements roadmap concept is introduced as a solution to the problem of the requirements engineering of adaptive systems. The concept requires a new general definition of the requirements problem which allows for quantitative (numeric) variables, together with qualitative (binary boolean) propositional variables, and distinguishes monitored from controlled variables for use in control loops. We study the consequences of these changes, and argue that the requirements roadmap concept bridges the gap between current general definitions of the requirements problem and its notion of solution, and the research into the relaxation of requirements, the evaluation of their partial satisfaction, and the monitoring and control of requirements, all topics of particular interest in the engineering of requirements for adaptive systems [Cheng et al. 2009]. From the theoretical perspective, we show clearly and formally the fundamental differences between more traditional conception of requirements engineering (e.g., Zave & Jackson [1997]) and the requirements engineering of adaptive systems (from Fickas & Feather [1995], over Letier & van Lamsweerde [2004], and up to Whittle et al. [2010] and the most recent research). From the engineering perspective, we define a proto-framework for early requirements engineering of adaptive systems, which illustrates the features needed in future requirements frameworks for this class of systems.",
    "authors": [
      "Ivan Jureta",
      "Alexander Borgida",
      "Neil A. Ernst"
    ],
    "publication_date": "2011-02-21T10:14:56Z",
    "arxiv_id": "http://arxiv.org/abs/1102.4178v1",
    "download_url": "https://arxiv.org/abs/1102.4178v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Likelihood of Observing Extragalactic Civilizations: Predictions from the Self-Indication Assumption",
    "abstract": "Ambitious civilizations that expand for resources at an intergalactic scale could be observable from a cosmological distance, but how likely is one to be visible to us? The question comes down to estimating the appearance rate of such things in the cosmos --- a radically uncertain quantity. Despite this prior uncertainty, anthropic considerations give rise to Bayesian updates, and thus predictions. The Self-Sampling Assumption (SSA), a school of anthropic probability, has previously been used for this purpose. Here, we derive predictions from the alternative school, the Self-Indication Assumption (SIA), and point out its features. SIA favors a higher appearance rate of expansionistic life, but our existence at the present cosmic time means that such life cannot be too common (else our galaxy would long ago have been overrun). This combination squeezes our vast prior uncertainty into a few orders of magnitude. Details of the background cosmology fall out, and we are left with some stark conclusions. E.g. if the limits to technology allow a civilization to expand at speed $v$, the probability of at least one expanding cosmological civilization being visible on our past light cone is $1-\\frac{v^3}{c^3}$. We also show how the SIA estimate can be updated from the results of a hypothetical full-sky survey that detects \"$n$\" expanding civilizations (for $n \\geq 0$), and calculate the implied final extent of life in the universe.",
    "authors": [
      "S. Jay Olson"
    ],
    "publication_date": "2020-02-18T16:05:17Z",
    "arxiv_id": "http://arxiv.org/abs/2002.08194v1",
    "download_url": "https://arxiv.org/abs/2002.08194v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Role of Ontology Training to Software Engineering Students",
    "abstract": "Students of software engineering struggle to develop a systems perspective because most of the software engineering methodologies focus on developing a particular aspect of a system. Lack of unified coverage to the topic of systems modelling is identified as the root cause behind this problem. The paper explains the role of ontology in building systems perspective. A case for the necessity of ontology training as a means to overcome this problem is presented. The course content for a typical course on ontology is also described in the paper.",
    "authors": [
      "Arvind W Kiwelekar"
    ],
    "publication_date": "2019-10-17T15:25:51Z",
    "arxiv_id": "http://arxiv.org/abs/1910.07968v1",
    "download_url": "https://arxiv.org/abs/1910.07968v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Proceedings Second International Workshop on Algebraic Methods in Model-based Software Engineering",
    "abstract": "Over the past years there has been quite a lot of activity in the algebraic community about using algebraic methods for providing support to model-driven software engineering. The aim of this workshop is to gather researchers working on the development and application of algebraic methods to provide rigorous support to model-based software engineering.   The topics relevant to the workshop are all those related to the use of algebraic methods in software engineering, including but not limited to:  formally specifying and verifying model-based software engineering concepts and related ones (MDE, UML, OCL, MOF, DSLs, ...); tool support for the above; integration of formal and informal methods; and theoretical frameworks (algebraic, rewriting-based, category theory-based, ...).  The workshop's main goal is to examine, discuss, and relate the existing projects within the algebraic community that address common open-issues in model-driven software engineering.",
    "authors": [
      "Francisco Durán",
      "Vlad Rusu"
    ],
    "publication_date": "2011-06-29T15:05:15Z",
    "arxiv_id": "http://arxiv.org/abs/1106.5962v1",
    "download_url": "https://arxiv.org/abs/1106.5962v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Impostor Phenomenon in Software Engineers",
    "abstract": "The Impostor Phenomenon (IP) is widely discussed in Science, Technology, Engineering, and Mathematics (STEM) and has been evaluated in Computer Science students. However, formal research on IP in software engineers has yet to be conducted, although its impacts may lead to mental disorders such as depression and burnout. This study describes a survey that investigates the extent of impostor feelings in software engineers, considering aspects such as gender, race/ethnicity, and roles. Furthermore, we investigate the influence of IP on their perceived productivity. The survey instrument was designed using a theory-driven approach and included demographic questions, an internationally validated IP scale, and questions for measuring perceived productivity based on the SPACE framework constructs. The survey was sent to companies operating in various business sectors. Data analysis used bootstrapping with resampling to calculate confidence intervals and Mann-Whitney statistical significance testing for assessing the hypotheses. We received responses from 624 software engineers from 26 countries. The bootstrapping results reveal that a proportion of 52.7% of software engineers experience frequent to intense levels of IP and that women suffer at a significantly higher proportion (60.6%) than men (48.8%). Regarding race/ethnicity, we observed more frequent impostor feelings in Asian (67.9%) and Black (65.1%) than in White (50.0%) software engineers. We also observed that the presence of IP is less common among individuals who are married and have children. Moreover, the prevalence of IP showed a statistically significant negative effect on the perceived productivity for all SPACE framework constructs. The evidence relating IP to software engineers provides a starting point to help organizations find ways to raise awareness of the problem and improve the emotional skills of software professionals.",
    "authors": [
      "Paloma Guenes",
      "Rafael Tomaz",
      "Marcos Kalinowski",
      "Maria Teresa Baldassarre",
      "Margaret-Anne Storey"
    ],
    "publication_date": "2023-12-07T00:51:58Z",
    "arxiv_id": "http://arxiv.org/abs/2312.03966v1",
    "download_url": "https://arxiv.org/abs/2312.03966v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Advancing Behavior Engineering: Toward Integrated Events Modeling",
    "abstract": "The term behavior engineering (BE) encompasses a broad integration of behavioral and compositional requirements needed to model large-scale systems. BE forms a connection between systems-engineering processes and software-engineering processes. In software engineering, interpreting requirements can be perceived as specifying behavior, which is viewed in terms of chronology of events in the modeled system. In this paper, we adopt BE in its general and integrating sense to search for a unifying notion of an event as a fundamental behavior-modeling concept. We examine several bodies of research with various definitions of an event and its basic units and structure. We use the thinging machine (TM) model to analyze notions related to events, including Dromey s behavior trees, fluents (change over time), recurrent events, and Davidson s events. The results point to an underlying meaning that can lead to a unifying event concept.",
    "authors": [
      "Sabah Al-Fedaghi"
    ],
    "publication_date": "2021-01-05T03:08:03Z",
    "arxiv_id": "http://arxiv.org/abs/2101.01325v1",
    "download_url": "https://arxiv.org/abs/2101.01325v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Teaching cloud computing: a software engineering perspective",
    "abstract": "This short papers discusses the issues of teaching cloud computing from a software engineering rather than a business perspective. It discusses what topics might be covered in a senior course on cloud software engineering.",
    "authors": [
      "Ian Sommerville"
    ],
    "publication_date": "2012-09-05T12:31:34Z",
    "arxiv_id": "http://arxiv.org/abs/1209.0948v1",
    "download_url": "https://arxiv.org/abs/1209.0948v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A holistic look at requirements engineering practices in the gaming industry",
    "abstract": "In this work we present an account of the status of requirements engineering in the gaming industry. Recent papers in the area were surveyed. Characterizations of the gaming industry were deliberated upon by portraying its relations with the market industry. Some research directions in the area of requirements engineering in the gaming industry were also mentioned.",
    "authors": [
      "Aftab Hussain",
      "Omar Asadi",
      "Debra J. Richardson"
    ],
    "publication_date": "2018-11-08T15:10:09Z",
    "arxiv_id": "http://arxiv.org/abs/1811.03482v1",
    "download_url": "https://arxiv.org/abs/1811.03482v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Toward Inclusion of Children as Software Engineering Stakeholders",
    "abstract": "Background: A growing amount of software is available to children today. Children use both software that has been explicitly developed for them and software for general users. While they obtain clear benefits from software, such as access to creativity tools and learning resources, children are also exposed to several risks and disadvantages, such as privacy violation, inactivity, or safety risks that can even lead to death. The research and development community is addressing and investigating positive and negative impacts of software for children one by one, but no comprehensive model exists that relates software engineering and children as stakeholders in their own right. Aims: The final objective of this line of research is to propose effective ways in which children can be involved in Software Engineering activities as stakeholders. Specifically, in this paper, we investigate the quality aspects that are of interest for children, as quality is a crucial aspect in the development of any kind of software, especially for stakeholders like children. Method: Our contribution is based mainly on an analysis of studies at the intersection between Software Engineering (especially software quality) and Child Computer Interaction. Results: We identify a set of qualities and a preliminary set of guidelines that can be used by researchers and practitioners in understanding the complex interrelations between Software Engineering and children. Based on the qualities and the guidelines, researchers can design empirical investigations to obtain deeper insights into the phenomenon and propose new Software Engineering knowledge specific for this type of stakeholders. Conclusions: This conceptualization is a first step towards a framework to support children as stakeholders in software engineering.",
    "authors": [
      "Letizia Jaccheri",
      "Sandro Morasca"
    ],
    "publication_date": "2021-01-07T18:59:56Z",
    "arxiv_id": "http://arxiv.org/abs/2101.02704v1",
    "download_url": "https://arxiv.org/abs/2101.02704v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interference Analysis for Coexistence of UAVs and Civil Aircrafts Based on Automatic Dependent Surveillance-Broadcast",
    "abstract": "Due to the advantages of high mobility and easy deployment, unmanned aerial vehicles (UAVs) are widely applied in both military and civilian fields. In order to strengthen the flight surveillance of UAVs and guarantee the airspace safety, UAVs can be equipped with the automatic dependent surveillance-broadcast (ADS-B) system, which periodically sends flight information to other aircrafts and ground stations (GSs). However, due to the limited resource of channel capacity, UAVs equipped with ADS-B results in the interference between UAVs and civil aircrafts (CAs), which further impacts the accuracy of received information at GSs. In detail, the channel capacity is mainly affected by the density of aircrafts and the transmitting power of ADS-B. Hence, based on the three-dimensional poisson point process, this work leverages the stochastic geometry theory to build a model of the coexistence of UAVs and CAs and analyze the interference performance of ADS-B monitoring system. From simulation results, we reveal the effects of transmitting power, density, threshold and pathloss on the performance of the ADS-B monitoring system. Besides, we provide the suggested transmitting power and density for the safe coexistence of UAVs and CAs.",
    "authors": [
      "Yiyang Liao",
      "Ziye Jia",
      "Chao Dong",
      "Lei Zhang",
      "Qihui Wu",
      "Huiling Hu",
      "Zhu Han"
    ],
    "publication_date": "2024-06-12T09:39:32Z",
    "arxiv_id": "http://arxiv.org/abs/2406.08038v1",
    "download_url": "https://arxiv.org/abs/2406.08038v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An initial Theory to Understand and Manage Requirements Engineering Debt in Practice",
    "abstract": "Context: Advances in technical debt research demonstrate the benefits of applying the financial debt metaphor to support decision-making in software development activities. Although decision-making during requirements engineering has significant consequences, the debt metaphor in requirements engineering is inadequately explored. Objective: We aim to conceptualize how the debt metaphor applies to requirements engineering by organizing concepts related to practitioners' understanding and managing of requirements engineering debt (RED). Method: We conducted two in-depth expert interviews to identify key requirements engineering debt concepts and construct a survey instrument. We surveyed 69 practitioners worldwide regarding their perception of the concepts and developed an initial analytical theory. Results: We propose a RED theory that aligns key concepts from technical debt research but emphasizes the specific nature of requirements engineering. In particular, the theory consists of 23 falsifiable propositions derived from the literature, the interviews, and survey results. Conclusions: The concepts of requirements engineering debt are perceived to be similar to their technical debt counterpart. Nevertheless, measuring and tracking requirements engineering debt are immature in practice. Our proposed theory serves as the first guide toward further research in this area.",
    "authors": [
      "Julian Frattini",
      "Davide Fucci",
      "Daniel Mendez",
      "Rodrigo Spinola",
      "Vladimir Mandic",
      "Nebojsa Tausan",
      "Muhammad Ovais Ahmad",
      "Javier Gonzalez-Huerta"
    ],
    "publication_date": "2022-11-11T13:24:22Z",
    "arxiv_id": "http://arxiv.org/abs/2211.06189v2",
    "download_url": "https://arxiv.org/abs/2211.06189v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Open Data: Reverse Engineering and Maintenance Perspective",
    "abstract": "Open data is an emerging paradigm to share large and diverse datasets -- primarily from governmental agencies, but also from other organizations -- with the goal to enable the exploitation of the data for societal, academic, and commercial gains. There are now already many datasets available with diverse characteristics in terms of size, encoding and structure. These datasets are often created and maintained in an ad-hoc manner. Thus, open data poses many challenges and there is a need for effective tools and techniques to manage and maintain it. In this paper we argue that software maintenance and reverse engineering have an opportunity to contribute to open data and to shape its future development. From the perspective of reverse engineering research, open data is a new artifact that serves as input for reverse engineering techniques and processes. Specific challenges of open data are document scraping, image processing, and structure/schema recognition. From the perspective of maintenance research, maintenance has to accommodate changes of open data sources by third-party providers, traceability of data transformation pipelines, and quality assurance of data and transformations. We believe that the increasing importance of open data and the research challenges that it brings with it may possibly lead to the emergence of new research streams for reverse engineering as well as for maintenance.",
    "authors": [
      "Holger M. Kienle"
    ],
    "publication_date": "2012-02-08T11:08:37Z",
    "arxiv_id": "http://arxiv.org/abs/1202.1656v1",
    "download_url": "https://arxiv.org/abs/1202.1656v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Implications of a search for intergalactic civilizations on prior estimates of human survival and travel speed",
    "abstract": "We present a model where some proportion of extraterrestrial civilizations expand uniformly over time to reach a cosmological scale. We then ask what humanity could infer if a sky survey were to find zero, one, or more such civilizations. We show how the results of this survey, in combination with an approach to anthropics called the Self Indication Assumption (SIA), would shift any prior estimates of two quantities: 1) The chance that a technological civilization like ours survives to embark on such expansion, and 2) the maximum feasible speed at which it could expand. The SIA gives pessimistic estimates for both, but survey results (even null results) can reverse some of the effect. The SIA-induced shift in expectations is strong enough to be regarded as a falsifiable technological prediction, and a test of the SIA in cosmological reasoning.",
    "authors": [
      "S. Jay Olson",
      "Toby Ord"
    ],
    "publication_date": "2021-06-24T23:12:00Z",
    "arxiv_id": "http://arxiv.org/abs/2106.13348v2",
    "download_url": "https://arxiv.org/abs/2106.13348v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unleashing the Potentials of Immersive Augmented Reality for Software Engineering",
    "abstract": "In immersive augmented reality (IAR), users can wear a head-mounted display to see computer-generated images superimposed to their view of the world. IAR was shown to be beneficial across several domains, e.g., automotive, medicine, gaming and engineering, with positive impacts on, e.g., collaboration and communication. We think that IAR bears a great potential for software engineering but, as of yet, this research area has been neglected. In this vision paper, we elicit potentials and obstacles for the use of IAR in software engineering. We identify possible areas that can be supported with IAR technology by relating commonly discussed IAR improvements to typical software engineering tasks. We further demonstrate how innovative use of IAR technology may fundamentally improve typical activities of a software engineer through a comprehensive series of usage scenarios outlining practical application. Finally, we reflect on current limitations of IAR technology based on our scenarios and sketch research activities necessary to make our vision a reality. We consider this paper to be relevant to academia and industry alike in guiding the steps to innovative research and applications for IAR in software engineering.",
    "authors": [
      "Leonel Merino",
      "Mircea Lungu",
      "Christoph Seidl"
    ],
    "publication_date": "2020-01-05T12:22:28Z",
    "arxiv_id": "http://arxiv.org/abs/2001.01223v1",
    "download_url": "https://arxiv.org/abs/2001.01223v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "What Practitioners Really Think About Continuous Software Engineering: A Taxonomy of Challenges",
    "abstract": "The Continuous software engineering is a collaborative software development environment which offers the continues development and deployment of quality software project within short time. The Continuous software engineering practices are not yet mature enough, and the software organizations hesitate to adopt it. This study aims: (1) to explore the Continuous software engineering challenges by conducting systematic literature review (SLR) and to get the insight of industry experts via questionnaire survey study; (2) to prioritize the investigated challenges using fuzzy analytical hierarchy process (FAHP). The study findings provides the set of critical challenges faced by the software organizations while adopting Continuous software engineering and a prioritization based taxonomy of the Continuous software engineering challenges. The application of FAHP is novel in this research area as it assists in addressing the vagueness of practitioners concerning the influencing factors of Continuous software engineering. We believe that the finding of this study will serve as a body of knowledge for real world practitioners and researchers to revise and develop the new strategies for the successful implementation of Continuous software engineering practices in the software industry.",
    "authors": [
      "Muhammad Zohaib"
    ],
    "publication_date": "2023-03-30T10:18:56Z",
    "arxiv_id": "http://arxiv.org/abs/2303.17271v1",
    "download_url": "https://arxiv.org/abs/2303.17271v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Teaching Software Engineering for AI-Enabled Systems",
    "abstract": "Software engineers have significant expertise to offer when building intelligent systems, drawing on decades of experience and methods for building systems that are scalable, responsive and robust, even when built on unreliable components. Systems with artificial-intelligence or machine-learning (ML) components raise new challenges and require careful engineering. We designed a new course to teach software-engineering skills to students with a background in ML. We specifically go beyond traditional ML courses that teach modeling techniques under artificial conditions and focus, in lecture and assignments, on realism with large and changing datasets, robust and evolvable infrastructure, and purposeful requirements engineering that considers ethics and fairness as well. We describe the course and our infrastructure and share experience and all material from teaching the course for the first time.",
    "authors": [
      "Christian Kästner",
      "Eunsuk Kang"
    ],
    "publication_date": "2020-01-18T15:24:17Z",
    "arxiv_id": "http://arxiv.org/abs/2001.06691v1",
    "download_url": "https://arxiv.org/abs/2001.06691v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Verification of Concurrent Engineering Software Using CSM Models",
    "abstract": "An engineering design process may involve software modules that can executed concurrently. Concurrent modules can be very easily subject to some synchronization errors. This paper discusses verification process for such engineering software. We present a method for verification that requires several steps. First, the state diagram models are constructed that describe the design iterations and interactions with the designer. Next, the state diagram models are transformed into concurrent state machines (CSM). After that, the CSM models are analyzed in order to verify their correctness. In this phase, the modifications are performed in necessary. In the last phase the code is generated. The tools to support our method can be called new concurrent CASE tools. Using these tools the engineering software can be created that is verified for correctness in respect to concurrent execution.",
    "authors": [
      "Jerzy Mieścicki",
      "Mikołaj Baszun",
      "Wiktor B. Daszczuk",
      "Bogdan D. Czejdo"
    ],
    "publication_date": "2017-04-20T21:51:36Z",
    "arxiv_id": "http://arxiv.org/abs/1704.06351v1",
    "download_url": "https://arxiv.org/abs/1704.06351v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Supporting Software Engineering Research and Education by Annotating Public Videos of Developers Programming",
    "abstract": "Software engineering has long studied how software developers work, building a body of work which forms the foundation of many software engineering best practices, tools, and theories. Recently, some developers have begun recording videos of themselves engaged in programming tasks contributing to open source projects, enabling them to share knowledge and socialize with other developers. We believe that these videos offer an important opportunity for both software engineering research and education. In this paper, we discuss the potential use of these videos as well as open questions for how to best enable this envisioned use. We propose creating a central repository of programming videos, enabling analyzing and annotating videos to illustrate specific behaviors of interest such as asking and answering questions, employing strategies, and software engineering theories. Such a repository would offer an important new way in which both software engineering researchers and students can understand how software developers work.",
    "authors": [
      "Abdulaziz Alaboudi",
      "Thomas D. LaToza"
    ],
    "publication_date": "2019-05-09T04:42:39Z",
    "arxiv_id": "http://arxiv.org/abs/1905.11366v1",
    "download_url": "https://arxiv.org/abs/1905.11366v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Long-term implications of observing an expanding cosmological civilization",
    "abstract": "Suppose that advanced civilizations, separated by a cosmological distance and time, wish to maximize their access to cosmic resources by rapidly expanding into the universe. How does the presence of one limit the expansionistic ambitions of another, and what sort of boundary forms between their expanding domains? We describe a general scenario for any expansion speed, separation distance, and time. We then specialize to a question of particular interest: What are the future prospects for a young and ambitious civilization if they can observe the presence of another at a cosmological distance? We treat cases involving the observation of one or two expanding domains. In the single-observation case, we find that almost any plausible detection will limit one's future cosmic expansion to some extent. Also, practical technological limits to expansion speed (well below the speed of light) play an interesting role. If a domain is visible at the time one embarks on cosmic expansion, higher practical limits to expansion speed are beneficial only up to a certain point. Beyond this point, a higher speed limit means that gains in the ability to expand are more than offset by the first-mover advantage of the observed domain. In the case of two visible domains, it is possible to be \"trapped\" by them if the practical speed limit is high enough and their angular separation in the sky is large enough, i.e. one's expansion in any direction will terminate at a boundary with the two visible civilizations. Detection at an extreme cosmological distance has surprisingly little mitigating effect on our conclusions.",
    "authors": [
      "S. Jay Olson"
    ],
    "publication_date": "2016-08-26T16:56:20Z",
    "arxiv_id": "http://arxiv.org/abs/1608.07522v2",
    "download_url": "https://arxiv.org/abs/1608.07522v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Multimodal Ecological Civilization Pattern Recommendation Method Based on Large Language Models and Knowledge Graph",
    "abstract": "The Ecological Civilization Pattern Recommendation System (ECPRS) aims to recommend suitable ecological civilization patterns for target regions, promoting sustainable development and reducing regional disparities. However, the current representative recommendation methods are not suitable for recommending ecological civilization patterns in a geographical context. There are two reasons for this. Firstly, regions have spatial heterogeneity, and the (ECPRS)needs to consider factors like climate, topography, vegetation, etc., to recommend civilization patterns adapted to specific ecological environments, ensuring the feasibility and practicality of the recommendations. Secondly, the abstract features of the ecological civilization patterns in the real world have not been fully utilized., resulting in poor richness in their embedding representations and consequently, lower performance of the recommendation system. Considering these limitations, we propose the ECPR-MML method. Initially, based on the novel method UGPIG, we construct a knowledge graph to extract regional representations incorporating spatial heterogeneity features. Following that, inspired by the significant progress made by Large Language Models (LLMs) in the field of Natural Language Processing (NLP), we employ Large LLMs to generate multimodal features for ecological civilization patterns in the form of text and images. We extract and integrate these multimodal features to obtain semantically rich representations of ecological civilization. Through extensive experiments, we validate the performance of our ECPR-MML model. Our results show that F1@5 is 2.11% higher compared to state-of-the-art models, 2.02% higher than NGCF, and 1.16% higher than UGPIG. Furthermore, multimodal data can indeed enhance recommendation performance. However, the data generated by LLM is not as effective as real data to a certain extent.",
    "authors": [
      "Zhihang Yu",
      "Shu Wang",
      "Yunqiang Zhu",
      "Zhiqiang Zou"
    ],
    "publication_date": "2023-10-29T09:41:21Z",
    "arxiv_id": "http://arxiv.org/abs/2310.18951v1",
    "download_url": "https://arxiv.org/abs/2310.18951v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Designing a Custom Chaos Engineering Framework for Enhanced System Resilience at Softtech",
    "abstract": "Chaos Engineering is a discipline which enhances software resilience by introducing faults to observe and improve system behavior intentionally. This paper presents a design proposal for a customized Chaos Engineering framework tailored for Softtech, a leading software development company serving the financial sector. It outlines foundational concepts and activities for introducing Chaos Engineering within Softtech, while considering financial sector regulations. Building on these principles, the framework aims to be iterative and scalable, enabling development teams to progressively improve their practices. The study addresses two primary questions: how Softtech's unique infrastructure, business priorities, and organizational context shape the customization of its Chaos Engineering framework and what key activities and components are necessary for creating an effective framework tailored to Softtech's needs.",
    "authors": [
      "Ethem Utku Aktas",
      "Burak Tuzlutas",
      "Burak Yesiltas"
    ],
    "publication_date": "2025-06-17T07:50:23Z",
    "arxiv_id": "http://arxiv.org/abs/2506.14281v1",
    "download_url": "https://arxiv.org/abs/2506.14281v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modelling of anthropogenic pollutant diffusion in the atmosphere and applications to civil protection monitoring",
    "abstract": "A basic feature of fluid mechanics concerns the frictionless phase-space dynamics of particles in an incompressible fluid. The issue, besides its theoretical interest in turbulence theory, is important in many applications, such as the pollutant dynamics in the atmosphere, a problem relevant for civil protection monitoring of air quality. Actually, both the numerical simulation of the ABL (atmospheric boundary layer) portion of the atmosphere and that of pollutant dynamics may generally require the correct definition of the Lagrangian dynamics which characterizes arbitrary fluid elements of incompressible thermofluids. We claim that particularly important for applications would be to consider these trajectories as phase-space trajectories. This involves, however, the unfolding of a fundamental theoretical problem up to now substantially unsolved: {\\it namely the determination of the exact frictionless dynamics of tracer particles in an incompressible fluid, treated either as a deterministic or a turbulent (i.e., stochastic) continuum.} In this paper we intend to formulate the necessary theoretical framework to construct such a type of description. This is based on a phase-space inverse kinetic theory (IKT) approach recently developed for incompressible fluids (Ellero \\textit{et al.}, 2004-2008). {\\it Our claim is that the conditional frictionless dynamics of a tracer particles - which corresponds to a prescribed velocity probability density and an arbitrary choice of the relevant fluid fields - can be exactly specified}.",
    "authors": [
      "Marco Tessarotto",
      "Massimo Tessarotto"
    ],
    "publication_date": "2008-07-02T05:48:27Z",
    "arxiv_id": "http://arxiv.org/abs/0807.0274v1",
    "download_url": "https://arxiv.org/abs/0807.0274v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Requirements Engineering for RAG Systems",
    "abstract": "This short paper explores how a maritime company develops and integrates large-language models (LLM). Specifically by looking at the requirements engineering for Retrieval Augmented Generation (RAG) systems in expert settings. Through a case study at a maritime service provider, we demonstrate how data scientists face a fundamental tension between user expectations of AI perfection and the correctness of the generated outputs. Our findings reveal that data scientists must identify context-specific \"retrieval requirements\" through iterative experimentation together with users because they are the ones who can determine correctness. We present an empirical process model describing how data scientists practically elicited these \"retrieval requirements\" and managed system limitations. This work advances software engineering knowledge by providing insights into the specialized requirements engineering processes for implementing RAG systems in complex domain-specific applications.",
    "authors": [
      "Tor Sporsem",
      "Rasmus Ulfsnes"
    ],
    "publication_date": "2025-05-12T13:30:44Z",
    "arxiv_id": "http://arxiv.org/abs/2505.07553v1",
    "download_url": "https://arxiv.org/abs/2505.07553v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tissue Engineering for Periodontal Ligament Regeneration: Biomechanical Specifications",
    "abstract": "The periodontal biomechanical environment is very difficult to investigate. By the complex geometry and composition of the periodontal ligament, its mechanical behavior is very dependent on the type of loading (compressive vs. tensile loading; static vs. cyclic loading; uniaxial vs. multiaxial) and the location around the root (cervical, middle, or apical). These different aspects of the periodontal ligament make it difficult to develop a functional biomaterial to treat periodontal attachment due to periodontal diseases. This review aims to describe the structural and biomechanical properties of the periodontal ligament. Particular importance is placed in the close interrelationship that exists between structure and biomechanics: the periodontal ligament structural organization is specific to its biomechanical environment, and its biomechanical properties are specific to its structural arrangement. This balance between structure and biomechanics can be explained by a mechanosensitive periodontal cellular activity. These specifications have to be considered in the further tissue engineering strategies for the development of an efficient biomaterial for periodontal tissues regeneration.",
    "authors": [
      "R. Gauthier",
      "Christophe Jeannin",
      "N. Attik",
      "Ana-Maria Trunfio-Sfarghiu",
      "K. Gritsch",
      "B. Grosgogeat"
    ],
    "publication_date": "2020-12-29T09:43:52Z",
    "arxiv_id": "http://arxiv.org/abs/2012.14683v1",
    "download_url": "https://arxiv.org/abs/2012.14683v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Are Game Engines Software Frameworks? A Three-perspective Study",
    "abstract": "Game engines help developers create video games and avoid duplication of code and effort, like frameworks for traditional software systems. In this paper, we explore open-source game engines along three perspectives: literature, code, and human. First, we explore and summarise the academic literature on game engines. Second, we compare the characteristics of the 282 most popular engines and the 282 most popular frameworks in GitHub. Finally, we survey 124 engine developers about their experience with the development of their engines. We report that: (1) Game engines are not well-studied in software-engineering research with few studies having engines as object of research. (2) Open-source game engines are slightly larger in terms of size and complexity and less popular and engaging than traditional frameworks. Their programming languages differ greatly from frameworks. Engine projects have shorter histories with less releases. (3) Developers perceive game engines as different from traditional frameworks. Generally, they build game engines to (a) better control the environment and source code, (b) learn about game engines, and (c) develop specific games. We conclude that open-source game engines have differences compared to traditional open-source frameworks although this differences do not demand special treatments.",
    "authors": [
      "Cristiano Politowski",
      "Fabio Petrillo",
      "João Eduardo Montandon",
      "Marco Tulio Valente",
      "Yann-Gaël Guéhéneuc"
    ],
    "publication_date": "2020-04-12T21:57:12Z",
    "arxiv_id": "http://arxiv.org/abs/2004.05705v3",
    "download_url": "https://arxiv.org/abs/2004.05705v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software engineering in start-up companies: An analysis of 88 experience reports",
    "abstract": "Context: Start-up companies have become an important supplier of innovation and software-intensive products. The flexibility and reactiveness of start-ups enables fast development and launch of innovative products. However, a majority of software start-up companies fail before achieving any success. Among other factors, poor software engineering could be a significant contributor to the challenges experienced by start-ups. However, the state-of-practice of software engineering in start-ups, as well as the utilization of state-of-the-art is largely an unexplored area. Objective: In this study we investigate how software engineering is applied in start-up context with a focus to identify key knowledge areas and opportunities for further research. Method: We perform a multi-vocal exploratory study of 88 start-up experience reports. We develop a custom taxonomy to categorize the reported software engineering practices and their interrelation with business aspects, and apply qualitative data analysis to explore influences and dependencies between the knowledge areas. Results: We identify the most frequently reported software engineering (requirements engineering, software design and quality) and business aspect (vision and strategy development) knowledge areas, and illustrate their relationships. We also present a summary of how relevant software engineering knowledge areas are implemented in start-ups and identify potentially useful practices for adoption in start-ups. Conclusions: The results enable a more focused research on engineering practices in start-ups. We conclude that most engineering challenges in start-ups stem from inadequacies in requirements engineering. Many promising practices to address specific engineering challenges exists, however more research on adaptation of established practices, and validation of new start-up specific practices is needed.",
    "authors": [
      "Eriks Klotins",
      "Michael Unterkalmsteiner",
      "Tony Gorschek"
    ],
    "publication_date": "2023-11-20T19:42:37Z",
    "arxiv_id": "http://arxiv.org/abs/2311.12139v1",
    "download_url": "https://arxiv.org/abs/2311.12139v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ten simple rules for PIs to integrate Research Software Engineering into their research group",
    "abstract": "Research Software Engineering (RSEng) is a key success factor in producing high-quality research software, which in turn enables and improves research outcomes. However, as a principal investigator or leader of a research group you may not know what RSEng is, where to get started with it, or how to use it to maximize its benefit for your research. RSEng also often comes with technical complexity, and therefore reduced accessibility to some researchers. The ten simple rules presented in this paper aim to improve the accessibility of RSEng, and provide practical and actionable advice to PIs and leaders for integrating RSEng into their research group. By following these rules, readers can improve the quality, reproducibility, and trustworthiness of their research software, ultimately leading to better, more reproducible and more trustworthy research outcomes.",
    "authors": [
      "Stuart M. Allen",
      "Neil Chue Hong",
      "Stephan Druskat",
      "Toby Hodges",
      "Daniel S. Katz",
      "Jan Linxweiler",
      "Frank Löffler",
      "Lars Grunske",
      "Heidi Seibold",
      "Jan Philipp Thiele",
      "Samantha Wittke"
    ],
    "publication_date": "2025-06-25T07:59:37Z",
    "arxiv_id": "http://arxiv.org/abs/2506.20217v1",
    "download_url": "https://arxiv.org/abs/2506.20217v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimization in Software Engineering -- A Pragmatic Approach",
    "abstract": "Empirical software engineering is concerned with the design and analysis of empirical studies that include software products, processes, and resources. Optimization is a form of data analytics in support of human decision-making. Optimization methods are aimed to find the best decision alternatives. Empirical studies serve both as a model and as data input for optimization. In addition, the complexity of the models used for optimization trigger further studies on explaining and validating the results in real-world scenarios. The goal of this chapter is to give an overview of the as-is and of the to-be usage of optimization in software engineering. The emphasis is on pragmatic use of optimization, and not so much on describing the most recent algorithmic innovations and tool developments. The usage of optimization covers a wide range of questions from different types of software engineering problems along the whole life-cycle. To facilitate its more comprehensive and more effective usage, a checklist for a guided process is described. The chapter uses a running example Asymmetric Release Planning to illustrate the whole process. A Return-on-Investment analysis is proposed as part of the problem scoping. This helps to decide on the depth and breadth of analysis in relation to the effort needed to run the analysis and the projected value of the solution.",
    "authors": [
      "Guenther Ruhe"
    ],
    "publication_date": "2019-12-04T16:02:07Z",
    "arxiv_id": "http://arxiv.org/abs/1912.02071v1",
    "download_url": "https://arxiv.org/abs/1912.02071v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predictive Modeling: BIM Command Recommendation Based on Large-scale Usage Logs",
    "abstract": "The adoption of Building Information Modeling (BIM) and model-based design within the Architecture, Engineering, and Construction (AEC) industry has been hindered by the perception that using BIM authoring tools demands more effort than conventional 2D drafting. To enhance design efficiency, this paper proposes a BIM command recommendation framework that predicts the optimal next actions in real-time based on users' historical interactions. We propose a comprehensive filtering and enhancement method for large-scale raw BIM log data and introduce a novel command recommendation model. Our model builds upon the state-of-the-art Transformer backbones originally developed for large language models (LLMs), incorporating a custom feature fusion module, dedicated loss function, and targeted learning strategy. In a case study, the proposed method is applied to over 32 billion rows of real-world log data collected globally from the BIM authoring software Vectorworks. Experimental results demonstrate that our method can learn universal and generalizable modeling patterns from anonymous user interaction sequences across different countries, disciplines, and projects. When generating recommendations for the next command, our approach achieves a Recall@10 of approximately 84%. The code is available at: https://github.com/dcy0577/BIM-Command-Recommendation.git",
    "authors": [
      "Changyu Du",
      "Zihan Deng",
      "Stavros Nousias",
      "André Borrmann"
    ],
    "publication_date": "2025-02-23T11:47:57Z",
    "arxiv_id": "http://arxiv.org/abs/2504.05319v2",
    "download_url": "https://arxiv.org/abs/2504.05319v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "IMPRESS: Improving Engagement in Software Engineering Courses through Gamification",
    "abstract": "Software Engineering courses play an important role for preparing students with the right knowledge and attitude for software development in practice. The implication is far reaching, as the quality of the software that we use ultimately depends on the quality of the people that make them. Educating Software Engineering, however, is quite challenging, as the subject is not considered as most exciting by students, while teachers often have to deal with exploding number of students. The EU project IMPRESS seeks to explore the use of gamification in educating software engineering at the university level to improve students' engagement and hence their appreciation for the taught subjects. This paper presents the project, its objectives, and its current progress.",
    "authors": [
      "Tanja E. J. Vos",
      "I. S. W. B. Prasetya",
      "Gordon Fraser",
      "Ivan Martinez-Ortiz",
      "Ivan Perez-Colado",
      "Rui Prada",
      "Jose Rocha",
      "Antonio Rito Silva"
    ],
    "publication_date": "2019-12-14T14:09:15Z",
    "arxiv_id": "http://arxiv.org/abs/1912.06850v1",
    "download_url": "https://arxiv.org/abs/1912.06850v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Do Design Metrics Capture Developers Perception of Quality? An Empirical Study on Self-Affirmed Refactoring Activities",
    "abstract": "Background. Refactoring is a critical task in software maintenance and is generally performed to enforce the best design and implementation practices or to cope with design defects. Several studies attempted to detect refactoring activities through mining software repositories allowing to collect, analyze and get actionable data-driven insights about refactoring practices within software projects. Aim. We aim at identifying, among the various quality models presented in the literature, the ones that are more in-line with the developer's vision of quality optimization, when they explicitly mention that they are refactoring to improve them. Method. We extract a large corpus of design-related refactoring activities that are applied and documented by developers during their daily changes from 3,795 curated open source Java projects. In particular, we extract a large-scale corpus of structural metrics and anti-pattern enhancement changes, from which we identify 1,245 quality improvement commits with their corresponding refactoring operations, as perceived by software engineers. Thereafter, we empirically analyze the impact of these refactoring operations on a set of common state-of-the-art design quality metrics. Results. The statistical analysis of the obtained results shows that (i) a few state-of-the-art metrics are more popular than others; and (ii) some metrics are being more emphasized than others. Conclusions. We verify that there are a variety of structural metrics that can represent the internal quality attributes with different degrees of improvement and degradation of software quality. Most of the metrics that are mapped to the main quality attributes do capture developer intentions of quality improvement reported in the commit messages.",
    "authors": [
      "Eman Abdullah AlOmar",
      "Mohamed Wiem Mkaouer",
      "Ali Ouni",
      "Marouane Kessentini"
    ],
    "publication_date": "2019-07-10T15:34:50Z",
    "arxiv_id": "http://arxiv.org/abs/1907.04797v1",
    "download_url": "https://arxiv.org/abs/1907.04797v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A systematic literature review of capstone courses in software engineering",
    "abstract": "Tertiary education institutions aim to prepare their computer science and software engineering students for working life. While much of the technical principles are covered in lower-level courses, team-based capstone projects are a common way to provide students with hands-on experience and teach soft skills. This paper explores the characteristics of software engineering capstone courses presented in the literature. The goal of this work is to understand the pros and cons of different approaches by synthesising the various aspects of software engineering capstone courses and related experiences. In a systematic literature review for 2007-2022, we identified 127 primary studies. These studies were analysed based on their presented course characteristics and the reported course outcomes. The characteristics were synthesised into a taxonomy consisting of duration, team sizes, client and project sources, project implementation, and student assessment. We found out that capstone courses generally last one semester and divide students into groups of 4-5 where they work on a project for a client. For a slight majority of courses, the clients are external to the course staff and students are often expected to produce a proof-of-concept level software product as the main end deliverable. The courses also offer versatile assessments for students throughout the project. This paper provides researchers and educators with a classification of characteristics of software engineering capstone courses based on previous research. We further synthesise insights on the reported outcomes of capstone courses. Our review study aims to help educators to identify various ways of organising capstones and effectively plan and deliver their own capstone courses. The characterisation also helps researchers to conduct further studies on software engineering capstones.",
    "authors": [
      "Saara Tenhunen",
      "Tomi Männistö",
      "Matti Luukkainen",
      "Petri Ihantola"
    ],
    "publication_date": "2023-01-09T18:04:35Z",
    "arxiv_id": "http://arxiv.org/abs/2301.03554v1",
    "download_url": "https://arxiv.org/abs/2301.03554v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Seamless Digital Engineering: A Grand Challenge Driven by Needs",
    "abstract": "Digital Engineering currently relies on costly and often bespoke integration of disparate software products to assemble the authoritative source of truth of the system-of-interest. Tools not originally designed to work together become an acknowledged system-of-systems, with their own separate feature roadmaps, deprecation, and support timelines. The resulting brittleness and conglomeration of disparate interfaces in the Digital Engineering Ecosystem of an organization drains resources and impairs efficiency and efficacy. If Model-Based Systems Engineering were applied to this problem, a complete system architecture model would be defined, and a purpose-built computing system-of-systems would be constructed to satisfy stakeholder needs. We have decades of research in computer science, cybersecurity, software and systems engineering, and human-computer interaction from which to draw that informs the design of a Seamless Digital Engineering tooling system, but it would require starting from a clean slate while carefully adopting existing standards. In this paper, this problem space and solution space are characterized, defining and identifying Seamless Digital Engineering as a grand challenge in Digital Engineering research.",
    "authors": [
      "James S. Wheaton",
      "Daniel R. Herber"
    ],
    "publication_date": "2024-01-04T04:53:46Z",
    "arxiv_id": "http://arxiv.org/abs/2401.02059v1",
    "download_url": "https://arxiv.org/abs/2401.02059v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Consensus in Software Engineering: A Cognitive Mapping Study",
    "abstract": "Background: Philosophers of science including Collins, Feyerabend, Kuhn and Latour have all emphasized the importance of consensus within scientific communities of practice. Consensus is important for maintaining legitimacy with outsiders, orchestrating future research, developing educational curricula and agreeing industry standards. Low consensus contrastingly undermines a field's reputation and hinders peer review. Aim: This paper aims to investigate the degree of consensus within the software engineering academic community concerning members' implicit theories of software engineering. Method: A convenience sample of 60 software engineering researchers produced diagrams describing their personal understanding of causal relationships between core software engineering constructs. The diagrams were then analyzed for patterns and clusters. Results: At least three schools of thought may be forming; however, their interpretation is unclear since they do not correspond to known divisions within the community (e.g. Agile vs. Plan-Driven methods). Furthermore, over one third of participants do not belong to any cluster. Conclusion: Although low consensus is common in social sciences, the rapid pace of innovation observed in software engineering suggests that high consensus is achievable given renewed commitment to empiricism and evidence-based practice.",
    "authors": [
      "Pontus Johnson",
      "Paul Ralph",
      "Mathias Ekstedt",
      "Iaakov Exman",
      "Michael Goedicke"
    ],
    "publication_date": "2018-02-18T02:12:49Z",
    "arxiv_id": "http://arxiv.org/abs/1802.06319v1",
    "download_url": "https://arxiv.org/abs/1802.06319v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extending Resource Constrained Project Scheduling to Mega-Projects with Model-Based Systems Engineering & Hetero-functional Graph Theory",
    "abstract": "Within the project management context, project scheduling serves as an indispensable component, functioning as a fundamental tool for planning, monitoring, controlling, and managing projects more broadly. Although the resource-constrained project scheduling problem (RCPSP) lies at the core of project management activities, it remains largely disconnected from the broader literature on model-based systems engineering (MBSE), thereby limiting its integration into the design and management of complex systems. The original contribution of this paper is twofold. First, the paper seeks to reconcile the RCPSP with the broader literature and vocabulary of model-based systems engineering and hetero-functional graph theory (HFGT). A concrete translation pipeline from an activity-on-node network to a SysML activity diagram, and then to an operand net is constructed. Using this representation, it specializes the hetero-functional network minimum-cost flow (HFNMCF) formulation to the RCPSP context as a systematic means of HFGT for quantitative analysis and proves that the RCPSP is recoverable as a special case of a broader model. Secondly, on an illustrative instance with renewable and non-renewable operands, the specialized HFNMCF, while producing similar schedules, yields explicit explanations of the project states that enable richer monitoring and control. Overall, the framework preserves the strengths of the classical RCPSP while accommodating real-world constraints and enterprise-level decision processes encountered in large, complex megaprojects.",
    "authors": [
      "Amirreza Hosseini",
      "Amro M. Farid"
    ],
    "publication_date": "2025-10-21T19:26:00Z",
    "arxiv_id": "http://arxiv.org/abs/2510.19035v1",
    "download_url": "https://arxiv.org/abs/2510.19035v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "IoT Roadmap: Support for Internet of Things Software Systems Engineering",
    "abstract": "The Roadmap is performed in the context of a Ph.D. research in collaboration between the Experimental Software Engineering Group, from the Systems Engineering and Computing Program of the Federal University of Rio de Janeiro (COPPE/UFRJ) and the Laboratory of Industrial and Human Automation Control, Mechanical engineering and Computer Science (LAMIH UMR CNRS 8201) in the Universitè Polytechnique Hauts-de-France (UPHF).\n  The Roadmap resulted from an investigation on the particularities of IoT applications. It is the concrete organization of the concepts and evidence gathered from different experimental studies. It comes to support the definition of IoT software systems, with specific items for the project team to discuss and define the essential aspects related to the specifying, designing, and implementing an IoT application.",
    "authors": [
      "Rebeca Motta",
      "Káthia Oliveira",
      "Guilherme Travassos"
    ],
    "publication_date": "2021-03-08T18:41:31Z",
    "arxiv_id": "http://arxiv.org/abs/2103.04969v3",
    "download_url": "https://arxiv.org/abs/2103.04969v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]