[
  {
    "title": "Image Enhancement and Noise Reduction Using Modified Delay-Multiply-and-Sum Beamformer: Application to Medical Photoacoustic Imaging",
    "abstract": "Photoacoustic imaging (PAI) is an emerging biomedical imaging modality capable of providing both high contrast and high resolution of optical and UltraSound (US) imaging. When a short duration laser pulse illuminates the tissue as a target of imaging, tissue induces US waves and detected waves can be used to reconstruct optical absorption distribution. Since receiving part of PA consists of US waves, a large number of beamforming algorithms in US imaging can be applied on PA imaging. Delay-and-Sum (DAS) is the most common beamforming algorithm in US imaging. However, make use of DAS beamformer leads to low resolution images and large scale of off-axis signals contribution. To address these problems a new paradigm namely Delay-Multiply-and-Sum (DMAS), which was used as a reconstruction algorithm in confocal microwave imaging for breast cancer detection, was introduced for US imaging. Consequently, DMAS was used in PA imaging systems and it was shown this algorithm results in resolution enhancement and sidelobe degrading. However, in presence of high level of noise the reconstructed image still suffers from high contribution of noise. In this paper, a modified version of DMAS beamforming algorithm is proposed based on DAS inside DMAS formula expansion. The quantitative and qualitative results show that proposed method results in more noise reduction and resolution enhancement in expense of contrast degrading. For the simulation, two-point target, along with lateral variation in two depths of imaging are employed and it is evaluated under high level of noise in imaging medium. Proposed algorithm in compare to DMAS, results in reduction of lateral valley for about 19 dB followed by more distinguished two-point target. Moreover, levels of sidelobe are reduced for about 25 dB.",
    "authors": [
      "Moein Mozaffarzadeh",
      "Ali Mahloojifar",
      "Mahdi Orooji"
    ],
    "publication_date": "2018-01-18T13:49:05Z",
    "arxiv_id": "http://arxiv.org/abs/1801.06014v1",
    "download_url": "https://arxiv.org/abs/1801.06014v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Resilient-Economic Coordinated Robust Operation of Integrated Electric-Gas Systems",
    "abstract": "Interactions between power and gas systems, which are both large and complex, have been gradually intensified during the last decades, predominantly due to the propagation of large fleet natural gas-fired power units (GPUs) and the technological developments of power-to-gas (P2G) facilities. These interactions not only bring significant economic benefits to society but also provide additional operating flexibilities, which are essential to handle fluctuations of the large-scale renewable power generation (RPG) and power system contingencies. Moreover, neglecting these interactions in power system operation may not only result in infeasible operation status in the gas systems but also increase the decision-making operation costs of both systems. previous studies suffered from two significant drawbacks, namely (1) they assumed the existence of only one utility that has full control authority over the power system and gas system; (2) the economic interactions between power systems and gas systems have been neglected, which goes against the current industrial practice. This research revisits the day-ahead resilient and economic operations of power systems considering the economic and physical interactions with gas systems, which are characterized by the modeling of bilateral energy purchase contracts and operational constraints of gas systems. This thesis provides a novel perspective and solution for the resilient and economically coordinated robust operation of integrated electric-gas systems (IEGSs) under uncertainties. The proposed robust scheduling decision frameworks are practically compatible with the existing industrial operations of the IEGSs.",
    "authors": [
      "Ahmed Rabee Sayed",
      "Cheng Wang",
      "Tianshu Bi"
    ],
    "publication_date": "2023-04-28T15:32:28Z",
    "arxiv_id": "http://arxiv.org/abs/2304.14909v2",
    "download_url": "https://arxiv.org/abs/2304.14909v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Study and Observation of the Variations of Accuracies for Handwritten Digits Recognition with Various Hidden Layers and Epochs using Neural Network Algorithm",
    "abstract": "In recent days, Artificial Neural Network (ANN) can be applied to a vast majority of fields including business, medicine, engineering, etc. The most popular areas where ANN is employed nowadays are pattern and sequence recognition, novelty detection, character recognition, regression analysis, speech recognition, image compression, stock market prediction, Electronic nose, security, loan applications, data processing, robotics, and control. The benefits associated with its broad applications leads to increasing popularity of ANN in the era of 21st Century. ANN confers many benefits such as organic learning, nonlinear data processing, fault tolerance, and self-repairing compared to other conventional approaches. The primary objective of this paper is to analyze the influence of the hidden layers of a neural network over the overall performance of the network. To demonstrate this influence, we applied neural network with different layers on the MNIST dataset. Also, another goal is to observe the variations of accuracies of ANN for different numbers of hidden layers and epochs and to compare and contrast among them.",
    "authors": [
      "Md. Abu Bakr Siddique",
      "Mohammad Mahmudur Rahman Khan",
      "Rezoana Bente Arif",
      "Zahidun Ashrafi"
    ],
    "publication_date": "2018-09-17T13:28:19Z",
    "arxiv_id": "http://arxiv.org/abs/1809.06188v3",
    "download_url": "https://arxiv.org/abs/1809.06188v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chaotic Dynamics Derived from the Montgomery Conjecture: Application to Electrical Systems",
    "abstract": "Here, we introduce a novel method for obtaining chaotic dynamics based on the Montgomery conjecture for the pair correlation of zeros of the Riemann zeta function. Motivated by the conjecture, we present a recursive relation that reveals chaotic behavior. Notably, we provide insights into the possible uses of this derived chaotic dynamics in electrical engineering by interpreting it as a unique representation of an electrical system. Furthermore, we investigate the relevance of entropy, bifurcation analysis, and chaos theory in this framework for electrical systems. We look into its applicability to signal processing, stability analysis through bifurcation, and how entropy measures the predictability or unpredictability of electrical signals. Additionally, we discuss the system's strange attractor and its transition to voltage collapse, highlighting the interplay between chaotic dynamics and stability in electrical systems. Furthermore, we analyze the system's energy distribution, taking into account how chaotic dynamics may affect energy allocation or dissipation. Furthermore, we compare the chaotification and Hermiticity of the resulting operators between Yitang dynamics and Montgomery dynamics. To have a better grasp of the spectrum features of each operator, we calculate the eigenvalues for each one obtained from the corresponding dynamics. Our results provide fresh insights into number-theoretic chaotic dynamics and how they might be applied in real-world electrical engineering applications. This work provides encouraging opportunities for further research and technology developments by laying the foundation for creative investigations in system dynamics.",
    "authors": [
      "Zeraoulia Rafik",
      "Alvaro Humberto Salas",
      "Ayadi Souad"
    ],
    "publication_date": "2024-03-16T01:11:07Z",
    "arxiv_id": "http://arxiv.org/abs/2406.12863v2",
    "download_url": "https://arxiv.org/abs/2406.12863v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Real-time Electrical Power Prediction in a Combined Cycle Power Plant",
    "abstract": "The prediction of electrical power in combined cycle power plants is a key challenge in the electrical power and energy systems field. This power output can vary depending on environmental variables, such as temperature, pressure, and humidity. Thus, the business problem is how to predict the power output as a function of these environmental conditions in order to maximize the profit. The research community has solved this problem by applying machine learning techniques and has managed to reduce the computational and time costs in comparison with the traditional thermodynamical analysis. Until now, this challenge has been tackled from a batch learning perspective in which data is assumed to be at rest, and where models do not continuously integrate new information into already constructed models. We present an approach closer to the Big Data and Internet of Things paradigms in which data is arriving continuously and where models learn incrementally, achieving significant enhancements in terms of data processing (time, memory and computational costs), and obtaining competitive performances. This work compares and examines the hourly electrical power prediction of several streaming regressors, and discusses about the best technique in terms of time processing and performance to be applied on this streaming scenario.",
    "authors": [
      "Jesus L. Lobo",
      "Igor Ballesteros",
      "Izaskun Oregi",
      "Javier Del Ser"
    ],
    "publication_date": "2019-07-22T10:34:23Z",
    "arxiv_id": "http://arxiv.org/abs/1907.11653v1",
    "download_url": "https://arxiv.org/abs/1907.11653v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An integrated algorithm for evaluating plug-in electric vehicle impact on the state of power grid assets",
    "abstract": "Plug-in Electric Vehicles (PEV) exert an increasingly disruptive influence on power delivery systems with penetration surge in the past decade. Therefore, accurately assessing their impact plays a crucial role in managing grid assets and maintaining power grids reliability. However, PEV loads are stochastic and impulsive, which means they are of high power density and vary in a fast and discrete manner. These load characteristics make conventional assessment methods unsuitable. This paper proposes an algorithm, which captures the inter-temporal response of grid assets and allows fast assessment through an integrated interface. To realize these advantageous features, we establish analytical models for two generic classes of grid assets (continuous and discrete operating assets) and recast their cost functions in the statistical settings of PEV charging. Distinct from simulation-based methods, the proposed method is analytical, and thus greatly reduce the computation resources and data required for accurate assessment. The effectiveness of the proposed algorithm has been demonstrated on a set of power distribution networks in Columbus metropolitan area, in comparison with the conventional assessment methods.",
    "authors": [
      "Daijiafan Mao",
      "Ziran Gao",
      "Jiankang Wang"
    ],
    "publication_date": "2019-02-15T05:16:21Z",
    "arxiv_id": "http://arxiv.org/abs/1902.09454v2",
    "download_url": "https://arxiv.org/abs/1902.09454v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Study and Observation of the Variations of Accuracies for Handwritten Digits Recognition with Various Hidden Layers and Epochs using Convolutional Neural Network",
    "abstract": "Nowadays, deep learning can be employed to a wide ranges of fields including medicine, engineering, etc. In deep learning, Convolutional Neural Network (CNN) is extensively used in the pattern and sequence recognition, video analysis, natural language processing, spam detection, topic categorization, regression analysis, speech recognition, image classification, object detection, segmentation, face recognition, robotics, and control. The benefits associated with its near human level accuracies in large applications lead to the growing acceptance of CNN in recent years. The primary contribution of this paper is to analyze the impact of the pattern of the hidden layers of a CNN over the overall performance of the network. To demonstrate this influence, we applied neural network with different layers on the Modified National Institute of Standards and Technology (MNIST) dataset. Also, is to observe the variations of accuracies of the network for various numbers of hidden layers and epochs and to make comparison and contrast among them. The system is trained utilizing stochastic gradient and backpropagation algorithm and tested with feedforward algorithm.",
    "authors": [
      "Rezoana Bente Arif",
      "Md. Abu Bakr Siddique",
      "Mohammad Mahmudur Rahman Khan",
      "Mahjabin Rahman Oishe"
    ],
    "publication_date": "2018-09-17T13:28:02Z",
    "arxiv_id": "http://arxiv.org/abs/1809.06187v3",
    "download_url": "https://arxiv.org/abs/1809.06187v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Radar Cross Section Reduction of Microstrip Patch Antenna using Metamaterial Techniques",
    "abstract": "Radar cross section (RCS) reduction has become one of the critical research areas in recent years. The RCS of the target should be small to avoid detection. Different methods are used to reduce RCS, but the major challenge with many RCS minimization methodologies is that, it may deteriorate some antenna parameters. When antenna mode RCS is considered; structural mode RCS, and antenna parameters are critical, as the structure should be an antenna and a RCS reducing structure simultaneously. The techniques like applying Radar Absorption Material (RAM) entirely over the target, deployment of Energy Band Gap (EBG) structures, the use of passive, active cancellation, and polarization conversion are prevalent methods to reduce RCS. The manifestation of metamaterial property in an antenna results in the antenna's electromagnetic characteristics becoming negative for a particular bandwidth. Thus the RCS of the antenna can be reduced to a minimum range by loading the metamaterial structures. This paper discusses the application of polarization conversion method (PCM), L-structured and Square-structured fractal metamaterial antenna for RCS reduction. This paper reports the simulation, fabrication, and testing of the above antennas with their performance comparison. The antennas are designed for 4.3GHz frequency with a total dimension of 80mmx80mmx1.6mm. Antenna parameters like return loss, gain, radiation pattern, and bandwidth are analyzed along with the RCS. The L-structured metamaterial antenna implemented has a 29.37% larger bandwidth than the reference patch antenna with a gain of 2.94dB with a return loss of -28.28dB.",
    "authors": [
      "Syamly S. B",
      "Job Chunkath"
    ],
    "publication_date": "2023-06-30T05:22:59Z",
    "arxiv_id": "http://arxiv.org/abs/2306.17406v1",
    "download_url": "https://arxiv.org/abs/2306.17406v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Constrained RS coding for Low Peak to Average Power Ratio in FBMC -- OQAM Systems",
    "abstract": "Multi-carrier modulation techniques have now become a standard in many communication protocols. Filter bank based multi-carrier (FBMC) generation techniques have been discussed in the literature as a means for overcoming the shortcomings of IFFT/FFT based OFDM system. The Peak to Average Power Ratio (PAPR) is a problem faced by all multi-carrier techniques. This paper discusses the methods for reducing PAPR in a FBMC system while maintaining acceptable Bit Error Rate (BER). A new PAPR minimizing scheme called Constrained Reed Solomon (CRS) coding is proposed. The hybrid techniques using coding and companding are tested for different channel models and is found to yield promising results.",
    "authors": [
      "Job Chunkath",
      "V. S. Sheeba",
      "Nisha Varghese"
    ],
    "publication_date": "2023-06-29T05:11:55Z",
    "arxiv_id": "http://arxiv.org/abs/2306.16685v2",
    "download_url": "https://arxiv.org/abs/2306.16685v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Heuristic Optimization of Electrical Energy Systems: Refined Metrics to Compare the Solutions",
    "abstract": "Many optimization problems admit a number of local optima, among which there is the global optimum. For these problems, various heuristic optimization methods have been proposed. Comparing the results of these solvers requires the definition of suitable metrics. In the electrical energy systems literature, simple metrics such as best value obtained, the mean value, the median or the standard deviation of the solutions are still used. However, the comparisons carried out with these metrics are rather weak, and on these bases a somehow uncontrolled proliferation of heuristic solvers is taking place. This paper addresses the overall issue of understanding the reasons of this proliferation, showing a conceptual scheme that indicates how the assessment of the best solver may result in the unlimited formulation of new solvers. Moreover, this paper shows how the use of more refined metrics defined to compare the optimization result, associated with the definition of appropriate benchmarks, may make the comparisons among the solvers more robust. The proposed metrics are based on the concept of first-order stochastic dominance and are defined for the cases in which: (i) the globally optimal solution can be found (for testing purposes); and (ii) the number of possible solutions is so large that practically it cannot be guaranteed that the global optimum has been found. Illustrative examples are provided for a typical problem in the electrical energy systems area-distribution network reconfiguration. The conceptual results obtained are generally valid to compare the results of other optimization problems.",
    "authors": [
      "Gianfranco Chicco",
      "Andrea Mazza"
    ],
    "publication_date": "2018-10-02T12:43:58Z",
    "arxiv_id": "http://arxiv.org/abs/1810.02196v2",
    "download_url": "https://arxiv.org/abs/1810.02196v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Routing of Electric Vehicles in a Stochastic Network with Non-recurrent Incidents",
    "abstract": "An approach for mapping an electric vehicle EV driver s travel time constraints and risk taking behavior to real time routing in a probabilistic time-dependent or stochastic network is proposed in this paper. The proposed approach is based on a heuristic algorithm that finds the shortest path according to the driver s preferences. Accounting for en route delays and alternate routes, the EV routing problem in stochastic networks is shown to exhibit other than the First In First Out FIFO property i.e. the traveling time for those who depart earlier may not sooner of those who depart later or wait en route in the charging stations. The proposed approach provides EV drivers the option to manage their trip and reach the destination on time, while by taking advantage of the non FIFO characteristics of the traffic network, charge their cars en route. The proposed routing algorithm is tested on a given stochastic transportation network. The best routes based on the driver s preferences are identified while accounting for the best-planned delays at the charging stations or en-route.",
    "authors": [
      "Mohammad Arani",
      "Mohammad Mehdi Rezvani",
      "Hamzeh Davarikia",
      "Yupo Chan"
    ],
    "publication_date": "2019-12-28T01:20:26Z",
    "arxiv_id": "http://arxiv.org/abs/2001.08587v2",
    "download_url": "https://arxiv.org/abs/2001.08587v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MR-Based Electrical Property Reconstruction Using Physics-Informed Neural Networks",
    "abstract": "Electrical properties (EP), namely permittivity and electric conductivity, dictate the interactions between electromagnetic waves and biological tissue. EP can be potential biomarkers for pathology characterization, such as cancer, and improve therapeutic modalities, such radiofrequency hyperthermia and ablation. MR-based electrical properties tomography (MR-EPT) uses MR measurements to reconstruct the EP maps. Using the homogeneous Helmholtz equation, EP can be directly computed through calculations of second order spatial derivatives of the measured magnetic transmit or receive fields $(B_{1}^{+}, B_{1}^{-})$. However, the numerical approximation of derivatives leads to noise amplifications in the measurements and thus erroneous reconstructions. Recently, a noise-robust supervised learning-based method (DL-EPT) was introduced for EP reconstruction. However, the pattern-matching nature of such network does not allow it to generalize for new samples since the network's training is done on a limited number of simulated data. In this work, we leverage recent developments on physics-informed deep learning to solve the Helmholtz equation for the EP reconstruction. We develop deep neural network (NN) algorithms that are constrained by the Helmholtz equation to effectively de-noise the $B_{1}^{+}$ measurements and reconstruct EP directly at an arbitrarily high spatial resolution without requiring any known $B_{1}^{+}$ and EP distribution pairs.",
    "authors": [
      "Xinling Yu",
      "José E. C. Serrallés",
      "Ilias I. Giannakopoulos",
      "Ziyue Liu",
      "Luca Daniel",
      "Riccardo Lattanzi",
      "Zheng Zhang"
    ],
    "publication_date": "2022-10-23T00:56:22Z",
    "arxiv_id": "http://arxiv.org/abs/2210.12584v1",
    "download_url": "https://arxiv.org/abs/2210.12584v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Memory Management Strategies for an Internet of Things System",
    "abstract": "The rise of the Internet has brought about significant changes in our lives, and the rapid expansion of the Internet of Things (IoT) is poised to have an even more substantial impact by connecting a wide range of devices across various application domains. IoT devices, especially low-end ones, are constrained by limited memory and processing capabilities, necessitating efficient memory management within IoT operating systems. This paper delves into the importance of memory management in IoT systems, with a primary focus on the design and configuration of such systems, as well as the scalability and performance of scene management. Effective memory management is critical for optimizing resource usage, responsiveness, and adaptability as the IoT ecosystem continues to grow. The study offers insights into memory allocation, scene execution, memory reduction, and system scalability within the context of an IoT system, ultimately highlighting the vital role that memory management plays in facilitating a seamless and efficient IoT experience.",
    "authors": [
      "Ana-Maria Comeagă",
      "Iuliana Marin"
    ],
    "publication_date": "2023-11-17T11:26:56Z",
    "arxiv_id": "http://arxiv.org/abs/2311.10458v1",
    "download_url": "https://arxiv.org/abs/2311.10458v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Incentive Mechanisms to Prevent Efficiency Loss of Non-Profit Utilities",
    "abstract": "The modernization of the power system introduces technologies that may improve the system's efficiency by enhancing the capabilities of users. Despite their potential benefits, such technologies can have a negative impact. This subject has widely analyzed, mostly considering for-profit electric utilities. However, the literature has a gap regarding the impact of new technologies on non-profit utilities.\n  In this work, we quantify the price of anarchy of non-profit utilities, that is, the cost caused by lack of coordination of users. We find that users, in the worst case, can consume up to twice the optimal demand, obtaining a small fraction of the optimal surplus. For this reason, we leverage the theory of mechanism design to design an incentive scheme that reduces the inefficiencies of the system, which preserves the privacy of users. We illustrate with simulations the efficiency loss of the system and show two instances of incentive mechanism that satisfy either budget balance and budget deficit.",
    "authors": [
      "Carlos Barreto",
      "Eduardo Mojica-Nava",
      "Nicanor Quijano"
    ],
    "publication_date": "2019-06-26T22:44:30Z",
    "arxiv_id": "http://arxiv.org/abs/1906.11372v1",
    "download_url": "https://arxiv.org/abs/1906.11372v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Driving Conditions-Driven Energy Management for Hybrid Electric Vehicles: A Review",
    "abstract": "Motivated by the concerns on transported fuel consumption and global air pollution, industrial engineers, and academic researchers have made many efforts to construct more efficient and environment-friendly vehicles. Hybrid electric vehicles (HEVs) are the representative ones because they can satisfy the power demand by coordinating energy supplements among different energy storage devices. To achieve this goal, energy management approaches are crucial technology, and driving cycles are the critical influence factor. Therefore, this paper aims to summarize driving cycle-driven energy management strategies (EMSs) for HEVs. First, the definition and significance of driving cycles in the energy management field are clarified, and the recent literature in this research domain is reviewed and revisited. In addition, according to the known information of driving cycles, the EMSs are divided into three categories, and the relevant study directions, such as standard driving cycles, long-term driving cycle generation (LT-DCG) and short-term driving cycle prediction (ST-DCP) are illuminated and analyzed. Furthermore, the existing database of driving cycles in highway and urban aspects are displayed and discussed. Finally, this article also elaborates on the future prospects of energy management technologies related to driving cycles. This paper focusing on helping the relevant researchers realize the state-of-the-art of HEVs energy management field and also recognize its future development direction.",
    "authors": [
      "Teng Liu",
      "Wenhao Tan",
      "Xiaolin Tang",
      "Jinwei Zhang",
      "Yang Xing",
      "Dongpu Cao"
    ],
    "publication_date": "2020-07-16T14:52:46Z",
    "arxiv_id": "http://arxiv.org/abs/2007.10880v2",
    "download_url": "https://arxiv.org/abs/2007.10880v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Advancing Renewable Electricity Consumption With Reinforcement Learning",
    "abstract": "As the share of renewable energy sources in the present electric energy mix rises, their intermittence proves to be the biggest challenge to carbon free electricity generation. To address this challenge, we propose an electricity pricing agent, which sends price signals to the customers and contributes to shifting the customer demand to periods of high renewable energy generation. We propose an implementation of a pricing agent with a reinforcement learning approach where the environment is represented by the customers, the electricity generation utilities and the weather conditions.",
    "authors": [
      "Filip Tolovski"
    ],
    "publication_date": "2020-03-09T20:57:58Z",
    "arxiv_id": "http://arxiv.org/abs/2003.04310v1",
    "download_url": "https://arxiv.org/abs/2003.04310v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Two methods for solving optimization problems arising in electronic measurements and electrical engineering",
    "abstract": "In this paper we introduce a common problem in electronic measurements and electrical engineering: finding the first root from the left of an equation in the presence of some initial conditions. We present examples of electrotechnical devices (analog signal filtering), where it is necessary to solve it. Two new methods for solving this problem, based on global optimization ideas, are introduced. The first uses the exact a priori given global Lipschitz constant for the first derivative. The second method adaptively estimates local Lipschitz constants during the search. Both algorithms either find the first root from the left or determine the global minimizers (in the case when the objective function has no roots). Sufficient conditions for convergence of the new methods to the desired solution are established in both cases. The results of numerical experiments for real problems and a set of test functions are also presented.",
    "authors": [
      "Yaroslav D. Sergeyev",
      "Pasquale Daponte",
      "Domenico Grimaldi",
      "Anna Molinaro"
    ],
    "publication_date": "2011-03-19T18:38:52Z",
    "arxiv_id": "http://arxiv.org/abs/1103.3801v1",
    "download_url": "https://arxiv.org/abs/1103.3801v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]