[
  {
    "title": "Toward Integrated Human-machine Intelligence for Civil Engineering: An\n  Interdisciplinary Perspective",
    "abstract": "The purpose of this paper is to examine the opportunities and barriers of\nIntegrated Human-Machine Intelligence (IHMI) in civil engineering. Integrating\nartificial intelligence's high efficiency and repeatability with humans'\nadaptability in various contexts can advance timely and reliable\ndecision-making during civil engineering projects and emergencies. Successful\ncases in other domains, such as biomedical science, healthcare, and\ntransportation, showed the potential of IHMI in data-driven, knowledge-based\ndecision-making in numerous civil engineering applications. However, whether\nthe industry and academia are ready to embrace the era of IHMI and maximize its\nbenefit to the industry is still questionable due to several knowledge gaps.\nThis paper thus calls for future studies in exploring the value, method, and\nchallenges of applying IHMI in civil engineering. Our systematic review of the\nliterature and motivating cases has identified four knowledge gaps in achieving\neffective IHMI in civil engineering. First, it is unknown what types of tasks\nin the civil engineering domain can be assisted by AI and to what extent.\nSecond, the interface between human and AI in civil engineering-related tasks\nneed more precise and formal definition. Third, the barriers that impede\ncollecting detailed behavioral data from humans and contextual environments\ndeserve systematic classification and prototyping. Lastly, it is unknown what\nexpected and unexpected impacts will IHMI have on the AEC industry and\nentrepreneurship. Analyzing these knowledge gaps led to a list of identified\nresearch questions. This paper will lay the foundation for identifying relevant\nstudies to form a research roadmap to address the four knowledge gaps\nidentified.",
    "authors": [
      "Cheng Zhang",
      "Jinwoo Kim",
      "JungHo Jeon",
      "Jinding Xing",
      "Changbum Ahn",
      "Pingbo Tang",
      "Hubo Cai"
    ],
    "publication_date": "2021-07-28T17:10:12Z",
    "arxiv_id": "http://arxiv.org/abs/2107.13498v1",
    "download_url": "http://arxiv.org/abs/2107.13498v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "State of the Art of Augmented Reality (AR) Capabilities for Civil\n  Infrastructure Applications",
    "abstract": "Augmented Reality (AR) is a technology superimposing interactional virtual\nobjects onto a real environment. Since the beginning of the millennium, AR\ntechnologies have shown rapid growth, with significant research publications in\nengineering and science. However, the civil infrastructure community has\nminimally implemented AR technologies to date. One of the challenges that civil\nengineers face when understanding and using AR is the lack of a classification\nof AR in the context of capabilities for civil infrastructure applications.\nPractitioners in civil infrastructure, like most engineering fields, prioritize\nunderstanding the level of maturity of a new technology before considering its\nadoption and field implementation. This paper compares the capabilities of\nsixteen AR Head-Mounted Devices (HMDs) available in the market since 2017,\nranking them in terms of performance for civil infrastructure implementations.\nFinally, the authors recommend a development framework for practical AR\ninterfaces with civil infrastructure and operations.",
    "authors": [
      "Jiaqi Xu",
      "Derek Doyle",
      "Fernando Moreu"
    ],
    "publication_date": "2021-10-17T01:34:59Z",
    "arxiv_id": "http://arxiv.org/abs/2110.08698v1",
    "download_url": "http://arxiv.org/abs/2110.08698v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring Fermi's Paradox using an Intragalactic Colonization Model",
    "abstract": "We explore Fermi's Paradox via a system of differential equations and using\nsimulations of dispersal and interactions between competing interplanetary\ncivilizations. To quantify the resources and potentials of these worlds, three\ndifferent state variables representing population, environment, and technology,\nare used. When encounters occur between two different civilizations, the\ndeterministic Lanchester Battle Model is used to determine the outcome of the\nconflict. We use the Unity engine to simulate the possible outcomes of\ncolonization by different types of civilizations to further investigate Fermi's\nquestion.\n  When growth rates of population, technology and nature are out of balance,\nplanetary civilizations can collapse. If the balance is adequate, then some\ncivilizations can develop into dominating ones; nevertheless, they leave large\nspatial gaps in the distribution of their colonies. The unexpected result is\nthat small civilizations can be left in existence by dominating civilizations\nin a galaxy due to those large gaps. Our results provide some insights into the\nvalidity of various solutions to Fermi's Paradox.",
    "authors": [
      "Gregory Roudenko",
      "Yurrian Pierre-Boyer"
    ],
    "publication_date": "2024-10-31T05:13:06Z",
    "arxiv_id": "http://arxiv.org/abs/2411.00061v1",
    "download_url": "http://arxiv.org/abs/2411.00061v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Digital Twins and Civil Engineering Phases: Reorienting Adoption\n  Strategies",
    "abstract": "Digital twin (DT) technology has received immense attention over the years\ndue to the promises it presents to various stakeholders in science and\nengineering. As a result, different thematic areas of DT have been explored.\nThis is no different in specific fields such as manufacturing, automation, oil\nand gas, and civil engineering, leading to fragmented approaches for\nfield-specific applications. The civil engineering industry is further\ndisadvantaged in this regard as it relies on external techniques by other\nengineering fields for its DT adoption. A rising consequence of these\nextensions is a concentrated application of DT to the operations and\nmaintenance phase. On another spectrum, Building Information Modeling (BIM) is\npervasively utilized in the planning/design phase, and the transient nature of\nthe construction phase remains a challenge for its DT adoption. In this paper,\nwe present a phase-based development of DT in the Architecture, Engineering,\nand Construction industry. We commence by presenting succinct expositions on DT\nas a concept and as a service, and establish a five-level scale system.\nFurthermore, we present separately a systematic literature review of the\nconventional techniques employed at each civil engineering phase. In this\nregard, we identified enabling technologies such as computer vision for\nextended sensing and the Internet of Things for reliable integration.\nUltimately, we attempt to reveal DT as an important tool across the entire life\ncycle of civil engineering projects, and nudge researchers to think more\nholistically in their quest for the integration of DT for civil engineering\napplications.",
    "authors": [
      "Taiwo A. Adebiyi",
      "Nafeezat A. Ajenifuja",
      "Ruda Zhang"
    ],
    "publication_date": "2024-03-04T19:18:53Z",
    "arxiv_id": "http://arxiv.org/abs/2403.02426v2",
    "download_url": "http://arxiv.org/abs/2403.02426v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Causal Diagrams for Structural Engineers",
    "abstract": "Causal diagrams are logic and graphical tools that depict assumptions about\npresumed causal relations. Such diagrams have proven effective in tackling a\nvariety of problems in social sciences and epidemiology research yet remain\nforeign to civil engineers. Unlike the traditional means of examining\nrelationships via multivariable regression, causal diagrams can identify the\npresence of confounders, colliders, and mediators. Thus, this paper hopes to\nintroduce the big ideas behind causal diagrams (specifically, directed acyclic\ngraphs (DAGs)) and how to create and apply such diagrams to several civil\nengineering problems. Findings from the presented case studies indicate that\ncivil engineers can successfully use causal diagrams to improve their\nunderstanding of complex causation relations, thereby accelerating research and\npractical efforts.",
    "authors": [
      "M. Z. Naser"
    ],
    "publication_date": "2023-06-27T23:42:43Z",
    "arxiv_id": "http://arxiv.org/abs/2306.15834v1",
    "download_url": "http://arxiv.org/abs/2306.15834v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum computing in civil engineering: Potentials and Limitations",
    "abstract": "Quantum computing is a new computational paradigm with the potential to solve\ncertain computationally challenging problems much faster than traditional\napproaches. Civil engineering encompasses many computationally challenging\nproblems, which leads to the question of how well quantum computing is suitable\nfor solving civil engineering problems and how much impact and implications to\nthe field of civil engineering can be expected when deploying quantum computing\nfor solving these problems. To address these questions, we will, in this paper,\nfirst introduce the fundamentals of quantum computing. Thereupon, we will\nanalyze the problem classes to elucidate where quantum computing holds the\npotential to outperform traditional computers and, focusing on the limitations,\nwhere quantum computing is not considered the most suitable solution. Finally,\nwe will review common complex computation use cases in civil engineering and\nevaluate the potential and the limitations of being improved by quantum\ncomputing.",
    "authors": [
      "Joern Ploennigs",
      "Markus Berger",
      "Martin Mevissen",
      "Kay Smarsly"
    ],
    "publication_date": "2024-02-22T13:50:55Z",
    "arxiv_id": "http://arxiv.org/abs/2402.14556v2",
    "download_url": "http://arxiv.org/abs/2402.14556v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Cosmic Hitchhikers Hypothesis: Extraterrestrial Civilizations Using\n  Free-Floating Planets for Interstellar Colonization",
    "abstract": "I propose the Cosmic Hitchhikers hypothesis as follows. Advanced\nextraterrestrial civilizations may use free-floating planets as interstellar\ntransportation for space exploration and interstellar colonization. Large\ngroups or populations of their biological species, post-biological species, and\ntechnologies may become Cosmic Hitchhikers when they ride free-floating planets\nto reach, explore and colonize planetary systems. To get an interstellar ride,\nCosmic Hitchhikers may travel to free-floating planets passing close by their\nhome worlds. Otherwise, they may use astronomical engineering to steer\nfree-floating planets toward their home planetary systems. Cosmic Hitchhikers\nmay also ride objects native to the outer regions of their planetary systems,\nwhich become free-floating planets when ejected by astronomical engineering or\nby their stars during the asymptotic giant branch evolution. During\ninterstellar travel, Cosmic Hitchhikers may apply astronomical engineering to\nsteer their free-floating planets toward the planetary systems of their choice.\nWhereas riding free-floating planets may not save travel time, it avoids the\ntechnical challenges of interstellar spacecraft transporting large populations.\nEach civilization of Cosmic Hitchhikers may colonize several planetary systems.\nIts colonies may grow into autonomous civilizations, changing the number of\ncivilizations in the Galaxy. Over the last 4 billion years, Cosmic Hitchhikers\nor their artifacts riding free-floating planets might have passed by the Solar\nSystem. Therefore, their artifacts might exist in the Solar System or in our\nstellar neighborhood. SETI and SETA should include the search for Cosmic\nHitchhikers and their artifacts. Keywords: SETI, SETA, free-floating planet,\nextraterrestrial civilization, interstellar travel, interstellar colonization,\nartifact, Cosmic Hitchhikers",
    "authors": [
      "Irina K. Romanovskaya"
    ],
    "publication_date": "2022-01-12T21:50:19Z",
    "arxiv_id": "http://arxiv.org/abs/2202.03364v1",
    "download_url": "http://arxiv.org/abs/2202.03364v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Review of Physics-based Machine Learning in Civil Engineering",
    "abstract": "The recent development of machine learning (ML) and Deep Learning (DL)\nincreases the opportunities in all the sectors. ML is a significant tool that\ncan be applied across many disciplines, but its direct application to civil\nengineering problems can be challenging. ML for civil engineering applications\nthat are simulated in the lab often fail in real-world tests. This is usually\nattributed to a data mismatch between the data used to train and test the ML\nmodel and the data it encounters in the real world, a phenomenon known as data\nshift. However, a physics-based ML model integrates data, partial differential\nequations (PDEs), and mathematical models to solve data shift problems.\nPhysics-based ML models are trained to solve supervised learning tasks while\nrespecting any given laws of physics described by general nonlinear equations.\nPhysics-based ML, which takes center stage across many science disciplines,\nplays an important role in fluid dynamics, quantum mechanics, computational\nresources, and data storage. This paper reviews the history of physics-based ML\nand its application in civil engineering.",
    "authors": [
      "Shashank Reddy Vadyala",
      "Sai Nethra Betgeri1",
      "John C. Matthews",
      "Elizabeth Matthews"
    ],
    "publication_date": "2021-10-09T15:50:21Z",
    "arxiv_id": "http://arxiv.org/abs/2110.04600v2",
    "download_url": "http://arxiv.org/abs/2110.04600v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Application of Artificial Intelligence (AI) in Civil Engineering",
    "abstract": "Hard computing generally deals with precise data, which provides ideal\nsolutions to problems. However, in the civil engineering field, amongst other\ndisciplines, that is not always the case as real-world systems are continuously\nchanging. Here lies the need to explore soft computing methods and artificial\nintelligence to solve civil engineering shortcomings. The integration of\nadvanced computational models, including Artificial Neural Networks (ANNs),\nFuzzy Logic, Genetic Algorithms (GAs), and Probabilistic Reasoning, has\nrevolutionized the domain of civil engineering. These models have significantly\nadvanced diverse sub-fields by offering innovative solutions and improved\nanalysis capabilities. Sub-fields such as: slope stability analysis, bearing\ncapacity, water quality and treatment, transportation systems, air quality,\nstructural materials, etc. ANNs predict non-linearities and provide accurate\nestimates. Fuzzy logic uses an efficient decision-making process to provide a\nmore precise assessment of systems. Lastly, while GAs optimizes models (based\non evolutionary processes) for better outcomes, probabilistic reasoning lowers\ntheir statistical uncertainties.",
    "authors": [
      "Temitope Funmilayo Awolusi",
      "Bernard Chukwuemeka Finbarrs-Ezema",
      "Isaac Munachimdinamma Chukwudulue",
      "Marc Azab"
    ],
    "publication_date": "2025-02-10T17:55:52Z",
    "arxiv_id": "http://arxiv.org/abs/2502.06727v1",
    "download_url": "http://arxiv.org/abs/2502.06727v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "CAMB: A comprehensive industrial LLM benchmark on civil aviation\n  maintenance",
    "abstract": "Civil aviation maintenance is a domain characterized by stringent industry\nstandards. Within this field, maintenance procedures and troubleshooting\nrepresent critical, knowledge-intensive tasks that require sophisticated\nreasoning. To address the lack of specialized evaluation tools for large\nlanguage models (LLMs) in this vertical, we propose and develop an\nindustrial-grade benchmark specifically designed for civil aviation\nmaintenance. This benchmark serves a dual purpose: It provides a standardized\ntool to measure LLM capabilities within civil aviation maintenance, identifying\nspecific gaps in domain knowledge and complex reasoning. By pinpointing these\ndeficiencies, the benchmark establishes a foundation for targeted improvement\nefforts (e.g., domain-specific fine-tuning, RAG optimization, or specialized\nprompt engineering), ultimately facilitating progress toward more intelligent\nsolutions within civil aviation maintenance. Our work addresses a significant\ngap in the current LLM evaluation, which primarily focuses on mathematical and\ncoding reasoning tasks. In addition, given that Retrieval-Augmented Generation\n(RAG) systems are currently the dominant solutions in practical applications ,\nwe leverage this benchmark to evaluate existing well-known vector embedding\nmodels and LLMs for civil aviation maintenance scenarios. Through experimental\nexploration and analysis, we demonstrate the effectiveness of our benchmark in\nassessing model performance within this domain, and we open-source this\nevaluation benchmark and code to foster further research and\ndevelopment:https://github.com/CamBenchmark/cambenchmark",
    "authors": [
      "Feng Zhang",
      "Chengjie Pang",
      "Yuehan Zhang",
      "Chenyu Luo"
    ],
    "publication_date": "2025-08-28T04:42:11Z",
    "arxiv_id": "http://arxiv.org/abs/2508.20420v1",
    "download_url": "http://arxiv.org/abs/2508.20420v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "DrafterBench: Benchmarking Large Language Models for Tasks Automation in\n  Civil Engineering",
    "abstract": "Large Language Model (LLM) agents have shown great potential for solving\nreal-world problems and promise to be a solution for tasks automation in\nindustry. However, more benchmarks are needed to systematically evaluate\nautomation agents from an industrial perspective, for example, in Civil\nEngineering. Therefore, we propose DrafterBench for the comprehensive\nevaluation of LLM agents in the context of technical drawing revision, a\nrepresentation task in civil engineering. DrafterBench contains twelve types of\ntasks summarized from real-world drawing files, with 46 customized\nfunctions/tools and 1920 tasks in total. DrafterBench is an open-source\nbenchmark to rigorously test AI agents' proficiency in interpreting intricate\nand long-context instructions, leveraging prior knowledge, and adapting to\ndynamic instruction quality via implicit policy awareness. The toolkit\ncomprehensively assesses distinct capabilities in structured data\ncomprehension, function execution, instruction following, and critical\nreasoning. DrafterBench offers detailed analysis of task accuracy and error\nstatistics, aiming to provide deeper insight into agent capabilities and\nidentify improvement targets for integrating LLMs in engineering applications.\nOur benchmark is available at https://github.com/Eason-Li-AIS/DrafterBench,\nwith the test set hosted at\nhttps://huggingface.co/datasets/Eason666/DrafterBench.",
    "authors": [
      "Yinsheng Li",
      "Zhen Dong",
      "Yi Shao"
    ],
    "publication_date": "2025-07-15T17:56:04Z",
    "arxiv_id": "http://arxiv.org/abs/2507.11527v1",
    "download_url": "http://arxiv.org/abs/2507.11527v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Systems Engineering for Civil Timekeeping",
    "abstract": "The future of Coordinated Universal Time has been a topic of energetic\ndiscussions for more than a dozen years. Different communities view the issue\nin different ways. Diametrically opposed visions exist for the range of\nappropriate solutions that should be entertained. Rather than an insoluble\nquandary, we suggest that well-known systems engineering best practices would\nprovide a framework for reaching consensus. This starts with the coherent\ncollection of project requirements.",
    "authors": [
      "Rob Seaman"
    ],
    "publication_date": "2011-12-05T03:49:16Z",
    "arxiv_id": "http://arxiv.org/abs/1112.0827v1",
    "download_url": "http://arxiv.org/abs/1112.0827v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Novel Scaled Boundary Finite Element Method in Computational\n  Electromagnetics",
    "abstract": "A Novel Scaled boundary finite element method, initially developed in Civil\nEngineering, is reformulated for solving boundary value problems in\ncomputational electromagnetics.",
    "authors": [
      "V. S. Prasanna Rajan",
      "K. C. James Raju"
    ],
    "publication_date": "2002-10-19T10:06:18Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0210077v1",
    "download_url": "http://arxiv.org/abs/physics/0210077v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Support vector machines/relevance vector machine for remote sensing\n  classification: A review",
    "abstract": "Kernel-based machine learning algorithms are based on mapping data from the\noriginal input feature space to a kernel feature space of higher dimensionality\nto solve a linear problem in that space. Over the last decade, kernel based\nclassification and regression approaches such as support vector machines have\nwidely been used in remote sensing as well as in various civil engineering\napplications. In spite of their better performance with different datasets,\nsupport vector machines still suffer from shortcomings such as\nvisualization/interpretation of model, choice of kernel and kernel specific\nparameter as well as the regularization parameter. Relevance vector machines\nare another kernel based approach being explored for classification and\nregression with in last few years. The advantages of the relevance vector\nmachines over the support vector machines is the availability of probabilistic\npredictions, using arbitrary kernel functions and not requiring setting of the\nregularization parameter. This paper presents a state-of-the-art review of SVM\nand RVM in remote sensing and provides some details of their use in other civil\nengineering application also.",
    "authors": [
      "Mahesh Pal"
    ],
    "publication_date": "2011-01-15T13:29:12Z",
    "arxiv_id": "http://arxiv.org/abs/1101.2987v1",
    "download_url": "http://arxiv.org/abs/1101.2987v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Active Learning for Imbalanced Civil Infrastructure Data",
    "abstract": "Aging civil infrastructures are closely monitored by engineers for damage and\ncritical defects. As the manual inspection of such large structures is costly\nand time-consuming, we are working towards fully automating the visual\ninspections to support the prioritization of maintenance activities. To that\nend we combine recent advances in drone technology and deep learning.\nUnfortunately, annotation costs are incredibly high as our proprietary civil\nengineering dataset must be annotated by highly trained engineers. Active\nlearning is, therefore, a valuable tool to optimize the trade-off between model\nperformance and annotation costs. Our use-case differs from the classical\nactive learning setting as our dataset suffers from heavy class imbalance and\nconsists of a much larger already labeled data pool than other active learning\nresearch. We present a novel method capable of operating in this challenging\nsetting by replacing the traditional active learning acquisition function with\nan auxiliary binary discriminator. We experimentally show that our novel method\noutperforms the best-performing traditional active learning method (BALD) by 5%\nand 38% accuracy on CIFAR-10 and our proprietary dataset respectively.",
    "authors": [
      "Thomas Frick",
      "Diego Antognini",
      "Mattia Rigotti",
      "Ioana Giurgiu",
      "Benjamin Grewe",
      "Cristiano Malossi"
    ],
    "publication_date": "2022-10-19T14:28:04Z",
    "arxiv_id": "http://arxiv.org/abs/2210.10586v1",
    "download_url": "http://arxiv.org/abs/2210.10586v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Architectural Flaw Detection in Civil Engineering Using GPT-4",
    "abstract": "The application of artificial intelligence (AI) in civil engineering presents\na transformative approach to enhancing design quality and safety. This paper\ninvestigates the potential of the advanced LLM GPT4 Turbo vision model in\ndetecting architectural flaws during the design phase, with a specific focus on\nidentifying missing doors and windows. The study evaluates the model's\nperformance through metrics such as precision, recall, and F1 score,\ndemonstrating AI's effectiveness in accurately detecting flaws compared to\nhuman-verified data. Additionally, the research explores AI's broader\ncapabilities, including identifying load-bearing issues, material weaknesses,\nand ensuring compliance with building codes. The findings highlight how AI can\nsignificantly improve design accuracy, reduce costly revisions, and support\nsustainable practices, ultimately revolutionizing the civil engineering field\nby ensuring safer, more efficient, and aesthetically optimized structures.",
    "authors": [
      "Saket Kumar",
      "Abul Ehtesham",
      "Aditi Singh",
      "Tala Talaei Khoei"
    ],
    "publication_date": "2024-10-26T01:10:04Z",
    "arxiv_id": "http://arxiv.org/abs/2410.20036v1",
    "download_url": "http://arxiv.org/abs/2410.20036v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "DINO-YOLO: Self-Supervised Pre-training for Data-Efficient Object\n  Detection in Civil Engineering Applications",
    "abstract": "Object detection in civil engineering applications is constrained by limited\nannotated data in specialized domains. We introduce DINO-YOLO, a hybrid\narchitecture combining YOLOv12 with DINOv3 self-supervised vision transformers\nfor data-efficient detection. DINOv3 features are strategically integrated at\ntwo locations: input preprocessing (P0) and mid-backbone enhancement (P3).\nExperimental validation demonstrates substantial improvements: Tunnel Segment\nCrack detection (648 images) achieves 12.4% improvement, Construction PPE (1K\nimages) gains 13.7%, and KITTI (7K images) shows 88.6% improvement, while\nmaintaining real-time inference (30-47 FPS). Systematic ablation across five\nYOLO scales and nine DINOv3 variants reveals that Medium-scale architectures\nachieve optimal performance with DualP0P3 integration (55.77% mAP@0.5), while\nSmall-scale requires Triple Integration (53.63%). The 2-4x inference overhead\n(21-33ms versus 8-16ms baseline) remains acceptable for field deployment on\nNVIDIA RTX 5090. DINO-YOLO establishes state-of-the-art performance for civil\nengineering datasets (<10K images) while preserving computational efficiency,\nproviding practical solutions for construction safety monitoring and\ninfrastructure inspection in data-constrained environments.",
    "authors": [
      "Malaisree P",
      "Youwai S",
      "Kitkobsin T",
      "Janrungautai S",
      "Amorndechaphon D",
      "Rojanavasu P"
    ],
    "publication_date": "2025-10-29T03:40:40Z",
    "arxiv_id": "http://arxiv.org/abs/2510.25140v2",
    "download_url": "http://arxiv.org/abs/2510.25140v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The gradual transformation of inland areas -- human plowing, horse\n  plowing and equity incentives",
    "abstract": "Many modern areas have not learned their lessons and often hope for the\nwisdom of later generations, resulting in them only possessing modern\ntechnology and difficult to iterate ancient civilizations. At present, there is\nno way to tell how we should learn from history and promote the gradual\nupgrading of civilization. Therefore, we must tell the history of\ncivilization's progress and the means of governance, learn from experience to\nimprove the comprehensive strength and survival ability of civilization, and\nachieve an optimal solution for the tempering brought by conflicts and the\nreduction of internal conflicts. Firstly, we must follow the footsteps of\nhistory and explore the reasons for the long-term stability of each country in\nconflict, including providing economic benefits to the people and means of\nsuppressing them; then, use mathematical methods to demonstrate how we can\nachieve the optimal solution at the current stage. After analysis, we can\nconclude that the civilization transformed from human plowing to horse plowing\ncan easily suppress the resistance of the people and provide them with the\nability to resist; The selection of rulers should consider multiple\ninstitutional aspects, such as exams, elections, and drawing lots; Economic\ndevelopment follows a lognormal distribution and can be adjusted by expected\nvalue and variance. Using a lognormal distribution with the maximum value to\ndivide equity can adjust the wealth gap.",
    "authors": [
      "Hongfa Zi",
      "Zhen Liu"
    ],
    "publication_date": "2025-06-28T10:07:44Z",
    "arxiv_id": "http://arxiv.org/abs/2507.00067v2",
    "download_url": "http://arxiv.org/abs/2507.00067v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Probability of Error Analysis for NOMA Systems in Rayleigh Fading\n  Channels: Enabling IoT in Civil Engineering",
    "abstract": "In the realm of digital communication, understanding and mitigating the\nprobability of error is crucial, particularly in Rayleigh fading channels where\nsignal impairments are common. This paper presents a unified approach to derive\nthe probability of error formulations for two-users NOMA systems operating in\nRayleigh fading channels. The methodologies and findings outlined in this study\nare essential for IoT applications in construction and civil engineering.\nSpecifically, the derived error probability formulations can be employed to\nenhance the reliability and efficiency of IoT-based monitoring systems in these\nsectors. By optimizing communication protocols, the proposed approach ensures\naccurate data transmission, thereby facilitating real-time monitoring and\ndecision-making processes in construction sites and civil infrastructure\nprojects.",
    "authors": [
      "Amr Abdelbari",
      "Bülent Bilgehan",
      "Fadi Al-Turjman"
    ],
    "publication_date": "2024-11-04T10:58:33Z",
    "arxiv_id": "http://arxiv.org/abs/2411.01977v1",
    "download_url": "http://arxiv.org/abs/2411.01977v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Model-Assisted Labeling via Explainability for Visual Inspection of\n  Civil Infrastructures",
    "abstract": "Labeling images for visual segmentation is a time-consuming task which can be\ncostly, particularly in application domains where labels have to be provided by\nspecialized expert annotators, such as civil engineering. In this paper, we\npropose to use attribution methods to harness the valuable interactions between\nexpert annotators and the data to be annotated in the case of defect\nsegmentation for visual inspection of civil infrastructures. Concretely, a\nclassifier is trained to detect defects and coupled with an attribution-based\nmethod and adversarial climbing to generate and refine segmentation masks\ncorresponding to the classification outputs. These are used within an assisted\nlabeling framework where the annotators can interact with them as proposal\nsegmentation masks by deciding to accept, reject or modify them, and\ninteractions are logged as weak labels to further refine the classifier.\nApplied on a real-world dataset resulting from the automated visual inspection\nof bridges, our proposed method is able to save more than 50\\% of annotators'\ntime when compared to manual annotation of defects.",
    "authors": [
      "Klara Janouskova",
      "Mattia Rigotti",
      "Ioana Giurgiu",
      "Cristiano Malossi"
    ],
    "publication_date": "2022-09-22T17:14:15Z",
    "arxiv_id": "http://arxiv.org/abs/2209.11159v1",
    "download_url": "http://arxiv.org/abs/2209.11159v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "User Centered Design (VII): From Automated Flight Deck to Intelligent\n  Flight Deck",
    "abstract": "Driven by the \"user-centered design\" philosophy, this paper first outlines\nthe human factors problems of the flight deck automation for large civil\naircraft and the human factors research carried out based on the\n\"human-centered automation\" approach. This paper then reviews the previous\ninitial human factors research on intelligent civil flight deck based on the\n\"human-centered AI\" approach and discusses the prospects for future human\nfactors research. Based on our proposed human factors engineering model for\nintelligent human-computer interaction and the framework of joint cognitive\neco-systems, this paper proposes an initial human factors solution for the\nsingle-pilot operations of large civil aircraft and presents preliminary\nsuggestions for future human factors research.",
    "authors": [
      "Wei Xu"
    ],
    "publication_date": "2021-11-10T22:35:31Z",
    "arxiv_id": "http://arxiv.org/abs/2111.05974v4",
    "download_url": "http://arxiv.org/abs/2111.05974v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generative Adversarial Networks for Labelled Vibration Data Generation",
    "abstract": "As Structural Health Monitoring (SHM) being implemented more over the years,\nthe use of operational modal analysis of civil structures has become more\nsignificant for the assessment and evaluation of engineering structures.\nMachine Learning (ML) and Deep Learning (DL) algorithms have been in use for\nstructural damage diagnostics of civil structures in the last couple of\ndecades. While collecting vibration data from civil structures is a challenging\nand expensive task for both undamaged and damaged cases, in this paper, the\nauthors are introducing Generative Adversarial Networks (GAN) that is built on\nthe Deep Convolutional Neural Network (DCNN) and using Wasserstein Distance for\ngenerating artificial labelled data to be used for structural damage diagnostic\npurposes. The authors named the developed model 1D W-DCGAN and successfully\ngenerated vibration data which is very similar to the input. The methodology\npresented in this paper will pave the way for vibration data generation for\nnumerous future applications in the SHM domain.",
    "authors": [
      "Furkan Luleci",
      "F. Necati Catbas",
      "Onur Avci"
    ],
    "publication_date": "2021-12-07T03:37:48Z",
    "arxiv_id": "http://arxiv.org/abs/2112.08195v1",
    "download_url": "http://arxiv.org/abs/2112.08195v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Civil Servants as Builders: Enabling Non-IT Staff to Develop Secure\n  Python and R Tools",
    "abstract": "Current digital government literature focuses on professional in-house IT\nteams, specialized digital service teams, vendor-developed systems, or\nproprietary low-code/no-code tools. Almost no scholarship addresses a growing\nmiddle ground: technically skilled civil servants outside formal IT roles who\ncan write real code but lack a sanctioned, secure path to deploy their work.\nThis paper introduces a limits-aware, open-source and replicable platform that\nenables such public servants to develop, peer review, and deploy small-scale,\ndomain-specific applications within government networks via a sandboxed,\nauditable workflow. By combining Jupyter Notebooks, preapproved open-source\nlibraries, and lightweight governance, the platform works within institutional\nconstraints such as procurement rules and IT security policies while avoiding\nvendor lock-in. Unlike low/no-code approaches, it preserves and enhances civil\nservants' programming skills, keeping them technically competitive with their\nprivate-sector peers. This contribution fills a critical gap, offering a\nreplicable model for public-sector skill retention, resilience, and bottom-up\ndigital transformation.",
    "authors": [
      "Prashant Sharma"
    ],
    "publication_date": "2025-08-10T06:56:22Z",
    "arxiv_id": "http://arxiv.org/abs/2508.07203v1",
    "download_url": "http://arxiv.org/abs/2508.07203v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geo-engineering Gone Awry: A New Partial Solution of Fermi's Paradox",
    "abstract": "Another partial solution of Fermi's famous paradox is proposed, based on our\nincreased understanding of geophysics, geo-engineering and climatology. It has\nbeen claimed in the recent astrobiological literature (for instance, in the\nrecent controversial \"rare Earth\" theory of Ward and Brownlee), that geological\nactivity of a terrestrial planet is an important precondition for the emergence\nof complex metazoan life forms. Technological civilizations arising on such\nplanets will be, at some point of their histories or another, tempted to embark\nupon massive geo-engineering projects. If, for some reasons only very recently\nunderstood, large-scale geo-engineering is in fact much more dangerous than\npreviously thought, the scenario in which at least some of the extraterrestrial\ncivilizations in the Milky Way self-destruct in this manner gains plausibility.\nIn addition, we speculate on possible reasons, both physical and\nculturological, which could make such a threat even more pertinent on an\naverage Galactic terrestrial planet than on Earth.",
    "authors": [
      "Milan M. Cirkovic",
      "Richard Cathcart"
    ],
    "publication_date": "2003-08-14T14:44:24Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0308058v1",
    "download_url": "http://arxiv.org/abs/physics/0308058v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A digital twin framework for civil engineering structures",
    "abstract": "The digital twin concept represents an appealing opportunity to advance\ncondition-based and predictive maintenance paradigms for civil engineering\nsystems, thus allowing reduced lifecycle costs, increased system safety, and\nincreased system availability. This work proposes a predictive digital twin\napproach to the health monitoring, maintenance, and management planning of\ncivil engineering structures. The asset-twin coupled dynamical system is\nencoded employing a probabilistic graphical model, which allows all relevant\nsources of uncertainty to be taken into account. In particular, the\ntime-repeating observations-to-decisions flow is modeled using a dynamic\nBayesian network. Real-time structural health diagnostics are provided by\nassimilating sensed data with deep learning models. The digital twin state is\ncontinually updated in a sequential Bayesian inference fashion. This is then\nexploited to inform the optimal planning of maintenance and management actions\nwithin a dynamic decision-making framework. A preliminary offline phase\ninvolves the population of training datasets through a reduced-order numerical\nmodel and the computation of a health-dependent control policy. The strategy is\nassessed on two synthetic case studies, involving a cantilever beam and a\nrailway bridge, demonstrating the dynamic decision-making capabilities of\nhealth-aware digital twins.",
    "authors": [
      "Matteo Torzoni",
      "Marco Tezzele",
      "Stefano Mariani",
      "Andrea Manzoni",
      "Karen E. Willcox"
    ],
    "publication_date": "2023-08-02T21:38:36Z",
    "arxiv_id": "http://arxiv.org/abs/2308.01445v2",
    "download_url": "http://arxiv.org/abs/2308.01445v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Large Language Model Agent for Structural Drawing Generation Using ReAct\n  Prompt Engineering and Retrieval Augmented Generation",
    "abstract": "Structural drawings are widely used in many fields, e.g., mechanical\nengineering, civil engineering, etc. In civil engineering, structural drawings\nserve as the main communication tool between architects, engineers, and\nbuilders to avoid conflicts, act as legal documentation, and provide a\nreference for future maintenance or evaluation needs. They are often organized\nusing key elements such as title/subtitle blocks, scales, plan views, elevation\nview, sections, and detailed sections, which are annotated with standardized\nsymbols and line types for interpretation by engineers and contractors. Despite\nadvances in software capabilities, the task of generating a structural drawing\nremains labor-intensive and time-consuming for structural engineers. Here we\nintroduce a novel generative AI-based method for generating structural drawings\nemploying a large language model (LLM) agent. The method incorporates a\nretrieval-augmented generation (RAG) technique using externally-sourced facts\nto enhance the accuracy and reliability of the language model. This method is\ncapable of understanding varied natural language descriptions, processing these\nto extract necessary information, and generating code to produce the desired\nstructural drawing in AutoCAD. The approach developed, demonstrated and\nevaluated herein enables the efficient and direct conversion of a structural\ndrawing's natural language description into an AutoCAD drawing, significantly\nreducing the workload compared to current working process associated with\nmanual drawing production, facilitating the typical iterative process of\nengineers for expressing design ideas in a simplified way.",
    "authors": [
      "Xin Zhang",
      "Lissette Iturburu",
      "Juan Nicolas Villamizar",
      "Xiaoyu Liu",
      "Manuel Salmeron",
      "Shirley J. Dyke",
      "Julio Ramirez"
    ],
    "publication_date": "2025-07-26T03:47:12Z",
    "arxiv_id": "http://arxiv.org/abs/2507.19771v1",
    "download_url": "http://arxiv.org/abs/2507.19771v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the use of continuous wavelet analysis for modal identification",
    "abstract": "This paper reviews two different uses of the continuous wavelet transform for\nmodal identification purposes. The properties of the wavelet transform, mainly\nenergetic, allow to emphasize or filter the main information within measured\nsignals and thus facilitate the modal parameter identification especially when\nmechanical systems exhibit modal coupling and/or relatively strong damping.",
    "authors": [
      "Pierre Argoul",
      "Silvano Erlicher"
    ],
    "publication_date": "2009-01-14T13:29:36Z",
    "arxiv_id": "http://arxiv.org/abs/0901.2000v1",
    "download_url": "http://arxiv.org/abs/0901.2000v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-equilibrium thermodynamical framework for rate- and state-dependent\n  friction",
    "abstract": "Rate- and state-dependent friction law for velocity-step and healing are\nanalysed from a thermodynamic point of view. Assuming a logarithmic deviation\nfrom steady-state a unification of the classical Dieterich and Ruina models of\nrock friction is proposed.",
    "authors": [
      "P. Ván",
      "N. Mitsui",
      "T. Hatano"
    ],
    "publication_date": "2015-01-19T20:11:11Z",
    "arxiv_id": "http://arxiv.org/abs/1501.04608v1",
    "download_url": "http://arxiv.org/abs/1501.04608v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Georg Cantor from St. Petersburg. Childhood and history of the family.\n  Archival research",
    "abstract": "Georg Cantor (1845-1918) was born, and spent the first 11 years of his life\nin St. Petersburg. The present lecture is devoted to his childhood and his\nfamily. Most of these documents were not available before and are now published\nfor the first time.",
    "authors": [
      "G. I. Sinkevich"
    ],
    "publication_date": "2015-02-22T13:24:57Z",
    "arxiv_id": "http://arxiv.org/abs/1502.06940v1",
    "download_url": "http://arxiv.org/abs/1502.06940v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shear piezoelectricity in poly(vinylidenefluoride-co-trifluoroethylene):\n  full piezotensor coefficients by molecular modeling, biaxial transverse\n  response, and use in suspended energy-harvesting nanostructures",
    "abstract": "The intrinsic flexible character of polymeric materials also causes\nremarkable strain deformations along directions perpendicular to the applied\nstress. Here the biaxial response in the shear piezoelectricity of\npolyvinylidenefluoride copolymers is analyzed and their full piezoelectric\ntensors are provided. The microscopic shear is exploited in single suspended\nnanowires bent by localized loading to couple flexural deformation and\ntransverse piezoelectric response.",
    "authors": [
      "Luana Persano",
      "Alessandra Catellani",
      "Canan Dagdeviren",
      "Yinji Ma",
      "Xiaogang Guo",
      "Yonggang Huang",
      "Arrigo Calzolari",
      "Dario Pisignano"
    ],
    "publication_date": "2016-07-04T15:36:00Z",
    "arxiv_id": "http://arxiv.org/abs/1607.00935v1",
    "download_url": "http://arxiv.org/abs/1607.00935v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Probabilistic Inference for Structural Health Monitoring: New Modes of\n  Learning from Data",
    "abstract": "In data-driven SHM, the signals recorded from systems in operation can be\nnoisy and incomplete. Data corresponding to each of the operational,\nenvironmental, and damage states are rarely available a priori; furthermore,\nlabelling to describe the measurements is often unavailable. In consequence,\nthe algorithms used to implement SHM should be robust and adaptive, while\naccommodating for missing information in the training-data -- such that new\ninformation can be included if it becomes available. By reviewing novel\ntechniques for statistical learning (introduced in previous work), it is argued\nthat probabilistic algorithms offer a natural solution to the modelling of SHM\ndata in practice. In three case-studies, probabilistic methods are adapted for\napplications to SHM signals -- including semi-supervised learning, active\nlearning, and multi-task learning.",
    "authors": [
      "Lawrence A. Bull",
      "Paul Gardner",
      "Timothy J. Rogers",
      "Elizabeth J. Cross",
      "Nikolaos Dervilis",
      "Keith Worden"
    ],
    "publication_date": "2021-03-02T12:18:48Z",
    "arxiv_id": "http://arxiv.org/abs/2103.01676v1",
    "download_url": "http://arxiv.org/abs/2103.01676v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling Indications of Technology in Planetary Transit Light Curves --\n  Dark-side illumination",
    "abstract": "We analyze potential effects of an extraterrestrial civilization's use of\norbiting mirrors to illuminate the dark side of a synchronously rotating planet\non planetary transit light curves. Previous efforts to detect civilizations\nbased on side effects of planetary-scale engineering have focused on structures\naffecting the host star output (e.g. Dyson spheres). However, younger\ncivilizations are likely to be less advanced in their engineering efforts, yet\nstill capable of sending small spacecraft into orbit. Since M dwarfs are the\nmost common type of star in the solar neighborhood, it seems plausible that\nmany of the nearest habitable planets orbit dim, low-mass M stars, and will be\nin synchronous rotation. Logically, a civilization evolving on such a planet\nmay be inspired to illuminate their planet's dark side by placing a single\nlarge mirror at the L2 Lagrangian point, or launching a fleet of small thin\nmirrors into planetary orbit. We briefly examine the requirements and\nengineering challenges of such a collection of orbiting mirrors, then explore\ntheir impact on transit light curves. We incorporate stellar limb darkening and\nmodel a simplistic mirror fleet's effects for transits of Earth-like (R = 0.5\nto 2 R_Earth) planets which would be synchronously rotating for orbits within\nthe habitable zone of their host star. Although such an installation is\nundetectable in Kepler data, JWST will provide the sensitivity necessary to\ndetect a fleet of mirrors orbiting Earth-like habitable planets around nearby\nstars.",
    "authors": [
      "Eric J. Korpela",
      "Shauna M. Sallmen",
      "Diana Leystra Greene"
    ],
    "publication_date": "2015-05-27T17:00:33Z",
    "arxiv_id": "http://arxiv.org/abs/1505.07399v3",
    "download_url": "http://arxiv.org/abs/1505.07399v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The secret chambers in the Chephren Pyramid",
    "abstract": "Pyramids are the greatest architectural achievement of ancient civilization,\nso people all over the world are curious as to the purpose of such huge\nconstructions. No other structure has been studied as thoroughly, nor have so\nmany books and articles been written about it. We created a computer model of\nthe pyramid. To validate the model, we compare our calculations with the\nexperimental data of Luis W. Alvarez. The fact that the Egyptians set up 2.5\nmillion stone blocks without any purpose seems to be unimaginable. Therefore,\nwe attempt to examine the internal structure of the pyramid using muon\ntomography. With our measurements we performed and verified a calibration of\nthe attenuation of muons for primary beam momenta of 2.5 GeV/c and 3 GeV/c at\nthe T9 experimental area of CERN.",
    "authors": [
      "Bartosz Gutowski",
      "Witold Jóźwiak",
      "Markus Joos",
      "Janusz Kempa",
      "Kamila Komorowska",
      "Kamil Krakowski",
      "Ewa Pijus",
      "Kamil Szymczak",
      "Małgorzata Trojanowska"
    ],
    "publication_date": "2017-12-19T17:19:27Z",
    "arxiv_id": "http://arxiv.org/abs/1712.08590v1",
    "download_url": "http://arxiv.org/abs/1712.08590v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fine-tuning vision foundation model for crack segmentation in civil\n  infrastructures",
    "abstract": "Large-scale foundation models have become the mainstream deep learning\nmethod, while in civil engineering, the scale of AI models is strictly limited.\nIn this work, a vision foundation model is introduced for crack segmentation.\nTwo parameter-efficient fine-tuning methods, adapter and low-rank adaptation,\nare adopted to fine-tune the foundation model in semantic segmentation: the\nSegment Anything Model (SAM). The fine-tuned CrackSAM shows excellent\nperformance on different scenes and materials. To test the zero-shot\nperformance of the proposed method, two unique datasets related to road and\nexterior wall cracks are collected, annotated and open-sourced, for a total of\n810 images. Comparative experiments are conducted with twelve mature semantic\nsegmentation models. On datasets with artificial noise and previously unseen\ndatasets, the performance of CrackSAM far exceeds that of all state-of-the-art\nmodels. CrackSAM exhibits remarkable superiority, particularly under\nchallenging conditions such as dim lighting, shadows, road markings,\nconstruction joints, and other interference factors. These cross-scenario\nresults demonstrate the outstanding zero-shot capability of foundation models\nand provide new ideas for developing vision models in civil engineering.",
    "authors": [
      "Kang Ge",
      "Chen Wang",
      "Yutao Guo",
      "Yansong Tang",
      "Zhenzhong Hu",
      "Hongbing Chen"
    ],
    "publication_date": "2023-12-07T11:39:11Z",
    "arxiv_id": "http://arxiv.org/abs/2312.04233v3",
    "download_url": "http://arxiv.org/abs/2312.04233v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stress Resultant-Based Approach to Mass Assumption-Free Bayesian Model\n  Updating of Frame Structures",
    "abstract": "Bayesian model updating facilitates the calibration of analytical models\nbased on observations and the quantification of uncertainties in model\nparameters such as stiffness and mass. This process significantly enhances\ndamage assessment and response predictions in existing civil structures.\nPredominantly, current methods employ modal properties identified from\nacceleration measurements to evaluate the likelihood of the model parameters.\nThis modal analysis-based likelihood generally involves a prior assumption\nregarding the mass parameters. In civil structures, accurate determination of\nmass parameters proves challenging owing to the significant uncertainty and\ntime-varying nature of imposed loads. The resulting inaccuracy potentially\nintroduces biases while estimating the stiffness parameters, which affects the\nassessment of structural response and associated damage. Addressing this issue,\nthe present study introduces a stress-resultant-based approach for Bayesian\nmodel updating independent of mass assumptions. This approach utilizes system\nidentification on strain and acceleration measurements to establish the\nrelationship between nodal displacements and elemental stress resultants.\nEmploying static analysis to depict this relationship aids in assessing the\nlikelihood of stiffness parameters. Integrating this static-analysis-based\nlikelihood with a modal-analysis-based likelihood facilitates the simultaneous\nestimation of mass and stiffness parameters. The proposed approach was\nvalidated using numerical examples on a planar frame and experimental studies\non a full-scale moment-resisting steel frame structure.",
    "authors": [
      "Taro Yaoyama",
      "Tatsuya Itoi",
      "Jun Iyama"
    ],
    "publication_date": "2024-01-31T15:44:19Z",
    "arxiv_id": "http://arxiv.org/abs/2401.17932v2",
    "download_url": "http://arxiv.org/abs/2401.17932v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Low-cost Efficient Wireless Intelligent Sensor (LEWIS) for Engineering,\n  Research, and Education",
    "abstract": "Sensors have the capability of collecting engineering data and quantifying\nenvironmental changes, activities, or phenomena. Civil engineers lack of\nknowledge in sensor technology. Therefore, the vision of smart cities equipped\nwith sensors informing decisions has not been realized to date. The cost\nassociated with data acquisition systems, laboratories, and experiments\nrestricts access to sensors for wider audiences. Recently, sensors are becoming\na new tool in education and training, giving learners real-time information\nthat can reinforce their confidence and understanding of scientific or\nengineering new concepts. However, the electrical components and computer\nknowledge associated with sensors are still a challenge for civil engineers. If\nsensing technology costs and use are simplified, sensors could be tamed by\ncivil engineering students. The researcher developed, fabricated, and tested an\nefficient low-cost wireless intelligent sensor (LEWIS) aimed at education and\nresearch, named LEWIS1. This platform is directed at learners connected with a\ncable to the computer but has the same concepts and capabilities as the\nwireless version. The content of this paper describes the hardware and software\narchitecture of the first prototype and their use, as well as the proposed new\nLEWIS1 (LEWIS1 beta) that simplifies both hardware and software, and user\ninterfaces. The capability of the proposed sensor is compared with an accurate\ncommercial PCB sensor through experiments. The later part of this paper\ndemonstrates applications and examples of outreach efforts and suggests the\nadoption of LEWIS1 beta as a new tool for education and research. The authors\nalso investigated the number of activities and sensor building workshops that\nhas been done since 2015 using the LEWIS sensor which shows an ascending trend\nof different professionals excitement to involve and learn the sensor\nfabrication.",
    "authors": [
      "Mahsa Sanei",
      "Solomon Atcitty",
      "Fernando Moreu"
    ],
    "publication_date": "2023-03-23T21:49:26Z",
    "arxiv_id": "http://arxiv.org/abs/2303.13688v1",
    "download_url": "http://arxiv.org/abs/2303.13688v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Free fall misconceptions: results of a graph based pre test of sophomore\n  civil engineering students",
    "abstract": "A partially unusual behaviour was found among 14 sophomore students of civil\nengineering who took a pre test for a free fall laboratory session, in the\ncontext of a general mechanics course. An analysis contemplating mathematics\nmodels and physics models consistency was made. In all cases, the students\npresented evidence favoring a correct free fall acceleration model, whilst\ntheir position component versus time, and velocity component versus time graphs\nrevealed complex misconceptions both on the physical phenomenon and it's\nimplicit mathematics consistency. The last suggests an inability to make\nsatisfactory connections through definitions between graphed variables. In\nother words, evidence strongly suggests that students are perfectly able to\nmemorize the free fall acceleration model, whilst not understanding it's\nsignificance at any level. This small study originated the develope and\nvalidation of a tutorial on free fall graphs for position, velocity and\nacceleration models, as part of a following cross universities major project.",
    "authors": [
      "Alicia M. Montecinos"
    ],
    "publication_date": "2014-05-13T19:44:02Z",
    "arxiv_id": "http://arxiv.org/abs/1405.3277v1",
    "download_url": "http://arxiv.org/abs/1405.3277v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Elastic, thermal expansion, plastic and rheological processes - theory\n  and experiment",
    "abstract": "Rocks are important examples for solid materials where, in various\nengineering situations, elastic, thermal expansion, rheological/viscoelastic\nand plastic phenomena each may play a remarkable role. Nonequilibrium continuum\nthermodynamics provides a consistent way to describe all these aspects in a\nunified framework. This we present here in a formulation where the kinematic\nquantities allow arbitrary nonzero initial (e.g., in situ) stresses and such\ninitial configurations which - as a consequence of thermal or remanent stresses\n- do not satisfy the kinematic compatibility condition. The various\ncharacteristic effects accounted by the obtained theory are illustrated via\nexperimental results where loaded solid samples undergo elastic, thermal\nexpansion and plastic deformation and exhibit rheological behaviour. From the\nexperimental data, the rheological coefficients are determined, and the\nmeasured temperature changes are also explained by the theory.",
    "authors": [
      "Csaba Asszonyi",
      "Attila Csatár",
      "Tamás Fülöp"
    ],
    "publication_date": "2015-12-18T07:12:40Z",
    "arxiv_id": "http://arxiv.org/abs/1512.05863v1",
    "download_url": "http://arxiv.org/abs/1512.05863v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Experimental and Numerical Investigation of the Fracture Behavior of\n  Particle Reinforced Alkali Activated Slag Mortars",
    "abstract": "This paper presents fracture response of alkali-activated slag (AAS) mortars\nwith up to 30% (by volume) of slag being replaced by waste iron powder which\ncontains a significant fraction of elongated particles. The elongated iron\nparticles act as micro-reinforcement and improve the crack resistance of AAS\nmortars by increasing the area of fracture process zone (FPZ). Increased area\nof FPZ signifies increased energy-dissipation which is reflected in the form of\nsignificant increase in the crack growth resistance as determined from\nR-curves. Fracture response of notched AAS mortar beams under three-point\nbending is simulated using extended finite element method (XFEM) to develop a\ntool for direct determination of fracture characteristics such as crack\nextension and fracture toughness in particulate-reinforced AAS mortars.\nFracture response simulated using the XFEM based framework correlates well with\nexperimental observations. The comprehensive fracture studies reported here\nprovide an economical and sustainable means towards improving the ductility of\nAAS systems which are generally more brittle than their conventional ordinary\nportland cement counterparts.",
    "authors": [
      "Sumeru Nayak",
      "Ahmet Kizilkanat",
      "Narayanan Neithalath",
      "Sumanta Das"
    ],
    "publication_date": "2019-01-04T09:11:46Z",
    "arxiv_id": "http://arxiv.org/abs/1901.01025v1",
    "download_url": "http://arxiv.org/abs/1901.01025v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "HECATE: A long lived particle detector concept for the FCC-ee or CEPC",
    "abstract": "The next generation of circular high energy collider is expected to be a\nlepton collider, FCC-ee at CERN or CEPC in China. However, the civil\nengineering concepts foresee to equip these colliders with bigger detector\ncaverns than one would need for a lepton collider, so that they can be used for\na hadron collider that may be installed in the same tunnel without further\ncivil engineering. This opens up the possibility to install extra\ninstrumentation at the cavern walls to search for new long-lived particles at\nthe lepton collider. We use the example of heavy neutral leptons to show that\nsuch an installation could improve the sensitivity to the squared mixing\nparameter by almost half an order of magnitude.",
    "authors": [
      "Marcin Chrzaszcz",
      "Marco Drewes",
      "Jan Hajer"
    ],
    "publication_date": "2020-11-02T14:23:45Z",
    "arxiv_id": "http://arxiv.org/abs/2011.01005v3",
    "download_url": "http://arxiv.org/abs/2011.01005v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tractor beams, pressor beams, and stressor beams within the context of\n  general relativity",
    "abstract": "Both traversable wormholes and warp drives, concepts originally developed\nwithin the context of science fiction, have now (for some 30 odd years) been\nstudied, debated, and carefully analyzed within the framework of general\nrelativity. An overarching theme of the general relativistic analysis is\nunavoidable violations of the classical point-wise energy conditions. Another\nscience fiction trope, now over 80 years old, is the tractor beam and/or\npressor beam. We shall discuss how to formulate both tractor beams and/or\npressor beams, and a variant to be called a stressor beam, within the context\nof reverse engineering the spacetime metric. (While such reverse engineering is\ncertainly well beyond our civilization's current capabilities, we shall be more\ninterested in asking what an arbitrarily advanced civilization might be able to\naccomplish.) We shall see that tractor beams and/or pressor beams can be\nformulated by suitably modifying the notion of warp drives, and that, as for\nwormholes and warp drives, violations of the classical point-wise energy\nconditions are utterly unavoidable.",
    "authors": [
      "Matt Visser",
      "Jessica Santiago",
      "Sebastian Schuster"
    ],
    "publication_date": "2021-10-28T07:20:27Z",
    "arxiv_id": "http://arxiv.org/abs/2110.14926v1",
    "download_url": "http://arxiv.org/abs/2110.14926v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Perception-aware Tag Placement Planning for Robust Localization of UAVs\n  in Indoor Construction Environments",
    "abstract": "Tag-based visual-inertial localization is a lightweight method for enabling\nautonomous data collection missions of low-cost unmanned aerial vehicles (UAVs)\nin indoor construction environments. However, finding the optimal tag\nconfiguration (i.e., number, size, and location) on dynamic construction sites\nremains challenging. This paper proposes a perception-aware genetic\nalgorithm-based tag placement planner (PGA-TaPP) to determine the optimal tag\nconfiguration using 4D-BIM, considering the project progress, safety\nrequirements, and UAV's localizability. The proposed method provides a 4D plan\nfor tag placement by maximizing the localizability in user-specified regions of\ninterest (ROIs) while limiting the installation costs. Localizability is\nquantified using the Fisher information matrix (FIM) and encapsulated in\nnavigable grids. The experimental results show the effectiveness of our method\nin finding an optimal 4D tag placement plan for the robust localization of UAVs\non under-construction indoor sites.",
    "authors": [
      "Navid Kayhani",
      "Angela Schoellig",
      "Brenda McCabe"
    ],
    "publication_date": "2022-10-27T14:37:57Z",
    "arxiv_id": "http://arxiv.org/abs/2210.15504v1",
    "download_url": "http://arxiv.org/abs/2210.15504v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Automating Computational Design with Generative AI",
    "abstract": "AI image generators based on diffusion models have recently garnered\nattention for their capability to create images from simple text prompts.\nHowever, for practical use in civil engineering they need to be able to create\nspecific construction plans for given constraints. This paper investigates the\npotential of current AI generators in addressing such challenges, specifically\nfor the creation of simple floor plans. We explain how the underlying\ndiffusion-models work and propose novel refinement approaches to improve\nsemantic encoding and generation quality. In several experiments we show that\nwe can improve validity of generated floor plans from 6% to 90%. Based on these\nresults we derive future research challenges considering building information\nmodelling. With this we provide: (i) evaluation of current generative AIs; (ii)\npropose improved refinement approaches; (iii) evaluate them on various\nexamples; (iv) derive future directions for diffusion models in civil\nengineering.",
    "authors": [
      "Joern Ploennigs",
      "Markus Berger"
    ],
    "publication_date": "2023-07-05T10:07:50Z",
    "arxiv_id": "http://arxiv.org/abs/2307.02511v2",
    "download_url": "http://arxiv.org/abs/2307.02511v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "College Dropout Factors: An Analysis with LightGBM and Shapley's\n  Cooperative Game Theory",
    "abstract": "This study was based on data analysis of academic histories of civil\nengineering students at FACET-UNT. Our main objective was to determine the\nacademic performance variables that have a significant impact on the dropout of\nthe career. To do this, we implemented a correlation model using LightGBM\n(Barbier et al., 2016; Ke et al., 2017; Shi et al., 2022). We use this model to\nidentify the key variables that influence the probability of student dropout.\n  In addition, we use game theory to interpret the results obtained.\nSpecifically, we use the SHAP library (Lundberg et al., 2018, 2020; Lundberg &\nLee, 2017) in Python to calculate the Shapley numbers.\n  The results of our study revealed the most important variables that influence\nthe dropout from the civil engineering career. Significant differences were\nidentified in terms of age, time spent in studies, and academic performance,\nwhich includes the number of courses passed and the number of exams taken.\nThese results may be useful to develop more effective student retention\nstrategies and improve academic success in this discipline.",
    "authors": [
      "Hugo Roger Paz"
    ],
    "publication_date": "2023-09-26T10:38:05Z",
    "arxiv_id": "http://arxiv.org/abs/2311.06260v1",
    "download_url": "http://arxiv.org/abs/2311.06260v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Zero-shot Building Attribute Extraction from Large-Scale Vision and\n  Language Models",
    "abstract": "Existing building recognition methods, exemplified by BRAILS, utilize\nsupervised learning to extract information from satellite and street-view\nimages for classification and segmentation. However, each task module requires\nhuman-annotated data, hindering the scalability and robustness to regional\nvariations and annotation imbalances. In response, we propose a new zero-shot\nworkflow for building attribute extraction that utilizes large-scale vision and\nlanguage models to mitigate reliance on external annotations. The proposed\nworkflow contains two key components: image-level captioning and segment-level\ncaptioning for the building images based on the vocabularies pertinent to\nstructural and civil engineering. These two components generate descriptive\ncaptions by computing feature representations of the image and the\nvocabularies, and facilitating a semantic match between the visual and textual\nrepresentations. Consequently, our framework offers a promising avenue to\nenhance AI-driven captioning for building attribute extraction in the\nstructural and civil engineering domains, ultimately reducing reliance on human\nannotations while bolstering performance and adaptability.",
    "authors": [
      "Fei Pan",
      "Sangryul Jeon",
      "Brian Wang",
      "Frank Mckenna",
      "Stella X. Yu"
    ],
    "publication_date": "2023-12-19T14:44:02Z",
    "arxiv_id": "http://arxiv.org/abs/2312.12479v1",
    "download_url": "http://arxiv.org/abs/2312.12479v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effective surface forces and non-coherent interfaces within the reduced\n  relaxed micromorphic modeling of finite-size mechanical metamaterials",
    "abstract": "This paper introduces for the first time the concepts of non-coherent\ninterfaces and microstructure-driven interface forces in the framework of\nmicromorphic elasticity. It is shown that such concepts are of paramount\nimportance when studying the response of finite-size mechanical metamaterials\nat the homogenized macro-scale. The need of introducing interface forces is\nelucidated through numerical examples comparing reduced relaxed micromorphic\nsimulations to their full-microstructured counterparts. These results provide a\nmilestone for the understanding of metamaterials' modeling at the homogenized\nscale and for the use of micromorphic-type models to achieve an accurate\nupscaling towards larger-scale metamaterials' structures.",
    "authors": [
      "L. A. Perez Ramirez",
      "F. Erel-Demore",
      "G. Rizzi",
      "J. Voss",
      "A. Madeo"
    ],
    "publication_date": "2024-01-03T13:41:37Z",
    "arxiv_id": "http://arxiv.org/abs/2401.01744v2",
    "download_url": "http://arxiv.org/abs/2401.01744v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Supply Chain Network Extraction and Entity Classification Leveraging\n  Large Language Models",
    "abstract": "Supply chain networks are critical to the operational efficiency of\nindustries, yet their increasing complexity presents significant challenges in\nmapping relationships and identifying the roles of various entities.\nTraditional methods for constructing supply chain networks rely heavily on\nstructured datasets and manual data collection, limiting their scope and\nefficiency. In contrast, recent advancements in Natural Language Processing\n(NLP) and large language models (LLMs) offer new opportunities for discovering\nand analyzing supply chain networks using unstructured text data. This paper\nproposes a novel approach that leverages LLMs to extract and process raw\ntextual information from publicly available sources to construct a\ncomprehensive supply chain graph. We focus on the civil engineering sector as a\ncase study, demonstrating how LLMs can uncover hidden relationships among\ncompanies, projects, and other entities. Additionally, we fine-tune an LLM to\nclassify entities within the supply chain graph, providing detailed insights\ninto their roles and relationships. The results show that domain-specific\nfine-tuning improves classification accuracy, highlighting the potential of\nLLMs for industry-specific supply chain analysis. Our contributions include the\ndevelopment of a supply chain graph for the civil engineering sector, as well\nas a fine-tuned LLM model that enhances entity classification and understanding\nof supply chain networks.",
    "authors": [
      "Tong Liu",
      "Hadi Meidani"
    ],
    "publication_date": "2024-10-16T21:24:13Z",
    "arxiv_id": "http://arxiv.org/abs/2410.13051v1",
    "download_url": "http://arxiv.org/abs/2410.13051v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "CISOL: An Open and Extensible Dataset for Table Structure Recognition in\n  the Construction Industry",
    "abstract": "Reproducibility and replicability are critical pillars of empirical research,\nparticularly in machine learning, where they depend not only on the\navailability of models, but also on the datasets used to train and evaluate\nthose models. In this paper, we introduce the Construction Industry Steel\nOrdering List (CISOL) dataset, which was developed with a focus on transparency\nto ensure reproducibility, replicability, and extensibility. CISOL provides a\nvaluable new research resource and highlights the importance of having diverse\ndatasets, even in niche application domains such as table extraction in civil\nengineering.\n  CISOL is unique in that it contains real-world civil engineering documents\nfrom industry, making it a distinctive contribution to the field. The dataset\ncontains more than 120,000 annotated instances in over 800 document images,\npositioning it as a medium-sized dataset that provides a robust foundation for\nTable Structure Recognition (TSR) and Table Detection (TD) tasks.\n  Benchmarking results show that CISOL achieves 67.22 mAP@0.5:0.95:0.05 using\nthe YOLOv8 model, outperforming the TSR-specific TATR model. This highlights\nthe effectiveness of CISOL as a benchmark for advancing TSR, especially in\nspecialized domains.",
    "authors": [
      "David Tschirschwitz",
      "Volker Rodehorst"
    ],
    "publication_date": "2025-01-26T10:16:21Z",
    "arxiv_id": "http://arxiv.org/abs/2501.15469v1",
    "download_url": "http://arxiv.org/abs/2501.15469v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dictionary-Learning-Based Data Pruning for System Identification",
    "abstract": "System identification is normally involved in augmenting time series data by\ntime shifting and nonlinearisation (e.g., polynomial basis), both of which\nintroduce redundancy in features and samples. Many research works focus on\nreducing redundancy feature-wise, while less attention is paid to sample-wise\nredundancy. This paper proposes a novel data pruning method, called mini-batch\nFastCan, to reduce sample-wise redundancy based on dictionary learning. Time\nseries data is represented by some representative samples, called atoms, via\ndictionary learning. The useful samples are selected based on their correlation\nwith the atoms. The method is tested on one simulated dataset and two benchmark\ndatasets. The R-squared between the coefficients of models trained on the full\ndatasets and the coefficients of models trained on pruned datasets is adopted\nto evaluate the performance of data pruning methods. It is found that the\nproposed method significantly outperforms the random pruning method.",
    "authors": [
      "Tingna Wang",
      "Sikai Zhang",
      "Mingming Song",
      "Limin Sun"
    ],
    "publication_date": "2025-02-17T06:38:43Z",
    "arxiv_id": "http://arxiv.org/abs/2502.11484v2",
    "download_url": "http://arxiv.org/abs/2502.11484v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Few-shot crack image classification using clip based on bayesian\n  optimization",
    "abstract": "This study proposes a novel few-shot crack image classification model based\non CLIP and Bayesian optimization. By combining multimodal information and\nBayesian approach, the model achieves efficient classification of crack images\nin a small number of training samples. The CLIP model employs its robust\nfeature extraction capabilities to facilitate precise classification with a\nlimited number of samples. In contrast, Bayesian optimisation enhances the\nrobustness and generalization of the model, while reducing the reliance on\nextensive labelled data. The results demonstrate that the model exhibits robust\nperformance across a diverse range of dataset scales, particularly in the\ncontext of small sample sets. The study validates the potential of the method\nin civil engineering crack classification.",
    "authors": [
      "Yingchao Zhang",
      "Cheng Liu"
    ],
    "publication_date": "2025-03-01T07:04:54Z",
    "arxiv_id": "http://arxiv.org/abs/2503.00376v1",
    "download_url": "http://arxiv.org/abs/2503.00376v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]