[
  {
    "title": "A Molecular Dynamics Study of Mechanical Properties of Vertically Stacked Silicene/MoS2 van der Waals Heterostructure",
    "abstract": "Silicene is an intriguing silicon allotrope with a honeycomb lattice structure similar to graphene with slightly buckled geometry. Molybdenum disulfide (MoS2), on the other hand, is a significant 2D transition metal dichalcogenide that has demonstrated promise in a variety of applications. Van der Waals heterostructures, which are created by stacking distinct 2D crystals on top of each other, are becoming increasingly important due to their unique optoelectronic and electromechanical properties. Using molecular dynamics simulations, the mechanical characteristics of vertically stacked Silicene/MoS2 van der Waals heterostructures are examined in this study. The response and structural stability of the heterostructures at various loading orientations and temperatures are given particular attention. The research findings highlight that the fracture strength of the Silicene/MoS2 heterostructure decreases by 40% in both armchair and zigzag orientations when the temperature is raised from 100K to 600K. Furthermore, a linear decrease in Young's modulus is observed as temperature rises. It is noteworthy that the Rule of Mixture (ROM) predictions for Young's Moduli are observed to be marginally lower than the simulation results. The analyses reveal that the silicene layer fractures first under both loading directions shows crack propagation at +-60°in the armchair and predominantly perpendicular in zigzag, followed by subsequent MoS2 layer failure. The study also shows that the MoS2 layer largely determines the elastic properties of the heterostructure, whereas the silicene layer primarily dictates the failure of the heterostructure. These findings offer an in-depth understanding of the mechanical properties of Silicene/MoS2 heterostructures, with significant implications for their use in cutting-edge nanoelectronics and nanomechanical systems.",
    "authors": [
      "Bishwajit Kar",
      "Plabon Paul",
      "Md Arshadur Rahman",
      "Mohammad Jane Alam Khan"
    ],
    "publication_date": "2024-01-06T06:47:13Z",
    "arxiv_id": "http://arxiv.org/abs/2401.03139v1",
    "download_url": "https://arxiv.org/abs/2401.03139v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]