[
  {
    "title": "Morescient GAI for Software Engineering (Extended Version)",
    "abstract": "The ability of Generative AI (GAI) technology to automatically check, synthesize and modify software engineering artifacts promises to revolutionize all aspects of software engineering. Using GAI for software engineering tasks is consequently one of the most rapidly expanding fields of software engineering research, with over a hundred LLM-based code models having been published since 2021. However, the overwhelming majority of existing code models share a major weakness - they are exclusively trained on the syntactic facet of software, significantly lowering their trustworthiness in tasks dependent on software semantics. To address this problem, a new class of \"Morescient\" GAI is needed that is \"aware\" of (i.e., trained on) both the semantic and static facets of software. This, in turn, will require a new generation of software observation platforms capable of generating large quantities of execution observations in a structured and readily analyzable way. In this paper, we present a vision and roadmap for how such \"Morescient\" GAI models can be engineered, evolved and disseminated according to the principles of open science.",
    "authors": [
      "Marcus Kessel",
      "Colin Atkinson"
    ],
    "publication_date": "2024-06-07T07:38:33Z",
    "arxiv_id": "http://arxiv.org/abs/2406.04710v2",
    "download_url": "https://arxiv.org/abs/2406.04710v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Web Engineering",
    "abstract": "Web Engineering is the application of systematic, disciplined and quantifiable approaches to development, operation, and maintenance of Web-based applications. It is both a pro-active approach and a growing collection of theoretical and empirical research in Web application development. This paper gives an overview of Web Engineering by addressing the questions: a) why is it needed? b) what is its domain of operation? c) how does it help and what should it do to improve Web application development? and d) how should it be incorporated in education and training? The paper discusses the significant differences that exist between Web applications and conventional software, the taxonomy of Web applications, the progress made so far and the research issues and experience of creating a specialisation at the master's level. The paper reaches a conclusion that Web Engineering at this stage is a moving target since Web technologies are constantly evolving, making new types of applications possible, which in turn may require innovations in how they are built, deployed and maintained.",
    "authors": [
      "Yogesh Deshpande",
      "San Murugesan",
      "Athula Ginige",
      "Steve Hansen",
      "Daniel Schwabe",
      "Martin Gaedke",
      "Bebo White"
    ],
    "publication_date": "2003-06-18T03:13:44Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0306108v1",
    "download_url": "https://arxiv.org/abs/cs/0306108v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cognitive Biases in Software Engineering: A Systematic Mapping Study",
    "abstract": "One source of software project challenges and failures is the systematic errors introduced by human cognitive biases. Although extensively explored in cognitive psychology, investigations concerning cognitive biases have only recently gained popularity in software engineering (SE) research. This paper therefore systematically maps, aggregates and synthesizes the literature on cognitive biases in software engineering to generate a comprehensive body of knowledge, understand state of the art research and provide guidelines for future research and practise. Focusing on bias antecedents, effects and mitigation techniques, we identified 65 articles, which investigate 37 cognitive biases, published between 1990 and 2016. Despite strong and increasing interest, the results reveal a scarcity of research on mitigation techniques and poor theoretical foundations in understanding and interpreting cognitive biases. Although bias-related research has generated many new insights in the software engineering community, specific bias mitigation techniques are still needed for software professionals to overcome the deleterious effects of cognitive biases on their work.",
    "authors": [
      "Rahul Mohanani",
      "Iflaah Salman",
      "Burak Turhan",
      "Pilar Rodriguez",
      "Paul Ralph"
    ],
    "publication_date": "2017-07-12T19:05:19Z",
    "arxiv_id": "http://arxiv.org/abs/1707.03869v3",
    "download_url": "https://arxiv.org/abs/1707.03869v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering for Collective Cyber-Physical Ecosystems",
    "abstract": "Today's distributed and pervasive computing addresses large-scale cyber-physical ecosystems, characterised by dense and large networks of devices capable of computation, communication and interaction with the environment and people. While most research focusses on treating these systems as \"composites\" (i.e., heterogeneous functional complexes), recent developments in fields such as self-organising systems and swarm robotics have opened up a complementary perspective: treating systems as \"collectives\" (i.e., uniform, collaborative, and self-organising groups of entities). This article explores the motivations, state of the art, and implications of this \"collective computing paradigm\" in software engineering, discusses its peculiar challenges, and outlines a path for future research, touching on aspects such as macroprogramming, collective intelligence, self-adaptive middleware, learning, synthesis, and experimentation of collective behaviour.",
    "authors": [
      "Roberto Casadei",
      "Gianluca Aguzzi",
      "Giorgio Audrito",
      "Ferruccio Damiani",
      "Danilo Pianini",
      "Giordano Scarso",
      "Gianluca Torta",
      "Mirko Viroli"
    ],
    "publication_date": "2024-06-07T09:28:22Z",
    "arxiv_id": "http://arxiv.org/abs/2406.04780v1",
    "download_url": "https://arxiv.org/abs/2406.04780v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering in Civic Tech: A Case Study about Code for Ireland",
    "abstract": "Civic grassroots have proven their ability to create useful and scalable software that addresses pressing social needs. Although software engineering plays a fundamental role in the process of creating civic technology, academic literature that analyses the software development processes of civic tech grassroots is scarce. This paper aims to advance the understanding of how civic grassroots tackle the different activities in their software development processes. In this study, we followed the formation of two projects in a civic tech group (Code for Ireland) seeking to understand how their development processes evolved over time, and how the group carried out their work in creating new technology. Our preliminary findings show that such groups are capable of setting up systematic software engineering processes that address software specification, development, validation, and evolution. While they were able to deliver software according to self-specified quality standards, the group has challenges in requirements specification, stakeholder engagement, and reorienting from development to product delivery. Software engineering methods and tools can effectively support the future of civic technologies and potentially improve their management, quality, and durability.",
    "authors": [
      "Antti Knutas",
      "Victoria Palacin",
      "Giovanni Maccani",
      "Markus Helfert"
    ],
    "publication_date": "2019-04-08T14:53:37Z",
    "arxiv_id": "http://arxiv.org/abs/1904.04104v1",
    "download_url": "https://arxiv.org/abs/1904.04104v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Study about the Knowledge and Use of Requirements Engineering Standards in Industry",
    "abstract": "Context: The use of standards is considered a vital part of any engineering discipline. So one could expect that standards play an important role in Requirements Engineering (RE) as well. However, little is known about the actual knowledge and use of RE-related standards in industry. Objective: In this article, we investigate to which extent standards and related artifacts such as templates or guidelines are known and used by RE practitioners. Method: To this end, we have conducted a questionnaire-based online survey. We could analyze the replies from 90 RE practitioners using a combination of closed and open-text questions. Results: Our results indicate that the knowledge and use of standards and related artifacts in RE is less widespread than one might expect from an engineering perspective. For example, about 47% of the respondents working as requirements engineers or business analysts do not know the core standard in RE, ISO/IEC/IEEE 29148. Participants in our study mostly use standards by personal decision rather than being imposed by their respective company, customer, or regulator. Beyond insufficient knowledge, we also found cultural and organizational factors impeding the widespread adoption of standards in RE. Conclusions: Overall, our results provide empirically informed insights into the actual use of standards and related artifacts in RE practice and - indirectly - about the value that the current standards create for RE practitioners.",
    "authors": [
      "Xavier Franch",
      "Martin Glinz",
      "Daniel Mendez",
      "Norbert Seyff"
    ],
    "publication_date": "2021-05-28T16:31:25Z",
    "arxiv_id": "http://arxiv.org/abs/2105.13961v3",
    "download_url": "https://arxiv.org/abs/2105.13961v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How do Practitioners Perceive the Relevance of Requirements Engineering Research?",
    "abstract": "The relevance of Requirements Engineering (RE) research to practitioners is vital for a long-term dissemination of research results to everyday practice. Some authors have speculated about a mismatch between research and practice in the RE discipline. However, there is not much evidence to support or refute this perception. This paper presents the results of a study aimed at gathering evidence from practitioners about their perception of the relevance of RE research and at understanding the factors that influence that perception. We conducted a questionnaire-based survey of industry practitioners with expertise in RE. The participants rated the perceived relevance of 435 scientific papers presented at five top RE-related conferences. The 153 participants provided a total of 2,164 ratings. The practitioners rated RE research as essential or worthwhile in a majority of cases. However, the percentage of non-positive ratings is still higher than we would like. Among the factors that affect the perception of relevance are the research's links to industry, the research method used, and respondents' roles. The reasons for positive perceptions were primarily related to the relevance of the problem and the soundness of the solution, while the causes for negative perceptions were more varied. The respondents also provided suggestions for future research, including topics researchers have studied for decades, like elicitation or requirement quality criteria.",
    "authors": [
      "Xavier Franch",
      "Daniel Mendez",
      "Andreas Vogelsang",
      "Rogardt Heldal",
      "Eric Knauss",
      "Marc Oriol",
      "Guilherme H. Travassos",
      "Jeffrey C. Carver",
      "Thomas Zimmermann"
    ],
    "publication_date": "2020-11-10T14:09:26Z",
    "arxiv_id": "http://arxiv.org/abs/2011.05106v2",
    "download_url": "https://arxiv.org/abs/2011.05106v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Digital Engineering -- The Advent of Digital Systems Engineering",
    "abstract": "Digital Engineering, the digital transformation of engineering to leverage digital technologies, is coming globally. This paper explores digital systems engineering, which aims at developing theory, methods, models, and tools to support the emerging digital engineering. A critical task is to digitalize engineering artifacts, thus enabling information sharing across platform, across life cycle, and across domains. We identify significant challenges and enabling digital technologies; analyze the transition from traditional engineering to digital engineering; define core concepts, including \"digitalization\", \"unique identification\", \"digitalized artifacts\", \"digital augmentation\", and others; present a big picture of digital systems engineering in four levels: vision, strategy, action, and foundation; briefly discuss each of main areas of research issues. Digitalization enables fast infusing and leveraging novel digital technologies; unique identification enables information traceability and accountability in engineering lifecycle; provenance enables tracing dependency relations among engineering artifacts; supporting model reproducibility and replicability; helping with trustworthiness evaluation of digital engineering artifacts.",
    "authors": [
      "Jingwei Huang",
      "Adrian Gheorghe",
      "Holly Handley",
      "Pilar Pazos",
      "Ariel Pinto",
      "Samuel Kovacic",
      "Andy Collins",
      "Charles Keating",
      "Andres Sousa-Poza",
      "Ghaith Rabadi",
      "Resit Unal",
      "Teddy Cotter",
      "Rafael Landaeta",
      "Charles Daniels"
    ],
    "publication_date": "2020-02-21T04:58:20Z",
    "arxiv_id": "http://arxiv.org/abs/2002.11672v3",
    "download_url": "https://arxiv.org/abs/2002.11672v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Text and Team: What Article Metadata Characteristics Drive Citations in Software Engineering?",
    "abstract": "Context: Citations are a key measure of scientific performance in most fields, including software engineering. However, there is limited research that studies which characteristics of articles' metadata (title, abstract, keywords, and author list) are driving citations in this field. Objective: In this study, we propose a simple theoretical model for how citations come to be with respect to article metadata, we hypothesize theoretical linkages between metadata characteristics and citations of articles, and we empirically test these hypotheses. Method: We use multiple regression analyses to examine a data set comprising the titles, abstracts, keywords, and authors of 16,131 software engineering articles published between 1990 and 2020 in 20 highly influential software engineering venues. Results: We find that number of authors, number of keywords, number of question marks and dividers in the title, number of acronyms, abstract length, abstract propositional idea density, and corresponding authors in the core Anglosphere are significantly related to citations. Conclusion: Various characteristics of articles' metadata are linked to the frequency with which the corresponding articles are cited. These results partially confirm and partially go counter to prior findings in software engineering and other disciplines.",
    "authors": [
      "Lorenz Graf-Vlachy",
      "Daniel Graziotin",
      "Stefan Wagner"
    ],
    "publication_date": "2022-04-12T18:39:11Z",
    "arxiv_id": "http://arxiv.org/abs/2204.06033v1",
    "download_url": "https://arxiv.org/abs/2204.06033v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Exploratory Study of V-Model in Building ML-Enabled Software: A Systems Engineering Perspective",
    "abstract": "Machine learning (ML) components are being added to more and more critical and impactful software systems, but the software development process of real-world production systems from prototyped ML models remains challenging with additional complexity and interdisciplinary collaboration challenges. This poses difficulties in using traditional software lifecycle models such as waterfall, spiral, or agile models when building ML-enabled systems. In this research, we apply a Systems Engineering lens to investigate the use of V-Model in addressing the interdisciplinary collaboration challenges when building ML-enabled systems. By interviewing practitioners from software companies, we established a set of 8 propositions for using V-Model to manage interdisciplinary collaborations when building products with ML components. Based on the propositions, we found that despite requiring additional efforts, the characteristics of V-Model align effectively with several collaboration challenges encountered by practitioners when building ML-enabled systems. We recommend future research to investigate new process models, frameworks and tools that leverage the characteristics of V-Model such as the system decomposition, clear system boundary, and consistency of Validation & Verification (V&V) for building ML-enabled systems.",
    "authors": [
      "Jie JW Wu"
    ],
    "publication_date": "2023-08-10T06:53:32Z",
    "arxiv_id": "http://arxiv.org/abs/2308.05381v4",
    "download_url": "https://arxiv.org/abs/2308.05381v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "What Does a Software Engineer Look Like? Exploring Societal Stereotypes in LLMs",
    "abstract": "Large language models (LLMs) have rapidly gained popularity and are being embedded into professional applications due to their capabilities in generating human-like content. However, unquestioned reliance on their outputs and recommendations can be problematic as LLMs can reinforce societal biases and stereotypes. This study investigates how LLMs, specifically OpenAI's GPT-4 and Microsoft Copilot, can reinforce gender and racial stereotypes within the software engineering (SE) profession through both textual and graphical outputs. We used each LLM to generate 300 profiles, consisting of 100 gender-based and 50 gender-neutral profiles, for a recruitment scenario in SE roles. Recommendations were generated for each profile and evaluated against the job requirements for four distinct SE positions. Each LLM was asked to select the top 5 candidates and subsequently the best candidate for each role. Each LLM was also asked to generate images for the top 5 candidates, providing a dataset for analysing potential biases in both text-based selections and visual representations. Our analysis reveals that both models preferred male and Caucasian profiles, particularly for senior roles, and favoured images featuring traits such as lighter skin tones, slimmer body types, and younger appearances. These findings highlight underlying societal biases influence the outputs of LLMs, contributing to narrow, exclusionary stereotypes that can further limit diversity and perpetuate inequities in the SE field. As LLMs are increasingly adopted within SE research and professional practices, awareness of these biases is crucial to prevent the reinforcement of discriminatory norms and to ensure that AI tools are leveraged to promote an inclusive and equitable engineering culture rather than hinder it.",
    "authors": [
      "Muneera Bano",
      "Hashini Gunatilake",
      "Rashina Hoda"
    ],
    "publication_date": "2025-01-07T06:44:41Z",
    "arxiv_id": "http://arxiv.org/abs/2501.03569v1",
    "download_url": "https://arxiv.org/abs/2501.03569v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nmag micromagnetic simulation tool - software engineering lessons learned",
    "abstract": "We review design and development decisions and their impact for the open source code Nmag from a software engineering in computational science point of view. We summarise lessons learned and recommendations for future computational science projects. Key lessons include that encapsulating the simulation functionality in a library of a general purpose language, here Python, provides great flexibility in using the software. The choice of Python for the top-level user interface was very well received by users from the science and engineering community. The from-source installation in which required external libraries and dependencies are compiled from a tarball was remarkably robust. In places, the code is a lot more ambitious than necessary, which introduces unnecessary complexity and reduces main- tainability. Tests distributed with the package are useful, although more unit tests and continuous integration would have been desirable. The detailed documentation, together with a tutorial for the usage of the system, was perceived as one of its main strengths by the community.",
    "authors": [
      "Hans Fangohr",
      "Maximilian Albert",
      "Matteo Franchin"
    ],
    "publication_date": "2016-01-27T14:46:56Z",
    "arxiv_id": "http://arxiv.org/abs/1601.07392v2",
    "download_url": "https://arxiv.org/abs/1601.07392v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering Tagging Languages for DSLs",
    "abstract": "To keep a DSL clean, readable and reusable in different contexts, it is useful to define a separate tagging language. A tag model logically adds information to the tagged DSL model while technically keeping the artifacts separated. Using a generic tagging language leads to promiscuous tag models, whereas defining a target DSL-specific tag language has a high initial overhead. This paper presents a systematic approach to define a DSL-specific tag language and a corresponding schema language, combining the advantages of both worlds: (a) the tag language specifically fits to the DSL, (b) the artifacts are kept separated and enabling reuse with different tag decorations, (c) the tag language follows a defined type schema, and (d) systematic derivation considerably reduces the effort necessary to implement the tag language. An example shows that it can at least partially be realized by a generator and applied for any kind of DSL. Index Terms Software Engineering, Modeling, MDE, GSE",
    "authors": [
      "Timo Greifenberg",
      "Markus Look",
      "Sebastian Roidl",
      "Bernhard Rumpe"
    ],
    "publication_date": "2016-06-16T09:41:31Z",
    "arxiv_id": "http://arxiv.org/abs/1606.05112v1",
    "download_url": "https://arxiv.org/abs/1606.05112v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Status Quo in Requirements Engineering: A Theory and a Global Family of Surveys",
    "abstract": "Requirements Engineering (RE) has established itself as a software engineering discipline during the past decades. While researchers have been investigating the RE discipline with a plethora of empirical studies, attempts to systematically derive an empirically-based theory in context of the RE discipline have just recently been started. However, such a theory is needed if we are to define and motivate guidance in performing high quality RE research and practice. We aim at providing an empirical and valid foundation for a theory of RE, which helps software engineers establish effective and efficient RE processes. We designed a survey instrument and theory that has now been replicated in 10 countries world-wide. We evaluate the propositions of the theory with bootstrapped confidence intervals and derive potential explanations for the propositions. We report on the underlying theory and the full results obtained from the replication studies with participants from 228 organisations. Our results represent a substantial step forward towards developing an empirically-based theory of RE giving insights into current practices with RE processes. The results reveal, for example, that there are no strong differences between organisations in different countries and regions, that interviews, facilitated meetings and prototyping are the most used elicitation techniques, that requirements are often documented textually, that traces between requirements and code or design documents is common, requirements specifications themselves are rarely changed and that requirements engineering (process) improvement endeavours are mostly intrinsically motivated. Our study establishes a theory that can be used as starting point for many further studies for more detailed investigations. Practitioners can use the results as theory-supported guidance on selecting suitable RE methods and techniques.",
    "authors": [
      "Stefan Wagner",
      "Daniel Méndez Fernández",
      "Michael Felderer",
      "Antonio Vetró",
      "Marcos Kalinowski",
      "Roel Wieringa",
      "Dietmar Pfahl",
      "Tayana Conte",
      "Marie-Therese Christiansson",
      "Desmond Greer",
      "Casper Lassenius",
      "Tomi Männistö",
      "Maleknaz Nayebi",
      "Markku Oivo",
      "Birgit Penzenstadler",
      "Rafael Prikladnicki",
      "Guenther Ruhe",
      "André Schekelmann",
      "Sagar Sen",
      "Rodrigo Spínola",
      "Ahmed Tuzcu",
      "Jose Luis de la Vara",
      "Dietmar Winkler"
    ],
    "publication_date": "2018-05-21T08:57:22Z",
    "arxiv_id": "http://arxiv.org/abs/1805.07951v4",
    "download_url": "https://arxiv.org/abs/1805.07951v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Complexity measure based on Requirement Engineering Document",
    "abstract": "Research shows, that the major issue in development of quality software is precise estimation. Further this estimation depends upon the degree of intricacy inherent in the software i.e. complexity. This paper attempts to empirically demonstrate the proposed complexity which is based on IEEE Requirement Engineering document. It is said that a high quality SRS is pre requisite for high quality software. Requirement Engineering document (SRS) is a specification for a particular software product, program or set of program that performs some certain functions for a specific environment. The various complexity measure given so far are based on Code and Cognitive metrics value of software, which are code based. So these metrics provide no leverage to the developer of the code. Considering the shortcoming of code based approaches, the proposed approach identifies complexity of software immediately after freezing the requirement in SDLC process. The proposed complexity measure compares well with established complexity measures. Finally the trend can be validated with the result of proposed measure. Ultimately, Requirement based complexity measure can be used to understand the complexity of proposed software much before the actual implementation of design thus saving on cost and manpower wastage.",
    "authors": [
      "Ashish Sharma",
      "D. S. Kushwaha"
    ],
    "publication_date": "2010-06-14T20:17:55Z",
    "arxiv_id": "http://arxiv.org/abs/1006.2840v1",
    "download_url": "https://arxiv.org/abs/1006.2840v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Phase diagram in a one-dimensional civil disorder model",
    "abstract": "Epstein's model for a civil disorder is an agent-based model that simulates a social protest process where the central authority uses the police force to dissuade it. The interactions of police officers and citizens produce dynamics that do not yet have any analysis from the sociophysics approach. We present numerical simulations to characterize the properties of the one-dimensional civil disorder model on stationary-state. To do this, we consider interactions on a Moore neighborhood and a random neighborhood with two different visions. We introduce a Potts-like energy function and construct the phase diagram using the agent state concentration. We find order-disorder phases and reveal the principle of minimum grievance as the underlying principle of the model's dynamics. Besides, we identify when the system can reach stable or an instability conditions based on the agents' interactions. Finally, we identified the most relevant role of the police based on their capacity to dissuade a protest and their effect on facilitating a stable scenario.",
    "authors": [
      "Ignacio Ormazábal",
      "Felipe Urbina",
      "Félix A. Borotto",
      "Hernán F. Astudillo"
    ],
    "publication_date": "2021-10-02T16:18:41Z",
    "arxiv_id": "http://arxiv.org/abs/2110.00835v2",
    "download_url": "https://arxiv.org/abs/2110.00835v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multilingual Crowd-Based Requirements Engineering Using Large Language Models",
    "abstract": "A central challenge for ensuring the success of software projects is to assure the convergence of developers' and users' views. While the availability of large amounts of user data from social media, app store reviews, and support channels bears many benefits, it still remains unclear how software development teams can effectively use this data. We present an LLM-powered approach called DeeperMatcher that helps agile teams use crowd-based requirements engineering (CrowdRE) in their issue and task management. We are currently implementing a command-line tool that enables developers to match issues with relevant user reviews. We validated our approach on an existing English dataset from a well-known open-source project. Additionally, to check how well DeeperMatcher works for other languages, we conducted a single-case mechanism experiment alongside developers of a local project that has issues and user feedback in Brazilian Portuguese. Our preliminary analysis indicates that the accuracy of our approach is highly dependent on the text embedding method used. We discuss further refinements needed for reliable crowd-based requirements engineering with multilingual support.",
    "authors": [
      "Arthur Pilone",
      "Paulo Meirelles",
      "Fabio Kon",
      "Walid Maalej"
    ],
    "publication_date": "2024-08-12T21:40:39Z",
    "arxiv_id": "http://arxiv.org/abs/2408.06505v1",
    "download_url": "https://arxiv.org/abs/2408.06505v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Event-based Civil Infrastructure Visual Defect Detection: ev-CIVIL Dataset and Benchmark",
    "abstract": "Small Unmanned Aerial Vehicle (UAV) based visual inspections are a more efficient alternative to manual methods for examining civil structural defects, offering safe access to hazardous areas and significant cost savings by reducing labor requirements. However, traditional frame-based cameras, widely used in UAV-based inspections, often struggle to capture defects under low or dynamic lighting conditions. In contrast, Dynamic Vision Sensors (DVS), or event-based cameras, excel in such scenarios by minimizing motion blur, enhancing power efficiency, and maintaining high-quality imaging across diverse lighting conditions without saturation or information loss. Despite these advantages, existing research lacks studies exploring the feasibility of using DVS for detecting civil structural defects.Moreover, there is no dedicated event-based dataset tailored for this purpose. Addressing this gap, this study introduces the first event-based civil infrastructure defect detection dataset, capturing defective surfaces as a spatio-temporal event stream using DVS.In addition to event-based data, the dataset includes grayscale intensity image frames captured simultaneously using an Active Pixel Sensor (APS). Both data types were collected using the DAVIS346 camera, which integrates DVS and APS sensors.The dataset focuses on two types of defects: cracks and spalling, and includes data from both field and laboratory environments. The field dataset comprises 318 recording sequences,documenting 458 distinct cracks and 121 distinct spalling instances.The laboratory dataset includes 362 recording sequences, covering 220 distinct cracks and 308 spalling instances.Four realtime object detection models were evaluated on it to validate the dataset effectiveness.The results demonstrate the dataset robustness in enabling accurate defect detection and classification,even under challenging lighting conditions.",
    "authors": [
      "Udayanga G. W. K. N. Gamage",
      "Xuanni Huo",
      "Luca Zanatta",
      "T Delbruck",
      "Cesar Cadena",
      "Matteo Fumagalli",
      "Silvia Tolu"
    ],
    "publication_date": "2025-04-08T04:44:33Z",
    "arxiv_id": "http://arxiv.org/abs/2504.05679v1",
    "download_url": "https://arxiv.org/abs/2504.05679v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Foundation Model Engineering: Engineering Foundation Models Just as Engineering Software",
    "abstract": "By treating data and models as the source code, Foundation Models (FMs) become a new type of software. Mirroring the concept of software crisis, the increasing complexity of FMs making FM crisis a tangible concern in the coming decade, appealing for new theories and methodologies from the field of software engineering. In this paper, we outline our vision of introducing Foundation Model (FM) engineering, a strategic response to the anticipated FM crisis with principled engineering methodologies. FM engineering aims to mitigate potential issues in FM development and application through the introduction of declarative, automated, and unified programming interfaces for both data and model management, reducing the complexities involved in working with FMs by providing a more structured and intuitive process for developers. Through the establishment of FM engineering, we aim to provide a robust, automated, and extensible framework that addresses the imminent challenges, and discovering new research opportunities for the software engineering field.",
    "authors": [
      "Dezhi Ran",
      "Mengzhou Wu",
      "Wei Yang",
      "Tao Xie"
    ],
    "publication_date": "2024-07-11T04:40:02Z",
    "arxiv_id": "http://arxiv.org/abs/2407.08176v1",
    "download_url": "https://arxiv.org/abs/2407.08176v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Supporting Defect Causal Analysis in Practice with Cross-Company Data on Causes of Requirements Engineering Problems",
    "abstract": "[Context] Defect Causal Analysis (DCA) represents an efficient practice to improve software processes. While knowledge on cause-effect relations is helpful to support DCA, collecting cause-effect data may require significant effort and time. [Goal] We propose and evaluate a new DCA approach that uses cross-company data to support the practical application of DCA. [Method] We collected cross-company data on causes of requirements engineering problems from 74 Brazilian organizations and built a Bayesian network. Our DCA approach uses the diagnostic inference of the Bayesian network to support DCA sessions. We evaluated our approach by applying a model for technology transfer to industry and conducted three consecutive evaluations: (i) in academia, (ii) with industry representatives of the Fraunhofer Project Center at UFBA, and (iii) in an industrial case study at the Brazilian National Development Bank (BNDES). [Results] We received positive feedback in all three evaluations and the cross-company data was considered helpful for determining main causes. [Conclusions] Our results strengthen our confidence in that supporting DCA with cross-company data is promising and should be further investigated.",
    "authors": [
      "Marcos Kalinowski",
      "Pablo Curty",
      "Aline Paes",
      "Alexandre Ferreira",
      "Rodrigo Spínola",
      "Daniel Méndez Fernández",
      "Michael Felderer",
      "Stefan Wagner"
    ],
    "publication_date": "2017-02-13T16:14:30Z",
    "arxiv_id": "http://arxiv.org/abs/1702.03851v1",
    "download_url": "https://arxiv.org/abs/1702.03851v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Mosaic of Perspectives: Understanding Ownership in Software Engineering",
    "abstract": "Agile software development relies on self-organized teams, underlining the importance of individual responsibility. How developers take responsibility and build ownership are influenced by external factors such as architecture and development methods. This paper examines the existing literature on ownership in software engineering and in psychology, and argues that a more comprehensive view of ownership in software engineering has a great potential in improving software team's work. Initial positions on the issue are offered for discussion and to lay foundations for further research.",
    "authors": [
      "Tomi Suomi",
      "Petri Ihantola",
      "Tommi Mikkonen",
      "Niko Mäkitalo"
    ],
    "publication_date": "2025-05-20T11:27:33Z",
    "arxiv_id": "http://arxiv.org/abs/2505.14220v2",
    "download_url": "https://arxiv.org/abs/2505.14220v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PHANTOM: Curating GitHub for engineered software projects using time-series clustering",
    "abstract": "Context: Within the field of Mining Software Repositories, there are numerous methods employed to filter datasets in order to avoid analysing low-quality projects. Unfortunately, the existing filtering methods have not kept up with the growth of existing data sources, such as GitHub, and researchers often rely on quick and dirty techniques to curate datasets.\n  Objective: The objective of this study is to develop a method capable of filtering large quantities of software projects in a resource-efficient way.\n  Method: This study follows the Design Science Research (DSR) methodology. The proposed method, PHANTOM, extracts five measures from Git logs. Each measure is transformed into a time-series, which is represented as a feature vector for clustering using the k-means algorithm.\n  Results: Using the ground truth from a previous study, PHANTOM was shown to be able to rediscover the ground truth on the training dataset, and was able to identify \"engineered\" projects with up to 0.87 Precision and 0.94 Recall on the validation dataset. PHANTOM downloaded and processed the metadata of 1,786,601 GitHub repositories in 21.5 days using a single personal computer, which is over 33% faster than the previous study which used a computer cluster of 200 nodes. The possibility of applying the method outside of the open-source community was investigated by curating 100 repositories owned by two companies.\n  Conclusions: It is possible to use an unsupervised approach to identify engineered projects. PHANTOM was shown to be competitive compared to the existing supervised approaches while reducing the hardware requirements by two orders of magnitude.",
    "authors": [
      "Peter Pickerill",
      "Heiko Joshua Jungen",
      "Miroslaw Ochodek",
      "Miroslaw Staron"
    ],
    "publication_date": "2019-04-25T06:09:11Z",
    "arxiv_id": "http://arxiv.org/abs/1904.11164v2",
    "download_url": "https://arxiv.org/abs/1904.11164v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Scalability-Efficiency/Maintainability-Portability Trade-off in Simulation Software Engineering: Examples and a Preliminary Systematic Literature Review",
    "abstract": "Large-scale simulations play a central role in science and the industry. Several challenges occur when building simulation software, because simulations require complex software developed in a dynamic construction process. That is why simulation software engineering (SSE) is emerging lately as a research focus. The dichotomous trade-off between scalability and efficiency (SE) on the one hand and maintainability and portability (MP) on the other hand is one of the core challenges. We report on the SE/MP trade-off in the context of an ongoing systematic literature review (SLR). After characterizing the issue of the SE/MP trade-off using two examples from our own research, we (1) review the 33 identified articles that assess the trade-off, (2) summarize the proposed solutions for the trade-off, and (3) discuss the findings for SSE and future work. Overall, we see evidence for the SE/MP trade-off and first solution approaches. However, a strong empirical foundation has yet to be established; general quantitative metrics and methods supporting software developers in addressing the trade-off have to be developed. We foresee considerable future work in SSE across scientific communities.",
    "authors": [
      "Dirk Pflüger",
      "Miriam Mehl",
      "Julian Valentin",
      "Florian Lindner",
      "David Pfander",
      "Stefan Wagner",
      "Daniel Graziotin",
      "Yang Wang"
    ],
    "publication_date": "2016-08-15T17:31:46Z",
    "arxiv_id": "http://arxiv.org/abs/1608.04336v3",
    "download_url": "https://arxiv.org/abs/1608.04336v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Insights from the Frontline: GenAI Utilization Among Software Engineering Students",
    "abstract": "Generative AI (genAI) tools (e.g., ChatGPT, Copilot) have become ubiquitous in software engineering (SE). As SE educators, it behooves us to understand the consequences of genAI usage among SE students and to create a holistic view of where these tools can be successfully used. Through 16 reflective interviews with SE students, we explored their academic experiences of using genAI tools to complement SE learning and implementations. We uncover the contexts where these tools are helpful and where they pose challenges, along with examining why these challenges arise and how they impact students. We validated our findings through member checking and triangulation with instructors. Our findings provide practical considerations of where and why genAI should (not) be used in the context of supporting SE students.",
    "authors": [
      "Rudrajit Choudhuri",
      "Ambareesh Ramakrishnan",
      "Amreeta Chatterjee",
      "Bianca Trinkenreich",
      "Igor Steinmacher",
      "Marco Gerosa",
      "Anita Sarma"
    ],
    "publication_date": "2024-12-20T07:30:51Z",
    "arxiv_id": "http://arxiv.org/abs/2412.15624v1",
    "download_url": "https://arxiv.org/abs/2412.15624v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Socio-Technical Grounded Theory for Software Engineering",
    "abstract": "Grounded Theory (GT), a sociological research method designed to study social phenomena, is increasingly being used to investigate the human and social aspects of software engineering (SE). However, being written by and for sociologists, GT is often challenging for a majority of SE researchers to understand and apply. Additionally, SE researchers attempting ad hoc adaptations of traditional GT guidelines for modern socio-technical (ST) contexts often struggle in the absence of clear and relevant guidelines to do so, resulting in poor quality studies. To overcome these research community challenges and leverage modern research opportunities, this paper presents Socio-Technical Grounded Theory (STGT) designed to ease application and achieve quality outcomes. It defines what exactly is meant by an ST research context and presents the STGT guidelines that expand GT's philosophical foundations, provide increased clarity and flexibility in its methodological steps and procedures, define possible scope and contexts of application, encourage frequent reporting of a variety of interim, preliminary, and mature outcomes, and introduce nuanced evaluation guidelines for different outcomes. It is hoped that the SE research community and related ST disciplines such as computer science, data science, artificial intelligence, information systems, human computer/robot/AI interaction, human-centered emerging technologies (and increasingly other disciplines being transformed by rapid digitalisation and AI-based augmentation), will benefit from applying STGT to conduct quality research studies and systematically produce rich findings and mature theories with confidence.",
    "authors": [
      "Rashina Hoda"
    ],
    "publication_date": "2021-03-26T02:49:20Z",
    "arxiv_id": "http://arxiv.org/abs/2103.14235v3",
    "download_url": "https://arxiv.org/abs/2103.14235v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prompt Engineering Guidelines for Using Large Language Models in Requirements Engineering",
    "abstract": "The rapid emergence of generative AI models like Large Language Models (LLMs) has demonstrated its utility across various activities, including within Requirements Engineering (RE). Ensuring the quality and accuracy of LLM-generated output is critical, with prompt engineering serving as a key technique to guide model responses. However, existing literature provides limited guidance on how prompt engineering can be leveraged, specifically for RE activities. The objective of this study is to explore the applicability of existing prompt engineering guidelines for the effective usage of LLMs within RE. To achieve this goal, we began by conducting a systematic review of primary literature to compile a non-exhaustive list of prompt engineering guidelines. Then, we conducted interviews with RE experts to present the extracted guidelines and gain insights on the advantages and limitations of their application within RE. Our literature review indicates a shortage of prompt engineering guidelines for domain-specific activities, specifically for RE. Our proposed mapping contributes to addressing this shortage. We conclude our study by identifying an important future line of research within this field.",
    "authors": [
      "Krishna Ronanki",
      "Simon Arvidsson",
      "Johan Axell"
    ],
    "publication_date": "2025-07-04T09:13:50Z",
    "arxiv_id": "http://arxiv.org/abs/2507.03405v1",
    "download_url": "https://arxiv.org/abs/2507.03405v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structure Preserving Transformations for Practical Model-based Systems Engineering",
    "abstract": "In this third decade of systems engineering in the twenty-first century, it is important to develop and demonstrate practical methods to exploit machine-readable models in the engineering of systems. Substantial investment has been made in languages and modelling tools for developing models. A key problem is that system architects and engineers work in a multidisciplinary environment in which models are not the product of any one individual. This paper provides preliminary results of a formal approach to specify models and structure preserving transformations between them that support model synchronization. This is an important area of research and practice in software engineering. However, it is limited to synchronization at the code level of systems. This paper leverages previous research of the authors to define a core fractal for interpretation of concepts into model specifications and transformation between models. This fractal is used to extend the concept of synchronization of models to the system level and is demonstrated through a practical engineering example for an advanced driver assistance system.",
    "authors": [
      "Siyuan Ji",
      "Michael Wilkinson",
      "Charles E. Dickerson"
    ],
    "publication_date": "2022-09-16T13:52:31Z",
    "arxiv_id": "http://arxiv.org/abs/2209.07935v1",
    "download_url": "https://arxiv.org/abs/2209.07935v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Trustworthy and Synergistic Artificial Intelligence for Software Engineering: Vision and Roadmaps",
    "abstract": "For decades, much software engineering research has been dedicated to devising automated solutions aimed at enhancing developer productivity and elevating software quality. The past two decades have witnessed an unparalleled surge in the development of intelligent solutions tailored for software engineering tasks. This momentum established the Artificial Intelligence for Software Engineering (AI4SE) area, which has swiftly become one of the most active and popular areas within the software engineering field.\n  This Future of Software Engineering (FoSE) paper navigates through several focal points. It commences with a succinct introduction and history of AI4SE. Thereafter, it underscores the core challenges inherent to AI4SE, particularly highlighting the need to realize trustworthy and synergistic AI4SE. Progressing, the paper paints a vision for the potential leaps achievable if AI4SE's key challenges are surmounted, suggesting a transition towards Software Engineering 2.0. Two strategic roadmaps are then laid out: one centered on realizing trustworthy AI4SE, and the other on fostering synergistic AI4SE. While this paper may not serve as a conclusive guide, its intent is to catalyze further progress. The ultimate aspiration is to position AI4SE as a linchpin in redefining the horizons of software engineering, propelling us toward Software Engineering 2.0.",
    "authors": [
      "David Lo"
    ],
    "publication_date": "2023-09-08T05:53:24Z",
    "arxiv_id": "http://arxiv.org/abs/2309.04142v2",
    "download_url": "https://arxiv.org/abs/2309.04142v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Software Engineering and Potential of Quantum Computing in Software Engineering Research: A Review",
    "abstract": "Research in software engineering is essential for improving development practices, leading to reliable and secure software. Leveraging the principles of quantum physics, quantum computing has emerged as a new computational paradigm that offers significant advantages over classical computing. As quantum computing progresses rapidly, its potential applications across various fields are becoming apparent. In software engineering, many tasks involve complex computations where quantum computers can greatly speed up the development process, leading to faster and more efficient solutions. With the growing use of quantum-based applications in different fields, quantum software engineering (QSE) has emerged as a discipline focused on designing, developing, and optimizing quantum software for diverse applications. This paper aims to review the role of quantum computing in software engineering research and the latest developments in QSE. To our knowledge, this is the first comprehensive review on this topic. We begin by introducing quantum computing, exploring its fundamental concepts, and discussing its potential applications in software engineering. We also examine various QSE techniques that expedite software development. Finally, we discuss the opportunities and challenges in quantum-driven software engineering and QSE. Our study reveals that quantum machine learning (QML) and quantum optimization have substantial potential to address classical software engineering tasks, though this area is still limited. Current QSE tools and techniques lack robustness and maturity, indicating a need for more focus. One of the main challenges is that quantum computing has yet to reach its full potential.",
    "authors": [
      "Ashis Kumar Mandal",
      "Md Nadim",
      "Chanchal K. Roy",
      "Banani Roy",
      "Kevin A. Schneider"
    ],
    "publication_date": "2025-02-13T03:22:36Z",
    "arxiv_id": "http://arxiv.org/abs/2502.08925v1",
    "download_url": "https://arxiv.org/abs/2502.08925v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bayesian Data Analysis in Empirical Software Engineering Research",
    "abstract": "Statistics comes in two main flavors: frequentist and Bayesian. For historical and technical reasons, frequentist statistics have traditionally dominated empirical data analysis, and certainly remain prevalent in empirical software engineering. This situation is unfortunate because frequentist statistics suffer from a number of shortcomings---such as lack of flexibility and results that are unintuitive and hard to interpret---that curtail their effectiveness when dealing with the heterogeneous data that is increasingly available for empirical analysis of software engineering practice.\n  In this paper, we pinpoint these shortcomings, and present Bayesian data analysis techniques that provide tangible benefits---as they can provide clearer results that are simultaneously robust and nuanced. After a short, high-level introduction to the basic tools of Bayesian statistics, we present the reanalysis of two empirical studies on the effectiveness of automatically generated tests and the performance of programming languages. By contrasting the original frequentist analyses with our new Bayesian analyses, we demonstrate the concrete advantages of the latter. To conclude we advocate a more prominent role for Bayesian statistical techniques in empirical software engineering research and practice.",
    "authors": [
      "Carlo A. Furia",
      "Robert Feldt",
      "Richard Torkar"
    ],
    "publication_date": "2018-11-13T17:24:51Z",
    "arxiv_id": "http://arxiv.org/abs/1811.05422v5",
    "download_url": "https://arxiv.org/abs/1811.05422v5",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lessons Learned from Educating AI Engineers",
    "abstract": "Over the past three years we have built a practice-oriented, bachelor level, educational programme for software engineers to specialize as AI engineers. The experience with this programme and the practical assignments our students execute in industry has given us valuable insights on the profession of AI engineer. In this paper we discuss our programme and the lessons learned for industry and research.",
    "authors": [
      "Petra Heck",
      "Gerard Schouten"
    ],
    "publication_date": "2021-03-19T09:34:52Z",
    "arxiv_id": "http://arxiv.org/abs/2103.10703v1",
    "download_url": "https://arxiv.org/abs/2103.10703v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Knowledge-Based Aerospace Engineering -- A Systematic Literature Review",
    "abstract": "The aerospace industry operates at the frontier of technological innovation while maintaining high standards regarding safety and reliability. In this environment, with an enormous potential for re-use and adaptation of existing solutions and methods, Knowledge-Based Engineering (KBE) has been applied for decades. The objective of this study is to identify and examine state-of-the-art knowledge management practices in the field of aerospace engineering. Our contributions include: 1) A SWARM-SLR of over 1,000 articles with qualitative analysis of 164 selected articles, supported by two aerospace engineering domain expert surveys. 2) A knowledge graph of over 700 knowledge-based aerospace engineering processes, software, and data, formalized in the interoperable Web Ontology Language (OWL) and mapped to Wikidata entries where possible. The knowledge graph is represented on the Open Research Knowledge Graph (ORKG), and an aerospace Wikibase, for reuse and continuation of structuring aerospace engineering knowledge exchange. 3) Our resulting intermediate and final artifacts of the knowledge synthesis, available as a Zenodo dataset. This review sets a precedent for structured, semantic-based approaches to managing aerospace engineering knowledge. By advancing these principles, research, and industry can achieve more efficient design processes, enhanced collaboration, and a stronger commitment to sustainable aviation.",
    "authors": [
      "Tim Wittenborg",
      "Ildar Baimuratov",
      "Ludvig Knöös Franzén",
      "Ingo Staack",
      "Ulrich Römer",
      "Sören Auer"
    ],
    "publication_date": "2025-05-15T10:16:45Z",
    "arxiv_id": "http://arxiv.org/abs/2505.10142v1",
    "download_url": "https://arxiv.org/abs/2505.10142v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Cloud-Based Engineering of Dependable Systems",
    "abstract": "The cloud computing paradigm is being adopted by many organizations in different application domains as it is cost effective and offers a virtually unlimited pool of resources. Engineering critical systems can benefit from clouds in attaining all dependability means: fault tolerance, fault prevention, fault removal and fault forecasting. Our research aims to investigate the potential of supporting engineering of dependable software systems with cloud computing and proposes an open, extensible, and elastic cloud-based software engineering workflow system which represents and executes software processes to improve collaboration, reliability and quality assurance, and automation in software projects.",
    "authors": [
      "Sami Alajrami"
    ],
    "publication_date": "2014-04-29T20:01:55Z",
    "arxiv_id": "http://arxiv.org/abs/1404.7509v1",
    "download_url": "https://arxiv.org/abs/1404.7509v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Where do we stand in requirements engineering improvement today? First results from a mapping study",
    "abstract": "Context: Requirements engineering process improvement (REPI) approaches have gained much attention in research and practice. Goal: So far, there is no comprehensive view on the research in REPI in terms of solutions and current state of reported evidence. We aims to provide an overview on the existing solutions, their underlying principles and their research type facets, i.e. their state of empirical evidence. Method: To this end, we conducted a systematic mapping study of the REPI publication space. Results: This paper reports on the first findings regarding research type facets of the contributions as well as selected methodological principles. We found a strong focus in the existing research on solution proposals for REPI approaches that concentrate on normative assessments and benchmarks of the RE activities rather than on holistic RE improvements according to individual goals of companies. Conclusions: We conclude, so far, that there is a need to broaden the work and to investigate more problem-driven REPI which also targets the improvement of the quality of the underlying RE artefacts, which currently seem out of scope.",
    "authors": [
      "Daniel Méndez Fernández",
      "Saahil Ognawala",
      "Stefan Wagner",
      "Maya Daneva"
    ],
    "publication_date": "2017-01-19T16:16:03Z",
    "arxiv_id": "http://arxiv.org/abs/1701.05497v1",
    "download_url": "https://arxiv.org/abs/1701.05497v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Framework for continuous transition to Agile Systems Engineering in the Automotive Industry",
    "abstract": "The increasing pressure within VUCA (volatility, uncertainty, complexity and ambiguity) driven environments causes traditional, plan-driven Systems Engineering approaches to no longer suffice. Agility is then changing from a \"nice-to-have\" to a \"must-have\" capability for successful system developing organisations. The current state of the art, however, does not provide clear answers on how to map this need in terms of processes, methods, tools and competencies (PMTC) and how to successfully manage the transition within established industries. In this paper, we propose an agile Systems Engineering (SE) Framework for the automotive industry to meet the new agility demand. In addition to the methodological background, we present results of a pilot project in the chassis development department of a German automotive manufacturer and demonstrate the effectiveness of the newly proposed framework. By adopting the described agile SE Framework, companies can foster innovation and collaboration based on a learning, continuous improvement and self-reinforcing base.",
    "authors": [
      "Jan Heine",
      "Herbert Palm"
    ],
    "publication_date": "2023-11-21T10:21:47Z",
    "arxiv_id": "http://arxiv.org/abs/2311.12502v1",
    "download_url": "https://arxiv.org/abs/2311.12502v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ten Simple Rules for Catalyzing Collaborations and Building Bridges between Research Software Engineers and Software Engineering Researchers",
    "abstract": "In the evolving landscape of scientific and scholarly research, effective collaboration between Research Software Engineers (RSEs) and Software Engineering Researchers (SERs) is pivotal for advancing innovation and ensuring the integrity of computational methodologies. This paper presents ten strategic guidelines aimed at fostering productive partnerships between these two distinct yet complementary communities. The guidelines emphasize the importance of recognizing and respecting the cultural and operational differences between RSEs and SERs, proactively initiating and nurturing collaborations, and engaging within each other's professional environments. They advocate for identifying shared challenges, maintaining openness to emerging problems, ensuring mutual benefits, and serving as advocates for one another. Additionally, the guidelines highlight the necessity of vigilance in monitoring collaboration dynamics, securing institutional support, and defining clear, shared objectives. By adhering to these principles, RSEs and SERs can build synergistic relationships that enhance the quality and impact of research outcomes.",
    "authors": [
      "Nasir U. Eisty",
      "Jeffrey C. Carver",
      "Johanna Cohoon",
      "Ian A. Cosden",
      "Carole Goble",
      "Samuel Grayson"
    ],
    "publication_date": "2025-06-03T15:51:17Z",
    "arxiv_id": "http://arxiv.org/abs/2506.03012v1",
    "download_url": "https://arxiv.org/abs/2506.03012v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Requirements Engineering for Research Software: A Vision",
    "abstract": "Modern science is relying on software more than ever. The behavior and outcomes of this software shape the scientific and public discourse on important topics like climate change, economic growth, or the spread of infections. Most researchers creating software for scientific purposes are not trained in Software Engineering. As a consequence, research software is often developed ad hoc without following stringent processes. With this paper, we want to characterize research software as a new application domain that needs attention from the Requirements Engineering community. We conducted an exploratory study based on 8 interviews with 12 researchers who develop software. We describe how researchers elicit, document, and analyze requirements for research software and what processes they follow. From this, we derive specific challenges and describe a vision of Requirements Engineering for research software.",
    "authors": [
      "Adrian Bajraktari",
      "Michelle Binder",
      "Andreas Vogelsang"
    ],
    "publication_date": "2024-05-13T14:25:01Z",
    "arxiv_id": "http://arxiv.org/abs/2405.07781v2",
    "download_url": "https://arxiv.org/abs/2405.07781v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reflections on Cyberethics Education for Millennial Software Engineers",
    "abstract": "Software is a key component of solutions for 21st Century problems. These problems are often \"wicked\", complex, and unpredictable. To provide the best possible solution, millennial software engineers must be prepared to make ethical decisions, thinking critically, and acting systematically. This reality demands continuous changes in educational systems and curricula delivery, as misjudgment might have serious social impact. This study aims to investigate and reflect on Software Engineering (SE) Programs, proposing a conceptual framework for analyzing cyberethics education and a set of suggestions on how to integrate it into the SE undergraduate curriculum.",
    "authors": [
      "Claudia de O. Melo",
      "Thiago C. de Sousa"
    ],
    "publication_date": "2017-03-02T05:00:50Z",
    "arxiv_id": "http://arxiv.org/abs/1703.00619v1",
    "download_url": "https://arxiv.org/abs/1703.00619v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Work in Progress: AI-Powered Engineering-Bridging Theory and Practice",
    "abstract": "This paper explores how generative AI can help automate and improve key steps in systems engineering. It examines AI's ability to analyze system requirements based on INCOSE's \"good requirement\" criteria, identifying well-formed and poorly written requirements. The AI does not just classify requirements but also explains why some do not meet the standards. By comparing AI assessments with those of experienced engineers, the study evaluates the accuracy and reliability of AI in identifying quality issues. Additionally, it explores AI's ability to classify functional and non-functional requirements and generate test specifications based on these classifications. Through both quantitative and qualitative analysis, the research aims to assess AI's potential to streamline engineering processes and improve learning outcomes. It also highlights the challenges and limitations of AI, ensuring its safe and ethical use in professional and academic settings.",
    "authors": [
      "Oz Levy",
      "Ilya Dikman",
      "Natan Levy",
      "Michael Winokur"
    ],
    "publication_date": "2025-02-06T17:42:00Z",
    "arxiv_id": "http://arxiv.org/abs/2502.04256v1",
    "download_url": "https://arxiv.org/abs/2502.04256v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Survey Research in Software Engineering: Problems and Strategies",
    "abstract": "Background: The need for empirical investigations in software engineering is growing. Many researchers nowadays, conduct and validate their solutions using empirical research. Survey is one empirical method which enables researchers to collect data from a large population. Main aim of the survey is to generalize the findings. Aims: In this study we aim to identify the problems researchers face during survey design, and mitigation strategies. Method: A literature review as well as semi-structured interviews with nine software engineering researchers were conducted to elicit their views on problems and mitigation strategies. The researchers are all focused on empirical software engineering. Results: We identified 24 problems and 65 strategies, structured according to the survey research process. The most commonly discussed problem was sampling, in particular the ability to obtain a sufficiently large sample. To improve survey instrument design, evaluation and execution recommendations for question formulation and survey pre-testing were given. The importance of involving multiple researchers in the analysis of survey results was stressed. Conclusions: The elicited problems and strategies may serve researchers during the design of their studies. However, it was observed that some strategies were conflicting. This shows that it is important to conduct a trade-off analysis between strategies.",
    "authors": [
      "Ahmad Nauman Ghazi",
      "Kai Petersen",
      "Sri Sai Vijay Raj Reddy",
      "Harini Nekkanti"
    ],
    "publication_date": "2017-04-04T16:23:35Z",
    "arxiv_id": "http://arxiv.org/abs/1704.01090v1",
    "download_url": "https://arxiv.org/abs/1704.01090v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extending Behavioral Software Engineering: Decision-Making and Collaboration in Human-AI Teams for Responsible Software Engineering",
    "abstract": "The study of behavioral and social dimensions of software engineering (SE) tasks characterizes behavioral software engineering (BSE);however, the increasing significance of human-AI collaboration (HAIC) brings new directions in BSE by presenting new challenges and opportunities. This PhD research focuses on decision-making (DM) for SE tasks and collaboration within human-AI teams, aiming to promote responsible software engineering through a cognitive partnership between humans and AI. The goal of the research is to identify the challenges and nuances in HAIC from a cognitive perspective, design and optimize collaboration/partnership (human-AI team) that enhance collective intelligence and promote better, responsible DM in SE through human-centered approaches. The research addresses HAIC and its impact on individual, team, and organizational level aspects of BSE.",
    "authors": [
      "Lekshmi Murali Rani"
    ],
    "publication_date": "2025-04-13T09:40:25Z",
    "arxiv_id": "http://arxiv.org/abs/2504.09496v2",
    "download_url": "https://arxiv.org/abs/2504.09496v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Approach for System Analysis with MBSE and Graph Data Engineering",
    "abstract": "Model-Based Systems Engineering aims at creating a model of a system under development, covering the complete system with a level of detail that allows to define and understand its behavior and enables to define any interface and workpackage based on the model. Once such a model is established, further benefits can be reaped, such as the analysis of complex technical correlations within the system. Various insights can be gained by displaying the model as a formal graph and querying it. To enable such queries, a graph schema needs to be designed, which allows to transfer the model into a graph database. In the course of this paper, we discuss the design of a graph schema and MBSE modelling approach, enabling deep going system analysis and anomaly resolution in complex embedded systems. The schema and modelling approach are designed to answer questions such as what happens if there is an electrical short in a component? Which other components are now offline and which data cannot be gathered anymore? Or if a condition cannot be met, which alternative routes can be established to reach a certain state of the system. We build on the use case of qualification and operations of a small spacecraft. Structural and behavioral elements of the MBSE model are transferred to a graph database where analyses are conducted on the system. The schema is implemented by an adapter for MagicDraw to Neo4j. A selection of complex analyses are shown on the example of the MOVE-II space mission.",
    "authors": [
      "Florian Schummer",
      "Maximilian Hyba"
    ],
    "publication_date": "2022-01-17T11:50:20Z",
    "arxiv_id": "http://arxiv.org/abs/2201.06363v1",
    "download_url": "https://arxiv.org/abs/2201.06363v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sampling in Software Engineering Research: A Critical Review and Guidelines",
    "abstract": "Representative sampling appears rare in empirical software engineering research. Not all studies need representative samples, but a general lack of representative sampling undermines a scientific field. This article therefore reports a critical review of the state of sampling in recent, high-quality software engineering research. The key findings are: (1) random sampling is rare; (2) sophisticated sampling strategies are very rare; (3) sampling, representativeness and randomness often appear misunderstood. These findings suggest that software engineering research has a generalizability crisis. To address these problems, this paper synthesizes existing knowledge of sampling into a succinct primer and proposes extensive guidelines for improving the conduct, presentation and evaluation of sampling in software engineering research. It is further recommended that while researchers should strive for more representative samples, disparaging non-probability sampling is generally capricious and particularly misguided for predominately qualitative research.",
    "authors": [
      "Sebastian Baltes",
      "Paul Ralph"
    ],
    "publication_date": "2020-02-18T17:53:55Z",
    "arxiv_id": "http://arxiv.org/abs/2002.07764v6",
    "download_url": "https://arxiv.org/abs/2002.07764v6",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Detecting Optimization Bugs in Database Engines via Non-Optimizing Reference Engine Construction",
    "abstract": "Database Management Systems (DBMS) are used ubiquitously. To efficiently access data, they apply sophisticated optimizations. Incorrect optimizations can result in logic bugs, which cause a query to compute an incorrect result set. We propose Non-Optimizing Reference Engine Construction (NoREC), a fully-automatic approach to detect optimization bugs in DBMS. Conceptually, this approach aims to evaluate a query by an optimizing and a non-optimizing version of a DBMS, to then detect differences in their returned result set, which would indicate a bug in the DBMS. Obtaining a non-optimizing version of a DBMS is challenging, because DBMS typically provide limited control over optimizations. Our core insight is that a given, potentially randomly-generated optimized query can be rewritten to one that the DBMS cannot optimize. Evaluating this unoptimized query effectively corresponds to a non-optimizing reference engine executing the original query. We evaluated NoREC in an extensive testing campaign on four widely-used DBMS, namely PostgreSQL, MariaDB, SQLite, and CockroachDB. We found 159 previously unknown bugs in the latest versions of these systems, 141 of which have been fixed by the developers. Of these, 51 were optimization bugs, while the remaining were error and crash bugs. Our results suggest that NoREC is effective, general and requires little implementation effort, which makes the technique widely applicable in practice.",
    "authors": [
      "Manuel Rigger",
      "Zhendong Su"
    ],
    "publication_date": "2020-07-16T12:30:21Z",
    "arxiv_id": "http://arxiv.org/abs/2007.08292v1",
    "download_url": "https://arxiv.org/abs/2007.08292v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Systematic Review of Common Beginner Programming Mistakes in Data Engineering",
    "abstract": "The design of effective programming languages, libraries, frameworks, tools, and platforms for data engineering strongly depends on their ease and correctness of use. Anyone who ignores that it is humans who use these tools risks building tools that are useless, or worse, harmful. To ensure our data engineering tools are based on solid foundations, we performed a systematic review of common programming mistakes in data engineering. We focus on programming beginners (students) by analyzing both the limited literature specific to data engineering mistakes and general programming mistakes in languages commonly used in data engineering (Python, SQL, Java). Through analysis of 21 publications spanning from 2003 to 2024, we synthesized these complementary sources into a comprehensive classification that captures both general programming challenges and domain-specific data engineering mistakes. This classification provides an empirical foundation for future tool development and educational strategies. We believe our systematic categorization will help researchers, practitioners, and educators better understand and address the challenges faced by novice data engineers.",
    "authors": [
      "Max Neuwinger",
      "Dirk Riehle"
    ],
    "publication_date": "2025-04-23T12:04:09Z",
    "arxiv_id": "http://arxiv.org/abs/2504.16644v1",
    "download_url": "https://arxiv.org/abs/2504.16644v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multilingual training for Software Engineering",
    "abstract": "Well-trained machine-learning models, which leverage large amounts of open-source software data, have now become an interesting approach to automating many software engineering tasks. Several SE tasks have all been subject to this approach, with performance gradually improving over the past several years with better models and training methods. More, and more diverse, clean, labeled data is better for training; but constructing good-quality datasets is time-consuming and challenging. Ways of augmenting the volume and diversity of clean, labeled data generally have wide applicability. For some languages (e.g., Ruby) labeled data is less abundant; in others (e.g., JavaScript) the available data maybe more focused on some application domains, and thus less diverse. As a way around such data bottlenecks, we present evidence suggesting that human-written code in different languages (which performs the same function), is rather similar, and particularly preserving of identifier naming patterns; we further present evidence suggesting that identifiers are a very important element of training data for software engineering tasks. We leverage this rather fortuitous phenomenon to find evidence that available multilingual training data (across different languages) can be used to amplify performance. We study this for 3 different tasks: code summarization, code retrieval, and function naming. We note that this data-augmenting approach is broadly compatible with different tasks, languages, and machine-learning models.",
    "authors": [
      "Toufique Ahmed",
      "Premkumar Devanbu"
    ],
    "publication_date": "2021-12-03T17:47:00Z",
    "arxiv_id": "http://arxiv.org/abs/2112.02043v4",
    "download_url": "https://arxiv.org/abs/2112.02043v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A comprehensive safety engineering approach for software-intensive systems based on STPA",
    "abstract": "Formal verification and testing are complementary approaches which are used in the development process to verify the functional correctness of software. However, the correctness of software cannot ensure the safe operation of safety-critical software systems. The software must be verified against its safety requirements which are identified by safety analysis, to ensure that potential hazardous causes cannot occur. The complexity of software makes defining appropriate software safety requirements with traditional safety analysis techniques difficult. STPA (Systems-Theoretic Processes Analysis) is a unique safety analysis approach that has been developed to identify system hazards, including the software-related hazards. This paper presents a comprehensive safety engineering approach based on STPA, including software testing and model checking approaches for the purpose of developing safe software. The proposed approach can be embedded within a defined software engineering process or applied to existing software systems, allow software and safety engineers integrate the analysis of software risks with their verification. The application of the proposed approach is illustrated with an automotive software controller.",
    "authors": [
      "Asim Abdulkhaleq",
      "Stefan Wagner",
      "Nancy Leveson"
    ],
    "publication_date": "2016-12-09T17:59:02Z",
    "arxiv_id": "http://arxiv.org/abs/1612.03109v1",
    "download_url": "https://arxiv.org/abs/1612.03109v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ethical Interviews in Software Engineering",
    "abstract": "Background: Despite a long history, numerous laws and regulations, ethics remains an unnatural topic for many software engineering researchers. Poor research ethics may lead to mistrust of research results, lost funding and retraction of publications. A core principle for research ethics is confidentiality, and anonymization is a standard approach to guarantee it. Many guidelines for qualitative software engineering research, and for qualitative research in general, exist, but these do not penetrate how and why to anonymize interview data. Aims: In this paper we aim to identify ethical guidelines for software engineering interview studies involving industrial practitioners. Method: By learning from previous experiences and listening to the authority of existing guidelines in the more mature field of medicine as well as in software engineering, a comprehensive set of checklists for interview studies was distilled. Results: The elements of an interview study were identified and ethical considerations and recommendations for each step were produced, in particular with respect to anonymization. Important ethical principles are: consent, beneficence, confidentiality, scientific value, researcher skill, justice, respect for law, and ethical reviews. Conclusions: The most important contribution of this study is the set of checklists for ethical interview studies. Future work is needed to refine these guidelines with respect to legal aspects and ethical boards.",
    "authors": [
      "Per Erik Strandberg"
    ],
    "publication_date": "2019-06-19T09:32:36Z",
    "arxiv_id": "http://arxiv.org/abs/1906.07993v1",
    "download_url": "https://arxiv.org/abs/1906.07993v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysis of Software Engineering Practices in General Software and Machine Learning Startups",
    "abstract": "Context: On top of the inherent challenges startup software companies face applying proper software engineering practices, the non-deterministic nature of machine learning techniques makes it even more difficult for machine learning (ML) startups.\n  Objective: Therefore, the objective of our study is to understand the whole picture of software engineering practices followed by ML startups and identify additional needs.\n  Method: To achieve our goal, we conducted a systematic literature review study on 37 papers published in the last 21 years. We selected papers on both general software startups and ML startups. We collected data to understand software engineering (SE) practices in five phases of the software development life-cycle: requirement engineering, design, development, quality assurance, and deployment.\n  Results: We find some interesting differences in software engineering practices in ML startups and general software startups. The data management and model learning phases are the most prominent among them.\n  Conclusion: While ML startups face many similar challenges to general software startups, the additional difficulties of using stochastic ML models require different strategies in using software engineering practices to produce high-quality products.",
    "authors": [
      "Bishal Lakha",
      "Kalyan Bhetwal",
      "Nasir U. Eisty"
    ],
    "publication_date": "2023-04-04T04:21:09Z",
    "arxiv_id": "http://arxiv.org/abs/2304.01523v1",
    "download_url": "https://arxiv.org/abs/2304.01523v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Toward Reverse Engineering of VBA Based Excel Spreadsheet Applications",
    "abstract": "Modern spreadsheet systems can be used to implement complex spreadsheet applications including data sheets, customized user forms and executable procedures written in a scripting language. These applications are often developed by practitioners that do not follow any software engineering practice and do not produce any design documentation. Thus, spreadsheet applications may be very difficult to be maintained or restructured. In this position paper we present in a nutshell two reverse engineering techniques and a tool that we are currently realizing for the abstraction of conceptual data models and business logic models.",
    "authors": [
      "Domenico Amalfitano",
      "Nicola Amatucci",
      "Vincenzo De Simone",
      "Anna Rita Fasolino",
      "Porfirio Tramontana"
    ],
    "publication_date": "2015-03-11T16:17:53Z",
    "arxiv_id": "http://arxiv.org/abs/1503.03401v1",
    "download_url": "https://arxiv.org/abs/1503.03401v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "What's in a Software Engineering Job Posting?",
    "abstract": "A well-rounded software engineer is often defined by technical prowess and the ability to deliver on complex projects. However, the narrative around the ideal Software Engineering (SE) candidate is evolving, suggesting that there is more to the story. This article explores the non-technical aspects emphasized in SE job postings, revealing the sociotechnical and organizational expectations of employers. Our Thematic Analysis of 100 job postings shows that employers seek candidates who align with their sense of purpose, fit within company culture, pursue personal and career growth, and excel in interpersonal interactions. This study contributes to ongoing discussions in the SE community about the evolving role and workplace context of software engineers beyond technical skills. By highlighting these expectations, we provide relevant insights for researchers, educators, practitioners, and recruiters. Additionally, our analysis offers a valuable snapshot of SE job postings in 2023, providing a scientific record of prevailing trends and expectations.",
    "authors": [
      "Marvin Wyrich",
      "Lloyd Montgomery"
    ],
    "publication_date": "2025-11-17T18:14:15Z",
    "arxiv_id": "http://arxiv.org/abs/2511.13656v1",
    "download_url": "https://arxiv.org/abs/2511.13656v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Automated Compatibility Prediction Engine using DISC Theory Based Classification and Neural Networks",
    "abstract": "Traditionally psychometric tests were used for profiling incoming workers. These methods use DISC profiling method to classify people into distinct personality types, which are further used to predict if a person may be a possible fit to the organizational culture. This concept is taken further by introducing a novel technique to predict if a particular pair of an incoming worker and the manager being assigned are compatible at a psychological scale. This is done using multilayer perceptron neural network which can be adaptively trained to showcase the true nature of the compatibility index. The proposed prototype model is used to quantify the relevant attributes, use them to train the prediction engine, and to define the data pipeline required for it.",
    "authors": [
      "Chandrasekaran Anirudh Bhardwaj",
      "Megha Mishra",
      "Sweetlin Hemalatha"
    ],
    "publication_date": "2017-09-02T06:38:12Z",
    "arxiv_id": "http://arxiv.org/abs/1709.00539v1",
    "download_url": "https://arxiv.org/abs/1709.00539v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Open Science in Software Engineering",
    "abstract": "Open science describes the movement of making any research artefact available to the public and includes, but is not limited to, open access, open data, and open source. While open science is becoming generally accepted as a norm in other scientific disciplines, in software engineering, we are still struggling in adapting open science to the particularities of our discipline, rendering progress in our scientific community cumbersome. In this chapter, we reflect upon the essentials in open science for software engineering including what open science is, why we should engage in it, and how we should do it. We particularly draw from our experiences made as conference chairs implementing open science initiatives and as researchers actively engaging in open science to critically discuss challenges and pitfalls, and to address more advanced topics such as how and under which conditions to share preprints, what infrastructure and licence model to cover, or how do it within the limitations of different reviewing models, such as double-blind reviewing. Our hope is to help establishing a common ground and to contribute to make open science a norm also in software engineering.",
    "authors": [
      "Daniel Méndez Fernández",
      "Daniel Graziotin",
      "Stefan Wagner",
      "Heidi Seibold"
    ],
    "publication_date": "2019-04-13T07:38:41Z",
    "arxiv_id": "http://arxiv.org/abs/1904.06499v3",
    "download_url": "https://arxiv.org/abs/1904.06499v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding and Improving Artifact Sharing in Software Engineering Research",
    "abstract": "In recent years, many software engineering researchers have begun to include artifacts alongside their research papers. Ideally, artifacts, including tools, benchmarks, and data, support the dissemination of ideas, provide evidence for research claims, and serve as a starting point for future research. However, in practice, artifacts suffer from a variety of issues that prevent the realization of their full potential.\n  To help the software engineering community realize the full potential of artifacts, we seek to understand the challenges involved in the creation, sharing, and use of artifacts. To that end, we perform a mixed-methods study including a survey of artifacts in software engineering publications, and an online survey of 153 software engineering researchers. By analyzing the perspectives of artifact creators, users, and reviewers, we identify several high-level challenges that affect the quality of artifacts including mismatched expectations between these groups, and a lack of sufficient reward for both creators and reviewers. Using Diffusion of Innovations as an analytical framework, we examine how these challenges relate to one another, and build an understanding of the factors that affect the sharing and success of artifacts. Finally, we make recommendations to improve the quality of artifacts based on our results and existing best practices.",
    "authors": [
      "Christopher S. Timperley",
      "Lauren Herckis",
      "Claire Le Goues",
      "Michael Hilton"
    ],
    "publication_date": "2020-08-03T17:33:28Z",
    "arxiv_id": "http://arxiv.org/abs/2008.01046v2",
    "download_url": "https://arxiv.org/abs/2008.01046v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Road-Map for Transferring Software Engineering methods for Model-Based Early V&V of Behaviour to Systems Engineering",
    "abstract": "In this paper we discuss the growing need for system behaviour to be validated and verified (V&V'ed) early in model-based systems engineering. Several aspects push companies towards integration of techniques, methods, and processes that promote specific and general V&V activities earlier to support more effective decision-making. As a result, there are incentives to introduce new technologies to remain competitive with the recently drastic changes in system complexity and heterogeneity. Performing V&V early on in development is a means of reducing risk for later error detection while moving key activities earlier in a process. We present a summary of the literature on early V&V and position existing challenges regarding potential solutions and future investigations. In particular, we reason that the software engineering community can act as a source for inspiration as many emerging technologies in the software domain are showing promise in the wider systems domain, and there already exist well formed methods for early V&V of software behaviour in the software modelling community. We conclude the paper with a road-map for future research and development for both researchers and practitioners to further develop the concepts discussed in the paper.",
    "authors": [
      "Johan Cederbladh",
      "Antonio Cicchetti"
    ],
    "publication_date": "2024-06-06T13:04:23Z",
    "arxiv_id": "http://arxiv.org/abs/2406.04037v1",
    "download_url": "https://arxiv.org/abs/2406.04037v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Diversity of Gamification Evaluation in the Software Engineering Education and Industry: Trends, Comparisons and Gaps",
    "abstract": "Gamification has been used to motivate and engage participants in software engineering education and practice activities. There is a significant demand for empirical studies for the understanding of the impacts and efficacy of gamification. However, the lack of standard procedures and models for the evaluation of gamification is a challenge for the design, comparison, and report of results related to the assessment of gamification approaches and its effects. The goal of this study is to identify models and strategies for the evaluation of gamification reported in the literature. To achieve this goal, we conducted a systematic mapping study to investigate strategies for the evaluation of gamification in the context of software engineering. We selected 100 primary studies on gamification in software engineering (from 2011 to 2020). We categorized the studies regarding the presence of evaluation procedures or models for the evaluation of gamification, the purpose of the evaluation, the criteria used, the type of data, instruments, and procedures for data analysis. Our results show that 64 studies report procedures for the evaluation of gamification. However, only three studies actually propose evaluation models for gamification. We observed that the evaluation of gamification focuses on two aspects: the evaluation of the gamification strategy itself, related to the user experience and perceptions; and the evaluation of the outcomes and effects of gamification on its users and context. The most recurring criteria for the evaluation are 'engagement', 'motivation', 'satisfaction', and 'performance'. Finally, the evaluation of gamification requires a mix of subjective and objective inputs, and qualitative and quantitative data analysis approaches. Depending of the focus of the evaluation (the strategy or the outcomes), there is a predominance of a type of data and analysis.",
    "authors": [
      "Rodrigo Henrique Barbosa Monteiro",
      "Maurício Ronny de Almeida Souza",
      "Sandro Ronaldo Bezerra Oliveira",
      "Carlos dos Santos Portela",
      "Cesar Elias de Cristo Lobato"
    ],
    "publication_date": "2021-02-09T19:39:07Z",
    "arxiv_id": "http://arxiv.org/abs/2102.05089v1",
    "download_url": "https://arxiv.org/abs/2102.05089v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Developing an Artifact-based Approach to Regulatory Requirements Engineering",
    "abstract": "Context: Regulatory acts are a challenging source when eliciting, interpreting, and analyzing requirements. Requirements engineers often need to involve legal experts who, however, may often not be available. This raises the need for approaches to regulatory Requirements Engineering (RE) covering and integrating both legal and engineering perspectives.\n  Problem: Regulatory RE approaches need to capture and reflect both the elementary concepts and relationships from a legal perspective and their seamless transition to concepts used to specify software requirements. No existing approach considers explicating and managing legal domain knowledge and engineering-legal coordination.\n  Method: We conducted focus group sessions with legal researchers to identify the core challenges to establishing a regulatory RE approach. Based on our findings, we developed a candidate solution and conducted a first conceptual validation to assess its feasibility.\n  Results: We introduce the first version of our Artifact Model for Regulatory Requirements Engineering (AM4RRE) and its conceptual foundation. It provides a blueprint for applying legal (modelling) concepts and well-established RE concepts. Our initial results suggest that artifact-centric RE can be applied to managing legal domain knowledge and engineering-legal coordination.\n  Conclusions: The focus groups that served as a basis for building our model and the results from the expert validation both strengthen our confidence that we already provide a valuable basis for systematically integrating legal concepts into RE. This overcomes contemporary challenges to regulatory RE and serves as a basis for exposure to critical discussions in the community before continuing with the development of tool-supported extensions and large-scale empirical evaluations in practice.",
    "authors": [
      "Oleksandr Kosenkov",
      "Michael Unterkalmsteiner",
      "Jannik Fischbach",
      "Daniel Mendez",
      "Davide Fucci",
      "Tony Gorschek"
    ],
    "publication_date": "2024-05-01T09:51:56Z",
    "arxiv_id": "http://arxiv.org/abs/2405.00415v1",
    "download_url": "https://arxiv.org/abs/2405.00415v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Requirements Engineering Challenges in Building AI-Based Complex Systems",
    "abstract": "This paper identifies and tackles the challenges of the requirements engineering discipline when applied to development of AI-based complex systems. Due to their complex behaviour, there is an immanent need for a tailored development process for such systems. However, there is still no widely used and specifically tailored process in place to effectively and efficiently deal with requirements suitable for specifying a software solution that uses machine learning. By analysing the related work from software engineering and artificial intelligence fields, potential contributions have been recognized from agent-based software engineering and goal-oriented requirements engineering research, as well as examples from large product development companies. The challenges have been discussed, with proposals given how and when to tackle them. RE4AI taxonomy has also been outlined, to inform the tailoring of development process.",
    "authors": [
      "Hrvoje Belani",
      "Marin Vuković",
      "Željka Car"
    ],
    "publication_date": "2019-08-30T15:30:28Z",
    "arxiv_id": "http://arxiv.org/abs/1908.11791v1",
    "download_url": "https://arxiv.org/abs/1908.11791v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Pragmatic Design of Literature Studies in Software Engineering: An Experience-based Guideline",
    "abstract": "Systematic literature studies have received much attention in empirical software engineering in recent years. They have become a powerful tool to collect and structure reported knowledge in a systematic and reproducible way. We distinguish systematic literature reviews to systematically analyze reported evidence in depth, and systematic mapping studies to structure a field of interest in a broader, usually quantified manner. Due to the rapidly increasing body of knowledge in software engineering, researchers who want to capture the published work in a domain often face an extensive amount of publications, which need to be screened, rated for relevance, classified, and eventually analyzed. Although there are several guidelines to conduct literature studies, they do not yet help researchers coping with the specific difficulties encountered in the practical application of these guidelines. In this article, we present an experience-based guideline to aid researchers in designing systematic literature studies with special emphasis on the data collection and selection procedures. Our guideline aims at providing a blueprint for a practical and pragmatic path through the plethora of currently available practices and deliverables capturing the dependencies among the single steps. The guideline emerges from various mapping studies and literature reviews conducted by the authors and provides recommendations for the general study design, data collection, and study selection procedures. Finally, we share our experiences and lessons learned in applying the different practices of the proposed guideline.",
    "authors": [
      "M. Kuhrmann",
      "D. Méndez Fernández",
      "M. Daneva"
    ],
    "publication_date": "2016-12-12T09:33:04Z",
    "arxiv_id": "http://arxiv.org/abs/1612.03583v1",
    "download_url": "https://arxiv.org/abs/1612.03583v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reflecting on the Use of the Policy-Process-Product Theory in Empirical Software Engineering",
    "abstract": "The primary theory of software engineering is that an organization's Policies and Processes influence the quality of its Products. We call this the PPP Theory. Although empirical software engineering research has grown common, it is unclear whether researchers are trying to evaluate the PPP Theory. To assess this, we analyzed half (33) of the empirical works published over the last two years in three prominent software engineering conferences. In this sample, 70% focus on policies/processes or products, not both. Only 33% provided measurements relating policy/process and products. We make four recommendations: (1) Use PPP Theory in study design; (2) Study feedback relationships; (3) Diversify the studied feedforward relationships; and (4) Disentangle policy and process. Let us remember that research results are in the context of, and with respect to, the relationship between software products, processes, and policies.",
    "authors": [
      "Kelechi G. Kalu",
      "Taylor R. Schorlemmer",
      "Sophie Chen",
      "Kyle Robinson",
      "Erik Kocinare",
      "James C. Davis"
    ],
    "publication_date": "2023-08-23T19:01:13Z",
    "arxiv_id": "http://arxiv.org/abs/2308.12387v1",
    "download_url": "https://arxiv.org/abs/2308.12387v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Storytelling in human--centric software engineering research",
    "abstract": "BACKGROUND: Software engineering is a human activity. People naturally make sense of their activities and experience through storytelling. But storytelling does not appear to have been properly studied by software engineering research. AIM: We explore the question: what contribution can storytelling make to human--centric software engineering research? METHOD: We define concepts, identify types of story and their purposes, outcomes and effects, briefly review prior literature, identify several contributions and propose next steps. RESULTS: Storytelling can, amongst other contributions, contribute to data collection, data analyses, ways of knowing, research outputs, interventions in practice, and advocacy, and can integrate with evidence and arguments. Like all methods, storytelling brings risks. These risks can be managed. CONCLUSION: Storytelling provides a potential counter--balance to abstraction, and an approach to retain and honour human meaning in software engineering.",
    "authors": [
      "Austen Rainer"
    ],
    "publication_date": "2021-04-29T12:31:40Z",
    "arxiv_id": "http://arxiv.org/abs/2104.14296v2",
    "download_url": "https://arxiv.org/abs/2104.14296v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Practices for Engineering Trustworthy Machine Learning Applications",
    "abstract": "Following the recent surge in adoption of machine learning (ML), the negative impact that improper use of ML can have on users and society is now also widely recognised. To address this issue, policy makers and other stakeholders, such as the European Commission or NIST, have proposed high-level guidelines aiming to promote trustworthy ML (i.e., lawful, ethical and robust). However, these guidelines do not specify actions to be taken by those involved in building ML systems. In this paper, we argue that guidelines related to the development of trustworthy ML can be translated to operational practices, and should become part of the ML development life cycle. Towards this goal, we ran a multi-vocal literature review, and mined operational practices from white and grey literature. Moreover, we launched a global survey to measure practice adoption and the effects of these practices. In total, we identified 14 new practices, and used them to complement an existing catalogue of ML engineering practices. Initial analysis of the survey results reveals that so far, practice adoption for trustworthy ML is relatively low. In particular, practices related to assuring security of ML components have very low adoption. Other practices enjoy slightly larger adoption, such as providing explanations to users. Our extended practice catalogue can be used by ML development teams to bridge the gap between high-level guidelines and actual development of trustworthy ML systems; it is open for review and contribution",
    "authors": [
      "Alex Serban",
      "Koen van der Blom",
      "Holger Hoos",
      "Joost Visser"
    ],
    "publication_date": "2021-03-01T12:43:09Z",
    "arxiv_id": "http://arxiv.org/abs/2103.00964v1",
    "download_url": "https://arxiv.org/abs/2103.00964v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Needs and Challenges for a Platform to Support Large-scale Requirements Engineering. A Multiple Case Study",
    "abstract": "Background: Requirement engineering is often considered a critical activity in system development projects. The increasing complexity of software, as well as number and heterogeneity of stakeholders, motivate the development of methods and tools for improving large-scale requirement engineering. Aims: The empirical study presented in this paper aims to identify and understand the characteristics and challenges of a platform, as desired by experts, to support requirement engineering for individual stakeholders, based on the current pain-points of their organizations when dealing with a large number requirements. Method: We conducted a multiple case study with three companies in different domains. We collected data through ten semi-structured interviews with experts from these companies. Results: The main pain-point for stakeholders is handling the vast amount of data from different sources. The foreseen platform should leverage such data to manage changes in requirements according to customers' and users' preferences. It should also offer stakeholders an estimation of how long a requirements engineering task will take to complete, along with an easier requirements dependency identification and requirements reuse strategy. Conclusions: The findings provide empirical evidence about how practitioners wish to improve their requirement engineering processes and tools. The insights are a starting point for in-depth investigations into the problems and solutions presented. Practitioners can use the results to improve existing or design new practices and tools.",
    "authors": [
      "Davide Fucci",
      "Cristina Palomares",
      "Dolors Costal",
      "Xavier Franch",
      "Mikko Raatikainen",
      "Martin Stettinger",
      "Zijad Kurtanovic",
      "Tero Kojo",
      "Lars Koenig",
      "Andreas Falkner",
      "Gottfried Schenner",
      "Fabrizio Brasca",
      "Tomi Männistö",
      "Alexander Felfernig",
      "Walid Maalej"
    ],
    "publication_date": "2018-08-07T09:52:59Z",
    "arxiv_id": "http://arxiv.org/abs/1808.02284v2",
    "download_url": "https://arxiv.org/abs/1808.02284v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Do Research Software Engineers and Software Engineering Researchers Speak the Same Language?",
    "abstract": "Anecdotal evidence suggests that Research Software Engineers (RSEs) and Software Engineering Researchers (SERs) often use different terminologies for similar concepts, creating communication challenges. To better understand these divergences, we have started investigating how SE fundamentals from the SER community are interpreted within the RSE community, identifying aligned concepts, knowledge gaps, and areas for potential adaptation. Our preliminary findings reveal opportunities for mutual learning and collaboration, and our systematic methodology for terminology mapping provides a foundation for a crowd-sourced extension and validation in the future.",
    "authors": [
      "Timo Kehrer",
      "Robert Haines",
      "Guido Juckeland",
      "Shurui Zhou",
      "David E. Bernholdt"
    ],
    "publication_date": "2025-07-03T14:27:54Z",
    "arxiv_id": "http://arxiv.org/abs/2507.02665v1",
    "download_url": "https://arxiv.org/abs/2507.02665v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Potential of Citizen Platforms for Requirements Engineering of Large Socio-Technical Software Systems",
    "abstract": "Participatory citizen platforms are innovative solutions to digitally better engage citizens in policy-making and deliberative democracy in general. Although these platforms have been used also in an engineering context, thus far, there is no existing work for connecting the platforms to requirements engineering. The present paper fills this notable gap. In addition to discussing the platforms in conjunction with requirements engineering, the paper elaborates potential advantages and disadvantages, thus paving the way for a future pilot study in a software engineering context. With these engineering tenets, the paper also contributes to the research of large socio-technical software systems in a public sector context, including their implementation and governance.",
    "authors": [
      "Jukka Ruohonen",
      "Kalle Hjerppe"
    ],
    "publication_date": "2024-10-04T07:18:26Z",
    "arxiv_id": "http://arxiv.org/abs/2410.03195v2",
    "download_url": "https://arxiv.org/abs/2410.03195v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Research Software Science: Expanding the Impact of Research Software Engineering",
    "abstract": "Software plays a central role in scientific discovery. Improving how we develop and use software for research can have both broad and deep impacts on a spectrum of challenges and opportunities society faces today. The emergence of Research Software Engineer (RSE) as a role correlates with the growing complexity of scientific challenges and diversity of software team skills. In this paper, we describe research software science (RSS), an idea related to RSE, and particularly suited to research software teams. RSS promotes the use of scientific methodologies to explore and establish broadly applicable knowledge. Using RSS, we can pursue sustainable, repeatable, and reproducible software improvements that positively impact research software toward improved scientific discovery.",
    "authors": [
      "Michael A. Heroux"
    ],
    "publication_date": "2022-11-16T16:44:23Z",
    "arxiv_id": "http://arxiv.org/abs/2211.09034v1",
    "download_url": "https://arxiv.org/abs/2211.09034v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Understanding the Impact of Data Bugs on Deep Learning Models in Software Engineering",
    "abstract": "Deep learning (DL) techniques have achieved significant success in various software engineering tasks (e.g., code completion by Copilot). However, DL systems are prone to bugs from many sources, including training data. Existing literature suggests that bugs in training data are highly prevalent, but little research has focused on understanding their impacts on the models used in software engineering tasks. In this paper, we address this research gap through a comprehensive empirical investigation focused on three types of data prevalent in software engineering tasks: code-based, text-based, and metric-based. Using state-of-the-art baselines, we compare the models trained on clean datasets with those trained on datasets with quality issues and without proper preprocessing. By analysing the gradients, weights, and biases from neural networks under training, we identify the symptoms of data quality and preprocessing issues. Our analysis reveals that quality issues in code data cause biased learning and gradient instability, whereas problems in text data lead to overfitting and poor generalisation of models. On the other hand, quality issues in metric data result in exploding gradients and model overfitting, and inadequate preprocessing exacerbates these effects across all three data types. Finally, we demonstrate the validity and generalizability of our findings using six new datasets. Our research provides a better understanding of the impact and symptoms of data bugs in software engineering datasets. Practitioners and researchers can leverage these findings to develop better monitoring systems and data-cleaning methods to help detect and resolve data bugs in deep learning systems.",
    "authors": [
      "Mehil B Shah",
      "Mohammad Masudur Rahman",
      "Foutse Khomh"
    ],
    "publication_date": "2024-11-19T00:28:20Z",
    "arxiv_id": "http://arxiv.org/abs/2411.12137v3",
    "download_url": "https://arxiv.org/abs/2411.12137v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Teaching Empirical Research Methods in Software Engineering: An Editorial Introduction",
    "abstract": "Empirical Software Engineering has received much attention in recent years and became a de-facto standard for scientific practice in Software Engineering. However, while extensive guidelines are nowadays available for designing, conducting, reporting, and reviewing empirical studies, similar attention has not yet been paid to teaching empirical software engineering. Closing this gap is the scope of this edited book. In the following editorial introduction, we, the editors, set the foundation by laying out the larger context of the discipline for a positioning of the remainder of this book.",
    "authors": [
      "Daniel Mendez",
      "Paris Avgeriou",
      "Marcos Kalinowski",
      "Nauman bin Ali"
    ],
    "publication_date": "2025-01-13T10:42:43Z",
    "arxiv_id": "http://arxiv.org/abs/2501.07195v1",
    "download_url": "https://arxiv.org/abs/2501.07195v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "AI for Requirements Engineering: Industry adoption and Practitioner perspectives",
    "abstract": "The integration of AI for Requirements Engineering (RE) presents significant benefits but also poses real challenges. Although RE is fundamental to software engineering, limited research has examined AI adoption in RE. We surveyed 55 software practitioners to map AI usage across four RE phases: Elicitation, Analysis, Specification, and Validation, and four approaches for decision making: human-only decisions, AI validation, Human AI Collaboration (HAIC), and full AI automation. Participants also shared their perceptions, challenges, and opportunities when applying AI for RE tasks. Our data show that 58.2% of respondents already use AI in RE, and 69.1% view its impact as positive or very positive. HAIC dominates practice, accounting for 54.4% of all RE techniques, while full AI automation remains minimal at 5.4%. Passive AI validation (4.4 to 6.2%) lags even further behind, indicating that practitioners value AI's active support over passive oversight. These findings suggest that AI is most effective when positioned as a collaborative partner rather than a replacement for human expertise. It also highlights the need for RE-specific HAIC frameworks along with robust and responsible AI governance as AI adoption in RE grows.",
    "authors": [
      "Lekshmi Murali Rani",
      "Richard Berntsson Svensson",
      "Robert Feldt"
    ],
    "publication_date": "2025-11-03T08:15:44Z",
    "arxiv_id": "http://arxiv.org/abs/2511.01324v3",
    "download_url": "https://arxiv.org/abs/2511.01324v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stop Words for Processing Software Engineering Documents: Do they Matter?",
    "abstract": "Stop words, which are considered non-predictive, are often eliminated in natural language processing tasks. However, the definition of uninformative vocabulary is vague, so most algorithms use general knowledge-based stop lists to remove stop words. There is an ongoing debate among academics about the usefulness of stop word elimination, especially in domain-specific settings. In this work, we investigate the usefulness of stop word removal in a software engineering context. To do this, we replicate and experiment with three software engineering research tools from related work. Additionally, we construct a corpus of software engineering domain-related text from 10,000 Stack Overflow questions and identify 200 domain-specific stop words using traditional information-theoretic methods. Our results show that the use of domain-specific stop words significantly improved the performance of research tools compared to the use of a general stop list and that 17 out of 19 evaluation measures showed better performance.\n  Online appendix: https://zenodo.org/record/7865748",
    "authors": [
      "Yaohou Fan",
      "Chetan Arora",
      "Christoph Treude"
    ],
    "publication_date": "2023-03-18T15:39:23Z",
    "arxiv_id": "http://arxiv.org/abs/2303.10439v2",
    "download_url": "https://arxiv.org/abs/2303.10439v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding the Influence of Motivation on Requirements Engineering-related Activities",
    "abstract": "Context: Requirements Engineering (RE)-related activities are critical in developing quality software and one of the most human-dependent processes in software engineering (SE). Hence, identifying the impact of diverse human-related aspects on RE is crucial in the SE context. Objective: Our study explores the impact of one of the most influential human aspects, motivation on RE, aiming to deepen understanding and provide practical guidance. Method: By conducting semi-structured interviews with 21 RE-involved practitioners, we developed a theory using socio-technical grounded theory(STGT) that explains the contextual, causal, and intervening conditions influencing motivation in RE-related activities. Result: We identified strategies to enhance motivating situations or mitigate demotivating ones, and the consequences resulting from applying these strategies. Conclusion: Our findings offer actionable insights for software practitioners to manage the influence of motivation on RE and help researchers further investigate its role across various SE contexts in the future.",
    "authors": [
      "Dulaji Hidellaarachchi",
      "John Grundy",
      "Rashina Hoda",
      "Ingo Mueller"
    ],
    "publication_date": "2023-04-17T08:40:03Z",
    "arxiv_id": "http://arxiv.org/abs/2304.08074v3",
    "download_url": "https://arxiv.org/abs/2304.08074v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Case Survey Studies in Software Engineering Research",
    "abstract": "Background: Given the social aspects of Software Engineering (SE), in the last twenty years, researchers from the field started using research methods common in social sciences such as case study, ethnography, and grounded theory. More recently, case survey, another imported research method, has seen its increasing use in SE studies. It is based on existing case studies reported in the literature and intends to harness the generalizability of survey and the depth of case study. However, little is known on how case survey has been applied in SE research, let alone guidelines on how to employ it properly. Aims: This article aims to provide a better understanding of how case survey has been applied in Software Engineering research. Method: To address this knowledge gap, we performed a systematic mapping study and analyzed 12 Software Engineering studies that used the case survey method. Results: Our findings show that these studies presented a heterogeneous understanding of the approach ranging from secondary studies to primary inquiries focused on a large number of instances of a research phenomenon. They have not applied the case survey method consistently as defined in the seminal methodological papers. Conclusions: We conclude that a set of clearly defined guidelines are needed on how to use case survey in SE research, to ensure the quality of the studies employing this approach and to provide a set of clearly defined criteria to evaluate such work.",
    "authors": [
      "Jorge Melegati",
      "Xiaofeng Wang"
    ],
    "publication_date": "2020-07-27T14:18:59Z",
    "arxiv_id": "http://arxiv.org/abs/2007.13592v1",
    "download_url": "https://arxiv.org/abs/2007.13592v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Exploratory Study on the Engineering of Security Features",
    "abstract": "Software security is of utmost importance for most software systems. Developers must systematically select, plan, design, implement, and especially, maintain and evolve security features -- functionalities to mitigate attacks or protect personal data such as cryptography or access control -- to ensure the security of their software. Although security features are usually available in libraries, integrating security features requires writing and maintaining additional security-critical code. While there have been studies on the use of such libraries, surprisingly little is known about how developers engineer security features, how they select what security features to implement and which ones may require custom implementation, and the implications for maintenance. As a result, we currently rely on assumptions that are largely based on common sense or individual examples. However, to provide them with effective solutions, researchers need hard empirical data to understand what practitioners need and how they view security -- data that we currently lack. To fill this gap, we contribute an exploratory study with 26 knowledgeable industrial participants. We study how security features of software systems are selected and engineered in practice, what their code-level characteristics are, and what challenges practitioners face. Based on the empirical data gathered, we provide insights into engineering practices and validate four common assumptions.",
    "authors": [
      "Kevin Hermann",
      "Sven Peldszus",
      "Jan-Philipp Steghöfer",
      "Thorsten Berger"
    ],
    "publication_date": "2025-01-20T15:37:53Z",
    "arxiv_id": "http://arxiv.org/abs/2501.11546v2",
    "download_url": "https://arxiv.org/abs/2501.11546v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "GLUE: Generative Latent Unification of Expertise-Informed Engineering Models",
    "abstract": "Engineering complex systems (aircraft, buildings, vehicles) requires accounting for geometric and performance couplings across subsystems. As generative models proliferate for specialized domains (wings, structures, engines), a key research gap is how to coordinate frozen, pre-trained submodels to generate full-system designs that are feasible, diverse, and high-performing. We introduce Generative Latent Unification of Expertise-Informed Engineering Models (GLUE), which orchestrates pre-trained, frozen subsystem generators while enforcing system-level feasibility, optimality, and diversity. We propose and benchmark (i) data-driven GLUE models trained on pre-generated system-level designs and (ii) a data-free GLUE model trained online on a differentiable geometry layer. On a UAV design problem with five coupling constraints, we find that data-driven approaches yield diverse, high-performing designs but require large datasets to satisfy constraints reliably. The data-free approach is competitive with Bayesian optimization and gradient-based optimization in performance and feasibility while training a full generative model in only 10 min on a RTX 4090 GPU, requiring more than two orders of magnitude fewer geometry evaluations and FLOPs than the data-driven method. Ablations focused on data-free training show that subsystem output continuity affects coordination, and equality constraints can trigger mode collapse unless mitigated. By integrating unmodified, domain-informed submodels into a modular generative workflow, this work provides a viable path for scaling generative design to complex, real-world engineering systems.",
    "authors": [
      "Tim Aebersold",
      "Soheyl Massoudi",
      "Mark D. Fuge"
    ],
    "publication_date": "2025-12-22T15:23:19Z",
    "arxiv_id": "http://arxiv.org/abs/2512.19469v1",
    "download_url": "https://arxiv.org/abs/2512.19469v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Presence of Green and Sustainable Software Engineering in Higher Education Curricula",
    "abstract": "Nowadays, software is pervasive in our everyday lives. Its sustainability and environmental impact have become major factors to be considered in the development of software systems. Millennials-the newer generation of university students-are particularly keen to learn about and contribute to a more sustainable and green society. The need for training on green and sustainable topics in software engineering has been reflected in a number of recent studies. The goal of this paper is to get a first understanding of what is the current state of teaching sustainability in the software engineering community, what are the motivations behind the current state of teaching, and what can be done to improve it. To this end, we report the findings from a targeted survey of 33 academics on the presence of green and sustainable software engineering in higher education. The major findings from the collected data suggest that sustainability is under-represented in the curricula, while the current focus of teaching is on energy efficiency delivered through a fact-based approach. The reasons vary from lack of awareness, teaching material and suitable technologies, to the high effort required to teach sustainability. Finally, we provide recommendations for educators willing to teach sustainability in software engineering that can help to suit millennial students needs.",
    "authors": [
      "Damiano Torre",
      "Giuseppe Procaccianti",
      "Davide Fucci",
      "Sonja Lutovac",
      "Giuseppe Scanniello"
    ],
    "publication_date": "2017-03-03T08:39:48Z",
    "arxiv_id": "http://arxiv.org/abs/1703.01078v1",
    "download_url": "https://arxiv.org/abs/1703.01078v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Human Factors in Software Reliability Engineering",
    "abstract": "In this paper, we present our vision of the integration of human factors engineering into the software development process. The aim of this approach is to improve the quality of software and to deal with human errors in a systematic way.",
    "authors": [
      "Maria Spichkova",
      "Huai Liu",
      "Mohsen Laali",
      "Heinz W. Schmidt"
    ],
    "publication_date": "2015-03-12T04:40:08Z",
    "arxiv_id": "http://arxiv.org/abs/1503.03584v1",
    "download_url": "https://arxiv.org/abs/1503.03584v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering Challenges of Deep Learning",
    "abstract": "Surprisingly promising results have been achieved by deep learning (DL) systems in recent years. Many of these achievements have been reached in academic settings, or by large technology companies with highly skilled research groups and advanced supporting infrastructure. For companies without large research groups or advanced infrastructure, building high-quality production-ready systems with DL components has proven challenging. There is a clear lack of well-functioning tools and best practices for building DL systems. It is the goal of this research to identify what the main challenges are, by applying an interpretive research approach in close collaboration with companies of varying size and type.\n  A set of seven projects have been selected to describe the potential with this new technology and to identify associated main challenges. A set of 12 main challenges has been identified and categorized into the three areas of development, production, and organizational challenges. Furthermore, a mapping between the challenges and the projects is defined, together with selected motivating descriptions of how and why the challenges apply to specific projects.\n  Compared to other areas such as software engineering or database technologies, it is clear that DL is still rather immature and in need of further work to facilitate development of high-quality systems. The challenges identified in this paper can be used to guide future research by the software engineering and DL communities. Together, we could enable a large number of companies to start taking advantage of the high potential of the DL technology.",
    "authors": [
      "Anders Arpteg",
      "Björn Brinne",
      "Luka Crnkovic-Friis",
      "Jan Bosch"
    ],
    "publication_date": "2018-10-29T10:05:37Z",
    "arxiv_id": "http://arxiv.org/abs/1810.12034v1",
    "download_url": "https://arxiv.org/abs/1810.12034v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Assured LLM-Based Software Engineering",
    "abstract": "In this paper we address the following question: How can we use Large Language Models (LLMs) to improve code independently of a human, while ensuring that the improved code\n  - does not regress the properties of the original code?\n  - improves the original in a verifiable and measurable way?\n  To address this question, we advocate Assured LLM-Based Software Engineering; a generate-and-test approach, inspired by Genetic Improvement. Assured LLMSE applies a series of semantic filters that discard code that fails to meet these twin guarantees. This overcomes the potential problem of LLM's propensity to hallucinate. It allows us to generate code using LLMs, independently of any human. The human plays the role only of final code reviewer, as they would do with code generated by other human engineers.\n  This paper is an outline of the content of the keynote by Mark Harman at the International Workshop on Interpretability, Robustness, and Benchmarking in Neural Software Engineering, Monday 15th April 2024, Lisbon, Portugal.",
    "authors": [
      "Nadia Alshahwan",
      "Mark Harman",
      "Inna Harper",
      "Alexandru Marginean",
      "Shubho Sengupta",
      "Eddy Wang"
    ],
    "publication_date": "2024-02-06T20:38:46Z",
    "arxiv_id": "http://arxiv.org/abs/2402.04380v1",
    "download_url": "https://arxiv.org/abs/2402.04380v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Case Study on AI Engineering Practices: Developing an Autonomous Stock Trading System",
    "abstract": "Today, many systems use artificial intelligence (AI) to solve complex problems. While this often increases system effectiveness, developing a production-ready AI-based system is a difficult task. Thus, solid AI engineering practices are required to ensure the quality of the resulting system and to improve the development process. While several practices have already been proposed for the development of AI-based systems, detailed practical experiences of applying these practices are rare.\n  In this paper, we aim to address this gap by collecting such experiences during a case study, namely the development of an autonomous stock trading system that uses machine learning functionality to invest in stocks. We selected 10 AI engineering practices from the literature and systematically applied them during development, with the goal to collect evidence about their applicability and effectiveness. Using structured field notes, we documented our experiences. Furthermore, we also used field notes to document challenges that occurred during the development, and the solutions we applied to overcome them. Afterwards, we analyzed the collected field notes, and evaluated how each practice improved the development. Lastly, we compared our evidence with existing literature.\n  Most applied practices improved our system, albeit to varying extent, and we were able to overcome all major challenges. The qualitative results provide detailed accounts about 10 AI engineering practices, as well as challenges and solutions associated with such a project. Our experiences therefore enrich the emerging body of evidence in this field, which may be especially helpful for practitioner teams new to AI engineering.",
    "authors": [
      "Marcel Grote",
      "Justus Bogner"
    ],
    "publication_date": "2023-03-23T12:27:27Z",
    "arxiv_id": "http://arxiv.org/abs/2303.13216v1",
    "download_url": "https://arxiv.org/abs/2303.13216v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Beyond Self-Promotion: How Software Engineering Research Is Discussed on LinkedIn",
    "abstract": "LinkedIn is the largest professional network in the world. As such, it can serve to build bridges between practitioners, whose daily work is software engineering (SE), and researchers, who work to advance the field of software engineering. We know that such a metaphorical bridge exists: SE research findings are sometimes shared on LinkedIn and commented on by software practitioners. Yet, we do not know what state the bridge is in. Therefore, we quantitatively and qualitatively investigate how SE practitioners and researchers approach each other via public LinkedIn discussions and what both sides can contribute to effective science communication. We found that a considerable proportion of LinkedIn posts on SE research are written by people who are not the paper authors (39%). Further, 71% of all comments in our dataset are from people in the industry, but only every second post receives at least one comment at all. Based on our findings, we formulate concrete advice for researchers and practitioners to make sharing new research findings on LinkedIn more fruitful.",
    "authors": [
      "Marvin Wyrich",
      "Justus Bogner"
    ],
    "publication_date": "2024-01-04T13:38:51Z",
    "arxiv_id": "http://arxiv.org/abs/2401.02268v1",
    "download_url": "https://arxiv.org/abs/2401.02268v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Motivational models for validating agile requirements in Software Engineering subjects",
    "abstract": "This paper describes how motivational models can be used to cross check agile requirements artifacts to improve consistency and completeness of software requirements. Motivational models provide a high level understanding of the purposes of a software system. They complement personas and user stories which focus more on user needs rather than on system features. We present an exploratory case study sought to understand how software engineering students could use motivational models to create better requirements artifacts so they are understandable to non-technical users, easily understood by developers, and are consistent with each other. Nine consistency principles were created as an outcome of our study and are now successfully adopted by software engineering students at the University of Melbourne to ensure consistency between motivational models, personas, and user stories in requirements engineering.",
    "authors": [
      "Eduardo A. Oliveira",
      "Leon Sterling"
    ],
    "publication_date": "2023-06-12T02:51:32Z",
    "arxiv_id": "http://arxiv.org/abs/2306.06834v1",
    "download_url": "https://arxiv.org/abs/2306.06834v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "\"Sampling\"' as a Baseline Optimizer for Search-based Software Engineering",
    "abstract": "Increasingly, Software Engineering (SE) researchers use search-based optimization techniques to solve SE problems with multiple conflicting objectives. These techniques often apply CPU-intensive evolutionary algorithms to explore generations of mutations to a population of candidate solutions. An alternative approach, proposed in this paper, is to start with a very large population and sample down to just the better solutions. We call this method \"SWAY\", short for \"the sampling way\". Sway is very simple to implement and, in studies with various software engineering models, this sampling approach was found to be competitive with corresponding state-of-the-art evolutionary algorithms while requiring far less computation cost. Considering the simplicity and effectiveness of Sway, we, therefore, propose this approach as a baseline method for search-based software engineering models, especially for models that are very slow to execute.",
    "authors": [
      "Jianfeng Chen",
      "Vivek Nair",
      "Rahul Krishna",
      "Tim Menzies"
    ],
    "publication_date": "2016-08-26T22:10:01Z",
    "arxiv_id": "http://arxiv.org/abs/1608.07617v3",
    "download_url": "https://arxiv.org/abs/1608.07617v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineers vs. Machine Learning Algorithms: An Empirical Study Assessing Performance and Reuse Tasks",
    "abstract": "Several papers have recently contained reports on applying machine learning (ML) to the automation of software engineering (SE) tasks, such as project management, modeling and development. However, there appear to be no approaches comparing how software engineers fare against machine-learning algorithms as applied to specific software development tasks. Such a comparison is essential to gain insight into which tasks are better performed by humans and which by machine learning and how cooperative work or human-in-the-loop processes can be implemented more effectively. In this paper, we present an empirical study that compares how software engineers and machine-learning algorithms perform and reuse tasks. The empirical study involves the synthesis of the control structure of an autonomous streetlight application. Our approach consists of four steps. First, we solved the problem using machine learning to determine specific performance and reuse tasks. Second, we asked software engineers with different domain knowledge levels to provide a solution to the same tasks. Third, we compared how software engineers fare against machine-learning algorithms when accomplishing the performance and reuse tasks based on criteria such as energy consumption and safety. Finally, we analyzed the results to understand which tasks are better performed by either humans or algorithms so that they can work together more effectively. Such an understanding and the resulting human-in-the-loop approaches, which take into account the strengths and weaknesses of humans and machine-learning algorithms, are fundamental not only to provide a basis for cooperative work in support of software engineering, but also, in other areas.",
    "authors": [
      "Nathalia Nascimento",
      "Carlos Lucena",
      "Paulo Alencar",
      "Donald Cowan"
    ],
    "publication_date": "2018-02-04T09:38:48Z",
    "arxiv_id": "http://arxiv.org/abs/1802.01096v2",
    "download_url": "https://arxiv.org/abs/1802.01096v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Investigating the Role of LLMs Hyperparameter Tuning and Prompt Engineering to Support Domain Modeling",
    "abstract": "The introduction of large language models (LLMs) has enhanced automation in software engineering tasks, including in Model Driven Engineering (MDE). However, using general-purpose LLMs for domain modeling has its limitations. One approach is to adopt fine-tuned models, but this requires significant computational resources and can lead to issues like catastrophic forgetting.\n  This paper explores how hyperparameter tuning and prompt engineering can improve the accuracy of the Llama 3.1 model for generating domain models from textual descriptions. We use search-based methods to tune hyperparameters for a specific medical data model, resulting in a notable quality improvement over the baseline LLM. We then test the optimized hyperparameters across ten diverse application domains.\n  While the solutions were not universally applicable, we demonstrate that combining hyperparameter tuning with prompt engineering can enhance results across nearly all examined domain models.",
    "authors": [
      "Vladyslav Bulhakov",
      "Giordano d'Aloisio",
      "Claudio Di Sipio",
      "Antinisca Di Marco",
      "Davide Di Ruscio"
    ],
    "publication_date": "2025-07-19T19:49:58Z",
    "arxiv_id": "http://arxiv.org/abs/2507.14735v1",
    "download_url": "https://arxiv.org/abs/2507.14735v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tailoring Requirements Engineering for Responsible AI",
    "abstract": "Requirements Engineering (RE) is the discipline for identifying, analyzing, as well as ensuring the implementation and delivery of user, technical, and societal requirements. Recently reported issues concerning the acceptance of Artificial Intelligence (AI) solutions after deployment, e.g. in the medical, automotive, or scientific domains, stress the importance of RE for designing and delivering Responsible AI systems. In this paper, we argue that RE should not only be carefully conducted but also tailored for Responsible AI. We outline related challenges for research and practice.",
    "authors": [
      "Walid Maalej",
      "Yen Dieu Pham",
      "Larissa Chazette"
    ],
    "publication_date": "2023-02-21T16:48:59Z",
    "arxiv_id": "http://arxiv.org/abs/2302.10816v1",
    "download_url": "https://arxiv.org/abs/2302.10816v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Requirements engineering current practice and capability in small and medium software development enterprises in New Zealand",
    "abstract": "This paper presents research on current industry practices with respect to requirements engineering as implemented within software development companies in New Zealand. A survey instrument is designed and deployed. The results are analysed and compared against what is internationally considered \"best practice\" and previous New Zealand and Australian studies. An attempt is made to assess the requirements engineering capability of New Zealand companies using both formal and informal frameworks.",
    "authors": [
      "Alison Talbot",
      "Andy M. Connor"
    ],
    "publication_date": "2014-07-23T03:42:33Z",
    "arxiv_id": "http://arxiv.org/abs/1407.6102v1",
    "download_url": "https://arxiv.org/abs/1407.6102v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Second Round: Diverse Paths Towards Software Engineering",
    "abstract": "In the extant literature, there has been discussion on the drivers and motivations of minorities to enter the software industry. For example, universities have invested in more diverse imagery for years to attract a more diverse pool of students. However, in our research, we consider whether we understand why students choose their current major and how they did in the beginning decided to apply to study software engineering. We were also interested in learning if there could be some signs that would help us in marketing to get more women into tech. We approached the topic via an online survey (N = 78) sent to the university students of software engineering in Finland. Our results show that, on average, women apply later to software engineering studies than men, with statistically significant differences between genders. Additionally, we found that marketing actions have different impacts based on gender: personal guidance in live events or platforms is most influential for women, whereas teachers and social media have a more significant impact on men. The results also indicate two main paths into the field: the traditional linear educational pathway and the adult career change pathway, each significantly varying by gender",
    "authors": [
      "Sonja Hyrynsalmi",
      "Ella Peltonen",
      "Fanny Vainionpää",
      "Sami Hyrynsalmi"
    ],
    "publication_date": "2024-02-27T08:31:12Z",
    "arxiv_id": "http://arxiv.org/abs/2402.17306v1",
    "download_url": "https://arxiv.org/abs/2402.17306v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A German Gold-Standard Dataset for Sentiment Analysis in Software Engineering",
    "abstract": "Sentiment analysis is an essential technique for investigating the emotional climate within developer teams, contributing to both team productivity and project success. Existing sentiment analysis tools in software engineering primarily rely on English or non-German gold-standard datasets. To address this gap, our work introduces a German dataset of 5,949 unique developer statements, extracted from the German developer forum Android-Hilfe.de. Each statement was annotated with one of six basic emotions, based on the emotion model by Shaver et al., by four German-speaking computer science students. Evaluation of the annotation process showed high interrater agreement and reliability. These results indicate that the dataset is sufficiently valid and robust to support sentiment analysis in the German-speaking software engineering community. Evaluation with existing German sentiment analysis tools confirms the lack of domain-specific solutions for software engineering. We also discuss approaches to optimize annotation and present further use cases for the dataset.",
    "authors": [
      "Martin Obaidi",
      "Marc Herrmann",
      "Elisa Schmid",
      "Raymond Ochsner",
      "Kurt Schneider",
      "Jil Klünder"
    ],
    "publication_date": "2025-07-09T22:55:37Z",
    "arxiv_id": "http://arxiv.org/abs/2507.07325v1",
    "download_url": "https://arxiv.org/abs/2507.07325v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Designing a Syllabus for a Course on Empirical Software Engineering",
    "abstract": "Increasingly, courses on Empirical Software Engineering research methods are being offered in higher education institutes across the world, mostly at the M.Sc. and Ph.D. levels. While the need for such courses is evident and in line with modern software engineering curricula, educators designing and implementing such courses have so far been reinventing the wheel; every course is designed from scratch with little to no reuse of ideas or content across the community. Due to the nature of the topic, it is rather difficult to get it right the first time when defining the learning objectives, selecting the material, compiling a reader, and, more importantly, designing relevant and appropriate practical work. This leads to substantial effort (through numerous iterations) and poses risks to the course quality. This chapter attempts to support educators in the first and most crucial step in their course design: creating the syllabus. It does so by consolidating the collective experience of the authors as well as of members of the Empirical Software Engineering community; the latter was mined through two working sessions and an online survey. Specifically, it offers a list of the fundamental building blocks for a syllabus, namely course aims, course topics, and practical assignments. The course topics are also linked to the subsequent chapters of this book, so that readers can dig deeper into those chapters and get support on teaching specific research methods or cross-cutting topics. Finally, we guide educators on how to take these building blocks as a starting point and consider a number of relevant aspects to design a syllabus to meet the needs of their own program, students, and curriculum.",
    "authors": [
      "Paris Avgeriou",
      "Nauman bin Ali",
      "Marcos Kalinowski",
      "Daniel Mendez"
    ],
    "publication_date": "2025-03-14T10:58:29Z",
    "arxiv_id": "http://arxiv.org/abs/2503.11291v1",
    "download_url": "https://arxiv.org/abs/2503.11291v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]