[
  {
    "title": "Collaborative Verification-Driven Engineering of Hybrid Systems",
    "abstract": "Hybrid systems with both discrete and continuous dynamics are an important model for real-world cyber-physical systems. The key challenge is to ensure their correct functioning w.r.t. safety requirements. Promising techniques to ensure safety seem to be model-driven engineering to develop hybrid systems in a well-defined and traceable manner, and formal verification to prove their correctness. Their combination forms the vision of verification-driven engineering. Often, hybrid systems are rather complex in that they require expertise from many domains (e.g., robotics, control systems, computer science, software engineering, and mechanical engineering). Moreover, despite the remarkable progress in automating formal verification of hybrid systems, the construction of proofs of complex systems often requires nontrivial human guidance, since hybrid systems verification tools solve undecidable problems. It is, thus, not uncommon for development and verification teams to consist of many players with diverse expertise. This paper introduces a verification-driven engineering toolset that extends our previous work on hybrid and arithmetic verification with tools for (i) graphical (UML) and textual modeling of hybrid systems, (ii) exchanging and comparing models and proofs, and (iii) managing verification tasks. This toolset makes it easier to tackle large-scale verification tasks.",
    "authors": [
      "Stefan Mitsch",
      "Grant Olney Passmore",
      "Andre Platzer"
    ],
    "publication_date": "2014-03-24T19:09:47Z",
    "arxiv_id": "http://arxiv.org/abs/1403.6085v2",
    "download_url": "https://arxiv.org/abs/1403.6085v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Estimation of the surface mechanical properties of soft tissues mimicking phantoms using impact analyses: a comparative study",
    "abstract": "Background: Palpation is the most widely used approach to empirically assess the mechanical properties of superficial tissues. While elastography is used for volume measurements, it remains difficult to assess skin properties with non-invasive methods. This study aimed to compare the performances of an impact-based analysis method (IBAM) consisting in studying the dynamic response of a punch in contact with the tissue with other approaches available on the market.  Materials and Methods: IBAM consists in analyzing the time dependent force signal induced when a hammer instrumented with a force sensor impacts a cylindrical punch placed in contact with soft tissue. Sensitivities to stiffness changes and to spatial variations were compared between IBAM and four other mechanical surface characterization techniques: IndentoPro (macroindentation), Cutometer (suction), MyotonPro (damped oscillation) and Shore Durometer (durometry) using soft tissue phantoms based on polyurethane gel.  Results: For stiffness discrimination in homogeneous phantoms, IBAM was slightly better than IndentoPro and MyotonPro (by 20 % and 35 % respectively), and outperformed the Shore Durometer and Cutometer by a factor of 2 to 4. Furthermore, for stiffness and thickness variations in bilayer phantoms, the axial sensitivity of IBAM was between 2.5 and 4.5 times better than that of MyotonPro and IndentoPro. In addition, the Cutometer appeared to be severely limited by its measurement depth. Conclusion: IBAM seems to be a promising technique for characterizing the mechanical properties of soft tissue phantoms at relatively low depth after future ex vivo and in vivo validation studies with biological tissues (with both animal and in human experiments). This work could pave the way to the development of a decision support system in the field of dermatology and cosmetics.",
    "authors": [
      "Arthur Bouffandeau",
      "Sabine Bensamoun",
      "Robert Schleip",
      "Giuseppe Rosi",
      "Charles-Henri Flouzat-Lachaniette",
      "Jean-Paul Meningaud",
      "Guillaume Haiat"
    ],
    "publication_date": "2025-11-13T09:31:53Z",
    "arxiv_id": "http://arxiv.org/abs/2511.10123v1",
    "download_url": "https://arxiv.org/abs/2511.10123v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal Mechanism of Band-Gap Engineering in Transition-Metal Dichalcogenides",
    "abstract": "Two-dimensional (2D) van-der-Waals semiconductors have emerged as a class of materials with promising device characteristics owing to the intrinsic bandgap. For realistic applications, the ideal is to modify the bandgap in a controlled manner by a mechanism that can be generally applied to this class of materials. Here, we report the observation of a universally tunable bandgap in the family of bulk 2H transition metal dichalcogenides (TMDs) by in situ surface doping of Rb atoms. A series of angle-resolved photoemission spectra unexceptionally shows that the bandgap of TMDs at the zone corners is modulated in the range of 0.8 ~ 2.0 eV, which covers a wide spectral range from visible to near infrared, with a tendency from indirect to direct bandgap. A key clue to understand the mechanism of this bandgap engineering is provided by the spectroscopic signature of symmetry breaking and resultant spin splitting, which can be explained by the formation of 2D electric dipole layers within the surface bilayer of TMDs. Our results establish the surface Stark effect as a universal mechanism of bandgap engineering based on the strong 2D nature of van-der-Waals semiconductors.",
    "authors": [
      "Mingu Kang",
      "Beomyoung Kim",
      "Sae Hee Ryu",
      "Sung Won Jung",
      "Jimin Kim",
      "Luca Moreschini",
      "Chris Jozwiak",
      "Eli Rotenberg",
      "Aaron Bostwick",
      "Keun Su Kim"
    ],
    "publication_date": "2017-11-30T05:29:42Z",
    "arxiv_id": "http://arxiv.org/abs/1711.11236v1",
    "download_url": "https://arxiv.org/abs/1711.11236v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Token-FCM based risk assessment method for complex engineering designs",
    "abstract": "Engineering design risks could cause unaffordable losses, and thus risk assessment plays a critical role in engineering design. On the other hand, the high complexity of modern engineering designs makes it difficult to assess risks effectively and accurately due to the complex two-way, dynamic causal-effect risk relations in engineering designs. To address this problem, this paper proposes a new risk assessment method called token fuzzy cognitive map (Token-FCM). Its basic idea is to model the two-way causal-risk relations with the FCM method, and then augment FCM with a token mechanism to model the dynamics in causal-effect risk relations. Furthermore, the fuzzy sets and the group decision-making method are introduced to initialize the Token-FCM method so that comprehensive and accurate risk assessments can be attained. The effectiveness of the proposed method has been demonstrated by a real example of engine design for a horizontal directional drilling machine.",
    "authors": [
      "Guan Wang",
      "Yimin Feng",
      "Rongbin Guo",
      "Yusheng Liu",
      "Qiang Zou"
    ],
    "publication_date": "2025-01-26T05:22:45Z",
    "arxiv_id": "http://arxiv.org/abs/2501.15406v1",
    "download_url": "https://arxiv.org/abs/2501.15406v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical Control of Graphene on Engineered Pyramidal Strain Arrays",
    "abstract": "Strain can tune desirable electronic behavior in graphene, but there has been limited progress in controlling strain in graphene devices. In this paper, we study the mechanical response of graphene on substrates patterned with arrays of mesoscale pyramids. Using atomic force microscopy, we demonstrate that the morphology of graphene can be controlled from conformal to suspended depending on the arrangement of pyramids and the aspect ratio of the array. Non-uniform strains in graphene suspended across pyramids are revealed by Raman spectroscopy and supported by atomistic modeling, which also indicates strong pseudomagnetic fields in the graphene. Our results suggest that incorporating mesoscale pyramids in graphene devices is a viable route to achieving strain-engineering of graphene.",
    "authors": [
      "Stephen T. Gill",
      "John H. Hinnefeld",
      "Shuze Zhu",
      "William T. Swanson",
      "Teng Li",
      "Nadya Mason"
    ],
    "publication_date": "2015-07-06T19:34:04Z",
    "arxiv_id": "http://arxiv.org/abs/1507.01573v1",
    "download_url": "https://arxiv.org/abs/1507.01573v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Full-field in vivo experimental study of the strains of a breathing human abdominal wall with intra-abdominal pressure variation",
    "abstract": "The presented study aims to assess the mechanical behaviour of the anterior abdominal wall based on an in vivo experiment on humans. Full-field measurement of abdominal wall displacement during changes of intra-abdominal pressure is performed using a digital image correlation (DIC) system. Continuous measurement in time enables the observation of changes in the strain field during breathing. The understanding of the mechanical behaviour of a living human abdominal wall is important for the proper design of surgical meshes used for ventral hernia repair, which was also a motivation for the research presented below.\n  The research refers to the strain field of a loaded abdominal wall and presents the evolution of principal strains and their directions in the case of 12 subjects, 8 male and 4 female. Peritoneal dialysis procedure allows for the measurement of intra-abdominal pressure after fluid introduction.\n  High variability among patients is observed, also in terms of principal strain direction. Subjects exhibit intra-abdominal pressure of values from 11 to 21cmH2O. However, the strain values are not strongly correlated with the pressure value, indicated variability of material properties.",
    "authors": [
      "Katarzyna Szepietowska",
      "Mateusz Troka",
      "Monika Lichodziejewska-Niemierko",
      "Michał Chmielewski",
      "Izabela Lubowiecka"
    ],
    "publication_date": "2023-07-29T21:03:33Z",
    "arxiv_id": "http://arxiv.org/abs/2307.16077v2",
    "download_url": "https://arxiv.org/abs/2307.16077v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum heat engine in the optomechanical system with mechanical parametric drive",
    "abstract": "We consider a quantum Otto-type heat engine constructed in an optomechanical system with which the cavity is chosen as the working substance. The cavity can effectively be coupled with hot thermal baths in nonequilibrium steady-states via optomechanical interaction. The mechanical mode with parametric drive fuels the cavity, and the utilization efficiency of energy is discussed. To obtain higher efficiency in finite time evolution, we use the shortcuts-to-adiabaticity method in work generation processes. The modified thermal efficiencies are obtained by numerical simulation. Such a system provides potential applications in quantum heat transfer and energy utilization in quantum devices.",
    "authors": [
      "Zhen-Yang Peng",
      "Ying-Dan Wang"
    ],
    "publication_date": "2024-12-16T08:58:30Z",
    "arxiv_id": "http://arxiv.org/abs/2412.11573v2",
    "download_url": "https://arxiv.org/abs/2412.11573v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MATCH: Engineering Transparent and Controllable Conversational XAI Systems through Composable Building Blocks",
    "abstract": "While the increased integration of AI technologies into interactive systems enables them to solve an increasing number of tasks, the black-box problem of AI models continues to spread throughout the interactive system as a whole. Explainable AI (XAI) techniques can make AI models more accessible by employing post-hoc methods or transitioning to inherently interpretable models. While this makes individual AI models clearer, the overarching system architecture remains opaque. This challenge not only pertains to standard XAI techniques but also to human examination and conversational XAI approaches that need access to model internals to interpret them correctly and completely. To this end, we propose conceptually representing such interactive systems as sequences of structural building blocks. These include the AI models themselves, as well as control mechanisms grounded in literature. The structural building blocks can then be explained through complementary explanatory building blocks, such as established XAI techniques like LIME and SHAP. The flow and APIs of the structural building blocks form an unambiguous overview of the underlying system, serving as a communication basis for both human and automated agents, thus aligning human and machine interpretability of the embedded AI models. In this paper, we present our flow-based approach and a selection of building blocks as MATCH: a framework for engineering Multi-Agent Transparent and Controllable Human-centered systems. This research contributes to the field of (conversational) XAI by facilitating the integration of interpretability into existing interactive systems.",
    "authors": [
      "Sebe Vanbrabant",
      "Gustavo Rovelo Ruiz",
      "Davy Vanacken"
    ],
    "publication_date": "2025-11-27T12:58:04Z",
    "arxiv_id": "http://arxiv.org/abs/2511.22420v1",
    "download_url": "https://arxiv.org/abs/2511.22420v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Maximum-power quantum-mechanical Carnot engine",
    "abstract": "In their work [J. Phys. A: Math. Gen. 33, 4427 (2000)], Bender, Brody, and Meister have shown by employing a two-state model of a particle confined in the one-dimensional infinite potential well that it is possible to construct a quantum-mechanical analog of the Carnot engine through the changes of both the width of the well and the quantum state in a specific manner. Here, a discussion is developed about realizing the maximum power of such an engine, where the width of the well moves at low but finite speed. The efficiency of the engine at the maximum power output is found to be universal independently of any of the parameters contained in the model.",
    "authors": [
      "Sumiyoshi Abe"
    ],
    "publication_date": "2010-12-27T09:47:44Z",
    "arxiv_id": "http://arxiv.org/abs/1012.5583v2",
    "download_url": "https://arxiv.org/abs/1012.5583v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Fractional Variational Approach for Modelling Dissipative Mechanical Systems: Continuous and Discrete Settings",
    "abstract": "Employing a phase space which includes the (Riemann-Liouville) fractional derivative of curves evolving on real space, we develop a restricted variational principle for Lagrangian systems yielding the so-called restricted fractional Euler-Lagrange equations (both in the continuous and discrete settings), which, as we show, are invariant under linear change of variables. This principle relies on a particular restriction upon the admissible variation of the curves. In the case of the half-derivative and mechanical Lagrangians, i.e. kinetic minus potential energy, the restricted fractional Euler-Lagrange equations model a dissipative system in both directions of time, summing up to a set of equations that is invariant under time reversal. Finally, we show that the discrete equations are a meaningful discretisation of the continuous ones.",
    "authors": [
      "Fernando Jiménez",
      "Sina Ober-Blöbaum"
    ],
    "publication_date": "2018-02-28T17:27:08Z",
    "arxiv_id": "http://arxiv.org/abs/1802.10544v1",
    "download_url": "https://arxiv.org/abs/1802.10544v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A novel, Fourier series based method of control optimization and its application to a discontinuous capsule drive model",
    "abstract": "This paper presents a novel, Fourier series based numerical method of open-loop control optimization. Due to its flexible assumptions, it can be applied in a large variety of systems, including discontinuous ones or even so-called black boxes, whose equations are not fully known. This aspect is particularly important in mechanical systems, where friction or impact induced discontinuities are common. The paper includes a mathematical background of the new method, a detailed discussion of the algorithm and a numerical example, in which control function of a discontinuous capsule drive is optimized. It is expected that the proposed method can facilitate research in all areas where control of non-smooth, discontinuous or black box systems is crucial. In particular, authors hope that the presented algorithm is going to be used for control optimization of other capsule drives.",
    "authors": [
      "Sandra Zarychta",
      "Tomasz Sagan",
      "Marek Balcerzak",
      "Artur Dabrowski",
      "Andrzej Stefanski",
      "Tomasz Kapitaniak"
    ],
    "publication_date": "2021-08-24T09:55:41Z",
    "arxiv_id": "http://arxiv.org/abs/2108.10611v1",
    "download_url": "https://arxiv.org/abs/2108.10611v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sensing Kondo correlations in a suspended carbon nanotube mechanical resonator with spin-orbit coupling",
    "abstract": "We study electron mechanical coupling in a suspended carbon nanotube (CNT) quantum dot device. Electron spin couples to the flexural vibration mode due to spin-orbit coupling in the electron tunneling processes. In the weak coupling limit, i.e. electron-vibration coupling is much smaller than the electron energy scale, the damping and resonant frequency shift of the CNT resonator can be obtained by calculating the dynamical spin susceptibility. We find that strong spin-flip scattering processes in Kondo regime significantly affect the mechanical motion of the carbon nanotube: Kondo effect induces strong damping and frequency shift of the CNT resonator.",
    "authors": [
      "Dong E. Liu"
    ],
    "publication_date": "2019-03-17T09:47:20Z",
    "arxiv_id": "http://arxiv.org/abs/1903.07049v1",
    "download_url": "https://arxiv.org/abs/1903.07049v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computational synthesis of large deformation compliant mechanisms undergoing self and mutual contact",
    "abstract": "Topologies of large deformation Contact-aided Compliant Mechanisms (CCMs), with self and mutual contact, exemplified via path generation applications, are designed using the continuum synthesis approach. Design domains are parameterized using honeycomb tessellation. Assignment of material to each cell, and generation of rigid contact surfaces, are accomplished via suitably sizing and positioning negative circular masks. To facilitate contact analysis, boundary smoothing is implemented. Mean value coordinates are employed to compute shape functions, as many regular hexagonal cells get degenerated into irregular, concave polygons as a consequence of boundary smoothing. Both, geometric and material nonlinearities are considered in the finite element analysis. The augmented Lagrange multiplier method in association with an active set strategy is employed to incorporate both self and mutual contact. CCMs are evolved using the stochastic hill climber search. Synthesized contact-aided compliant continua trace paths with single and importantly, multiple kinks and experience multiple contact interactions pertaining to both self and mutual contact modes.",
    "authors": [
      "Prabhat Kumar",
      "Anupam Saxena",
      "Roger A. Sauer"
    ],
    "publication_date": "2018-02-16T17:51:43Z",
    "arxiv_id": "http://arxiv.org/abs/1802.06049v3",
    "download_url": "https://arxiv.org/abs/1802.06049v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Quantum Mechanics to Quantum Software Engineering: A Historical Review",
    "abstract": "Victor Hugo's timeless observation, \"Nothing is more powerful than an idea whose time has come\", resonates today as Quantum Computing, once only a dream of a physicist, stands at the threshold of reality with the potential to revolutionise the world. To comprehend the surge of attention it commands today, one must delve into the motivations that birthed and nurtured Quantum Computing. While the past of Quantum Computing provides insights into the present, the future could unfold through the lens of Quantum Software Engineering. Quantum Software Engineering, guided by its principles and methodologies investigates the most effective ways to interact with Quantum Computers to unlock their true potential and usher in a new era of possibilities. To gain insight into the present landscape and anticipate the trajectory of Quantum Computing and Quantum Software Engineering, this paper embarks on a journey through their evolution and outlines potential directions for future research. By doing so, we aim to equip readers (ideally software engineers and computer scientists not necessarily with quantum expertise) with the insights necessary to navigate the ever-evolving landscape of Quantum Computing and anticipate the trajectories that lie ahead.",
    "authors": [
      "Giuseppe Bisicchia",
      "Jose Garcia-Alonso",
      "Juan M. Murillo",
      "Antonio Brogi"
    ],
    "publication_date": "2024-04-30T10:17:01Z",
    "arxiv_id": "http://arxiv.org/abs/2404.19428v2",
    "download_url": "https://arxiv.org/abs/2404.19428v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]