[
  {
    "title": "Effects of external mechanical loading on stress generation during lithiation in Li-ion battery electrodes",
    "abstract": "Li-ion batteries are ineluctably subjected to external mechanical loading or stress gradient. Such stress can be induced in battery electrode during fabrication and under normal operation. In this paper, we develop a model for stresses generated during lithiation in the thin plate electrode considering the effects of external mechanical loading. It is found that diffusion-induced stresses are asymmetrically distributed through the thickness of plate due to the coupling effects of asymmetrically distributed external mechanical stress. At the very early stage during Li-ions insertion, the effects of the external mechanical loading is quite limited and unobvious. With the diffusion time increasing, the external mechanical loading exerts a significant influence on the evolution of stresses generated in the electrode. External compressed electrode is inclined to increase the value of stresses generated during lithiation, while external tensed electrode tends to decrease the value of stresses, and as the diffusion time increases, the effects of the external mechanical loading on the stresses generated during lithiation become more obvious.",
    "authors": [
      "Wenbin Zhou"
    ],
    "publication_date": "2019-04-13T14:30:48Z",
    "arxiv_id": "http://arxiv.org/abs/1907.09258v1",
    "download_url": "https://arxiv.org/abs/1907.09258v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Model Consistency for Mechanical Design: Bridging Lumped and Distributed Parameter Models with A Priori Guarantees",
    "abstract": "Engineering design often involves representation in at least two levels of abstraction: the system-level, represented by lumped parameter models (LPMs), and the geometric-level, represented by distributed parameter models (DPMs). Functional design innovation commonly occurs at the system-level, followed by a geometric-level realization of functional LPM components. However, comparing these two levels in terms of behavioral outcomes can be challenging and time-consuming, leading to delays in design translations between system and mechanical engineers.\n  In this paper, we propose a simulation-free scheme that compares LPMs and spatially-discretized DPMs based on their model specifications and behaviors of interest, regardless of modeling languages and numerical methods. We adopt a model order reduction (MOR) technique that a priori guarantees accuracy, stability, and convergence to improve the computational efficiency of large-scale models. Our approach is demonstrated through the model consistency analysis of several mechanical designs, showing its validity, efficiency, and generality. Our method provides a systematic way to compare system-level and geometric-level designs, improving reliability and facilitating design translation.",
    "authors": [
      "Randi Wang",
      "Vadim Shapiro",
      "Morad Behandish"
    ],
    "publication_date": "2023-05-11T18:39:23Z",
    "arxiv_id": "http://arxiv.org/abs/2305.07082v2",
    "download_url": "https://arxiv.org/abs/2305.07082v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Primal structure of Quantum Mechanics - A critique and an alternative",
    "abstract": "The basic premise of Quantum Mechanics, embodied in the doctrine of wave-particle duality, assigns both, a particle and a wave structure to the physical entities. The classical laws describing the motion of a particle and the evolution of a wave are assumed to be correct. Gauge Mechanics treats the discrete entities as particles, and their motion is described by an extension of the corresponding classical laws. Quantum mechanical interpretations of various observations and their implications, including some issues that are usually ignored, are presented and compared here with the gauge mechanical descriptions. The considerations are confined mainly to the conceptual foundations and the internal consistency of these theories. Although no major differences between their predictions have yet been noticed, some deviations are expected, which are indicated. These cases may provide the testing grounds for further investigations.",
    "authors": [
      "S. R. Vatsya"
    ],
    "publication_date": "1998-09-03T22:11:50Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9809005v1",
    "download_url": "https://arxiv.org/abs/quant-ph/9809005v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hard-Stop Synthesis for Multi-DOF Compliant Mechanisms",
    "abstract": "Compliant mechanisms have significant potential in precision applications due to their ability to guide motion without contact. However, an inherent vulnerability to fatigue and mechanical failure has hindered the translation of compliant mechanisms to real-world applications. This is particularly challenging in service environments where loading is complex and uncertain, and the cost of failure is high. In such cases, mechanical hard stops are critical to prevent yielding and buckling. Conventional hard-stop designs, which rely on stacking single-DOF limits, must be overly restrictive in multi-DOF space to guarantee safety in the presence of unknown loads. In this study, we present a systematic design synthesis method to guarantee overload protection in compliant mechanisms by integrating coupled multi-DOF motion limits within a single pair of compact hard-stop surfaces. Specifically, we introduce a theoretical and practical framework for optimizing the contact surface geometry to maximize the mechanisms multi-DOF working space while still ensuring that the mechanism remains within its elastic regime. We apply this synthesis method to a case study of a caged-hinge mechanism for orthopaedic implants, and provide numerical and experimental validation that the derived design offers reliable protection against fatigue, yielding, and buckling. This work establishes a foundation for precision hard-stop design in compliant systems operating under uncertain loads, which is a crucial step toward enabling the application of compliant mechanisms in real-world systems.",
    "authors": [
      "Dean Chen",
      "Armin Pomeroy",
      "Brandon T. Peterson",
      "Will Flanagan",
      "He Kai Lim",
      "Alexandra Stavrakis",
      "Nelson F. SooHoo",
      "Jonathan B. Hopkins",
      "Tyler R. Clites"
    ],
    "publication_date": "2025-07-17T18:01:18Z",
    "arxiv_id": "http://arxiv.org/abs/2507.13455v1",
    "download_url": "https://arxiv.org/abs/2507.13455v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical waves in myelinated axon wall",
    "abstract": "The propagation of an action potential is accompanied by mechanical and thermal effects. Several mathematical models explain the deformation of the unmyelinated axon wall. In this paper, the deformation of the myelinated axon wall is studied. The mathematical model is inspired by the mechanics of microstructured materials. The model involves the improved Heimburg-Jackson equation together with another equation of wave motion that describes the process in the myelin sheath. The dispersion analysis of such a model explains the behaviour of group and phase velocities. In addition, it is shown how dissipative effects may influence the process. Numerical calculations demonstrate the changes in velocities and wave profiles in the myelinated axon wall.",
    "authors": [
      "Kert Tamm",
      "Tanel Peets",
      "Jüri Engelbrecht"
    ],
    "publication_date": "2021-12-21T11:41:04Z",
    "arxiv_id": "http://arxiv.org/abs/2112.11116v1",
    "download_url": "https://arxiv.org/abs/2112.11116v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]