[
  {
    "title": "A Micrometer-sized Heat Engine Operating Between Bacterial Reservoirs",
    "abstract": "Artificial micro heat engines are prototypical models to explore and\nelucidate the mechanisms of energy transduction in a regime that is dominated\nby fluctuations [1-2]. Micro heat engines realized hitherto mimicked their\nmacroscopic counterparts and operated between reservoirs that were effectively\nthermal [3-7]. For such reservoirs, temperature is a well-defined state\nvariable and stochastic thermodynamics provides a precise framework for\nquantifying engine performance [8-9]. It remains unclear whether these concepts\nreadily carry over to situations where the reservoirs are out-of-equilibrium\n[10], a scenario of particular importance to the functioning of synthetic\n[11-12] and biological [13] micro engines and motors. Here we experimentally\nrealized a micrometer-sized active Stirling engine by periodically cycling a\ncolloidal particle in a time-varying harmonic optical potential across\nbacterial baths at different activities. Unlike in equilibrium thermal\nreservoirs, the displacement statistics of the trapped particle becomes\nincreasingly non-Gaussian with activity. We show that as much as $\\approx$ 85\\%\nof the total power output and $\\approx$ 50\\% of the overall efficiency stems\nfrom large non-Gaussian particle displacements alone. Most remarkably, at the\nhighest activities investigated, the efficiency of our quasi-static active heat\nengines surpasses the equilibrium saturation limit of Stirling efficiency - the\nmaximum efficiency of a Stirling engine with the ratio of cold and hot\nreservoir temperatures ${T_C\\over T_H} \\to 0$. Crucially, the failure of\neffective temperature descriptions [14-16] for active reservoirs highlights the\ndire need for theories that can better capture the physics of micro motors and\nheat engines that operate in strongly non-thermal environments.",
    "authors": [
      "Sudeesh Krishnamurthy",
      "Subho Ghosh",
      "Dipankar Chatterji",
      "Rajesh Ganapathy",
      "A. K. Sood"
    ],
    "publication_date": "2016-01-13T05:51:57Z",
    "arxiv_id": "http://arxiv.org/abs/1601.03130v1",
    "download_url": "http://arxiv.org/abs/1601.03130v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inertialess Gyrating Engines",
    "abstract": "A typical model for a gyrating engine consists of an inertial wheel powered\nby an energy source that generates an angle-dependent torque. Examples of such\nengines include a pendulum with an externally applied torque, Stirling engines,\nand the Brownian gyrating engine. Variations in the torque are averaged out by\nthe inertia of the system to produce limit cycle oscillations. While torque\ngenerating mechanisms are also ubiquitous in the biological world, where they\ntypically feed on chemical gradients, inertia is not a property that one\nnaturally associates with such processes. In the present work, seeking ways to\ndispense of the need for inertial effects, we study an inertia-less concept\nwhere the combined effect of coupled torque-producing components averages out\nvariations in the ambient potential and helps overcome dissipative forces to\nallow sustained operation for vanishingly small inertia. We exemplify this\ninertia-less concept through analysis of two of the aforementioned engines, the\nStirling engine and the Brownian gyrating engine. An analogous principle may be\nsought in biomolecular processes as well as in modern-day technological\nengines, where for the latter, the coupled torque-producing components reduce\nvibrations that stem from the variability of the generated torque.",
    "authors": [
      "Jordi Ventura Siches",
      "Olga Movilla Miangolarra",
      "Amirhossein Taghvaei",
      "Yongxin Chen",
      "Tryphon T. Georgiou"
    ],
    "publication_date": "2022-08-02T07:33:49Z",
    "arxiv_id": "http://arxiv.org/abs/2208.01292v1",
    "download_url": "http://arxiv.org/abs/2208.01292v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The framework for simulation of dynamics of mechanical aggregates",
    "abstract": "A framework for simulation of dynamics of mechanical aggregates has been\ndeveloped. This framework enables us to build model of aggregate from models of\nits parts. Framework is a part of universal framework for science and\nengineering.",
    "authors": [
      "Petr R. Ivankov",
      "Nikolay P. Ivankov"
    ],
    "publication_date": "2007-01-19T12:18:14Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0701119v1",
    "download_url": "http://arxiv.org/abs/cs/0701119v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Research on Study Mechanical Vibrations with Data Acquisition Systems",
    "abstract": "The paper presents a new study method of mechanic vibrations with the help of\nthe data acquisition systems. The study of vibrations with the help of data\nacquisition systems allows the solving of some engineering problems connected\nto the measurement of some parameters which are difficult to measure having in\nview the improvement of the technical performances of the industrial equipment\nor devices",
    "authors": [
      "Lenuta Suciu",
      "Florentina Cziple",
      "Cornelia Anghel"
    ],
    "publication_date": "2014-01-29T13:06:20Z",
    "arxiv_id": "http://arxiv.org/abs/1403.4508v1",
    "download_url": "http://arxiv.org/abs/1403.4508v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Grafana plugin for visualising vote based consensus mechanisms, and\n  network P2P overlay networks",
    "abstract": "In this paper, we present a plugin for visualising vote based consensus\nmechanisms primarily aimed to help engineers understand and debug blockchain\nand distributed ledger protocols. Both tools are built as Grafana plugins and\nmake no assumptions on the data storage implementation. The plugins can be\nconfigured via Grafana plugin configuration interface to fit the specifics of\nthe protocol implementation.",
    "authors": [
      "Daniil Baldouski",
      "Aleksandar Tošić"
    ],
    "publication_date": "2021-12-02T09:50:44Z",
    "arxiv_id": "http://arxiv.org/abs/2112.01082v1",
    "download_url": "http://arxiv.org/abs/2112.01082v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering Data Analytics: A Framework Based on a\n  Multi-Layered Abstraction Mechanism",
    "abstract": "This paper presents a concept of a domain-specific framework for software\nanalytics by enabling querying, modeling, and integration of heterogeneous\nsoftware repositories. The framework adheres to a multi-layered abstraction\nmechanism that consists of domain-specific operators. We showcased the\npotential of this approach by employing a case study.",
    "authors": [
      "Chaman Wijesiriwardana",
      "Prasad Wimalaratne"
    ],
    "publication_date": "2025-09-26T05:06:12Z",
    "arxiv_id": "http://arxiv.org/abs/2509.21881v1",
    "download_url": "http://arxiv.org/abs/2509.21881v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Piezoresistive heat engine and refrigerator",
    "abstract": "Heat engines provide most of our mechanical power and are essential for\ntransportation on macroscopic scale. However, although significant progress has\nbeen made in the miniaturization of electrostatic engines, it has proven\ndifficult to reduce the size of liquid or gas driven heat engines below 10^7\num^3. Here we demonstrate that a crystalline silicon structure operates as a\ncyclic piezoresistive heat engine when it is driven by a sufficiently high DC\ncurrent. A 0.34 um^3 engine beam draws heat from the DC current using the\npiezoresistive effect and converts it into mechanical work by expansion and\ncontraction at different temperatures. This mechanical power drives a silicon\nresonator of 1.1x10^3 um^3 into sustained oscillation. Even below the\noscillation threshold the engine beam continues to amplify the resonator's\nBrownian motion. When its thermodynamic cycle is inverted, the structure is\nshown to reduce these thermal fluctuations, therefore operating as a\nrefrigerator.",
    "authors": [
      "P. G. Steeneken",
      "K. Le Phan",
      "M. J. Goossens",
      "G. E. J. Koops",
      "G. J. A. M. Brom",
      "C. van der Avoort",
      "J. T. M. van Beek"
    ],
    "publication_date": "2010-01-19T18:18:11Z",
    "arxiv_id": "http://arxiv.org/abs/1001.3170v2",
    "download_url": "http://arxiv.org/abs/1001.3170v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Thermodynamic Cycles of a Mesoscopic Thermoelectric Engine",
    "abstract": "We analyze a steady-state thermoelectric engine, whose working substance\nconsists of two capacitively coupled quantum dots. One dot is tunnel-coupled to\na hot reservoir serving as a heat source, the other one to two electrically\nbiased reservoirs at a colder temperature, such that work is extracted under\nthe form of a steady-state current against the bias. In single realizations of\nthe dynamics of this steady-state engine autonomous, 4-stroke cycles can be\nidentified. The cycles are purely stochastic, in contrast to mechanical\nautonomous engines which exhibit self-oscillations. In particular, these cycles\nfluctuate in direction and duration, and occur in competition with other\nspurious cycles. Using a stochastic thermodynamic approach, we quantify the\ncycle fluctuations and relate them to the entropy produced during individual\ncycles. We identify the cycle mainly responsible for the engine performance and\nquantify its statistics with tools from graph theory. We show that such\nstochastic cycles are made possible because the work extraction mechanism is\nitself stochastic instead of the periodic time dependence in the\nworking-substance Hamiltonian which can be found in conventional mechanical\nengines. Our investigation brings new perspectives about the connection between\ncyclic and steady-state engines.",
    "authors": [
      "R David Mayrhofer",
      "Cyril Elouard",
      "Janine Splettstoesser",
      "Andrew N Jordan"
    ],
    "publication_date": "2020-10-14T07:41:41Z",
    "arxiv_id": "http://arxiv.org/abs/2010.06853v2",
    "download_url": "http://arxiv.org/abs/2010.06853v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ultra-coherent nanomechanical resonators based on density phononic\n  crystal engineering",
    "abstract": "Micro- and nanomechanical systems with exceptionally low dissipation rates\nare enabling the next-generation technologies of ultra-sensitive detectors and\nquantum information systems. New techniques and methods for lowering the\ndissipation rate have in recent years been discovered and allowed for the\nengineering of mechanical oscillators with phononic modes that are extremely\nwell isolated from the environment and thus possessing quality factors close to\nand beyond 1 billion. A powerful strategy for isolating and controlling a\nsingle phononic mode is based on phononic crystal engineering. Here we propose\na new method for phononic crystal engineering of nanomechanical oscillators\nthat is based on a periodic variation of the material density. To circumvent\nthe introduction of additional bending losses resulting from the variation of\nmaterial density, the added mass constitutes an array of nanopillars in which\nthe losses will be diluted. Using this novel technique for phononic crystal\nengineering, we design and fabricate corrugated mechanical oscillators with\nquality factors approaching one billion in a room temperature environment. The\nflexibility space of these new phononic crystals is large and further\nadvancement can be attained through optimized phononic crystal patterning and\nstrain engineering via topology optimization. This will allow for the\nengineering of mechanical membranes with quality factors approaching 10\nbillion. Such extremely low mechanical dissipation rates will enable the\ndevelopment of radically new technologies such as quantum-limited atomic force\nmicroscopy at room-temperature, ultra-sensitive detectors of dark matter,\nspontaneous waveform collapses, gravity, and high-efficiency quantum\ninformation transducers.",
    "authors": [
      "Dennis Høj",
      "Ulrich Busk Hoff",
      "Ulrik Lund Andersen"
    ],
    "publication_date": "2022-07-14T07:21:19Z",
    "arxiv_id": "http://arxiv.org/abs/2207.06703v1",
    "download_url": "http://arxiv.org/abs/2207.06703v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Programmable Motion of Optically Gated Electrically Powered Engineered\n  Microswimmer Robots",
    "abstract": "Here, we report on a new class active particles capable of dynamically\nprogrammable motion powered by electricity. We have implemented physical\nprinciples that separate the propulsion and steering mechanisms of active\nmotion using optically activated, patterned, photoresponsive semiconductor\ncoatings on intricate microstructures. Our engineered microswimmer robots\nemploy an induced-charge electro-phoresis (ICEP) mechanism to achieve linear\nmotion and optically modulated electrokinetic propulsion (OMEP) for steering.\nOptical modulation is achieved by manipulating the polarizability of patterned\nZnO semiconductor coating through exposure to light with wavelengths above its\nbandgap, exploiting the semiconductor's photoconductive properties. Unlike\nprevious methods that rely on changing the direction of optical illumination or\nspatially controlling narrow optical beams, our approach achieves optical\nsteering under uniform ambient illumination conditions, thereby greatly\nreducing the complexity of the optical system. The decoupling of propulsion and\nsteering allows for the programming of micromotor trajectories in both open and\nclosed-loop control modes. We anticipate that our findings will pave the way\nfor efficient optically gated control of the trajectory of photoresponsive\nactive particles. Furthermore, they will enable the selective manipulation of\nspecific subgroups of engineered active microparticles with various\nsemiconducting coatings having different band gaps.",
    "authors": [
      "Matan Zehavi",
      "Ido Rachbuch",
      "Sinwook Park",
      "Touvia Miloh",
      "Orlin Velev",
      "Gilad Yossifon"
    ],
    "publication_date": "2024-09-21T09:29:51Z",
    "arxiv_id": "http://arxiv.org/abs/2409.15382v1",
    "download_url": "http://arxiv.org/abs/2409.15382v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Constitutive Relation for Nonlinear Response and Universality of\n  Efficiency at Maximum Power for Tight-Coupling Heat Engines",
    "abstract": "We present a unified perspective on nonequilibrium heat engines by\ngeneralizing nonlinear irreversible thermodynamics. For tight-coupling heat\nengines, a generic constitutive relation of nonlinear response accurate up to\nthe quadratic order is derived from the symmetry argument and the stall\ncondition. By applying this generic nonlinear constitutive relation to\nfinite-time thermodynamics, we obtain the necessary and sufficient condition\nfor the universality of efficiency at maximum power, which states that a\ntight-coupling heat engine takes the universal efficiency at maximum power up\nto the quadratic order if and only if either the engine symmetrically interacts\nwith two heat reservoirs or the elementary thermal energy flowing through the\nengine matches the characteristic energy of the engine. As a result, we solve\nthe following paradox: On the one hand, the universal quadratic term in the\nefficiency at maximum power for tight-coupling heat engines proved as a\nconsequence of symmetry [M. Esposito, K. Lindenberg, and C. Van den Broeck,\nPhys. Rev. Lett. 102, 130602 (2009); S. Q. Sheng and Z. C. Tu, Phys. Rev. E 89,\n012129 (2014)]; On the other hand, two typical heat engines including the\nCurzon-Ahlborn endoreversible heat engine [F. L. Curzon and B. Ahlborn, Am. J.\nPhys. 43, 22 (1975)] and the Feynman ratchet [Z. C. Tu, J. Phys. A 41, 312003\n(2008)] recover the universal efficiency at maximum power regardless of any\nsymmetry.",
    "authors": [
      "Shiqi Sheng",
      "Z. C. Tu"
    ],
    "publication_date": "2014-04-28T14:42:22Z",
    "arxiv_id": "http://arxiv.org/abs/1404.7008v4",
    "download_url": "http://arxiv.org/abs/1404.7008v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hyperaccreting Black Hole as Gamma-Ray Burst Central Engine. II.\n  Temporal evolution of central engine parameters during Prompt and Afterglow\n  Phases",
    "abstract": "A hyperaccreting stellar-mass black hole has been proposed as the candidate\ncentral engine of gamma-ray bursts (GRBs). The rich observations of GRBs by\n\\textit{Fermi} and \\textit{Swift} make it possible to constrain the central\nengine model by comparing the model predications against data. This paper is\ndedicated to studying the temporal evolution of central engine parameters for\nboth prompt emission and afterglow phases. We consider two jet launching\nmechanisms, i.e., $\\nu\\bar{\\nu}$ annihilations and the Blandford-Znajek (BZ)\nprocesse, and obtain analytical solutions to these two models. We then\ninvestigate the black hole central engine parameters, such as the jet power,\nthe dimensionless entropy $\\eta$, and the central engine parameter $\\mu_0=\\eta\n(1+\\sigma_0)$ (where $\\sigma_0$ is the initial magnetization of the engine) at\nthe base of the jet. The black hole may be spun up by accretion, or spun down\nby the BZ process, leaving imprints in GRB lightcurves. Usually, a BZ jet is\nmore powerful and is likely responsible for the late time central engine\nactivities. However, an initially non-spinning black hole central engine may\nfirst launch a thermal \"fireball\" via neutrino annihilations, and then launch a\nPoynting-flux-dominated jet via the BZ process. Multiple flares, giant bumps,\nand plateaus in GRB afterglows can be well produced as the result of late time\naccretion onto the black hole.",
    "authors": [
      "Wei-Hua Lei",
      "Bing Zhang",
      "Xue-Feng Wu",
      "En-Wei Liang"
    ],
    "publication_date": "2017-08-16T19:15:29Z",
    "arxiv_id": "http://arxiv.org/abs/1708.05043v2",
    "download_url": "http://arxiv.org/abs/1708.05043v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exactly solvable two-terminal heat engine with asymmetric Onsager\n  coefficients: Origin of the power-efficiency bound",
    "abstract": "An engine producing a finite power at the ideal (Carnot) efficiency is a\ndream engine, which is not prohibited by the thermodynamic second law. Some\nyears ago, a two-terminal heat engine with {\\em asymmetric} Onsager\ncoefficients in the linear response regime was suggested by Benenti, Saito, and\nCasati [Phys. Rev. Lett. {\\bf 106}, 230602 (2011)], as a prototypical system to\nmake such a dream come true with non-divergent system parameter values.\nHowever, such a system has never been realized in spite of many trials. Here,\nwe introduce an exactly solvable two-terminal Brownian heat engine with the\nasymmetric Onsager coefficients in the presence of a Lorenz (magnetic) force.\nNevertheless, we show that the dream engine regime cannot be accessible even\nwith the asymmetric Onsager coefficients, due to an instability keeping the\nengine from reaching its steady state. This is consistent with recent trade-off\nrelations between the engine power and efficiency, where the (cyclic)\nsteady-state condition is implicitly presumed. We conclude that the\ninaccessibility to the dream engine originates from the steady-state constraint\non the engine.",
    "authors": [
      "Jae Sung Lee",
      "Jong-Min Park",
      "Hyun-Myung Chun",
      "Jaegon Um",
      "Hyunggyu Park"
    ],
    "publication_date": "2020-03-04T02:52:33Z",
    "arxiv_id": "http://arxiv.org/abs/2003.01869v2",
    "download_url": "http://arxiv.org/abs/2003.01869v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-Markovian thermal operations boosting the performance of quantum\n  heat engines",
    "abstract": "It is investigated whether non-Markovianity, i.e., the memory effects\nresulting from the coupling of the system to its environment, can be beneficial\nfor the performance of quantum heat engines. Specifically, two physical models\nare considered. The first one is a well known single-qubit Otto engine; the\nnon-Markovian behaviour is there implemented by replacing standard\nthermalization strokes with so-called extremal thermal operations which cannot\nbe realized without the memory effects. The second one is a three-stroke engine\nin which the cycle consists of two extremal thermal operations and a single\nqubit rotation. It is shown that the non-Markovian Otto engine can generate\nmore work-per-cycle for a given efficiency than its Markovian counterpart,\nwhereas performance of both setups is superior to the three-stroke engine.\nFurthermore, both the non-Markovian Otto engine and the three-stroke engine can\nreduce the work fluctuations in comparison with the Markovian Otto engine, with\ntheir relative advantage depending on the performance target. This demonstrates\nthe beneficial influence of non-Markovianity on both the average performance\nand the stability of operation of quantum heat engines.",
    "authors": [
      "Krzysztof Ptaszyński"
    ],
    "publication_date": "2022-03-28T12:05:35Z",
    "arxiv_id": "http://arxiv.org/abs/2203.14671v4",
    "download_url": "http://arxiv.org/abs/2203.14671v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Second law for active heat engines",
    "abstract": "Macroscopic cyclic heat engines have been a major motivation for the\nemergence of thermodynamics. In the last decade, cyclic heat engines that have\nlarge fluctuations and operate at finite time were studied within the more\nmodern framework of stochastic thermodynamics. The second law for such heat\nengines states that the efficiency cannot be larger than the Carnot efficiency.\nThe concept of cyclic active heat engines for a system in the presence of\nhidden dissipative degrees of freedom, also known as a nonequilibrium or active\nreservoir, has also been studied in theory and experiment. Such active engines\nshow rather interesting behavior such as an ``efficiency'' larger than the\nCarnot bound. They are also likely to play an important role in future\ndevelopments, given the ubiquitous presence of active media. However, a general\nsecond law for cyclic active heat engines has been lacking so far. Here, upon\nusing a known inequality in stochastic stochastic thermodynamics for the excess\nentropy, we obtain a general second law for active heat engines, which does not\ninvolve the energy dissipation of the hidden degrees of freedom and is\nexpressed in terms of quantities that can be measured directly from the\nobservable degrees of freedom. Besides heat and work, our second law contains\nan information-theoretic term, which allows an active heat engine to extract\nwork beyond the limits valid for a passive heat engine. To obtain a second law\nexpressed in terms of observable variables in the presence of hidden degrees of\nfreedom we introduce a coarse-grained excess entropy and prove a fluctuation\ntheorem for this quantity.",
    "authors": [
      "Arya Datta",
      "Patrick Pietzonka",
      "Andre C Barato"
    ],
    "publication_date": "2021-12-07T20:59:57Z",
    "arxiv_id": "http://arxiv.org/abs/2112.03986v2",
    "download_url": "http://arxiv.org/abs/2112.03986v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coherent heat transfer leads to genuine quantum enhancement in the\n  performances of continuous engines",
    "abstract": "Conventional continuous quantum heat engines with incoherent heat transfer\nperform poorly as they exploit two-body interactions between the system and hot\nor cold baths, thus having limited capability to outperform their classical\ncounterparts. We introduce distinct continuous quantum heat engines that\nutilize coherent heat transfer with baths, yielding genuine quantum enhancement\nin performance. These coherent engines consist of one qutrit system and two\nphotonic baths and enable coherent heat transfer via two-photon transitions\ninvolving three-body interactions between the system and hot and cold baths. We\ndemonstrate that coherent engines deliver significantly higher power output\nwith much greater reliability, i.e., lower signal-to-noise ratio of the power,\nby hundreds of folds over their incoherent counterparts. Importantly, coherent\nengines can operate close to or at the maximal achievable reliability allowed\nby the quantum thermodynamic uncertainty relation. Moreover, coherent engines\nmanifest more nonclassical features than incoherent engines because they\nviolate the classical thermodynamic uncertainty relation by a greater amount\nand for a wider range of parameters. These genuine enhancements in the\nperformance of coherent engines are directly attributed to their capacity to\nharness higher energetic coherence for the resonant driving case. The\nexperimental feasibility of coherent engines and the improved understanding of\nhow quantum properties can enhance performance may find applications in\nquantum-enabled technologies.",
    "authors": [
      "Brij Mohan",
      "Rajeev Gangwar",
      "Tanmoy Pandit",
      "Mohit Lal Bera",
      "Maciej Lewenstein",
      "Manabendra Nath Bera"
    ],
    "publication_date": "2024-04-08T18:01:11Z",
    "arxiv_id": "http://arxiv.org/abs/2404.05799v2",
    "download_url": "http://arxiv.org/abs/2404.05799v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Pillbug-Inspired Morphing Mechanism Covered with Sliding Shells",
    "abstract": "This research proposes a novel morphing structure with shells inspired by the\nmovement of pillbugs. Instead of the pillbug body, a loopcoupled mechanism\nbased on slider-crank mechanisms is utilized to achieve the rolling up and\nspreading motion. This mechanism precisely imitates three distinct curves that\nmimic the shape morphing of a pillbug. To decrease the degree-of-freedom (DOF)\nof the mechanism to one, scissor mechanisms are added. 3D curved shells are\nthen attached to the tracer points of the morphing mechanism to safeguard it\nfrom attacks while allowing it to roll. Through type and dimensional synthesis,\na complete system that includes shells and an underlying morphing mechanism is\ndeveloped. A 3D model is created and tested to demonstrate the proposed\nsystem's shape-changing capability. Lastly, a robot with two modes is developed\nbased on the proposed mechanism, which can curl up to roll down hills and can\nspread to move in a straight line via wheels.",
    "authors": [
      "Jieyu Wang",
      "Yingzhong Tian",
      "Fengfeng Xi",
      "Damien Chablat",
      "Jianing Lin",
      "Gaoke Ren",
      "Yinjun Zhao"
    ],
    "publication_date": "2025-06-05T12:17:36Z",
    "arxiv_id": "http://arxiv.org/abs/2506.04942v1",
    "download_url": "http://arxiv.org/abs/2506.04942v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universality and scaling of optimal heat engines",
    "abstract": "From the steam engine to current nano-devices, the design of efficient\nthermal machines has been instrumental in modern societies. In its essence a\nthermal engine can be thought as a working substance, in contact with two or\nmore baths, undergoing a cyclic transformation. What happens if the working\nsubstance is on the verge of a phase transition? Already in 1902 the latent\nheat was identified as a key to improve the efficiency of steam engines Despite\nthis early observation, the impact of phase transitions on the performance of\nthermal machines has not been addressed. By combining the tools of\nnon-equilibrium and quantum thermodynamics with finite-size-scaling and\ninformation theory, we unveil an unnoticed mechanism, triggered by the vicinity\nto a phase transition, to boost the performance of an engine. This result sheds\nnew light on the so called power-efficiency dilemma and could be used to\nrealise powerful and, at the same time, efficient engines. Specific\nimplementations with trapped ions and superconducting nano-circuits will be\ndiscussed.",
    "authors": [
      "Michele Campisi",
      "Rosario Fazio"
    ],
    "publication_date": "2015-10-21T09:50:01Z",
    "arxiv_id": "http://arxiv.org/abs/1510.06183v2",
    "download_url": "http://arxiv.org/abs/1510.06183v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimal tuning of a confined Brownian information engine",
    "abstract": "A Brownian information engine is a device extracting a mechanical work from a\nsingle heat bath by exploiting the information on the state of a Brownian\nparticle immersed in the bath. As for engines, it is important to find the\noptimal operating condition that yields the maximum extracted work or power.\nThe optimal condition for a Brownian information engine with a finite cycle\ntime $\\tau$ has been rarely studied because of the difficulty in finding the\nnonequilibrium steady state. In this study, we introduce a model for the\nBrownian information engine and develop an analytic formalism for its steady\nstate distribution for any $\\tau$. We find that the extracted work per engine\ncycle is maximum when $\\tau$ approaches infinity, while the power is maximum\nwhen $\\tau$ approaches zero.",
    "authors": [
      "J. -M. Park",
      "J. S. Lee",
      "J. D. Noh"
    ],
    "publication_date": "2015-12-22T16:16:04Z",
    "arxiv_id": "http://arxiv.org/abs/1512.07144v1",
    "download_url": "http://arxiv.org/abs/1512.07144v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding the Building Blocks of Accountability in Software\n  Engineering",
    "abstract": "In the social and organizational sciences, accountability has been linked to\nthe efficient operation of organizations. However, it has received limited\nattention in software engineering (SE) research, in spite of its central role\nin the most popular software development methods (e.g., Scrum). In this\narticle, we explore the mechanisms of accountability in SE environments. We\ninvestigate the factors that foster software engineers' individual\naccountability within their teams through an interview study with 12 people.\nOur findings recognize two primary forms of accountability shaping software\nengineers individual senses of accountability: institutionalized and\ngrassroots. While the former is directed by formal processes and mechanisms,\nlike performance reviews, grassroots accountability arises organically within\nteams, driven by factors such as peers' expectations and intrinsic motivation.\nThis organic form cultivates a shared sense of collective responsibility,\nemanating from shared team standards and individual engineers' inner commitment\nto their personal, professional values, and self-set standards. While\ninstitutionalized accountability relies on traditional \"carrot and stick\"\napproaches, such as financial incentives or denial of promotions, grassroots\naccountability operates on reciprocity with peers and intrinsic motivations,\nlike maintaining one's reputation in the team.",
    "authors": [
      "Adam Alami",
      "Neil Ernst"
    ],
    "publication_date": "2024-02-02T21:53:35Z",
    "arxiv_id": "http://arxiv.org/abs/2402.01926v1",
    "download_url": "http://arxiv.org/abs/2402.01926v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring the role of criticality in the quantum Otto cycle fueled by\n  the anisotropic quantum Rabi-Stark model",
    "abstract": "Quantum heat machines, encompassing heat engines, refrigerators, heaters, and\naccelerators, represent the forefront of quantum thermodynamics, offering a\nnovel paradigm for converting heat energy into useful mechanical work.\nLeveraging quantum mechanical principles, these machines promise superior\nefficiency and performance compared to classical counterparts, with potential\napplications in renewable energy and quantum computing. This paper investigates\na quantum Otto engine operating in both ideal and finite-time scenarios,\nemploying a two-level system interacting with a harmonic oscillator within the\nframework of the anisotropic quantum Rabi-Stark model (AQRSM) as the working\nmedium. This model is notable for exhibiting both first-order and continuous\nquantum phase transitions. By focusing on quantum heat engines, our study\nreveals that these phase transitions critically modulate the efficiency and\npower of AQRSM-based engines, outperforming quantum engines fueled by working\nmedium with harmonic spectrum. Additionally, we explore the impacts of quantum\nfriction and conduct limit cycle analysis in finite-time operations, providing\ninsights into optimizing quantum heat engines for practical implementation.",
    "authors": [
      "He-Guang Xu",
      "Jiasen Jin",
      "Norton G. de Almeida",
      "G. D. de Moraes Neto"
    ],
    "publication_date": "2024-07-12T06:36:57Z",
    "arxiv_id": "http://arxiv.org/abs/2407.09027v1",
    "download_url": "http://arxiv.org/abs/2407.09027v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "When Abstraction Breaks Physics: Rethinking Modular Design in Quantum\n  Software",
    "abstract": "Abstraction is a fundamental principle in classical software engineering,\nwhich enables modularity, reusability, and scalability. However, quantum\nprograms adhere to fundamentally different semantics, such as unitarity,\nentanglement, the no-cloning theorem, and the destructive nature of\nmeasurement, which introduce challenges to the safe use of classical\nabstraction mechanisms. This paper identifies a fundamental conflict in quantum\nsoftware engineering: abstraction practices that are syntactically valid may\nviolate the physical constraints of quantum computation. We present three\nclasses of failure cases where naive abstraction breaks quantum semantics and\npropose a set of design principles for physically sound abstraction mechanisms.\nWe further propose research directions, including quantum-specific type\nsystems, effect annotations, and contract-based module design. Our goal is to\ninitiate a systematic rethinking of abstraction in quantum software\nengineering, based on quantum semantics and considering engineering\nscalability.",
    "authors": [
      "Jianjun Zhao"
    ],
    "publication_date": "2025-10-21T12:08:58Z",
    "arxiv_id": "http://arxiv.org/abs/2510.18557v1",
    "download_url": "http://arxiv.org/abs/2510.18557v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Statistical Physics: a Short Course for Electrical Engineering Students",
    "abstract": "This is a set of lecture notes of a course on statistical physics and\nthermodynamics, which is oriented, to a certain extent, towards electrical\nengineering students. The main body of the lectures is devoted to statistical\nphysics, whereas much less emphasis is given to the thermodynamics part. In\nparticular, the idea is to let the most important results of thermodynamics\n(most notably, the laws of thermodynamics) to be obtained as conclusions from\nthe derivations in statistical physics. Beyond the variety of central topics in\nstatistical physics that are important to the general scientific education of\nthe EE student, special emphasis is devoted to subjects that are vital to the\nengineering education concretely. These include, first of all, quantum\nstatistics, like the Fermi-Dirac distribution, as well as diffusion processes,\nwhich are both fundamental for deep understanding of semiconductor devices.\nAnother important issue for the EE student is to understand mechanisms of noise\ngeneration and stochastic dynamics in physical systems, most notably, in\nelectric circuitry. Accordingly, the fluctuation-dissipation theorem of\nstatistical mechanics, which is the theoretical basis for understanding thermal\nnoise processes in systems, is presented from a signals--and--systems point of\nview, in a way that would hopefully be understandable and useful for an\nengineering student, and well connected to other courses in the electrcial\nengineering curriculum like courses on random priocesses. The quantum regime,\nin this context, is important too and hence provided as well. Finally, we touch\nvery briefly upon some relationships between statistical mechanics and\ninformation theory, which is the theoretical basis for communications\nengineering, and demonstrate how statistical-mechanical approach can be useful\nin order for the study of information-theoretic problems.",
    "authors": [
      "Neri Merhav"
    ],
    "publication_date": "2013-07-19T06:29:55Z",
    "arxiv_id": "http://arxiv.org/abs/1307.5137v1",
    "download_url": "http://arxiv.org/abs/1307.5137v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ChatGPT & Mechanical Engineering: Examining performance on the FE\n  Mechanical Engineering and Undergraduate Exams",
    "abstract": "The launch of ChatGPT at the end of 2022 generated large interest into\npossible applications of artificial intelligence in STEM education and among\nSTEM professions. As a result many questions surrounding the capabilities of\ngenerative AI tools inside and outside of the classroom have been raised and\nare starting to be explored. This study examines the capabilities of ChatGPT\nwithin the discipline of mechanical engineering. It aims to examine use cases\nand pitfalls of such a technology in the classroom and professional settings.\nChatGPT was presented with a set of questions from junior and senior level\nmechanical engineering exams provided at a large private university, as well as\na set of practice questions for the Fundamentals of Engineering Exam (FE) in\nMechanical Engineering. The responses of two ChatGPT models, one free to use\nand one paid subscription, were analyzed. The paper found that the subscription\nmodel (GPT-4) greatly outperformed the free version (GPT-3.5), achieving 76%\ncorrect vs 51% correct, but the limitation of text only input on both models\nmakes neither likely to pass the FE exam. The results confirm findings in the\nliterature with regards to types of errors and pitfalls made by ChatGPT. It was\nfound that due to its inconsistency and a tendency to confidently produce\nincorrect answers the tool is best suited for users with expert knowledge.",
    "authors": [
      "Matthew Frenkel",
      "Hebah Emara"
    ],
    "publication_date": "2023-09-26T20:12:26Z",
    "arxiv_id": "http://arxiv.org/abs/2309.15866v1",
    "download_url": "http://arxiv.org/abs/2309.15866v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Work extremum principle: Structure and function of quantum heat engines",
    "abstract": "We consider a class of quantum heat engines consisting of two subsystems\ninteracting via a unitary transformation and coupled to two separate baths at\ndifferent temperatures $T_h > T_c$. The purpose of the engine is to extract\nwork due to the temperature difference. Its dynamics is not restricted to the\nnear equilibrium regime. The engine structure is determined by maximizing the\nextracted work under various constraints. When this maximization is carried out\nat finite power, the engine dynamics is described by well-defined temperatures\nand satisfies the local version of the second law. In addition, its efficiency\nis bounded from below by the Curzon-Ahlborn value $1-\\sqrt{T_c/T_h}$ and from\nabove by the Carnot value $1-(T_c/T_h)$. The latter is reached|at finite\npower|for a macroscopic engine, while the former is achieved in the equilibrium\nlimit $T_h\\to T_c$. When the work is maximized at a zero power, even a small\n(few-level) engine extracts work right at the Carnot efficiency.",
    "authors": [
      "Armen E. Allahverdyan",
      "Ramandeep S. Johal",
      "Guenter Mahler"
    ],
    "publication_date": "2007-09-26T10:33:00Z",
    "arxiv_id": "http://arxiv.org/abs/0709.4125v1",
    "download_url": "http://arxiv.org/abs/0709.4125v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modular Workflow Engine for Distributed Services using Lightweight Java\n  Clients",
    "abstract": "In this article we introduce the concept and the first implementation of a\nlightweight client-server-framework as middleware for distributed computing. On\nthe client side an installation without administrative rights or privileged\nports can turn any computer into a worker node. Only a Java runtime environment\nand the JAR files comprising the workflow client are needed. To connect all\nclients to the engine one open server port is sufficient. The engine submits\ndata to the clients and orchestrates their work by workflow descriptions from a\ncentral database. Clients request new task descriptions periodically, thus the\nsystem is robust against network failures. In the basic set-up, data up- and\ndownloads are handled via HTTP communication with the server. The performance\nof the modular system could additionally be improved using dedicated file\nservers or distributed network file systems.\n  We demonstrate the design features of the proposed engine in real-world\napplications from mechanical engineering. We have used this system on a compute\ncluster in design-of-experiment studies, parameter optimisations and robustness\nvalidations of finite element structures.",
    "authors": [
      "R. -M. Vetter",
      "W. Lennartz",
      "J. -V. Peetz"
    ],
    "publication_date": "2009-12-03T01:31:36Z",
    "arxiv_id": "http://arxiv.org/abs/0912.0549v1",
    "download_url": "http://arxiv.org/abs/0912.0549v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Single Particle Stochastic Heat Engine",
    "abstract": "We have performed an extensive analysis of a single particle stochastic heat\nengine constructed by manipulating a Brownian particle in a time dependent\nharmonic potential. The cycle consists of two isothermal steps at different\ntemperatures and two adiabatic steps similar to that of a Carnot engine. The\nengine shows qualitative differences in inertial and overdamped regimes. All\nthe thermodynamic quantities, including efficiency, exhibit strong fluctuations\nin a time periodic steady state. The fluctuations of stochastic efficiency\ndominate over the mean values even in the quasistatic regime. Interestingly,\nour system acts as an engine provided the temperature difference between the\ntwo reservoirs is greater than a finite critical value which in turn depends on\nthe cycle time and other system parameters. This is supported by our analytical\nresults carried out in the quasistatic regime. Our system works more reliably\nas an engine for large cycle times. By studying various model systems we\nobserve that the operational characteristics are model dependent. Our results\nclearly rules out any universal relation between efficiency at maximum power\nand temperature of the baths. We have also verified fluctuation relations for\nheat engines in time periodic steady state.",
    "authors": [
      "Shubhashis Rana",
      "P. S. Pal",
      "Arnab Saha",
      "A. M. Jayannavar"
    ],
    "publication_date": "2014-04-30T19:00:21Z",
    "arxiv_id": "http://arxiv.org/abs/1404.7831v2",
    "download_url": "http://arxiv.org/abs/1404.7831v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "RoboBrain: Large-Scale Knowledge Engine for Robots",
    "abstract": "In this paper we introduce a knowledge engine, which learns and shares\nknowledge representations, for robots to carry out a variety of tasks. Building\nsuch an engine brings with it the challenge of dealing with multiple data\nmodalities including symbols, natural language, haptic senses, robot\ntrajectories, visual features and many others. The \\textit{knowledge} stored in\nthe engine comes from multiple sources including physical interactions that\nrobots have while performing tasks (perception, planning and control),\nknowledge bases from the Internet and learned representations from several\nrobotics research groups.\n  We discuss various technical aspects and associated challenges such as\nmodeling the correctness of knowledge, inferring latent information and\nformulating different robotic tasks as queries to the knowledge engine. We\ndescribe the system architecture and how it supports different mechanisms for\nusers and robots to interact with the engine. Finally, we demonstrate its use\nin three important research areas: grounding natural language, perception, and\nplanning, which are the key building blocks for many robotic tasks. This\nknowledge engine is a collaborative effort and we call it RoboBrain.",
    "authors": [
      "Ashutosh Saxena",
      "Ashesh Jain",
      "Ozan Sener",
      "Aditya Jami",
      "Dipendra K. Misra",
      "Hema S. Koppula"
    ],
    "publication_date": "2014-12-01T21:22:46Z",
    "arxiv_id": "http://arxiv.org/abs/1412.0691v2",
    "download_url": "http://arxiv.org/abs/1412.0691v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Code Generator Composition for Model-Driven Engineering of Robotics\n  Component & Connector Systems",
    "abstract": "Engineering software for robotics applications requires multidomain and\napplication-specific solutions. Model-driven engineering and modeling language\nintegration provide means for developing specialized, yet reusable models of\nrobotics software architectures. Code generators transform these platform\nindependent models into executable code specific to robotic platforms.\nGenerative software engineering for multidomain applications requires not only\nthe integration of modeling languages but also the integration of validation\nmechanisms and code generators. In this paper we sketch a conceptual model for\ncode generator composition and show an instantiation of this model in the\nMontiArc- Automaton framework. MontiArcAutomaton allows modeling software\narchitectures as component and connector models with different component\nbehavior modeling languages. Effective means for code generator integration are\na necessity for the post hoc integration of applicationspecific languages in\nmodel-based robotics software engineering.",
    "authors": [
      "Jan Oliver Ringert",
      "Alexander Roth",
      "Bernhard Rumpe",
      "Andreas Wortmann"
    ],
    "publication_date": "2015-05-05T07:30:58Z",
    "arxiv_id": "http://arxiv.org/abs/1505.00904v1",
    "download_url": "http://arxiv.org/abs/1505.00904v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum point contacts as heat engines",
    "abstract": "The efficiency of macroscopic heat engines is restricted by the second law of\nthermodynamics. They can reach at most the efficiency of a Carnot engine. In\ncontrast, heat currents in mesoscopic heat engines show fluctuations. Thus,\nthere is a small probability that a mesoscopic heat engine exceeds Carnot's\nmaximum value during a short measurement time. We illustrate this effect using\na quantum point contact as a heat engine. When a temperature difference is\napplied to a quantum point contact, the system may be utilized as a source of\nelectrical power under steady state conditions. We first discuss the optimal\nworking point of such a heat engine that maximizes the generated electrical\npower and subsequently calculate the statistics for deviations of the\nefficiency from its most likely value. We find that deviations surpassing the\nCarnot limit are possible, but unlikely.",
    "authors": [
      "Sebastian Pilgram",
      "David Sanchez",
      "Rosa Lopez"
    ],
    "publication_date": "2015-06-04T14:58:52Z",
    "arxiv_id": "http://arxiv.org/abs/1506.01613v2",
    "download_url": "http://arxiv.org/abs/1506.01613v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Maximum Power Output of Quantum Heat Engine with Energy Bath",
    "abstract": "The difference between quantum isoenergetic process and quantum isothermal\nprocess comes from the violation of the law of equipartition of energy in the\nquantum regime. To reveal an important physical meaning of this fact, here we\nstudy a special type of quantum heat engine consisting of three processes:\nisoenergetic, isothermal and adiabatic processes. Therefore, this engine works\nbetween the energy and heat baths. Combining two engines of this kind, it is\npossible to realize the quantum Carnot engine. Furthermore, considering finite\nvelocity of change of the potential shape, here an infinite square well with\nmoving walls, the power output of the engine is discussed. It is found that the\nefficiency and power output are both closely dependent on the initial and final\nstates of the quantum isothermal process. The performance of the engine cycle\nis shown to be optimized by control of the occupation probability of the ground\nstate, which is determined by the temperature and the potential width. The\nrelation between the efficiency and power output is also discussed.",
    "authors": [
      "Shengnan Liu",
      "Congjie Ou"
    ],
    "publication_date": "2016-05-26T09:47:32Z",
    "arxiv_id": "http://arxiv.org/abs/1606.02948v1",
    "download_url": "http://arxiv.org/abs/1606.02948v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficiency at the maximum power output for simple two-level heat engine",
    "abstract": "We introduce a simple two-level heat engine to study the efficiency in the\ncondition of the maximum power output, depending on the energy levels from\nwhich the net work is extracted. In contrast to the quasi-statically operated\nCarnot engine whose efficiency reaches the theoretical maximum, recent research\non more realistic engines operated in finite time has revealed other classes of\nefficiency such as the Curzon-Ahlborn efficiency maximizing the power output.\nWe investigate yet another side with our heat engine model, which consists of\npure relaxation and net work extraction processes from the population\ndifference caused by different transition rates. Due to the nature of our\nmodel, the time-dependent part is completely decoupled from the other terms in\nthe generated work. We derive analytically the optimal condition for transition\nrates maximizing the generated power output and discuss its implication on\ngeneral premise of realistic heat engines. In particular, the optimal engine\nefficiency of our model is different from the Curzon-Ahlborn efficiency,\nalthough they share the universal linear and quadratic coefficients at the\nnear-equilibrium limit. We further confirm our results by taking an alternative\napproach in terms of the entropy production at hot and cold reservoirs.",
    "authors": [
      "Sang Hoon Lee",
      "Jaegon Um",
      "Hyunggyu Park"
    ],
    "publication_date": "2016-12-01T23:57:51Z",
    "arxiv_id": "http://arxiv.org/abs/1612.00518v1",
    "download_url": "http://arxiv.org/abs/1612.00518v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pulsejet engine dynamics in vertical motion using momentum conservation",
    "abstract": "The momentum conservation law is applied to analyse the dynamics of pulsejet\nengine in vertical motion in a uniform gravitational field in the absence of\nfriction. The model predicts existence of a terminal speed given frequency of\nthe short pulses. The conditions that the engine does not return to the\nstarting position are identified. The number of short periodic pulses after\nwhich the engine returns to the starting position is found to be independent of\nthe exhaust velocity and gravitational field intensity for certain frequency of\nthe pulses. The pulsejet engine and turbojet engine aircraft models of dynamics\nare compared. Also the octopus dynamics is modelled. The paper is addressed to\nintermediate undergraduate students of classical mechanics and aerospace\nengineering.",
    "authors": [
      "Tiberius O. Cheche"
    ],
    "publication_date": "2017-01-22T11:38:36Z",
    "arxiv_id": "http://arxiv.org/abs/1702.00814v2",
    "download_url": "http://arxiv.org/abs/1702.00814v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modernization of Professional Training of Electromechanics Bachelors:\n  ICT-based Competence Approach",
    "abstract": "Analysis of the standards for the preparation of electromechanics in Ukraine\nshowed that the electromechanic engineer is able to solve complex specialized\nproblems and practical problems in a certain area of professional activity or\nin the process of study. These problems are characterized by complexity and\nuncertainty of conditions. The main competencies include social-personal,\ngeneral-scientific, instrumental, general-professional and\nspecialized-professional. A review of scientific publications devoted to the\ntraining of electromechanics has shown that four branches of engineering are\ninvolved in the training of electromechanical engineers: mechanical and\nelectrical engineering (with a common core of electromechanics), electronic\nengineering and automation. The common use of the theory, methods and means of\nthese industries leads to the emergence of a combined field of engineering -\nmechatronics. Summarizing the experience of electrical engineers professional\ntraining in Ukraine and abroad makes it possible to determine the main\ndirections of their professional training modernization.",
    "authors": [
      "Yevhenii O. Modlo",
      "Serhiy O. Semerikov",
      "Ekaterina O. Shmeltzer"
    ],
    "publication_date": "2018-07-02T17:55:08Z",
    "arxiv_id": "http://arxiv.org/abs/1807.00803v2",
    "download_url": "http://arxiv.org/abs/1807.00803v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Three-level laser heat engine at optimal performance with ecological\n  function",
    "abstract": "Although classical and quantum heat engines work on entirely different\nfundamental principles, there is an underlying similarity. For instance, the\nform of efficiency at optimal performance may be similar for both types of\nengines. In this work, we study a three-level laser quantum heat engine\noperating at maximum ecological function (EF) which represents a compromise\nbetween the power output and the loss of power due to entropy production. We\nderive analytic expressions for efficiency under the assumptions of strong\nmatter-field coupling and high bath temperatures. Upper and lower bounds on the\nefficiency exist in case of extreme asymmetric dissipation when the ratio of\nsystem-bath coupling constants at the hot and the cold contacts respectively\napproaches, zero or infinity. These bounds have been established previously for\nvarious classical models of Carnot-like engines. We conclude that while the\nengine produces at least 75\\% of the power output as compared with the maximum\npower conditions, the fractional loss of power is appreciably low in case of\nthe engine operating at maximum EF, thus making this objective function\nrelevant from an environmental point of view.",
    "authors": [
      "Varinder Singh",
      "Ramandeep S. Johal"
    ],
    "publication_date": "2019-02-11T04:36:31Z",
    "arxiv_id": "http://arxiv.org/abs/1902.03727v1",
    "download_url": "http://arxiv.org/abs/1902.03727v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-time quantum Otto engine: Surpassing the quasi-static efficiency\n  due to friction",
    "abstract": "In finite-time quantum heat engines, some work is consumed to drive a working\nfluid accompanying coherence, which is called `friction'. To understand the\nrole of friction in quantum thermodynamics, we present a couple of finite-time\nquantum Otto cycles with two different baths: Agarwal versus Lindbladian. We\nsolve them exactly and compare the performance of the Agarwal engine with that\nof the Lindbladian engine. In particular, we find remarkable and\ncounterintuitive results that the performance of the Agarwal engine due to\nfriction can be much higher than that in the quasistatic limit with the Otto\nefficiency, and the power of the Lindbladian engine can be nonzero in the\nshort-time limit. Based on additional numerical calculations of these outcomes,\nwe discuss possible origins of such differences between two engines and reveal\nthem. Our results imply that even with an equilibrium bath, a nonequilibrium\nworking fluid brings on the higher performance than what an equilibrium working\nfluid does.",
    "authors": [
      "Sangyun Lee",
      "Meesoon Ha",
      "Jong-Min Park",
      "Hawoong Jeong"
    ],
    "publication_date": "2019-11-09T06:37:26Z",
    "arxiv_id": "http://arxiv.org/abs/1911.03622v3",
    "download_url": "http://arxiv.org/abs/1911.03622v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-Commutative space: boon or bane for quantum engines and\n  refrigerators",
    "abstract": "Various quantum systems are considered as the working substance for the\nanalysis of quantum heat cycles and quantum refrigerators. The ongoing\ntechnological challenge is how efficiently can a heat engine convert thermal\nenergy to mechanical work. The seminal work of Carnot has proposed a\nfundamental upper limit-the Carnot limit on the efficiency of the heat engine.\nHowever, the heat engines can be operated beyond the fundamental upper limit by\nexploiting non-equilibrium reservoirs. Here, the change in the space structure\nintroduces the non-equilibrium effect. So, a question arises whether a change\nin the space structure can provide any boost for the quantum engines and\nrefrigerators. The efficiency of the heat cycle and the coefficient of\nperformance (COP) of the refrigerator cycles in the non-commutative space are\nanalyzed here. The efficiency of the quantum heat engines gets a boost with the\nchange in the space structure than the traditional quantum heat engine but the\neffectiveness of the non-commutative parameter is less for the efficiency\ncompared to the COP of the refrigerator. There is a steep boost for the\ncoefficient of performance of the refrigerator cycles for the non-commutative\nspace harmonic oscillator compared to the harmonic oscillator.",
    "authors": [
      "Pritam Chattopadhyay"
    ],
    "publication_date": "2019-11-28T16:02:28Z",
    "arxiv_id": "http://arxiv.org/abs/1911.12766v2",
    "download_url": "http://arxiv.org/abs/1911.12766v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A stochastic heat engine using an active particle",
    "abstract": "The topic of microscopic heat engine has undergone intensive research in\nrecent years. Microscopic heat engines can exploit thermal as well as active\nfluctuations to extract thermodynamic work. We investigate the properties of a\nmicroscopic Stirling's engine that uses an active (self-propelling) particle as\na working substance, in contact with two thermal baths. It is shown that the\npresence of activity leads to an enhanced performance of the engine. The\nefficiency can be improved by increasing the activity strength for all cycle\ntime, including the non-quasistatic regime. We verify that the analytical\nresults agree very well with our simulations. The variation of efficiency with\nthe temperature difference between the two thermal baths has also been\nexplored. The optimum region of operation of the engine has been deduced, by\nusing its efficient power as a quantifier. Finally, a simple model is provided\nthat emulates the behaviour of a flywheel driven by this engine.",
    "authors": [
      "Aradhana Kumari",
      "P. S. Pal",
      "Arnab Saha",
      "Sourabh Lahiri"
    ],
    "publication_date": "2019-12-02T05:58:10Z",
    "arxiv_id": "http://arxiv.org/abs/1912.00585v2",
    "download_url": "http://arxiv.org/abs/1912.00585v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Implementation of a Quantum Engine Fuelled by Information",
    "abstract": "Here, we show the implementation of a complete cycle of a quantum engine\nfuelled by information. This engine is a quantum version of the Szilard engine,\nwhere information is used to extract heat from the environment and fully\nconvert it into work. In our experiment, this work is used to make a weight,\ninitially in the ground state, reach its excited state. We measure the energy\nand the state of each component of the engine, after each step of the cycle,\nand compare them with the theoretical prediction to show that the cycle is\nimplemented with high precision. We also perform experiments to show that the\nengine is well isolated from the environment after the heat extraction, and we\nmeasure the entropy of the weight to show the full conversion of heat into\nwork. Thus, we successfully demonstrate that information can be used as a fuel\nfor single-reservoir engines.",
    "authors": [
      "John P. S. Peterson",
      "Roberto S. Sarthour",
      "Raymond Laflamme"
    ],
    "publication_date": "2020-06-17T20:08:41Z",
    "arxiv_id": "http://arxiv.org/abs/2006.10136v1",
    "download_url": "http://arxiv.org/abs/2006.10136v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-time two-spin quantum Otto engines: shortcuts to adiabaticity vs.\n  irreversibility",
    "abstract": "We propose a quantum Otto cycle in a two spin-$1/2$ anisotropic XY model in a\ntransverse external magnetic field. We first characterize the parameter regime\nthat the working medium operates as an engine in the adiabatic regime. Then, we\nconsider finite-time behavior of the engine with and without utilizing a\nshortcut to adiabaticity (STA) technique. STA schemes guarantee that the\ndynamics of a system follows the adiabatic path, at the expense of introducing\nan external control. We compare the performance of the non-adiabatic and STA\nengines for a fixed adiabatic efficiency but different parameters of the\nworking medium. We observe that, for certain parameter regimes, the\nirreversibility, as measured by the efficiency lags, due to finite-time driving\nis so low that non-adiabatic engine performs quite close to the adiabatic\nengine, leaving the STA engine only marginally better than the non-adiabatic\none. This suggests that by designing the working medium Hamiltonian one may\nspare the difficulty of dealing with an external control protocol.",
    "authors": [
      "Barış Çakmak"
    ],
    "publication_date": "2021-02-23T12:23:50Z",
    "arxiv_id": "http://arxiv.org/abs/2102.11657v2",
    "download_url": "http://arxiv.org/abs/2102.11657v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Boosting quantum battery performance by structure engineering",
    "abstract": "Quantum coherences, correlations and collective effects can be harnessed to\nthe advantage of quantum batteries. Here, we introduce a feasible structure\nengineering scheme that is applicable to spin-based open quantum batteries. Our\nscheme, which builds solely upon a modulation of spin energy gaps, allows\nengineered quantum batteries to exploit spin-spin correlations for mitigating\nenvironment-induced aging. As a result of this advantage, an engineered quantum\nbattery can preserve relatively more energy as compared with its non-engineered\ncounterpart over the course of the storage phase. Particularly, the excess in\nstored energy is independent of system size. This implies a scale-invariant\npassive protection strategy, which we demonstrate on an engineered quantum\nbattery with staggered spin energy gaps. Our findings establish structure\nengineering as a useful route for advancing quantum batteries, and bring new\nperspectives on efficient quantum battery designs.",
    "authors": [
      "Junjie Liu",
      "Dvira Segal"
    ],
    "publication_date": "2021-04-13T21:34:55Z",
    "arxiv_id": "http://arxiv.org/abs/2104.06522v1",
    "download_url": "http://arxiv.org/abs/2104.06522v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The invariant-based shortcut to adiabaticity for qubit heat engine\n  operates under quantum Otto cycle",
    "abstract": "In this paper, we study the role and relevance of the cost for an\ninvariant-based shortcut to adiabaticity enabled qubit heat engine operates in\na quantum Otto cycle. We consider a qubit heat engine with Landau-Zener\nHamiltonian and improve its performance using the Lewis-Riesenfeld\ninvariant-based shortcut to adiabaticity method. Addressing the importance of\ncost for better performance, the paper explores its relationship with the work\nand efficiency of the heat engine. We analyze the cost variation with the time\nduration of non-adiabatic unitary processes involved in the heat engine cycle.\nThe cost required to attain the quasi-static performance of the qubit heat\nengine is also discussed. We found the efficiency lost due to non-adiabaticity\nof the engine can be revived using the shortcut method and it is even possible\nto attain quasi-static performance under finite time with higher cost.",
    "authors": [
      "T. Kiran",
      "M. Ponmurugan"
    ],
    "publication_date": "2022-03-11T13:30:11Z",
    "arxiv_id": "http://arxiv.org/abs/2203.05911v1",
    "download_url": "http://arxiv.org/abs/2203.05911v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effects of the non-Markovianity and non-Gaussianity of active\n  environmental noises on engine performance",
    "abstract": "An active environment is a reservoir containing \\emph{active} materials, such\nas bacteria and Janus particles. Given the self-propelled motion of these\nmaterials, powered by chemical energy, an active environment has unique,\nnonequilibrium environmental noise. Recently, studies on engines that harvest\nenergy from active environments have attracted a great deal of attention\nbecause the theoretical and experimental findings indicate that these engines\noutperform conventional ones. Studies have explored the features of active\nenvironments essential for outperformance, such as the non-Gaussian or\nnon-Markovian nature of the active noise. However, these features have not yet\nbeen systematically investigated in a general setting. Therefore, we\nsystematically study the effects of the non-Gaussianity and non-Markovianity of\nactive noise on engine performance. We show that non-Gaussianity is irrelevant\nto the performance of an engine driven by {any linear force (including a\nharmonic trap) regardless of time dependency}, whereas non-Markovianity is\nrelevant. However, for a system driven by a general nonlinear force, both\nnon-Gaussianity and non-Markovianity enhance engine performance. Also, the\nmemory effect of an active reservoir should be considered when fabricating a\ncyclic engine.",
    "authors": [
      "Jae Sung Lee",
      "Hyunggyu Park"
    ],
    "publication_date": "2021-10-05T06:32:11Z",
    "arxiv_id": "http://arxiv.org/abs/2110.01841v1",
    "download_url": "http://arxiv.org/abs/2110.01841v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Realization of a coupled-mode heat engine with cavity-mediated\n  nanoresonators",
    "abstract": "We report an experimental demonstration of a coupled-mode heat engine in a\ntwo-membrane-in-the-middle cavity optomechanical system. The normal mode of the\ncavity-mediated strongly coupled nanoresonators is utilized as the working\nmedium and an Otto cycle is realized by extracting work between two phononic\nthermal reservoirs. The heat engine performance is characterized in both normal\nmode and bare mode pictures, which reveals that the correlation of two\nmembranes plays a significant role during the thermodynamic cycle. Moreover, a\nstraight-twin nanomechanical engine is implemented by engineering the normal\nmodes and operating two cylinders out-of-phase. Our results demonstrate an\nessential class of heat engine for the first time in cavity optomechanical\nsystems and provide a novel platform for investigating heat engines of\ninteracting subsystems in small scales with controllability and scalability.",
    "authors": [
      "Jiteng Sheng",
      "Cheng Yang",
      "Haibin Wu"
    ],
    "publication_date": "2021-10-25T14:57:12Z",
    "arxiv_id": "http://arxiv.org/abs/2110.13022v1",
    "download_url": "http://arxiv.org/abs/2110.13022v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Maxwell's Demon for Quantum Transport",
    "abstract": "Maxwell's demon can be utilized to construct quantum information engines.\nWhile most of the existing quantum information engines harness thermal\nfluctuations, quantum information engines that utilize quantum fluctuations\nhave recently been discussed. We propose a new type of genuinely quantum\ninformation engine that harnesses quantum fluctuations to achieve cumulative\nstorage of useful work and unidirectional transport of a particle. Our scheme\ndoes not require thermalization, which eliminates the ambiguity in evaluating\nthe power and velocity of our proposed engine in contrast to other existing\nquantum information engines that can transport a particle. We find a tradeoff\nrelationship between the maximum achievable power and the maximum velocity. We\nalso propose an improved definition of efficiency by clarifying all possible\nenergy flows involved in the engine cycle.",
    "authors": [
      "Kangqiao Liu",
      "Masaya Nakagawa",
      "Masahito Ueda"
    ],
    "publication_date": "2023-03-15T02:25:22Z",
    "arxiv_id": "http://arxiv.org/abs/2303.08326v1",
    "download_url": "http://arxiv.org/abs/2303.08326v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The asymmetric Otto engine: frictional effects on performance bounds and\n  operational modes",
    "abstract": "We present a detailed study of an asymmetrically driven quantum Otto engine\nwith a time-dependent harmonic oscillator as its working medium. We obtain\nanalytic expressions for the upper bounds on the efficiency of the engine for\ntwo different driving schemes having asymmetry in the expansion and compression\nwork strokes. We show that the Otto cycle under consideration cannot operate as\na heat engine in the low-temperature regime. Then, we show that the friction in\nthe expansion stroke is significantly more detrimental to the performance of\nthe engine as compared to the friction in the compression stroke. Further, by\ncomparing the performance of the engine with sudden expansion, sudden\ncompression, and both sudden strokes, we uncover a pattern of connections\nbetween the operational points, and we indicate the optimal operation regime\nfor each case. Finally, we analytically characterize the complete phase diagram\nof the Otto cycle for both driving schemes and highlight the different\noperational modes of the cycle as a heat engine, refrigerator, accelerator, and\nheater.",
    "authors": [
      "Varinder Singh",
      "Vahid Shaghaghi",
      "Tanmoy Pandit",
      "Cameron Beetar",
      "Giuliano Benenti",
      "Dario Rosa"
    ],
    "publication_date": "2023-10-10T10:51:01Z",
    "arxiv_id": "http://arxiv.org/abs/2310.06512v1",
    "download_url": "http://arxiv.org/abs/2310.06512v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficiency at maximum $\\dotΩ$ figure of merit of a spin half\n  quantum heat engine in the presence of external magnetic field",
    "abstract": "We consider a finite time quantum heat engine analogous to finite time\nclassical Carnot heat engine with a working substance of spin half particles.\nWe study the efficiency at maximum $\\dot{\\Omega}$ figure of merit of the\nquantum heat engine of spin half particles as a working substance in the\npresence of external magnetic field. The efficiency of this engine at maximum\n$\\dot{\\Omega}$ figure of merit shows anomalous behavior in certain region of\nparticles population levels. Further, we find that the efficiency at maximum\n$\\dot{\\Omega}$ figure exceeds all the known bounds and even approaches the\nCarnot efficiency at finite time. Our study indicates that the population of\nspin half particles plays a crucial role in quantum heat engine whose\ncollective effect in the quantum regime can provide superior engine performance\nwith higher efficiency.",
    "authors": [
      "K. Nilavarasi",
      "M. Ponmurugan"
    ],
    "publication_date": "2023-12-04T07:52:53Z",
    "arxiv_id": "http://arxiv.org/abs/2312.01710v1",
    "download_url": "http://arxiv.org/abs/2312.01710v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Overfitting and Generalization: Energetic Limits on\n  Predictive Complexity",
    "abstract": "Efficiently harvesting thermodynamic resources requires a precise\nunderstanding of their structure. This becomes explicit through the lens of\ninformation engines -- thermodynamic engines that use information as fuel.\nMaximizing the work harvested using available information is a form of\nphysically-instantiated machine learning that drives information engines to\ndevelop complex predictive memory to store an environment's temporal\ncorrelations. We show that an information engine's complex predictive memory\nposes both energetic benefits and risks. While increasing memory facilitates\ndetection of hidden patterns in an environment, it also opens the possibility\nof thermodynamic overfitting, where the engine dissipates additional energy in\ntesting. To address overfitting, we introduce thermodynamic regularizers that\nincur a cost to engine complexity in training due to the physical constraints\non the information engine. We demonstrate that regularized thermodynamic\nmachine learning generalizes effectively. In particular, the physical\nconstraints from which regularizers are derived improve the performance of\nlearned predictive models. This suggests that the laws of physics jointly\ncreate the conditions for emergent complexity and predictive intelligence.",
    "authors": [
      "Alexander B. Boyd",
      "James P. Crutchfield",
      "Mile Gu",
      "Felix C. Binder"
    ],
    "publication_date": "2024-02-26T20:01:29Z",
    "arxiv_id": "http://arxiv.org/abs/2402.16995v1",
    "download_url": "http://arxiv.org/abs/2402.16995v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimizing power and efficiency of a single spin heat engine",
    "abstract": "We study the behavior of a single spin in the presence of a time-varying\nmagnetic field utilizing Glauber dynamics. We engineer the system to function\nas an engine by changing the magnetic field according to specific protocols.\nSubsequently, we analyze the engine's performance using various protocols and\nstochastic thermodynamics to compute average values of crucial quantities for\nquantifying engine performance. In the longtime limit of the engine cycle, we\nderive exact analytical expressions for work, heat, and efficiency in terms of\na generalized protocol. We then analyze the model in terms of optimization of\nefficiency and power. Additionally, we use different protocols and employ a\ngradient descent algorithm to best fit those to obtain optimal efficiency and\nthen optimal power for a finite cycle time. All the protocols converge to the\npiece-wise constant protocol during efficiency optimization. We then explore a\nmore general approach using the variational principle to determine the optimal\nprotocols for optimizing power and efficiency. During the optimization process\nfor both power and efficiency, the net entropy production decreases, which\nenhances the engine's performance. This approach demonstrates the superior\noptimization of efficiency and power in this system compared to the gradient\ndescent algorithm.",
    "authors": [
      "Rita Majumdar",
      "Monojit Chatterjee",
      "Rahul Marathe"
    ],
    "publication_date": "2024-12-13T02:42:20Z",
    "arxiv_id": "http://arxiv.org/abs/2412.09802v1",
    "download_url": "http://arxiv.org/abs/2412.09802v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]