[
  {
    "title": "Lessons Learned from an Experiment in Crowdsourcing Complex Citizen Engineering Tasks with Amazon Mechanical Turk",
    "abstract": "We investigate the feasibility of obtaining highly trustworthy results using crowdsourcing on complex engineering tasks. Crowdsourcing is increasingly seen as a potentially powerful way of increasing the supply of labor for solving society's problems. While applications in domains such as citizen-science, citizen-journalism or knowledge organization (e.g., Wikipedia) have seen many successful applications, there have been fewer applications focused on solving engineering problems, especially those involving complex tasks. This may be in part because of concerns that low quality input into engineering analysis and design could result in failed structures leading to loss of life. We compared the quality of work of the anonymous workers of Amazon Mechanical Turk (AMT), an online crowdsourcing service, with the quality of work of expert engineers in solving the complex engineering task of evaluating virtual wind tunnel data graphs. On this representative complex engineering task, our results showed that there was little difference between expert engineers and crowdworkers in the quality of their work and explained reasons for these results. Along with showing that crowdworkers are effective at completing new complex tasks our paper supplies a number of important lessons that were learned in the process of collecting this data from AMT, which may be of value to other researchers.",
    "authors": [
      "Matthew Staffelbach",
      "Peter Sempolinski",
      "David Hachen",
      "Ahsan Kareem",
      "Tracy Kijewski-Correa",
      "Douglas Thain",
      "Daniel Wei",
      "Greg Madey"
    ],
    "publication_date": "2014-06-30T02:56:30Z",
    "arxiv_id": "http://arxiv.org/abs/1406.7588v1",
    "download_url": "https://arxiv.org/abs/1406.7588v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ground-state cooling of mechanical resonators by quantum reservoir engineering",
    "abstract": "We propose a scheme to cool down a mechanical resonator to its quantum ground-state, which is interacting with a working fluid via an optomechanical-like coupling. As opposed to standard laser cooling schemes where coherence renders the motion of a resonator to its ground-state, we consider an incoherent thermal source to achieve the same aim. We show that simultaneous cooling of two degenerate or near-degenerate mechanical resonators is possible, which is otherwise a challenging goal to achieve. The generalization of this method to the simultaneous cooling of multiple resonators is straightforward. Spectral filtering of the coupling between the cooling agent and the baths is a key to realize cooling in our scheme. The underlying physical mechanism of cooling is explained by investigating a direct connection between the laser sideband cooling and cooling by heating in a standard optomechanical setting. Our advantageous scheme of cooling enabled by quantum reservoir engineering can be realized in various setups, employing parametric coupling of a cooling agent with the target systems. We also discuss using non-thermal baths to simulate ultra-high temperature thermal baths for cooling.",
    "authors": [
      "M. Tahir Naseem",
      "Özgür E. Müstecaplıoğlu"
    ],
    "publication_date": "2020-11-18T19:59:04Z",
    "arxiv_id": "http://arxiv.org/abs/2011.09518v2",
    "download_url": "https://arxiv.org/abs/2011.09518v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some Statistical Mechanical Properties of Photon Black Holes",
    "abstract": "We show that if the total internal energy of a black hole is constructed as the sum of $N$ photons all having a fixed wavelength chosen to scale with the Schwarzschild radius as $λ=αR_{s}$, then $N$ will scale with $R_{s}^{2}$. A statistical mechanical calculation of the configuration proposed yields (α= 4 π^2 / \\ln(2)) and a total entropy of the system $S=k_{B}N \\ln(2)$, in agreement with the Bekenstein entropy of a black hole . It is shown that the critical temperature for Bose-Einstein condensation for relativistic particles of $λ=αR_{s}$ is always well below the Hawking temperature of a black hole, in support of the proposed internal configuration. We then examine our results from the point of view of recent loop quantum gravity ideas and find that a natural consistency of both approaches appears.\n We show that the Jeans criterion for gravitational instability can be generalised to the special and general relativistic regimes and holds for any type of mass--energy distribution.",
    "authors": [
      "X. Hernandez",
      "C. S. Lopez-Monsalvo",
      "S. Mendoza",
      "R. A. Sussman"
    ],
    "publication_date": "2005-07-06T17:06:29Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0507022v3",
    "download_url": "https://arxiv.org/abs/gr-qc/0507022v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Characterising the Anisotropic Mechanical Properties of Excised Human Skin",
    "abstract": "The mechanical properties of skin are important for a number of applications including surgery, dermatology, impact biomechanics and forensic science. In this study we have investigated the influence of location and orientation on the deformation characteristics of 56 samples of excised human skin. Uniaxial tensile tests were carried out at a strain rate of 0.012s$^{-1}$ on skin from the back. Digital Image Correlation was used for 2D strain measurement and a histological examination of the dermis was also performed. The mean ultimate tensile strength (UTS) was 21.6$\\pm$8.4MPa, the mean failure strain 54$\\pm$17%, the mean initial slope 1.18$\\pm$0.88MPa, the mean elastic modulus 83.3$\\pm$34.9MPa and the mean strain energy was 3.6$\\pm$1.6MJ/m$^3$. A multivariate analysis of variance has shown that these mechanical properties of skin are dependent upon the orientation of Langer lines (P$<$0.0001-P=0.046). The location of specimens on the back was also found to have a significant effect on the UTS (P =0.0002), the elastic modulus (P=0.001) and the strain energy (P=0.0052). The histological investigation concluded that there is a definite correlation between the orientation of Langer Lines and the preferred orientation of collagen fibres in the dermis (P$<$0.001). The data obtained in this study will provide essential information for those wishing to model the skin using a structural constitutive model.",
    "authors": [
      "Aisling Ni Annaidh",
      "Karine Bruyere",
      "Michel Destrade",
      "Michael D. Gilchrist",
      "Melanie Ottenio"
    ],
    "publication_date": "2013-02-13T09:06:42Z",
    "arxiv_id": "http://arxiv.org/abs/1302.3022v1",
    "download_url": "https://arxiv.org/abs/1302.3022v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tunable Thermal Conductivity and Mechanical Properties of Metastable Silicon by Phase Engineering",
    "abstract": "The extensive applications of cubic silicon in flexible transistors and infrared detectors are much hindered by its intrinsic properties. Metastable silicon phases, such as Si-III, IV and XII prepared using extreme pressure method, provide a unique \"genetic bank\" with diverse structures and exotic characteristics, however, exploration on their inherent physical properties remains immature. Herein, we demonstrate the phase engineering strategy to modulate the thermal conductivity and mechanical properties of metastable silicon. The thermal conductivity obtained via Raman optothermal approach presents the broad tunability across various Si-I, III, XII and IV phases. The hardness and Young's modulus of Si-IV are remarkably greater than those of Si-III/XII mixture, confirmed by nanoindentation technique. Moreover, it was found that the pressure-induced structural defects can substantially degrade the thermal and mechanical properties of silicon. This systematic investigation can offer feasible route to design novel semiconductors and further advance their desirable applications in advanced nanodevices and mechanical transducers.",
    "authors": [
      "Yubing Du",
      "Guoshuai Du",
      "Zhixi Zhu",
      "Jiaohui Yan",
      "Jiayin Li",
      "Tiansong Zhang",
      "Lina Yang",
      "Ke Jin",
      "Yabin Chen"
    ],
    "publication_date": "2025-03-04T12:39:45Z",
    "arxiv_id": "http://arxiv.org/abs/2503.02561v2",
    "download_url": "https://arxiv.org/abs/2503.02561v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Customizing Spider Silk: Generative Models with Mechanical Property Conditioning for Protein Engineering",
    "abstract": "The remarkable mechanical properties of spider silk, including its tensile strength and extensibility, are primarily governed by the repetitive regions of the proteins that constitute the fiber, the major ampullate spidroins (MaSps). However, establishing correlations between mechanical characteristics and repeat sequences is challenging due to the intricate sequence-structure-function relationships of MaSps and the limited availability of annotated datasets. In this study, we present a novel computational framework for designing MaSp repeat sequences with customizable mechanical properties. To achieve this, we developed a lightweight GPT-based generative model by distilling the pre-trained ProtGPT2 protein language model. The distilled model was subjected to multilevel fine-tuning using curated subsets of the Spider Silkome dataset. Specifically, we adapt the model for MaSp repeat generation using 6,000 MaSp repeat sequences and further refine it with 572 repeats associated with experimentally determined fiber-level mechanical properties. Our model generates biologically plausible MaSp repeat regions tailored to specific mechanical properties while also predicting those properties for given sequences. Validation includes sequence-level analysis, assessing physicochemical attributes and expected distribution of key motifs as well as secondary structure compositions. A correlation study using BLAST on the Spider Silkome dataset and a test set of MaSp repeats with known mechanical properties further confirmed the predictive accuracy of the model. This framework advances the rational design of spider silk-inspired biomaterials, offering a versatile tool for engineering protein sequences with tailored mechanical attributes.",
    "authors": [
      "Neeru Dubey",
      "Elin Karlsson",
      "Miguel Angel Redondo",
      "Johan Reimegård",
      "Anna Rising",
      "Hedvig Kjellström"
    ],
    "publication_date": "2025-04-11T10:55:01Z",
    "arxiv_id": "http://arxiv.org/abs/2504.08437v2",
    "download_url": "https://arxiv.org/abs/2504.08437v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical mode engineering with orthotropic metamaterial membranes",
    "abstract": "Metamaterials are structures engineered at a small scale with respect to the wavelength of the excitations they interact with. These structures behave as artificial materials whose properties can be chosen by design, mocking and even outperforming natural materials and making them the quintessential tool for manipulation of wave systems. In this Letter we show how the acoustic properties of a silicon nitride membrane can be affected by nanopatterning. The degree of asymmetry in the pattern geometry induces an artificial anisotropic elasticity, resulting in the splitting of otherwise degenerate mechanical modes. The artificial material we introduce has a maximum Ledbetter-Migliori anisotropy of 1.568, favorably comparing to most bulk natural crystals. With an additional freedom in defining arbitrary asymmetry axes by pattern rotation, our approach can be useful for fundamental investigation of material properties as well as for devising improved sensors of light, mass or acceleration based on micromechanical resonators.",
    "authors": [
      "G. Conte",
      "L. Vicarelli",
      "S. Zanotto",
      "A. Pitanti"
    ],
    "publication_date": "2022-02-28T12:00:52Z",
    "arxiv_id": "http://arxiv.org/abs/2202.13705v1",
    "download_url": "https://arxiv.org/abs/2202.13705v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical characterization of brain tissue in tension at dynamic strain rates",
    "abstract": "Mechanical characterization of brain tissue at high loading velocities is crucial for modeling Traumatic Brain Injury (TBI). During severe impact conditions, brain tissue experiences compression, tension and shear. Limited experimental data is available for brain tissue in extension at dynamic strain rates. In this research, a High Rate Tension Device (HRTD) was developed to obtain dynamic properties of brain tissue in extension at strain rates of < 90/s. In vitro tensile tests were performed to obtain properties of brain tissue at strain rates of 30, 60 and 90/s up to 30% strain. The brain tissue showed a stiffer response with increasing strain rates, showing that hyperelastic models are not adequate. Specifically, the tensile engineering stress at 30% strain was 3.1 +/- 0.49 kPa, 4.3 +/- 0.86 kPa, 6.5 +/- 0.76 kPa (mean +/- SD) at strain rates of 30, 60 and 90/s, respectively. Force relaxation tests in tension were also conducted at different strain magnitudes (10-60% strain) with the average rise time of 24 ms, which were used to derive time dependent parameters. One-term Ogden, Fung and Gent models were used to obtain material parameters from the experimental data. Numerical simulations were performed using a one-term Ogden model to analyze hyperelastic behavior of brain tissue up to 30% strain. The material parameters obtained in this study will help to develop biofidelic human brain finite element models, which can subsequently be used to predict brain injuries under impact conditions and as a reconstruction and simulation tool for forensic investigations.",
    "authors": [
      "Badar Rashid",
      "Michel Destrade",
      "Michael D. Gilchrist"
    ],
    "publication_date": "2020-08-31T19:06:17Z",
    "arxiv_id": "http://arxiv.org/abs/2009.00974v1",
    "download_url": "https://arxiv.org/abs/2009.00974v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hybrid Mechanical Systems",
    "abstract": "We discuss hybrid systems in which a mechanical oscillator is coupled to another (microscopic) quantum system, such as trapped atoms or ions, solid-state spin qubits, or superconducting devices. We summarize and compare different coupling schemes and describe first experimental implementations. Hybrid mechanical systems enable new approaches to quantum control of mechanical objects, precision sensing, and quantum information processing.",
    "authors": [
      "Philipp Treutlein",
      "Claudiu Genes",
      "Klemens Hammerer",
      "Martino Poggio",
      "Peter Rabl"
    ],
    "publication_date": "2012-10-15T19:59:01Z",
    "arxiv_id": "http://arxiv.org/abs/1210.4151v2",
    "download_url": "https://arxiv.org/abs/1210.4151v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhanced Teaching-Learning-based Optimization for 3D Path Planning of Multicopter UAVs",
    "abstract": "This paper introduces a new path planning algorithm for unmanned aerial vehicles (UAVs) based on the teaching-learning-based optimization (TLBO) technique. We first define an objective function that incorporates requirements on the path length and constraints on the movement and safe operation of UAVs to convert the path planning into an optimization problem. The optimization algorithm named Multi-subject TLBO is then proposed to minimize the formulated objective function. The algorithm is developed based on TLBO but enhanced with new operations including mutation, elite selection and multi-subject training to improve the solution quality and speed up the convergence rate. Comparison with state-of-the-art algorithms and experiments with real UAVs have been conducted to evaluate the performance of the proposed algorithm. The results confirm its validity and effectiveness in generating optimal, collision-free and flyable paths for UAVs in complex operating environments.",
    "authors": [
      "Van Truong Hoang",
      "Manh Duong Phung"
    ],
    "publication_date": "2022-05-31T16:00:32Z",
    "arxiv_id": "http://arxiv.org/abs/2205.15913v1",
    "download_url": "https://arxiv.org/abs/2205.15913v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Developers' Personality in Large-scale Distributed Projects: The Case of the Apache Ecosystem",
    "abstract": "Large-scale distributed projects are typically the results of collective efforts performed by multiple developers, each one having a different personality. The study of developers' personalities has the potential of explaining their' behavior in various contexts. For example, the propensity to trust others, a critical factor to the success of global software engineering - has been found to influence positively the result of code reviews in distributed projects. In this paper, we perform a quantitative analysis of developers' personality in open source software projects, intended as an extreme form of distributed projects in which no single organization controls the project. We mine ecosystem-level data from the code commits and email messages contributed by the developers working on the Apache Software Foundation (ASF) projects, as representative of large scale-distributed projects. We find that developers become over time more conscientious, agreeable, and neurotic. Moreover, personality traits do not vary with their role, membership, and extent of contribution to the projects. We also find evidence that more open and more agreeable developers are more likely to become project contributors.",
    "authors": [
      "Fabio Calefato",
      "Giuseppe Iaffaldano",
      "Filippo Lanubile",
      "Bogdan Vasilescu"
    ],
    "publication_date": "2018-03-03T08:42:08Z",
    "arxiv_id": "http://arxiv.org/abs/1803.01126v4",
    "download_url": "https://arxiv.org/abs/1803.01126v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Critical Incidents for Technology Enhanced Learning in Vocational Education and Training - Observations from the field of mechanical engineering",
    "abstract": "In this study, observations of the Vocational Education and Training (VET) in mechanical engineering companies are carried out. A Learning Management System (LMS) had been developed for the assistance in solving typical task structures, that are used for a period of three and a half years in the apprenticeship. In this study, the Critical Incident Technique (CIT) is applied for the observations. For the subsequent analysis, a classification of incidents is performed. The most important incidents as well as conclusions for Technical Enhanced Learning (TEL) in similar domains are presented.",
    "authors": [
      "Adrian Wilke",
      "Johannes Magenheim"
    ],
    "publication_date": "2019-01-13T21:59:25Z",
    "arxiv_id": "http://arxiv.org/abs/1901.04072v1",
    "download_url": "https://arxiv.org/abs/1901.04072v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Fluids Experiment for Remote Learners to Test the Unsteady Bernoulli Equation Using a Burette",
    "abstract": "The COVID-19 pandemic illuminated the critical need for flexible mechanical engineering laboratories simultaneously deployable in multiple modalities: face-to-face, hybrid, and remote. A key element in the lesson portfolio of a forward-looking engineering instructor is economical, hands-on, accessible, 'turn-key' lab activities; kits that can be deployed both in brick-and-mortar teaching labs and mailed home to remote learners. The Energy Engineering Laboratory Module pedagogy, described elsewhere, provides an underpinning theoretical framework and examples to achieve these features. In addition, instructional lab kits must demonstrate foundational engineering phenomena while maintaining measurement accuracy and fidelity at reasonable cost. In the energy-thermal-fluid sciences, achieving these conditions presents challenges as kits require energy and matter transport and conversion in real time at scales large enough to reveal measurable phenomena but not so large as to become hazardous to users. This paper presents theoretical underpinning and experimental verification of a fluid mechanics lab experiment appropriate for undergraduate engineering students that 1) meets all the above-described criteria, 2) costs less than $30 in materials, and 3) can be easily mailed to remote learners.",
    "authors": [
      "Matthew J. Traum",
      "Luis Enrique Mendoza Zambrano"
    ],
    "publication_date": "2021-08-01T17:44:48Z",
    "arxiv_id": "http://arxiv.org/abs/2108.00510v1",
    "download_url": "https://arxiv.org/abs/2108.00510v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reservoir-Engineered Mechanical Cat States with a Driven Qubit",
    "abstract": "Macroscopic quantum superpositions, such as mechanical Schrödinger cat states, are central to emerging quantum technologies in sensing and bosonic error-correcting codes. We propose a scheme to generate such states by coupling a nanomechanical resonator to a coherently driven two-level system via both transverse and longitudinal interactions. Driving the qubit at twice the oscillator frequency activates resonant two-phonon exchange processes, enabling coherent conversion of drive energy into phonon pairs and their dissipative stabilization. Starting from the full time-dependent Hamiltonian, we derive an effective master equation for the mechanical mode by perturbative elimination of the lossy qubit. The reduced dynamics feature engineered two-phonon loss and a coherent squeezing term, which together drive the resonator into a deterministic Schrödinger-cat state. Our approach requires only a single driven qubit and no auxiliary cavity, offering a scalable and experimentally accessible route to macroscopic quantum superpositions in circuit-QED and related platforms.",
    "authors": [
      "M. Tahir Naseem"
    ],
    "publication_date": "2025-08-14T10:03:29Z",
    "arxiv_id": "http://arxiv.org/abs/2508.10500v1",
    "download_url": "https://arxiv.org/abs/2508.10500v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Certificate-based Single Sign-On Mechanism for Multi-Platform Distributed Systems",
    "abstract": "We propose a certificate-based single sign-on mechanism in distributed systems. The proposed security protocols and authentication mechanisms are integrated in a middleware. The novelty of our middleware lies on the use of XPCOM components, this way we provide a different services that can be used on every platform where Mozilla is available. The componen based architecture of the implemented services allows using the authentication components separately.",
    "authors": [
      "Magyari Attila",
      "Genge Bela",
      "Haller Piroska"
    ],
    "publication_date": "2009-09-09T07:20:05Z",
    "arxiv_id": "http://arxiv.org/abs/0909.1640v1",
    "download_url": "https://arxiv.org/abs/0909.1640v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]