[
  {
    "title": "A Formal Method for Mapping Software Engineering Practices to Essence",
    "abstract": "Essence Framework EF aims at addressing the core problems of software engineering SE and its practices",
    "authors": [
      "Murat Pasa Uysal"
    ],
    "publication_date": "2018-12-04T07:15:06Z",
    "arxiv_id": "http://arxiv.org/abs/1812.01791v1",
    "download_url": "https://arxiv.org/abs/1812.01791v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Investigating the Use of LLMs for Evidence Briefings Generation in Software Engineering",
    "abstract": "[Context] An evidence briefing is a concise and objective transfer medium that can present the main findings of a study to software engineers in the industry. Although practitioners and researchers have deemed Evidence Briefings useful, their production requires manual labor, which may be a significant challenge to their broad adoption. [Goal] The goal of this registered report is to describe an experimental protocol for evaluating LLM-generated evidence briefings for secondary studies in terms of content fidelity, ease of understanding, and usefulness, as perceived by researchers and practitioners, compared to human-made briefings. [Method] We developed an RAG-based LLM tool to generate evidence briefings. We used the tool to automatically generate two evidence briefings that had been manually generated in previous research efforts. We designed a controlled experiment to evaluate how the LLM-generated briefings compare to the human-made ones regarding perceived content fidelity, ease of understanding, and usefulness. [Results] To be reported after the experimental trials. [Conclusion] Depending on the experiment results.",
    "authors": [
      "Mauro Marcelino",
      "Marcos Alves",
      "Bianca Trinkenreich",
      "Bruno Cartaxo",
      "Sérgio Soares",
      "Simone D. J. Barbosa",
      "Marcos Kalinowski"
    ],
    "publication_date": "2025-07-21T17:37:23Z",
    "arxiv_id": "http://arxiv.org/abs/2507.15828v1",
    "download_url": "https://arxiv.org/abs/2507.15828v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Future of Cloud Engineering",
    "abstract": "Ever since the commercial offerings of the Cloud started appearing in 2006, the landscape of cloud computing has been undergoing remarkable changes with the emergence of many different types of service offerings, developer productivity enhancement tools, and new application classes as well as the manifestation of cloud functionality closer to the user at the edge. The notion of utility computing, however, has remained constant throughout its evolution, which means that cloud users always seek to save costs of leasing cloud resources while maximizing their use. On the other hand, cloud providers try to maximize their profits while assuring service-level objectives of the cloud-hosted applications and keeping operational costs low. All these outcomes require systematic and sound cloud engineering principles. The aim of this paper is to highlight the importance of cloud engineering, survey the landscape of best practices in cloud engineering and its evolution, discuss many of the existing cloud engineering advances, and identify both the inherent technical challenges and research opportunities for the future of cloud computing in general and cloud engineering in particular.",
    "authors": [
      "David Bermbach",
      "Abhishek Chandra",
      "Chandra Krintz",
      "Aniruddha Gokhale",
      "Aleksander Slominski",
      "Lauritz Thamsen",
      "Everton Cavalcante",
      "Tian Guo",
      "Ivona Brandic",
      "Rich Wolski"
    ],
    "publication_date": "2021-08-19T13:50:49Z",
    "arxiv_id": "http://arxiv.org/abs/2108.08685v1",
    "download_url": "https://arxiv.org/abs/2108.08685v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Customer Support Ticket Escalation Prediction using Feature Engineering",
    "abstract": "Understanding and keeping the customer happy is a central tenet of requirements engineering. Strategies to gather, analyze, and negotiate requirements are complemented by efforts to manage customer input after products have been deployed. For the latter, support tickets are key in allowing customers to submit their issues, bug reports, and feature requests. If insufficient attention is given to support issues, however, their escalation to management becomes time-consuming and expensive, especially for large organizations managing hundreds of customers and thousands of support tickets. Our work provides a step towards simplifying the job of support analysts and managers, particularly in predicting the risk of escalating support tickets. In a field study at our large industrial partner, IBM, we used a design science research methodology to characterize the support process and data available to IBM analysts in managing escalations. We then implemented these features into a machine learning model to predict support ticket escalations. We trained and evaluated our machine learning model on over 2.5 million support tickets and 10,000 escalations, obtaining a recall of 87.36% and an 88.23% reduction in the workload for support analysts looking to identify support tickets at risk of escalation. Finally, in addition to these research evaluation activities, we compared the performance of our support ticket model with that of a model developed with no feature engineering; the support ticket model features outperformed the non-engineered model. The artifacts created in this research are designed to serve as a starting place for organizations interested in predicting support ticket escalations, and for future researchers to build on to advance research in escalation prediction.",
    "authors": [
      "Lloyd Montgomery",
      "Daniela Damian",
      "Tyson Bulmer",
      "Shaikh Quader"
    ],
    "publication_date": "2020-10-10T15:49:43Z",
    "arxiv_id": "http://arxiv.org/abs/2010.06145v1",
    "download_url": "https://arxiv.org/abs/2010.06145v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering Digital Systems for Humanity: a Research Roadmap",
    "abstract": "As testified by new regulations like the European AI Act, worries about the human and societal impact of (autonomous) software technologies are becoming of public concern. Human, societal, and environmental values, alongside traditional software quality, are increasingly recognized as essential for sustainability and long-term well-being. Traditionally, systems are engineered taking into account business goals and technology drivers. Considering the growing awareness in the community, in this paper, we argue that engineering of systems should also consider human, societal, and environmental drivers. Then, we identify the macro and technological challenges by focusing on humans and their role while co-existing with digital systems. The first challenge considers humans in a proactive role when interacting with digital systems, i.e., taking initiative in making things happen instead of reacting to events. The second concerns humans having a reactive role in interacting with digital systems, i.e., humans interacting with digital systems as a reaction to events. The third challenge focuses on humans with a passive role, i.e., they experience, enjoy or even suffer the decisions and/or actions of digital systems. The fourth challenge concerns the duality of trust and trustworthiness, with humans playing any role. Building on the new human, societal, and environmental drivers and the macro and technological challenges, we identify a research roadmap of digital systems for humanity. The research roadmap is concretized in a number of research directions organized into four groups: development process, requirements engineering, software architecture and design, and verification and validation.",
    "authors": [
      "Marco Autili",
      "Martina De Sanctis",
      "Paola Inverardi",
      "Patrizio Pelliccione"
    ],
    "publication_date": "2024-12-27T14:28:39Z",
    "arxiv_id": "http://arxiv.org/abs/2412.19668v1",
    "download_url": "https://arxiv.org/abs/2412.19668v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Method of Sequential Log-Convex Programming for Engineering Design",
    "abstract": "A method of Sequential Log-Convex Programming (SLCP) is constructed that exploits the log-convex structure present in many engineering design problems. The mathematical structure of Geometric Programming (GP) is combined with the ability of Sequential Quadratic Program (SQP) to accommodate a wide range of objective and constraint functions, resulting in a practical algorithm that can be adopted with little to no modification of existing design practices. Three test problems are considered to demonstrate the SLCP algorithm, comparing it with SQP and the modified Logspace Sequential Quadratic Programming (LSQP). In these cases, SLCP shows up to a 77% reduction in number of iterations compared to SQP, and an 11% reduction compared to LSQP. The airfoil analysis code XFOIL is integrated into one of the case studies to show how SLCP can be used to evolve the fidelity of design problems that have initially been modeled as GP compatible. Finally, a methodology for design based on GP and SLCP is briefly discussed.",
    "authors": [
      "Cody Karcher",
      "Robert Haimes"
    ],
    "publication_date": "2022-01-20T20:07:30Z",
    "arxiv_id": "http://arxiv.org/abs/2201.08436v1",
    "download_url": "https://arxiv.org/abs/2201.08436v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Making Lab Sessions Mandatory -- On Student Work Distribution in a Gamified Project Course on Market-Driven Software Engineering",
    "abstract": "Unfair work distribution in student teams is a common issue in project-based learning. One contributing factor is that students are differently skilled developers. In a course with group work intertwining engineering and business aspects, we designed an intervention to help novice programmers, i.e., we introduced mandatory programming lab sessions. However, the intervention did not affect the work distribution, showing that more is needed to balance the workload. Contrary to our goal, the intervention was very well received among experienced students, but unpopular with students weak at programming.",
    "authors": [
      "Markus Borg"
    ],
    "publication_date": "2020-05-27T17:06:06Z",
    "arxiv_id": "http://arxiv.org/abs/2005.13496v1",
    "download_url": "https://arxiv.org/abs/2005.13496v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Empirical Exploration of ChatGPT's Ability to Support Problem Formulation Tasks for Mission Engineering and a Documentation of its Performance Variability",
    "abstract": "Systems engineering (SE) is evolving with the availability of generative artificial intelligence (AI) and the demand for a systems-of-systems perspective, formalized under the purview of mission engineering (ME) in the US Department of Defense. Formulating ME problems is challenging because they are open-ended exercises that involve translation of ill-defined problems into well-defined ones that are amenable for engineering development. It remains to be seen to which extent AI could assist problem formulation objectives. To that end, this paper explores the quality and consistency of multi-purpose Large Language Models (LLM) in supporting ME problem formulation tasks, specifically focusing on stakeholder identification. We identify a relevant reference problem, a NASA space mission design challenge, and document ChatGPT-3.5's ability to perform stakeholder identification tasks. We execute multiple parallel attempts and qualitatively evaluate LLM outputs, focusing on both their quality and variability. Our findings portray a nuanced picture. We find that the LLM performs well in identifying human-focused stakeholders but poorly in recognizing external systems and environmental factors, despite explicit efforts to account for these. Additionally, LLMs struggle with preserving the desired level of abstraction and exhibit a tendency to produce solution specific outputs that are inappropriate for problem formulation. More importantly, we document great variability among parallel threads, highlighting that LLM outputs should be used with caution, ideally by adopting a stochastic view of their abilities. Overall, our findings suggest that, while ChatGPT could reduce some expert workload, its lack of consistency and domain understanding may limit its reliability for problem formulation tasks.",
    "authors": [
      "Max Ofsa",
      "Taylan G. Topcu"
    ],
    "publication_date": "2025-02-05T17:58:23Z",
    "arxiv_id": "http://arxiv.org/abs/2502.03511v1",
    "download_url": "https://arxiv.org/abs/2502.03511v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Phase Transitions of Civil Unrest across Countries and Time",
    "abstract": "Phase transitions, characterized by abrupt shifts between macroscopic patterns of organization, are ubiquitous in complex systems. Despite considerable research in the physical and natural sciences, the empirical study of this phenomenon in societal systems is relatively underdeveloped. The goal of this study is to explore whether the dynamics of collective civil unrest can be plausibly characterized as a sequence of recurrent phase shifts, with each phase having measurable and identifiable latent characteristics. Building on previous efforts to characterize civil unrest as a self-organized critical system, we introduce a macro-level statistical model of civil unrest and evaluate its plausibility using a comprehensive dataset of civil unrest events in 170 countries from 1946 to 2017. Our findings demonstrate that the macro-level phase model effectively captures the characteristics of civil unrest data from diverse countries globally and that universal mechanisms may underlie certain aspects of the dynamics of civil unrest. We also introduce a scale to quantify a country's long-term unrest per unit of time and show that civil unrest events tend to cluster geographically, with the magnitude of civil unrest concentrated in specific regions. Our approach has the potential to identify and measure phase transitions in various collective human phenomena beyond civil unrest, contributing to a better understanding of complex social systems.",
    "authors": [
      "Dan Braha"
    ],
    "publication_date": "2023-06-14T18:38:32Z",
    "arxiv_id": "http://arxiv.org/abs/2306.08698v4",
    "download_url": "https://arxiv.org/abs/2306.08698v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring Opportunities in Usable Hazard Analysis Processes for AI Engineering",
    "abstract": "Embedding artificial intelligence into systems introduces significant challenges to modern engineering practices. Hazard analysis tools and processes have not yet been adequately adapted to the new paradigm. This paper describes initial research and findings regarding current practices in AI-related hazard analysis and on the tools used to conduct this work. Our goal with this initial research is to better understand the needs of practitioners and the emerging challenges of considering hazards and risks for AI-enabled products and services. Our primary research question is: Can we develop new structured thinking methods and systems engineering tools to support effective and engaging ways for preemptively considering failure modes in AI systems? The preliminary findings from our review of the literature and interviews with practitioners highlight various challenges around integrating hazard analysis into modern AI development processes and suggest opportunities for exploration of usable, human-centered hazard analysis tools.",
    "authors": [
      "Nikolas Martelaro",
      "Carol J. Smith",
      "Tamara Zilovic"
    ],
    "publication_date": "2022-03-29T14:49:46Z",
    "arxiv_id": "http://arxiv.org/abs/2203.15628v1",
    "download_url": "https://arxiv.org/abs/2203.15628v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Industrial Engineering with Large Language Models: A case study of ChatGPT's performance on Oil & Gas problems",
    "abstract": "Large Language Models (LLMs) have shown great potential in solving complex problems in various fields, including oil and gas engineering and other industrial engineering disciplines like factory automation, PLC programming etc. However, automatic identification of strong and weak solutions to fundamental physics equations governing several industrial processes remain a challenging task. This paper identifies the limitation of current LLM approaches, particularly ChatGPT in selected practical problems native to oil and gas engineering but not exclusively. The performance of ChatGPT in solving complex problems in oil and gas engineering is discussed and the areas where LLMs are most effective are presented.",
    "authors": [
      "Oluwatosin Ogundare",
      "Srinath Madasu",
      "Nathanial Wiggins"
    ],
    "publication_date": "2023-04-27T17:33:49Z",
    "arxiv_id": "http://arxiv.org/abs/2304.14354v1",
    "download_url": "https://arxiv.org/abs/2304.14354v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Divide and Conquer the EmpiRE: A Community-Maintainable Knowledge Graph of Empirical Research in Requirements Engineering",
    "abstract": "[Background.] Empirical research in requirements engineering (RE) is a constantly evolving topic, with a growing number of publications. Several papers address this topic using literature reviews to provide a snapshot of its \"current\" state and evolution. However, these papers have never built on or updated earlier ones, resulting in overlap and redundancy. The underlying problem is the unavailability of data from earlier works. Researchers need technical infrastructures to conduct sustainable literature reviews. [Aims.] We examine the use of the Open Research Knowledge Graph (ORKG) as such an infrastructure to build and publish an initial Knowledge Graph of Empirical research in RE (KG-EmpiRE) whose data is openly available. Our long-term goal is to continuously maintain KG-EmpiRE with the research community to synthesize a comprehensive, up-to-date, and long-term available overview of the state and evolution of empirical research in RE. [Method.] We conduct a literature review using the ORKG to build and publish KG-EmpiRE which we evaluate against competency questions derived from a published vision of empirical research in software (requirements) engineering for 2020 - 2025. [Results.] From 570 papers of the IEEE International Requirements Engineering Conference (2000 - 2022), we extract and analyze data on the reported empirical research and answer 16 out of 77 competency questions. These answers show a positive development towards the vision, but also the need for future improvements. [Conclusions.] The ORKG is a ready-to-use and advanced infrastructure to organize data from literature reviews as knowledge graphs. The resulting knowledge graphs make the data openly available and maintainable by research communities, enabling sustainable literature reviews.",
    "authors": [
      "Oliver Karras",
      "Felix Wernlein",
      "Jil Klünder",
      "Sören Auer"
    ],
    "publication_date": "2023-06-29T08:55:35Z",
    "arxiv_id": "http://arxiv.org/abs/2306.16791v1",
    "download_url": "https://arxiv.org/abs/2306.16791v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Chaos Engineering System for Live Analysis and Falsification of Exception-handling in the JVM",
    "abstract": "Software systems contain resilience code to handle those failures and unexpected events happening in production. It is essential for developers to understand and assess the resilience of their systems. Chaos engineering is a technology that aims at assessing resilience and uncovering weaknesses by actively injecting perturbations in production. In this paper, we propose a novel design and implementation of a chaos engineering system in Java called ChaosMachine. It provides a unique and actionable analysis on exception-handling capabilities in production, at the level of try-catch blocks. To evaluate our approach, we have deployed ChaosMachine on top of 3 large-scale and well-known Java applications totaling 630k lines of code. Our results show that ChaosMachine reveals both strengths and weaknesses of the resilience code of a software system at the level of exception handling.",
    "authors": [
      "Long Zhang",
      "Brice Morin",
      "Philipp Haller",
      "Benoit Baudry",
      "Martin Monperrus"
    ],
    "publication_date": "2018-05-14T15:50:36Z",
    "arxiv_id": "http://arxiv.org/abs/1805.05246v5",
    "download_url": "https://arxiv.org/abs/1805.05246v5",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Development of recommendation systems for software engineering: the CROSSMINER experience",
    "abstract": "To perform their daily tasks, developers intensively make use of existing resources by consulting open-source software (OSS) repositories. Such platforms contain rich data sources, e.g., code snippets, documentation, and user discussions, that can be useful for supporting development activities. Over the last decades, several techniques and tools have been promoted to provide developers with innovative features, aiming to bring in improvements in terms of development effort, cost savings, and productivity. In the context of the EU H2020 CROSSMINER project, a set of recommendation systems has been conceived to assist software programmers in different phases of the development process. The systems provide developers with various artifacts, such as third-party libraries, documentation about how to use the APIs being adopted, or relevant API function calls. To develop such recommendations, various technical choices have been made to overcome issues related to several aspects including the lack of baselines, limited data availability, decisions about the performance measures, and evaluation approaches. This paper is an experience report to present the knowledge pertinent to the set of recommendation systems developed through the CROSSMINER project. We explain in detail the challenges we had to deal with, together with the related lessons learned when developing and evaluating these systems. Our aim is to provide the research community with concrete takeaway messages that are expected to be useful for those who want to develop or customize their own recommendation systems. The reported experiences can facilitate interesting discussions and research work, which in the end contribute to the advancement of recommendation systems applied to solve different issues in Software Engineering.",
    "authors": [
      "Juri Di Rocco",
      "Davide Di Ruscio",
      "Claudio Di Sipio",
      "Phuong T. Nguyen",
      "Riccardo Rubei"
    ],
    "publication_date": "2021-03-11T22:19:50Z",
    "arxiv_id": "http://arxiv.org/abs/2103.06987v1",
    "download_url": "https://arxiv.org/abs/2103.06987v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A longitudinal case study on the effects of an evidence-based software engineering training",
    "abstract": "Context: Evidence-based software engineering (EBSE) can be an effective resource to bridge the gap between academia and industry by balancing research of practical relevance and academic rigor. To achieve this, it seems necessary to investigate EBSE training and its benefits for the practice. Objective: We sought both to develop an EBSE training course for university students and to investigate what effects it has on the attitudes and behaviors of the trainees. Method: We conducted a longitudinal case study to study our EBSE course and its effects. For this, we collect data at the end of each EBSE course (2017, 2018, and 2019), and in two follow-up surveys (one after 7 months of finishing the last course, and a second after 21 months). Results: Our EBSE courses seem to have taught students adequately and consistently. Half of the respondents to the surveys report making use of the new skills from the course. The most-reported effects in both surveys indicated that EBSE concepts increase awareness of the value of research and evidence and EBSE methods improve information gathering skills. Conclusions: As suggested by research in other areas, training appears to play a key role in the adoption of evidence-based practice. Our results indicate that our training method provides an introduction to EBSE suitable for undergraduates. However, we believe it is necessary to continue investigating EBSE training and its impact on software engineering practice.",
    "authors": [
      "Sebastián Pizard",
      "Diego Vallespir",
      "Barbara Kitchenham"
    ],
    "publication_date": "2022-02-07T17:26:58Z",
    "arxiv_id": "http://arxiv.org/abs/2202.03367v1",
    "download_url": "https://arxiv.org/abs/2202.03367v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Universal Model of Global Civil Unrest",
    "abstract": "Civil unrest is a powerful form of collective human dynamics, which has led to major transitions of societies in modern history. The study of collective human dynamics, including collective aggression, has been the focus of much discussion in the context of modeling and identification of universal patterns of behavior. In contrast, the possibility that civil unrest activities, across countries and over long time periods, are governed by universal mechanisms has not been explored. Here, we analyze records of civil unrest of 170 countries during the period 1919-2008. We demonstrate that the distributions of the number of unrest events per year are robustly reproduced by a nonlinear, spatially extended dynamical model, which reflects the spread of civil disorder between geographic regions connected through social and communication networks. The results also expose the similarity between global social instability and the dynamics of natural hazards and epidemics.",
    "authors": [
      "Dan Braha"
    ],
    "publication_date": "2012-06-21T19:17:04Z",
    "arxiv_id": "http://arxiv.org/abs/1207.0739v1",
    "download_url": "https://arxiv.org/abs/1207.0739v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bridging the Quantum Divide: Aligning Academic and Industry Goals in Software Engineering",
    "abstract": "This position paper examines the substantial divide between academia and industry within quantum software engineering. For example, while academic research related to debugging and testing predominantly focuses on a limited subset of primarily quantum-specific issues, industry practitioners face a broader range of practical concerns, including software integration, compatibility, and real-world implementation hurdles. This disconnect mainly arises due to academia's limited access to industry practices and the often confidential, competitive nature of quantum development in commercial settings. As a result, academic advancements often fail to translate into actionable tools and methodologies that meet industry needs. By analyzing discussions within quantum developer forums, we identify key gaps in focus and resource availability that hinder progress on both sides. We propose collaborative efforts aimed at developing practical tools, methodologies, and best practices to bridge this divide, enabling academia to address the application-driven needs of industry and fostering a more aligned, sustainable ecosystem for quantum software development.",
    "authors": [
      "Jake Zappin",
      "Trevor Stalnaker",
      "Oscar Chaparro",
      "Denys Poshyvanyk"
    ],
    "publication_date": "2025-02-10T20:17:41Z",
    "arxiv_id": "http://arxiv.org/abs/2502.07014v1",
    "download_url": "https://arxiv.org/abs/2502.07014v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Guigle: A GUI Search Engine for Android Apps",
    "abstract": "The process of developing a mobile application typically starts with the ideation and conceptualization of its user interface. This concept is then translated into a set of mock-ups to help determine how well the user interface embodies the intended features of the app. After the creation of mock-ups developers then translate it into an app that runs in a mobile device. In this paper we propose an approach, called GUIGLE, that aims to facilitate the process of conceptualizing the user interface of an app through GUI search. GUIGLE indexes GUI images and metadata extracted using automated dynamic analysis on a large corpus of apps extracted from Google Play. To perform a search, our approach uses information from text displayed on a screen, user interface components, the app name, and screen color palettes to retrieve relevant screens given a query. Furthermore, we provide a lightweight query language that allows for intuitive search of screens. We evaluate GUIGLE with real users and found that, on average, 68.8% of returned screens were relevant to the specified query. Additionally, users found the various different features of GUIGLE useful, indicating that our search engine provides an intuitive user experience. Finally, users agree that the information presented by GUIGLE is useful in conceptualizing the design of new screens for applications.",
    "authors": [
      "Carlos Bernal-Cardenas",
      "Kevin Moran",
      "Michele Tufano",
      "Zichang Liu",
      "Linyong Nan",
      "Zhehan Shi",
      "Denys Poshyvanyk"
    ],
    "publication_date": "2019-01-03T19:44:10Z",
    "arxiv_id": "http://arxiv.org/abs/1901.00891v1",
    "download_url": "https://arxiv.org/abs/1901.00891v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SeeAction: Towards Reverse Engineering How-What-Where of HCI Actions from Screencasts for UI Automation",
    "abstract": "UI automation is a useful technique for UI testing, bug reproduction, and robotic process automation. Recording user actions with an application assists rapid development of UI automation scripts, but existing recording techniques are intrusive, rely on OS or GUI framework accessibility support, or assume specific app implementations. Reverse engineering user actions from screencasts is non-intrusive, but a key reverse-engineering step is currently missing - recognizing human-understandable structured user actions ([command] [widget] [location]) from action screencasts. To fill the gap, we propose a deep learning-based computer vision model that can recognize 11 commands and 11 widgets, and generate location phrases from action screencasts, through joint learning and multi-task learning. We label a large dataset with 7260 video-action pairs, which record user interactions with Word, Zoom, Firefox, Photoshop, and Windows 10 Settings. Through extensive experiments, we confirm the effectiveness and generality of our model, and demonstrate the usefulness of a screencast-to-action-script tool built upon our model for bug reproduction.",
    "authors": [
      "Dehai Zhao",
      "Zhenchang Xing",
      "Qinghua Lu",
      "Xiwei Xu",
      "Liming Zhu"
    ],
    "publication_date": "2025-03-17T07:07:38Z",
    "arxiv_id": "http://arxiv.org/abs/2503.12873v1",
    "download_url": "https://arxiv.org/abs/2503.12873v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Trustworthy Sentiment Analysis in Software Engineering: Dataset Characteristics and Tool Selection",
    "abstract": "Software development relies heavily on text-based communication, making sentiment analysis a valuable tool for understanding team dynamics and supporting trustworthy AI-driven analytics in requirements engineering. However, existing sentiment analysis tools often perform inconsistently across datasets from different platforms, due to variations in communication style and content.\n  In this study, we analyze linguistic and statistical features of 10 developer communication datasets from five platforms and evaluate the performance of 14 sentiment analysis tools. Based on these results, we propose a mapping approach and questionnaire that recommends suitable sentiment analysis tools for new datasets, using their characteristic features as input.\n  Our results show that dataset characteristics can be leveraged to improve tool selection, as platforms differ substantially in both linguistic and statistical properties. While transformer-based models such as SetFit and RoBERTa consistently achieve strong results, tool effectiveness remains context-dependent. Our approach supports researchers and practitioners in selecting trustworthy tools for sentiment analysis in software engineering, while highlighting the need for ongoing evaluation as communication contexts evolve.",
    "authors": [
      "Martin Obaidi",
      "Marc Herrmann",
      "Jil Klünder",
      "Kurt Schneider"
    ],
    "publication_date": "2025-07-02T20:50:25Z",
    "arxiv_id": "http://arxiv.org/abs/2507.02137v2",
    "download_url": "https://arxiv.org/abs/2507.02137v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fundamentals of Atmospheric Physics for Engineering",
    "abstract": "We present the proposal of an elective for engineering courses, designed to train professionals with a solid foundation in Physics of the Atmosphere interested in environmental and sustainability issues broadly. We propose four chapters that contain a variety of topics but strongly interrelated, which correspond to three main areas: nature of the atmosphere and meteorology relevant to contaminant transport, the dispersion of air pollutants and climate in general. We conclude that it is possible train engineers who understand the basic mechanisms that led to the current atmosphere, atmospheric processes related to local and global climate, the dispersion of air pollutants and key concepts such as solar activity, climatic change and climatic variability, even in one semester. It also discusses the relationship with other subjects and proposes and illustrates a method of course approval based on the performance of work directly applicable to engineering problems.",
    "authors": [
      "Rodolfo G Cionco"
    ],
    "publication_date": "2012-08-18T16:57:53Z",
    "arxiv_id": "http://arxiv.org/abs/1208.3765v2",
    "download_url": "https://arxiv.org/abs/1208.3765v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enumeration and Identification of Unique 3D Spatial Topologies of Interconnected Engineering Systems Using Spatial Graphs",
    "abstract": "Systematic enumeration and identification of unique 3D spatial topologies of complex engineering systems (such as automotive cooling systems, electric power trains, satellites, and aero-engines) are essential to navigation of these expansive design spaces with the goal of identifying new spatial configurations that can satisfy challenging system requirements. However, efficient navigation through discrete 3D spatial topology (ST) options is a very challenging problem due to its combinatorial nature and can quickly exceed human cognitive abilities at even moderate complexity levels. This article presents a new, efficient, and scalable design framework that leverages mathematical spatial graph theory to represent, enumerate, and identify distinctive 3D topological classes for a generic 3D engineering system, given its system architecture (SA) -- its components and their interconnections. First, spatial graph diagrams (SGDs) are generated for a given SA from zero to a specified maximum number of interconnect crossings. Then, corresponding Yamada polynomials for all the planar SGDs are generated. SGDs are categorized into topological classes, each of which shares a unique Yamada polynomial. Finally, within each topological class, 3D geometric models are generated using the spatial graph diagrams (SGDs) having different numbers of interconnect crossings. Selected case studies are presented to illustrate the different features of our proposed framework, including an industrial engineering design application: ST enumeration of a 3D automotive fuel cell cooling system (AFCS). Design guidelines are also provided for practicing engineers to aid the application of this framework to different types of real-world problems such as configuration design and spatial packaging optimization.",
    "authors": [
      "Satya R. T. Peddada",
      "Nathan M. Dunfield",
      "Lawrence E. Zeidner",
      "Zane R. Givans",
      "Kai A. James",
      "James T. Allison"
    ],
    "publication_date": "2021-07-29T03:20:54Z",
    "arxiv_id": "http://arxiv.org/abs/2107.13724v2",
    "download_url": "https://arxiv.org/abs/2107.13724v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering Educational Experience in Building an Intelligent Tutoring System",
    "abstract": "The growing number of students enrolling in Computer Science (CS) programmes is pushing CS educators to their limits. This poses significant challenges to computing education, particularly the teaching of introductory programming and advanced software engineering (SE) courses. First-year programming courses often face overwhelming enrollments, including interdisciplinary students who are not CS majors. The high teacher-to-student ratio makes it challenging to provide timely and high-quality feedback. Meanwhile, software engineering education comes with inherent difficulties like acquiring industry partners and the dilemma that such software projects are often under or over-specified and one-time efforts within one team or one course. To address these challenges, we designed a novel foundational SE course. This SE course envisions building a full-fledged Intelligent Tutoring System (ITS) of Programming Assignments to provide automated, real-time feedback for novice students in programming courses over multiple years. Each year, SE students contribute to specific short-running SE projects that improve the existing ITS implementation, while at the same time, we can deploy the ITS for usage by students for learning programming. This project setup builds awareness among SE students about their contribution to a \"to-be-deployed\" software project. In this multi-year teaching effort, we have incrementally built an ITS that is now deployed in various programming courses. This paper discusses the Intelligent Tutoring System architecture, our teaching concept in the SE course, our experience with the built ITS, and our view of future computing education.",
    "authors": [
      "Zhiyu Fan",
      "Yannic Noller",
      "Ashish Dandekar",
      "Abhik Roychoudhury"
    ],
    "publication_date": "2023-10-09T07:28:41Z",
    "arxiv_id": "http://arxiv.org/abs/2310.05472v3",
    "download_url": "https://arxiv.org/abs/2310.05472v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Research Software Engineers: Career Entry Points and Training Gaps",
    "abstract": "As software has become more essential to research across disciplines, and as the recognition of this fact has grown, the importance of professionalizing the development and maintenance of this software has also increased. The community of software professionals who work on this software have come together under the title Research Software Engineer (RSE) over the last decade. This has led to the formalization of RSE roles and organized RSE groups in universities, national labs, and industry. This, in turn, has created the need to understand how RSEs come into this profession and into these groups, how to further promote this career path to potential members, as well as the need to understand what training gaps need to be filled for RSEs coming from different entry points. We have categorized three main classifications of entry paths into the RSE profession and identified key elements, both advantages and disadvantages, that should be acknowledged and addressed by the broader research community in order to attract and retain a talented and diverse pool of future RSEs.",
    "authors": [
      "Ian A. Cosden",
      "Kenton McHenry",
      "Daniel S. Katz"
    ],
    "publication_date": "2022-10-09T14:40:32Z",
    "arxiv_id": "http://arxiv.org/abs/2210.04275v2",
    "download_url": "https://arxiv.org/abs/2210.04275v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data Engineering for the Analysis of Semiconductor Manufacturing Data",
    "abstract": "We have analyzed manufacturing data from several different semiconductor manufacturing plants, using decision tree induction software called Q-YIELD. The software generates rules for predicting when a given product should be rejected. The rules are intended to help the process engineers improve the yield of the product, by helping them to discover the causes of rejection. Experience with Q-YIELD has taught us the importance of data engineering -- preprocessing the data to enable or facilitate decision tree induction. This paper discusses some of the data engineering problems we have encountered with semiconductor manufacturing data. The paper deals with two broad classes of problems: engineering the features in a feature vector representation and engineering the definition of the target concept (the classes). Manufacturing process data present special problems for feature engineering, since the data have multiple levels of granularity (detail, resolution). Engineering the target concept is important, due to our focus on understanding the past, as opposed to the more common focus in machine learning on predicting the future.",
    "authors": [
      "Peter D. Turney"
    ],
    "publication_date": "2002-12-12T19:11:11Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0212040v1",
    "download_url": "https://arxiv.org/abs/cs/0212040v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "GUing: A Mobile GUI Search Engine using a Vision-Language Model",
    "abstract": "Graphical User Interfaces (GUIs) are central to app development projects. App developers may use the GUIs of other apps as a means of requirements refinement and rapid prototyping or as a source of inspiration for designing and improving their own apps. Recent research has thus suggested retrieving relevant GUI designs that match a certain text query from screenshot datasets acquired through crowdsourced or automated exploration of GUIs. However, such text-to-GUI retrieval approaches only leverage the textual information of the GUI elements, neglecting visual information such as icons or background images. In addition, retrieved screenshots are not steered by app developers and lack app features that require particular input data.\n  To overcome these limitations, this paper proposes GUing, a GUI search engine based on a vision-language model called GUIClip, which we trained specifically for the problem of designing app GUIs. For this, we first collected from Google Play app introduction images which display the most representative screenshots and are often captioned (i.e.~labelled) by app vendors. Then, we developed an automated pipeline to classify, crop, and extract the captions from these images. This resulted in a large dataset which we share with this paper: including 303k app screenshots, out of which 135k have captions. We used this dataset to train a novel vision-language model, which is, to the best of our knowledge, the first of its kind for GUI retrieval. We evaluated our approach on various datasets from related work and in a manual experiment. The results demonstrate that our model outperforms previous approaches in text-to-GUI retrieval achieving a Recall@10 of up to 0.69 and a HIT@10 of 0.91. We also explored the performance of GUIClip for other GUI tasks including GUI classification and sketch-to-GUI retrieval with encouraging results.",
    "authors": [
      "Jialiang Wei",
      "Anne-Lise Courbis",
      "Thomas Lambolais",
      "Binbin Xu",
      "Pierre Louis Bernard",
      "Gérard Dray",
      "Walid Maalej"
    ],
    "publication_date": "2024-04-30T18:42:18Z",
    "arxiv_id": "http://arxiv.org/abs/2405.00145v3",
    "download_url": "https://arxiv.org/abs/2405.00145v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Impostor Phenomenon Among Software Engineers: Investigating Gender Differences and Well-Being",
    "abstract": "Research shows that more than half of software professionals experience the Impostor Phenomenon (IP), with a notably higher prevalence among women compared to men. IP can lead to mental health consequences, such as depression and burnout, which can significantly impact personal well-being and software professionals' productivity. This study investigates how IP manifests among software professionals across intersections of gender with race/ethnicity, marital status, number of children, age, and professional experience. Additionally, it examines the well-being of software professionals experiencing IP, providing insights into the interplay between these factors. We analyzed data collected through a theory-driven survey (n = 624) that used validated psychometric instruments to measure IP and well-being in software engineering professionals. We explored the prevalence of IP in the intersections of interest. Additionally, we applied bootstrapping to characterize well-being within our field and statistically tested whether professionals of different genders suffering from IP have lower well-being. The results show that IP occurs more frequently in women and that the prevalence is particularly high among black women as well as among single and childless women. Furthermore, regardless of gender, software engineering professionals suffering from IP have significantly lower well-being. Our findings indicate that effective IP mitigation strategies are needed to improve the well-being of software professionals. Mitigating IP would have particularly positive effects on the well-being of women, who are more frequently affected by IP.",
    "authors": [
      "Paloma Guenes",
      "Rafael Tomaz",
      "Bianca Trinkenreich",
      "Maria Teresa Baldassarre",
      "Margarte-Anne Storey",
      "Marcos Kalinowski"
    ],
    "publication_date": "2025-02-11T19:36:44Z",
    "arxiv_id": "http://arxiv.org/abs/2502.07914v1",
    "download_url": "https://arxiv.org/abs/2502.07914v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Orchestration of Global Software Engineering Projects",
    "abstract": "Global software engineering has become a fact in many companies due to real necessity in practice. In contrast to co-located projects global projects face a number of additional software engineering challenges. Among them quality management has become much more difficult and schedule and budget overruns can be observed more often. Compared to co-located projects global software engineering is even more challenging due to the need for integration of different cultures, different languages, and different time zones - across companies, and across countries. The diversity of development locations on several levels seriously endangers an effective and goal-oriented progress of projects. In this position paper we discuss reasons for global development, sketch settings for distribution and views of orchestration of dislocated companies in a global project that can be seen as a \"virtual project environment\". We also present a collection of questions, which we consider relevant for global software engineering. The questions motivate further discussion to derive a research agenda in global software engineering.",
    "authors": [
      "Christian Bartelt",
      "Manfred Broy",
      "Christoph Herrmann",
      "Eric Knauss",
      "Marco Kuhrmann",
      "Andreas Rausch",
      "Bernhard Rumpe",
      "Kurt Schneider"
    ],
    "publication_date": "2014-09-22T12:02:49Z",
    "arxiv_id": "http://arxiv.org/abs/1409.6587v1",
    "download_url": "https://arxiv.org/abs/1409.6587v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Benchmarking AI Models in Software Engineering: A Review, Search Tool, and Unified Approach for Elevating Benchmark Quality",
    "abstract": "Benchmarks are essential for unified evaluation and reproducibility. The rapid rise of Artificial Intelligence for Software Engineering (AI4SE) has produced numerous benchmarks for tasks such as code generation and bug repair. However, this proliferation has led to major challenges: (1) fragmented knowledge across tasks, (2) difficulty in selecting contextually relevant benchmarks, (3) lack of standardization in benchmark creation, and (4) flaws that limit utility. Addressing these requires a dual approach: systematically mapping existing benchmarks for informed selection and defining unified guidelines for robust, adaptable benchmark development.\n  We conduct a review of 247 studies, identifying 273 AI4SE benchmarks since 2014. We categorize them, analyze limitations, and expose gaps in current practices. Building on these insights, we introduce BenchScout, an extensible semantic search tool for locating suitable benchmarks. BenchScout employs automated clustering with contextual embeddings of benchmark-related studies, followed by dimensionality reduction. In a user study with 22 participants, BenchScout achieved usability, effectiveness, and intuitiveness scores of 4.5, 4.0, and 4.1 out of 5.\n  To improve benchmarking standards, we propose BenchFrame, a unified framework for enhancing benchmark quality. Applying BenchFrame to HumanEval yielded HumanEvalNext, featuring corrected errors, improved language conversion, higher test coverage, and greater difficulty. Evaluating 10 state-of-the-art code models on HumanEval, HumanEvalPlus, and HumanEvalNext revealed average pass-at-1 drops of 31.22% and 19.94%, respectively, underscoring the need for continuous benchmark refinement. We further examine BenchFrame's scalability through an agentic pipeline and confirm its generalizability on the MBPP dataset. All review data, user study materials, and enhanced benchmarks are publicly released.",
    "authors": [
      "Roham Koohestani",
      "Philippe de Bekker",
      "Begüm Koç",
      "Maliheh Izadi"
    ],
    "publication_date": "2025-03-07T18:44:32Z",
    "arxiv_id": "http://arxiv.org/abs/2503.05860v3",
    "download_url": "https://arxiv.org/abs/2503.05860v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Assessment of Off-the-Shelf SE-specific Sentiment Analysis Tools: An Extended Replication Study",
    "abstract": "Sentiment analysis methods have become popular for investigating human communication, including discussions related to software projects. Since general-purpose sentiment analysis tools do not fit well with the information exchanged by software developers, new tools, specific for software engineering (SE), have been developed. We investigate to what extent SE-specific tools for sentiment analysis mitigate the threats to conclusion validity of empirical studies in software engineering, highlighted by previous research. First, we replicate two studies addressing the role of sentiment in security discussions on GitHub and in question-writing on Stack Overflow. Then, we extend the previous studies by assessing to what extent the tools agree with each other and with the manual annotation on a gold standard of 600 documents. We find that different SE-specific sentiment analysis tools might lead to contradictory results at a fine-grain level, when used 'off-the-shelf'. Conversely, platform-specific tuning or retraining might be needed to take into account differences in platform conventions, jargon, or document lengths.",
    "authors": [
      "Nicole Novielli",
      "Fabio Calefato",
      "Filippo Lanubile",
      "Alexander Serebrenik"
    ],
    "publication_date": "2020-10-20T10:10:19Z",
    "arxiv_id": "http://arxiv.org/abs/2010.10172v2",
    "download_url": "https://arxiv.org/abs/2010.10172v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Apples, Oranges, and Software Engineering: Study Selection Challenges for Secondary Research on Latent Variables",
    "abstract": "Software engineering (SE) is full of abstract concepts that are crucial for both researchers and practitioners, such as programming experience, team productivity, code comprehension, and system security. Secondary studies aimed at summarizing research on the influences and consequences of such concepts would therefore be of great value.\n  However, the inability to measure abstract concepts directly poses a challenge for secondary studies: primary studies in SE can operationalize such concepts in many ways. Standardized measurement instruments are rarely available, and even if they are, many researchers do not use them or do not even provide a definition for the studied concept. SE researchers conducting secondary studies therefore have to decide a) which primary studies intended to measure the same construct, and b) how to compare and aggregate vastly different measurements for the same construct.\n  In this experience report, we discuss the challenge of study selection in SE secondary research on latent variables. We report on two instances where we found it particularly challenging to decide which primary studies should be included for comparison and synthesis, so as not to end up comparing apples with oranges. Our report aims to spark a conversation about developing strategies to address this issue systematically and pave the way for more efficient and rigorous secondary studies in software engineering.",
    "authors": [
      "Marvin Wyrich",
      "Marvin Muñoz Barón",
      "Justus Bogner"
    ],
    "publication_date": "2024-02-13T17:32:17Z",
    "arxiv_id": "http://arxiv.org/abs/2402.08706v1",
    "download_url": "https://arxiv.org/abs/2402.08706v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data Quality in Empirical Software Engineering: A Targeted Review",
    "abstract": "Context: The utility of prediction models in empirical software engineering (ESE) is heavily reliant on the quality of the data used in building those models. Several data quality challenges such as noise, incompleteness, outliers and duplicate data points may be relevant in this regard. Objective: We investigate the reporting of three potentially influential elements of data quality in ESE studies: data collection, data pre-processing, and the identification of data quality issues. This enables us to establish how researchers view the topic of data quality and the mechanisms that are being used to address it. Greater awareness of data quality should inform both the sound conduct of ESE research and the robust practice of ESE data collection and processing. Method: We performed a targeted literature review of empirical software engineering studies covering the period January 2007 to September 2012. A total of 221 relevant studies met our inclusion criteria and were characterized in terms of their consideration and treatment of data quality. Results: We obtained useful insights as to how the ESE community considers these three elements of data quality. Only 23 of these 221 studies reported on all three elements of data quality considered in this paper. Conclusion: The reporting of data collection procedures is not documented consistently in ESE studies. It will be useful if data collection challenges are reported in order to improve our understanding of why there are problems with software engineering data sets and the models developed from them. More generally, data quality should be given far greater attention by the community. The improvement of data sets through enhanced data collection, pre-processing and quality assessment should lead to more reliable prediction models, thus improving the practice of software engineering.",
    "authors": [
      "Michael Franklin Bosu",
      "Stephen G. MacDonell"
    ],
    "publication_date": "2021-05-23T09:31:47Z",
    "arxiv_id": "http://arxiv.org/abs/2105.10895v1",
    "download_url": "https://arxiv.org/abs/2105.10895v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Comprehensive Guide to the U.S. Civil Space Budget",
    "abstract": "This paper presents an overview of the U.S. federal civil space budget between FY23 and proposed spending in FY25, providing a foundational reference dataset for civil space budget analyses. Projects that support, enable, or leverage space activities for civil purposes are found in more than 100 individual line items spread across 17 federal departments and agencies and are funded by 4 different appropriations bills. Across all these elements, civil space-related appropriations total roughly 44 billion dollars in FY25, of which NASA constitutes about 58 percent (Figure 1).\n  To better view the cross-cutting nature of space missions and the support that enables them, the second half of this report introduces a novel representation of the civil space budget by organizing the data into six national priority areas: American Leadership and Manufacturing; Workforce Development; Fundamental Science; Efficiency, Improvements, and Growth; Homeland Security; Infrastructure, Energy, and Resiliency; and Remote Sensing Applications (Figure 2). This organization of the data highlights the ubiquity of space-related activity throughout diverse sectors to reach the same common goal.",
    "authors": [
      "Lindsay DeMarchi"
    ],
    "publication_date": "2025-06-10T22:16:29Z",
    "arxiv_id": "http://arxiv.org/abs/2506.11138v1",
    "download_url": "https://arxiv.org/abs/2506.11138v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering Process and Methodology in Blockchain-Oriented Software Development: A Systematic Study",
    "abstract": "Software Engineering is the process of a systematic, disciplined, quantifiable approach that has significant impact on large-scale and complex software development. Scores of well-established software process models have long been adopted in the software development life cycle that pour stakeholders towards the completion of final software product development. Within the boundary of advanced technology, various emerging and futuristic technology is evolving that really need the attention of the software engineering community whether the conventional software process techniques are capable to inherit the core fundamental into futuristic software development. In this paper, we study the impact of existing software engineering processes and models including Agile, and DevOps in Blockchain-Oriented Software Engineering. We also examine the essentiality of adopting state-of-art concepts and evolving the current software engineering process for blockchain-oriented systems. We discuss the insight of software project management practices in BOS development. The findings of this study indicate that utilizing state-of-art techniques in software processes for futuristic technology would be challenging and promising research is needed extensively towards addressing and improving state-of-the-art software engineering processes and methodology for novel technologies.",
    "authors": [
      "Md Jobair Hossain Faruk",
      "Santhiya Subramanian",
      "Hossain Shahriar",
      "Maria Valero",
      "Xia Li",
      "Masrura Tasnim"
    ],
    "publication_date": "2022-07-02T18:19:49Z",
    "arxiv_id": "http://arxiv.org/abs/2207.00892v1",
    "download_url": "https://arxiv.org/abs/2207.00892v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How Many Papers Should You Review? A Research Synthesis of Systematic Literature Reviews in Software Engineering",
    "abstract": "[Context] Systematic Literature Review (SLR) has been a major type of study published in Software Engineering (SE) venues for about two decades. However, there is a lack of understanding of whether an SLR is really needed in comparison to a more conventional literature review. Very often, SE researchers embark on an SLR with such doubts. We aspire to provide more understanding of when an SLR in SE should be conducted. [Objective] The first step of our investigation was focused on the dataset, i.e., the reviewed papers, in an SLR, which indicates the development of a research topic or area. The objective of this step is to provide a better understanding of the characteristics of the datasets of SLRs in SE. [Method] A research synthesis was conducted on a sample of 170 SLRs published in top-tier SE journals. We extracted and analysed the quantitative attributes of the datasets of these SLRs. [Results] The findings show that the median size of the datasets in our sample is 57 reviewed papers, and the median review period covered is 14 years. The number of reviewed papers and review period have a very weak and non-significant positive correlation. [Conclusions] The results of our study can be used by SE researchers as an indicator or benchmark to understand whether an SLR is conducted at a good time.",
    "authors": [
      "Xiaofeng Wang",
      "Henry Edison",
      "Dron Khanna",
      "Usman Rafiq"
    ],
    "publication_date": "2023-07-12T10:18:58Z",
    "arxiv_id": "http://arxiv.org/abs/2307.06056v1",
    "download_url": "https://arxiv.org/abs/2307.06056v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Agile Software Engineering Method to Design Blockchain Applications",
    "abstract": "Cryptocurrencies and their foundation technology, the Blockchain, are reshaping finance and economics, allowing a decentralized approach enabling trusted applications with no trusted counterpart. More recently, the Blockchain and the programs running on it, called Smart Contracts, are also finding more and more applications in all fields requiring trust and sound certifications. Some people have come to the point of saying that the \"Blockchain revolution\" can be compared to that of the Internet and the Web in their early days. As a result, all the software development revolving around the Blockchain technology is growing at a staggering rate. The feeling of many software engineers about such huge interest in Blockchain technologies is that of unruled and hurried software development, a sort of competition on a first-come-first-served basis which does not assure neither software quality, nor that the basic concepts of software engineering are taken into account. This paper tries to cope with this issue, proposing a software development process to gather the requirement, analyze, design, develop, test and deploy Blockchain applications. The process is based on several Agile practices, such as User Stories and iterative and incremental development based on them. However, it makes also use of more formal notations, such as some UML diagrams describing the design of the system, with additions to represent specific concepts found in Blockchain development. The method is described in good detail, and an example is given to show how it works.",
    "authors": [
      "Michele Marchesi",
      "Lodovica Marchesi",
      "Roberto Tonelli"
    ],
    "publication_date": "2018-09-25T17:16:05Z",
    "arxiv_id": "http://arxiv.org/abs/1809.09596v1",
    "download_url": "https://arxiv.org/abs/1809.09596v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Task Interruptions in Requirements Engineering: Reality versus Perceptions!",
    "abstract": "Task switching and interruptions are a daily reality in software development projects: developers switch between Requirements Engineering (RE), coding, testing, daily meetings, and other tasks. Task switching may increase productivity through increased information flow and effective time management. However, it might also cause a cognitive load to reorient the primary task, which accounts for the decrease in developers' productivity and increases in errors. This cognitive load is even greater in cases of cognitively demanding tasks as the ones typical for RE activities. In this paper, to compare the reality of task switching in RE with the perception of developers, we conducted two studies: (i) a case study analysis on 5,076 recorded tasks of 19 developers and (ii) a survey of 25 developers. The results of our retrospective analysis show that in ALL of the cases that the disruptiveness of RE interruptions is statistically different from other software development tasks, RE related tasks are more vulnerable to interruptions compared to other task types. Moreover, we found that context switching, the priority of the interrupting task, and the interruption source and timing are key factors that impact RE interruptions. We also provided a set of RE task switching patterns along with recommendations for both practitioners and researchers. While the results of our retrospective analysis show that self-interruptions are more disruptive than external interruptions, developers have different perceptions about the disruptiveness of various sources of interruptions.",
    "authors": [
      "Zahra Shakeri Hossein Abad",
      "Guenther Ruhe",
      "Mike Bauer"
    ],
    "publication_date": "2017-07-04T01:16:29Z",
    "arxiv_id": "http://arxiv.org/abs/1707.00794v1",
    "download_url": "https://arxiv.org/abs/1707.00794v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generative AI for Software Metadata: Overview of the Information Retrieval in Software Engineering Track at FIRE 2023",
    "abstract": "The Information Retrieval in Software Engineering (IRSE) track aims to develop solutions for automated evaluation of code comments in a machine learning framework based on human and large language model generated labels. In this track, there is a binary classification task to classify comments as useful and not useful. The dataset consists of 9048 code comments and surrounding code snippet pairs extracted from open source github C based projects and an additional dataset generated individually by teams using large language models. Overall 56 experiments have been submitted by 17 teams from various universities and software companies. The submissions have been evaluated quantitatively using the F1-Score and qualitatively based on the type of features developed, the supervised learning model used and their corresponding hyper-parameters. The labels generated from large language models increase the bias in the prediction model but lead to less over-fitted results.",
    "authors": [
      "Srijoni Majumdar",
      "Soumen Paul",
      "Debjyoti Paul",
      "Ayan Bandyopadhyay",
      "Samiran Chattopadhyay",
      "Partha Pratim Das",
      "Paul D Clough",
      "Prasenjit Majumder"
    ],
    "publication_date": "2023-10-27T14:13:23Z",
    "arxiv_id": "http://arxiv.org/abs/2311.03374v1",
    "download_url": "https://arxiv.org/abs/2311.03374v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Students' and Professionals' Perceived Creativity In Software Engineering: A Comparative Study",
    "abstract": "Creativity is a critical skill that professional software engineers leverage to tackle difficult problems. In higher education, multiple efforts have been made to spark creative skills of engineering students. However, creativity is a vague concept that is open to interpretation. Furthermore, studies have shown that there is a gap in perception and implementation of creativity between industry and academia. To better understand the role of creativity in software engineering (SE), we interviewed 33 professionals via four focus groups and 10 SE students. Our results reveal 45 underlying topics related to creativity. When comparing the perception of students versus professionals, we discovered fundamental differences, grouped into five themes: the creative environment, application of techniques, creative collaboration, nature vs nurture, and the perceived value of creativity. As our aim is to use these findings to install and further encourage creative problem solving in higher education, we have included a list of implications for educational practice.",
    "authors": [
      "Wouter Groeneveld",
      "Laurens Luyten",
      "Joost Vennekens",
      "Kris Aerts"
    ],
    "publication_date": "2023-12-19T10:06:27Z",
    "arxiv_id": "http://arxiv.org/abs/2312.12014v1",
    "download_url": "https://arxiv.org/abs/2312.12014v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some things never change: how far generative AI can really change software engineering practice",
    "abstract": "Generative Artificial Intelligence (GenAI) has become an emerging technology with the availability of several tools that could impact Software Engineering (SE) activities. As any other disruptive technology, GenAI led to the speculation that its full potential can deeply change SE. However, an overfocus on improving activities for which GenAI is more suitable could negligent other relevant areas of the process. In this paper, we aim to explore which SE activities are not expected to be profoundly changed by GenAI. To achieve this goal, we performed a survey with SE practitioners to identify their expectations regarding GenAI in SE, including impacts, challenges, ethical issues, and aspects they do not expect to change. We compared our results with previous roadmaps proposed in SE literature. Our results show that although practitioners expect an increase in productivity, coding, and process quality, they envision that some aspects will not change, such as the need for human expertise, creativity, and project management. Our results point to SE areas for which GenAI is probably not so useful, and future research could tackle them to improve SE practice.",
    "authors": [
      "Aline de Campos",
      "Jorge Melegati",
      "Nicolas Nascimento",
      "Rafael Chanin",
      "Afonso Sales",
      "Igor Wiese"
    ],
    "publication_date": "2024-06-14T05:26:42Z",
    "arxiv_id": "http://arxiv.org/abs/2406.09725v1",
    "download_url": "https://arxiv.org/abs/2406.09725v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Revisiting Binary Code Similarity Analysis using Interpretable Feature Engineering and Lessons Learned",
    "abstract": "Binary code similarity analysis (BCSA) is widely used for diverse security applications, including plagiarism detection, software license violation detection, and vulnerability discovery. Despite the surging research interest in BCSA, it is significantly challenging to perform new research in this field for several reasons. First, most existing approaches focus only on the end results, namely, increasing the success rate of BCSA, by adopting uninterpretable machine learning. Moreover, they utilize their own benchmark, sharing neither the source code nor the entire dataset. Finally, researchers often use different terminologies or even use the same technique without citing the previous literature properly, which makes it difficult to reproduce or extend previous work. To address these problems, we take a step back from the mainstream and contemplate fundamental research questions for BCSA. Why does a certain technique or a certain feature show better results than the others? Specifically, we conduct the first systematic study on the basic features used in BCSA by leveraging interpretable feature engineering on a large-scale benchmark. Our study reveals various useful insights on BCSA. For example, we show that a simple interpretable model with a few basic features can achieve a comparable result to that of recent deep learning-based approaches. Furthermore, we show that the way we compile binaries or the correctness of underlying binary analysis tools can significantly affect the performance of BCSA. Lastly, we make all our source code and benchmark public and suggest future directions in this field to help further research.",
    "authors": [
      "Dongkwan Kim",
      "Eunsoo Kim",
      "Sang Kil Cha",
      "Sooel Son",
      "Yongdae Kim"
    ],
    "publication_date": "2020-11-21T08:54:48Z",
    "arxiv_id": "http://arxiv.org/abs/2011.10749v4",
    "download_url": "https://arxiv.org/abs/2011.10749v4",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bayesian propensity score matching in automotive embedded software engineering",
    "abstract": "Randomised field experiments, such as A/B testing, have long been the gold standard for evaluating the value that new software brings to customers. However, running randomised field experiments is not always desired, possible or even ethical in the development of automotive embedded software. In the face of such restrictions, we propose the use of the Bayesian propensity score matching technique for causal inference of observational studies in the automotive domain. In this paper, we present a method based on the Bayesian propensity score matching framework, applied in the unique setting of automotive software engineering. This method is used to generate balanced control and treatment groups from an observational online evaluation and estimate causal treatment effects from the software changes, even with limited samples in the treatment group. We exemplify the method with a proof-of-concept in the automotive domain. In the example, we have a larger control ($N_c=1100$) fleet of cars using the current software and a small treatment fleet ($N_t=38$), in which we introduce a new software variant. We demonstrate a scenario that shipping of a new software to all users is restricted, as a result, a fully randomised experiment could not be conducted. Therefore, we utilised the Bayesian propensity score matching method with 14 observed covariates as inputs. The results show more balanced groups, suitable for estimating causal treatment effects from the collected observational data. We describe the method in detail and share our configuration. Furthermore, we discuss how can such a method be used for online evaluation of new software utilising small groups of samples.",
    "authors": [
      "Yuchu Liu",
      "David Issa Mattos",
      "Jan Bosch",
      "Helena Holmström Olsson",
      "Jonn Lantz"
    ],
    "publication_date": "2021-09-26T11:27:19Z",
    "arxiv_id": "http://arxiv.org/abs/2109.12563v1",
    "download_url": "https://arxiv.org/abs/2109.12563v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering Artificial Intelligence: Framework, Challenges, and Future Direction",
    "abstract": "Over the past ten years, the application of artificial intelligence (AI) and machine learning (ML) in engineering domains has gained significant popularity, showcasing their potential in data-driven contexts. However, the complexity and diversity of engineering problems often require the development of domain-specific AI approaches, which are frequently hindered by a lack of systematic methodologies, scalability, and robustness during the development process. To address this gap, this paper introduces the \"ABCDE\" as the key elements of Engineering AI and proposes a unified, systematic engineering AI ecosystem framework, including eight essential layers, along with attributes, goals, and applications, to guide the development and deployment of AI solutions for specific engineering needs. Additionally, key challenges are examined, and eight future research directions are highlighted. By providing a comprehensive perspective, this paper aims to advance the strategic implementation of AI, fostering the development of next-generation engineering AI solutions.",
    "authors": [
      "Jay Lee",
      "Hanqi Su",
      "Dai-Yan Ji",
      "Takanobu Minami"
    ],
    "publication_date": "2025-04-03T04:30:10Z",
    "arxiv_id": "http://arxiv.org/abs/2504.02269v3",
    "download_url": "https://arxiv.org/abs/2504.02269v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Survey on Essential and Accidental Real-Time Issues in Software Engineering",
    "abstract": "Software product lines have recently been presented as one of the best promising improvements for the efficient software development. Different research works contribute supportive parameters and negotiations regarding the problems of producing a perfect software scheme. Traditional approaches or recycling software are not effective to solve the problems concerning software competence. Since fast developments with software engineering in the past few years, studies show that some approaches are getting extensive attention in both industries and universities. This method is categorized as the software product line improvement; that supports reusing of software in big organizations. Different industries are adopting product lines to enhance efficiency and reduce operational expenses by way of emerging product developments. This research paper is formed to offer in-depth study regarding the software engineering issues such as complexity, conformity, changeability, invisibility, time constraints, budget constraints, and security. We have conducted various research surveys by visiting different professional software development organizations and took feedback from the professional software engineers to analyze the real-time problems that they are facing during the development process of software systems. Survey results proved that complexity is a most occurring issue that most software developers face while developing software applications. Moreover, invisibility is the problem that rarely happens according to the survey.",
    "authors": [
      "Furrakh Shahzad",
      "Maruf Pasha",
      "Urooj Pasha",
      "Bushra Majeed",
      "Khurram Shahzad"
    ],
    "publication_date": "2017-03-10T17:58:55Z",
    "arxiv_id": "http://arxiv.org/abs/1703.03783v1",
    "download_url": "https://arxiv.org/abs/1703.03783v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "GPT-Powered Elicitation Interview Script Generator for Requirements Engineering Training",
    "abstract": "Elicitation interviews are the most common requirements elicitation technique, and proficiency in conducting these interviews is crucial for requirements elicitation. Traditional training methods, typically limited to textbook learning, may not sufficiently address the practical complexities of interviewing techniques. Practical training with various interview scenarios is important for understanding how to apply theoretical knowledge in real-world contexts. However, there is a shortage of educational interview material, as creating interview scripts requires both technical expertise and creativity. To address this issue, we develop a specialized GPT agent for auto-generating interview scripts. The GPT agent is equipped with a dedicated knowledge base tailored to the guidelines and best practices of requirements elicitation interview procedures. We employ a prompt chaining approach to mitigate the output length constraint of GPT to be able to generate thorough and detailed interview scripts. This involves dividing the interview into sections and crafting distinct prompts for each, allowing for the generation of complete content for each section. The generated scripts are assessed through standard natural language generation evaluation metrics and an expert judgment study, confirming their applicability in requirements engineering training.",
    "authors": [
      "Binnur Görer",
      "Fatma Başak Aydemir"
    ],
    "publication_date": "2024-06-17T11:53:55Z",
    "arxiv_id": "http://arxiv.org/abs/2406.11439v1",
    "download_url": "https://arxiv.org/abs/2406.11439v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Guidelines for Empirical Studies in Software Engineering involving Large Language Models",
    "abstract": "Large language models (LLMs) are increasingly being integrated into software engineering (SE) research and practice, yet their non-determinism, opaque training data, and evolving architectures complicate the reproduction and replication of empirical studies. We present a community effort to scope this space, introducing a taxonomy of LLM-based study types together with eight guidelines for designing and reporting empirical studies involving LLMs. The guidelines present essential (must) criteria as well as desired (should) criteria and target transparency throughout the research process. Our recommendations, contextualized by our study types, are: (1) to declare LLM usage and role; (2) to report model versions, configurations, and fine-tuning; (3) to document tool architectures; (4) to disclose prompts and interaction logs; (5) to use human validation; (6) to employ an open LLM as a baseline; (7) to use suitable baselines, benchmarks, and metrics; and (8) to openly articulate limitations and mitigations. Our goal is to enable reproducibility and replicability despite LLM-specific barriers to open science. We maintain the study types and guidelines online as a living resource for the community to use and shape (llm-guidelines.org).",
    "authors": [
      "Sebastian Baltes",
      "Florian Angermeir",
      "Chetan Arora",
      "Marvin Muñoz Barón",
      "Chunyang Chen",
      "Lukas Böhme",
      "Fabio Calefato",
      "Neil Ernst",
      "Davide Falessi",
      "Brian Fitzgerald",
      "Davide Fucci",
      "Marcos Kalinowski",
      "Stefano Lambiase",
      "Daniel Russo",
      "Mircea Lungu",
      "Lutz Prechelt",
      "Paul Ralph",
      "Rijnard van Tonder",
      "Christoph Treude",
      "Stefan Wagner"
    ],
    "publication_date": "2025-08-21T12:30:30Z",
    "arxiv_id": "http://arxiv.org/abs/2508.15503v3",
    "download_url": "https://arxiv.org/abs/2508.15503v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An IDE-Based Context-Aware Meta Search Engine",
    "abstract": "Traditional web search forces the developers to leave their working environments and look for solutions in the web browsers. It often does not consider the context of their programming problems. The context-switching between the web browser and the working environment is time-consuming and distracting, and the keyword-based traditional search often does not help much in problem solving. In this paper, we propose an Eclipse IDE-based web search solution that collects the data from three web search APIs-- Google, Yahoo, Bing and a programming Q & A site-- Stack Overflow. It then provides search results within IDE taking not only the content of the selected error into account but also the problem context, popularity and search engine recommendation of the result links. Experiments with 25 run time errors and exceptions show that the proposed approach outperforms the keyword-based search approaches with a recommendation accuracy of 96%. We also validate the results with a user study involving five prospective participants where we get a result agreement of 64.28%. While the preliminary results are promising, the approach needs to be further validated with more errors and exceptions followed by a user study with more participants to establish itself as a complete IDE-based web search solution.",
    "authors": [
      "Mohammad Masudur Rahman",
      "Shamima Yeasmin",
      "Chanchal K. Roy"
    ],
    "publication_date": "2018-07-05T06:05:46Z",
    "arxiv_id": "http://arxiv.org/abs/1807.01857v1",
    "download_url": "https://arxiv.org/abs/1807.01857v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Impact of UAVs Equipped with ADS-B on the Civil Aviation Monitoring System",
    "abstract": "In recent years, there is an increasing demand for unmanned aerial vehicles (UAVs) to complete multiple applications. However, as unmanned equipments, UAVs lead to some security risks to general civil aviations. In order to strengthen the flight management of UAVs and guarantee the safety, UAVs can be equipped with automatic dependent surveillance-broadcast (ADS-B) devices. In addition, as an automatic system, ADS-B can periodically broadcast flight information to the nearby aircrafts or the ground stations, and the technology is already used in civil aviation systems. However, due to the limited frequency of ADS-B technique, UAVs equipped with ADS-B devices result in the loss of packets to both UAVs and civil aviation. Further, the operation of civil aviation are seriously interfered. Hence, this paper firstly examines the packets loss of civil planes at different distance, then analyzes the impact of UAVs equipped with ADS-B on the packets updating of civil planes. The result indicates that the 1090MHz band blocking is affected by the density of UAVs. Besides, the frequency capacity is affected by the requirement of updating interval of civil planes. The position updating probability within 3s is 92.3% if there are 200 planes within 50km and 20 UAVs within 5km. The position updating probability within 3s is 86.9% if there are 200 planes within 50km and 40 UAVs within 5km.",
    "authors": [
      "Yiyang Liao",
      "Lei Zhang",
      "Ziye Jia",
      "Chao Dong",
      "Yifan Zhang",
      "Qihui Wu",
      "Huiling Hu",
      "Bin Wang"
    ],
    "publication_date": "2023-07-04T07:38:48Z",
    "arxiv_id": "http://arxiv.org/abs/2307.01534v1",
    "download_url": "https://arxiv.org/abs/2307.01534v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deep Learning based Model Predictive Control for Compression Ignition Engines",
    "abstract": "Machine learning (ML) and a nonlinear model predictive controller (NMPC) are used in this paper to minimize the emissions and fuel consumption of a compression ignition engine. In this work machine learning is applied in two methods. In the first application, ML is used to identify a model for implementation in model predictive control optimization problems. In the second application, ML is used as a replacement of the NMPC where the ML controller learns the optimal control action by imitating or mimicking the behavior of the model predictive controller. In this study, a deep recurrent neural network including long-short term memory (LSTM) layers are used to model the emissions and performance of an industrial 4.5 liter 4-cylinder Cummins diesel engine. This model is then used for model predictive controller implementation. Then, a deep learning scheme is deployed to clone the behavior of the developed controller. In the LSTM integration, a novel scheme is used by augmenting hidden and cell states of the network in an NMPC optimization problem. The developed LSTM-NMPC and the imitative NMPC are compared with the Cummins calibrated Engine Control Unit (ECU) model in an experimentally validated engine simulation platform. Results show a significant reduction in Nitrogen Oxides (\\nox) emissions and a slight decrease in the injected fuel quantity while maintaining the same load. In addition, the imitative NMPC has a similar performance as the NMPC but with a two orders of magnitude reduction of the computation time.",
    "authors": [
      "Armin Norouzi",
      "Saeid Shahpouri",
      "David Gordon",
      "Alexander Winkler",
      "Eugen Nuss",
      "Dirk Abel",
      "Jakob Andert",
      "Mahdi Shahbakhti",
      "Charles Robert Koch"
    ],
    "publication_date": "2022-03-31T23:56:01Z",
    "arxiv_id": "http://arxiv.org/abs/2204.00139v2",
    "download_url": "https://arxiv.org/abs/2204.00139v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bayesian data analysis in empirical software engineering---The case of missing data",
    "abstract": "Bayesian data analysis (BDA) is today used by a multitude of research disciplines. These disciplines use BDA as a way to embrace uncertainty by using multilevel models and making use of all available information at hand. In this chapter, we first introduce the reader to BDA and then provide an example from empirical software engineering, where we also deal with a common issue in our field, i.e., missing data.\n  The example we make use of presents the steps done when conducting state of the art statistical analysis. First, we need to understand the problem we want to solve. Second, we conduct causal analysis. Third, we analyze non-identifiability. Fourth, we conduct missing data analysis. Finally, we do a sensitivity analysis of priors. All this before we design our statistical model. Once we have a model, we present several diagnostics one can use to conduct sanity checks.\n  We hope that through these examples, the reader will see the advantages of using BDA. This way, we hope Bayesian statistics will become more prevalent in our field, thus partly avoiding the reproducibility crisis we have seen in other disciplines.",
    "authors": [
      "Richard Torkar",
      "Robert Feldt",
      "Carlo A. Furia"
    ],
    "publication_date": "2019-04-01T09:40:06Z",
    "arxiv_id": "http://arxiv.org/abs/1904.00661v3",
    "download_url": "https://arxiv.org/abs/1904.00661v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Improving Software Engineering Research through Experimentation Workbenches",
    "abstract": "Experimentation with software prototypes plays a fundamental role in software engineering research. In contrast to many other scientific disciplines, however, explicit support for this key activity in software engineering is relatively small. While some approaches to improve this situation have been proposed by the software engineering community, experiments are still very difficult and sometimes impossible to replicate. In this paper, we propose the concept of an experimentation workbench as a means of explicit support for experimentation in software engineering research. In particular, we discuss core requirements that an experimentation workbench should satisfy in order to qualify as such and to offer a real benefit for researchers. Beyond their core benefits for experimentation, we stipulate that experimentation workbenches will also have benefits in regard to reproducibility and repeatability of software engineering research. Further, we illustrate this concept with a scenario and a case study, and describe relevant challenges as well as our experience with experimentation workbenches.",
    "authors": [
      "Klaus Schmid",
      "Sascha El-Sharkawy",
      "Christian Kröher"
    ],
    "publication_date": "2021-10-25T13:16:14Z",
    "arxiv_id": "http://arxiv.org/abs/2110.12937v1",
    "download_url": "https://arxiv.org/abs/2110.12937v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Model Discovery and Graph Simulation: A Lightweight Gateway to Chaos Engineering",
    "abstract": "Chaos engineering reveals resilience risks but is expensive and operationally risky to run broadly and often. Model-based analyses can estimate dependability, yet in practice they are tricky to build and keep current because models are typically handcrafted. We claim that a simple connectivity-only topological model - just the service-dependency graph plus replica counts - can provide fast, low-risk availability estimates under fail-stop faults. To make this claim practical without hand-built models, we introduce model discovery: an automated step that can run in CI/CD or as an observability-platform capability, synthesizing an explicit, analyzable model from artifacts teams already have (e.g., distributed traces, service-mesh telemetry, configs/manifests) - providing an accessible gateway for teams to begin resilience testing. As a proof by instance on the DeathStarBench Social Network, we extract the dependency graph from Jaeger and estimate availability across two deployment modes and five failure rates. The discovered model closely tracks live fault-injection results; with replication, median error at mid-range failure rates is near zero, while no-replication shows signed biases consistent with excluded mechanisms. These results create two opportunities: first, to triage and reduce the scope of expensive chaos experiments in advance, and second, to generate real-time signals on the system's resilience posture as its topology evolves, preserving live validation for the most critical or ambiguous scenarios.",
    "authors": [
      "Anatoly A. Krasnovsky"
    ],
    "publication_date": "2025-06-12T10:59:28Z",
    "arxiv_id": "http://arxiv.org/abs/2506.11176v2",
    "download_url": "https://arxiv.org/abs/2506.11176v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Game Development Software Engineering Process Life Cycle: A Systematic Review",
    "abstract": "Software game is a kind of application that is used not only for entertainment, but also for serious purposes that can be applicable to different domains such as education, business, and health care. Although the game development process differs from the traditional software development process because it involves interdisciplinary activities. Software engineering techniques are still important for game development because they can help the developer to achieve maintainability, flexibility, lower effort and cost, and better design. The purpose of this study is to assesses the state of the art research on the game development software engineering process and highlight areas that need further consideration by researchers. In the study, we used a systematic literature review methodology based on well-known digital libraries. The largest number of studies have been reported in the production phase of the game development software engineering process life cycle, followed by the pre-production phase. By contrast, the post-production phase has received much less research activity than the pre-production and production phases. The results of this study suggest that the game development software engineering process has many aspects that need further attention from researchers; that especially includes the postproduction phase.",
    "authors": [
      "Saiqa Aleem",
      "Luiz Fernando Capretz",
      "Faheem Ahmed"
    ],
    "publication_date": "2017-11-22T22:37:41Z",
    "arxiv_id": "http://arxiv.org/abs/1711.08527v1",
    "download_url": "https://arxiv.org/abs/1711.08527v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Term Interrelations and Trends in Software Engineering",
    "abstract": "The Software Engineering (SE) community is prolific, making it challenging for experts to keep up with the flood of new papers and for neophytes to enter the field. Therefore, we posit that the community may benefit from a tool extracting terms and their interrelations from the SE community's text corpus and showing terms' trends. In this paper, we build a prototyping tool using the word embedding technique. We train the embeddings on the SE Body of Knowledge handbook and 15,233 research papers' titles and abstracts. We also create test cases necessary for validation of the training of the embeddings. We provide representative examples showing that the embeddings may aid in summarizing terms and uncovering trends in the knowledge base.",
    "authors": [
      "Janusan Baskararajah",
      "Lei Zhang",
      "Andriy Miranskyy"
    ],
    "publication_date": "2021-08-21T15:35:57Z",
    "arxiv_id": "http://arxiv.org/abs/2108.09529v1",
    "download_url": "https://arxiv.org/abs/2108.09529v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Characterizing the Experience of Subjects in Software Engineering Studies",
    "abstract": "Context: Empirical studies in software engineering are typically centered on human subjects, ranging from novice to experienced developers. The experience of these individuals is a key context factor that should be properly characterized for supporting the design of empirical studies and interpreting their results. However, the criteria adopted for characterizing the experience of subjects do not follow a standard and are frequently limited. Goal: Our research aims at establishing an optimized and comprehensive scheme to characterize the subjects' experience for studies in software engineering. Method: Based on previous work, we defined the first version of this scheme, composed of three experience attributes, including time, number of projects, and self-perception. In the last years, we applied the characterization scheme over four empirical studies, reaching the characterization of 79 subjects in three different skills. Results: We found that the attributes from our scheme are positively but moderately correlated. This finding suggests these attributes play a complementary role in characterizing the subjects' experience. Besides, we found that study subjects tend to enumerate the technical diversity of their background when summarizing their professional experience. Conclusion: The scheme proposed represents a feasible alternative for characterizing subjects of empirical studies in the field. However, we intend to conduct additional investigations with developers to evolve it.",
    "authors": [
      "Rafael de Mello",
      "Matheus Coelho"
    ],
    "publication_date": "2021-10-06T15:09:36Z",
    "arxiv_id": "http://arxiv.org/abs/2110.02835v1",
    "download_url": "https://arxiv.org/abs/2110.02835v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complex Systems + Systems Engineering = Complex Systems Engineeri",
    "abstract": "One may define a complex system as a system in which phenomena emerge as a consequence of multiscale interaction among the system's components and their environments. The field of Complex Systems is the study of such systems--usually naturally occurring, either bio-logical or social. Systems Engineering may be understood to include the conceptualising and building of systems that consist of a large number of concurrently operating and interacting components--usually including both human and non-human elements. It has become increasingly apparent that the kinds of systems that systems engineers build have many of the same multiscale characteristics as those of naturally occurring complex systems. In other words, systems engineering is the engineering of complex systems. This paper and the associated panel will explore some of the connections between the fields of complex systems and systems engineering.",
    "authors": [
      "Russ Abbott"
    ],
    "publication_date": "2006-03-30T22:58:12Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0603127v1",
    "download_url": "https://arxiv.org/abs/cs/0603127v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Gender, Ethnicity, and Culture in Empirical Software Engineering Research",
    "abstract": "This note highlights the importance of investigating diversity aspects in combination in empirical research. It draws on the psychological discourse and suggests why and how software engineering scholars can use the aspect of diversity in all their research endeavors.",
    "authors": [
      "Lucas Gren"
    ],
    "publication_date": "2019-04-05T19:09:09Z",
    "arxiv_id": "http://arxiv.org/abs/1904.09820v1",
    "download_url": "https://arxiv.org/abs/1904.09820v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SEntiMoji: An Emoji-Powered Learning Approach for Sentiment Analysis in Software Engineering",
    "abstract": "Sentiment analysis has various application scenarios in software engineering (SE), such as detecting developers' emotions in commit messages and identifying their opinions on Q&A forums. However, commonly used out-of-the-box sentiment analysis tools cannot obtain reliable results on SE tasks and the misunderstanding of technical jargon is demonstrated to be the main reason. Then, researchers have to utilize labeled SE-related texts to customize sentiment analysis for SE tasks via a variety of algorithms. However, the scarce labeled data can cover only very limited expressions and thus cannot guarantee the analysis quality. To address such a problem, we turn to the easily available emoji usage data for help. More specifically, we employ emotional emojis as noisy labels of sentiments and propose a representation learning approach that uses both Tweets and GitHub posts containing emojis to learn sentiment-aware representations for SE-related texts. These emoji-labeled posts can not only supply the technical jargon, but also incorporate more general sentiment patterns shared across domains. They as well as labeled data are used to learn the final sentiment classifier. Compared to the existing sentiment analysis methods used in SE, the proposed approach can achieve significant improvement on representative benchmark datasets. By further contrast experiments, we find that the Tweets make a key contribution to the power of our approach. This finding informs future research not to unilaterally pursue the domain-specific resource, but try to transform knowledge from the open domain through ubiquitous signals such as emojis.",
    "authors": [
      "Zhenpeng Chen",
      "Yanbin Cao",
      "Xuan Lu",
      "Qiaozhu Mei",
      "Xuanzhe Liu"
    ],
    "publication_date": "2019-07-04T03:38:41Z",
    "arxiv_id": "http://arxiv.org/abs/1907.02202v1",
    "download_url": "https://arxiv.org/abs/1907.02202v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "KG-EmpiRE: A Community-Maintainable Knowledge Graph for a Sustainable Literature Review on the State and Evolution of Empirical Research in Requirements Engineering",
    "abstract": "In the last two decades, several researchers provided snapshots of the \"current\" state and evolution of empirical research in requirements engineering (RE) through literature reviews. However, these literature reviews were not sustainable, as none built on or updated previous works due to the unavailability of the extracted and analyzed data. KG-EmpiRE is a Knowledge Graph (KG) of empirical research in RE based on scientific data extracted from currently 680 papers published in the IEEE International Requirements Engineering Conference (1994-2022). KG-EmpiRE is maintained in the Open Research Knowledge Graph (ORKG), making all data openly and long-term available according to the FAIR data principles. Our long-term goal is to constantly maintain KG-EmpiRE with the research community to synthesize a comprehensive, up-to-date, and long-term available overview of the state and evolution of empirical research in RE. Besides KG-EmpiRE, we provide its analysis with all supplementary materials in a repository. This repository contains all files with instructions for replicating and (re-)using the analysis locally or via executable environments and for repeating the research approach. Since its first release based on 199 papers (2014-2022), KG-EmpiRE and its analysis have been updated twice, currently covering over 650 papers. KG-EmpiRE and its analysis demonstrate how innovative infrastructures, such as the ORKG, can be leveraged to make data from literature reviews FAIR, openly available, and maintainable for the research community in the long term. In this way, we can enable replicable, (re-)usable, and thus sustainable literature reviews to ensure the quality, reliability, and timeliness of their research results.",
    "authors": [
      "Oliver Karras"
    ],
    "publication_date": "2024-05-14T06:42:47Z",
    "arxiv_id": "http://arxiv.org/abs/2405.08351v1",
    "download_url": "https://arxiv.org/abs/2405.08351v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Practical Guidelines for the Selection and Evaluation of Natural Language Processing Techniques in Requirements Engineering",
    "abstract": "Natural Language Processing (NLP) is now a cornerstone of requirements automation. One compelling factor behind the growing adoption of NLP in Requirements Engineering (RE) is the prevalent use of natural language (NL) for specifying requirements in industry. NLP techniques are commonly used for automatically classifying requirements, extracting important information, e.g., domain models and glossary terms, and performing quality assurance tasks, such as ambiguity handling and completeness checking. With so many different NLP solution strategies available and the possibility of applying machine learning alongside, it can be challenging to choose the right strategy for a specific RE task and to evaluate the resulting solution in an empirically rigorous manner. In this chapter, we present guidelines for the selection of NLP techniques as well as for their evaluation in the context of RE. In particular, we discuss how to choose among different strategies such as traditional NLP, feature-based machine learning, and language-model-based methods. Our ultimate hope for this chapter is to serve as a stepping stone, assisting newcomers to NLP4RE in quickly initiating themselves into the NLP technologies most pertinent to the RE field.",
    "authors": [
      "Mehrdad Sabetzadeh",
      "Chetan Arora"
    ],
    "publication_date": "2024-01-03T02:24:35Z",
    "arxiv_id": "http://arxiv.org/abs/2401.01508v3",
    "download_url": "https://arxiv.org/abs/2401.01508v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Future Circular Collider Feasibility Study Report: Volume 3, Civil Engineering, Implementation and Sustainability",
    "abstract": "Volume 3 of the FCC Feasibility Report presents studies related to civil engineering, the development of a project implementation scenario, and environmental and sustainability aspects. The report details the iterative improvements made to the civil engineering concepts since 2018, taking into account subsurface conditions, accelerator and experiment requirements, and territorial considerations. It outlines a technically feasible and economically viable civil engineering configuration that serves as the baseline for detailed subsurface investigations, construction design, cost estimation, and project implementation planning. Additionally, the report highlights ongoing subsurface investigations in key areas to support the development of an improved 3D subsurface model of the region.\n  The report describes development of the project scenario based on the 'avoid-reduce-compensate' iterative optimisation approach. The reference scenario balances optimal physics performance with territorial compatibility, implementation risks, and costs. Environmental field investigations covering almost 600 hectares of terrain - including numerous urban, economic, social, and technical aspects - confirmed the project's technical feasibility and contributed to the preparation of essential input documents for the formal project authorisation phase. The summary also highlights the initiation of public dialogue as part of the authorisation process. The results of a comprehensive socio-economic impact assessment, which included significant environmental effects, are presented. Even under the most conservative and stringent conditions, a positive benefit-cost ratio for the FCC-ee is obtained. Finally, the report provides a concise summary of the studies conducted to document the current state of the environment.",
    "authors": [
      "M. Benedikt",
      "F. Zimmermann",
      "B. Auchmann",
      "W. Bartmann",
      "J. P. Burnet",
      "C. Carli",
      "A. Chancé",
      "P. Craievich",
      "M. Giovannozzi",
      "C. Grojean",
      "J. Gutleber",
      "K. Hanke",
      "A. Henriques",
      "P. Janot",
      "C. Lourenço",
      "M. Mangano",
      "T. Otto",
      "J. Poole",
      "S. Rajagopalan",
      "T. Raubenheimer",
      "E. Todesco",
      "L. Ulrici",
      "T. Watson",
      "G. Wilkinson",
      "P. Azzi",
      "G. Bernardi",
      "A. Blondel",
      "M. Boscolo",
      "D. d'Enterria",
      "M. Dam",
      "J. de Blas",
      "B. Francois",
      "A. Freitas",
      "G. Ganis",
      "J. Keintzel",
      "M. Klute",
      "M. McCullough",
      "P. F. Monni",
      "F. Palla",
      "E. Perez",
      "M. -A. Pleier",
      "W. Riegler",
      "F. Sefkow",
      "M. Selvaggi",
      "A. Abada",
      "M. Abbrescia",
      "H. Abdolmaleki",
      "S. H. Abidi",
      "A. Abramov",
      "C. Adam",
      "M. Ady",
      "P. R. Aduzić",
      "I. Agapov",
      "D. Aguglia",
      "I. Ahmed",
      "M. Aiba",
      "G. Aielli",
      "T. Akan",
      "N. Akchurin",
      "D. Akturk",
      "M. Al-Thakeel",
      "G. L. Alberghi",
      "J. Alcaraz Maestre",
      "M. Aleksa",
      "R. Aleksan",
      "F. Alharthi",
      "J. Alimena",
      "A. Alimenti",
      "S. Alioli",
      "L. Alix",
      "B. C. Allanach",
      "L. Allwicher",
      "A. A. Altintas",
      "M. Altınlı",
      "M. Alviggi",
      "G. Ambrosio",
      "Y. Amhis",
      "A. Amiri",
      "G. Ammirabile",
      "T. Andeen",
      "K. D. J. André",
      "J. Andrea",
      "A. Andreazza",
      "M. Andreini",
      "T. Andriollo",
      "L. Angel",
      "M. Angelucci",
      "S. Antusch",
      "M. N. Anwar",
      "L. Apolinário",
      "G. Apollinari",
      "R. B. Appleby",
      "A. Apresyan",
      "Aram Apyan",
      "Armen Apyan",
      "A. Arbey",
      "B. Argiento",
      "V. Ari",
      "S. Arias",
      "B. Arias Alonso",
      "O. Arnaez",
      "R. Arnaldi",
      "F. Arneodo",
      "H. Arnold",
      "P. Arrutia Sota",
      "M. E. Ascioti",
      "K. A. Assamagan",
      "S. Aumiller",
      "G. Aydın",
      "K. Azizi",
      "N. Bacchetta",
      "A. Bacci",
      "B. Bai",
      "Y. Bai",
      "L. Balconi",
      "G. Baldinelli",
      "B. Balhan",
      "A. H. Ball",
      "A. Ballarino",
      "S. Banerjee",
      "S. Banik",
      "D. P. Barber",
      "M. B. Barbero",
      "D. Barducci",
      "D. Barna",
      "G. G. Barnaföldi",
      "M. J. Barnes",
      "A. J. Barr",
      "R. Bartek",
      "H. Bartosik",
      "S. A. Bass",
      "U. Bassler",
      "M. J. Basso",
      "A. Bastianin",
      "P. Bataillard",
      "M. Battistin",
      "J. Bauche",
      "L. Baudin",
      "J. Baudot",
      "B. Baudouy",
      "L. Bauerdick",
      "C. Bayındır",
      "H. P. Beck",
      "F. Bedeschi",
      "C. Bee",
      "M. Begel",
      "M. Behtouei",
      "L. Bellagamba",
      "N. Bellegarde",
      "E. Belli",
      "E. Bellingeri",
      "S. Belomestnykh",
      "A. D. Benaglia",
      "G. Bencivenni",
      "J. Bendavid",
      "M. Benmergui",
      "M. Benoit",
      "D. Benvenuti",
      "T. Bergauer",
      "N. Bernachot",
      "J. Bernardi",
      "Q. Berthet",
      "S. Bertoni",
      "C. Bertulani",
      "M. I. Besana",
      "A. Besson",
      "M. Bettelini",
      "S. Bettoni",
      "S. Beuvier",
      "P. C. Bhat",
      "S. Bhattacharya",
      "J. Bhom",
      "M. E. Biagini",
      "A. Bibet-Chevalier",
      "M. Bicrel",
      "M. Biglietti",
      "G. M. Bilei",
      "B. Bilki",
      "K. Bisgaard Christensen",
      "T. Biswas",
      "F. Blanc",
      "F. Blekman",
      "J. Blümlein",
      "D. Boccanfuso",
      "A. Bogomyagkov",
      "P. Boillon",
      "P. Boivin",
      "M. J. Boland",
      "S. Bologna",
      "O. Bolukbasi",
      "R. Bonnet",
      "J. Borburgh",
      "F. Bordry",
      "P. Borges de Sousa",
      "G. Borghello",
      "L. Borriello",
      "D. Bortoletto",
      "L. Bottura",
      "V. Boudry",
      "R. Boughezal",
      "D. Bourilkov",
      "M. Boyd",
      "D. Boye",
      "G. Bozzi",
      "V. Braccini",
      "C. Bracco",
      "B. Bradu",
      "A. Braghieri",
      "S. Braibant",
      "J. Bramante",
      "G. C. Branco",
      "R. Brenner",
      "N. Brisa",
      "D. Britzger",
      "G. Broggi",
      "L. Bromiley",
      "E. Brost",
      "Q. Bruant",
      "R. Bruce",
      "E. Bründermann",
      "L. Brunetti",
      "O. Brüning",
      "O. Brunner",
      "X. Buffat",
      "E. Bulyak",
      "A. Burdyko",
      "H. Burkhardt",
      "P. N. Burrows",
      "S. Busatto",
      "S. Buschaert",
      "D. Buttazzo",
      "A. Butterworth",
      "D. Butti",
      "G. Cacciapaglia",
      "Y. Cai",
      "B. Caiffi",
      "V. Cairo",
      "O. Cakir",
      "P. Calafiura",
      "R. Calaga",
      "S. Calatroni",
      "D. G. Caldwell",
      "A. Çalı şkan",
      "C. Calpini",
      "M. Calviani",
      "E. Camacho-Pérez",
      "P. Camarri",
      "L. Caminada",
      "M. Campajola",
      "A. C. Canbay",
      "K. Canderan",
      "S. Candido",
      "F. Canelli",
      "A. Canepa",
      "S. Cantarella",
      "K. B. Cantún-Avila",
      "L. Capriotti",
      "A. Caram",
      "A. Carbone",
      "J. M. Carceller",
      "G. Carini",
      "F. Carlier",
      "C. M. Carloni Calame",
      "F. Carra",
      "C. Cartannaz",
      "S. Casenove",
      "G. Catalano",
      "V. Cavaliere",
      "C. Cazzaniga",
      "C. Cecchi",
      "F. G. Celiberto",
      "M. Cepeda",
      "F. Cerutti",
      "F. Cetorelli",
      "G. Chachamis",
      "Y. Chae",
      "F. Chagnet",
      "I. Chaikovska",
      "M. Chalhoub",
      "M. Chamizo-Llatas",
      "M. Champagne",
      "H. Chanal",
      "G. Chapelier",
      "P. Charitos",
      "C. Charles",
      "T. K. Charles",
      "C. Charlot",
      "S. Chatterjee",
      "A. Chaudhuri",
      "R. Chehab",
      "S. V. Chekanov",
      "H. Chen",
      "T. Chesne",
      "F. Chiapponi",
      "G. Chiarello",
      "M. Chiesa",
      "P. Chiggiato",
      "Ph. Chomaz",
      "M. Chorowski",
      "J. P. Chou",
      "M. Chrzaszcz",
      "W. Chung",
      "S. Ciarlantini",
      "A. Ciarma",
      "D. Cieri",
      "A. K. Ciftci",
      "R. Ciftci",
      "R. Cimino",
      "F. Cirotto",
      "M. Ciuchini",
      "M. Cobal",
      "A. Coccaro",
      "R. Coelho Lopes De Sa",
      "J. A. Coleman-Smith",
      "F. Collamati",
      "C. Colldelram",
      "P. Collier",
      "P. Collins",
      "J. Collot",
      "M. Colmenero",
      "L. Colnot",
      "G. Coloretti",
      "E. Conte",
      "F. A. Conventi",
      "A. Cook",
      "L. Cooley",
      "A. S. Cornell",
      "C. Cornella",
      "G. Cornette",
      "I. Corredoira",
      "P. Costa Pinto",
      "F. Couderc",
      "J. Coupard",
      "S. Coussy",
      "R. Crescenzi",
      "I. Crespo Garrido",
      "T. Critchley",
      "A. Crivellin",
      "T. Croci",
      "C. Cudré",
      "G. Cummings",
      "F. Cuna",
      "R. Cunningham",
      "B. Curé",
      "E. Curtis",
      "M. D'Alfonso",
      "L. D'Aloia Schwartzentruber",
      "G. D'Amen",
      "B. D'Anzi",
      "A. D'Avanzo",
      "A. D'Onofrio",
      "M. D'Onofrio",
      "M. Da Col",
      "M. Da Rocha Rolo",
      "C. Dachauer",
      "B. Dağli",
      "A. Dainese",
      "B. Dalena",
      "W. Dallapiazza",
      "H. Damerau",
      "V. Dao",
      "A. Das",
      "M. S. Daugaard",
      "S. Dauphin",
      "A. David",
      "T. Daví dek",
      "G. J. Davies",
      "S. Dawson",
      "A. de Cosa",
      "S. De Curtis",
      "N. De Filippis",
      "E. De Lucia",
      "R. De Maria",
      "E. De Matteis",
      "A. De Roeck",
      "A. De Santis",
      "A. De Vita",
      "A. Deandrea",
      "C. J. Debono",
      "M. Deeb",
      "M. M. Defranchis",
      "J. Degens",
      "S. Deghaye",
      "V. Del Duca",
      "C. L. Del Pio",
      "A. Del Vecchio",
      "D. Delikaris",
      "A. Dell'Acqua",
      "M. Della Pietra",
      "M. Delmastro",
      "L. Delprat",
      "E. Delugas",
      "Z. Demiragli",
      "L. Deniau",
      "D. Denisov",
      "H. Denizli",
      "A. Denner",
      "A. Denot",
      "G. Deptuch",
      "A. Desai",
      "H. Deveci",
      "A. Di Canto",
      "A. Di Ciaccio",
      "L. Di Ciaccio",
      "D. Di Croce",
      "C. Di Fraia",
      "B. Di Micco",
      "R. Di Nardo",
      "T. B. Dingley",
      "F. Djama",
      "F. Djurabekova",
      "D. Dockery",
      "S. Doebert",
      "D. Domange",
      "M. Donegà",
      "U. Dosselli",
      "H. A. Dostmann",
      "J. A. Dragovich",
      "I. Drebot",
      "M. Drewes",
      "T. A. du Pree",
      "Z. Duan",
      "C. Duarte-Galvan",
      "O. Duboc",
      "M. Duda",
      "P. Duda",
      "H. Duran Yildiz",
      "H. Durand",
      "P. Durand",
      "G. Durieux",
      "Y. Dutheil",
      "I. Dutta",
      "J. S. Dutta",
      "S. Dutta",
      "F. Duval",
      "F. Eder",
      "M. Eisterer",
      "Z. El Bitar",
      "A. El Saied",
      "M. Elisei",
      "J. Ellis",
      "W. Elmetenawee",
      "J. Elmsheuser",
      "V. Daniel Elvira",
      "S. C. Eno",
      "Y. Enomoto",
      "B. A. Erdelyi",
      "O. E. Eruteya",
      "M. Escobar",
      "O. Etisken",
      "I. Eymard",
      "J. Eysermans",
      "D. Falchieri",
      "C. Falkenberg",
      "F. Fallavollita",
      "A. Afalou",
      "J. Faltova",
      "J. Fanini",
      "L. Fanò",
      "K. Fanti",
      "R. Farinelli",
      "M. Farino",
      "S. Farinon",
      "H. Fatehi",
      "J. Fatterbert",
      "A. Faure",
      "A. Faus-Golfe",
      "G. Favia",
      "L. Favilla",
      "W. J. Fawcett",
      "A. Federowicz",
      "L. Feligioni",
      "L. Felsberger",
      "Y. Feng",
      "A. Fernández Téllez",
      "R. Ferrari",
      "L. Ferreira",
      "F. Ferro",
      "M. Fiascaris",
      "C. Fiorio",
      "S. A. Fleury",
      "L. Florez",
      "M. Florio",
      "A. Fondacci",
      "B. Fontimpe",
      "K. Foraz",
      "R. Fortunati",
      "M. Fouaidy",
      "A. Foussat",
      "A. Fowler",
      "J. D. Fox",
      "M. Francesconi",
      "R. Franqueira Ximenes",
      "F. Fransesini",
      "A. Frasca",
      "J. A. Frost",
      "K. Furukawa",
      "A. Gabrielli",
      "A. Gaddi",
      "F. Gaede",
      "A. Gallén",
      "R. Galler",
      "E. Gallice",
      "E. Gallo",
      "H. Gamper",
      "S. Ganjour",
      "S. Gao",
      "A. Garand",
      "C. Garaus",
      "D. Garcia",
      "R. Garcí a Alí a",
      "R. Garcí a Gil",
      "C. M. Garcia Jaimes",
      "H. Garcia Rodrigues",
      "C. Garion",
      "M. Garlaschè",
      "D. Garnier",
      "M. V. Garzelli",
      "S. Gascon-Shotkin",
      "M. Gasior",
      "G. Gaudino",
      "G. Gaudio",
      "V. Gaur",
      "K. Gautam",
      "V. Gawas",
      "T. Gehrmann",
      "A. Gehrmann-De Ridder",
      "K. Geiger",
      "M. Genco",
      "F. Gerigk",
      "H. Gerwig",
      "A. Ghribi",
      "P. Giacomelli",
      "S. Giagu",
      "E. Gianfelice",
      "S. Giappichini",
      "D. Gibellieri",
      "F. Giffoni",
      "G. Gil da Silveira",
      "S. S. Gilardoni",
      "M. Giovannetti",
      "T. Girardet",
      "S. Girod",
      "P. Giubellino",
      "P. Giubilato",
      "F. Giuli",
      "M. Giuliani",
      "E. L. Gkougkousis",
      "S. Glukhov",
      "J. Gluza",
      "B. Goddard",
      "C. Goffing",
      "D. Goldsworthy",
      "T. Golling",
      "R. Gonçalo",
      "V. P. Gonçalves",
      "T. Gonçalves Da Silva",
      "J. Gonski",
      "R. Gonzalez Suarez",
      "S. Gorgi Zadeh",
      "S. Gori",
      "E. Gorini",
      "L. Gouskos",
      "M. Gouzevitch",
      "E. Granados",
      "F. Grancagnolo",
      "S. Grancagnolo",
      "A. Grassellino",
      "A. Grau",
      "E. Graverini",
      "F. G. Gravili",
      "H. M. Gray",
      "M. Grazzini",
      "Mario Greco",
      "Michela Greco",
      "A. Greljo",
      "J-L. Grenard",
      "A. V. Gritsan",
      "R. Gröber",
      "A. Grudiev",
      "E. Gschwendtner",
      "J. Gu",
      "D. Guadagnoli",
      "G. Guerrieri",
      "A. Guiavarch",
      "G. Guillermo Canton",
      "M. Guinchard",
      "Y. O. Günaydin",
      "K. Gurcel",
      "L. X. Gutierrez Guerrero",
      "D. Gutiérrez Rueda",
      "A. Gutiérrez-Rodríguez",
      "V. Guzey",
      "C. Haber",
      "T. Hacheney",
      "B. Hacışahinoğlu",
      "K. Hahn",
      "J. Hajer",
      "T. Hakulinen",
      "J. C. Hammersley",
      "M. Hance",
      "J. B. Hansen",
      "B. Härer",
      "E. Hauzinger",
      "M. Haviernik",
      "B. Hegner",
      "C. Helsens",
      "Ana Henriques",
      "C. Hernalsteens",
      "H. Hernández-Arellano",
      "R. J. Hernández-Pinto",
      "M. A. Hernández-Ruíz",
      "J. Hernández-Sánchez",
      "J. W. Heron",
      "L. M. Herrmann",
      "R. Hirosky",
      "J. F. Hirschauer",
      "J. D. Hobbs",
      "K. Hock",
      "S. Höche",
      "M. Hofer",
      "G. Hoffstaetter",
      "W. Höfle",
      "M. Hohlmann",
      "F. Holdener",
      "B. Holzer",
      "C. G. Honorato",
      "H. Hoorani",
      "A. Houver",
      "E. Howling",
      "X. Huang",
      "F. Hug",
      "B. Humann",
      "P. Hunchak",
      "Y. Husein",
      "A. Hussain",
      "G. Iadarola",
      "G. Iakovidis",
      "G. Iaselli",
      "P. Iengo",
      "A. Ilg",
      "M. Iodice",
      "A. O. M. Iorio",
      "V. Ippolito",
      "U. Iriso",
      "J. Isaacson",
      "G. Isidori",
      "R. Islam",
      "A. Istepanyan",
      "S. Izquierdo Bermudez",
      "V. Izzo",
      "P. D. Jackson",
      "R. Jafari",
      "S. S. Jagabathuni",
      "S. Jana",
      "C. Järmyr Eriksson",
      "P. Jausserand",
      "M. Jensen",
      "J. M. Jimenez",
      "F. R. Joaquim",
      "O. R. Jones",
      "J. Joos",
      "E. Jourd'huy",
      "E. Jourdan",
      "J. M. Jowett",
      "A. Jueid",
      "A. W. Jung",
      "M. Kagan",
      "I. Kahraman",
      "V. Kain",
      "J. Kalinowski",
      "J. F. Kamenik",
      "A. Kanso",
      "T. Kar",
      "S. O. Kara",
      "H. Karadeniz",
      "S. R. Karmarkar",
      "V. Karpati",
      "I. Karpov",
      "M. Karppinen",
      "P. Karst",
      "S. Kartal",
      "V. V. Kashikhin",
      "U. Kaya",
      "A. Kehagias",
      "M. Kennouche",
      "M. Kenzie",
      "M. Kerréveur-Lavaud",
      "R. Kersevan",
      "V. Keus",
      "H. Khanpour",
      "V. V. Khoze",
      "V. A. Khoze",
      "P. Kicsiny",
      "R. Kieffer",
      "C. Kiel",
      "J. Kieseler",
      "A. Kilic",
      "B. Kilminster",
      "S. Kim",
      "Z. Kırca",
      "M. Klein",
      "A. Klimentov",
      "V. Klyukhin",
      "M. Knecht",
      "B. Kniehl",
      "P. Ko",
      "S. Ko",
      "F. Kocak",
      "T. Koffas",
      "C. Kokkinos",
      "K. Kołodziej",
      "K. Kong",
      "P. Kontaxakis",
      "I. A. Koop",
      "P. Kopciewicz",
      "P. Koppenburg",
      "M. Koratzinos",
      "K. Kordas",
      "A Korsun",
      "O. Kortner",
      "S. Kortner",
      "B. Korzh",
      "T. Koseki",
      "J. Kosse",
      "P. Kostka",
      "S. Kostoglou",
      "A. V. Kotwal",
      "G. Kozlov",
      "I. Kozsar",
      "T. Kramer",
      "P. Krkotić",
      "H. Kroha",
      "K. Kröninger",
      "S. Kuday",
      "G. Kuhlmann",
      "O. Kuhlmann",
      "M. Kuhn",
      "A. Kulesza",
      "M. Kumar",
      "F. Kurian",
      "A. Kurtulus",
      "T. H. Kwok",
      "S. La Mendola",
      "M. Lackner",
      "T. Ładziński",
      "D. Lafarge",
      "P. Laïdouni",
      "G. Lamanna",
      "N. Lamas",
      "G. Landsberg",
      "C. Lange",
      "D. J. Lange",
      "A. Langner",
      "A. J. Lankford",
      "L. Lari",
      "M. S. Larson",
      "K. Lasocha",
      "A. Latina",
      "S. Lauciani",
      "M. Laufenberg",
      "G. Lavezzari",
      "L. Lavezzi",
      "L. Lavezzo",
      "M. Le Garrec",
      "A. Le Jeune",
      "Ph. Lebrun",
      "Y. Léchevin",
      "A. Lechner",
      "E. Lecointe",
      "J. S. H. Lee",
      "S. W. Lee",
      "S. J. Lee",
      "T. Lefevre",
      "C. Leggett",
      "T. Lehtinen",
      "S. Leone",
      "C. Leonidopoulos",
      "S. Leontsinis",
      "G. Leprince-Maillère",
      "G. Lerner",
      "O. Leroy",
      "T. Lesiak",
      "P. Levai",
      "A. Leveratto",
      "R. Levi",
      "A. Li",
      "S. Li",
      "D. Liberati",
      "G. L. Lichtenstein",
      "M. Liepe",
      "Z. Ligeti",
      "H. Lin",
      "S. Linda",
      "E. Lipeles",
      "Z. Liu",
      "S. M. Liuzzo",
      "T. Loeliger",
      "A. Loeschcke Centeno",
      "A. Lorenzetti",
      "C. Lorin",
      "R. Losito",
      "M. Louka",
      "M. L. Loureiro García",
      "I. Low",
      "K. Lubonis",
      "M. T. Lucchini",
      "V. Lukashenko",
      "G. Luminati",
      "A. J. G. Lunt",
      "A. Lusiani",
      "M. Luzum",
      "H. Ma",
      "A. Maas",
      "E. Macchia",
      "A. Macchiolo",
      "G. E. Machinet",
      "R. Madar",
      "T. Madlener",
      "C. Madrid",
      "A. Magalotti",
      "M. Maggiora",
      "A. -M. Magnan",
      "M. A. Mahmoud",
      "Y. Mahmoud",
      "F. Mahmoudi",
      "H. Mainaud Durand",
      "J. Maitre",
      "Y. Makhloufi",
      "B. Malaescu",
      "A. Malagoli",
      "C. H. Malan",
      "M. Malekhosseini",
      "A. Maloizel",
      "S. Malvezzi",
      "A. Malzac",
      "G. Manco",
      "L. S. Mandacarú Guerra",
      "P. Manfrinetti",
      "E. Manoni",
      "J. Mans",
      "L. Mantani",
      "S. Manzoni",
      "L. Marafatto",
      "C. Marcel",
      "T. Marcel",
      "R. Marchevski",
      "G. Marchiori",
      "F. Mariani",
      "V. Mariani",
      "S. Marin",
      "C. Marinas",
      "V. Marinozzi",
      "S. Mariotto",
      "C. Marquis",
      "J. Martelain",
      "G. Martelli",
      "A. Martens",
      "I. Martin-Melero",
      "V. I. Martinez Outschoorn",
      "F. Martinez",
      "C. M. Jardim",
      "L. Marzola",
      "S. Masciocchi",
      "A. Mashal",
      "A. Masi",
      "I. Masina",
      "P. Mastrapasqua",
      "V. Mateu",
      "S. Mattiazzo",
      "M. Maugis",
      "D. Mauree",
      "G. H. I. Maury-Cuna",
      "A. Mayoux",
      "E. Mazzeo",
      "S. Mazzoni",
      "M. Meena",
      "E. Meftah",
      "Andrew Mehta",
      "Ankita Mehta",
      "B. Mele",
      "R. Mena-Andrade",
      "M. Mentink",
      "D. Mergelkuhl",
      "V. Mertinger",
      "L. Mether",
      "S. Meylan",
      "T. Michel",
      "T. Michlmayr",
      "M. Migliorati",
      "A. Milanese",
      "C. Milardi",
      "G. Milhano",
      "M. Minty",
      "C. Mirabelli",
      "T. Miralles",
      "L. Miralles Verge",
      "D. Mirarchi",
      "K. Mirbaghestan",
      "N. Mirian",
      "V. A. Mitsou",
      "D. S. Mitzel",
      "M. Mlynarikova",
      "S. Möbius",
      "M. Mohammadi Najafabadi",
      "G. B. Mohanty",
      "R. N. Mohapatra",
      "S. Moneta",
      "E. Monnier",
      "S. Monteil",
      "I. León Monzón",
      "F. Moortgat",
      "N. Morange",
      "M. Moretti",
      "S. Moretti",
      "T. Mori",
      "I. Morozov",
      "A. Morozzi",
      "M. Morrone",
      "A. Moscariello",
      "F. Moscatelli",
      "I. Moulin",
      "N. Mounet",
      "A. Mueller",
      "A. -S. Müller",
      "B. O. Müller",
      "J. Mundet",
      "E. Musa",
      "V. Musat",
      "R. Musenich",
      "E. Musumeci",
      "M. Mylona",
      "V. V. Mytrochenko",
      "B. Nachman",
      "S. Nagaitsev",
      "T. Nakamoto",
      "M. Napsuciale",
      "M. Nardecchia",
      "G. Nardini",
      "G. Narváez-Arango",
      "S. Naseem",
      "A. Natochii",
      "A. Navascues Cornago",
      "B. Naydenov",
      "G. Nergiz",
      "A. V. Nesterenko",
      "C. Neubüser",
      "H. B. Newman",
      "F. Niccoli",
      "O. Nicrosini",
      "U. Niedermayer",
      "G. Niehues",
      "J. Nielsen",
      "G. Nigrelli",
      "S. Nikitin",
      "I. B. Nikolaev",
      "A. Nisati",
      "N. Nitika",
      "J. M. No",
      "M. Nonis",
      "Y. Nosochkov",
      "A. Novokhatski",
      "J. M. O'Callaghan",
      "S. A. Ochoa-Oregon",
      "K. Ohmi",
      "K. Oide",
      "V. A. Okorokov",
      "C. Oleari",
      "D. Oliveira Damazio",
      "Y. Onel",
      "A. Onofre",
      "P. Osland",
      "Y. M. Oviedo-Torres",
      "A. Ozansoy",
      "F. Ozaydin",
      "K. Ozdemir",
      "A. Ozturk",
      "M. A. Pérez de León",
      "S. Pacetti",
      "H. Pacey",
      "J. Paciello",
      "C. E. Pagliarone",
      "A. Paillex",
      "H. F. Pais da Silva",
      "A. Pampaloni",
      "C. Pancotti",
      "M. Pandurović",
      "O. Panella",
      "G. Panizzo",
      "C. Pantouvakis",
      "L. Panwar",
      "P. Paolucci",
      "Y. Papa",
      "A. Papaefstathiou",
      "Y. Papaphilippou",
      "A. Paramonov",
      "A. Pareti",
      "B. Parker",
      "V. Parma",
      "F. Parodi",
      "M. Parodi",
      "B. Paroli",
      "J. A. Parsons",
      "D. Passarelli",
      "D. Passeri",
      "B. Pattnaik",
      "A. Patwa",
      "C. Paus",
      "F. Pauss",
      "F. Peauger",
      "I. Pedraza",
      "R. Pedro",
      "J. Pekkanen",
      "G. Peon",
      "A. Perez",
      "F. Pérez",
      "J. C. Perez",
      "J. M. Pérez",
      "R. Perez-Ramos",
      "G. Pérez Segurana",
      "A. Perillo Marcone",
      "S. Perna",
      "K. Peters",
      "S. Petracca",
      "A. R. Petri",
      "F. Petriello",
      "A. Petrovic",
      "L. Pezzotti",
      "G. Piacquadio",
      "G. Piazza",
      "A. Piccini",
      "F. Piccinini",
      "A. Pich",
      "T. Pieloni",
      "J. Pierlot",
      "A. D. Pilkington",
      "M. Pillet",
      "M. Pinamonti",
      "N. Pinto",
      "L. Pintucci",
      "F. Pinzauti",
      "K. Piotrzkowski",
      "C. Pira",
      "M. Pitt",
      "R. Pittau",
      "S. Pittet",
      "P. Placidi",
      "W. Płaczek",
      "S. Plätzer",
      "E. Ploerer",
      "H. Podlech",
      "F. Poirier",
      "G. Polesello",
      "M. Poli Lener",
      "J. Polinski",
      "Z. Polonsky",
      "N. Pompeo",
      "M. Pont",
      "G. Alexandru-Popeneciu",
      "W. Porod",
      "L. Porta",
      "L. Portales",
      "T. Portaluri",
      "M. A. C. Potenza",
      "C. Prasse",
      "E. Premat",
      "M. Presilla",
      "S. Prestemon",
      "A. Price",
      "M. Primavera",
      "R. Principe",
      "M. Prioli",
      "F. M. Procacci",
      "E. Proserpio",
      "A. Provino",
      "C. Pueyo",
      "T. Puig",
      "N. Pukhaeva",
      "S. Pulawski",
      "G. Punzi",
      "A. Pyarelal",
      "J. Qian",
      "H. Quack",
      "F. S. Queiroz",
      "G. Quintas-Neves",
      "H. Rafique",
      "J. -Y. Raguin",
      "J. Raidal",
      "M. Raidal",
      "P. Raimondi",
      "A. Rajabi",
      "S. Ramírez-Uribe",
      "S. Randles",
      "T. Rao",
      "C. Ø. Rasmussen",
      "A. Ratkus",
      "P. N. Ratoff",
      "P. Razis",
      "P. Rebello Teles",
      "M. N. Rebelo",
      "M. Reboud",
      "S. Redaelli",
      "C. Regazzoni",
      "L. Reichenbach",
      "M. Reissig",
      "E. Renou",
      "A. Rentería-Olivo",
      "J. Reuter",
      "S. Rey",
      "A. Ribon",
      "D. Ricci",
      "M. Rignanese",
      "S. Rimjaem",
      "R. A. Rimmer",
      "R. Rinaldesi",
      "L. Rinolfi",
      "O. Rios",
      "G. Ripellino",
      "B. Rivas",
      "A. Rivetti",
      "T. Robens",
      "F. Robert",
      "E. Robutti",
      "C. Roderick",
      "G. Rodrigo",
      "M. Rodríguez-Cahuantzi",
      "L. Röhrig",
      "M. Roig",
      "F. Rojat",
      "J. Rojo",
      "J. Roloff",
      "P. Roloff",
      "A. Romanenko",
      "A. Romero Francia",
      "H. Romeyer",
      "N. Rompotis",
      "N. Rongieras",
      "G. Rosaz",
      "K. Roslon",
      "M. Rossetti Conti",
      "A. Rossi",
      "E. Rossi",
      "L. Rossi",
      "A. N. Rossia",
      "S. Rostami",
      "G. Roy",
      "B. Rubik",
      "I. Ruehl",
      "A. Ruiz-Jimeno",
      "R. Ruprecht",
      "J. P. Rutherfoord",
      "L. Rygaard",
      "M. S. Ryu",
      "L. Sabato",
      "G. Sadowski",
      "D. Saez de Jauregui",
      "M. Sahin",
      "A. Sailer",
      "M. Saito",
      "P. Saiz",
      "G. P. Salam",
      "R. Salerno",
      "T. Salmi",
      "B. Salvachua",
      "J. P. T. Salvesen",
      "B. Salvi",
      "D. Sampsonidis",
      "Y. Villamizar",
      "C. Sandoval",
      "S. Sanfilippo",
      "E. Santopinto",
      "R. Santoro",
      "X. Sarasola",
      "L. Sarperi",
      "I. H. Sarpün",
      "S. Sasikumar",
      "M. Sauvain",
      "A. Savoy-Navarro",
      "R. Sawada",
      "G. Sborlini",
      "J. Scamardella",
      "M. Schaer",
      "M. Schaumann",
      "M. Schenk",
      "C. Scheuerlein",
      "C. Schiavi",
      "A. Schloegelhofer",
      "D. Schoerling",
      "A. Schöning",
      "S. Schramm",
      "D. Schulte",
      "P. Schwaller",
      "A. Schwartzman",
      "Ph. Schwemling",
      "R. Schwienhorst",
      "A. Sciandra",
      "L. Scibile",
      "I. Scimemi",
      "E. Scomparin",
      "C. Sebastiani",
      "B. Seeber",
      "J. T. Seeman",
      "M. Seidel",
      "S. Seidel",
      "J. Seixas",
      "N. Selimović",
      "C. Senatore",
      "A. Senol",
      "N. Serra",
      "A. Seryi",
      "A. Sfyrla",
      "Pramond Sharma",
      "Punit Sharma",
      "C. J. Sharp",
      "L. Shchutska",
      "V. Shiltsev",
      "M. Siano",
      "R. Sierra",
      "E. Silva",
      "R. C. Silva",
      "L. Silvestrini",
      "F. Simon",
      "G. Simonetti",
      "R. Simoniello",
      "B. K. Singh",
      "S. Singh",
      "B. Singhal",
      "A. Siodmok",
      "Y. Sirois",
      "E. Sirtori",
      "B. Sitar",
      "D. Sittard",
      "E. Sitti",
      "T. Sjöstrand",
      "P. Skands",
      "L. Skinnari",
      "K. Skoufaris",
      "K. Skovpen",
      "M. Skrzypek",
      "P. Slavich",
      "V. Slokenbergs",
      "V. Smaluk",
      "J. Smiesko",
      "S. S. Snyder",
      "E. Solano",
      "P. Sollander",
      "O. V. Solovyanov",
      "M. Son",
      "F. Sonnemann",
      "R. Soos",
      "F. Sopkova",
      "T. Sorais",
      "M. Sorbi",
      "S. Sorti",
      "R. Soualah",
      "M. Souayah",
      "L. Spallino",
      "S. Spanier",
      "P. Spiller",
      "M. Spira",
      "D. Stagnara",
      "M. Stallmann",
      "D. Standen",
      "J. L. Stanyard",
      "B. Stapf",
      "G. H. Stark",
      "M. Statera",
      "C. Staudinger",
      "G. Streicher",
      "N. P. Strohmaier",
      "R. Stroynowski",
      "S. Stucci",
      "G. Stupakov",
      "S. Su",
      "A. Sublet",
      "K. Sugita",
      "M. K. Sullivan",
      "S. Sultansoy",
      "I. Syratchev",
      "R. Szafron",
      "A. Sznajder",
      "W. Tachon",
      "N. D. Tagdulang",
      "N. A. Tahir",
      "Y. Takahashi",
      "J. Tamazirt",
      "S. Tang",
      "Y. Tanimoto",
      "I. Tapan",
      "G. F. Tassielli",
      "A. M. Teixeira",
      "V. I. Telnov",
      "H. H. J. Ten Kate",
      "V. Teotia",
      "J. ter Hoeve",
      "A. Thabuis",
      "G. T. Telles",
      "A. Tishelman-Charny",
      "S. Tissandier",
      "S. Tizchang",
      "J. -P. Tock",
      "B. Todd",
      "L. Toffolin",
      "A. Tolosa-Delgado",
      "R. Tomás García",
      "T. Tomasini",
      "G. Tonelli",
      "T. Tong",
      "F. Toral",
      "T. Torims",
      "L. Torino",
      "K. Torokhtii",
      "R. Torre",
      "E. Torrence",
      "R. Torres",
      "T. Mitsuhashi",
      "A. Tracogna",
      "O. Traver",
      "D. Treille",
      "A. Tricoli",
      "P. Trubacova",
      "E. Tsesmelis",
      "G. Tsipolitis",
      "V. Tsulaia",
      "B. Tuchming",
      "C. G. Tully",
      "I. Turk Cakir",
      "C. Turrioni",
      "J. Tynan",
      "F. P. Ucci",
      "S. Udongwo",
      "C. S. Ün",
      "A. Unnervik",
      "A. Upegui",
      "J. P. Uribe-Ramírez",
      "J. Uythoven",
      "R. Vaglio",
      "F. Valchkova-Georgieva",
      "P. Valente",
      "R. U. Valente",
      "A. -M. Valente-Feliciano",
      "G. Valentino",
      "C. A. Valerio-Lizarraga",
      "S. Valette",
      "J. W. F. Valle",
      "L. Valle",
      "N. Valle",
      "N. Vallis",
      "G. Vallone",
      "P. van Gemmeren",
      "W. Van Goethem",
      "P. van Hees",
      "U. van Rienen",
      "L. van Riesen-Haupt",
      "P. Van Trappen",
      "M. Vande Voorde",
      "A. L. Vanel",
      "E. W. Varnes",
      "J. -L. Vay",
      "F. Veit",
      "I. Veliscek",
      "R. Veness",
      "A. Ventura",
      "M. Verducci",
      "C. B. Verhaaren",
      "C. Vernieri",
      "A. P. Verweij",
      "J. -F. Vian",
      "A. Vicini",
      "N. Vignaroli",
      "S. Vignetti",
      "M. C. Villeneuve",
      "I. Vivarelli",
      "E. Voevodina",
      "D. M. Vogt",
      "B. Voirin",
      "S. Voiriot",
      "J. Voiron",
      "P. Vojtyla",
      "V. Völkl",
      "L. von Freeden",
      "Z. Vostrel",
      "N. Voumard",
      "E. Vryonidou",
      "V. Vysotsky",
      "R. Wallny",
      "L. -T. Wang",
      "Y. Wang",
      "R. Wanzenberg",
      "B. F. L. Ward",
      "N. Wardle",
      "Z. Wcas",
      "L. Watrelot",
      "A. T. Watson",
      "M. F. Watson",
      "M. S. Weber",
      "C. P. Welsch",
      "M. Wendt",
      "J. Wenninger",
      "B. Weyer",
      "G. White",
      "S. White",
      "B. Wicki",
      "M. Widorski",
      "U. A. Wiedemann",
      "A. R. Wiederhold",
      "A . Wiedl",
      "H. -U. Wienands",
      "A. Wieser",
      "C. Wiesner",
      "H. Wilkens",
      "D. Willi",
      "P. H. Williams",
      "S. L. Williams",
      "A. Winter",
      "R. B. Wittwer",
      "D. Wollmann",
      "Y. Wu",
      "Z. Wu",
      "J. Xiao",
      "K. Xie",
      "S. Xie",
      "M. Yalvac",
      "F. Yaman",
      "W. -M. Yao",
      "M. Yeresko",
      "A. Yilmaz",
      "H. D. Yoo",
      "T. You",
      "F. Yu",
      "S. S. Yu",
      "T. -T. Yu",
      "S. Yue",
      "A. Zaborowska",
      "M. Zahnd",
      "C. Zamantzas",
      "G. Zanderighi",
      "C. Zannini",
      "R. Zanzottera",
      "P. Zaro",
      "R. Zennaro",
      "M. Zerlauth",
      "H. Zhang",
      "J. Zhang",
      "Y. Zhang",
      "Z. Zhang",
      "Y. Zhao",
      "Y. -M. Zhong",
      "B. Zhou",
      "D. Zhou",
      "J. Zhu",
      "G. Zick",
      "M. A. Zielinski",
      "E. Zimmermann",
      "A. Zingaretti",
      "J. Zinn-Justin",
      "A. V. Zlobin",
      "M. Zobov",
      "F. Zomer",
      "S. Zorzetti",
      "X. Zuo",
      "J. Zurita",
      "V. V. Zutshi",
      "M. Zykova"
    ],
    "publication_date": "2025-04-25T20:04:20Z",
    "arxiv_id": "http://arxiv.org/abs/2505.00273v1",
    "download_url": "https://arxiv.org/abs/2505.00273v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Model-Driven Engineering Approach for ROS using Ontological Semantics",
    "abstract": "This paper presents a novel ontology-driven software engineering approach for the development of industrial robotics control software. It introduces the ReApp architecture that synthesizes model-driven engineering with semantic technologies to facilitate the development and reuse of ROS-based components and applications. In ReApp, we show how different ontological classification systems for hardware, software, and capabilities help developers in discovering suitable software components for their tasks and in applying them correctly. The proposed model-driven tooling enables developers to work at higher abstraction levels and fosters automatic code generation. It is underpinned by ontologies to minimize discontinuities in the development workflow, with an integrated development environment presenting a seamless interface to the user. First results show the viability and synergy of the selected approach when searching for or developing software with reuse in mind.",
    "authors": [
      "Stefan Zander",
      "Georg Heppner",
      "Georg Neugschwandtner",
      "Ramez Awad",
      "Marc Essinger",
      "Nadia Ahmed"
    ],
    "publication_date": "2016-01-15T16:53:37Z",
    "arxiv_id": "http://arxiv.org/abs/1601.03998v1",
    "download_url": "https://arxiv.org/abs/1601.03998v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Architecture Process Maturity Model of Software Product Line Engineering",
    "abstract": "Software architecture has been a key research area in the software engineering community due to its significant role in creating high quality software. The trend of developing product lines rather than single products has made the software product line a viable option in the industry. Software product line architecture is regarded as one of the crucial components in the product lines, since all of the resulting products share this common architecture. The increased popularity of software product lines demands a process maturity evaluation methodology. Consequently, this paper presents an architecture process maturity model for software product line engineering to evaluate the current maturity of the product line architecture development process in an organization. Assessment questionnaires and a rating methodology comprise the framework of this model. The objective of the questionnaires is to collect information about the software product line architecture development process. Thus, in general this work contributes towards the establishment of a comprehensive and unified strategy for the process maturity evaluation of software product line engineering. Furthermore, we conducted two case studies and reported the assessment results, which show the maturity of the architecture development process in two organizations",
    "authors": [
      "Faheem Ahmed",
      "Luiz Fernando Capretz"
    ],
    "publication_date": "2015-07-24T16:03:35Z",
    "arxiv_id": "http://arxiv.org/abs/1507.06901v1",
    "download_url": "https://arxiv.org/abs/1507.06901v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Manifesto - Model Engineering for Complex Systems",
    "abstract": "Complex systems are hard to define. Nevertheless they are more and more frequently encountered. Examples include a worldwide airline traffic management system, a global telecommunication or energy infrastructure or even the whole legacy portfolio accumulated for more than thirty years in a large insurance company. There are currently few engineering methods and tools to deal with them in practice. The purpose of this Dagstuhl Perspectives Workshop on Model Engineering for Complex Systems was to study the applicability of Model Driven Engineering (MDE) to the development and management of complex systems. MDE is a software engineering field based on few simple and sound principles. Its power stems from the assumption of considering everything - engineering artefacts, manipulations of artefacts, etc - as a model. Our intuition was that MDE may provide the right level of abstraction to move the study of complex systems from an informal goal to more concrete grounds. In order to provide first evidence in support of this intuition, the workshop studied different visions and different approaches to the development and management of different kinds of complex systems. This note presents the summary of the discussions.",
    "authors": [
      "Jean Bézivin",
      "Richard F. Paige",
      "Uwe Aßmann",
      "Bernhard Rumpe",
      "Doug Schmidt"
    ],
    "publication_date": "2014-09-22T12:22:10Z",
    "arxiv_id": "http://arxiv.org/abs/1409.6591v1",
    "download_url": "https://arxiv.org/abs/1409.6591v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SyncDreamer for 3D Reconstruction of Endangered Animal Species with NeRF and NeuS",
    "abstract": "The main aim of this study is to demonstrate how innovative view synthesis and 3D reconstruction techniques can be used to create models of endangered species using monocular RGB images. To achieve this, we employed SyncDreamer to produce unique perspectives and NeuS and NeRF to reconstruct 3D representations. We chose four different animals, including the oriental stork, frog, dragonfly, and tiger, as our subjects for this study. Our results show that the combination of SyncDreamer, NeRF, and NeuS techniques can successfully create 3D models of endangered animals. However, we also observed that NeuS produced blurry images, while NeRF generated sharper but noisier images. This study highlights the potential of modeling endangered animals and offers a new direction for future research in this field. By showcasing the effectiveness of these advanced techniques, we hope to encourage further exploration and development of techniques for preserving and studying endangered species.",
    "authors": [
      "Ahmet Haydar Ornek",
      "Deniz Sen",
      "Esmanur Civil"
    ],
    "publication_date": "2023-12-21T13:32:38Z",
    "arxiv_id": "http://arxiv.org/abs/2312.13832v1",
    "download_url": "https://arxiv.org/abs/2312.13832v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "POE-$Δ$: a framework for change engineering",
    "abstract": "Many organisational problems are addressed through systemic change and re-engineering of existing Information Systems rather than radical new design. In the face of widespread IT project failure, devising effective ways to tackle this type of change remains an open challenge. This work discusses the motivation, theoretical foundation, characteristics and evaluation of a novel framework - referred to as POE-$Δ$, which is rooted in design and engineering and is aimed at providing systematic support for representing, structuring and exploring change problems of a socio-technical nature, including implementing their solutions when they exist. We generalise an existing framework of greenfield design as problem solving for application to change problems. From a theoretical perspective,POE-$Δ$ is a strict extension to its parent framework, allowing the seamless integration of greenfield and brownfield design to tackle change problems.\n  A Design Science Research methodology was applied over a decade to define and evaluate POE-$Δ$, with significant case study research conducted to evaluate the framework in its application to real-world change problems of varying criticality and complexity. The results show that POE-$Δ$ exhibits desirable characteristics of a design approach to organisational change and can bring tangible benefits when applied in practice as a holistic and systematic approach to change in socio-technical contexts.",
    "authors": [
      "Georgi Markov",
      "Jon G. Hall",
      "Lucia Rapanotti"
    ],
    "publication_date": "2025-04-03T14:28:06Z",
    "arxiv_id": "http://arxiv.org/abs/2504.03780v1",
    "download_url": "https://arxiv.org/abs/2504.03780v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software Engineering for AI-Based Systems: A Survey",
    "abstract": "AI-based systems are software systems with functionalities enabled by at least one AI component (e.g., for image- and speech-recognition, and autonomous driving). AI-based systems are becoming pervasive in society due to advances in AI. However, there is limited synthesized knowledge on Software Engineering (SE) approaches for building, operating, and maintaining AI-based systems. To collect and analyze state-of-the-art knowledge about SE for AI-based systems, we conducted a systematic mapping study. We considered 248 studies published between January 2010 and March 2020. SE for AI-based systems is an emerging research area, where more than 2/3 of the studies have been published since 2018. The most studied properties of AI-based systems are dependability and safety. We identified multiple SE approaches for AI-based systems, which we classified according to the SWEBOK areas. Studies related to software testing and software quality are very prevalent, while areas like software maintenance seem neglected. Data-related issues are the most recurrent challenges. Our results are valuable for: researchers, to quickly understand the state of the art and learn which topics need more research; practitioners, to learn about the approaches and challenges that SE entails for AI-based systems; and, educators, to bridge the gap among SE and AI in their curricula.",
    "authors": [
      "Silverio Martínez-Fernández",
      "Justus Bogner",
      "Xavier Franch",
      "Marc Oriol",
      "Julien Siebert",
      "Adam Trendowicz",
      "Anna Maria Vollmer",
      "Stefan Wagner"
    ],
    "publication_date": "2021-05-05T11:22:08Z",
    "arxiv_id": "http://arxiv.org/abs/2105.01984v2",
    "download_url": "https://arxiv.org/abs/2105.01984v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unmanned Aerial Vehicles: A Survey on Civil Applications and Key Research Challenges",
    "abstract": "The use of unmanned aerial vehicles (UAVs) is growing rapidly across many civil application domains including real-time monitoring, providing wireless coverage, remote sensing, search and rescue, delivery of goods, security and surveillance, precision agriculture, and civil infrastructure inspection. Smart UAVs are the next big revolution in UAV technology promising to provide new opportunities in different applications, especially in civil infrastructure in terms of reduced risks and lower cost. Civil infrastructure is expected to dominate the more that $45 Billion market value of UAV usage. In this survey, we present UAV civil applications and their challenges. We also discuss current research trends and provide future insights for potential UAV uses. Furthermore, we present the key challenges for UAV civil applications, including: charging challenges, collision avoidance and swarming challenges, and networking and security related challenges. Based on our review of the recent literature, we discuss open research challenges and draw high-level insights on how these challenges might be approached.",
    "authors": [
      "Hazim Shakhatreh",
      "Ahmad Sawalmeh",
      "Ala Al-Fuqaha",
      "Zuochao Dou",
      "Eyad Almaita",
      "Issa Khalil",
      "Noor Shamsiah Othman",
      "Abdallah Khreishah",
      "Mohsen Guizani"
    ],
    "publication_date": "2018-04-19T17:55:07Z",
    "arxiv_id": "http://arxiv.org/abs/1805.00881v1",
    "download_url": "https://arxiv.org/abs/1805.00881v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How Tertiary Studies perform Quality Assessment of Secondary Studies in Software Engineering",
    "abstract": "Context: Tertiary studies are becoming increasingly popular in software engineering as an instrument to synthesise evidence on a research topic in a systematic way. In order to understand and contextualize their findings, it is important to assess the quality of the selected secondary studies. Objective: This paper aims to provide a state of the art on the assessment of secondary studies' quality as conducted in tertiary studies in the area of software engineering, reporting the frameworks used as instruments, the facets examined in these frameworks, and the purposes of the quality assessment. Method: We designed this study as a systematic mapping responding to four research questions derived from the objective above. We applied a rigorous search protocol over the Scopus digital library, resulting in 47 papers after application of inclusion and exclusion criteria. The extracted data was synthesised using content analysis. Results: A majority of tertiary studies perform quality assessment. It is not often used for excluding studies, but to support some kind of investigation. The DARE quality assessment framework is the most frequently used, with customizations in some cases to cover missing facets. We outline the first steps towards building a new framework to address the shortcomings identified. Conclusion: This paper is a step forward establishing a foundation for researchers in two different ways. As authors of tertiary studies, understanding the different possibilities in which they can perform quality assessment of secondary studies. As readers, having an instrument to understand the methodological rigor upon which tertiary studies may claim their findings.",
    "authors": [
      "Dolors Costal",
      "Carles Farré",
      "Xavier Franch",
      "Carme Quer"
    ],
    "publication_date": "2021-10-07T22:45:30Z",
    "arxiv_id": "http://arxiv.org/abs/2110.03820v1",
    "download_url": "https://arxiv.org/abs/2110.03820v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Concept Identification for Complex Engineering Datasets",
    "abstract": "Finding meaningful concepts in engineering application datasets which allow for a sensible grouping of designs is very helpful in many contexts. It allows for determining different groups of designs with similar properties and provides useful knowledge in the engineering decision making process. Also, it opens the route for further refinements of specific design candidates which exhibit certain characteristic features. In this work, an approach to define meaningful and consistent concepts in an existing engineering dataset is presented. The designs in the dataset are characterized by a multitude of features such as design parameters, geometrical properties or performance values of the design for various boundary conditions. In the proposed approach the complete feature set is partitioned into several subsets called description spaces. The definition of the concepts respects this partitioning which leads to several desired properties of the identified concepts. This cannot be achieved with state-of-the-art clustering or concept identification approaches. A novel concept quality measure is proposed, which provides an objective value for a given definition of concepts in a dataset. The usefulness of the measure is demonstrated by considering a realistic engineering dataset consisting of about 2500 airfoil profiles, for which the performance values (lift and drag) for three different operating conditions were obtained by a computational fluid dynamics simulation. A numerical optimization procedure is employed, which maximizes the concept quality measure and finds meaningful concepts for different setups of the description spaces, while also incorporating user preference. It is demonstrated how these concepts can be used to select archetypal representatives of the dataset which exhibit characteristic features of each concept.",
    "authors": [
      "Felix Lanfermann",
      "Sebastian Schmitt"
    ],
    "publication_date": "2022-06-09T09:39:46Z",
    "arxiv_id": "http://arxiv.org/abs/2206.06155v2",
    "download_url": "https://arxiv.org/abs/2206.06155v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding Fairness in Software Engineering: Insights from Stack Exchange",
    "abstract": "Software practitioners discuss problems at work with peers, in-person and online. These discussions can be technical (e.g., how to fix a bug?) and social (e.g., how to assign work fairly?). While there is a growing body of knowledge exploring fairness problems and solutions in the human and social factors of software engineering, most focus has been on specific problems. This study provides fairness discussions by software practitioners on Stack Exchange sites. We present an exploratory study presenting the fairness experience of software practitioners and fairness expectations in software teams. We also want to identify the fairness aspects software practitioners talk about the most. For example, do they care more about fairness in income or how they are treated in the workplace?\n  Our investigation of fairness discussions on eight Stack Exchange sites resulted in a list of 136 posts (28 questions and 108 answers) manually curated from 4,178 candidate posts. The study reveals that the majority of fairness discussions (24 posts) revolve around the topic of income suggesting that many software practitioners are highly interested in matters related to their pay and how it is fairly distributed. Further, we noted that while not discussed as often, discussions on fairness in recruitment tend to receive the highest number of views and scores. Interestingly, the study shows that unfairness experiences extend beyond the protected attributes. In this study, only 25 out of 136 posts mention protected attributes, with gender mainly being discussed.",
    "authors": [
      "Emeralda Sesari",
      "Federica Sarro",
      "Ayushi Rastogi"
    ],
    "publication_date": "2024-02-29T11:02:47Z",
    "arxiv_id": "http://arxiv.org/abs/2402.19038v3",
    "download_url": "https://arxiv.org/abs/2402.19038v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Embracing Experiential Learning: Hackathons as an Educational Strategy for Shaping Soft Skills in Software Engineering",
    "abstract": "In recent years, Software Engineering (SE) scholars and practitioners have emphasized the importance of integrating soft skills into SE education. However, teaching and learning soft skills are complex, as they cannot be acquired passively through raw knowledge acquisition. On the other hand, hackathons have attracted increasing attention due to their experiential, collaborative, and intensive nature, which certain tasks could be similar to real-world software development. This paper aims to discuss the idea of hackathons as an educational strategy for shaping SE students' soft skills in practice. Initially, we overview the existing literature on soft skills and hackathons in SE education. Then, we report preliminary empirical evidence from a seven-day hybrid hackathon involving 40 students. We assess how the hackathon experience promoted innovative and creative thinking, collaboration and teamwork, and knowledge application among participants through a structured questionnaire designed to evaluate students' self-awareness. Lastly, our findings and new directions are analyzed through the lens of Self-Determination Theory, which offers a psychological lens to understand human behavior. This paper contributes to academia by advocating the potential of hackathons in SE education and proposing concrete plans for future research within SDT. For industry, our discussion has implications around developing soft skills in future SE professionals, thereby enhancing their employability and readiness in the software market.",
    "authors": [
      "Allysson Allex Araújo",
      "Marcos Kalinowski",
      "Maria Teresa Baldassarre"
    ],
    "publication_date": "2025-02-11T20:58:33Z",
    "arxiv_id": "http://arxiv.org/abs/2502.07950v1",
    "download_url": "https://arxiv.org/abs/2502.07950v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Artefact-based Requirements Engineering for Data-Centric Systems",
    "abstract": "Many modern software-intensive systems employ artificial intelligence / machine-learning (AI/ML) components and are, thus, inherently data-centric. The behaviour of such systems depends on typically large amounts of data processed at run-time rendering such non-deterministic systems as complex. This complexity growth affects our understanding on needs and practices in Requirements Engineering (RE). There is, however, still little guidance on how to handle requirements for such systems effectively: What are, for example, typical quality requirements classes? What modelling concepts do we rely on or which levels of abstraction do we need to consider? In fact, how to integrate such concepts into approaches for a more traditional RE still needs profound investigations. In this research preview paper, we report on ongoing efforts to establish an artefact-based RE approach for the development of datacentric systems (DCSs). To this end, we sketch a DCS development process with the newly proposed requirements categories and data-centric artefacts and briefly report on an ongoing investigation of current RE challenges in industry developing data-centric systems.",
    "authors": [
      "Tatiana Chuprina",
      "Daniel Mendez",
      "Krzysztof Wnuk"
    ],
    "publication_date": "2021-03-09T05:44:16Z",
    "arxiv_id": "http://arxiv.org/abs/2103.05233v1",
    "download_url": "https://arxiv.org/abs/2103.05233v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Problem of Civil and Criminal Identification -- Bayesian Networks Approach",
    "abstract": "DNA evidence use in problems of civil and criminal identification is becoming greater. The necessity of evaluating the weight of that evidence may be accomplished using one of the most known powerful tools: the Bayesian networks. In the current paper this will be illustrated through the presentation of a civil identification problem and of a criminal identification problem.",
    "authors": [
      "Marina Andrade",
      "Manuel Alberto M. Ferreira"
    ],
    "publication_date": "2025-11-19T15:05:50Z",
    "arxiv_id": "http://arxiv.org/abs/2511.21719v1",
    "download_url": "https://arxiv.org/abs/2511.21719v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How Developers Interact with AI: A Taxonomy of Human-AI Collaboration in Software Engineering",
    "abstract": "Artificial intelligence (AI), including large language models and generative AI, is emerging as a significant force in software development, offering developers powerful tools that span the entire development lifecycle. Although software engineering research has extensively studied AI tools in software development, the specific types of interactions between developers and these AI-powered tools have only recently begun to receive attention. Understanding and improving these interactions has the potential to enhance productivity, trust, and efficiency in AI-driven workflows. In this paper, we propose a taxonomy of interaction types between developers and AI tools, identifying eleven distinct interaction types, such as auto-complete code suggestions, command-driven actions, and conversational assistance. Building on this taxonomy, we outline a research agenda focused on optimizing AI interactions, improving developer control, and addressing trust and usability challenges in AI-assisted development. By establishing a structured foundation for studying developer-AI interactions, this paper aims to stimulate research on creating more effective, adaptive AI tools for software development.",
    "authors": [
      "Christoph Treude",
      "Marco A. Gerosa"
    ],
    "publication_date": "2025-01-15T12:53:49Z",
    "arxiv_id": "http://arxiv.org/abs/2501.08774v2",
    "download_url": "https://arxiv.org/abs/2501.08774v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "LexRel: Benchmarking Legal Relation Extraction for Chinese Civil Cases",
    "abstract": "Legal relations form a highly consequential analytical framework of civil law system, serving as a crucial foundation for resolving disputes and realizing values of the rule of law in judicial practice. However, legal relations in Chinese civil cases remain underexplored in the field of legal artificial intelligence (legal AI), largely due to the absence of comprehensive schemas. In this work, we firstly introduce a comprehensive schema, which contains a hierarchical taxonomy and definitions of arguments, for AI systems to capture legal relations in Chinese civil cases. Based on this schema, we then formulate legal relation extraction task and present LexRel, an expert-annotated benchmark for legal relation extraction in Chinese civil law. We use LexRel to evaluate state-of-the-art large language models (LLMs) on legal relation extractions, showing that current LLMs exhibit significant limitations in accurately identifying civil legal relations. Furthermore, we demonstrate that incorporating legal relations information leads to consistent performance gains on other downstream legal AI tasks.",
    "authors": [
      "Yida Cai",
      "Ranjuexiao Hu",
      "Huiyuan Xie",
      "Chenyang Li",
      "Yun Liu",
      "Yuxiao Ye",
      "Zhenghao Liu",
      "Weixing Shen",
      "Zhiyuan Liu"
    ],
    "publication_date": "2025-12-14T11:16:39Z",
    "arxiv_id": "http://arxiv.org/abs/2512.12643v1",
    "download_url": "https://arxiv.org/abs/2512.12643v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Qualitative analysis of the relationship between design smells and software engineering challenges",
    "abstract": "Software design debt aims to elucidate the rectification attempts of the present design flaws and studies the influence of those to the cost and time of the software. Design smells are a key cause of incurring design debt. Although the impact of design smells on design debt have been predominantly considered in current literature, how design smells are caused due to not following software engineering best practices require more exploration. This research provides a tool which is used for design smell detection in Java software by analyzing large volume of source codes. More specifically, 409,539 Lines of Code (LoC) and 17,760 class files of open source Java software are analyzed here. Obtained results show desirable precision values ranging from 81.01\\% to 93.43\\%. Based on the output of the tool, a study is conducted to relate the cause of the detected design smells to two software engineering challenges namely \"irregular team meetings\" and \"scope creep\". As a result, the gained information will provide insight to the software engineers to take necessary steps of design remediation actions.",
    "authors": [
      "Asif Imran",
      "Tevfik Kosar"
    ],
    "publication_date": "2023-10-22T23:21:13Z",
    "arxiv_id": "http://arxiv.org/abs/2310.14449v1",
    "download_url": "https://arxiv.org/abs/2310.14449v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding the Affect of Developers: Theoretical Background and Guidelines for Psychoempirical Software Engineering",
    "abstract": "Affects---emotions and moods---have an impact on cognitive processing activities and the working performance of individuals. It has been established that software development tasks are undertaken through cognitive processing activities. Therefore, we have proposed to employ psychology theory and measurements in software engineering (SE) research. We have called it \"psychoempirical software engineering\". However, we found out that existing SE research has often fallen into misconceptions about the affect of developers, lacking in background theory and how to successfully employ psychological measurements in studies. The contribution of this paper is threefold. (1) It highlights the challenges to conduct proper affect-related studies with psychology; (2) it provides a comprehensive literature review in affect theory; and (3) it proposes guidelines for conducting psychoempirical software engineering.",
    "authors": [
      "Daniel Graziotin",
      "Xiaofeng Wang",
      "Pekka Abrahamsson"
    ],
    "publication_date": "2015-07-14T08:44:54Z",
    "arxiv_id": "http://arxiv.org/abs/1507.03767v2",
    "download_url": "https://arxiv.org/abs/1507.03767v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Automated and Risk-Aware Engine Control Calibration Using Constrained Bayesian Optimization",
    "abstract": "Decarbonization of the transport sector sets increasingly strict demands to maximize thermal efficiency and minimize greenhouse gas emissions of Internal Combustion Engines. This has led to complex engines with a surge in the number of corresponding tunable parameters in actuator set points and control settings. Automated calibration is therefore essential to keep development time and costs at acceptable levels. In this work, an innovative self-learning calibration method is presented based on in-cylinder pressure curve shaping. This method combines Principal Component Decomposition with constrained Bayesian Optimization. To realize maximal thermal engine efficiency, the optimization problem aims at minimizing the difference between the actual in-cylinder pressure curve and an Idealized Thermodynamic Cycle. By continuously updating a Gaussian Process Regression model of the pressure's Principal Components weights using measurements of the actual operating conditions, the mean in-cylinder pressure curve as well as its uncertainty bounds are learned. This information drives the optimization of calibration parameters, which are automatically adapted while dealing with the risks and uncertainties associated with operational safety and combustion stability. This data-driven method does not require prior knowledge of the system. The proposed method is successfully demonstrated in simulation using a Reactivity Controlled Compression Ignition engine model. The difference between the Gross Indicated Efficiency of the optimal solution found and the true optimum is 0.017%. For this complex engine, the optimal solution was found after 64.4s, which is relatively fast compared to conventional calibration methods.",
    "authors": [
      "Maarten Vlaswinkel",
      "Duarte Antunes",
      "Frank Willems"
    ],
    "publication_date": "2025-03-26T12:32:53Z",
    "arxiv_id": "http://arxiv.org/abs/2503.20493v1",
    "download_url": "https://arxiv.org/abs/2503.20493v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "\"Software is the easy part of Software Engineering\" -- Lessons and Experiences from A Large-Scale, Multi-Team Capstone Course",
    "abstract": "Capstone courses in undergraduate software engineering are a critical final milestone for students. These courses allow students to create a software solution and demonstrate the knowledge they accumulated in their degrees. However, a typical capstone project team is small containing no more than 5 students and function independently from other teams. To better reflect real-world software development and meet industry demands, we introduce in this paper our novel capstone course. Each student was assigned to a large-scale, multi-team (i.e., company) of up to 20 students to collaboratively build software. Students placed in a company gained first-hand experiences with respect to multi-team coordination, integration, communication, agile, and teamwork to build a microservices based project. Furthermore, each company was required to implement plug-and-play so that their services would be compatible with another company, thereby sharing common APIs. Through developing the product in autonomous sub-teams, the students enhanced not only their technical abilities but also their soft skills such as communication and coordination. More importantly, experiencing the challenges that arose from the multi-team project trained students to realize the pitfalls and advantages of organizational culture. Among many lessons learned from this course experience, students learned the critical importance of building team trust. We provide detailed information about our course structure, lessons learned, and propose recommendations for other universities and programs. Our work concerns educators interested in launching similar capstone projects so that students in other institutions can reap the benefits of large-scale, multi-team development",
    "authors": [
      "Ze Shi Li",
      "Nowshin Nawar Arony",
      "Kezia Devathasan",
      "Daniela Damian"
    ],
    "publication_date": "2023-02-10T22:33:35Z",
    "arxiv_id": "http://arxiv.org/abs/2302.05536v1",
    "download_url": "https://arxiv.org/abs/2302.05536v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Requirements to Code: Understanding Developer Practices in LLM-Assisted Software Engineering",
    "abstract": "With the advent of generative LLMs and their advanced code generation capabilities, some people already envision the end of traditional software engineering, as LLMs may be able to produce high-quality code based solely on the requirements a domain expert feeds into the system. The feasibility of this vision can be assessed by understanding how developers currently incorporate requirements when using LLMs for code generation-a topic that remains largely unexplored. We interviewed 18 practitioners from 14 companies to understand how they (re)use information from requirements and other design artifacts to feed LLMs when generating code. Based on our findings, we propose a theory that explains the processes developers employ and the artifacts they rely on. Our theory suggests that requirements, as typically documented, are too abstract for direct input into LLMs. Instead, they must first be manually decomposed into programming tasks, which are then enriched with design decisions and architectural constraints before being used in prompts. Our study highlights that fundamental RE work is still necessary when LLMs are used to generate code. Our theory is important for contextualizing scientific approaches to automating requirements-centric SE tasks.",
    "authors": [
      "Jonathan Ullrich",
      "Matthias Koch",
      "Andreas Vogelsang"
    ],
    "publication_date": "2025-07-10T08:42:19Z",
    "arxiv_id": "http://arxiv.org/abs/2507.07548v1",
    "download_url": "https://arxiv.org/abs/2507.07548v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Addressing Age-Related Accessibility Needs of Senior Users Through Model-Driven Engineering",
    "abstract": "One of the main reasons that cause seniors to face accessibility barriers when trying to use software applications is that the age-related user interface (UI) needs of seniors (e.g., physical and cognitive limitations) are not properly addressed in software user interfaces. The existing literature proposes model-driven engineering based UI adaptations as a prominent solution for this phenomenon. But in our exploration into the domain, we identified that the existing work lacks comprehensiveness when it comes to integrating accessibility into software modelling tools and methods when compared to a well-recognised accessibility standard such as the Web Content Accessibility Guidelines (WCAG). Thus in this paper, we outline a research roadmap that aims to use WCAG as a reference framework to design domain-specific languages that model the diverse accessibility scenarios of senior users via user context information and UI adaptation rules modelling so that they meet the accessibility standards specified in WCAG.",
    "authors": [
      "Shavindra Wickramathilaka",
      "Ingo Mueller"
    ],
    "publication_date": "2023-05-01T07:33:33Z",
    "arxiv_id": "http://arxiv.org/abs/2305.00695v2",
    "download_url": "https://arxiv.org/abs/2305.00695v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Action Research with Industrial Software Engineering -- An Educational Perspective",
    "abstract": "Action research provides the opportunity to explore the usefulness and usability of software engineering methods in industrial settings, and makes it possible to develop methods, tools and techniques with software engineering practitioners. However, as the research moves beyond the observational approach, it requires a different kind of interaction with the software development organisation. This makes action research a challenging endeavour, and it makes it difficult to teach action research through a course that goes beyond explaining the principles.\n  This chapter is intended to support learning and teaching action research, by providing a rich set of examples, and identifying tools that we found helpful in our action research projects. The core of this chapter focusses on our interaction with the participating developers and domain experts, and the organisational setting.\n  This chapter is structured around a set of challenges that reoccurred in the action research projects in which the authors participated. Each section is accompanied by a toolkit that presents related techniques and tools. The exercises are designed to explore the topics, and practise using the tools and techniques presented. We hope the material in this chapter encourages researchers who are new to action research to further explore this promising opportunity.",
    "authors": [
      "Yvonne Dittrich",
      "Johan Bolmsten",
      "Catherine Seidelin"
    ],
    "publication_date": "2024-07-05T17:05:06Z",
    "arxiv_id": "http://arxiv.org/abs/2407.04650v2",
    "download_url": "https://arxiv.org/abs/2407.04650v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Applications of Causality and Causal Inference in Software Engineering",
    "abstract": "Causal inference is a study of causal relationships between events and the statistical study of inferring these relationships through interventions and other statistical techniques. Causal reasoning is any line of work toward determining causal relationships, including causal inference. This paper explores the relationship between causal reasoning and various fields of software engineering. This paper aims to uncover which software engineering fields are currently benefiting from the study of causal inference and causal reasoning, as well as which aspects of various problems are best addressed using this methodology. With this information, this paper also aims to find future subjects and fields that would benefit from this form of reasoning and to provide that information to future researchers. This paper follows a systematic literature review, including; the formulation of a search query, inclusion and exclusion criteria of the search results, clarifying questions answered by the found literature, and synthesizing the results from the literature review. Through close examination of the 45 found papers relevant to the research questions, it was revealed that the majority of causal reasoning as related to software engineering is related to testing through root cause localization. Furthermore, most causal reasoning is done informally through an exploratory process of forming a Causality Graph as opposed to strict statistical analysis or introduction of interventions. Finally, causal reasoning is also used as a justification for many tools intended to make the software more human-readable by providing additional causal information to logging processes or modeling languages.",
    "authors": [
      "Patrick Chadbourne",
      "Nasir Eisty"
    ],
    "publication_date": "2023-03-29T19:38:19Z",
    "arxiv_id": "http://arxiv.org/abs/2303.16989v1",
    "download_url": "https://arxiv.org/abs/2303.16989v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Feature Based Methodology for Variable Requirements Reverse Engineering",
    "abstract": "In the past years, software reverse engineering dealt with source code understanding. Nowadays, it is levered to software requirements abstract level, supported by feature model notations, language independent, and simpler than the source code reading. The recent relevant approaches face the following insufficiencies: lack of a complete integrated methodology, adapted feature model, feature patterns recognition, and Graph based slicing. This work aims to provide some solutions to the above challenges through an integrated methodology. The following results are unique. Elementary and configuration features are specified in a uniform way by introducing semantics specific attributes. The reverse engineering supports feature pattern recognition and requirements feature model graph-based slicing. The slicing criteria are rich enough to allow answering questions of software requirements maintainers. A comparison of this proposed methodology, based on effective criteria, with the similar works, seems to be valuable and competitive: the enrichment of the feature model and feature pattern recognition were never approached and the proposed slicing technique is more general, effective, and practical.",
    "authors": [
      "Anas Alhamwieh",
      "Said Ghoul"
    ],
    "publication_date": "2019-04-28T11:57:08Z",
    "arxiv_id": "http://arxiv.org/abs/1904.12309v1",
    "download_url": "https://arxiv.org/abs/1904.12309v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Saltzer & Schroeder for 2030: Security engineering principles in a world of AI",
    "abstract": "Writing secure code is challenging and so it is expected that, following the release of code-generative AI tools, such as ChatGPT and GitHub Copilot, developers will use these tools to perform security tasks and use security APIs. However, is the code generated by ChatGPT secure? How would the everyday software or security engineer be able to tell?\n  As we approach the next decade we expect a greater adoption of code-generative AI tools and to see developers use them to write secure code. In preparation for this, we need to ensure security-by-design. In this paper, we look back in time to Saltzer & Schroeder's security design principles as they will need to evolve and adapt to the challenges that come with a world of AI-generated code.",
    "authors": [
      "Nikhil Patnaik",
      "Joseph Hallett",
      "Awais Rashid"
    ],
    "publication_date": "2024-07-08T08:10:18Z",
    "arxiv_id": "http://arxiv.org/abs/2407.05710v1",
    "download_url": "https://arxiv.org/abs/2407.05710v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Computing for Software Engineering: Prospects",
    "abstract": "Quantum computers (QCs) are maturing. When QCs are powerful enough, they may be able to handle problems in chemistry, physics, and finance that are not classically solvable. However, the applicability of quantum algorithms to speed up Software Engineering (SE) tasks has not been explored. We examine eight groups of quantum algorithms that may accelerate SE tasks across the different phases of SE and sketch potential opportunities and challenges.",
    "authors": [
      "Andriy Miranskyy",
      "Mushahid Khan",
      "Jean Paul Latyr Faye",
      "Udson C. Mendes"
    ],
    "publication_date": "2022-03-07T18:16:48Z",
    "arxiv_id": "http://arxiv.org/abs/2203.03575v3",
    "download_url": "https://arxiv.org/abs/2203.03575v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Naming the Pain in Requirements Engineering: Contemporary Problems, Causes, and Effects in Practice",
    "abstract": "Requirements Engineering (RE) has received much attention in research and practice due to its importance to software project success. Its interdisciplinary nature, the dependency to the customer, and its inherent uncertainty still render the discipline difficult to investigate. This results in a lack of empirical data. These are necessary, however, to demonstrate which practically relevant RE problems exist and to what extent they matter. Motivated by this situation, we initiated the Naming the Pain in Requirements Engineering (NaPiRE) initiative which constitutes a globally distributed, bi-yearly replicated family of surveys on the status quo and problems in practical RE. In this article, we report on the qualitative analysis of data obtained from 228 companies working in 10 countries in various domains and we reveal which contemporary problems practitioners encounter. To this end, we analyse 21 problems derived from the literature with respect to their relevance and criticality in dependency to their context, and we complement this picture with a cause-effect analysis showing the causes and effects surrounding the most critical problems. Our results give us a better understanding of which problems exist and how they manifest themselves in practical environments. Thus, we provide a first step to ground contributions to RE on empirical observations which, until now, were dominated by conventional wisdom only.",
    "authors": [
      "D. Méndez Fernández",
      "S. Wagner",
      "M. Kalinowski",
      "M. Felderer",
      "P. Mafra",
      "A. Vetrò",
      "T. Conte",
      "M. -T. Christiansson",
      "D. Greer",
      "C. Lassenius",
      "T. Männistö",
      "M. Nayabi",
      "M. Oivo",
      "B. Penzenstadler",
      "D. Pfahl",
      "R. Prikladnicki",
      "G. Ruhe",
      "A. Schekelmann",
      "S. Sen",
      "R. Spinola",
      "A. Tuzcu",
      "J. L. de la Vara",
      "R. Wieringa"
    ],
    "publication_date": "2016-11-27T12:08:26Z",
    "arxiv_id": "http://arxiv.org/abs/1611.10288v1",
    "download_url": "https://arxiv.org/abs/1611.10288v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Artefact-based Requirements Engineering: The AMDiRE Approach",
    "abstract": "The various influences in the processes and application domains make Requirements Engineering (RE) inherently complex and difficult to implement. In general, we have two options for establishing an RE approach: we can either establish an activity-based RE approach or we can establish an artefact-based one where project participants concentrate on the RE artefacts rather than on the way of creating them. While a number of activity-based RE approaches have been proposed in recent years, we have gained much empirical evidence and experiences about the advantages of the artefact-based paradigm for RE. However, artefact orientation is still a young paradigm with various interpretations and practical manifestations whereby we need a clear understanding of its basic concepts and a consolidated and evaluated view on the paradigm.\n  In this article, we contribute an artefact-based approach to RE (AMDiRE) that emerges from six years of experiences in fundamental and evidence-based research. To this end, we first discuss the basic notion of artefact orientation and its evolution in recent years. We briefly introduce a set of artefact-based RE models we developed in industrial research cooperations for different application domains, show their empirical evaluations, and their dissemination into academia and practice, eventually leading to the AMDiRE approach. We conclude with a discussion of experiences we made during the development and different industrial evaluations, and lessons learnt.",
    "authors": [
      "D. Méndez Fernández",
      "B. Penzenstadler"
    ],
    "publication_date": "2016-11-30T07:03:37Z",
    "arxiv_id": "http://arxiv.org/abs/1611.10024v1",
    "download_url": "https://arxiv.org/abs/1611.10024v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Battle of the Blocs: Quantity and Quality of Software Engineering Research by Origin",
    "abstract": "Software engineering capabilities are increasingly important to the success of economic and political blocs. This paper analyzes quantity and quality of software engineering research output originating from the US, Europe, and China over time. The results indicate that the quantity of research is increasing across the board with Europe leading the field. Depending of the scope of the analysis, either the US or China come in second. Regarding research quality, Europe appears to be lagging the other blocs, with China having caught up to and even having overtaken the US over time.",
    "authors": [
      "Lorenz Graf-Vlachy"
    ],
    "publication_date": "2023-03-13T21:07:16Z",
    "arxiv_id": "http://arxiv.org/abs/2303.07467v1",
    "download_url": "https://arxiv.org/abs/2303.07467v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Descartes: A PITest Engine to Detect Pseudo-Tested Methods - Tool Demonstration",
    "abstract": "Descartes is a tool that implements extreme mutation operators and aims at finding pseudo-tested methods in Java projects. It leverages the efficient transformation and runtime features of PIT. The demonstration compares Descartes with Gregor, the default mutation engine provided by PIT, in a set of real open source projects. It considers the execution time, number of mutants created and the relationship between the mutation scores produced by both engines. It provides some insights on the main features exposed by Descartes.",
    "authors": [
      "Oscar Luis Vera-Pérez",
      "Martin Monperrus",
      "Benoit Baudry"
    ],
    "publication_date": "2018-11-07T18:00:58Z",
    "arxiv_id": "http://arxiv.org/abs/1811.03045v1",
    "download_url": "https://arxiv.org/abs/1811.03045v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Application of muon absorption tomography in imaging of civil structures",
    "abstract": "The research focuses on the non-invasive imaging technique using cosmic muon absorption tomography to monitor the internals of archaeological / civil / industrial structures of intermediate size. It integrates experimental measurements and numerical simulations with Geant4, ascertaining the reliability and precision of muon absorption tomography using easily available components for the stated purpose. The experiment probes muon interactions across a range of materials including those commonly used in building civil and industrial structures. An experiment, fondly named MARS (Muon Absorption in Rigid Structures), was carried out to explore the possibility of using overlapped scintillation paddles for improved mapping of inhomogeneities in structures made of concrete. Good correlation of experimental and simulated results for all tests indicates that this simple approach can be implemented for non-destructive evaluations of structures of civil and industrial interest",
    "authors": [
      "Piyush Pallav",
      "Purba Bhattacharya",
      "Supratik Mukhopadhyay",
      "Nayana Majumdar"
    ],
    "publication_date": "2025-03-30T18:45:05Z",
    "arxiv_id": "http://arxiv.org/abs/2503.23558v1",
    "download_url": "https://arxiv.org/abs/2503.23558v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Social Influence in Agile Requirements Engineering",
    "abstract": "Agile requirements engineering implies more complex communication patterns since even the developers are supposed to have direct contact with customers. With more face-to-face communication comes social-psychological factors influencing the requirements. Studies have pointed at the importance of negotiation training, but I argue that more basic human traits can be triggered in favor of the negotiator with the most knowledge of social influence research and practice. I suggest a plan of how research in social influence and requirements facilitation can be conducted, mostly through experimentation.",
    "authors": [
      "Lucas Gren"
    ],
    "publication_date": "2019-04-05T18:47:47Z",
    "arxiv_id": "http://arxiv.org/abs/1904.04749v1",
    "download_url": "https://arxiv.org/abs/1904.04749v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reliability-Based Collapse Assessment of Wind-Excited Steel Structures within Performance-Based Wind Engineering",
    "abstract": "As inelastic design for wind is embraced by the engineering community, there is an increasing demand for computational tools that enable the investigation of the nonlinear behavior of wind-excited structures and subsequent development of performance criteria. To address this need, a probabilistic collapse assessment framework for steel structures is proposed in this paper. The framework is based on the integration of a high-fidelity fiber-based nonlinear structural modeling environment with a wind-tunnel-informed stochastic wind load model to perform nonlinear time history analysis. General uncertainty is propagated using a stratified sampling scheme enabling the efficient estimation of reliabilities associated with rare events. The adopted models for simulating high-fidelity nonlinear structural behavior were found, in general, to be adequate for capturing phenomena, including progressive yielding, buckling, and low-cycle fatigue, that are essential for wind induced collapse analysis. In particular, the adopted fatigue model was found to be capable of predicting damage and potential fiber/section fracture associated with non-fully reversing stress-strain cycles that are characteristic of wind loading. Through illustration on a 45-story archetype steel building, critical discussions on the types of observed collapse mechanisms, the difference between alongwind and acrosswind nonlinear behavior, reliabilities associated with first yield, and collapse are presented. A probabilistic description of the residual and peak story drifts is also provided through development of fragility functions.",
    "authors": [
      "Srinivasan Arunachalam",
      "Seymour M. J. Spence"
    ],
    "publication_date": "2022-07-06T19:42:36Z",
    "arxiv_id": "http://arxiv.org/abs/2207.14156v1",
    "download_url": "https://arxiv.org/abs/2207.14156v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]