[
  {
    "title": "Security Risks in Mechanical Engineering Industries",
    "abstract": "Inherent in any organization are security risks and barriers that must be understood, analyzed, and minimized in order to prepare for and perpetuate future growth and return on investment within the business. Likewise, company leaders must determine the security health of the organization and routinely review the potential threats that are ever changing in this new global economy. Once these risks are outlined, the cost and potential damage must be weighed before action is implemented. This paper will address the modern problems of securing information technology (IT) of a mechanical engineering enterprise, which can be applied to other modern industries.",
    "authors": [
      "Karen Benson",
      "Shawon Rahman"
    ],
    "publication_date": "2015-11-30T22:18:35Z",
    "arxiv_id": "http://arxiv.org/abs/1512.01730v1",
    "download_url": "https://arxiv.org/abs/1512.01730v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fast ground-state cooling of mechanical resonator with time-dependent optical cavities",
    "abstract": "We propose a feasible scheme to cool down a mechanical resonator (MR) in a three-mirror cavity optomechanical system with controllable external optical drives. Under the Born-Oppenheimer (BO) approximation, the whole dynamics of the mechanical resonator and cavities is reduced to that of a time-dependent harmonic oscillator, whose effective frequency can be controlled through the optical driving fields. The fast cooling of the MR can be realized by controlling the amplitude of the optical drives. Significantly, we further show that the ground-state cooling may be achieved via the three-mirror cavity optomechanical system without the resolved sideband condition.",
    "authors": [
      "Yong Li",
      "Lian-Ao Wu",
      "Z. D. Wang"
    ],
    "publication_date": "2010-08-10T04:35:42Z",
    "arxiv_id": "http://arxiv.org/abs/1008.1630v3",
    "download_url": "https://arxiv.org/abs/1008.1630v3",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topologically Protected Transport in Engineered Mechanical Systems",
    "abstract": "Mechanical vibrations are being harnessed for a variety of purposes and at many length scales, from the macroscopic world down to the nanoscale. The considerable design freedom in mechanical structures allows to engineer new functionalities. In recent years, this has been exploited to generate setups that offer topologically protected transport of vibrational waves, both in the solid state and in fluids. Borrowing concepts from electronic physics and being cross-fertilized by concurrent studies for cold atoms and electromagnetic waves, this field of topological transport in engineered mechanical systems offers a rich variety of phenomena and platforms. In this review, we provide a unifying overview of the various ideas employed in this area, summarize the different approaches and experimental implementations, and comment on the challenges as well as the prospects.",
    "authors": [
      "Tirth Shah",
      "Christian Brendel",
      "Vittorio Peano",
      "Florian Marquardt"
    ],
    "publication_date": "2022-06-24T15:14:36Z",
    "arxiv_id": "http://arxiv.org/abs/2206.12337v2",
    "download_url": "https://arxiv.org/abs/2206.12337v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Design, Dynamics, and Dissipation of a Torsional-Magnetic Spring Mechanism",
    "abstract": "We present an analytical and experimental study of torsional magnetic mechanism where the restoring torque is due to magnetic field interactions between rotating and fixed permanent magnets. The oscillator consists of a ball bearing-supported permanent magnet, called the rotor, placed between two fixed permanent magnets called the stators. Perturbing the rotor from its equilibrium angle induces a restoring magnetic torque whose effect is modeled as a torsional spring. This restoring effect is accompanied by dissipation mechanisms arising from structural viscoelasticity, air and electromagnetic damping, as well as friction in the ball bearings. To investigate the system dynamics, we constructed an experimental setup capable of mechanical, electrical and magnetic measurements. For various rotor-stator gaps in this setup, we validated an analytical model that assumes viscous and dry (Coulomb) damping during the rotor free response. Moreover, we forced the rotor by a neighboring electromagnetic coil into high amplitude oscillations. We observed unusual resonator nonlinearity: at large rotor-stator gaps, the oscillations are softening; at reduced gaps, the oscillations stiffen-then-soften. The developed reduced-order models capture the nonlinear effects of the rotor-to-stator and the rotor-to-coil distances. These magnetic oscillators are promising in low-frequency electromagnetic signal transmission and in designing magneto-elastic metamaterials with tailorable nonlinearity.",
    "authors": [
      "Ali Kanj",
      "Rhinithaa P. Thanalakshme",
      "Chengzhang Li",
      "John Kulikowski",
      "Gaurav Bahl",
      "Sameh Tawfick"
    ],
    "publication_date": "2021-12-27T17:47:21Z",
    "arxiv_id": "http://arxiv.org/abs/2112.13806v1",
    "download_url": "https://arxiv.org/abs/2112.13806v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unveiling a new shear stress transfer mechanism in composites with helically wound hierarchical fibres",
    "abstract": "The mechanical performance of reinforced composites is strongly influenced at different scales by the stress transferred at the matrix-fibre interfaces and at any surface where material discontinuity occurs. In particular, the mechanical response of elastomeric composites where the reinforcement is composed by cords with helically wound fibres is heavily compromised by fatigue and delamination phenomena occurring at cord-rubber as well as at the ply interfaces, since rubber and polymeric matrices are mainly vulnerable to the accumulation of deviatoric energy due to the shear stresses transferred across the surfaces. Despite the large diffusion of composites in a vast field of applications and the mature knowledge of their behaviour, some key mechanical aspects underlying failure mechanisms are still partially unclear. For example, stress amplification and strain localization are often difficult to predict by means of analytical solutions and averaging techniques that usually conceal stress gradients. In this work, we analyse coupling between torsional and tensile loads in twisted cords, which are adopted in many cases to reinforce composites and rubbers in tire applications. We provide a model characterized by an enriched cord-matrix mechanical interplay able to theoretically explain and predict actual stress distributions responsible for the onset of delamination and fatigue-guided phenomena that are experimentally observed in these composites. In particular, we demonstrate that the assumption of a monoclinic/trigonal behaviour for the mechanical response of the hierarchical strands allows to estimate, by means of analytical formulas and a homogenization approach, hitherto neglected shear stresses at the matrix-reinforcement interface. These stresses are transferred to the neighbouring regions, leading to post-elastic behaviour and failure events.",
    "authors": [
      "A. Cutolo",
      "A. R. Carotenuto",
      "S. Palumbo",
      "F. Bosia",
      "N. M. Pugno",
      "M. Fraldi"
    ],
    "publication_date": "2021-09-25T12:04:24Z",
    "arxiv_id": "http://arxiv.org/abs/2109.12348v1",
    "download_url": "https://arxiv.org/abs/2109.12348v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanical Self-Assembly of a Strain-Engineered Flexible Layer: Wrinkling, Rolling, and Twisting",
    "abstract": "Self-shaping of curved structures, especially those involving flexible thin layers, has attracted increasing attention because of their broad potential applications in e.g. nanoelectromechanical/micro-electromechanical systems (NEMS/MEMS), sensors, artificial skins, stretchable electronics, robotics, and drug delivery. Here, we provide an overview of recent experimental, theoretical, and computational studies on the mechanical self-assembly of strain-engineered thin layers, with an emphasis on systems in which the competition between bending and stretchingenergy gives rise to a variety ofdeformations,such as wrinkling, rolling, and twisting. We address the principle of mechanical instabilities, which is often manifested in wrinkling or multistability of strain-engineered thin layers. The principles of shape selection and transition in helical ribbons are also systematically examined. We hope that a more comprehensive understanding of the mechanical principles underlying these rich phenomena can foster the development of new techniques for manufacturing functional three- dimensional structures on demand for a broad spectrum of engineering applications.",
    "authors": [
      "Zi Chen",
      "Gaoshan Huang",
      "Ian Trase",
      "Xiaomin Han",
      "Yongfeng Mei"
    ],
    "publication_date": "2015-12-09T15:28:59Z",
    "arxiv_id": "http://arxiv.org/abs/1512.04967v1",
    "download_url": "https://arxiv.org/abs/1512.04967v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tailoring mechanically-tunable strain fields in graphene",
    "abstract": "There are a number of theoretical proposals based on strain engineering of graphene and other two-dimensional materials, however purely mechanical control of strain fields in these systems has remained a major challenge. The two approaches mostly used so far either couple the electrical and mechanical properties of the system simultaneously or introduce some unwanted disturbances due to the substrate. Here, we report on silicon micro-machined comb-drive actuators to controllably and reproducibly induce strain in a suspended graphene sheet, in an entirely mechanical way. We use spatially resolved confocal Raman spectroscopy to quantify the induced strain, and we show that different strain fields can be obtained by engineering the clamping geometry, including tunable strain gradients of up to 1.4 %/$μ$m. Our approach also allows for multiple axis straining and is equally applicable to other two-dimensional materials, opening the door to an investigating their mechanical and electromechanical properties. Our measurements also clearly identify defects at the edges of a graphene sheet as being weak spots responsible for its mechanical failure.",
    "authors": [
      "M. Goldsche",
      "J. Sonntag",
      "T. Khodkov",
      "G. Verbiest",
      "S. Reichardt",
      "C. Neumann",
      "T. Ouaj",
      "N. von den Driesch",
      "D. Buca",
      "C. Stampfer"
    ],
    "publication_date": "2017-11-13T10:31:25Z",
    "arxiv_id": "http://arxiv.org/abs/1711.04505v1",
    "download_url": "https://arxiv.org/abs/1711.04505v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanical spectral engineering by scaling intertwining",
    "abstract": "Using the concept of spectral engineering we explore the possibilities of building potentials with prescribed spectra offered by a modified intertwining technique involving operators which are the product of a standard first-order intertwiner and a unitary scaling. In the same context we study the iterations of such transformations finding that the scaling intertwining provides a different and richer mechanism in designing quantum spectra with respect to that given by the standard intertwining",
    "authors": [
      "D. J. Fernandez C.",
      "H. C. Rosu"
    ],
    "publication_date": "1999-11-01T23:09:32Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9910125v2",
    "download_url": "https://arxiv.org/abs/quant-ph/9910125v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "No Code AI: Automatic generation of Function Block Diagrams from documentation and associated heuristic for context-aware ML algorithm training",
    "abstract": "Industrial process engineering and PLC program development have traditionally favored Function Block Diagram (FBD) programming over classical imperative style programming like the object oriented and functional programming paradigms. The increasing momentum in the adoption and trial of ideas now classified as 'No Code' or 'Low Code' alongside the mainstream success of statistical learning theory or the so-called machine learning is redefining the way in which we structure programs for the digital machine to execute. A principal focus of 'No Code' is deriving executable programs directly from a set of requirement documents or any other documentation that defines consumer or customer expectation. We present a method for generating Function Block Diagram (FBD) programs as either the intermediate or final artifact that can be executed by a target system from a set of requirement documents using a constrained selection algorithm that draws from the top line of an associated recommender system. The results presented demonstrate that this type of No-code generative model is a viable option for industrial process design.",
    "authors": [
      "Oluwatosin Ogundare",
      "Gustavo Quiros Araya",
      "Yassine Qamsane"
    ],
    "publication_date": "2023-04-08T22:37:32Z",
    "arxiv_id": "http://arxiv.org/abs/2304.04117v1",
    "download_url": "https://arxiv.org/abs/2304.04117v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simulation of corrosion and mechanical degradation of additively manufactured Mg scaffolds in simulated body fluid",
    "abstract": "A simulation strategy based in the finite element model was developed to model the corrosion and mechanical properties of biodegradable Mg scaffolds manufactured by laser power bed fusion after immersion in simulated body fluid. Corrosion was simulated through a phenomenological, diffusion-based model which can take into account pitting. The elements in which the concentration of Mg was below a certain threshold (representative of the formation of Mg(OH)2) after the corrosion simulation were deleted for the mechanical simulations, in which Mg was assumed to behave as an isotropic, elastic-perfectly plastic solid and fracture was introduced through a ductile failure model. The parameters of the models were obtained from previous experimental results and the numerical predictions of the strength and fracture mechanisms of WE43 Mg alloy porous scaffolds in the as-printed condition and after immersion in simulated body fluid were in good agreement with the experimental results. Thus, the simulation strategy is able to assess the effect of corrosion on the mechanical behavior of biodegradable scaffolds, which is critical for design of biodegradable scaffolds for biomedical applications.",
    "authors": [
      "Mohammad Marvi-Mashhadi",
      "Wahaaj Ali",
      "Muzi Li",
      "Carlos González",
      "Javier LLorca"
    ],
    "publication_date": "2021-10-02T10:07:46Z",
    "arxiv_id": "http://arxiv.org/abs/2110.00770v1",
    "download_url": "https://arxiv.org/abs/2110.00770v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effect of zirconium doping on mechanical properties of $W_{1-x}Zr_xB_2$ on the base of ab initio calculations and magnetron sputtered films",
    "abstract": "Potentially superhard $W_{1-x}Zr_xB_2$ polymorph hP6-P6$_3$/mmc-$WB_2$ with zirconium doping in the range of x=0.0-0.25 was thoroughly analyzed within the framework of first-principles density functional theory from the structural and mechanical point of view. The obtained results were subsequently compared with properties of material deposited by magnetron sputtering method. All predicted structures are mechanically and thermodynamically stable. Due to theoretical calculations zirconium doping reduces hardness and fracture toughness $K_{IC}$ of $WB_2$. Deposited films are characterized by greater hardness $H_v$ but lower fracture toughness $K_{IC}$. The results of experiments show that not only solid solution hardening is responsible for strengthening of predicted new material but also change of microstructure, Hall-Petch effect and boron vacancies.",
    "authors": [
      "Marcin Maździarz",
      "Rafał Psiuk",
      "Agnieszka Krawczyńska",
      "Małgorzata Lewandowska",
      "Tomasz Mościcki"
    ],
    "publication_date": "2022-03-25T16:00:36Z",
    "arxiv_id": "http://arxiv.org/abs/2203.13728v1",
    "download_url": "https://arxiv.org/abs/2203.13728v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Design and Analysis of a Robotic Lizard using Five-Bar Mechanism",
    "abstract": "Legged robots are being used to explore rough terrains as they are capable of traversing gaps and obstacles. In this paper, a new mechanism is designed to replicate a robotic lizard using integrated five-bar mechanisms. There are two five bar mechanisms from which two more are formed by connecting the links in a particular order. The legs are attached to the links of the five bar mechanism such that, when the mechanism is actuated, they move the robot forward. Position analysis using vector loop approach has been done for the mechanism. A prototype has been built and controlled using servo motors to verify the robotic lizard mechanism.",
    "authors": [
      "Rajashekhar V S",
      "Dinakar Raj C K",
      "Vishwesh S",
      "Selva Perumal E",
      "Nirmal Kumar M"
    ],
    "publication_date": "2021-07-27T06:01:24Z",
    "arxiv_id": "http://arxiv.org/abs/2107.12614v1",
    "download_url": "https://arxiv.org/abs/2107.12614v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coupled mechanical resonators with broken Lorentz reciprocity for sensor applications",
    "abstract": "Having simultaneously a high quality factor (i.e. a narrow resonant band) and a shorter interaction time between the resonating system and the external sources (i.e. a wide resonant band) is a desirable characteristic for mechanical resonators, which however has been regarded as contradictory. This has been known as the limit of Lorentz reciprocity. We explore a configuration to achieve this desired characteristic within the mechanical regime. The configuration consists of a pair of mechanical resonators coupled together through their connecting part. One of them is encapsulated in a vacuum environment, and the other is left in the normal ambient condition. Numerical model of this configuration shows clearly the advantages such as: (a), sensitivity to the change of resonant frequency is greatly improved (the product of bandwidth $Δω$ and the interaction time $Δt$ has increased at least two orders of magnitude); (b), the value of $Δω\\cdot Δt$ can be adjusted through the coupling stiffness.",
    "authors": [
      "Lijie Li"
    ],
    "publication_date": "2019-01-07T12:28:38Z",
    "arxiv_id": "http://arxiv.org/abs/1901.01770v2",
    "download_url": "https://arxiv.org/abs/1901.01770v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The mechanics and physics of twisted and coiled polymer actuators",
    "abstract": "Twisted and coiled polymer actuators (TCPAs) generate large contractile mechanical work mimicking natural muscles, which makes them suitable for robotics and health-assistive devices. Understanding the mechanism of nylon TCPA remains challenging due to the interplay between their intricate geometry, chirality, residual stresses, and material microstructure. This study integrates a material microstructure model with rod theory to analytically predict the equilibrium helical shape of the nylon TCPA after fabrication and to explain the observed contraction mechanism upon stimulation. The first ingredient of the model is to treat nylon as a two-phase thermomechanical microstructure system capable of storing strain energy and exchanging it among the two phases. This is validated by characterizing the torsional actuation response of twisted and annealed nylon fibers. The second ingredient of the model is to use the classic Kirchhoff Rod Theory and add a necessary term that couples the bending and twisting energy. Validation with experiments shows that the model captures the equilibrium and longitudinal stiffness of the TCPA in both active and passive states, and the stimulated contraction under external load. Importantly, the model quantifies the influence of the stored energy level on the actuation performance. These concepts can be extended to other types of TCPAs and could enable new material design.",
    "authors": [
      "Qiong Wang",
      "Anan Ghrayeb",
      "SeongHyeon Kim",
      "Liuyang Cheng",
      "Sameh Tawfick"
    ],
    "publication_date": "2024-03-31T21:18:14Z",
    "arxiv_id": "http://arxiv.org/abs/2404.00802v2",
    "download_url": "https://arxiv.org/abs/2404.00802v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering multiple GHz mechanical modes in optomechanical crystal cavities",
    "abstract": "Optomechanical crystal cavities (OMCCs) are fundamental nanostructures for a wide range of phenomena and applications. Usually, optomechanical interaction in such OMCCs is limited to a single optical mode and a unique mechanical mode. In this sense, eliminating the single mode constraint - for instance, by adding more mechanical modes - should enable more complex physical phenomena, giving rise to a context of multimode optomechanical interaction. However, a general method to produce in a controlled way multiple mechanical modes with large coupling rates in OMCCs is still missing. In this work, we present a route to confine multiple GHz mechanical modes coupled to the same optical field with similar optomechanical coupling rates - up to 600 kHz - by OMCC engineering. In essence, we increase the number of unit cells (consisting of a silicon nanobrick perforated by a circular holes with corrugations at its both sides) in the adiabatic transition between the cavity center and the mirror region. Remarkably, the mechanical modes in our cavities are located within a full phononic bandgap, which is a key requirement to achieve ultra high mechanical Q factors at cryogenic temperatures. The multimode bevavior in a full phononic bandgap and the easiness of realization using standard silicon nanotechnology make our OMCCs highly appealing for applications in the classical and quantum realms.",
    "authors": [
      "Laura Mercadé",
      "Raúl Ortiz",
      "Alberto Grau",
      "Amadeu Griol",
      "Daniel Navarro-Urrios",
      "Alejandro Martínez"
    ],
    "publication_date": "2022-08-01T14:24:06Z",
    "arxiv_id": "http://arxiv.org/abs/2208.00890v1",
    "download_url": "https://arxiv.org/abs/2208.00890v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topologically engineered 3D printed architectures with superior mechanical strength",
    "abstract": "Materials that are lightweight yet exhibit superior mechanical properties are of compelling importance for several technological applications that range from aircrafts to household appliances. Lightweight materials allow energy saving and reduce the amount of resources required for manufacturing. Researchers have expended significant efforts in the quest for such materials, which require new concepts in both tailoring material microstructure as well as structural design. Architectured materials, which take advantage of new engineering paradigms, have recently emerged as an exciting avenue to create bespoke combinations of desired macroscopic material responses. In some instances, rather unique structures have emerged from advanced geometrical concepts (e.g. gyroids, menger cubes, or origami/kirigami-based structures), while in others innovation has emerged from mimicking nature in bio-inspired materials (e.g. honeycomb structures, nacre, fish scales etc.). Beyond design, additive manufacturing has enabled the facile fabrication of complex geometrical and bio-inspired architectures, using computer aided design models. The combination of simulations and experiments on these structures has led to an enhancement of mechanical properties, including strength, stiffness and toughness. In this review, we provide a perspective on topologically engineered architectured materials that exhibit optimal mechanical behaviour and can be readily printed using additive manufacturing.",
    "authors": [
      "R. S. Ambekar",
      "B. Kushwaha",
      "P. Sharma",
      "F. Bosia",
      "M. Fraldi",
      "N. Pugno",
      "C. S. Tiwary"
    ],
    "publication_date": "2022-06-01T11:49:48Z",
    "arxiv_id": "http://arxiv.org/abs/2206.00418v1",
    "download_url": "https://arxiv.org/abs/2206.00418v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Ontological Support for Principle Solutions in Mechanical Engineering",
    "abstract": "The engineering design process follows a series of standardized stages of development, which have many aspects in common with software engineering. Among these stages, the principle solution can be regarded as an analogue of the design specification, fixing as it does the way the final product works. It is usually constructed as an abstract sketch (hand-drawn or constructed with a CAD system) where the functional parts of the product are identified, and geometric and topological constraints are formulated. Here, we outline a semantic approach where the principle solution is annotated with ontological assertions, thus making the intended requirements explicit and available for further machine processing; this includes the automated detection of design errors in the final CAD model, making additional use of a background ontology of engineering knowledge. We embed this approach into a document-oriented design workflow, in which the background ontology and semantic annotations in the documents are exploited to trace parts and requirements through the design process and across different applications.",
    "authors": [
      "Thilo Breitsprecher",
      "Mihai Codescu",
      "Constantin Jucovschi",
      "Michael Kohlhase",
      "Lutz Schröder",
      "Sandro Wartzack"
    ],
    "publication_date": "2013-12-09T09:47:08Z",
    "arxiv_id": "http://arxiv.org/abs/1312.2359v2",
    "download_url": "https://arxiv.org/abs/1312.2359v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bohmian Mechanics and the Meaning of the Wave Function",
    "abstract": "We outline how Bohmian mechanics works: how it deals with various issues in the foundations of quantum mechanics and how it is related to the usual quantum formalism. We then turn to some objections to Bohmian mechanics, for example the fact that in Bohmian mechanics there is no back action of particle configurations upon wave functions. These lead us to our main concern: a more careful consideration of the meaning of the wave function in quantum mechanics, as suggested by a Bohmian perspective. We propose that the reason, on the universal level, that there is no action of configurations upon wave functions, as there seems to be between all other elements of physical reality, is that the wave function of the universe is not an element of physical reality. We propose that the wave function belongs to an altogether different category of existence than that of substantive physical entities, and that its existence is nomological rather than material. We propose, in other words, that the wave function is a component of physical law rather than of the reality described by the law.",
    "authors": [
      "Detlef Dürr",
      "Sheldon Goldstein",
      "Nino Zanghì"
    ],
    "publication_date": "1995-12-29T18:21:53Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9512031v1",
    "download_url": "https://arxiv.org/abs/quant-ph/9512031v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Segmentation method of U-net sheet metal engineering drawing based on CBAM attention mechanism",
    "abstract": "In the manufacturing process of heavy industrial equipment, the specific unit in the welding diagram is first manually redrawn and then the corresponding sheet metal parts are cut, which is inefficient. To this end, this paper proposes a U-net-based method for the segmentation and extraction of specific units in welding engineering drawings. This method enables the cutting device to automatically segment specific graphic units according to visual information and automatically cut out sheet metal parts of corresponding shapes according to the segmentation results. This process is more efficient than traditional human-assisted cutting. Two weaknesses in the U-net network will lead to a decrease in segmentation performance: first, the focus on global semantic feature information is weak, and second, there is a large dimensional difference between shallow encoder features and deep decoder features. Based on the CBAM (Convolutional Block Attention Module) attention mechanism, this paper proposes a U-net jump structure model with an attention mechanism to improve the network's global semantic feature extraction ability. In addition, a U-net attention mechanism model with dual pooling convolution fusion is designed, the deep encoder's maximum pooling + convolution features and the shallow encoder's average pooling + convolution features are fused vertically to reduce the dimension difference between the shallow encoder and deep decoder. The dual-pool convolutional attention jump structure replaces the traditional U-net jump structure, which can effectively improve the specific unit segmentation performance of the welding engineering drawing. Using vgg16 as the backbone network, experiments have verified that the IoU, mAP, and Accu of our model in the welding engineering drawing dataset segmentation task are 84.72%, 86.84%, and 99.42%, respectively.",
    "authors": [
      "Zhiwei Song",
      "Hui Yao"
    ],
    "publication_date": "2022-09-28T13:49:45Z",
    "arxiv_id": "http://arxiv.org/abs/2209.14102v2",
    "download_url": "https://arxiv.org/abs/2209.14102v2",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An N-Plus-1 GPT Agency for Critical Solution of Mechanical Engineering Analysis Problems",
    "abstract": "Generative AI, and specifically GPT, can produce a remarkable solution to a mechanical engineering analysis problem - but also, on occasion, a flawed solution. For example, an elementary mechanics problem is solved flawlessly in one GPT instance and incorrectly in a subsequent GPT instance, with a success probability of only 85%. This unreliability renders \"out-of-the-box\" GPT unsuitable for deployment in education or engineering practice. We introduce an \"N-Plus-1\" GPT Agency for Initial (Low-Cost) Analysis of mechanical engineering Problem Statements. Agency first launches N instantiations of Agent Solve to yield N independent Proposed Problem Solution Realizations; Agency then invokes Agent Compare to summarize and compare the N Proposed Problem Solution Realizations and to provide a Recommended Problem Solution. We argue from Condorcet's Jury Theorem that, for a Problem Statement characterized by per-Solve success probability greater than 1/2 (and N sufficiently large), the Predominant (Agent Compare) Proposed Problem Solution will, with high probability, correspond to a Correct Proposed Problem Solution. Furthermore, Agent Compare can also incorporate aspects of Secondary (Agent Compare) Proposed Problem Solutions, in particular when the latter represent alternative Problem Statement interpretations - different Mathematical Models - or alternative Mathematical Solution Procedures. Comparisons to Grok Heavy, a commercial multi-agent model, show similarities in design and performance, but also important differences in emphasis: our Agency focuses on transparency and pedagogical value.",
    "authors": [
      "Anthony Patera",
      "Rohan Abeyaratne"
    ],
    "publication_date": "2025-09-22T12:21:58Z",
    "arxiv_id": "http://arxiv.org/abs/2509.18229v1",
    "download_url": "https://arxiv.org/abs/2509.18229v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fermi Level Engineering and Mechanical Properties of High Entropy Carbides",
    "abstract": "Fermi level engineering and mechanical properties evolution in high entropy carbides are investigated by theoretical and experimental means. Massive elemental diversity in high entropy ceramics broadens the compositional space but imposes great challenges in composition selection and property investigation. We have utilized the valence electron concentration (VEC) descriptor to design and predict properties of high entropy carbides. The VEC regulates the Fermi energy and systematically alters the bonding characteristics of materials. As a result, mechanical properties evolve as function of the VEC. At VEC 8.4, the strong σ bonding states stem from filled overlapping metal d and carbon p orbitals, which results in maximum resistance to shear deformation and highest hardness. Beyond or below the optimum VEC point of 8.4, mechanical response degrades due to filling or emptying of energy orbitals that facilitates shear deformation. Furthermore, the optimum VEC point can shift based on the constituent metals that formulate the high entropy carbide. Our analyses demonstrate strong correlation between calculated hardness and shear modulus. As an experimental complement, a set of high entropy carbides are synthesized, and mechanical properties investigated. The measured hardness follows theoretical predictions and the highest hardness of ~30 GPa is achieved at VEC 8.4. In contrast, hardness decreases by 50% when VEC is 9.4. Designing high entropy carbides based on VEC and understanding mechanical properties at an electronic level enables one to manipulate the composition spectrum to procure a desired mechanical response from a chemically disordered crystal.",
    "authors": [
      "Mohammad Delower Hossain",
      "Sarah Lowum",
      "Trent Borman",
      "Jon-Paul Maria"
    ],
    "publication_date": "2021-01-13T05:29:32Z",
    "arxiv_id": "http://arxiv.org/abs/2101.04885v1",
    "download_url": "https://arxiv.org/abs/2101.04885v1",
    "field_of_study": "engineering",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]