[
  {
    "title": "Thermodynamics of regular black hole",
    "abstract": "We investigate thermodynamics for a magnetically charged regular black hole (MCRBH), which comes from the action of general relativity and nonlinear electromagnetics, comparing with the Reissner-Norström (RN) black hole in both four and two dimensions after dimensional reduction. We find that there is no thermodynamic difference between the regular and RN black holes for a fixed charge $Q$ in both dimensions. This means that the condition for either singularity or regularity at the origin of coordinate does not affect the thermodynamics of black hole. Furthermore, we describe the near-horizon AdS$_2$ thermodynamics of the MCRBH with the connection of the Jackiw-Teitelboim theory. We also identify the near-horizon entropy as the statistical entropy by using the AdS$_2$/CFT$_1$ correspondence.",
    "authors": [
      "Yun Soo Myung",
      "Yong-Wan Kim",
      "Young-Jai Park"
    ],
    "publication_date": "2007-08-23T09:00:14Z",
    "arxiv_id": "http://arxiv.org/abs/0708.3145v4",
    "download_url": "https://arxiv.org/abs/0708.3145v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of exponential Kolmogorov-Nagumo averages",
    "abstract": "This paper investigates generalized thermodynamic relationships in physical systems where relevant macroscopic variables are determined by the exponential Kolmogorov-Nagumo average. We show that while the thermodynamic entropy of such systems is naturally described by Rényi's entropy with parameter $γ$, an ordinary Boltzmann distribution still describes their statistics under equilibrium thermodynamics. Our results show that systems described by exponential Kolmogorov-Nagumo averages can be interpreted as systems originally in thermal equilibrium with a heat reservoir with inverse temperature $β$ that are suddenly quenched to another heat reservoir with inverse temperature $β' = (1-γ)β$. Furthermore, we show the connection with multifractal thermodynamics. For the non-equilibrium case, we show that the dynamics of systems described by exponential Kolmogorov-Nagumo averages still observe a second law of thermodynamics and the H-theorem. We further discuss the applications of stochastic thermodynamics in those systems -- namely, the validity of fluctuation theorems -- and the connection with thermodynamic length. namic length.",
    "authors": [
      "Pablo A. Morales",
      "Jan Korbel",
      "Fernando E. Rosas"
    ],
    "publication_date": "2023-02-14T10:37:06Z",
    "arxiv_id": "http://arxiv.org/abs/2302.06959v3",
    "download_url": "https://arxiv.org/abs/2302.06959v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and Relativity: A Message to Physics Teachers (for an easier understanding of the thermodynamic theory)",
    "abstract": "Whoever has to learn or to teach thermodynamics is confronted with conceptual difficulties which are specific to this field of physics ([1],[2]). It seems that they can be eliminated by inserting relativity in the thermodynamic theory. The aim of this paper is to summarize the problem and draw attention upon a fundamental point of the discussion.",
    "authors": [
      "Jean-Louis Tane"
    ],
    "publication_date": "2007-11-27T20:42:15Z",
    "arxiv_id": "http://arxiv.org/abs/0711.4342v2",
    "download_url": "https://arxiv.org/abs/0711.4342v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Thermodynamics of oscillators networks",
    "abstract": "We apply the stochastic thermodynamics formalism to describe the dynamics of systems of complex Langevin and Fokker-Planck equations. We provide in particular a simple and general recipe to calculate thermodynamical currents, dissipated and propagating heat for networks of nonlinear oscillators. By using the Hodge decomposition of thermodynamical forces and fluxes, we derive a formula for entropy production that generalises the notion of non-potential forces and makes trans- parent the breaking of detailed balance and of time reversal symmetry for states arbitrarily far from equilibrium. Our formalism is then applied to describe the off-equilibrium thermodynamics of a few examples, notably a continuum ferromagnet, a network of classical spin-oscillators and the Frenkel-Kontorova model of nano friction.",
    "authors": [
      "Simone Borlenghi",
      "Anna Delin"
    ],
    "publication_date": "2018-10-01T12:09:55Z",
    "arxiv_id": "http://arxiv.org/abs/1810.01753v1",
    "download_url": "https://arxiv.org/abs/1810.01753v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Lorentzian Taub-NUT spacetimes",
    "abstract": "The thermodynamics of the Taub-NUT solution has been predominantly studied in the Euclidean sector, upon imposing the condition for the absence of Misner strings. Such thermodynamics is quite exceptional: the periodicity of the Euclidean time is restricted and thence the NUT charge cannot be independently varied, the entropy is not equal to a quarter of the area, and the thermodynamic volume can be negative. In this paper we revisit this paradigm and study the thermodynamics of the Lorentzian Taub-NUT solution, maintaining (as recently shown relatively harmless) Misner strings. We argue that in order to formulate a full cohomogeneity first law where the NUT parameter can be independently varied, it is natural to introduce a new charge together with its conjugate quantity. We consider two scenarios: one in which the entropy is given by the Lorentzian version of the Noether charge, the other in which the entropy is given by the standard Bekenstein--Hawking area law. In both cases consistent thermodynamics with positive thermodynamic volume can be formulated.",
    "authors": [
      "Robie A. Hennigar",
      "David Kubiznak",
      "Robert B. Mann"
    ],
    "publication_date": "2019-03-20T18:00:39Z",
    "arxiv_id": "http://arxiv.org/abs/1903.08668v2",
    "download_url": "https://arxiv.org/abs/1903.08668v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic thermodynamics in the quantum regime",
    "abstract": "This article sets up a formalism to describe stochastic thermodynamics for driven out-of-equilibrium open quantum systems. A stochastic Schrödinger equation allows to construct quantum trajectories describing the dynamics of the system state vector in presence of an eventually monitored environment. Thermodynamic quantities are defined at the single quantum trajectory level, independently of any energy measurement, at any time of the protocol. We thereby identify coherent contributions, without classical counterparts, leading to quantum fluctuations of thermodynamic quantities. This formalism eventually leads to central fluctuation theorems for entropy, extending in the quantum regime results obtained in classical stochastic thermodynamics. The thermal imprint of coherences on a simple implementation of Jarzynski equality is investigated, opening avenues for a thermodynamic approach to decoherence.",
    "authors": [
      "Cyril Elouard",
      "Alexia Auffèves",
      "Maxime Clusel"
    ],
    "publication_date": "2015-07-01T18:46:01Z",
    "arxiv_id": "http://arxiv.org/abs/1507.00312v3",
    "download_url": "https://arxiv.org/abs/1507.00312v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Equilibrium to Einstein: Entanglement, Thermodynamics, and Gravity",
    "abstract": "Here we develop the connection between thermodynamics, entanglement, and gravity. By attributing thermodynamics to timeslices of a causal diamond, we show that the Clausius relation $TΔS_{\\text{rev}}=Q$, where $ΔS_{\\text{rev}}$ is the reversible entropy change, gives rise to the non-linear gravitational equations of motion for a wide class of diffeomorphism invariant theories. We then compare the Clausius relation to the first law of causal diamond mechanics (FLCD), a geometric identity and necessary ingredient in deriving Jacobson's entanglement equilibrium proposal -- the entanglement entropy of a spherical region with a fixed volume is maximal in vacuum. Specifically we show that the condition of fixed volume can be understood as subtracting the irreversible contribution to the thermodynamic entropy. This provides a \"reversible thermodynamic process\" interpretation of the FLCD, and that the condition of entanglement equilibrium may be regarded as equilibrium thermodynamics for which the Clausius relation holds. Finally, we extend the entanglement equilibrium proposal to the timelike stretched horizons of future lightcones, providing an entanglement interpretation of stretched lightcone thermodynamics.",
    "authors": [
      "Andrew Svesko"
    ],
    "publication_date": "2018-10-29T16:24:53Z",
    "arxiv_id": "http://arxiv.org/abs/1810.12236v2",
    "download_url": "https://arxiv.org/abs/1810.12236v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Skewness and Kurtosis in Stochastic Thermodynamics",
    "abstract": "The thermodynamic uncertainty relation is a prominent result in stochastic thermodynamics that provides a bound on the fluctuations of any thermodynamic flux, also known as current, in terms of the average rate of entropy production. Such fluctuations are quantified by the second moment of the probability distribution of the current. The role of higher order standardized moments such as skewness and kurtosis remains largely unexplored. We analyze the skewness and kurtosis associated with the first passage time of thermodynamic currents within the framework of stochastic thermodynamics. We develop a method to evaluate higher order standardized moments associated with the first passage time of any current. For systems with a unicyclic network of states, we conjecture upper and lower bounds on skewness and kurtosis associated with entropy production. These bounds depend on the number of states and the thermodynamic force that drives the system out of equilibrium. We show that these bounds for skewness and kurtosis do not hold for multicyclic networks. We discuss the application of our results to infer an underlying network of states.",
    "authors": [
      "Taylor Wampler",
      "Andre C Barato"
    ],
    "publication_date": "2021-10-27T15:53:16Z",
    "arxiv_id": "http://arxiv.org/abs/2110.14540v1",
    "download_url": "https://arxiv.org/abs/2110.14540v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Hamiltonian approach to Thermodynamics",
    "abstract": "In the present work we develop a strictly Hamiltonian approach to Thermodynamics. A thermodynamic description based on symplectic geometry is introduced, where all thermodynamic processes can be described within the framework of Analytic Mechanics. Our proposal is constructed on top of a usual symplectic manifold, where phase space is even dimensional and one has well-defined Poisson brackets. The main idea is the introduction of an extended phase space where thermodynamic equations of state are realized as constraints. We are then able to apply the canonical transformation toolkit to thermodynamic problems. Throughout this development, Dirac's theory of constrained systems is extensively used. To illustrate the formalism, we consider paradigmatic examples, namely, the ideal, van der Waals and Clausius gases.",
    "authors": [
      "M. C. Baldiotti",
      "R. Fresneda",
      "C. Molina"
    ],
    "publication_date": "2016-04-11T20:00:06Z",
    "arxiv_id": "http://arxiv.org/abs/1604.03117v2",
    "download_url": "https://arxiv.org/abs/1604.03117v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fluctuations of intensive quantities in statistical thermodynamics",
    "abstract": "In phenomenological thermodynamics, the canonical coordinates of a physical system split in pairs with each pair consisting of an extensive quantity and an intensive one. In the present paper, the quasi-thermodynamic fluctuation theory of a model system of a large number of oscillators is extended to statistical thermodynamics based on the idea to perceive the fluctuations of intensive variables as the fluctuations of specific extensive ones in a \"thermodynamically dual\" system. The extension is motivated by the symmetry of the problem in the context of an analogy with quantum mechanics which is stated in terms of a generalized Pauli problem for the thermodynamic fluctuations. The doubled Boltzmann constant divided by the number of particles plays a similar role to the Planck constant.",
    "authors": [
      "Artur E. Ruuge"
    ],
    "publication_date": "2013-09-17T19:56:31Z",
    "arxiv_id": "http://arxiv.org/abs/1309.4439v2",
    "download_url": "https://arxiv.org/abs/1309.4439v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bulk-boundary thermodynamic equivalence: a topology viewpoint",
    "abstract": "Setting the cosmological constant to be dynamical, we study the bulk and boundary thermodynamics of charged Anti-de Sitter black holes. We develop mass/energy formulas in terms of thermodynamic state functions for the extended thermodynamics, mixed thermodynamics, and boundary conformal field theory thermodynamics. We employ the residue method to study the topological properties of the phase transitions. Our analysis reveals that the bulk and boundary thermodynamics are topologically equivalent for both criticalities and first-order phase transitions in the canonical ensembles, as well as for the Hawking-Page(-like) phase transitions in the grand canonical ensembles. Additionally, those three kinds of phase transitions are shown to be distinguished by their unique topological charges. Our results exemplify the gravity-gauge duality in terms of topology.",
    "authors": [
      "Ming Zhang",
      "Jie Jiang"
    ],
    "publication_date": "2023-03-30T16:32:58Z",
    "arxiv_id": "http://arxiv.org/abs/2303.17515v4",
    "download_url": "https://arxiv.org/abs/2303.17515v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Quasi-Topological Cosmology",
    "abstract": "In this paper, we study thermodynamical properties of the apparent horizon in a universe governed by quasi-topological gravity. Our aim is twofold. First, by using the variational method we derive the general form of Friedmann equation in quasi-topological gravity. Then, by applying the first law of thermodynamics on the apparent horizon, after using the entropy expression associated with the black hole horizon in quasi-topological gravity, and replacing the horizon radius, $r_{+}$, with the apparent horizon radius, $\\tilde{r}_{A}$, we derive the corresponding Friedmann equation in quasi-topological gravity. We find that these two different approaches yield the same result which show the profound connection between the first law of thermodynamics and the gravitational field equations of quasi-topological gravity. We also study the validity of the generalized second law of thermodynamics in quasi-topological cosmology. We find that, with the assumption of the local equilibrium hypothesis, the generalized second law of thermodynamics is fulfilled for the universe enveloped by the apparent horizon for the late time cosmology.",
    "authors": [
      "M. H. Dehghani",
      "A. Sheykhi",
      "R. Dehghani"
    ],
    "publication_date": "2013-06-19T12:05:34Z",
    "arxiv_id": "http://arxiv.org/abs/1306.4510v1",
    "download_url": "https://arxiv.org/abs/1306.4510v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonequilibrium thermodynamics and scale invariance",
    "abstract": "A variant of continuous nonequilibrium thermodynamic theory based on the postulate of the scale invariance of the local relation between generalized fluxes and forces has been proposed. This single postulate replaces the assumptions on local equilibrium and on the known relation between thermodynamic fluxes and forces, which are widely used in classical nonequilibrium thermodynamics. It has been shown that such a modification not only makes it possible to deductively obtain the main results of classical linear nonequilibrium thermodynamics, but also provides a number of statements for a nonlinear case (maximum entropy production principle, macroscopic reversibility principle, and generalized reciprocity relations) that are under discussion in the literature.",
    "authors": [
      "Leonid M. Martyushev",
      "V. D. Seleznev"
    ],
    "publication_date": "2015-06-03T05:40:45Z",
    "arxiv_id": "http://arxiv.org/abs/1506.01693v1",
    "download_url": "https://arxiv.org/abs/1506.01693v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Thermodynamics of Black Holes",
    "abstract": "We review the present status of black hole thermodynamics. Our review includes discussion of classical black hole thermodynamics, Hawking radiation from black holes, the generalized second law, and the issue of entropy bounds. A brief survey also is given of approaches to the calculation of black hole entropy. We conclude with a discussion of some unresolved open issues.",
    "authors": [
      "Robert M. Wald"
    ],
    "publication_date": "1999-12-31T00:05:33Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9912119v2",
    "download_url": "https://arxiv.org/abs/gr-qc/9912119v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics, photon sphere and thermodynamic geometry of Ayón-Beato-García Spacetime",
    "abstract": "We study the thermodynamics of the Ayón-Beato-García black hole and the relationship between photon orbits and the thermodynamic phase transitions of the black hole in AdS spacetime. We then examine the interactions between the microstructures of the black hole using Ruppeiner geometry. The radius of the photon orbit and the minimum impact parameter behave non-monotonically below the critical point, mimicking the behaviour of Hawking temperature and pressure in extended thermodynamics. Their changes during the large black hole--small black hole phase transition serve as the order parameter, possessing a critical exponent of $1/2$. The results demonstrate that the gravity and thermodynamics of the Ayón-Beato-García black hole are closely related. Furthermore, we explore the thermodynamic geometry, which provides insight into the microstructure interactions of the black hole. We find that the large black hole phase is analogous to a bosonic gas with a dominant attractive interaction, while the small black hole phase behaves like an anyonic gas with both attractive and repulsive interactions.",
    "authors": [
      "Kartheek Hegde",
      "A. Naveena Kumara",
      "C. L. Ahmed Rizwan",
      "Md Sabir Ali",
      "Shreyas Punacha",
      "K. M. Ajith"
    ],
    "publication_date": "2021-04-16T13:03:27Z",
    "arxiv_id": "http://arxiv.org/abs/2104.08091v2",
    "download_url": "https://arxiv.org/abs/2104.08091v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From thermodynamics to the solutions in gravity theory",
    "abstract": "In a recent work, we present a new point of view to the relation of gravity and thermodynamics, in which we derive the \\sch~solution through thermodynamic laws by the aid of the Misner-Sharp mass in an adiabatic system. In this paper we continue to investigate the relation between gravity and thermodynamics for obtaining solutions via thermodynamics. We generalize our studies on gravi-thermodynamics in Einstein gravity to modified gravity theories. By using the first law with the assumption that the Misner-Sharp mass is the mass for an adiabatic system, we reproduce the Boulware-Deser-Cai solution in Guass-Bonnet gravity. Using this gravi-thermodynamics thought, we obtain a NEW class of solution in $F(R)$ gravity in an $n$-dimensional (n$\\geq$3) spacetime which permits three-type $(n-2)$-dimensional maximally symmetric subspace, as an extension of our recent three-dimensional black hole solution, and four-dimensional Clifton-Barrow solution in $F(R)$ gravity.",
    "authors": [
      "Hongsheng Zhang",
      "Xin-Zhou Li"
    ],
    "publication_date": "2014-06-06T01:37:47Z",
    "arxiv_id": "http://arxiv.org/abs/1406.1553v1",
    "download_url": "https://arxiv.org/abs/1406.1553v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fundamental limitations for quantum and nano thermodynamics",
    "abstract": "The relationship between thermodynamics and statistical physics is valid in the thermodynamic limit - when the number of particles becomes very large. Here, we study thermodynamics in the opposite regime - at both the nano scale, and when quantum effects become important. Applying results from quantum information theory we construct a theory of thermodynamics in these limits. We derive general criteria for thermodynamical state transformations, and as special cases, find two free energies: one that quantifies the deterministically extractable work from a small system in contact with a heat bath, and the other that quantifies the reverse process. We find that there are fundamental limitations on work extraction from nonequilibrium states, owing to finite size effects and quantum coherences. This implies that thermodynamical transitions are generically irreversible at this scale. As one application of these methods, we analyse the efficiency of small heat engines and find that they are irreversible during the adiabatic stages of the cycle.",
    "authors": [
      "Michał Horodecki",
      "Jonathan Oppenheim"
    ],
    "publication_date": "2011-11-16T15:26:11Z",
    "arxiv_id": "http://arxiv.org/abs/1111.3834v2",
    "download_url": "https://arxiv.org/abs/1111.3834v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the thermodynamic instability of LST",
    "abstract": "The high energy thermodynamics of Little String Theory (LST) is known to be unstable. An unresolved question is whether the corresponding instability in LST holographic dual is of stringy or supergravity origin. We study UV thermodynamics of a large metric deformation of the LST dual realized (in the extremal case) by type IIB fivebranes wrapping a two-sphere of a resolved conifold, and demonstrate that the resulting black hole has negative specific heat. This explicitly shows that the high energy thermodynamic instability of the LST holographic dual is of the supergravity origin.",
    "authors": [
      "Alex Buchel"
    ],
    "publication_date": "2001-07-12T08:07:11Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/0107102v2",
    "download_url": "https://arxiv.org/abs/hep-th/0107102v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic and Logical Reversibilities Revisited",
    "abstract": "We review and investigate the general theory of thermodynamics of computation, and derive the fundamental inequalities that set the lower bounds of the work requirement and the heat emission during a computation. These inequalities constitute the generalized Landauer principle, where the information contents are involved in the second law of thermodynamics. We discuss in detail the relationship between the thermodynamic and logical reversibilities; the former is related to the entropy production in the total system including a heat bath, while the latter is related to the entropy change only in the logical states of the memory. In particular, we clarify that any logically irreversible computation can be performed in a thermodynamically reversible manner in the quasi-static limit, which does not contradict the conventional Landauer principle. Our arguments would serve as the theoretical foundation of thermodynamics of computation in terms of modern statistical physics.",
    "authors": [
      "Takahiro Sagawa"
    ],
    "publication_date": "2013-11-08T06:38:19Z",
    "arxiv_id": "http://arxiv.org/abs/1311.1886v2",
    "download_url": "https://arxiv.org/abs/1311.1886v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reheating and causal thermodynamics",
    "abstract": "The reheating process in inflationary universe models is considered as an out-of-equilibrium mixture of two interacting and reacting fluids, and studied within the framework of causal, irreversible thermodynamics. The evolution of the temperature and the decay rate as determined by causal thermodynamics are estimated at different stages of the process. A simple model is also used to find the perturbations of the expansion rate, including the possibility of damped oscillations.",
    "authors": [
      "Winfried Zimdahl",
      "Diego Pavón",
      "Roy Maartens"
    ],
    "publication_date": "1996-11-19T13:16:51Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/9611147v1",
    "download_url": "https://arxiv.org/abs/astro-ph/9611147v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Irreversible thermodynamics and Glansdorff-Prigogine principle derived from stochastic thermodynamics",
    "abstract": "We derive the main equations of irreversible thermodynamic including the expression for the Glansdorff-Prigogine extremal principle from stochastic thermodynamics. To this end, we analyze a system that is subject to gradients of temperature and external forces that induce the appearance of fluxes of several sorts and the creation of entropy. We show that the rate of entropy production is a convex function of the fluxes, from which follows that the excess entropy production is nonnegative, which is an expression of the Glansdorff-Prigogine principle. We show that the Lyapunov function associated with the excess entropy production can be identified with a thermodynamic potential in the special case where the gradients of temperature are absent.",
    "authors": [
      "Tânia Tomé",
      "Mário J. de Oliveira"
    ],
    "publication_date": "2025-01-27T13:56:42Z",
    "arxiv_id": "http://arxiv.org/abs/2501.16059v1",
    "download_url": "https://arxiv.org/abs/2501.16059v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Introduction to Quantum Thermodynamics: History and Prospects",
    "abstract": "Quantum Thermodynamics is a continuous dialogue between two independent theories: Thermodynamics and Quantum Mechanics. Whenever the two theories addressed the same phenomena new insight has emerged. We follow the dialogue from equilibrium Quantum Thermodynamics and the notion of entropy and entropy inequalities which are the base of the II-law. Dynamical considerations lead to non-equilibrium thermodynamics of quantum Open Systems. The central part played by completely positive maps is discussed leading to the Gorini-Kossakowski-Lindblad-Sudarshan GKLS equation. We address the connection to thermodynamics through the system-bath weak-coupling-limit WCL leading to dynamical versions of the I-law. The dialogue has developed through the analysis of quantum engines and refrigerators. Reciprocating and continuous engines are discussed. The autonomous quantum absorption refrigerator is employed to illustrate the III-law. Finally, we describe some open questions and perspectives.",
    "authors": [
      "Robert Alicki",
      "Ronnie Kosloff"
    ],
    "publication_date": "2018-01-25T08:55:24Z",
    "arxiv_id": "http://arxiv.org/abs/1801.08314v2",
    "download_url": "https://arxiv.org/abs/1801.08314v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A hierarchy of thermodynamically consistent quantum operations",
    "abstract": "In order to determine what quantum operations and measurements are consistent with the laws of thermodynamics, one must start by allowing all processes allowed by the framework of quantum theory, and then impose the laws of thermodynamics as a set of constraints. Here, we consider a hierarchy of quantum operations and measurements that are consistent with ($I$) the weak third law, ($II$) the strong third law, and ($III$) both the second and the third laws of thermodynamics, i.e., operations and measurements that are fully consistent with thermodynamics. Such characterisation allows us to identify which particular thermodynamic principle is responsible for the (un)attainability of a given quantum operation or measurement. In the case of channels, i.e., trace-preserving operations, we show that a channel belongs to ($I$) and ($II$) if and only if it is strictly positive and rank non-decreasing, respectively, whereas a channel belongs to ($III$) only if it is rank non-decreasing and does not perturb a strictly positive state. On the other hand, while thermodynamics does not preclude the measurability of any POVM, the realisable state-update rules for measurements are increasingly restricted as we go from ($I$) to ($III$).",
    "authors": [
      "Fereshte Shahbeigi",
      "M. Hamed Mohammady"
    ],
    "publication_date": "2025-05-29T11:34:38Z",
    "arxiv_id": "http://arxiv.org/abs/2505.23360v1",
    "download_url": "https://arxiv.org/abs/2505.23360v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics in f(R,T) Theory of Gravity",
    "abstract": "A non-equilibrium picture of thermodynamics is discussed at the apparent horizon of FRW universe in $f(R,T)$ gravity, where $R$ is the Ricci scalar and $T$ is the trace of the energy-momentum tensor. We take two forms of the energy-momentum tensor of dark components and demonstrate that equilibrium description of thermodynamics is not achievable in both cases. We check the validity of the first and second law of thermodynamics in this scenario. It is shown that the Friedmann equations can be expressed in the form of first law of thermodynamics $T_hdS'_h+T_hd_{\\jmath}S'=-dE'+W'dV$, where $d_{\\jmath}S'$ is the entropy production term. Finally, we conclude that the second law of thermodynamics holds both in phantom and non-phantom phases.",
    "authors": [
      "M. Sharif",
      "M. Zubair"
    ],
    "publication_date": "2012-04-04T02:13:02Z",
    "arxiv_id": "http://arxiv.org/abs/1204.0848v2",
    "download_url": "https://arxiv.org/abs/1204.0848v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Black Hole Thermodynamics in Carathéodory's Approach",
    "abstract": "We show that, in the framework of Carathéodory's approach to thermodynamics, one can implement black hole thermodynamics by realizing that there exixts a quasi-homogeneity symmetry of the Pfaffian form $\\deq$ representing the infinitesimal heat exchanged reversibly by a Kerr-Newman black hole; this allow us to calculate readily an integrating factor, and, as a consequence, a foliation of the thermodynamic manifold can be recovered.",
    "authors": [
      "F. Belgiorno"
    ],
    "publication_date": "2002-10-07T15:21:04Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0210020v2",
    "download_url": "https://arxiv.org/abs/gr-qc/0210020v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Theory of Thermodynamic Relativity",
    "abstract": "We introduce the theory of thermodynamic relativity, a unified framework for describing both entropies and velocities, and their respective disciplines of thermodynamics and kinematics, which share a surprisingly identical description with relativity. This is the first study to generalize relativity in a thermodynamic context, leading naturally to anisotropic and nonlinear adaptations of relativity; thermodynamic relativity constitutes a new path of generalization, as compared to the traditional passage from special to general theory based on curved spacetime. We show that entropy and velocity are characterized by three identical postulates, providing the basis of a broader framework of relativity: (1) no privileged reference frame with zero value; (2) existence of an invariant and fixed value for all reference frames; and (3) existence of stationarity. The postulates lead to a unique way of addition for entropies and for velocities, called kappa addition. The theory provides a systematic method of constructing a generalized framework of the theory of relativity, based on the kappa addition, fully consistent with both thermodynamics and kinematics. From the generality of the kappa addition, we focus on the cases corresponding to linear special relativity. Then, we show how the thermodynamic relativity leads to the addition of entropies in nonextensive thermodynamics and the addition of velocities in the isotropic special relativity of Einstein, as in two extreme cases, while intermediate cases correspond to an anisotropic adaptation of relativity. Using thermodynamic relativity for velocities, we construct the anisotropic special relativity (asymmetric Lorentz transformation, nondiagonal metric, energy momentum velocity relations). Then, we discuss the consequences of the anisotropy in known relativistic effects: (1) matter antimatter asymmetry, (2) time dilation, and (3) Doppler effect.",
    "authors": [
      "George Livadiotis",
      "David J. McComas"
    ],
    "publication_date": "2024-10-10T05:39:34Z",
    "arxiv_id": "http://arxiv.org/abs/2410.08242v1",
    "download_url": "https://arxiv.org/abs/2410.08242v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic cost of Brownian computers in the stochastic thermodynamics of resetting",
    "abstract": "We analyze the thermodynamic cost of a logically reversible Brownian Turing machine operating in the first-passage time protocol based on the stochastic thermodynamics of resetting. In this framework, the thermodynamic cost of computation is the reset entropy production, which is interpreted as the information reduction by a resetter external to the computer. At the level of a single trajectory, the reset entropy production is associated with unidirectional transitions and is a function of the time-dependent distribution probability. We analyze an approximation that replaces the distribution probability with the empirical sojourn time, which can be obtained at the single-trajectory level. The approximation is suitable for the numerical analysis by the Gillespie algorithm and provides a reasonable average value for the reset entropy.",
    "authors": [
      "Yasuhiro Utsumi",
      "Dimitry Golubev",
      "Ferdinand Peper"
    ],
    "publication_date": "2023-04-23T22:21:49Z",
    "arxiv_id": "http://arxiv.org/abs/2304.11760v2",
    "download_url": "https://arxiv.org/abs/2304.11760v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of nonadditive systems",
    "abstract": "The usual formulation of thermodynamics is based on the additivity of macroscopic systems. However, there are numerous examples of macroscopic systems that are not additive, due to the long-range character of the interaction among the constituents. We present here an approach in which nonadditive systems can be described within a purely thermodynamics formalism. The basic concept is to consider a large ensemble of replicas of the system where the standard formulation of thermodynamics can be naturally applied and the properties of a single system can be consequently inferred. After presenting the approach, we show its implementation in systems where the interaction decays as $1/r^α$ in the interparticle distance $r$, with $α$ smaller than the embedding dimension $d$, and in the Thirring model for gravitational systems.",
    "authors": [
      "Ivan Latella",
      "Agustín Pérez-Madrid",
      "Alessandro Campa",
      "Lapo Casetti",
      "Stefano Ruffo"
    ],
    "publication_date": "2015-05-14T15:51:53Z",
    "arxiv_id": "http://arxiv.org/abs/1505.03767v1",
    "download_url": "https://arxiv.org/abs/1505.03767v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Viscous Flows on Surfaces",
    "abstract": "In this paper, thermodynamics of a moving medium is considered. Main goal of this paper is to describe thermodynamics state equations and equations of co-existence manifolds of media on two- and three-dimensional manifolds. To this end the phase space of a medium is extended with the deformation tensor and the stress tensor.",
    "authors": [
      "Anna Duyunova",
      "Valentin Lychagin",
      "Sergey Tychkov"
    ],
    "publication_date": "2024-06-26T15:21:02Z",
    "arxiv_id": "http://arxiv.org/abs/2406.18427v1",
    "download_url": "https://arxiv.org/abs/2406.18427v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Null Surface Thermodynamics",
    "abstract": "We establish that boundary degrees of freedom associated with a generic co-dimension one null surface in $D$ dimensional pure Einstein gravity naturally admit a thermodynamical description. We expect the $\\textit{null surface thermodynamics}$ to universally follow as a result of the diffeomorphism invariance of the theory, not relying on other special features of the null surface or the gravity theory. Using standard surface charge analysis and covariant phase space method, we formulate laws of null surface thermodynamics which are local equations over an arbitrary null surface paralleling local versions the zeroth and first laws and the Gibbs-Duhem equation. This thermodynamical system is generally an open system and can be closed only when there is no flux of gravitons through the null surface. Our analysis extends the usual black hole thermodynamics to a universal feature of any area element on a generic null surface. We discuss the relevance of our study for the membrane paradigm and black hole microstates.",
    "authors": [
      "H. Adami",
      "M. M. Sheikh-Jabbari",
      "V. Taghiloo",
      "H. Yavartanoo"
    ],
    "publication_date": "2021-10-08T16:22:56Z",
    "arxiv_id": "http://arxiv.org/abs/2110.04224v2",
    "download_url": "https://arxiv.org/abs/2110.04224v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relativistic thermodynamics",
    "abstract": "A generally relativistic theory of thermodynamics is developed, based on four main physical principles: heat is a local form of energy, therefore described by a thermal energy tensor; conservation of mass, equivalent to conservation of heat, or the local first law; entropy is a local current; and non-destruction of entropy, or the local second law. A fluid is defined by the thermostatic energy tensor being isotropic. The entropy current is related to the other fields by certain equations, including a generalised Gibbs equation for the thermostatic entropy, followed by linear and quadratic terms in the dissipative (thermal minus thermostatic) energy tensor. Then the second law suggests certain equations for the dissipative energy tensor, generalising the Israel- Stewart dissipative relations, which describe heat conduction and viscosity including relativistic effects and relaxation effects. In the thermostatic case, the perfect-fluid model is recovered. In the linear approximation for entropy, the Eckart theory is recovered. In the quadratic approximation for entropy, the theory is similar to that of Israel & Stewart, but involving neither state-space differentials, nor a non-equilibrium Gibbs equation, nor non-material frames. Also, unlike conventional thermodynamics, the thermal energy density is not assumed to be purely thermostatic, though this is derived in the linear approximation. Otherwise, the theory reduces in the non- relativistic limit to the extended thermodynamics of irreversible processes due to Mueller. The dissipative energy density seems to be a new thermodynamical field, but also exists in relativistic kinetic theory of gases.",
    "authors": [
      "Sean A. Hayward"
    ],
    "publication_date": "1998-03-02T05:55:50Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9803007v2",
    "download_url": "https://arxiv.org/abs/gr-qc/9803007v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of the FLRW apparent horizon",
    "abstract": "To investigate the relationship between gravity and thermodynamics in the case of dynamic systems, we interpret the apparent horizon of the Friedmann-Lemaître-Robertson-Walker (FLRW) spacetime as a thermodynamic system. We derive the corresponding fundamental equation in the entropy representation and explore the consequences of demanding the fulfillment of the classical laws of thermodynamics. We investigate in detail the case of an FLRW spacetime with and without cosmological constant. We show that the interpretation of the apparent horizon as a thermodynamic system is possible only under certain conditions because the analogy is not always valid for all the values of the parameters entering the dynamics of the horizon and certainly not for its entire evolution.",
    "authors": [
      "Luis M. Sanchez",
      "Hernando Quevedo"
    ],
    "publication_date": "2022-08-11T09:51:20Z",
    "arxiv_id": "http://arxiv.org/abs/2208.05729v2",
    "download_url": "https://arxiv.org/abs/2208.05729v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The second law of quantum thermodynamics as an equality",
    "abstract": "We investigate the connection between recent results in quantum thermodynamics and fluctuation relations by adopting a fully quantum mechanical description of thermodynamics. By including a work system whose energy is allowed to fluctuate, we derive a set of equalities which all thermodynamical transitions have to satisfy. This extends the condition for maps to be Gibbs-preserving to the case of fluctuating work, providing a more general characterisation of maps commonly used in the information theoretic approach to thermodynamics. For final states, block diagonal in the energy basis, this set of equalities are necessary and sufficient conditions for a thermodynamical state transition to be possible. The conditions serves as a parent equation which can be used to derive a number of results. These include writing the second law of thermodynamics as an equality featuring a fine-grained notion of the free energy. It also yields a generalisation of the Jarzynski fluctuation theorem which holds for arbitrary initial states, and under the most general manipulations allowed by the laws of quantum mechanics. Furthermore, we show that each of these relations can be seen as the quasi-classical limit of three fully quantum identities. This allows us to consider the free energy as an operator, and allows one to obtain more general and fully quantum fluctuation relations from the information theoretic approach to quantum thermodynamics.",
    "authors": [
      "Álvaro M. Alhambra",
      "Lluis Masanes",
      "Jonathan Oppenheim",
      "Christopher Perry"
    ],
    "publication_date": "2016-01-21T21:00:02Z",
    "arxiv_id": "http://arxiv.org/abs/1601.05799v4",
    "download_url": "https://arxiv.org/abs/1601.05799v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Higher Order Structures in Thermodynamics",
    "abstract": "We present the development of the approach to thermodynamics based on measurement. First of all, we recall that considering classical thermodynamics as a theory of measurement of extensive variables one gets the description of thermodynamic states as Legendrian or Lagrangian manifolds representing the average of measurable quantities and extremal measures. Secondly, the variance of random vectors induces the Riemannian structures on the corresponding manifolds. Computing higher order central moments one drives to the corresponding higher order structures, namely, the cubic and the fourth order forms. The cubic form is responsible for the skewness of the extremal distribution. The condition for it to be zero gives us so-called symmetric processes. The positivity of the fourth order structure gives us an additional requirement to thermodynamic state.",
    "authors": [
      "Valentin Lychagin",
      "Mikhail Roop"
    ],
    "publication_date": "2020-09-04T09:04:43Z",
    "arxiv_id": "http://arxiv.org/abs/2009.02077v2",
    "download_url": "https://arxiv.org/abs/2009.02077v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometrical aspects in Equilibrium Thermodynamics",
    "abstract": "We discuss different aspects of the present status of the Statistical Physics focusing the attention on the non-extensive systems, and in particular, on the so called small systems. Multimicrocanonical Distribution and some of its geometric aspects are presented. The same could be a very atractive way to generalize the Thermodynamics. It is suggested that if the Multimicrocanonical Distribution could be equivalent in the Thermodynamic Limit with some generalized Canonical Distribution, then it is possible to estimate the entropic index of the non-extensive thermodynamics of Tsallis without any additional postulates.",
    "authors": [
      "L. Velazquez",
      "; F. Guzman"
    ],
    "publication_date": "2001-05-18T05:07:42Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0105364v2",
    "download_url": "https://arxiv.org/abs/cond-mat/0105364v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of a non-commutative fermion gas",
    "abstract": "Building on the recent solution for the spectrum of the non-commutative well in two dimensions, the thermodynamics that follows from it is computed. In particular the focus is put on an ideal fermion gas confined to such a well. At low densities the thermodynamics is the same as for the commutative gas. However, at high densities the thermodynamics deviate strongly from the commutative gas due to the implied excluded area resulting from the non-commutativity. In particular there are extremal macroscopic states, characterized by area, number of particles and angular momentum, that correspond to a single microscopic state and thus have vanishing entropy. When the system size and excluded area are comparable, thermodynamic quantities, such as entropy, exhibit non-extensive features.",
    "authors": [
      "F G Scholtz",
      "J Govaerts"
    ],
    "publication_date": "2008-10-17T06:18:36Z",
    "arxiv_id": "http://arxiv.org/abs/0810.3064v1",
    "download_url": "https://arxiv.org/abs/0810.3064v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of quantum coherence",
    "abstract": "Quantum decoherence is seen as an undesired source of irreversibility that destroys quantum resources. Quantum coherences seem to be a property that vanishes at thermodynamic equilibrium. Away from equilibrium, quantum coherences challenge the classical notions of a thermodynamic bath in a Carnot engines, affect the efficiency of quantum transport, lead to violations of Fourier's law, and can be used to dynamically control the temperature of a state. However, the role of quantum coherence in thermodynamics is not fully understood. Here we show that the relative entropy of a state with quantum coherence with respect to its decohered state captures its deviation from thermodynamic equilibrium. As a result, changes in quantum coherence can lead to a heat flow with no associated temperature, and affect the entropy production rate. From this, we derive a quantum version of the Onsager reciprocal relations that shows that there is a reciprocal relation between thermodynamic forces from coherence and quantum transport. Quantum decoherence can be useful and offers new possibilities of thermodynamic control for quantum transport.",
    "authors": [
      "César A. Rodríguez-Rosario",
      "Thomas Frauenheim",
      "Alán Aspuru-Guzik"
    ],
    "publication_date": "2013-08-06T11:42:04Z",
    "arxiv_id": "http://arxiv.org/abs/1308.1245v1",
    "download_url": "https://arxiv.org/abs/1308.1245v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "QCD Thermodynamics with Improved Actions",
    "abstract": "The thermodynamics of the SU(3) gauge theory has been analyzed with tree level and tadpole improved Symanzik actions. A comparison with the continuum extrapolated results for the standard Wilson action shows that improved actions lead to a drastic reduction of finite cut-off effects already on lattices with temporal extent $N_τ=4$. Results for the pressure, the critical temperature, surface tension and latent heat are presented. First results for the thermodynamics of four-flavour QCD with an improved staggered action are also presented. They indicate similarly large improvement factors for bulk thermodynamics.",
    "authors": [
      "F. Karsch",
      "B. Beinlich",
      "J. Engels",
      "R. Joswig",
      "E. Laermann",
      "A. Peikert",
      "B. Petersson"
    ],
    "publication_date": "1996-08-09T10:12:45Z",
    "arxiv_id": "http://arxiv.org/abs/hep-lat/9608047v1",
    "download_url": "https://arxiv.org/abs/hep-lat/9608047v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric quantum thermodynamics: A fibre bundle approach",
    "abstract": "Classical thermodynamics is a theory based on coarse-graining, meaning that the thermodynamic variables arise from discarding information related to the microscopic features of the system at hand. In quantum mechanics, however, where one has a high degree of control over microscopic systems, information theory plays an important role in describing the thermal properties of quantum systems. Recently, a new approach has been proposed in the form of a quantum thermodynamic gauge theory, where the notion of redundant information arises from a group of physically motivated gauge transformations called the thermodynamic group. In this work, we explore the geometrical structure of quantum thermodynamics. Particularly, we do so by explicitly constructing the relevant principal fibre bundle. We then show that there are two distinct (albeit related) geometric structures associated with the gauge theory of quantum thermodynamics. In this way, we express thermodynamics in the same mathematical (geometric) language as the fundamental theories of physics. Finally, we discuss how the geometric and topological properties of these structures may help explain fundamental properties of thermodynamics.",
    "authors": [
      "T. Pernambuco",
      "L. C. Céleri"
    ],
    "publication_date": "2025-12-16T13:20:46Z",
    "arxiv_id": "http://arxiv.org/abs/2512.14383v2",
    "download_url": "https://arxiv.org/abs/2512.14383v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Thermodynamics of Learning",
    "abstract": "Virtually every organism gathers information about its noisy environment and builds models from that data, mostly using neural networks. Here, we use stochastic thermodynamics to analyse the learning of a classification rule by a neural network. We show that the information acquired by the network is bounded by the thermodynamic cost of learning and introduce a learning efficiency $η\\le1$. We discuss the conditions for optimal learning and analyse Hebbian learning in the thermodynamic limit.",
    "authors": [
      "Sebastian Goldt",
      "Udo Seifert"
    ],
    "publication_date": "2016-11-28T23:35:25Z",
    "arxiv_id": "http://arxiv.org/abs/1611.09428v1",
    "download_url": "https://arxiv.org/abs/1611.09428v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonequilibrium Thermodynamics of Restricted Boltzmann Machines",
    "abstract": "In this work, we analyze the nonequilibrium thermodynamics of a class of neural networks known as Restricted Boltzmann Machines (RBMs) in the context of unsupervised learning. We show how the network is described as a discrete Markov process and how the detailed balance condition and the Maxwell-Boltzmann equilibrium distribution are sufficient conditions for a complete thermodynamics description, including nonequilibrium fluctuation theorems. Numerical simulations in a fully trained RBM are performed and the heat exchange fluctuation theorem is verified with excellent agreement to the theory. We observe how the contrastive divergence functional, mostly used in unsupervised learning of RBMs, is closely related to nonequilibrium thermodynamic quantities. We also use the framework to interpret the estimation of the partition function of RBMs with the Annealed Importance Sampling method from a thermodynamics standpoint. Finally, we argue that unsupervised learning of RBMs is equivalent to a work protocol in a system driven by the laws of thermodynamics in the absence of labeled data.",
    "authors": [
      "Domingos S. P. Salazar"
    ],
    "publication_date": "2017-04-27T19:23:37Z",
    "arxiv_id": "http://arxiv.org/abs/1704.08724v1",
    "download_url": "https://arxiv.org/abs/1704.08724v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the thermodynamics of reconciling quantum and gravity",
    "abstract": "Is thermodynamics consistent with the quantum gravity reconciliation hypothesis [A. G. Cohen et al. Phys. Rev. Lett. 82, 4971 (1999)], which establishes holographic dark energy models? Here, we have attempted to address this issue in the affirmative by concentrating on the first law of thermodynamics.",
    "authors": [
      "H. Moradpour",
      "S. Jalalzadeh",
      "Umesh Kumar Sharma"
    ],
    "publication_date": "2023-04-11T08:49:29Z",
    "arxiv_id": "http://arxiv.org/abs/2304.06494v1",
    "download_url": "https://arxiv.org/abs/2304.06494v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics in Kaluza-Klein Universe",
    "abstract": "This paper is devoted to check the validity of laws of thermodynamics for Kaluza-Klein universe in the state of thermal equilibrium, composed of dark matter and dark energy. The generalized holographic dark energy and generalized Ricci dark energy models are considered here. It is proved that the first and generalized second law of thermodynamics are valid on the apparent horizon for both of these models. Further, we take a horizon of radius $L$ with modified holographic or Ricci dark energy. We conclude that these models do not obey the first and generalized second law of thermodynamics on the horizon of fixed radius $L$ for a specific range of model parameters.",
    "authors": [
      "M. Sharif",
      "Rabia Saleem"
    ],
    "publication_date": "2013-12-13T03:57:56Z",
    "arxiv_id": "http://arxiv.org/abs/1406.4457v1",
    "download_url": "https://arxiv.org/abs/1406.4457v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entropy, Divergence, and Majorization in Classical and Quantum Thermodynamics",
    "abstract": "In these decades, it has been revealed that there is rich information-theoretic structure in thermodynamics of out-of-equilibrium systems in both the classical and quantum regimes. This has led to the fruitful interplay among statistical physics, quantum information theory, and mathematical theories including matrix analysis and asymptotic probability theory. The main purpose of this book is to clarify how information theory works behind thermodynamics and to shed modern light on it. We focus on both of purely information-theoretic concepts and their physical implications: We present self-contained and rigorous proofs of several fundamental properties of entropies, divergences, and majorization. We also discuss the modern formulations of thermodynamics, especially from the perspectives of stochastic thermodynamics and resource theory of thermodynamics. Resource theory is a recently-developed field as a branch of quantum information theory in order to quantify (energetically or information-theoretically) \"useful resources.\" We show that resource theory has an intrinsic connection to various fundamental ideas of mathematics and information theory. This book is not intended to be a comprehensive review of the field, but would serve as a concise introduction to several important ingredients of the information-theoretic formulation of thermodynamics.",
    "authors": [
      "Takahiro Sagawa"
    ],
    "publication_date": "2020-07-20T09:50:27Z",
    "arxiv_id": "http://arxiv.org/abs/2007.09974v3",
    "download_url": "https://arxiv.org/abs/2007.09974v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of a Quantum Subsystem",
    "abstract": "Several prior attempts to formulate the Laws of Thermodynamics for a small region within a larger quantum system have led to inconsistencies and unexplained infinities. The entropy and external work, in particular, require careful analysis when partitioning over the various subsystems. In this work, we analyze the thermodynamics of a quantum subsystem driven quasi-statically by external forces. We show that the thermodynamic functions of a quantum subsystem can be defined dynamically in terms of its local spectrum. The external work is found to be intrinsically nonlocal due to the nonlocal character of the underlying quantum states. This nonlocal quantum work can be harnessed in a \"quantum lever\" to provide up to 100% amplification of the local work done on a quantum subsystem.",
    "authors": [
      "Parth Kumar",
      "Charles A. Stafford"
    ],
    "publication_date": "2024-10-22T06:06:20Z",
    "arxiv_id": "http://arxiv.org/abs/2410.16721v2",
    "download_url": "https://arxiv.org/abs/2410.16721v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Elementary thermodynamics of trapped particles",
    "abstract": "I develop simple thermodynamic relations for a collection of noninteracting classical particles confined in a harmonic trap. The volume of such a trap is not a good thermodynamic variable, so conventional expressions of the first law of thermodynamics and the ideal gas law must be modified. I use the frequency of oscillations about the minimum of the trap as an external parameter characterizing the confinement, and derive elementary relations between particle number, temperature, energy, oscillation frequency, and a generalized pressure, that are analogous to conventional thermodynamic relations for an ideal gas in a rigid volume. I also discuss heat capacities for trapped particles.",
    "authors": [
      "Martin Ligare"
    ],
    "publication_date": "2002-10-12T17:07:41Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0210055v1",
    "download_url": "https://arxiv.org/abs/physics/0210055v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The thermodynamics of portfolios",
    "abstract": "We propose a new method of valuation of portfolios and their respective investing strategies. To this end we define a canonical ensemble of portfolios that allows to use the formalism thermodynamics.",
    "authors": [
      "E. W. Piotrowski",
      "J. Sladkowski"
    ],
    "publication_date": "2000-11-16T15:48:02Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0011280v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0011280v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Thermodynamics with Degenerate Eigenstate Coherences",
    "abstract": "We establish quantum thermodynamics for open quantum systems weakly coupled to their reservoirs when the system exhibits degeneracies. The first and second law of thermodynamics are derived, as well as a finite-time fluctuation theorem for mechanical work and energy and matter currents. Using a double quantum dot junction model, local eigenbasis coherences are shown to play a crucial role on thermodynamics and on the electron counting statistics.",
    "authors": [
      "Gregory Bulnes Cuetara",
      "Massimiliano Esposito",
      "Gernot Schaller"
    ],
    "publication_date": "2016-10-29T09:59:04Z",
    "arxiv_id": "http://arxiv.org/abs/1610.09481v1",
    "download_url": "https://arxiv.org/abs/1610.09481v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of supercooled water",
    "abstract": "We review the available experimental information on the thermodynamic properties of supercooled ordinary and heavy water and demonstrate the possibility of modeling these thermodynamic properties on a theoretical basis. We show that by assuming the existence of a liquid-liquid critical point in supercooled water, the theory of critical phenomena can give an accurate account of the experimental thermodynamic-property data up to a pressure of 150 MPa. In addition, we show that a phenomenological extension of the theoretical model can account for all currently available experimental data in the supercooled region, up to 400 MPa. The stability limit of the liquid state and possible coupling between crystallization and liquid-liquid separation are discussed. It is concluded that critical-point thermodynamics describes the available thermodynamic data for supercooled water within experimental accuracy, thus establishing a benchmark for further developments in this area.",
    "authors": [
      "V. Holten",
      "C. E. Bertrand",
      "M. A. Anisimov",
      "J. V. Sengers"
    ],
    "publication_date": "2011-11-23T19:08:33Z",
    "arxiv_id": "http://arxiv.org/abs/1111.5587v2",
    "download_url": "https://arxiv.org/abs/1111.5587v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "KnowTD-An Actionable Knowledge Representation System for Thermodynamics",
    "abstract": "We demonstrate that thermodynamic knowledge acquired by humans can be transferred to computers so that the machine can use it to solve thermodynamic problems and produce explainable solutions with a guarantee of correctness. The actionable knowledge representation system that we have created for this purpose is called KnowTD. It is based on an ontology of thermodynamics that represents knowledge of thermodynamic theory, material properties, and thermodynamic problems. The ontology is coupled with a reasoner that sets up the problem to be solved based on user input, extracts the correct, pertinent equations from the ontology, solves the resulting mathematical problem, and returns the solution to the user, together with an explanation of how it was obtained. KnowTD is presently limited to simple thermodynamic problems, similar to those discussed in an introductory course in Engineering Thermodynamics. This covers the basic theory and working principles of thermodynamics. KnowTD is designed in a modular way and is easily extendable.",
    "authors": [
      "Luisa Vollmer",
      "Sophie Fellenz",
      "Fabian Jirasek",
      "Heike Leitte",
      "Hans Hasse"
    ],
    "publication_date": "2024-07-24T11:21:34Z",
    "arxiv_id": "http://arxiv.org/abs/2407.17169v1",
    "download_url": "https://arxiv.org/abs/2407.17169v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classical and quantum stochastic thermodynamics",
    "abstract": "The stochastic thermodynamics provides a framework for the description of systems that are out of thermodynamic equilibrium. It is based on the assumption that the elementary constituents are acted by random forces that generate a stochastic dynamics, which is here represented by a Fokker-Planck-Kramers equation. We emphasize the role of the irreversible probability current, the vanishing of which characterizes the thermodynamic equilibrium and yields a special relation between fluctuation and dissipation. The connection to thermodynamics is obtained by the definition of the energy function and the entropy as well as the rate at which entropy is generated. The extension to quantum systems is provided by a quantum evolution equation which is a canonical quantization of the Fokker-Planck-Kramers equation. An example of an irreversible systems is presented which shows a nonequilibrium stationary state with an unceasing production of entropy. A relationship between the fluxes and the path integral is also presented.",
    "authors": [
      "Mário J. de Oliveira"
    ],
    "publication_date": "2020-06-25T12:32:14Z",
    "arxiv_id": "http://arxiv.org/abs/2006.14338v1",
    "download_url": "https://arxiv.org/abs/2006.14338v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics Basic Principles",
    "abstract": "Logical and mathematical aspects of the basic concepts of thermodynamics are considered.",
    "authors": [
      "G. V. Skornyakov"
    ],
    "publication_date": "2012-01-18T18:21:58Z",
    "arxiv_id": "http://arxiv.org/abs/1201.4133v4",
    "download_url": "https://arxiv.org/abs/1201.4133v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of the apparent horizon in massive cosmology",
    "abstract": "Applying Clausius relation with energy-supply defined by the unified first law of thermodynamics formalism to the apparent horizon of a massive cosmological model proposed lately, the corrected entropic formula of the apparent horizon is obtained with the help of the modified Friedmann equations. This entropy-area relation, together with the identified internal energy, verifies the first law of thermodynamics for the apparent horizon with a volume change term for consistency. On the other hand, by means of the corrected entropy-area formula and the Clausius relation $δQ=T dS$, the modified Friedmann equations governing the dynamical evolution of the universe are reproduced with the known energy density and pressure of massive graviton. The integration constant is found to correspond to a cosmological term which could be absorbed into the energy density of matter. Having established the correspondence of massive cosmology with the unified first law of thermodynamics on the apparent horizon, the validity of the generalized second law of thermodynamics is also discussed by assuming the thermal equilibrium between the apparent horizon and the matter field bounded by the apparent horizon. It is found that, in the limit $H_c\\rightarrow 0$ which recovers the Minkowski reference metric solution in the flat case, the generalized second law of thermodynamics holds if $α_3+4α_4<0$. Apart from that, even for the simplest model of dRGT massive cosmology with $α_3=α_4=0$, the generalized second law of thermodynamics could be violated.",
    "authors": [
      "Hui Li",
      "Yi Zhang"
    ],
    "publication_date": "2013-04-17T11:57:28Z",
    "arxiv_id": "http://arxiv.org/abs/1304.4780v2",
    "download_url": "https://arxiv.org/abs/1304.4780v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Status of the Fundamental Laws of Thermodynamics",
    "abstract": "We describe recent progress towards deriving the Fundamental Laws of thermodynamics (the 0th, 1st and 2nd Law) from nonequilibrium quantum statistical mechanics in simple, yet physically relevant models. Along the way, we clarify some basic thermodynamic notions and discuss various reversible and irreversible thermodynamic processes from the point of view of quantum statistical mechanics.",
    "authors": [
      "Walid K. Abou Salem",
      "Juerg Froehlich"
    ],
    "publication_date": "2006-04-27T10:17:45Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0604067v3",
    "download_url": "https://arxiv.org/abs/math-ph/0604067v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Horizon thermodynamics in fourth-order gravity",
    "abstract": "In the framework of horizon thermodynamics, the field equations of Einstein gravity and some other second-order gravities can be rewritten as the thermodynamic identity: $dE=TdS-PdV$. However, in order to construct the horizon thermodynamics in higher-order gravity, we have to simplify the field equations firstly. In this paper, we study the fourth-order gravity and convert it to second-order gravity via a so-called \" Legendre transformation \" at the cost of introducing two other fields besides the metric field. With this simplified theory, we implement the conventional procedure in the construction of the horizon thermodynamics in 3 and 4 dimensional spacetime. We find that the field equations in the fourth-order gravity can also be written as the thermodynamic identity. Moreover, we can use this approach to derive the same black hole mass as that by other methods.",
    "authors": [
      "Meng-Sen Ma"
    ],
    "publication_date": "2017-02-27T08:30:01Z",
    "arxiv_id": "http://arxiv.org/abs/1702.08184v1",
    "download_url": "https://arxiv.org/abs/1702.08184v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Many Black Holes",
    "abstract": "We discuss the thermodynamics of an array of collinear black holes which may be accelerating. We prove a general First Law, including variations in the tensions of strings linking and accelerating the black holes. We analyse the implications of the First Law in a number of instructive cases, including that of the C-metric, and relate our findings to the previously obtained thermodynamics of slowly accelerating black holes in anti-de Sitter spacetime. The concept of thermodynamic length is found to be robust and a Christoudoulou-Ruffini formula for the C-metric is shown.",
    "authors": [
      "Ruth Gregory",
      "Zheng Liang Lim",
      "Andrew Scoins"
    ],
    "publication_date": "2020-12-31T11:37:06Z",
    "arxiv_id": "http://arxiv.org/abs/2012.15561v1",
    "download_url": "https://arxiv.org/abs/2012.15561v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Explicit and universal formula for thermodynamic volume in extended black hole thermodynamics",
    "abstract": "In extended black hole thermodynamics, the cosmological constant and other couplings are treated as thermodynamic variables, yielding a first law $\\tildeδM=T\\tildeδS+Ω\\tildeδJ+\\mathcal{V}\\tildeδP+\\cdots$, where $P\\equiv -\\fracΛ{8π}$. A long-standing conceptual gap in this framework is that, unlike $M$, $T$, $S$, $Ω$, and $J$, the thermodynamic volume $\\mathcal{V}$ lacks a first-principles definition and can only be deduced from other thermodynamic quantities. This deficiency indicates that the underlying origin of $\\mathcal{V}$ has remained poorly understood. In this work, we resolve this issue and provide an explicit universal formula for $\\mathcal{V}$. We demonstrate that it universally decomposes into two contributions, one arising from the explicit dependence of the action on the couplings and the other from the response of the fundamental dynamical fields. This clarifies the physical meaning of thermodynamic volume and places it on the same footing as other intrinsic thermodynamic quantities.",
    "authors": [
      "Yong Xiao",
      "Yu-Xiao Liu",
      "Yu Tian",
      "Hongbao Zhang"
    ],
    "publication_date": "2025-12-01T17:33:08Z",
    "arxiv_id": "http://arxiv.org/abs/2512.01916v1",
    "download_url": "https://arxiv.org/abs/2512.01916v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Uniqueness of Entanglement Measure and Thermodynamics",
    "abstract": "We apply the axiomatic approach to thermodynamics presented by Giles to derive a unique measure of entanglement for bi-partite pure states. This implies that local manipulations of entanglement in quantum information theory and adiabatic transformations of states in thermodynamics have the same underlying mathematical structure. We discuss possible extensions of our results to mixed and multi-partite states.",
    "authors": [
      "Vlatko Vedral",
      "Elham Kashefi"
    ],
    "publication_date": "2001-12-21T17:58:07Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0112137v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0112137v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparison of the Standard Statistical Thermodynamics (SST) with the Generalized Statistical Thermodynamics (GST) Results for the Ising Chain",
    "abstract": "In this study, the internal energy and the specific heat of the one- dimensional Ising model obtained in the frame of the generalized statistical thermodynamics by Andrade [Physica A175 (1991) 285], have been extended somewhat and compared with the internal energy and the specific heat which have been calculated in the standard statistical thermodynamics.",
    "authors": [
      "Ugur Tirnakli",
      "Dogan Demirhan",
      "Fevzi Buyukkilic"
    ],
    "publication_date": "1996-12-05T17:52:26Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9612055v1",
    "download_url": "https://arxiv.org/abs/cond-mat/9612055v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Consistent thermodynamics for spin echoes",
    "abstract": "Spin-echo experiments are often said to constitute an instant of anti-thermodynamic behavior in a concrete physical system that violates the second law of thermodynamics. We argue that a proper thermodynamic treatment of the effect should take into account the correlations between the spin and translational degrees of freedom of the molecules. To this end, we construct an entropy functional using Boltzmann macrostates that incorporates both spin and translational degrees of freedom. With this definition there is nothing special in the thermodynamics of spin echoes: dephasing corresponds to Hamiltonian evolution and leaves the entropy unchanged; dissipation increases the entropy. In particular, there is no phase of entropy decrease in the echo. We also discuss the definition of macrostates from the underlying quantum theory and we show that the decay of net magnetization provides a faithful measure of entropy change.",
    "authors": [
      "Charis Anastopoulos",
      "Ntina Savvidou"
    ],
    "publication_date": "2010-09-05T18:32:01Z",
    "arxiv_id": "http://arxiv.org/abs/1009.0940v2",
    "download_url": "https://arxiv.org/abs/1009.0940v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics in $f(\\mathcal{G},T)$ Gravity",
    "abstract": "This paper explores the non-equilibrium behavior of thermodynamics at the apparent horizon of isotropic and homogeneous universe model in $f(\\mathcal{G},T)$ gravity ($\\mathcal{G}$ and $T$ represent the Gauss-Bonnet invariant and trace of the energy-momentum tensor, respectively). We construct the corresponding field equations and analyze the first as well as generalized second law of thermodynamics in this scenario. It is found that an auxiliary term corresponding to entropy production appears due to the non-equilibrium picture of thermodynamics in first law. The universal condition for the validity of generalized second law of thermodynamics is also obtained. Finally, we check the validity of generalized second law of thermodynamics for the reconstructed $f(\\mathcal{G},T)$ models (de Sitter and power-law solutions). We conclude that this law holds for suitable choices of free parameters.",
    "authors": [
      "M. Sharif",
      "Ayesha Ikram"
    ],
    "publication_date": "2018-03-01T09:36:31Z",
    "arxiv_id": "http://arxiv.org/abs/1803.01712v1",
    "download_url": "https://arxiv.org/abs/1803.01712v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Superstudent intelligence in thermodynamics",
    "abstract": "In this short note, we report and analyze a striking event: OpenAI's large language model o3 has outwitted all students in a university exam on thermodynamics. The thermodynamics exam is a difficult hurdle for most students, where they must show that they have mastered the fundamentals of this important topic. Consequently, the failure rates are very high, A-grades are rare - and they are considered proof of the students' exceptional intellectual abilities. This is because pattern learning does not help in the exam. The problems can only be solved by knowledgeably and creatively combining principles of thermodynamics. We have given our latest thermodynamics exam not only to the students but also to OpenAI's most powerful reasoning model, o3, and have assessed the answers of o3 exactly the same way as those of the students. In zero-shot mode, the model o3 solved all problems correctly, better than all students who took the exam; its overall score was in the range of the best scores we have seen in more than 10,000 similar exams since 1985. This is a turning point: machines now excel in complex tasks, usually taken as proof of human intellectual capabilities. We discuss the consequences this has for the work of engineers and the education of future engineers.",
    "authors": [
      "Rebecca Loubet",
      "Pascal Zittlau",
      "Marco Hoffmann",
      "Luisa Vollmer",
      "Sophie Fellenz",
      "Heike Leitte",
      "Fabian Jirasek",
      "Johannes Lenhard",
      "Hans Hasse"
    ],
    "publication_date": "2025-06-11T15:01:41Z",
    "arxiv_id": "http://arxiv.org/abs/2506.09822v1",
    "download_url": "https://arxiv.org/abs/2506.09822v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Einstein-DBI System",
    "abstract": "We continue our study of the Einstein-Dirac-Born-Infeld system as started in \\cite{Pal:2012zn}. In this paper, we studied the thermodynamical aspect of the black hole by keeping the horizon as planar in the grand canonical ensemble. In particular, we obtain the first law of thermodynamics and the Smarr type relation. Also, studied the thermodynamic stability.",
    "authors": [
      "Shesansu Sekhar Pal"
    ],
    "publication_date": "2017-12-26T12:18:35Z",
    "arxiv_id": "http://arxiv.org/abs/1712.09249v3",
    "download_url": "https://arxiv.org/abs/1712.09249v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic derivation of reciprocal relations",
    "abstract": "Reciprocal relations correlate fairly accurately a great variety of experimental results. Nevertheless, the concepts of statistical fluctuations, and microscopic reversibility - the bases of the accepted proof of the relations by Onsager - are illusory and faulty, and contradict the foundations of the science of thermodynamics. The definitions, postulates, and main theorems of thermodynamics are briefly presented. It is shown beyond a shadow of a doubt that thermodynamics is a nonstatistical science that applies to all systems (both macroscopic, and microscopic, including systems that consist either of only one structureless particle, or only one spin), to all states (both thermodynamic or stable equilibrium, and not stable equilibrium), and that includes entropy as a well defined, intrinsic, nonstatistical property of any system in any state, at any instant in time. In the light of this novel conception of thermodynamics, we find that reciprocal relations result from a well known mathematical theorem, to wit, given a well behaved analytic function of many variables then the second derivative of the function with respect to any two variables is independent of the order of differentiation, namely, whether the first derivative is taken with respect to the one or the other of the two variables.",
    "authors": [
      "Elias P. Gyftopoulos"
    ],
    "publication_date": "2004-06-01T18:29:49Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0406004v2",
    "download_url": "https://arxiv.org/abs/physics/0406004v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of two black holes",
    "abstract": "We study a system of two charged non-rotating black holes separated by a strut. Using the exact solution of the Einstein-Maxwell equations, which describes this system, we construct a consistent form of the first law of thermodynamics. We derive thermodynamic parameters related to the strut in an explicit form. The intensive thermodynamical quantity associated with the strut is its tension. We call the corresponding extensive quantity the thermodynamical length and we provide an explicit expression and interpretation for it.",
    "authors": [
      "Pavel Krtouš",
      "Andrei Zelnikov"
    ],
    "publication_date": "2019-09-30T06:06:22Z",
    "arxiv_id": "http://arxiv.org/abs/1909.13467v3",
    "download_url": "https://arxiv.org/abs/1909.13467v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A microscopic perspective on stochastic thermodynamics",
    "abstract": "We consider stochastic thermodynamics as a theory of statistical inference for experimentally observed fluctuating time-series. To that end, we introduce a general framework for quantifying the knowledge about the dynamical state of the system on two scales: a fine-grained or microscopic, deterministic and a coarse-grained or mesoscopic, stochastic level of description. For a generic model dynamics, we show how the mathematical expressions for fluctuating entropy changes used in Markovian stochastic thermodynamics emerge naturally. Our ideas are conceptional approaches towards (i) connecting entropy production and its fluctuation relations in deterministic and stochastic systems and (ii) providing a complementary information-theoretic picture to notions of entropy and entropy production in stochastic thermodynamics.",
    "authors": [
      "Bernhard Altaner",
      "Jürgen Vollmer"
    ],
    "publication_date": "2012-12-19T16:32:26Z",
    "arxiv_id": "http://arxiv.org/abs/1212.4728v3",
    "download_url": "https://arxiv.org/abs/1212.4728v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Extended Bodies in Special Relativity",
    "abstract": "Relativistic thermodynamics is generalized to accommodate four dimensional rotation in a flat spacetime. An extended body can be in equilibrium when its each element moves along a Killing flow. There are three types of basic Killing flows in a flat spacetime, each of which corresponds to translational motion, spatial rotation, and constant linear acceleration; spatial rotation and constant linear acceleration are regarded as four dimensional rotation. Translational motion has been mainly investigated in the past literature of relativistic thermodynamics. Thermodynamics of the other two is derived in the present paper.",
    "authors": [
      "Tadas K Nakamura"
    ],
    "publication_date": "2010-02-04T11:01:14Z",
    "arxiv_id": "http://arxiv.org/abs/1002.0960v1",
    "download_url": "https://arxiv.org/abs/1002.0960v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Langevin Equations",
    "abstract": "The physical significance of the stochastic processes associated to the generalized Gibbs ensembles is scrutinized here with special attention to the thermodynamic fluctuations of small systems. The contact with the environment produces an interaction entropy, which controls the distribution of fluctuations and allows writing the generalized Gibbs ensembles for macrostates in potential form. This naturally yields exact nonlinear thermodynamic Langevin equations (TLEs) for such variables, with drift expressed in terms of entropic forces. The analysis of the canonical ensemble for an ideal monoatomic gas and the related TLEs show that introducing currents leads to nonequilibrium heat transfer conditions with interesting bounds on entropy production but with no obvious thermodynamic limit. For a colloidal particle under constant force, the TLEs for macroscopic variables are different from those for the microscopic position, typically used in the so-called stochastic thermodynamics; while TLEs are consistent with the fundamental equation obtained from the Hamiltonian, stochastic thermodynamics requires isothermal conditions and entropy proportional to position.",
    "authors": [
      "Amilcare Porporato",
      "Salvatore Calabrese",
      "Lamberto Rondoni"
    ],
    "publication_date": "2024-09-01T18:58:38Z",
    "arxiv_id": "http://arxiv.org/abs/2409.00811v1",
    "download_url": "https://arxiv.org/abs/2409.00811v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Thermodynamics of Gravitational Radiation",
    "abstract": "This article deals with the thermodynamics of gravitational radiation arising from the Bondi-Sachs space-time. The equation of state found allows us to conclude that the dependence of the energy density on the temperature is a quadratic power of the latter. Such a conclusion is possible once the consequences of the first law of thermodynamics are analyzed. Then, in analogy to electromagnetic radiation, the same approach as used by Planck to obtain the quantum of energy of the gravitational radiation is proposed. An energy for the graviton proportional to the cubic frequency is found. The graviton is here understood as the quantum of gravitational energy.",
    "authors": [
      "S. C. Ulhoa",
      "F. L. Carneiro",
      "J. W. Maluf"
    ],
    "publication_date": "2023-08-09T17:27:07Z",
    "arxiv_id": "http://arxiv.org/abs/2308.05084v1",
    "download_url": "https://arxiv.org/abs/2308.05084v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complex competitive systems and competitive thermodynamics",
    "abstract": "This publication reviews the framework of abstract competition, which is aimed at studying complex systems with competition in their generic form. Although the concept of abstract competition has been derived from a specific field - modelling of mixing in turbulent reacting flows - this concept is, generally, not attached to a specific phenomenon or application. Two classes of competition rules, transitive and intransitive, need to be distinguished. Transitive competitions are shown to be consistent (at least qualitatively) with thermodynamic principles, which allows for introduction of special competitive thermodynamics. Competitive systems can thus be characterised by thermodynamic quantities (such as competitive entropy and competitive potential), which determine that the predominant direction of evolution of the system is directed towards higher competitiveness. There is, however, an important difference: while conventional thermodynamics is constrained by its zeroth law and is fundamentally transitive, the transitivity of competitive thermodynamics depends on the transitivity of the competition rules. The analogy with conventional thermodynamics weakens as competitive systems become more intransitive, while strongly intransitive competitions can display types of behaviour associated with complexity: competitive cooperation and leaping cycles. Results of simulations demonstrating complex behaviour in abstract competitions are presented in the electronic supplementary material (ESM).",
    "authors": [
      "A. Y. Klimenko"
    ],
    "publication_date": "2013-04-05T03:16:13Z",
    "arxiv_id": "http://arxiv.org/abs/1304.1604v2",
    "download_url": "https://arxiv.org/abs/1304.1604v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relativistic Nonextensive Thermodynamics",
    "abstract": "Starting from the basic prescriptions of the Tsallis' nonextensive thermostatistics, i.e. generalized entropy and normalized q-expectation values, we study the relativistic nonextensive thermodynamics and derive a Boltzmann transport equation that implies the validity of the H-theorem where a local nonextensive four-entropy density is considered. Macroscopic thermodynamic functions and the equation of state for a perfect gas are derived at the equilibrium.",
    "authors": [
      "A. Lavagno"
    ],
    "publication_date": "2002-07-15T09:53:52Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0207353v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0207353v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generalized second law of thermodynamics in warped DGP braneworld",
    "abstract": "We investigate the validity of the generalized second law of thermodynamics on the $(n-1)$-dimensional brane embedded in the $(n+1)$-dimensional bulk. We examine the evolution of the apparent horizon entropy extracted through relation between gravitational equation and the first law of thermodynamics together with the matter field entropy inside the apparent horizon. We find that the apparent horizon entropy extracted through connection between gravity and the first law of thermodynamics satisfies the generalized second law of thermodynamics. This result holds regardless of whether there is the intrinsic curvature term on the brane or a cosmological constant in the bulk. The observed satisfaction of the generalized second law provides further support on the thermodynamical interpretation of gravity based on the profound connection between gravity and thermodynamics.",
    "authors": [
      "Ahmad Sheykhi",
      "Bin Wang"
    ],
    "publication_date": "2008-11-27T08:10:51Z",
    "arxiv_id": "http://arxiv.org/abs/0811.4477v3",
    "download_url": "https://arxiv.org/abs/0811.4477v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extensivity and Relativistic Thermodynamics",
    "abstract": "The mathematical properties associated with the widely accepted concept of the extensivity of many of the common thermodynamic variables are examined and some of their consequences considered. The possible conflict between some of these and currently accepted results of special relativistic thermodynamics is highlighted. Although several questions are raised, answers are not advanced as this seems an area demanding calm, widespread reflection which could conceivably lead to radical revision of part, or parts, of theoretical physics.",
    "authors": [
      "J. Dunning-Davies"
    ],
    "publication_date": "2007-06-27T13:11:11Z",
    "arxiv_id": "http://arxiv.org/abs/0706.4020v1",
    "download_url": "https://arxiv.org/abs/0706.4020v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time is dispensable in thermodynamics",
    "abstract": "We use Padoa's principle of independence of primitive symbols in axiomatic systems in order to show that time is dispensable in continuum thermodynamics, according to the axiomatic formulation of Gurtin and Williams. We also show how to define time by means of the remaining primitive concepts of Gurtin and Williams system. Finally, we introduce thermodynamics without any explicit reference to time and briefly discuss some physical and philosophical consequences of our main results.",
    "authors": [
      "Newton C. A. da Costa",
      "Adonai S. Sant'Anna"
    ],
    "publication_date": "2001-04-23T19:58:47Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0104032v1",
    "download_url": "https://arxiv.org/abs/math-ph/0104032v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The thermodynamics of urban population flows",
    "abstract": "Orderliness, reflected via mathematical laws, is encountered in different frameworks involving social groups. Here we show that a thermodynamics can be constructed that macroscopically describes urban population flows. Microscopic dynamic equations and simulations with random walkers underlie the macroscopic approach. Our results might be regarded, via suitable analogies, as a step towards building an explicit social thermodynamics.",
    "authors": [
      "A. Hernando",
      "A. Plastino"
    ],
    "publication_date": "2012-06-29T13:35:50Z",
    "arxiv_id": "http://arxiv.org/abs/1206.7020v1",
    "download_url": "https://arxiv.org/abs/1206.7020v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of bosonic systems in adS spacetime",
    "abstract": "We analyze the thermodynamics of massless bosonic systems in D-dimensional anti-de Sitter spacetime, considering scalar, electromagnetic, and gravitational fields. Their dynamics are described by Poschl-Teller effective potentials and quantized in a unified framework, with the determination of the associated energy spectra. From the microscopic description developed, a macroscopic thermodynamic treatment is proposed, where an effective volume in anti-de Sitter geometry is defined and a suitable thermodynamic limit is considered. Partition functions are constructed for the bosonic gases, allowing the determination of several thermodynamic quantities of interest. With the obtained results, general aspects of the thermodynamics are explored.",
    "authors": [
      "Walace S. Elias",
      "C. Molina",
      "M. C. Baldiotti"
    ],
    "publication_date": "2018-03-15T18:00:07Z",
    "arxiv_id": "http://arxiv.org/abs/1803.05921v3",
    "download_url": "https://arxiv.org/abs/1803.05921v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Black hole thermodynamics from decoherence",
    "abstract": "We present an approach to the four laws of black hole thermodynamics by utilizing the thermodynamics of quantum coherence. Firstly, Hawking effect is attributed to the decoherence of the two-mode squeezed state in a black hole spacetime. Then use is made of the relative entropy between undecohered and decohered squeezed states whose monotonicity gives the zeroth and the second law, while the first law can be obtained either by the vanishing of the first derivative of relative entropy or by studying the effective thermal model generated by the modular Hamiltonian. Futhermore, information-theoretic arguments give a Planck's form of the third law of black hole thermodynamics. With this approach we can understand the laboratory analogues of black holes solely by quantum theory, and find a way to detect the thermodynamics of black holes produced in colliders.",
    "authors": [
      "Xiao-Kan Guo"
    ],
    "publication_date": "2015-12-15T04:05:51Z",
    "arxiv_id": "http://arxiv.org/abs/1512.05277v2",
    "download_url": "https://arxiv.org/abs/1512.05277v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics as Combinatorics: A Toy Theory",
    "abstract": "We discuss a simple toy model which allows, in a natural way, for deriving central facts from thermodynamics such as its fundamental laws, including Carnot's version of the second principle. Our viewpoint represents thermodynamic systems as binary strings, and it links their temperature to their Hamming weight. From this, we can reproduce the possibility of negative temperatures, the notion of equilibrium as the coïncidence of two notions of temperature - statistical versus structural -, as well as the zeroth law of thermodynamics (transitivity of the thermal-equilibrium relation), which we find to be redundant, as other authors, yet at the same time not to be universally valid.",
    "authors": [
      "Ämin Baumeler",
      "Carla Rieger",
      "Stefan Wolf"
    ],
    "publication_date": "2022-05-16T12:48:27Z",
    "arxiv_id": "http://arxiv.org/abs/2205.07628v1",
    "download_url": "https://arxiv.org/abs/2205.07628v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Information Retrieval",
    "abstract": "In this work, we suggest a parameterized statistical model (the gamma distribution) for the frequency of word occurrences in long strings of English text and use this model to build a corresponding thermodynamic picture by constructing the partition function. We then use our partition function to compute thermodynamic quantities such as the free energy and the specific heat. In this approach, the parameters of the word frequency model vary from word to word so that each word has a different corresponding thermodynamics and we suggest that differences in the specific heat reflect differences in how the words are used in language, differentiating keywords from common and function words. Finally, we apply our thermodynamic picture to the problem of retrieval of texts based on keywords and suggest some advantages over traditional information retrieval methods.",
    "authors": [
      "Kostadin Koroutchev",
      "Jian Shen",
      "Elka Koroutcheva",
      "Manuel Cebrian"
    ],
    "publication_date": "2009-03-16T16:16:42Z",
    "arxiv_id": "http://arxiv.org/abs/0903.2792v3",
    "download_url": "https://arxiv.org/abs/0903.2792v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universality of P-V Criticality in Horizon Thermodynamics",
    "abstract": "We study P-V criticality of black holes in Lovelock gravities in the context of horizon thermodynamics. The corresponding first law of horizon thermodynamics emerges as one of the Einstein-Lovelock equations and assumes the universal (independent of matter content) form dE=TdS-PdV, where P is identified with the total pressure of all matter in the spacetime (including a cosmological constant Lambda if present). We compare this approach to recent advances in extended phase space thermodynamics of asymptotically AdS black holes where the \"standard\" first law of black hole thermodynamics is extended to include a pressure-volume term, where the pressure is entirely due to the (variable) cosmological constant. We show that both approaches are quite different in interpretation. Provided there is sufficient non-linearity in the gravitational sector, we find that horizon thermodynamics admits the same interesting black hole phase behaviour seen in the extended case, such as a Hawking-Page transition, Van der Waals like behaviour, and the presence of a triple point. We also formulate the Smarr formula in horizon thermodynamics and discuss the interpretation of the quantity E appearing in the horizon first law.",
    "authors": [
      "Devin Hansen",
      "David Kubiznak",
      "Robert B. Mann"
    ],
    "publication_date": "2016-03-17T21:08:05Z",
    "arxiv_id": "http://arxiv.org/abs/1603.05689v1",
    "download_url": "https://arxiv.org/abs/1603.05689v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Descriptive Thermodynamics",
    "abstract": "Thermodynamics (in concert with its sister discipline, statistical physics) can be regarded as a data reduction scheme based on partitioning a total system into a subsystem and a bath that weakly interact with each other. The ubiquity and applicability of the scheme chiefly derives from that of partitioning protocols in experiments and observations. Whereas conventionally, the systems investigated require this form of data reduction in order to facilitate prediction, a different problem also occurs, in the context of communication networks, markets, etc. Such \"empirically accessible\" systems typically overwhelm observers with the sort of information that in the case of (say) a gas is effectively unobtainable. What is required for such complex interacting systems is not prediction (this may be impossible when humans besides the observer are responsible for the interactions) but rather,_description_ as a route to understanding. Still, the need for a thermodynamical data reduction scheme remains. In this paper, we show how an empirical temperature can be computed for finite, empirically accessible systems, and further outline how this construction allows the age-old science of thermodynamics to be fruitfully applied to them. The particular example of TCP/IP networks will be briefly discussed.",
    "authors": [
      "David Ford",
      "Steven Huntsman"
    ],
    "publication_date": "2005-10-03T03:56:52Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0510030v2",
    "download_url": "https://arxiv.org/abs/cond-mat/0510030v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum thermodynamics as a gauge theory",
    "abstract": "Thermodynamics is based on a coarse-grained approach, from which its fundamental variables emerge, effectively erasing the complicate details of the microscopic dynamics within a macroscopic system. The strength of Thermodynamics lies in the universality provided by this paradigm. In contrast, quantum mechanics focuses on describing the dynamics of microscopic systems, aiming to make predictions about experiments we perform, a goal shared by all fundamental physical theories, which are often framed as gauge theories in modern physics. Recently, a gauge theory for quantum thermodynamics was introduced, defining gauge invariant work and heat, and exploring their connections to quantum phenomena. In this work, we extend that theory in two significant ways. First, we incorporate energy spectrum degeneracies, which were previously overlooked. Additionally, we define gauge-invariant entropy, exploring its properties and connections to other physical and informational quantities. This results in a complete framework for quantum thermodynamics grounded in the principle of gauge invariance. To demonstrate some implications of this theory, we apply it to well-known critical systems.",
    "authors": [
      "Gabriel Fernandez Ferrari",
      "Łukasz Rudnicki",
      "Lucas Chibebe Céleri"
    ],
    "publication_date": "2024-09-12T00:46:48Z",
    "arxiv_id": "http://arxiv.org/abs/2409.07676v3",
    "download_url": "https://arxiv.org/abs/2409.07676v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]