[
  {
    "title": "Dynamics and Thermodynamics of a model with long-range interactions",
    "abstract": "The dynamics and the thermodynamics of particles/spins interacting via long-range forces display several unusual features with respect to systems with short-range interactions. The Hamiltonian Mean Field (HMF) model, a Hamiltonian system of N classical inertial spins with infinite-range interactions represents a paradigmatic example of this class of systems. The equilibrium properties of the model can be derived analytically in the canonical ensemble: in particular the model shows a second order phase transition from a ferromagnetic to a paramagnetic phase. Strong anomalies are observed in the process of relaxation towards equilibrium for a particular class of out-of-equilibrium initial conditions. In fact the numerical simulations show the presence of quasi-stationary state (QSS), i.e. metastable states which become stable if the thermodynamic limit is taken before the infinite time limit. The QSS differ strongly from\n Boltzmann-Gibbs equilibrium states: they exhibit negative specific heat, vanishing Lyapunov exponents and weak mixing, non-Gaussian velocity distributions and anomalous diffusion, slowly-decaying correlations and aging. Such a scenario provides strong hints for the possible application of Tsallis generalized thermostatistics. The QSS have been recently interpreted as a spin-glass phase of the model. This link indicates another promising line of research, which is not alternative to the previous one.",
    "authors": [
      "Alessandro Pluchino",
      "Vito Latora",
      "Andrea Rapisarda"
    ],
    "publication_date": "2004-10-08T16:52:55Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0410213v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0410213v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of rotating fermions",
    "abstract": "We consider the thermodynamic properties of a rotating gas of fermions. We begin by constructing the thermodynamic potential $Φ$ and its associated current $φ^μ$ within the grand canonical ensemble of a macroscopic rigidly rotating body, where the ensemble parameters are the temperature $T_0$ and chemical potential $μ_0$ on the rotation axis, as well as the rotation angular velocity $Ω_0$. We then consider the problem of local thermodynamics, where the thermodynamic state is defined by the local temperature $T$ and chemical potential $μ$, as well as the local spin potential tensor, $Ω_{μν}$. We find the thermodynamic pressure $P$, given as the sum of the usual classical (non-quantum) pressure and other corrections due to the spin potential and the kinematic state of the fluid. We compute the associated entropy, charge and spin densities, and show they are consistent with the Euler relation.",
    "authors": [
      "Victor E. Ambrus",
      "Aleksandar Gecić"
    ],
    "publication_date": "2025-09-22T11:45:13Z",
    "arxiv_id": "http://arxiv.org/abs/2509.17640v1",
    "download_url": "https://arxiv.org/abs/2509.17640v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of non-local materials: extra fluxes and internal powers",
    "abstract": "The most usual formulation of the Laws of Thermodynamics turns out to be suitable for local or simple materials, while for non-local systems there are two different ways: either modify this usual formulation by introducing suitable extra fluxes or express the Laws of Thermodynamics in terms of internal powers directly, as we propose in this paper. The first choice is subject to the criticism that the vector fluxes must be introduced a posteriori in order to obtain the compatibility with the Laws of Thermodynamics. On the contrary, the formulation in terms of internal powers is more general, because it is a priori defined on the basis of the constitutive equations. Besides it allows to highlight, without ambiguity, the contribution of the internal powers in the variation of the thermodynamic potentials. Finally, in this paper, we consider some examples of non-local materials and derive the proper expressions of their internal powers from the power balance laws.",
    "authors": [
      "Mauro Fabrizio",
      "Barbara Lazzari",
      "Roberta Nibbi"
    ],
    "publication_date": "2011-04-15T09:59:54Z",
    "arxiv_id": "http://arxiv.org/abs/1104.3000v1",
    "download_url": "https://arxiv.org/abs/1104.3000v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum thermodynamics in a single-electron box",
    "abstract": "This chapter provides an overview of the methods and results for quantum thermodynamic experiments with single-electron devices. The experiments with a single-electron box on Jarzynski equality and Crooks relation, two-temperature fluctuation relations, and Maxwell's demon performed over the past few years are reviewed here. We further review the first experimental realization of an autonomous Maxwell's demon using a single-electron box as the demon.",
    "authors": [
      "Jonne V. Koski",
      "Jukka P. Pekola"
    ],
    "publication_date": "2018-05-27T18:03:38Z",
    "arxiv_id": "http://arxiv.org/abs/1805.10667v1",
    "download_url": "https://arxiv.org/abs/1805.10667v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On entropy in eulerian thermodynamics",
    "abstract": "To the student of thermodynamics the most difficult subject is entropy. In this paper we examine the actual, practical application of entropy to two simple systems, the homogeneous slab with fixed boundary values of the temperature, and an isolated atmosphere in the presence of the static gravitational field. The first gives valuable insight into the nature of entropy that is subsequently applied to the second system.\n  It is a basic tenet of thermodynamics that the equilibrium of an extended, homogeneous and isolated system is characterized by a uniform temperature distribution and it is a strongly held belief that this remains true in the presence of gravity. We find that this is consistent with the equations of extended thermodynamics but that entropy enters in an essential way. The principle of equivalence takes on a new aspect.",
    "authors": [
      "Christian Frønsdal",
      "Abhishek Pathak"
    ],
    "publication_date": "2011-06-12T02:40:05Z",
    "arxiv_id": "http://arxiv.org/abs/1106.2273v1",
    "download_url": "https://arxiv.org/abs/1106.2273v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and the Evolution of Stochastic Populations",
    "abstract": "The appeal of thermodynamics to problems outside physics is undeniable, as is the growing recognition of its apparent universality, yet in the absence of a rigorous formalism divorced from the peculiarities of molecular systems all attempts to generalize thermodynamics remain qualitative and heuristic at best. In this paper we formulate a probabilistic theory of thermodynamics and and set the basis for its application to generic stochastic populations.",
    "authors": [
      "Themis Matsoukas"
    ],
    "publication_date": "2020-07-02T20:02:14Z",
    "arxiv_id": "http://arxiv.org/abs/2007.01362v1",
    "download_url": "https://arxiv.org/abs/2007.01362v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information thermodynamics: from physics to neuroscience",
    "abstract": "This paper provides a perspective on applying the concepts of information thermodynamics, developed recently in non-equilibrium statistical physics, to problems in theoretical neuroscience. Historically, information and energy in neuroscience have been treated separately, in contrast to physics approaches, where the relationship of entropy production with heat is a central idea. It is argued here that also in neural systems information and energy can be considered within the same theoretical framework. Starting from basic ideas of thermodynamics and information theory on a classic Brownian particle, it is shown how noisy neural networks can infer its probabilistic motion. The decoding of the particle motion by neurons is performed with some accuracy and it has some energy cost, and both can be determined using information thermodynamics. In a similar fashion, we also discuss how neural networks in the brain can learn the particle velocity, and maintain that information in the weights of plastic synapses from a physical point of view. Generally, it is shown how the framework of stochastic and information thermodynamics can be used practically to study neural inference, learning, and information storing.",
    "authors": [
      "Jan Karbowski"
    ],
    "publication_date": "2024-09-26T07:28:13Z",
    "arxiv_id": "http://arxiv.org/abs/2409.17599v1",
    "download_url": "https://arxiv.org/abs/2409.17599v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Thermodynamics: An introduction to the thermodynamics of quantum information",
    "abstract": "This book provides an introduction to the emerging field of quantum thermodynamics, with particular focus on its relation to quantum information and its implications for quantum computers and next generation quantum technologies. The text, aimed at graduate level physics students with a working knowledge of quantum mechanics and statistical physics, provides a brief overview of the development of classical thermodynamics and its quantum formulation in Chapter 1. Chapter 2 then explores typical thermodynamic settings, such as cycles and work extraction protocols, when the working material is genuinely quantum. Finally, Chapter 3 explores the thermodynamics of quantum information processing and introduces the reader to some more state-of-the-art topics in this exciting and rapidly developing research field.",
    "authors": [
      "Sebastian Deffner",
      "Steve Campbell"
    ],
    "publication_date": "2019-07-02T19:33:01Z",
    "arxiv_id": "http://arxiv.org/abs/1907.01596v1",
    "download_url": "https://arxiv.org/abs/1907.01596v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic stability criterion and fluctuation theory in nonextensive thermodynamics",
    "abstract": "We have constructed a nonextensive thermodynamic formalism consisting of two sets of parallel Legendre transformation structures in previous papers. One is the physical set and the other is the Lagrange set. In this paper we study the thermodynamic stability criterion with a dual interpretation of the thermodynamic relations and quantities. By recourse to the assumption that volume in nonextenstive system is nonadditive, we conclude that it is the physical pressure that is responsible for the mechanical balance between any two parts in a given nonextensive system. It is verified that in the physical set of transformation structures, the stability criterion can be expressed in terms of heat capacity and isothermal compressibility. We also discuss the fluctuation theory in nonextensive thermodynamics.",
    "authors": [
      "Zheng Yahui",
      "Du Jiulin",
      "Liang Faku"
    ],
    "publication_date": "2018-04-23T14:36:56Z",
    "arxiv_id": "http://arxiv.org/abs/1804.08474v1",
    "download_url": "https://arxiv.org/abs/1804.08474v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Thermodynamics, Reversible Dynamical Systems and Information Theory",
    "abstract": "Stochastic Thermodynamics (ST) extends the notions of classical thermodynamics to trajectories taken from a nonequilibrium ensemble. This extension yields a simple approach to fluctuation relations in small systems. Multiple time- and length scales play an important role for measurements but also for the foundations of nonequilibrium statistical mechanics. Here, under the assumptions of local equilibrium we derive the trajectory functionals of ST in the context of reversible deterministic thermostats. Further, the connection to previous work is made.",
    "authors": [
      "Bernhard Altaner"
    ],
    "publication_date": "2012-10-18T09:49:24Z",
    "arxiv_id": "http://arxiv.org/abs/1210.5071v1",
    "download_url": "https://arxiv.org/abs/1210.5071v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-convex dissipation potentials in multiscale non-equilibrium thermodynamics",
    "abstract": "Reformulating constitutive relation in terms of gradient dynamics (being derivative of a dissipation potential) brings additional information on stability, metastability and instability of the dynamics with respect to perturbations of the constitutive relation, called CR-stability. CR-instability is connected to the loss of convexity of the dissipation potential, which makes the Legendre-conjugate dissipation potential multivalued and causes dissipative phase transitions, that are not induced by non-convexity of free energy, but by non-convexity of the dissipation potential. CR-stability of the constitutive relation with respect to perturbations is then manifested by constructing evolution equations for the perturbations in a thermodynamically sound way. As a result, interesting experimental observations of behavior of complex fluids under shear flow and supercritical boiling curve can be explained.",
    "authors": [
      "Adam Janečka",
      "Michal Pavelka"
    ],
    "publication_date": "2017-01-21T22:43:41Z",
    "arxiv_id": "http://arxiv.org/abs/1701.06094v4",
    "download_url": "https://arxiv.org/abs/1701.06094v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Statistical mechanics and thermodynamics of complex systems",
    "abstract": "An unified thermodynamical framework based in the use of a generalized Massieu-Planck thermodynamic potential is proposed and a new formulation of Boltzmann-Gibbs Statistical Mechanics is established. Under this philosophy a generalization of (classical) Boltzmann-Gibbs thermostatistics is suggested and connected to recent nonextensive statistics formulations. This is accomplished by defining a convenient squeezing function which restricts among the collections of Boltzmann-Gibbs configurations of the complete equilibrium closure. The formalism embodies Beck-Cohen superstatistics and a direct connection with the nonlinear kinetic theory due to Kaniadakis is provided, being the treatment presented fully consistent with it. As an example Tsallis nonextensive statistics is completely rebuilt into our formulation adding new insights (zeroth law of thermodynamics, non ad hoc definition of the mean value of a physical quantity,...). We relate all the formal development to physical and measurable quantities and suggest a way to establish the relevant statistics of any system based on determinations of temperature.",
    "authors": [
      "V. Garcia-Morales",
      "J. Pellicer"
    ],
    "publication_date": "2003-04-10T13:12:05Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0304013v4",
    "download_url": "https://arxiv.org/abs/math-ph/0304013v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics: Extending and Reconstructing of Classical Theoretical Framework",
    "abstract": "The deep problems caused from the limitations of theoretical framework itself can only be clarified by extending and reconstructing of the theoretical framework, we extend classical theoretical framework of thermodynamics, break through the limitations of traditional theory, discuss the unsolvable problems in classical theoretical framework. We introduce a new state function to describe the energy of thermal motion, which is the last undefined form of the internal energy, we find that there are three independent forms of the internal energy of thermodynamic system, it implies a broader theoretical framework, we can directly describe the states and the changes of the different forms of the internal energy. We extend the equations of the first law, present the concept of the conversion potential, distinguish the energy transfer and the energy conversion processes by different functions, we confirm the explicit function of the concept of the entropy, and the origin of the configurational entropy, we discuss in detail on the total differential expression of the entropy production and the second law, the three sources of irreversibility, the compensation relationships of the heat conversion, and the causality principle of the second law, an interesting conclusion shows that the second law itself has already contained the internal mechanism of evolution.",
    "authors": [
      "Tang Suye"
    ],
    "publication_date": "2012-01-20T13:11:28Z",
    "arxiv_id": "http://arxiv.org/abs/1201.4284v9",
    "download_url": "https://arxiv.org/abs/1201.4284v9",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From the thermodynamics of irreversible processes to dissipative structures and active matter",
    "abstract": "A historical perspective is presented on thermodynamics from the pioneering contributions by Carnot and Clausius to recent advances on active matter. Non-equilibrium thermodynamics develops from the identification of the irreversible processes contributing to entropy production in various types of materials and systems. These processes include friction, viscosity, heat and electric conductions, diffusion, reactions, and more. In 1954, Glansdorff and Prigogine formulated a general evolution criterion, which led to the theory of dissipative structures like chemical clocks, reaction-diffusion patterns, and convection patterns. Non-equilibrium statistical mechanics provides the microscopic foundations for the thermodynamics of irreversible processes.",
    "authors": [
      "Pierre Gaspard"
    ],
    "publication_date": "2025-12-16T11:24:52Z",
    "arxiv_id": "http://arxiv.org/abs/2512.16944v1",
    "download_url": "https://arxiv.org/abs/2512.16944v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Studying Thermodynamics of Metastable States",
    "abstract": "Simple classical thermodynamic approach to the general description of metastable states is presented. It makes possible to calculate the explicit dependence of the Gibbs free energy on temperature, to calculate the heat capacity, the thermodynamic barrier, dividing metastable and more stable states, and the thermal expansion coefficient. Thermodynamic stability under mechanical loading is considered. The influence of the heating (cooling) rate on the measured dynamic heat capacity is investigated. A phase shift of the temperature oscillations of an ac heated sample is shown to be determined by the relaxation time of the relaxation of the metastable nonequilibrium state back to the metastable equilibrium one. This dependence allows one to calculate the relaxation time. A general description of the metastable phase equilibrium is proposed. Metastable states in AB3 alloys are considered. Reasons for the change from the diffusional mechanism of the supercritical nucleus growth to the martensitic one as the heating rate increases are discussed. The Ostwald stage rule is derived.",
    "authors": [
      "Yuri Kornyushin"
    ],
    "publication_date": "2007-02-04T14:46:06Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0702076v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0702076v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Species Entropy and Thermodynamics",
    "abstract": "We analyse particle species and the species scale in quantum gravity from a thermodynamic perspective. In close analogy to black hole thermodynamics, we propose that particle species own an entropy and a temperature, which is determined by the species scale. This is identical to the Bekenstein-Hawking entropy of a corresponding minimal black hole and agrees with the number of species in a given tower of states. Through the species entropy, we find that certain entropy bounds are connected to recent swampland constraints. Moreover, the concept of species entropy and temperature allow us to formulate the laws of species thermodynamics, which are argued to govern the variations of moduli in string theory. They can be viewed as general rules that imply certain swampland conjectures, and vice versa.",
    "authors": [
      "Niccolò Cribiori",
      "Dieter Lust",
      "Carmine Montella"
    ],
    "publication_date": "2023-05-17T18:00:16Z",
    "arxiv_id": "http://arxiv.org/abs/2305.10489v3",
    "download_url": "https://arxiv.org/abs/2305.10489v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entropy of a Quantum Oscillator coupled to a Heat Bath and implications for Quantum Thermodynamics",
    "abstract": "The free energy of a quantum oscillator in an arbitrary heat bath at a temperature T is given by a \"remarkable formula\" which involves only a single integral. This leads to a corresponding simple result for the entropy. The low temperature limit is examined in detail and we obtain explicit results both for the case of an Ohmic heat bath and a radiation heat bath. More general heat bath models are also examined. This enables us to determine the entropy at zero temperature in order to check the third law of thermodynamics in the quantum regime",
    "authors": [
      "G. W. Ford",
      "R. F. O'Connell"
    ],
    "publication_date": "2006-01-15T17:09:24Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0601096v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0601096v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics from information",
    "abstract": "Thermodynamics and information have intricate inter-relations. The justification of the fact that information is physical, is done by inter-linking information and thermodynamics - through Landauer's principle. This modern approach towards information recently has improved our understanding of thermodynamics, both in classical and quantum domains. Here we show thermodynamics as a consequence of information conservation. Our approach can be applied to most general situations, where systems and thermal-baths could be quantum, of arbitrary sizes and even could posses inter-system correlations. The approach does not rely on an a priori predetermined temperature associated to a thermal bath, which is not meaningful for finite-size cases. Hence, the thermal-baths and systems are not different, rather both are treated on an equal footing. This results in a \"temperature\"-independent formulation of thermodynamics. We exploit the fact that, for a fix amount of coarse-grained information, measured by the von Neumann entropy, any system can be transformed to a state that possesses minimal energy, without changing its entropy. This state is known as a completely passive state, which assumes Boltzmann-Gibb's canonical form with an intrinsic temperature. This leads us to introduce the notions of bound and free energy, which we further use to quantify heat and work respectively. With this guiding principle of information conservation, we develop universal notions of equilibrium, heat and work, Landauer's principle and also universal fundamental laws of thermodynamics. We show that the maximum efficiency of a quantum engine, equipped with a finite baths, is in general lower than that of an ideal Carnot's engine. We also introduce a resource theoretic framework for intrinsic-temperature based thermodynamics, within which we address the problem of work extraction and state transformations.",
    "authors": [
      "Manabendra Nath Bera",
      "Andreas Winter",
      "Maciej Lewenstein"
    ],
    "publication_date": "2018-05-25T09:08:55Z",
    "arxiv_id": "http://arxiv.org/abs/1805.10282v1",
    "download_url": "https://arxiv.org/abs/1805.10282v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Teaching the third law of thermodynamics",
    "abstract": "This work gives a brief summary of major formulations of the third law of thermodynamics and their implications, including the impossibility of perpetual motion of the third kind. The last sections of this work review more advanced applications of the third law to systems with negative temperatures and negative heat capacities. The relevance of the third law to protecting the arrow of time in general relativity is also discussed. Additional information, which may useful in analysis of the third law, is given in the Appendices.\n  This short review is written to assist lecturers in selecting a strategy for teaching the third law of thermodynamics to engineering and science students. The paper provides a good summary of the various issues associated with the third law, which are typically scattered over numerous research publications and not discussed in standard textbooks.",
    "authors": [
      "A. Y. Klimenko"
    ],
    "publication_date": "2012-08-21T04:39:04Z",
    "arxiv_id": "http://arxiv.org/abs/1208.4189v1",
    "download_url": "https://arxiv.org/abs/1208.4189v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A thermodynamic characterization of future singularities?",
    "abstract": "In this Letter we consider three future singularities in different Friedmann-Lemaître-Robertson-Walker scenarios and show that the universe departs more and more from thermodynamic equilibrium as the corresponding singularity is approached. Though not proven in general, this feature may characterize future singularities of homogeneous and isotropic cosmologies.",
    "authors": [
      "Diego Pavon",
      "Winfried Zimdahl"
    ],
    "publication_date": "2012-01-30T09:48:34Z",
    "arxiv_id": "http://arxiv.org/abs/1201.6144v1",
    "download_url": "https://arxiv.org/abs/1201.6144v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Foundations of Stochastic Thermodynamics",
    "abstract": "Small systems in a thermodynamic medium --- like colloids in a suspension or the molecular machinery in living cells --- are strongly affected by the thermal fluctuations of their environment. Physicists model such systems by means of stochastic processes. Stochastic Thermodynamics (ST) defines entropy changes and other thermodynamic notions for individual realizations of such processes. It applies to situations far from equilibrium and provides a unified approach to stochastic fluctuation relations. Its predictions have been studied and verified experimentally.\n  This thesis addresses the theoretical foundations of ST. Its focus is on the following two aspects: (i) The stochastic nature of mesoscopic observations has its origin in the molecular chaos on the microscopic level. Can one derive ST from an underlying reversible deterministic dynamics? Can we interpret ST's notions of entropy and entropy changes in a well-defined information-theoretical framework? (ii) Markovian jump processes on finite state spaces are common models for bio-chemical pathways. How does one quantify and calculate fluctuations of physical observables in such models? What role does the topology of the network of states play? How can we apply our abstract results to the design of models for molecular motors?\n  The thesis concludes with an outlook on dissipation as information written to unobserved degrees of freedom --- a perspective that yields a consistency criterion between dynamical models formulated on various levels of description.",
    "authors": [
      "Bernhard Altaner"
    ],
    "publication_date": "2014-10-15T09:21:09Z",
    "arxiv_id": "http://arxiv.org/abs/1410.3983v1",
    "download_url": "https://arxiv.org/abs/1410.3983v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reasoning and Logical-Proofs of the Fundamental Laws: 'No Hope' for the Challengers of the Second Law of Thermodynamics",
    "abstract": "This comprehensive treatise is written for the special occasion of the author's 70th birthday. It presents his lifelong endeavors and reflections with original reasoning and re-interpretations of the most critical and misleading issues in thermodynamics; since now, we have the advantage to look at the historical developments more comprehensively and objectively than the pioneers. Starting from Carnot (grandfather of thermodynamics-to-be) to Kelvin and Clausius (fathers of thermodynamics), and other followers, the most relevant issues are critically examined and put in historical and contemporary perspective. From original reasoning of energy forcing and displacement to logical proofs of the fundamental laws, to ubiquity of thermal motion and heat, and indestructibility of entropy, including the new concept of \"thermal roughness\" and the inevitability of dissipative irreversibility, to \"dissecting Carnot true reversible-equivalency\" and critical concept of \"Carnot-Clausius heat-work equivalency (CCHWE)\" regarding the interchangeability of heat and work, and to demonstrating \"no hope\" for the \"challengers\" of the Second Law of thermodynamics, among others, are offered. It is hoped that the novel contributions presented will enhance comprehension and resolve some of the fundamental issues, as well as promote collaboration and future progress.",
    "authors": [
      "Milivoje M. Kostic"
    ],
    "publication_date": "2023-05-04T19:49:53Z",
    "arxiv_id": "http://arxiv.org/abs/2305.14354v1",
    "download_url": "https://arxiv.org/abs/2305.14354v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Thermodynamics and Statistical Entropy of Bardeen Black Hole",
    "abstract": "We discuss the first law of thermodynamics of Bardeen black hole. The presence of magnetic monopole charge modifies the energy and we define the temperature of the system accordingly. We introduce a lower cut-off to the space time by introducing a spherical surface, which can be identified with the event horizon. The corresponding temperature is identified with Hawking temperature. The entropy is assumed to obey the area law and we confirm this by calculating the statistical entropy by using brick wall model.",
    "authors": [
      "Dharm Veer Singh",
      "Sanjay Siwach"
    ],
    "publication_date": "2019-09-25T14:38:08Z",
    "arxiv_id": "http://arxiv.org/abs/1909.11529v2",
    "download_url": "https://arxiv.org/abs/1909.11529v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Investigating the thermodynamics of small biosystems with optical tweezers",
    "abstract": "We present two examples of how single-molecule experimental techniques applied to biological systems can give insight into problems within the scope of equilibrium and nonequilibrium mesoscopic thermodynamics. The first example is the mapping of the free energy landscape of a macromolecule, the second the experimental verification of Crooks' fluctuation theorem. In both cases the experimental setup comprises optical tweezers and DNA molecules.",
    "authors": [
      "Alessandro Mossa",
      "Josep Maria Huguet",
      "Felix Ritort"
    ],
    "publication_date": "2009-04-21T09:16:31Z",
    "arxiv_id": "http://arxiv.org/abs/0904.3197v1",
    "download_url": "https://arxiv.org/abs/0904.3197v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of the 3-dimensional Einstein-Maxwell system",
    "abstract": "Recently, I studied the thermodynamical properties of the Einstein-Maxwell system with a box boundary in 4-dimensions [1](JHEP 04 (2024) 083). In this paper, I investigate those in 3-dimensions using the zero-loop saddle-point approximation and focusing only on a simple topology sector as usual. Similar to the 4-dimensional case, the system is thermodynamically well-behaved when $Λ<0$ (due to the contribution of the \"bag of gold\" saddles). However, when $Λ=0$, a crucial difference to the 4-dimensional case appears, i.e. the 3-dimensional system turns out to be thermodynamically unstable, while the 4-dimensional one is thermodynamically stable. This may offer two options for how we think about the thermodynamics of 3-dimensional gravity with $Λ=0$. One is that the zero-loop approximation or restricting the simple topology sector is not sufficient for 3-dimensions with $Λ=0$. The other is that 3-dimensional gravity is really thermodynamically unstable when $Λ=0$.",
    "authors": [
      "Shoichiro Miyashita"
    ],
    "publication_date": "2024-03-03T08:14:51Z",
    "arxiv_id": "http://arxiv.org/abs/2403.01436v3",
    "download_url": "https://arxiv.org/abs/2403.01436v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of the Near-Extremal NS5-brane",
    "abstract": "We consider the thermodynamics of the near-extremal NS5-brane in type IIA string theory. The central tool we use is to map phases of six-dimensional Kaluza-Klein black holes to phases of near-extremal M5-branes with a transverse circle in eleven-dimensional supergravity. By S-duality these phases correspond to phases of the near-extremal type IIA NS5-brane. One of our main results is that in the canonical ensemble the usual near-extremal NS5-brane background, dual to a uniformly smeared near-extremal M5-brane, is subdominant to a new background of near-extremal M5-branes localized on the transverse circle. This new stable phase has a limiting temperature, which lies above the Hagedorn temperature of the usual NS5-brane phase. We discuss the limiting temperature and compare the different behavior of the NS5-brane in the canonical and microcanonical ensembles. We also briefly comment on the thermodynamics of near-extremal Dp-branes on a transverse circle.",
    "authors": [
      "T. Harmark",
      "N. A. Obers"
    ],
    "publication_date": "2005-10-12T13:30:05Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/0510098v2",
    "download_url": "https://arxiv.org/abs/hep-th/0510098v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic stability conditions for nonadditive composable entropies",
    "abstract": "The thermodynamic stability conditions (TSC) of nonadditive and composable entropies are discussed. Generally the concavity of a nonadditive entropy with respect to internal energy is not necessarily equivalent to the corresponding TSC. It is shown that both the TSC of Tsallis' entropy and that of the $κ$-generalized Boltzmann entropy are equivalent to the positivity of the standard heat capacity.",
    "authors": [
      "Tatsuaki Wada"
    ],
    "publication_date": "2003-07-17T12:28:24Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0307419v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0307419v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic principles and implementations of quantum machines",
    "abstract": "The efficiency of cyclic heat engines is limited by the Carnot bound. This bound follows from the second law of thermodynamics and is attained by engines that operate between two thermal baths under the reversibility condition whereby the total entropy does not increase. By contrast, the efficiency of engines powered by quantum non-thermal baths has been claimed to surpass the thermodynamic Carnot bound. The key to understanding the performance of such engines is a proper division of the energy supplied by the bath to the system into heat and work, depending on the associated change in the system entropy and ergotropy. Due to their hybrid character, the efficiency bound for quantum engines powered by a non-thermal bath does not solely follow from the laws of thermodynamics. Hence, the thermodynamic Carnot bound is inapplicable to such hybrid engines. Yet, they do not violate the principles of thermodynamics.\n  An alternative means of boosting machine performance is the concept of heat-to-work conversion catalysis by quantum non-linear (squeezed) pumping of the piston mode. This enhancement is due to the increased ability of the squeezed piston to store ergotropy. Since the catalyzed machine is fueled by thermal baths, it adheres to the Carnot bound.\n  We conclude by arguing that it is not quantumness per se that improves the machine performance, but rather the properties of the baths, the working fluid and the piston that boost the ergotropy and minimize the wasted heat in both the input and the output.",
    "authors": [
      "Arnab Ghosh",
      "Wolfgang Niedenzu",
      "Victor Mukherjee",
      "Gershon Kurizki"
    ],
    "publication_date": "2018-03-27T12:57:15Z",
    "arxiv_id": "http://arxiv.org/abs/1803.10053v3",
    "download_url": "https://arxiv.org/abs/1803.10053v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classical and thermodynamical aspects of black holes with conformally coupled scalar field hair",
    "abstract": "We discuss the existence, stability and classical thermodynamics of four-dimensional, spherically symmetric black hole solutions of the Einstein equations with a conformally coupled scalar field. We review the solutions existing in the literature with zero, positive and negative cosmological constant. We also outline new results on the thermodynamics of these black holes when the cosmological constant is non-zero.",
    "authors": [
      "Elizabeth Winstanley"
    ],
    "publication_date": "2004-08-16T14:06:10Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0408046v1",
    "download_url": "https://arxiv.org/abs/gr-qc/0408046v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum thermodynamics of nanoscale thermoelectrics and electronic devices",
    "abstract": "This mini-review is intended as a short introduction to electron flow in nanostructures. Its aim is to provide a brief overview of this topic for people who are interested in the thermodynamics of quantum systems but know little about nanostructures. We particularly emphasize devices that work in the steady-state, such as simple thermoelectrics, but also mention cyclically driven heat engines. We do not aim to be either complete or rigorous, but use a few pages to outline some of the main ideas in the topic.",
    "authors": [
      "Robert S. Whitney",
      "Rafael Sánchez",
      "Janine Splettstoesser"
    ],
    "publication_date": "2018-05-11T09:50:37Z",
    "arxiv_id": "http://arxiv.org/abs/1805.04297v3",
    "download_url": "https://arxiv.org/abs/1805.04297v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics on Noncommutative Geometry in Coherent State Formalism",
    "abstract": "The thermodynamics of ideal gas on the noncommutative geometry in the coherent state formalism is investigated. We first evaluate the statistical interparticle potential and see that there are residual \"attraction (repulsion) potential\" between boson (fermion) in the high temperature limit. The characters could be traced to the fact that, the particle with mass $m$ in noncommutative thermal geometry with noncommutativity $θ$ and temperature $T$ will correspond to that in the commutative background with temperature $T(1+kTmθ)^{-1}$. Such a correspondence implies that the ideal gas energy will asymptotically approach to a finite limiting value as that on commutative geometry at $T_θ= (kmθ)^{-1}$. We also investigate the squeezed coherent states and see that they could have arbitrary mean energy. The thermal properties of those systems are calculated and compared to each other. We find that the heat capacity of the squeezed coherent states of boson and fermion on the noncommutative geometry have different values, contrast to that on the commutative geometry.",
    "authors": [
      "Wung-Hong Huang",
      "Kuo-Wei Huang"
    ],
    "publication_date": "2008-08-04T08:56:04Z",
    "arxiv_id": "http://arxiv.org/abs/0808.0324v6",
    "download_url": "https://arxiv.org/abs/0808.0324v6",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Single Particle Thermodynamics with Levitated Nanoparticles",
    "abstract": "This chapter is intended as a pedagogical introduction to the dynamics of optically levitated nanoparticles with a focus on the study of single particle thermodynamics. Much of the work studying thermodynamics with nano- and micro-particles has taken place in liquid, and this chapter will avoid reviewing this impressive body of work, focussing instead on studies of thermodynamics with nanoparticles levitated in a gas. For a recent literature review we refer the reader to Gieseler & Millen Entropy 20, 326 (2018). The authors will discuss extensions into the quantum regime where relevant throughout the chapter.",
    "authors": [
      "James Millen",
      "Jan Gieseler"
    ],
    "publication_date": "2020-07-15T08:33:49Z",
    "arxiv_id": "http://arxiv.org/abs/2007.08632v1",
    "download_url": "https://arxiv.org/abs/2007.08632v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic properties of gaseous plasmas in zero-temperature limit",
    "abstract": "Limiting structure of thermodynamic functions of gaseous plasmas is under consideration in the limit of low temperature and density. The remarkable tendency, that was claimed previously [High Temp. 19, 799 (1981)], is carried to extreme. In the limit discussed, when temperature and density tend to zero at constant value of electron chemical potential, both equations of state (thermal and caloric) obtain almost identical stepped structure (\"ionization stairs\") when their special forms being exposed i.e. PV/RT for thermal EOS and (U - 3/2PV) for caloric EOS. At the same time all thermodynamic differential parameters (heat capacity, compressibility, etc.) obtain their remarkable delta-like structures (\"thermodynamic spectrum\"). This limiting structure appears within a fixed (negative) range of electron chemical potential (\"intrinsic energy scale\") that is bounded below by value of major ionization potential and above by the value connected with sublimation energy of substance. Binding energies of all possible complexes (atomic, molecular and ionic) in its ground state are the only quantities that manifest itself in meaningful details of this limiting picture as location and value of every step. The limiting stepped structure of gaseous zero-Kelvin isotherm is generic prototype of well-known \"shell oscillations\" in EOS of gaseous plasmas at low, but finite temperatures and non-idealities. At the same time this limiting form of plasma thermodynamics could be used as a natural basis for rigorous deduction of well-known quasi-chemical approach (\"chemical picture\") in frames of asymptotic expansion (on temperature, but not density) around this reference system.",
    "authors": [
      "Igor Iosilevskiy"
    ],
    "publication_date": "2009-02-23T16:01:27Z",
    "arxiv_id": "http://arxiv.org/abs/0902.3708v1",
    "download_url": "https://arxiv.org/abs/0902.3708v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamically extended symplectic numerical simulation of viscoelastic, thermal expansion and heat conduction phenomena in solids",
    "abstract": "Symplectic numerical schemes for reversible dynamical systems predict the solution reliably over large times as well, and are a good starting point for extension to schemes for simulating irreversible situations like viscoelastic wave propagation and heat conduction coupled via thermal expansion occuring in rocks, plastics, biological samples etc. Dissipation error (artificial nonpreservation of energies and amplitudes) of the numerical solution should be as small as possible since it should not be confused with the real dissipation occuring in the irreversible system. In addition, the other well-known numerical artefact, dispersion error (artificial oscillations emerging at sharp changes), should also be minimal to avoid confusion with the true wavy behaviour. The continuum thermodynamical aspects (respect for balances with fluxes, systematic constitutive relationships between intensive quantities and fluxes, the second law of thermodynamics with positive definite entropy production, and the spacetime-based kinematic viewpoint) prove valuable for obtaining such extended schemes and for monitoring the solutions. Generalizing earlier works in this direction, here, we establish and investigate such a numerical scheme for one-dimensional viscoelastic wave propagation in the presence of heat conduction coupled via thermal expansion, demonstrating long-term reliability and the applicability of thermodynamics-based quantities in supervising the quality of the solution.",
    "authors": [
      "Donát M. Takács",
      "Áron Pozsár",
      "Tamás Fülöp"
    ],
    "publication_date": "2022-11-22T09:43:54Z",
    "arxiv_id": "http://arxiv.org/abs/2211.12120v2",
    "download_url": "https://arxiv.org/abs/2211.12120v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics Formulation of Economics",
    "abstract": "We consider demand-side economy. Using Caratheodory's approach, we define empirical existence of equation of state (EoS) and coordinates. We found new insights of thermodynamics EoS, the {\\it effect structure}. Rules are proposed as criteria in promoting and classifying an empirical law to EoS status. Four laws of thermodynamics are given for economics. We proposed a method to model the EoS with econometrics. Consumer surplus in economics can not be considered as utility. Concepts such as total wealth, generalized utility and generalized surplus are introduced. EoS provides solid foundation in statistical mechanics modelling of economics and finance.",
    "authors": [
      "Burin Gumjudpai"
    ],
    "publication_date": "2020-12-02T20:14:09Z",
    "arxiv_id": "http://arxiv.org/abs/2012.01505v3",
    "download_url": "https://arxiv.org/abs/2012.01505v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and decay of de Sitter vacuum",
    "abstract": "We discuss the consequences of unique symmetry of de Sitter spacetime, which is invariant under the modified translations, ${\\bf r}\\rightarrow {\\bf r} -e^{Ht}{\\bf a}$, where $H$ is the Hubble parameter. Due to this symmetry, all the comoving observers at any point of the de Sitter space perceive the de Sitter environment as the thermal bath with temperature $T=H/π$, which is twice larger than the Gibbons-Hawking temperature of the cosmological horizon. This leads to the heat exchange between gravity and matter, and to instability of de Sitter state towards the creation of matter, its further heating, and finally to the decay of the de Sitter state. The temperature $T=H/π$ determines different processes in the de Sitter environment, which are not possible in Minkowski vacuum, such as the process of ionization of an atom. This temperature also determines the local entropy of the de Sitter vacuum state, and this allows us to calculate the total entropy inside the cosmological horizon. The result reproduces the Gibbons-Hawking area law, which is related to the cosmological horizon, $S_{\\rm hor}=4πKA$, where $K=1/(16πG)$. This supports the holographic properties of the cosmological event horizon. We extend the consideration of the local thermodynamics of the de Sitter state using the $f({\\cal R})$ gravity. In this thermodynamics, the Ricci scalar curvature ${\\cal R}$ and the effective gravitational coupling $K$ are thermodynamically conjugate variables. The holographic connection between the bulk entropy of the Hubble volume and the surface entropy of the cosmological horizon remains the same. Such connection takes place only in the $3+1$ spacetime, where there is the special symmetry due to which the variables $K$ and ${\\cal R}$ have the same dimensionality. We also consider the lessons from the de Sitter symmetry for the thermodynamics of black and white holes.",
    "authors": [
      "G. E. Volovik"
    ],
    "publication_date": "2023-12-04T19:13:35Z",
    "arxiv_id": "http://arxiv.org/abs/2312.02292v16",
    "download_url": "https://arxiv.org/abs/2312.02292v16",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Roadmap on Quantum Thermodynamics",
    "abstract": "The last two decades has seen quantum thermodynamics become a well established field of research in its own right. In that time, it has demonstrated a remarkably broad applicability, ranging from providing foundational advances in the understanding of how thermodynamic principles apply at the nano-scale and in the presence of quantum coherence, to providing a guiding framework for the development of efficient quantum devices. Exquisite levels of control have allowed state-of-the-art experimental platforms to explore energetics and thermodynamics at the smallest scales which has in turn helped to drive theoretical advances. This Roadmap provides an overview of the recent developments across many of the field's sub-disciplines, assessing the key challenges and future prospects, providing a guide for its near term progress.",
    "authors": [
      "Steve Campbell",
      "Irene D'Amico",
      "Mario A. Ciampini",
      "Janet Anders",
      "Natalia Ares",
      "Simone Artini",
      "Alexia Auffèves",
      "Lindsay Bassman Oftelie",
      "Laetitia P. Bettmann",
      "Marcus V. S. Bonança",
      "Thomas Busch",
      "Michele Campisi",
      "Moallison F. Cavalcante",
      "Luis A. Correa",
      "Eloisa Cuestas",
      "Ceren B. Dag",
      "Salambô Dago",
      "Sebastian Deffner",
      "Adolfo Del Campo",
      "Andreas Deutschmann-Olek",
      "Sandro Donadi",
      "Emery Doucet",
      "Cyril Elouard",
      "Klaus Ensslin",
      "Paul Erker",
      "Nicole Fabbri",
      "Federico Fedele",
      "Guilherme Fiusa",
      "Thomás Fogarty",
      "Joshua Folk",
      "Giacomo Guarnieri",
      "Abhaya S. Hegde",
      "Santiago Hernández-Gómez",
      "Chang-Kang Hu",
      "Fernando Iemini",
      "Bayan Karimi",
      "Nikolai Kiesel",
      "Gabriel T. Landi",
      "Aleksander Lasek",
      "Sergei Lemziakov",
      "Gabriele Lo Monaco",
      "Eric Lutz",
      "Dmitrii Lvov",
      "Olivier Maillet",
      "Mohammad Mehboudi",
      "Taysa M. Mendonça",
      "Harry J. D. Miller",
      "Andrew K. Mitchell",
      "Mark T. Mitchison",
      "Victor Mukherjee",
      "Mauro Paternostro",
      "Jukka Pekola",
      "Martí Perarnau-Llobet",
      "Ulrich Poschinger",
      "Alberto Rolandi",
      "Dario Rosa",
      "Rafael Sánchez",
      "Alan C. Santos",
      "Roberto S. Sarthour",
      "Eran Sela",
      "Andrea Solfanelli",
      "Alexandre M. Souza",
      "Janine Splettstoesser",
      "Dian Tan",
      "Ludovico Tesser",
      "Tan Van Vu",
      "Artur Widera",
      "Nicole Yunger Halpern",
      "Krissia Zawadzki"
    ],
    "publication_date": "2025-04-28T18:00:06Z",
    "arxiv_id": "http://arxiv.org/abs/2504.20145v1",
    "download_url": "https://arxiv.org/abs/2504.20145v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-equilibrium theories of rarefied gases: internal variables and extended thermodynamics",
    "abstract": "Limits of classical constitutive laws such as Fourier and Navier-Stokes equations are discovered since decades. However, the proper extensions -- generalizations of these are not unique. They differ in the underlying physical principles and in modeling capabilities. In this paper, two different theories are discussed and compared to each other, namely the kinetic theory-based Rational Extended Thermodynamics (RET) and non-equilibrium thermodynamics with internal variables (NET-IV).\n  First, the paper starts with the case of rigid heat conductors summarizing the result achieved so far. Then a typical example of compressible bodies is shown by presenting the first generalization for rarefied gases, called Meixner's theory. It is further extended using generalized entropy current in the framework of NET-IV. It is shown how its structure is related to RET and how the compatibility between them can be acquired.",
    "authors": [
      "Róbert Kovács",
      "Damir Madjarević",
      "Srboljub Simić",
      "Péter Ván"
    ],
    "publication_date": "2018-12-26T16:09:34Z",
    "arxiv_id": "http://arxiv.org/abs/1812.10355v2",
    "download_url": "https://arxiv.org/abs/1812.10355v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The second laws of quantum thermodynamics",
    "abstract": "The second law of thermodynamics tells us which state transformations are so statistically unlikely that they are effectively forbidden. Its original formulation, due to Clausius, states that \"Heat can never pass from a colder to a warmer body without some other change, connected therewith, occurring at the same time\". The second law applies to systems composed of many particles interacting; however, we are seeing that one can make sense of thermodynamics in the regime where we only have a small number of particles interacting with a heat bath. Is there a second law of thermodynamics in this regime? Here, we find that for processes which are cyclic or very close to cyclic, the second law for microscopic systems takes on a very different form than it does at the macroscopic scale, imposing not just one constraint on what state transformations are possible, but an entire family of constraints. In particular, we find a family of free energies which generalise the traditional one, and show that they can never increase. We further find that there are three regimes which determine which family of second laws govern state transitions, depending on how cyclic the process is. In one regime one can cause an apparent violation of the usual second law, through a process of embezzling work from a large system which remains arbitrarily close to its original state. These second laws are not only relevant for small systems, but also apply to individual macroscopic systems interacting via long-range interactions, which only satisfy the ordinary second law on average. By making precise the definition of thermal operations, the laws of thermodynamics take on a simple form with the first law defining the class of thermal operations, the zeroeth law emerging as a unique condition ensuring the theory is nontrivial, and the remaining laws being a monotonicity property of our generalised free energies.",
    "authors": [
      "Fernando G. S. L. Brandao",
      "Michał Horodecki",
      "Nelly Huei Ying Ng",
      "Jonathan Oppenheim",
      "Stephanie Wehner"
    ],
    "publication_date": "2013-05-22T22:08:11Z",
    "arxiv_id": "http://arxiv.org/abs/1305.5278v4",
    "download_url": "https://arxiv.org/abs/1305.5278v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A thermodynamic motivation for dark energy",
    "abstract": "It is argued that the discovery of cosmic acceleration could have been anticipated on thermodynamic grounds, namely, the generalized second law and the approach to equilibrium at large scale factor. Therefore, the existence of dark energy -or equivalently, some modified gravity theory- should have been expected. In general, cosmological models that satisfy the above criteria show compatibility with observational data.",
    "authors": [
      "Ninfa Radicella",
      "Diego Pavón"
    ],
    "publication_date": "2010-12-02T16:13:25Z",
    "arxiv_id": "http://arxiv.org/abs/1012.0474v3",
    "download_url": "https://arxiv.org/abs/1012.0474v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Point bosons in a one-dimensional box: the ground state, excitations and thermodynamics",
    "abstract": "We determine the ground-state energy and the effective dispersion law for a one-dimensional system of point bosons under zero boundary conditions. The ground-state energy is close to the value for a periodic system. But the dispersion law is essentially different from that for a periodic system, if the coupling is weak (weak interaction or high concentration) or intermediate. We propose also a new method for construction of the thermodynamics for a gas of point bosons. It turns out that the difference in the dispersion laws of systems with periodic and zero boundary conditions does not lead to a difference in the thermodynamic quantities. In addition, under zero boundary conditions, the microscopic sound velocity does not coincide with the macroscopic one. This means that either the method of determination of $k$ in the dispersion law $E(k)$ is unsuitable or the low-energy excitations are not phonons.",
    "authors": [
      "Maksim Tomchenko"
    ],
    "publication_date": "2015-02-10T15:20:35Z",
    "arxiv_id": "http://arxiv.org/abs/1502.02944v3",
    "download_url": "https://arxiv.org/abs/1502.02944v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-extensive Hamiltonian systems follow Boltzmann's principle not Tsallis statistics. -- Phase Transitions, Second Law of Thermodynamics",
    "abstract": "Boltzmann's principle S(E,N,V)=k*ln W(E,N,V) relates the entropy to the geometric area e^{S(E,N,V)} of the manifold of constant energy in the N-body phase space. From the principle all thermodynamics and especially all phenomena of phase transitions and critical phenomena can be deduced. The topology of the curvature matrix C(E,N) (Hessian) of S(E,N) determines regions of pure phases, regions of phase separation, and (multi-)critical points and lines. Thus, C(E,N) describes all kind of phase-transitions with all their flavor. No assumptions of extensivity, concavity of S(E), or additivity have to be invoked. Thus Boltzmann's principle and not Tsallis statistics describes the equilibrium properties as well the approach to equilibrium of extensive and non-extensive Hamiltonian systems. No thermodynamic limit must be invoked.",
    "authors": [
      "D. H. E. Gross"
    ],
    "publication_date": "2001-06-25T15:47:25Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0106496v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0106496v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum thermodynamics with multiple conserved quantities",
    "abstract": "In this chapter we address the topic of quantum thermodynamics in the presence of additional observables beyond the energy of the system. In particular we discuss the special role that the generalized Gibbs ensemble plays in this theory, and derive this state from the perspectives of a micro-canonical ensemble, dynamical typicality and a resource-theory formulation. A notable obstacle occurs when some of the observables do not commute, and so it is impossible for the observables to simultaneously take on sharp microscopic values. We show how this can be circumvented, discuss information-theoretic aspects of the setting, and explain how thermodynamic costs can be traded between the different observables. Finally, we discuss open problems and future directions for the topic.",
    "authors": [
      "Erick Hinds Mingo",
      "Yelena Guryanova",
      "Philippe Faist",
      "David Jennings"
    ],
    "publication_date": "2018-06-21T17:14:38Z",
    "arxiv_id": "http://arxiv.org/abs/1806.08325v1",
    "download_url": "https://arxiv.org/abs/1806.08325v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamical consistency of the Dual Phase Lag heat conduction equation",
    "abstract": "Dual phase lag equation for heat conduction is analyzed from the point of view of non-equilibrium thermodynamics. Its first order Taylor series expansion is consistent with the second law as long as the two relaxation times are not negative.",
    "authors": [
      "Róbert Kovács",
      "Péter Ván"
    ],
    "publication_date": "2017-09-20T11:59:26Z",
    "arxiv_id": "http://arxiv.org/abs/1709.06825v1",
    "download_url": "https://arxiv.org/abs/1709.06825v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lagging Heat Models in Thermodynamics and Bioheat Transfer: a Critical Review",
    "abstract": "The accuracy of the classical heat conduction model, known as Fourier's law, is highly questioned, dealing with the micro and nanosystems and biological tissues. In other words, the results obtained from the classical equations deviate from the available experimental data. It means that the continuum heat diffusion equation is insufficient and inappropriate for modeling heat transport in these cases. There are several techniques for modeling non-Fourier heat conduction. In the present paper, we place our focus on the dual-phase-lag (DPL) approach. The DPL model, as a popular modification of Fourier's law, has already been utilized in numerous situations, such as simulating ultrafast laser heating and heat conduction in carbon nanotubes. There has been a sharp increase in research on non-Fourier heat conduction in recent years. Several studies have been performed in the fields of thermoelasticity, thermodynamics, transistor modeling, and bioheat transport. This review presents the most recent non-Fourier bioheat conduction works and the related thermodynamics background. The various mathematical tools, modeling different thermal therapies, and relevant criticisms and disputes are discussed. Finally, the novel and other possible studies are also presented to provide a better overview, and the roadmap to the future research and challenges ahead is drawn up.",
    "authors": [
      "Zahra Shomali",
      "Robert Kovács",
      "Peter Ván",
      "Igor Vasilievich Kudinov",
      "Jafar Ghazanfarian"
    ],
    "publication_date": "2021-02-27T20:23:31Z",
    "arxiv_id": "http://arxiv.org/abs/2103.00314v4",
    "download_url": "https://arxiv.org/abs/2103.00314v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of quantum feedback cooling",
    "abstract": "The ability to initialize quantum registers in pure states lies at the core of many applications of quantum technologies, from sensing to quantum information processing and computation. In this paper, we tackle the problem of increasing the polarization bias of an ensemble of two-level register spins by means of joint coherent manipulations, involving a second ensemble of ancillary spins and energy dissipation into an external heat bath. We formulate this spin refrigeration protocol, akin to algorithmic cooling, in the general language of quantum feedback control, and identify the relevant thermodynamic variables involved. Our analysis is two-fold: on the one hand, we assess the optimality of the protocol by means of suitable figures of merit, accounting for both its work cost and effectiveness; on the other hand, we characterise the nature of correlations built up between the register and the ancilla. In particular, we observe that neither the amount of classical correlations nor the quantum entanglement seem to be key ingredients fuelling our spin refrigeration protocol. We report instead that a more general indicator of quantumness beyond entanglement, the so-called quantum discord, is closely related to the cooling performance.",
    "authors": [
      "Pietro Liuzzo-Scorpo",
      "Luis A. Correa",
      "Rebecca Schmidt",
      "Gerardo Adesso"
    ],
    "publication_date": "2015-11-20T23:53:53Z",
    "arxiv_id": "http://arxiv.org/abs/1511.06800v2",
    "download_url": "https://arxiv.org/abs/1511.06800v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A non-equilibrium thermodynamics model for combined adsorption and diffusion processes in micro- and nanopores",
    "abstract": "A non-equilibrium thermodynamics model able to analyze the combined effect of diffusion and adsorption in porous materials is proposed. The model considers the coupled dynamics of the diffusive phase, described by a diffusion type equation, and the adsorbed phase governed by a generalized Langmuir equation. It is shown that the combination of diffusion and adsorption can be treated as diffusion in an effective medium, with an effective diffusion coefficient depending on the characteristics of the adsorption kinetics. The interplay between these effects leads to the appearance of different regimes in which the effective diffusion coefficient exhibits peculiar behaviours such as a decrease due to the presence of the adsorption process and a non-monotonous behavior resulting from particle interactions. We outline applications of the model developed to diffusion in porous materials such as zeolites and bentonites, and to engineered highly porous materials.",
    "authors": [
      "I. Santamaria-Holek",
      "Z. J. Grzywna",
      "J. M. Rubi"
    ],
    "publication_date": "2012-04-17T16:55:30Z",
    "arxiv_id": "http://arxiv.org/abs/1204.3841v1",
    "download_url": "https://arxiv.org/abs/1204.3841v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Approach to Generalized Continua",
    "abstract": "Governing equations of dissipative generalized solid mechanics are derived by thermodynamic methods in the Piola-Kirchhoff framework using the Liu procedure. The isotropic small strain case is investigated in more detail. The connection to the Ginzburg-Landau type evolution, dual internal variables, and a thermodynamic generalization of the standard linear solid model of rheology is demonstrated. Specific examples are chosen to emphasize experimental confirmations and predictions beyond less general approaches.",
    "authors": [
      "P. Ván",
      "A. Berezovski",
      "C. Papenfuss"
    ],
    "publication_date": "2013-04-17T21:35:27Z",
    "arxiv_id": "http://arxiv.org/abs/1304.4977v2",
    "download_url": "https://arxiv.org/abs/1304.4977v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Mathematical Structure of the Second Law of Thermodynamics",
    "abstract": "The essence of the second law of classical thermodynamics is the `entropy principle' which asserts the existence of an additive and extensive entropy function, S, that is defined for all equilibrium states of thermodynamic systems and whose increase characterizes the possible state changes under adiabatic conditions. It is one of the few really fundamental physical laws (in the sense that no deviation, however tiny, is permitted) and its consequences are far reaching. This principle is independent of models, statistical mechanical or otherwise, and can be understood without recourse to Carnot cycles, ideal gases and other assumptions about such things as `heat', `temperature', `reversible processes', etc., as is usually done. Also the well known formula of statistical mechanics, S = -\\sum p log p, is not needed for the derivation of the entropy principle.\n  This contribution is partly a summary of our joint work (Physics Reports, Vol. 310, 1--96 (1999)) where the existence and uniqueness of S is proved to be a consequence of certain basic properties of the relation of adiabatic accessibility among equilibrium states. We also present some open problems and suggest directions for further study.",
    "authors": [
      "Elliott H. Lieb",
      "Jakob Yngvason"
    ],
    "publication_date": "2002-04-03T23:16:28Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0204007v2",
    "download_url": "https://arxiv.org/abs/math-ph/0204007v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "What is the probability of a thermodynamical transition?",
    "abstract": "If the second law of thermodynamics forbids a transition from one state to another, then it is still possible to make the transition happen by using a sufficient amount of work. But if we do not have access to this amount of work, can the transition happen probabilistically? In the thermodynamic limit, this probability tends to zero, but here we find that for finite-sized systems, it can be finite. We compute the maximum probability of a transition or a thermodynamical fluctuation from any initial state to any final state, and show that this maximum can be achieved for any final state which is block-diagonal in the energy eigenbasis. We also find upper and lower bounds on this transition probability, in terms of the work of transition. As a bi-product, we introduce a finite set of thermodynamical monotones related to the thermo-majorization criteria which governs state transitions, and compute the work of transition in terms of them. The trade-off between the probability of a transition, and any partial work added to aid in that transition is also considered. Our results have applications in entanglement theory, and we find the amount of entanglement required (or gained) when transforming one pure entangled state into any other.",
    "authors": [
      "Álvaro M. Alhambra",
      "Jonathan Oppenheim",
      "Christopher Perry"
    ],
    "publication_date": "2015-03-31T20:00:36Z",
    "arxiv_id": "http://arxiv.org/abs/1504.00020v3",
    "download_url": "https://arxiv.org/abs/1504.00020v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and Chemistry of the Early Universe",
    "abstract": "The interplay between chemistry and thermodynamics determines the final outcome of the process of gravitational collapse and sets the conditions for the formation of the first cosmological objects, including primordial supermassive black holes. In this chapter, we will review the main chemical reactions and the most important heating/cooling processes taking place in a gas of primordial composition, including the effects of local and cosmological radiation backgrounds.",
    "authors": [
      "Stefano Bovino",
      "Daniele Galli"
    ],
    "publication_date": "2018-07-16T16:01:56Z",
    "arxiv_id": "http://arxiv.org/abs/1807.05939v2",
    "download_url": "https://arxiv.org/abs/1807.05939v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Resource theory of quantum thermodynamics: Thermal operations and Second Laws",
    "abstract": "Resource theories are a generic approach used to manage any valuable resource, such as entanglement, purity, and asymmetry. Such frameworks are characterized by two main elements: a set of predefined (free) operations and states, that one assumes to be easily obtained at no cost. Given these ground rules, one can ask: what is achievable by using such free operations and states? This usually results in a set of state transition conditions, that tell us if a particular state $ ρ$ may evolve into another state $ ρ' $ via the usage of free operations and states. We shall see in this chapter that thermal interactions can be modelled as a resource theory. The state transition conditions arising out of such a framework, are then referred to as \"second laws\". We shall also see how such state transition conditions recover classical thermodynamics in the i.i.d. limit. Finally, we discuss how these laws are applied to study fundamental limitations to the performance of quantum heat engines.",
    "authors": [
      "Nelly Ng",
      "Mischa P. Woods"
    ],
    "publication_date": "2018-05-24T09:21:54Z",
    "arxiv_id": "http://arxiv.org/abs/1805.09564v1",
    "download_url": "https://arxiv.org/abs/1805.09564v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New apparatus for DTA at 2000 bar: thermodynamic studies on Au, Ag, Al and HTSC oxides",
    "abstract": "A new DTA (Differential Thermal Analysis) device was designed and installed in a Hot Isostatic Pressure (HIP) furnace in order to perform high-pressure thermodynamic investigations up to 2 kbar and 1200C. Thermal analysis can be carried out in inert or oxidising atmosphere up to p(O2) = 400 bar. The calibration of the DTA apparatus under pressure was successfully performed using the melting temperature (Tm) of pure metals (Au, Ag and Al) as standard calibration references. The thermal properties of these metals have been studied under pressure. The values of DV (volume variation between liquid and solid at Tm), ROsm (density of the solid at Tm) and ALPHAm (linear thermal expansion coefficient at Tm) have been extracted. A very good agreement was found with the existing literature and new data were added. This HP-DTA apparatus is very useful for studying the thermodynamics of those systems where one or more volatile elements are present, such as high TC superconducting oxides. DTA measurements have been performed on Bi,Pb(2223) tapes up to 2 kbar under reduced oxygen partial pressure (p(O2) = 0.07 bar). The reaction leading to the formation of the 2223 phase was found to occur at higher temperatures when applying pressure: the reaction DTA peak shifted by 49C at 2 kbar compared to the reaction at 1 bar. This temperature shift is due to the higher stability of the Pb-rich precursor phases under pressure, as the high isostatic pressure prevents Pb from evaporating.",
    "authors": [
      "V. Garnier",
      "E. Giannini",
      "S. Hugi",
      "B. Seeber",
      "R. Flukiger"
    ],
    "publication_date": "2004-03-22T13:02:09Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0403556v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0403556v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hierarchical Equations of Motion Approach to Quantum Thermodynamics",
    "abstract": "We present a theoretical framework to investigate quantum thermodynamic processes under non-Markovian system-bath interactions on the basis of the hierarchical equations of motion (HEOM) approach, which is convenient to carry out numerically \"exact\" calculations. This formalism is valuable because it can be used to treat not only strong system-bath coupling but also system-bath correlation or entanglement, which will be essential to characterize the heat transport between the system and quantum heat baths. Using this formalism, we demonstrated an importance of the thermodynamic effect from the tri-partite correlations (TPC) for a two-level heat transfer model and a three-level autonomous heat engine model under the conditions that the conventional quantum master equation approaches are failed. Our numerical calculations show that TPC contributions, which distinguish the heat current from the energy current, have to be take into account to satisfy the thermodynamic laws.",
    "authors": [
      "Akihito Kato",
      "Yoshitaka Tanimura"
    ],
    "publication_date": "2018-04-06T07:42:00Z",
    "arxiv_id": "http://arxiv.org/abs/1804.02157v1",
    "download_url": "https://arxiv.org/abs/1804.02157v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Smooth entropy in axiomatic thermodynamics",
    "abstract": "Thermodynamics can be formulated in either of two approaches, the phenomenological approach, which refers to the macroscopic properties of systems, and the statistical approach, which describes systems in terms of their microscopic constituents. We establish a connection between these two approaches by means of a new axiomatic framework that can take errors and imprecisions into account. This link extends to systems of arbitrary sizes including microscopic systems, for which the treatment of imprecisions is pertinent to any realistic situation. Based on this, we identify the quantities that characterise whether certain thermodynamic processes are possible with entropy measures from information theory. In the error-tolerant case, these entropies are so-called smooth min and max entropies. Our considerations further show that in an appropriate macroscopic limit there is a single entropy measure that characterises which state transformations are possible. In the case of many independent copies of a system (the so-called i.i.d. regime), the relevant quantity is the von Neumann entropy.",
    "authors": [
      "Mirjam Weilenmann",
      "Lea Krämer Gabriel",
      "Philippe Faist",
      "Renato Renner"
    ],
    "publication_date": "2018-07-19T18:00:34Z",
    "arxiv_id": "http://arxiv.org/abs/1807.07583v1",
    "download_url": "https://arxiv.org/abs/1807.07583v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Redefining Heat and Work in the Right Perspective of Second-law-of-Thermodynamics",
    "abstract": "There are some misnomers and misconceptions about what is heat and what is work; the recognition of heat and work is even more difficult when it comes to categorize energy as heat or work. Since both heat and work are energy the name-confusion does not make much difference from engineering point of view, but re-defining `heat' and `work' in the right-perspective of second-law-of-thermodynamics \\cite {ref1} is necessary to revise our understanding at fundamental level. It is concluded that `heat is the energy carried by mass-less \\textit{photons} whereas work is energy carried by mass-ive material \\textit{fermions}'. Revised understanding of heat and work in this way has far reaching consequences in Physics [2-4]. The present paper lays emphasis on re-defining heat and work, removing the prevailing misconception, talks about single photon interaction and heat property of photon. Also, interestingly, it is noted that different fields of study such as `Thermodynamics' and `Relativity' are interlinked.",
    "authors": [
      "R. C. Gupta",
      "Anirudh Pradhan",
      "Sushant Gupta"
    ],
    "publication_date": "2006-04-21T06:02:50Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0604174v2",
    "download_url": "https://arxiv.org/abs/physics/0604174v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fluctuating Currents in Stochastic Thermodynamics II. Energy Conversion and Nonequilibrium Response in Kinesin Models",
    "abstract": "Unlike macroscopic engines, the molecular machinery of living cells is strongly affected by fluctuations. Stochastic Thermodynamics uses Markovian jump processes to model the random transitions between the chemical and configurational states of these biological macromolecules. A recently developed theoretical framework [Wachtel, Vollmer, Altaner: \"Fluctuating Currents in Stochastic Thermodynamics I. Gauge Invariance of Asymptotic Statistics\"] provides a simple algorithm for the determination of macroscopic currents and correlation integrals of arbitrary fluctuating currents. Here, we use it to discuss energy conversion and nonequilibrium response in different models for the molecular motor kinesin. Methodologically, our results demonstrate the effectiveness of the algorithm in dealing with parameter-dependent stochastic models. For the concrete biophysical problem our results reveal two interesting features in experimentally accessible parameter regions: The validity of a non-equilibrium Green--Kubo relation at mechanical stalling as well as negative differential mobility for superstalling forces.",
    "authors": [
      "Bernhard Altaner",
      "Artur Wachtel",
      "Jürgen Vollmer"
    ],
    "publication_date": "2015-04-14T18:09:54Z",
    "arxiv_id": "http://arxiv.org/abs/1504.03648v2",
    "download_url": "https://arxiv.org/abs/1504.03648v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reduction of Complex Dynamics in Far-from-equilibrium Systems: Nambu Non-equilibrium Thermodynamics",
    "abstract": "Far-from-equilibrium thermodynamic systems dominated by strong nonlinearity are reformulated within a dynamical framework based on the Nambu bracket formalism. It is demonstrated that general complex nonlinear non-equilibrium systems can be locally reduced to a simple form of Nambu Non-equilibrium Thermodynamics (NNET). Furthermore, mathematical and dynamical obstacles encountered in extending this reduction globally are discussed, and a generalized formulation that incorporates nonlinear effects through mixed higher-order tensors is proposed.",
    "authors": [
      "So Katagiri",
      "Yoshiki Matsuoka",
      "Akio Sugamoto"
    ],
    "publication_date": "2025-08-26T22:06:42Z",
    "arxiv_id": "http://arxiv.org/abs/2508.19455v2",
    "download_url": "https://arxiv.org/abs/2508.19455v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Steepest-Entropy-Ascent and Maximal-Entropy-Production Dynamical Models of Irreversible Relaxation to Stable Equilibrium from Any Non-Equilibrium State. Unified Treatment for Six Non-Equilibrium Frameworks",
    "abstract": "By suitable reformulations, we review the mathematical frameworks of six different approaches to the description of non-equilibrium dynamics with the purpose to set up a unified formulation of the Maximum Entropy Production (MEP) principle valid in all these contexts. In this way, we extend to such frameworks the concept of Steepest Entropy Ascent dynamics introduced by the present author in previous work on quantum thermodynamics. Actually, the present formulation constitutes a generalization also in the quantum thermodynamics framework. The analysis emphasizes that in the SEA-inspired implementation of the MEP principle, a key role is played by the geometrical metric with respect to which to measure the length of a trajectory in state space. The metric tensor turns out to be directly related to the inverse of the Onsager's generalized conductivity tensor. We conclude that in most of the existing theories of non-equilibrium the time evolution of the state representative can be seen to actually follow in state space the path of SEA with respect to a suitable metric connected with the generalized conductivities. The resulting unified family of SAE/MEP dynamical models are all intrinsically consistent with the second law of thermodynamics. The nonnegativity of the entropy production is a general and readily proved feature of SEA dynamics. In several of the different approaches to non-equilibrium description we consider here, the SEA concept has not been investigated before. Therefore, it is hoped that the present unifying approach may prove useful in providing a fresh basis for effective, thermodynamically consistent, numerical models and theoretical treatments of irreversible conservative relaxation towards equilibrium from far non-equilibrium states.",
    "authors": [
      "Gian Paolo Beretta"
    ],
    "publication_date": "2013-06-13T17:35:58Z",
    "arxiv_id": "http://arxiv.org/abs/1306.3173v3",
    "download_url": "https://arxiv.org/abs/1306.3173v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric optimisation of quantum thermodynamic processes",
    "abstract": "Differential geometry offers a powerful framework for optimising and characterising finite-time thermodynamic processes, both classical and quantum. Here, we start by a pedagogical introduction to the notion of thermodynamic length. We review and connect different frameworks where it emerges in the quantum regime: adiabatically driven closed systems, time-dependent Lindblad master equations, and discrete processes. A geometric lower bound on entropy production in finitetime is then presented, which represents a quantum generalisation of the original classical bound. Following this, we review and develop some general principles for the optimisation of thermodynamic processes in the linear-response regime. These include constant speed of control variation according to the thermodynamic metric, absence of quantum coherence, and optimality of small cycles around the point of maximal ratio between heat capacity and relaxation time for Carnot engines.",
    "authors": [
      "Paolo Abiuso",
      "Harry J. D. Miller",
      "Martí Perarnau-Llobet",
      "Matteo Scandi"
    ],
    "publication_date": "2020-08-31T13:32:05Z",
    "arxiv_id": "http://arxiv.org/abs/2008.13593v3",
    "download_url": "https://arxiv.org/abs/2008.13593v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Trade-off Between Work and Correlations in Quantum Thermodynamics",
    "abstract": "Quantum thermodynamics and quantum information are two frameworks for employing quantum mechanical systems for practical tasks, exploiting genuine quantum features to obtain advantages with respect to classical implementations. While appearing disconnected at first, the main resources of these frameworks, work and correlations, have a complicated yet interesting relationship that we examine here. We review the role of correlations in quantum thermodynamics, with a particular focus on the conversion of work into correlations. We provide new insights into the fundamental work cost of correlations and the existence of optimally correlating unitaries, and discuss relevant open problems.",
    "authors": [
      "Giuseppe Vitagliano",
      "Claude Klöckl",
      "Marcus Huber",
      "Nicolai Friis"
    ],
    "publication_date": "2018-03-19T12:15:21Z",
    "arxiv_id": "http://arxiv.org/abs/1803.06884v2",
    "download_url": "https://arxiv.org/abs/1803.06884v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Of dice and men. Subjective priors, gauge invariance, and nonequilibrium thermodynamics",
    "abstract": "\"Ceci n'est pas une pipe\" wrote René Magritte on what was only the representation of a pipe. Phenomena and their physical descriptions differ, and in particular the laws ruling the former might enjoy symmetries that have to be spent to attain the latter. So, inertial frames are necessary to draw numbers out of Newtonian mechanics and confront with experiment, but ultimately the laws of mechanics are independent of reference frames. Generalizing work done in Ref. [M. Polettini, EPL 97 (2012) 30003] to continuous systems, we discuss from a foundational point of view how subjectivity in the choice of reference prior probability is a (gauge) symmetry of thermodynamics. In particular, a change of priors corresponds to a change of coordinates. Employing an approach based on the stochastic thermodynamics of continuous state-space diffusion processes, we discuss the difference between thermostatic and thermodynamic observables and show that, while the quantification of entropy depends on priors, the second law of thermodynamics is formulated in terms of invariant quantities, in particular the curvature of the thermodynamic force (gauge potential), which we calculate in a few examples of processes led by different nonequilibrium mechanisms.",
    "authors": [
      "Matteo Polettini"
    ],
    "publication_date": "2013-07-08T12:13:07Z",
    "arxiv_id": "http://arxiv.org/abs/1307.2057v1",
    "download_url": "https://arxiv.org/abs/1307.2057v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonequilibrium thermodynamics: emergent and fundamental",
    "abstract": "How can we derive the evolution equations of dissipative systems? What is the relation between the different approaches? How much do we understand the fundamental aspects of a second law based framework? Is there a hierarchy of dissipative and ideal theories at all? How far can we reach with the new methods of nonequilibrium thermodynamics?",
    "authors": [
      "P. Ván"
    ],
    "publication_date": "2020-02-16T20:20:17Z",
    "arxiv_id": "http://arxiv.org/abs/2002.07664v1",
    "download_url": "https://arxiv.org/abs/2002.07664v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The reaction coordinate mapping in quantum thermodynamics",
    "abstract": "We present an overview of the reaction coordinate approach to handling strong system-reservoir interactions in quantum thermodynamics. This technique is based on incorporating a collective degree of freedom of the reservoir (the reaction coordinate) into an enlarged system Hamiltonian (the supersystem), which is then treated explicitly. The remaining residual reservoir degrees of freedom are traced out in the usual perturbative manner. The resulting description accurately accounts for strong system-reservoir coupling and/or non-Markovian effects over a wide range of parameters, including regimes in which there is a substantial generation of system-reservoir correlations. We discuss applications to both discrete stroke and continuously operating heat engines, as well as perspectives for additional developments. In particular, we find narrow regimes where strong coupling is not detrimental to the performance of continuously operating heat engines.",
    "authors": [
      "Ahsan Nazir",
      "Gernot Schaller"
    ],
    "publication_date": "2018-05-21T22:22:53Z",
    "arxiv_id": "http://arxiv.org/abs/1805.08307v1",
    "download_url": "https://arxiv.org/abs/1805.08307v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic formalism and anomalous transport in 1D semiclassical Bose-Hubbard chain",
    "abstract": "We analyze the time-dependent free energy functionals of the semiclassical one-dimensional Bose-Hubbard chain. We first review the weakly chaotic dynamics and the consequent early-time anomalous diffusion in the system. The anomalous diffusion is robust, appears with strictly quantized coefficients, and persists even for very long chains (more than hundred sites), crossing over to normal diffusion at late times. We identify fast (angle) and slow (action) variables and thus consider annealed and quenched partition functions, corresponding to fixing the actions and integrating over the actions, respectively. We observe the leading quantum effects in the annealed free energy, whereas the quenched energy is undefined in the thermodynamic limit, signaling the absence of thermodynamic equilibrium in the quenched regime. But already the leading correction away from the quenched regime reproduces the annealed partition function exactly. This encapsulates the fact that in both slow- and fast-chaos regime both the anomalous and the normal diffusion can be seen (though at different times).",
    "authors": [
      "Dragan Marković",
      "Mihailo Čubrović"
    ],
    "publication_date": "2023-12-28T13:23:18Z",
    "arxiv_id": "http://arxiv.org/abs/2312.17008v2",
    "download_url": "https://arxiv.org/abs/2312.17008v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lie groups in nonequilibrium thermodynamics: Geometric structure behind viscoplasticity",
    "abstract": "Poisson brackets provide the mathematical structure required to identify the reversible contribution to dynamic phenomena in nonequilibrium thermodynamics. This mathematical structure is deeply linked to Lie groups and their Lie algebras. From the characterization of all the Lie groups associated with a given Lie algebra as quotients of a universal covering group, we obtain a natural classification of rheological models based on the concept of discrete reference states and, in particular, we find a clear-cut and deep distinction between viscoplasticity and viscoelasticity. The abstract ideas are illustrated by a naive toy model of crystal viscoplasticity, but similar kinetic models are also used for modeling the viscoplastic behavior of glasses. We discuss some implications for coarse graining and statistical mechanics.",
    "authors": [
      "Hans Christian Öttinger"
    ],
    "publication_date": "2010-02-09T13:09:54Z",
    "arxiv_id": "http://arxiv.org/abs/1002.1845v1",
    "download_url": "https://arxiv.org/abs/1002.1845v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic deficiencies of some simple Lindblad operators",
    "abstract": "Master equations of Lindblad type have attained prominent status in the fields of quantum optics and quantum information since they are guaranteed to satisfy fundamental notions of quantum dynamics such as complete positivity. When Lindblad operators are used to describe thermal reservoirs in contact with an open quantum system, the fundamental laws of thermodynamics and the fluctuation-dissipation theorem provide additional mandatory criteria. We show several examples of innocent-looking Lindblad operators which have questionable properties in this regard. Compatibility criteria between Hamiltonian and Lindblad terms as well as consequences of their violation are discussed. An alternative stochastic approach to dissipative quantum dynamics is outlined and illustrated through a harmonic-chain model for which the approach of local Lindblad operators fails.",
    "authors": [
      "Jürgen T. Stockburger",
      "Thomas Motz"
    ],
    "publication_date": "2016-06-14T12:30:11Z",
    "arxiv_id": "http://arxiv.org/abs/1606.04326v2",
    "download_url": "https://arxiv.org/abs/1606.04326v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Black Hole Evaporation and Generalized 2nd Law with Nonequilibrium Thermodynamics",
    "abstract": "In general, when a black hole evaporates, there arises a net energy flow from black hole into its outside environment due to Hawking radiation and energy accretion onto black hole. The existence of energy flow means that the thermodynamic state of the whole system, which consists of a black hole and its environment, is in a nonequilibrium state. To know the detail of evaporation process, the nonequilibrium effects of energy flow should be taken into account. The nonequilibrium nature of black hole evaporation is a challenging topic including issues of not only black hole physics but also nonequilibrium physics. Using the nonequilibrium thermodynamics which has been formulated recently, this report shows: (1) the self-gravitational effect of black hole which appears as its negative heat capacity guarantees the validity of generalized 2nd law without entropy production inside the outside environment, (2) the nonequilibrium effect of energy flow tends to shorten the evaporation time (life time) of black hole, and consequently specific nonequilibrium phenomena are suggested. Finally a future direction of this study is commented.",
    "authors": [
      "Hiromi Saida"
    ],
    "publication_date": "2007-11-15T02:25:37Z",
    "arxiv_id": "http://arxiv.org/abs/0711.2330v2",
    "download_url": "https://arxiv.org/abs/0711.2330v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards the Solution of Power Dissipation in Electronics Systems through Thermodynamics",
    "abstract": "Power loss in the electronic system is a very crucial limiting factor that can be reduced or minimized with the help of using the reversible logics \"a concept came from Thermodynamics\". In this paper the authors shows the concept of reversible logics for the Electronics system. The logical and physical designing approach is given in the paper in detail. The contradiction of logical and physical reversibility with the conventional CMOS designing is also shows and the solution of that contradiction is also proposed by the authors using adiabatic logic. This Paper gives a complete and clear idea if the thermodynamical concept for the electronics industries for power reduction.",
    "authors": [
      "Pradeep Singla",
      "Satyan"
    ],
    "publication_date": "2012-04-25T01:14:03Z",
    "arxiv_id": "http://arxiv.org/abs/1204.5526v2",
    "download_url": "https://arxiv.org/abs/1204.5526v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Perturbation analysis in thermodynamics using matrix representations of Ruelle transfer operators",
    "abstract": "We study perturbations of topological pressures, Gibbs measures and measure-theoretic entropies of these measures concerning perturbed potentials defined on topologically transitive subshift of finite type. The subshift with respect to non-perturbed system is assumed to be no topologically transitive. Therefore, the subshift of the perturbed systems and the subshift of the unperturbed system are different. We reduce this situation to a perturbation problem of certain irreducible nonnegative matrices generated by Ruelle transfer operators. Consequently, under suitable conditions of potentials, we characterize the limit points of those thermodynamics and give a necessary and sufficient condition for convergence of Gibbs measures and the measure-theoretic entropy of this measure when the subshift of the non-perturbed system has $2$ or $3$ transitive components with the maximal pressure. Finally, we illustrate the relation between potentials and convergence of Gibbs measures by using asymptotic expansion techniques for eigenvalues of Ruelle transfer operators.",
    "authors": [
      "Haruyoshi Tanaka"
    ],
    "publication_date": "2016-06-10T10:10:45Z",
    "arxiv_id": "http://arxiv.org/abs/1606.03253v2",
    "download_url": "https://arxiv.org/abs/1606.03253v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Can we know about black hole thermodynamics through shadows?",
    "abstract": "We investigate the relationship between shadow radius and microstructure for a general static spherically symmetric black hole and confirm their close connection. In this regard, we take the Reissner-Nordström (AdS) black hole as an example to do the concrete analysis. On the other hand, we study for the Kerr (AdS) black hole the relationship between its shadow and thermodynamics in the aspects of phase transition and microstructure. Our results for the Kerr (AdS) black hole show that the shadow radius $r_{\\rm sh}$, the deformation parameters $δ_s$ and $k_s$, and the circularity deviation $ΔC$ can reflect the black hole thermodynamics. In addition, we give the constraints to the relaxation time of the M$87^{*}$ black hole by combining its shadow data and the Bekenstein-Hod universal bounds when the M$87^{*}$ is regarded as the Reissner-Nordström or Kerr black hole. We predict that the minimum relaxation times of M$87^{*}$ black hole and Sgr $A^{*}$ black hole are approximately 3 days and 2.64 minutes, respectively. Finally, we draw the first graph of the minimum relaxation time $τ_{\\rm min}$ with respect to the maximum shadow radius $ r_{\\rm sh}^{\\rm max}$ at different mass levels.",
    "authors": [
      "Xin-Chang Cai",
      "Yan-Gang Miao"
    ],
    "publication_date": "2021-07-18T03:14:35Z",
    "arxiv_id": "http://arxiv.org/abs/2107.08352v4",
    "download_url": "https://arxiv.org/abs/2107.08352v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fluctuating Currents in Stochastic Thermodynamics I. Gauge Invariance of Asymptotic Statistics",
    "abstract": "Stochastic Thermodynamics uses Markovian jump processes to model random transitions between observable mesoscopic states. Physical currents are obtained from anti-symmetric jump observables defined on the edges of the graph representing the network of states. The asymptotic statistics of such currents are characterized by scaled cumulants. In the present work, we use the algebraic and topological structure of Markovian models to prove a gauge invariance of the scaled cumulant-generating function. Exploiting this invariance yields an efficient algorithm for practical calculations of asymptotic averages and correlation integrals. We discuss how our approach generalizes the Schnakenberg decomposition of the average entropy-production rate, and how it unifies previous work. The application of our results to concrete models is presented in an accompanying publication.",
    "authors": [
      "Artur Wachtel",
      "Jürgen Vollmer",
      "Bernhard Altaner"
    ],
    "publication_date": "2014-07-08T12:36:38Z",
    "arxiv_id": "http://arxiv.org/abs/1407.2065v3",
    "download_url": "https://arxiv.org/abs/1407.2065v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dynamics and thermodynamics of systems with long-range interactions: interpretation of the different functionals",
    "abstract": "We discuss the dynamics and thermodynamics of systems with weak long-range interactions. Generically, these systems experience a violent collisionless relaxation in the Vlasov regime leading to a (usually) non-Boltzmannian quasi stationary state (QSS), followed by a slow collisional relaxation leading to the Boltzmann statistical equilibrium state. These two regimes can be explained by a kinetic theory, using an expansion of the BBGKY hierarchy in powers of 1/N, where N is the number of particles. We discuss the physical meaning of the different functionals appearing in the analysis: the Boltzmann entropy, the Lynden-Bell entropy, the \"generalized\" entropies arising in the reduced space of coarse-grained distribution functions, the Tsallis entropy, the generalized H-functions increasing during violent relaxation (not necessarily monotonically) and the convex Casimir functionals used to settle the formal nonlinear dynamical stability of steady states of the Vlasov equation. We show the connection between the different variational problems associated with these functionals. We also introduce a general class of nonlinear mean field Fokker-Planck (NFP) equations that can be used as numerical algorithms to solve these constrained optimization problems.",
    "authors": [
      "Pierre-Henri Chavanis"
    ],
    "publication_date": "2009-04-17T15:52:52Z",
    "arxiv_id": "http://arxiv.org/abs/0904.2729v1",
    "download_url": "https://arxiv.org/abs/0904.2729v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Dynamical Structure (SDS) of Nonequilibrium Processes in the Absence of Detailed Balance. IV: Emerging of Stochastic Dynamical Equalities and Steady State Thermodynamics from Darwinian Dynamics",
    "abstract": "This is the fourth paper, the last one, on solution to the problem of absence of detailed balance in nonequilibrium processes. It is an approach based on another known universal dynamics: The evolutionary dynamics first conceived by Darwin and Wallace, referring to as Darwinian dynamics in the present paper, has been found to be universally valid in biology; The statistical mechanics and thermodynamics, while enormously successful in physics, have been in an awkward situation of wanting a consistent dynamical understanding; Here we present from a formal point of view an exploration of the connection between thermodynamics and Darwinian dynamics and a few related topics. We first show that the stochasticity in Darwinian dynamics implies the existence temperature, hence the canonical distribution of Boltzmann-Gibbs type. In term of relative entropy the Second Law of thermodynamics is dynamically demonstrated without detailed balance condition, and is valid regardless of size of the system. In particular, the dynamical component responsible for breaking detailed balance condition does not contribute to the change of the relative entropy. Two types of stochastic dynamical equalities of current interest are explicitly discussed in the present approach: One is based on Feynman-Kac formula and another is a generalization of Einstein relation. Both are directly accessible to experimental tests. Our demonstration indicates that Darwinian dynamics represents logically a simple and straightforward starting point for statistical mechanics and thermodynamics and is complementary to and consistent with conservative dynamics that dominates the physical sciences. Present exploration suggests the existence of a unified stochastic dynamical framework both near and far from equilibrium.",
    "authors": [
      "P Ao"
    ],
    "publication_date": "2008-06-01T23:29:57Z",
    "arxiv_id": "http://arxiv.org/abs/0806.0186v1",
    "download_url": "https://arxiv.org/abs/0806.0186v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Microcanonical Thermostatistics as Foundation of Thermodynamics. The microscopic origin of condensation and phase separations",
    "abstract": "Conventional thermo-statistics address infinite homogeneous systems within the canonical ensemble. However, some 150 years ago the original motivation of thermodynamics was the description of steam engines, i.e. boiling water. Its essential physics is the separation of the gas phase from the liquid. Of course, boiling water is inhomogeneous and as such cannot be treated by canonical thermo-statistics. Then it is not astonishing, that a phase transition of first order is signaled canonically by a Yang-Lee singularity. Thus it is only treated correctly by microcanonical Boltzmann-Planck statistics. This is elaborated in the present article. It turns out that the Boltzmann-Planck statistics is much richer and gives fundamental insight into statistical mechanics and especially into entropy. This can even be done to some extend rigorously and analytically. The microcanonical entropy has a very simple physical meaning: It measures the microscopic uncertainty that we have about the system, i.e. the number of points in $6N$-dim phase, which are consistent with our information about the system. It can rigorously be split into an ideal-gas part and a configuration part which contains all the physics and especially is responsible for all phase transitions. The deep and essential difference between ``extensive'' and ``intensive'' control parameters, i.e. microcanonical and canonical statistics, is exemplified by rotating, self-gravitating systems.",
    "authors": [
      "D. H. E. Gross"
    ],
    "publication_date": "2004-11-16T16:28:47Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0411408v3",
    "download_url": "https://arxiv.org/abs/cond-mat/0411408v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-equilibrium critical behavior : An extended irreversible thermodynamics approach",
    "abstract": "Critical phenomena in non-equilibrium systems have been studied by means of a wide variety of theoretical and experimental approaches. Mode-coupling, renormalization group, complex Lie algebras and diagrammatic techniques are some of the usual theoretical tools. Experimental studies include light and inelastic neutron scattering, X-ray photon correlation spectroscopy, microwave interferometry and several other techniques. Nevertheless no conclusive reatment has been developed from the basic principles of a thermodynamic theory of irreversible processes. We have developed a formalism in which we obtain correlation functions as field averages of the associated functions. By applying such formalism we attempt to find out if the resulting correlation functions will inherit the mathematical properties (integrability, generalized homogeneity, scaling laws) of its parent potentials, and we will also use these correlation functions to study the behavior of macroscopic systems far from equilibrium, specially in the neighborhood of critical points or dynamic phase transitions. As a working example we will consider the mono-critical behavior of a non-equilibrium binary fluid mixture close to its consolute point.",
    "authors": [
      "Enrique Hernandez-Lemus",
      "Leopoldo S. Garcia-Colin"
    ],
    "publication_date": "2009-08-15T04:32:40Z",
    "arxiv_id": "http://arxiv.org/abs/0908.2161v1",
    "download_url": "https://arxiv.org/abs/0908.2161v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Properties of the van der Waals Fluid",
    "abstract": "The van der Waals (vdW) theory of fluids is the first and simplest theory that takes into account interactions between the particles of a system that result in a phase transition versus temperature. Combined with Maxwell's construction, this mean-field theory predicts the conditions for equilibrium coexistence between the gas and liquid phases and the first-order transition between them. However, important properties of the vdW fluid have not been systematically investigated. Here we report a comprehensive study of these properties. Ambiguities about the physical interpretation of the Boyle temperature and the influence of the vdW molecular interactions on the pressure of the vdW gas are resolved. Thermodynamic variables and properties are formulated in reduced units that allow all properties to be expressed as laws of corresponding states that apply to all vdW fluids. Lekner's parametric solution for the vdW gas-liquid coexistence curve in the pressure-temperature plane and related thermodynamic properties [Am. J. Phys. 50, 161 (1982)] is explained and significantly extended. Hysteresis in the first-order transition temperature on heating and cooling is examined and the maximum degrees of superheating and supercooling determined. The latent heat of vaporization and the entropy change on crossing the coexistence curve are investigated. The temperature dependences of the isothermal compressibility, thermal expansion coefficient and heat capacity at constant pressure for a range of pressures above, at and below the critical pressure are systematically studied from numerical calculations including their critical behaviors and their discontinuities on crossing the coexistence curve. Joule-Thomson expansion of the vdW gas is investigated in detail and the pressure and temperature conditions for liquifying a vdW gas on passing through the throttle are determined.",
    "authors": [
      "David C. Johnston"
    ],
    "publication_date": "2014-02-05T22:17:43Z",
    "arxiv_id": "http://arxiv.org/abs/1402.1205v1",
    "download_url": "https://arxiv.org/abs/1402.1205v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "One-dimensional atomic superfluids as a model system for quantum thermodynamics",
    "abstract": "In this chapter we will present the one-dimensional (1d) quantum degenerate Bose gas (1d superfluid) as a testbed to experimentally illustrate some of the key aspects of quantum thermodynamics. Hard-core bosons in one-dimension are described by the integrable Lieb-Lininger model. Realistic systems, as they can be implemented, are only approximately integrable, and let us investigate the cross over to 'thermalisation'. They show such fundamental properties as pre-thermalisation, general Gibbs ensembles and light-cone like spreading of de-coherence. On the other hand they are complex enough to illustrate that our limited ability to measure only (local) few-body observables determines the relevant description of the many-body system and its physics. One consequence is the observation of quantum recurrences in systems with thousand of interacting particles. The relaxation observed in 1D superfluids is universal for a large class of many-body systems, those where the relevant physics can be described by a set of 'long lived' collective modes. The time window where the 'close to integrable' dynamics can be observed is given by the 'lifetime' of the quasi-particles associated with the collective modes. Based on these observations one can view (in a quantum field theory sense) a many-body quantum system at T=0 as 'vacuum' and its excitations as the system to experiment with. This viewpoint leads to a new way to build thermal machines from the quasi-particles in 1D superfluids. We will give examples of how to realise these systems and point to a few interesting questions that might be addressed.",
    "authors": [
      "Joerg Schmiedmayer"
    ],
    "publication_date": "2018-05-29T15:25:32Z",
    "arxiv_id": "http://arxiv.org/abs/1805.11539v1",
    "download_url": "https://arxiv.org/abs/1805.11539v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Water saturation in texturally porous carbonate rocks: Shock thermodynamics and dampening of the shock",
    "abstract": "Sedimentary rocks often form the upper layers or the entire target rocks in impact events. Thermodynamic properties of sedimentary rocks related to porosity and water saturation affect the process of impact crater formation. The heterogeneous distribution of sedimentary facies can complicate the development and distribution of shock effects, especially in numerical modeling. This work focuses on the shock thermodynamic properties of carbonate rocks with differing porosity textures (e.g., isolated pores, interstitial porosity, elongated pores) and water saturation levels. Using mesoscale numerical modeling, we found that water saturation reduces shock temperatures compared to those in dry, porous carbonate rocks. The orientation of elongated pores and porosity lineations influences the shock temperature distribution and rock deformation at angles of 50-90° to the shock front. Additionally, due to complex shock wave interactions, interstitial porosity is key in creating temperature zonations around larger grains.",
    "authors": [
      "Juulia-Gabrielle Moreau",
      "Argo Jõeleht",
      "Anna Losiak",
      "Meng-Hua Zhu",
      "Jüri Plado"
    ],
    "publication_date": "2025-10-20T11:33:53Z",
    "arxiv_id": "http://arxiv.org/abs/2510.17446v1",
    "download_url": "https://arxiv.org/abs/2510.17446v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Thermodynamics, Entropy of the Universe, Free Energy, and the Second Law",
    "abstract": "We take the view that the standard von Neumann definition, in which the entropy $S^{vN}$ of a pure state is zero, is in evident conflict with the statement of the second law that the entropy of the universe $S_{univ}$ increases in spontaneous processes, $ ΔS_{univ} > 0$. Here we seek an alternative entropy of the universe $S_{univ}$ that is in accord with the second law, in a spirit not dissimilar to von Neumann himself in lesser-known work. We perform simulations of time dependent dynamics for a previously developed \\cite{polyadbath} model quantum system becoming entangled with a quantum environment. We test the new definition of the entropy of the system-environment \"universe\" against the standard thermodynamic relation $ ΔF_{sys} = - T ΔS_{univ} $, calculating system properties using the reduced density matrix and standard von Neumann entropy. Good agreement is obtained, showing the compatibility of an entropy for a pure state of a universe with the statement of the second law and the concept of free energy. Interesting deviation from microcanonical behavior within the zero order energy shell is observed in a context of effectively microcanonical behavior within the much larger total basis of the time dependent universe.",
    "authors": [
      "George L. Barnes",
      "Phillip C. Lotshaw",
      "Michael E. Kellman"
    ],
    "publication_date": "2015-11-19T14:15:34Z",
    "arxiv_id": "http://arxiv.org/abs/1511.06176v3",
    "download_url": "https://arxiv.org/abs/1511.06176v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Condenser Pressure Influence on Ideal Steam Rankine Power Vapor Cycle using the Python Extension Package Cantera for Thermodynamics",
    "abstract": "This study investigates the Rankine vapor power thermodynamic cycle using steam/water as the working fluid, which is common in commercial power plants for power generation as the source of the rotary shaft power needed to drive electric generators. The four-process cycle version, which comprises a water pump section, a boiler/superheater section, a steam turbine section, and a condenser section, was considered. The performance of this thermodynamic power cycle depends on several design parameters. This study varied a single independent variable, the absolute pressure of the condenser, by a factor of 256, from 0.78125 to 200 kPa. The peak pressure and peak temperature in the cycle were fixed at 50 bar (5,000 kPa) and 600°C, respectively, corresponding to a base case with a base value for the condenser's absolute pressure of 12.5 kPa (0.125 bar). The analysis was performed using the thermodynamics software package Cantera as an extension of the Python programming language. The results suggest that over the range of condenser pressures examined, a logarithmic function can be deployed to describe the dependence of input heat, the net output work, and cycle efficiency on the absolute pressure of the condenser. Each of these three performance metrics decreases as the absolute pressure of the condenser increases. However, a power function is a better choice to describe how the steam dryness (steam quality) at the end of the turbine section increases as the absolute pressure of the condenser rises.",
    "authors": [
      "Osama A. Marzouk"
    ],
    "publication_date": "2025-02-28T20:52:50Z",
    "arxiv_id": "http://arxiv.org/abs/2503.00180v1",
    "download_url": "https://arxiv.org/abs/2503.00180v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of irreversible particle creation phenomena and its cosmological consequence",
    "abstract": "The study of particle creation phenomena at the expense of the gravitational field is of great research interest. It might solve the cosmological puzzle single-handedly, without the need for either dark energy or the modified theory of gravity. In the early universe, following graceful exit from inflationary phase, it serves the purpose of reheating the cold universe, which gave way to the hot Big-Bang model. In the late universe, it led to late time cosmic acceleration, without affecting stand-ard Big-Bang-Nucleosynthesis (BBN), Cosmic Microwave Background Radiation (CMBR), or Structure Formation. In this chapter, we briefly review the present status of cosmic evolution, develop the thermodynamics for irreversible particle creation phenomena and study its consequences at the early as well as in the late universe.",
    "authors": [
      "Abhik Kumar Sanyal",
      "Subhra Debnath"
    ],
    "publication_date": "2017-08-16T12:27:42Z",
    "arxiv_id": "http://arxiv.org/abs/1708.04857v1",
    "download_url": "https://arxiv.org/abs/1708.04857v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rigorous and General Definition of Thermodynamic Entropy",
    "abstract": "The physical foundations of a variety of emerging technologies --- ranging from the applications of quantum entanglement in quantum information to the applications of nonequilibrium bulk and interface phenomena in microfluidics, biology, materials science, energy engineering, etc. --- require understanding thermodynamic entropy beyond the equilibrium realm of its traditional definition. This paper presents a rigorous logical scheme that provides a generalized definition of entropy free of the usual unnecessary assumptions which constrain the theory to the equilibrium domain. The scheme is based on carefully worded operative definitions for all the fundamental concepts employed, including those of system, property, state, isolated system, environment, process, separable system, system uncorrelated from its environment, and parameters of a system. The treatment considers also systems with movable internal walls and/or semipermeable walls, with chemical reactions and/or external force fields, and with small numbers of particles. The definition of reversible process is revised by introducing the new concept of scenario. The definition of entropy involves neither the concept of heat nor that of quasistatic process; it applies to both equilibrium and nonequilibrium states. The role of correlations on the domain of definition and on the additivity of energy and entropy is discussed: it is proved that energy is defined and additive for all separable systems, while entropy is defined and additive only for separable systems uncorrelated from their environment; decorrelation entropy is defined. The definitions of energy and entropy are extended rigorously to open systems. Finally, to complete the discussion, the existence of the fundamental relation for stable equilibrium states is proved, in our context, for both closed and open systems.",
    "authors": [
      "Gian Paolo Beretta",
      "Enzo Zanchini"
    ],
    "publication_date": "2010-10-05T09:28:47Z",
    "arxiv_id": "http://arxiv.org/abs/1010.0813v1",
    "download_url": "https://arxiv.org/abs/1010.0813v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic resetting: A (very) brief review",
    "abstract": "Stochastic processes offer a fundamentally different paradigm of dynamics than deterministic processes, the most prominent example of the latter being Newton's laws of motion. Here, we discuss in a pedagogical manner a simple and illustrative example of stochastic processes in the form of a particle undergoing standard Brownian diffusion, with the additional feature of the particle resetting repeatedly and at random times to its initial condition. Over the years, many different variants of this simple setting have been studied, all of which serve as illustrations of non-trivial and interesting static and dynamic features that characterize stochastic dynamics at long times. We will provide in this work a brief overview of this active and rapidly evolving field by considering the arguably simplest example of Brownian diffusion in one dimension. Along the way, we will learn about some of the general techniques that a physicist employs to study stochastic processes. Relevant to the special issue, we will discuss in detail how introducing resetting in an otherwise diffusive dynamics provides an explicit optimization of the time to locate a target through a special choice of the resetting protocol. We also discuss thermodynamics of resetting, and provide a bird's eye view of some of the recent work in the field of resetting.",
    "authors": [
      "Shamik Gupta",
      "Arun M. Jayannavar"
    ],
    "publication_date": "2021-06-14T18:20:02Z",
    "arxiv_id": "http://arxiv.org/abs/2106.07693v2",
    "download_url": "https://arxiv.org/abs/2106.07693v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Is thermodynamics fundamental?",
    "abstract": "It is a common view in philosophy of physics that thermodynamics is a non-fundamental theory. This is motivated in particular by the fact that thermodynamics is considered to be a paradigmatic example for a theory that can be reduced to another one, namely statistical mechanics. For instance, the statement \"temperature is mean molecular kinetic energy\" has become a textbook example for a successful reduction, despite the fact that this statement is not correct for a large variety of systems. In this article, we defend the view that thermodynamics is a fundamental theory, a position that we justify based on four case studies from recent physical research. We explain how entropic gravity (1) and black hole thermodynamics (2) can serve as case studies for the multiple realizability problem which blocks the reduction of thermodynamics. Moreover, we discuss the problem of the reducibility of phase transitions and argue that bifurcation theory (3) allows the modelling of \"phase transitions\" on a thermodynamic level even in finite systems. It is also shown that the derivation of irreversible transport equations in the Mori-Zwanzig formalism (4) does not, despite recent claims to the contrary, constitute a reduction of thermodynamics to quantum mechanics. Finally, we briefly discuss some arguments against the fundamentality of thermodynamics that are not based on reduction.",
    "authors": [
      "Michael te Vrugt",
      "Paul Needham",
      "Georg J. Schmitz"
    ],
    "publication_date": "2022-04-09T01:53:02Z",
    "arxiv_id": "http://arxiv.org/abs/2204.04352v1",
    "download_url": "https://arxiv.org/abs/2204.04352v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics Beyond Molecules: Statistical Thermodynamics of Distributions",
    "abstract": "Statistical thermodynamics has a universal appeal that extends beyond molecular systems, and yet, as its tools are being transplanted to fields outside physics, the fundamental question, \\textit{what is thermodynamics?}, has remained unanswered. We answer this question here. Generalized statistical thermodynamics is a variational calculus of probability distributions. It is independent of physical hypotheses but provides the means to incorporate our knowledge, assumptions and physical models about a stochastic processes that gives rise to the probability in question. We derive the familiar calculus of thermodynamics via a probabilistic argument that makes no reference to physics. At the heart of the theory is a space of distributions and a special functional that assigns probabilities to this space. The maximization of this functional generates the entire mathematical network of thermodynamic relationships. We obtain statistical mechanics as a special case and make contact with Information Theory and Bayesian inference.",
    "authors": [
      "Themis Matsoukas"
    ],
    "publication_date": "2018-09-18T14:13:56Z",
    "arxiv_id": "http://arxiv.org/abs/1809.07367v3",
    "download_url": "https://arxiv.org/abs/1809.07367v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Basic Thermodynamics",
    "abstract": "The goal of this paper is to present a general thermodynamic basis that is useable in the context of superconductivity and particle accelerators. The first part recalls the purpose of thermodynamics and summarizes its important concepts. Some applications, from cryogenics to magnetic systems, are covered. In the context of basic thermodynamics, only thermodynamic equilibrium is considered.",
    "authors": [
      "P Duthil"
    ],
    "publication_date": "2015-01-28T12:50:25Z",
    "arxiv_id": "http://arxiv.org/abs/1501.07088v1",
    "download_url": "https://arxiv.org/abs/1501.07088v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Thermodynamics",
    "abstract": "The theory of quantum thermodynamics investigates how the concepts of heat, work, and temperature can be carried over to the quantum realm, where fluctuations and randomness are fundamentally unavoidable. These lecture notes provide an introduction to the thermodynamics of small quantum systems. It is illustrated how the laws of thermodynamics emerge from quantum theory and how open quantum systems can be modeled by Markovian master equations. Quantum systems that are designed to perform a certain task, such as cooling or generating entanglement are considered. Finally, the effect of fluctuations on the thermodynamic description is discussed.",
    "authors": [
      "Patrick P. Potts"
    ],
    "publication_date": "2024-06-27T14:28:35Z",
    "arxiv_id": "http://arxiv.org/abs/2406.19206v2",
    "download_url": "https://arxiv.org/abs/2406.19206v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]