[
  {
    "title": "Electromagnetic response of spinful Majorana fermions",
    "abstract": "A remarkable feature of topological superconductors is the emergence of\nMajorana fermions in electron systems. Whereas the emergent Majorana fermions\nshare the self-anti-particle property with Majorana fermions in particle\nphysics, they may have essentially different electromagnetic properties. In\nthis paper, we argue the electromagnetic response of spinful Majorana fermions\nin topological superconductors. We present a general theory of the\nelectromagnetic response of spinful Majorana fermions in topological\nsuperconductors and clarify how the pairing symmetry is encoded in the\nelectromagnetic response. As an application, we predict the\nsublattice-dependent dipole (Ising)-type magnetic response of corner Majorana\nfermions in iron-based superconductors.",
    "authors": [
      "Shingo Kobayashi",
      "Masatoshi Sato"
    ],
    "publication_date": "2024-04-30T05:27:09Z",
    "arxiv_id": "http://arxiv.org/abs/2404.19269v2",
    "download_url": "http://arxiv.org/abs/2404.19269v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic pressure and mechanical pressure for electromagnetic media",
    "abstract": "By the mechanical pressure we mean that the pressure in the fundamental\nthermodynamic equation with the naive form of the electromagnetic work used,\nwhile the thermodynamic one we mean that in the equation with proper\nthermodynamic form of the electromagnetic work instead. Both pressures differ\nfrom a magnetic mutual field pressure which results from the electromagnetic\nstress tensor for the linear and uniform media in static electromagnetic field.\nBoth pressures are in essence tensors, but a quasi-scalar theory is sufficient\nfor the simple media.",
    "authors": [
      "Q. H. Liu"
    ],
    "publication_date": "2024-09-02T12:27:09Z",
    "arxiv_id": "http://arxiv.org/abs/2409.01203v2",
    "download_url": "http://arxiv.org/abs/2409.01203v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Collision of strong gravitational and electromagnetic waves in the\n  expanding universe",
    "abstract": "An exact analytical model of the process of collision and nonlinear\ninteraction of gravitational and/or electromagnetic soliton wave and strong\nnon-soliton electromagnetic traveling wave of arbitrary profile propagating in\nthe expanding universe (the symmetric Kasner spacetime) is presented. In\ncontrast to intuitive expectations that rather strong traveling waves can\ndestroy the soliton, it occurs that the soliton survives during its interaction\nwith electromagnetic wave of arbitrary amplitude and profile, but its\nparameters begin to evolve under the influence of this interaction. If a\ntraveling electromagnetic wave possesses a finite duration, the soliton\nparameters after interaction take constant values again, but these values in\ngeneral are different from those before the interaction. Based on exact\nsolutions of Einstein - Maxwell equations, our model demonstrates a series of\nnonlinear phenomena, such as (a) creation of gravitational waves in the\ncollision of two electromagnetic waves, (b) creation of electromagnetic soliton\nwave in the collision of gravitational soliton with traveling electromagnetic\nwave, (c) scattering of a part of soliton wave in the direction of propagation\nof traveling electromagnetic wave, (d) quasiperiodic oscillating character of\nfields in the wave interaction region and multiple mutual transformations of\ngravitational and electromagnetic waves in this region. The figures illustrate\nthese features of nonlinear wave interactions in General Relativity.",
    "authors": [
      "G. A. Alekseev"
    ],
    "publication_date": "2015-11-10T23:24:37Z",
    "arxiv_id": "http://arxiv.org/abs/1511.03335v2",
    "download_url": "http://arxiv.org/abs/1511.03335v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Do the standard expressions for the electromagnetic field-momentum need\n  any modifications?",
    "abstract": "We investigate here the question raised in literature about the correct\nexpression for the electromagnetic field-momentum, especially when static\nfields are involved. For this we examine a couple of simple but intriguing\ncases. First we consider a system configuration in which electromagnetic field\nmomentum is present even though the system is static. We trace the\nelectromagnetic momentum to be present in the form of a continuous transport of\nelectromagnetic energy from one part of the system to another, without causing\nany net change in the energy of the system. In a second case we show that the\nelectromagnetic momentum is nil irrespective of whether the charged system is\nstationary or in motion, even though the electromagnetic energy is present\nthroughout. We demonstrate that the conventional formulation of electromagnetic\nfield-momentum describes the systems consistently without any real\ncontradictions. Here we also make exposition of a curiosity where\nelectromagnetic energy decreases when the charged system gains velocity. Then\nwe discuss the more general question that has been raised -- Are the\nconventional formulas for energy-momentum of electromagnetic fields valid for\nall cases? Or more specifically, in the case of so-called \"bound fields,\" do we\nneed to change over to some modified definitions which have made their\nappearance even in standard text books? We show that in all cases it is only\nthe conventional formulas which lead to results consistent with the rest of\nphysics, including the special theory of relativity, and that any proposed\nmodifications are thus superfluous.",
    "authors": [
      "Ashok K. Singal"
    ],
    "publication_date": "2016-01-25T07:15:38Z",
    "arxiv_id": "http://arxiv.org/abs/1601.06495v2",
    "download_url": "http://arxiv.org/abs/1601.06495v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strong and electromagnetic amplitudes of the $J/ψ$ decays into\n  baryons and their relative phase",
    "abstract": "The Feynman amplitude for the decay of the $J/\\psi$ meson into\nbaryon-antibaryon can be written as a sum of three sub-amplitudes: a purely\nstrong, a purely electromagnetic and a mixed strong-electromagnetic. Assuming\nthat the strong and mixed strong-electromagnetic sub-amplitudes have the same\nphase, the branching ratio of the decay contains an interference term that\ndepends on the relative phase $\\varphi$ between strong and electromagnetic\nsub-amplitudes. In this work we calculate this phase, by using an effective\nstrong Lagrangian density and considering, as final states, pairs of baryons,\n$\\mathcal{B}\\overline{\\mathcal{B}}$, belonging to the spin-1/2 SU(3) octet.\nMoreover, we obtain the purely strong, purely electromagnetic and mixed\nstrong-electromagnetic contributions to the total branching ratio and hence the\nmoduli of the corresponding sub-amplitudes, for each pair of baryons. Of\nparticular interest is the mixed strong-electromagnetic contribution that, not\nonly is determined for the first time, but it is proven to be crucial, in the\nframework of our model, for the correct description of the decay mechanism.\nFinally we use the purely electromagnetic branching ratio to calculate the Born\nnon-resonant cross section of the annihilation processes $e^+ e^- \\to\n\\mathcal{B}\\overline{\\mathcal{B}}$ at the $J/\\psi$ mass. By taking advantage\nfrom all available data, we obtain the relative phase between strong and\nelectromagnetic sub-amplitudes: $\\varphi = (73\\pm 8)^\\circ$.",
    "authors": [
      "Rinaldo Baldini Ferroli",
      "Alessio Mangoni",
      "Simone Pacetti",
      "Kai Zhu"
    ],
    "publication_date": "2019-05-03T08:25:45Z",
    "arxiv_id": "http://arxiv.org/abs/1905.01069v1",
    "download_url": "http://arxiv.org/abs/1905.01069v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimisation of design parameters to improve performance of a planar\n  electromagnetic actuator",
    "abstract": "Planar electromagnetic actuators based on the principle of linear motors are\nwidely employed for micro and nano positioning applications. These actuators\nusually employ a planar magnetic platform driven by a co-planar electromagnetic\ncoil. While these actuators offer a large motion range and high positioning\nresolution, their actuation bandwidth is limited due to relatively small\nelectromagnetic stiffness. We report optimization of the design parameters of\nthe electromagnetic coil and the magnetic assembly to maximize the\nelectromagnetic force and stiffness. Firstly, we derive closed-form expressions\nfor the electromagnetic forces and stiffness, which enable us to express these\nquantities in terms of the design parameters of the actuator. Secondly, based\non these derived expressions, we estimate the optimum values of the design\nparameters to maximize force and stiffness. Notably, for the optimum design\nparameters, the force and stiffness per unit volume can be increased by two and\nthree orders of magnitude, respectively by reducing the pitch of the\nelectromagnetic coil by a factor of 10. Lastly, we develop an electromagnetic\nactuator and evaluate its performance using a Microelectromechanical system\n(MEMS) based force sensor. By operating the force sensor in a feedback loop, we\nprecisely measure the generated electromagnetic forces for different design\nparameters of the actuator. The experimental results obtained align closely\nwith the analytical values, with an error of less than 15%.",
    "authors": [
      "K. S. Vikrant",
      "D. Dadkhah",
      "S. O. Reza Moheimani"
    ],
    "publication_date": "2024-02-21T00:09:41Z",
    "arxiv_id": "http://arxiv.org/abs/2402.13436v2",
    "download_url": "http://arxiv.org/abs/2402.13436v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "More Nonlinearities? Electromagnetic and Gravitational Mode Mixing in\n  NSBH Mergers",
    "abstract": "We investigate the possibility of electromagnetic fields leaving imprints on\ngravitational wave (GW) signals from Neutron Star-Black hole (NSBH) mergers,\nspecifically in the context of extreme mass ratio inspirals (EMRIs). Using\nblack hole perturbation theory (BHPT) in the context of a minimally coupled\nEinstein-Maxwell system, we demonstrate that electromagnetic quasi normal\nmodes(QNMs) can excite gravitational QNMs with frequencies that are linear or\nquadratic in the electromagnetic QNMs, at first level of mixing. Moreover, We\nthen study the electromagnetism-gravity coupling by approximating the\nRegge-Wheeler and Zerilli potentials with Dirac delta functions. In this\nexample, we examine gravitational perturbations induced by the electromagnetic\nfield of an ideal dipole radially free fall towards the blackhole, building on\ncalculations from a companion paper [1]. Our results show that both linear and\nquadratic electromagnetic QNMs appear in gravitational perturbations. In\naddition, linear gravitational QNMs are also excited due to the electromagnetic\nsource, with their amplitudes depending on the details of the electromagnetic\nand gravitational potentials, analogous to gravitational mode mixing analysis.\nFurthermore, at late stages, gravitational perturbations might exhibit\npolynomial tails induced by electromagnetic perturbations. This article sets\nthe stage for future numerical investigations aimed at identifying such modes\nin various scenarios.",
    "authors": [
      "Fawzi Aly",
      "Mahmoud A. Mansour",
      "Dejan Stojkovic"
    ],
    "publication_date": "2024-10-16T17:50:04Z",
    "arxiv_id": "http://arxiv.org/abs/2410.12775v2",
    "download_url": "http://arxiv.org/abs/2410.12775v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A computational approach for the study of electromagnetic interactions\n  in reacting flows",
    "abstract": "A computational fluid dynamics methodology for the simulation of\nelectromagnetic interactions in compressible reacting flows has been\nformulated. The developed code, named EMI, is based on the SENGA Direct\nNumerical Simulation (DNS) software. Static electric and magnetic fields are\nsolved using Gauss's laws of Maxwell's equations. Electromagnetic wave\npropagation is solved by discretizing Ampere's and Faraday's equations using\nthe explicit Finite-Difference Time-Domain (FDTD) method. The equations for the\nelectromagnetic fields are fully coupled with the Navier-Stokes equations, such\nthat interactions between the electromagnetic fields and the fluid are included\nin the formulation. The interaction terms include the Lorentz, polarization,\nand magnetization forces. These forces determine volume forces that affect the\ntransport of momentum, the diffusion velocity, and the energy conservation\nequations. In addition, the medium's properties affect the propagation of the\nelectromagnetic fields via electrical permittivity and conductivity, charge\ndensity, and magnetic permeability. The solution of electromagnetic fields is\nvalidated against analytical and numerical solutions. The implementation of the\ncoupling between electromagnetic fields and conservation equations for species,\nenergy, and momentum is validated with laminar reacting flow numerical\nsolutions from the literature. The capabilities of the formulation are\ninvestigated for a range of laminar methane-air computations under\nelectrostatic, magnetostatic, and high-frequency electromagnetic waves. The\nvalidity of the electrostatic formulation in the presence of currents related\nto the movement of charged species is also assessed. Results demonstrate that\nEMI-SENGA can capture the fundamental effects of electromagnetic fields on\nreacting flows and the dynamics of charged species and their effect on flame\nshape and reactivity.",
    "authors": [
      "Efstratios M. Kritikos",
      "Stewart Cant",
      "Andrea Giusti"
    ],
    "publication_date": "2025-05-09T21:07:07Z",
    "arxiv_id": "http://arxiv.org/abs/2505.06433v1",
    "download_url": "http://arxiv.org/abs/2505.06433v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Outflows and GRBs",
    "abstract": "We study the dynamics of relativistic electromagnetic explosions as a\npossible mechanism for the production of Gamma-Ray Bursts. We propose that a\nrotating relativistic stellar-mass progenitor loses much of its spin energy in\nthe form of an electromagnetically-dominated outflow.\n  After the flow becomes optically thin, it forms a relativistically expanding,\nnon-spherically symmetric magnetic bubble - a ''cold fireball''. We analyze the\nstructure and dynamics of such a cavity in the force-free approximation. During\nrelativistic expansion, most of the magnetic energy in the bubble is\nconcentrated in a thin shell near its surface (contact discontinuity). We\nsuggest that either the polar current or the shell currents become unstable to\nelectromagnetic instabilities at a radius $\\sim10^{16}$ cm. This leads to\nacceleration of pairs and causes the $\\gamma$-ray emission. At a radius\n$\\sim10^{17}$ cm, the momentum contained in the electromagnetic shell will have\nbeen largely transferred to the surrounding blast wave propagating into the\ncircumstellar medium. Particles accelerated at the fluid shock may combine with\nelectromagnetic field from the electromagnetic shell to produce the afterglow\nemission.",
    "authors": [
      "Maxim Lyutikov",
      "Roger Blandford"
    ],
    "publication_date": "2002-10-30T23:04:50Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0210671v1",
    "download_url": "http://arxiv.org/abs/astro-ph/0210671v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Induction and the Conservation of Momentum in the Spiral\n  Paradox",
    "abstract": "The inversion of cause and effect in the classic description of\nelectromagnetism, gives rise to a conceptual error which is at the bottom of\nmany paradoxes and exceptions. At present, the curious fact that unipolar\ninduction or the Faraday Disc constitutes an exception to the Faraday induction\nlaw is generally accepted. When we establish the correct cause and effect\nrelationship a close connection appears between mechanics and electromagnetism,\nas does a new induction law for which paradoxes or exceptions do not occur.\nSome paradoxical experiments in unipolar induction involving the unique\ngeometry of the spiral are described demonstrating the inversion of cause and\neffect. The emf and torque of the Faraday Disc and the conducting spiral is due\nto the continuous variation of the electromagnetic angular moment of the\ncontinuous current. This experiments confirm the Lorentz Force and invalidate\nFaradays Induction Law. They show how in a closed circuit emf and unipolar\ntorque are not produced by the variation in magnetic flux, which is constant,\nbut by two variations in the electromagnetic angular moment. The three possible\nways of varying the electromagnetic angular moment generated by the circulation\nof the charges gives rise to the different forms of electromagnetic induction.",
    "authors": [
      "Albert Serra"
    ],
    "publication_date": "2000-12-05T22:07:27Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0012009v1",
    "download_url": "http://arxiv.org/abs/physics/0012009v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Particle acceleration through the resonance of high magnetic field and\n  high frequency electromagnetic wave",
    "abstract": "We propose a new particle acceleration mechanism. Electron can be accelerated\nto relativistic energy within a few electromagnetic wave cycles through the\nmechanism which is named electromagnetic and magnetic field resonance\nacceleration (EMRA). We find that the electron acceleration depends not only on\nthe electromagnetic wave intensity, but also on the ratio between electron\nLarmor frequency and electromagnetic wave frequency. As the ratio approaches to\nunity, a clear resonance peak is observed, corresponding to the EMRA. Near the\nresonance regime, the strong magnetic fields still affect the electron\nacceleration dramatically. We derive an approximate analytical solution of the\nrelativistic electron energy in adiabatic limit, which provides a full\nunderstanding of this phenomenon. In typical parameters of pulsar\nmagnetospheres, the mechanism allows particles to increase their energies\nthrough the resonance of high magnetic field and high frequency electromagnetic\nwave in each electromagnetic wave period. The energy spectra of the accelerated\nparticles exhibit the synchrotron radiation behavior. These can help to\nunderstand the remaining emission of high energy electron from radio pulsar\nwithin supernova remnant. The other potential application of our theory in fast\nignition scheme of inertial confinement fusion is also discussed.",
    "authors": [
      "Hong Liu",
      "X. T. He",
      "S. G. Chen",
      "W. Y. Zhang"
    ],
    "publication_date": "2004-11-19T15:01:46Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0411183v1",
    "download_url": "http://arxiv.org/abs/physics/0411183v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Perfect electromagnetic conductor",
    "abstract": "In differential-form representation, the Maxwell equations are represented by\nsimple differential relations between the electromagnetic two-forms and source\nthree-forms while the electromagnetic medium is defined through a constitutive\nrelation between the two-forms. The simplest of such relations expresses the\nelectromagnetic two-forms as scalar multiples of one another. Because of its\nstrange properties, the corresponding medium has been considered as\nnonphysical. In this study such a medium is interpreted in terms of the\nclassical Gibbsian vectors as a bi-isotropic medium with infinite values for\nits four medium parameters. It is shown that the medium is a generalization of\nboth PEC (perfect electric conductor) and PMC (perfect magnetic conductor)\nmedia, with similar properties. This is why the medium is labeled as PEMC\n(perfect electromagnetic conductor). Defining a certain class of duality\ntransformations, PEMC medium can be transformed to PEC or PMC media. As an\napplication, plane-wave reflection from a planar interface of air and PEMC\nmedium is studied. It is shown that, in general, the reflected wave has a\ncross-polarized component, which is a manifestly nonreciprocal effect.",
    "authors": [
      "Ismo V. Lindell",
      "Ari Sihvola"
    ],
    "publication_date": "2005-03-31T12:10:12Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0503232v1",
    "download_url": "http://arxiv.org/abs/physics/0503232v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A defect of the electromagnetism and it serves as a hidden variable for\n  quantum mechanics",
    "abstract": "According to the theory of relativity, the 4-vector force acting on a\nparticle is orthogonal to the 4-vector velocity of the particle, but we found\nthat the electromagnetic force of the Maxwell's theory can not completely\nsatisfy this orthogonality, this incompletion leads us to find that the\nelectromagnetic force has two independent components in the 4 dimensional space\ntime. A 4-vector force has 4 components, because of the orthogonality of\n4-vector force and 4-vector velocity, the number of independent components of\nthe force reduces to 3, while the electromagnetic force can merely provide 2\nindependent components, this situation means that there is an undefined\ncomponent accompanying the electromagnetic force. This missing undefined\ncomponent may serve as a hidden variable which quantum mechanics is eager to\nfind for a long time. The primary purpose of this paper is to strictly proof\nthat the electromagnetic force has two independent components in the 4\ndimensional space time. We also briefly discuss the possibility that the\nundefined component of the electromagnetic force serves as a hidden variable\nfor quantum mechanics.",
    "authors": [
      "Huai-yang Cui"
    ],
    "publication_date": "2006-03-12T13:46:28Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0603091v2",
    "download_url": "http://arxiv.org/abs/physics/0603091v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Binary black holes' effects on electromagnetic fields",
    "abstract": "In addition to producing gravitational waves (GW), the dynamics of a binary\nblack hole system could induce emission of electromagnetic (EM) radiation by\naffecting the behavior of plasmas and electromagnetic fields in their vicinity.\nWe here study how the electromagnetic fields are affected by a pair of orbiting\nblack holes through the merger. In particular, we show how the binary's\ndynamics induce a variability in possible electromagnetically induced emissions\nas well as a possible enhancement of electromagnetic fields during the\nlate-merge and merger epochs. These time dependent features will likely leave\ntheir imprint in processes generating detectable emissions and can be exploited\nin the detection of electromagnetic counterparts of gravitational waves.",
    "authors": [
      "Carlos Palenzuela",
      "Matthew Anderson",
      "Luis Lehner",
      "Steven L. Liebling",
      "David Neilsen"
    ],
    "publication_date": "2009-05-08T13:39:23Z",
    "arxiv_id": "http://arxiv.org/abs/0905.1121v2",
    "download_url": "http://arxiv.org/abs/0905.1121v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic mass differences of SU(3) baryons within a chiral\n  soliton model",
    "abstract": "We investigate the electromagnetic mass differences of SU(3) baryons, using\nan \"model-independent approach\" within a chiral soliton model. The\nelectromagnetic self-energy corrections to the masses of the baryon are\nexpressed as the baryonic two-point correlation function of the electromagnetic\ncurrents. Using the fact that the electromagnetic current can be treated as an\noctet operator, and considering possible irreducible representations of the\ncorrelation function, we are able to construct a general collective operator\nfor the electromagnetic self-energies, which consists of three unknown\nparameters. These parameters are fixed, the empirical data for the\nelectromagnetic mass differences of the baryon octet being employed. We predict\nthose of the baryon decuplet and antidecuplet. In addition, we obtain various\nmass relations between baryon masses within the corresponding representation\nwith isospin symmetry breaking considered. We also predict the physical mass\ndifferences of the baryon decuplet. The results are in good agreement with the\nexisiting data.",
    "authors": [
      "Ghil-Seok Yang",
      "Hyun-Chul Kim",
      "Maxim V. Polyakov"
    ],
    "publication_date": "2010-09-27T13:21:35Z",
    "arxiv_id": "http://arxiv.org/abs/1009.5250v2",
    "download_url": "http://arxiv.org/abs/1009.5250v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Division of the Energy and of the Momentum of Electromagnetic Waves in\n  Linear Media into Electromagnetic and Material Parts",
    "abstract": "We defend a natural division of the energy density, energy flux and momentum\ndensity of electromagnetic waves in linear media in electromagnetic and\nmaterial parts. In this division, the electromagnetic part of these quantities\nhave the same form as in vacuum when written in terms of the macroscopic\nelectric and magnetic fields, the material momentum is calculated directly from\nthe Lorentz force that acts on the charges of the medium, the material energy\nis the sum of the kinetic and potential energies of the charges of the medium\nand the material energy flux results from the interaction of the electric field\nwith the magnetized medium. We present reasonable models for linear dispersive\nnon-absorptive dielectric and magnetic media that agree with this division. We\nalso argue that the electromagnetic momentum of our division can be associated\nwith the electromagnetic relativistic momentum, inspired on the recent work of\nBarnett [Phys. Rev. Lett. 104, 070401 (2010)] that showed that the Abraham\nmomentum is associated with the kinetic momentum and the Minkowski momentum is\nassociated with the canonical momentum.",
    "authors": [
      "Pablo L. Saldanha"
    ],
    "publication_date": "2011-02-02T16:59:00Z",
    "arxiv_id": "http://arxiv.org/abs/1102.0491v1",
    "download_url": "http://arxiv.org/abs/1102.0491v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic follow-up of gravitational wave transient signal\n  candidates",
    "abstract": "Pioneering efforts aiming at the development of multi-messenger gravitational\nwave and electromagnetic astronomy have been made. An electromagnetic\nobservation follow-up program of candidate gravitational wave events has been\nperformed (Dec 17 2009 to Jan 8 2010 and Sep 4 to Oct 20 2010) during the\nrecent runs of the LIGO and Virgo gravitational wave detectors. It involved\nground-based and space electromagnetic facilities observing the sky at optical,\nX-ray and radio wavelengths. The joint gravitational wave and electromagnetic\nobservation study requires the development of specific image analysis\nprocedures able to discriminate the possible electromagnetic counterpart of\ngravitational wave triggers from contaminant/background events. The paper\npresents an overview of the electromagnetic follow-up program and the image\nanalysis procedures.",
    "authors": [
      "M. Branchesi"
    ],
    "publication_date": "2012-02-20T19:02:12Z",
    "arxiv_id": "http://arxiv.org/abs/1202.4421v1",
    "download_url": "http://arxiv.org/abs/1202.4421v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gravito-electromagnetic resonances in Minkowski space",
    "abstract": "We consider the interaction between gravitational and electromagnetic\nradiation propagating on a Minkowski background and look into the effects of\nthe former upon the latter. Not surprisingly, the coupling between these two\nsources leads to gravitationally driven electromagnetic waves. At the second\nperturbative level, the driving force appears as the superposition of two\nwaves, the properties of which are decided by the initial conditions. We find\nthat the Weyl-Maxwell interaction typically leads to electromagnetic beat-like\nsignals and, in some cases, to the resonant amplification of the driven\nelectromagnetic wave. For physically reasonable initial conditions, we show\nthat these resonances imply a linear (in time) growth for the amplitude of the\nelectromagnetic signal, with the overall amplification also depending on the\nstrength of the driving gravity wave. Finally, we provide order-of-magnitude\nestimates of the achieved amplification by applying our analysis to\nastrophysical environments where both gravitational and electromagnetic waves\nare expected to coexist.",
    "authors": [
      "Alexandros P. Kouretsis",
      "Christos G. Tsagas"
    ],
    "publication_date": "2013-06-26T13:01:27Z",
    "arxiv_id": "http://arxiv.org/abs/1306.6227v3",
    "download_url": "http://arxiv.org/abs/1306.6227v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Macroscopic electromagnetic response of metamaterials with toroidal\n  resonances",
    "abstract": "Toroidal dipole, first described by Ia. B. Zeldovich [Sov. Phys. JETP 33,\n1184 (1957)], is a distinct electromagnetic excitation that differs both from\nthe electric and the magnetic dipoles. It has a number of intriguing\nproperties: static toroidal nuclear dipole is responsible for parity violation\nin atomic spectra; interactions between static toroidal dipole and oscillating\nmagnetic dipole are claimed to violate Newton's Third Law while non-stationary\ncharge-current configurations involving toroidal multipoles have been predicted\nto produce vector potential in the absence of electromagnetic fields. Existence\nof the toroidal response in metamaterials was recently demonstrated and is now\na growing field of research. However, no direct analytical link has yet been\nestablished between the transmission and reflection of macroscopic\nelectromagnetic media and toroidal dipole excitations. To address this\nessential gap in electromagnetic theory we have developed an analytical\napproach linking microscopic and macroscopic electromagnetic response of a\nmetamaterial and showed, using a case study, the key role of the toroidal\ndipole in shaping the electromagnetic properties of the metamaterial.",
    "authors": [
      "V. Savinov",
      "V. A. Fedotov",
      "N. I. Zheludev"
    ],
    "publication_date": "2013-10-01T00:32:00Z",
    "arxiv_id": "http://arxiv.org/abs/1310.0106v1",
    "download_url": "http://arxiv.org/abs/1310.0106v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Properties of electrons scattered on a strong plane electromagnetic wave\n  with a linear polarization: classical treatment",
    "abstract": "The relations among the components of the exit momenta of ultrarelativistic\nelectrons scattered on a strong electromagnetic wave of a low (optical)\nfrequency and linear polarization are established using the exact solutions to\nthe equations of motion with radiation reaction included (the Landau-Lifshitz\nequation). It is found that the momentum components of the electrons traversed\nthe electromagnetic wave depend weakly on the initial values of the momenta.\nThese electrons are mostly scattered at the small angles to the direction of\npropagation of the electromagnetic wave. The maximum Lorentz factor of the\nelectrons crossed the electromagnetic wave is proportional to the work done by\nthe electromagnetic field and is independent of the initial momenta. The\nmomentum component parallel to the electric field strength vector of the\nelectromagnetic wave is determined only by the diameter of the laser beam\nmeasured in the units of the classical electron radius. As for the reflected\nelectrons, they for the most part lose the energy, but remain relativistic.\nThere is a reflection law for these electrons that relates the incident and the\nreflection angles and is independent of any parameters.",
    "authors": [
      "O. V. Bogdanov",
      "P. O. Kazinski"
    ],
    "publication_date": "2014-09-06T07:05:27Z",
    "arxiv_id": "http://arxiv.org/abs/1409.1990v1",
    "download_url": "http://arxiv.org/abs/1409.1990v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gauge Theory of the Gravitational-Electromagnetic Field",
    "abstract": "We develop a gauge theory of the combined gravitational-electromagnetic field\nby expanding the Poincar\\'e group to include clock synchronization\ntransformations. We show that the electromagnetic field can be interpreted as a\nlocal gauge theory of the synchrony group. According to this interpretation,\nthe electromagnetic field equations possess nonlinear terms and electromagnetic\ngauge transformations acquire a space-time interpretation as local synchrony\ntransformations. The free Lagrangian for the fields leads to the usual\nEinstein-Maxwell field equations with additional gravitational-electromagnetic\ncoupling terms. The connection between the electromagnetic field and the\ninvariance properties of the Lagrangian under clock synchronization\ntransformations provides a strong theoretical argument in favor of the thesis\nof the conventionality of simultaneity. This suggests that clock\nsynchronization invariance (or equivalently, invariance under transformations\nof the one-way speed of light) is a fundamental invariance principle of\nphysics.",
    "authors": [
      "Robert D. Bock"
    ],
    "publication_date": "2015-05-15T17:29:45Z",
    "arxiv_id": "http://arxiv.org/abs/1505.04133v2",
    "download_url": "http://arxiv.org/abs/1505.04133v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Implementation of General Background Electromagnetic Fields on a\n  Periodic Hypercubic Lattice",
    "abstract": "Nonuniform background electromagnetic fields, once implemented in lattice\nquantum chromodynamics calculations of hadronic systems, provide a means to\nconstrain a large class of electromagnetic properties of hadrons and nuclei,\nfrom their higher electromagnetic moments and charge radii to their\nelectromagnetic form factors. We show how nonuniform fields can be constructed\non a periodic hypercubic lattice under certain conditions and determine the\nprecise form of the background U(1) gauge links that must be imposed on the\nquantum chromodynamics gauge-field configurations to maintain periodicity. Once\nsupplemented by a set of quantization conditions on the background-field\nparameters, this construction guarantees that no nonuniformity occurs in the\nhadronic correlation functions across the boundary of the lattice. The special\ncases of uniform electric and magnetic fields, a nonuniform electric field that\nvaries linearly in one spatial coordinate (relevant to the determination of\nquadruple moment and charge radii), nonuniform electric and magnetic fields\nwith given temporal and spatial dependences (relevant to the determination of\nnucleon spin polarizabilities) and plane-wave electromagnetic fields (relevant\nto the determination of electromagnetic form factors) are discussed explicitly.",
    "authors": [
      "Zohreh Davoudi",
      "William Detmold"
    ],
    "publication_date": "2015-07-07T18:09:38Z",
    "arxiv_id": "http://arxiv.org/abs/1507.01908v1",
    "download_url": "http://arxiv.org/abs/1507.01908v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Knotted solutions for linear and nonlinear theories: electromagnetism\n  and fluid dynamics",
    "abstract": "We examine knotted solutions, the most simple of which is the \"Hopfion\", from\nthe point of view of relations between electromagnetism and ideal fluid\ndynamics. A map between fluid dynamics and electromagnetism works for initial\nconditions or for linear perturbations, allowing us to find new knotted fluid\nsolutions. Knotted solutions are also found to to be solutions of nonlinear\ngeneralizations of electromagnetism, and of quantum-corrected actions for\nelectromagnetism coupled to other modes. For null configurations,\nelectromagnetism can be described as a null pressureless fluid, for which we\ncan find solutions from the knotted solutions of electromagnetism. We also map\nthem to solutions of Euler's equations, obtained from a type of nonrelativistic\nreduction of the relativistic fluid equations.",
    "authors": [
      "Daniel F. W. Alves",
      "Carlos Hoyos",
      "Horatiu Nastase",
      "Jacob Sonnenschein"
    ],
    "publication_date": "2017-05-18T18:00:31Z",
    "arxiv_id": "http://arxiv.org/abs/1705.06750v2",
    "download_url": "http://arxiv.org/abs/1705.06750v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modal expansions in dispersive material systems with application to\n  quantum optics and topological photonics",
    "abstract": "It is proven that in the lossless case the electrodynamics of a generic\ninhomogeneous possibly bianisotropic and nonreciprocal system may be described\nby an augmented state-vector whose time evolution is determined by a Hermitian\noperator. As a consequence, it is shown that a generic electromagnetic field\ndistribution can be expanded into a complete set of normal modes that satisfy\ngeneralized orthogonality relations. Importantly, the modal expansions in\ndispersive systems are not unique because the electromagnetic degrees of\nfreedom span only part of the entire Hilbert space. The developed theory is\nused to obtain a modal expansion of the system Green's function.\n  Furthermore, it is highlighted that the Hermitian-type formulation of the\ndispersive Maxwell's equations enables one to extend the powerful ideas of\ntopological photonics to a wide range of electromagnetic systems and to\ncharacterize electromagnetic topological phases. In addition, we illustrate how\nthe developed formalism can be applied to quantum optics. We present a simple\nprocedure to quantize the electromagnetic field in a generic bianisotropic and\nnonreciprocal cavity and derive the quantum correlations of the electromagnetic\nfields.",
    "authors": [
      "Mario G. Silveirinha"
    ],
    "publication_date": "2017-12-12T13:01:29Z",
    "arxiv_id": "http://arxiv.org/abs/1712.04272v2",
    "download_url": "http://arxiv.org/abs/1712.04272v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic fields in a time-varying medium: Exceptional points and\n  operator symmetries",
    "abstract": "In this paper, we study the interactions of electromagnetic waves with a\nnon-dispersive dynamic medium that is temporally dependent. Electromagnetic\nfields under material time-modulation conserve their momentum but not their\nenergy. We assume a time-variation of the permittivity, permeability and\nconductivity and derive the appropriate time-domain solutions based on the\ncausality state at a past observation time. We formulate a time-transitioning\nstate matrix and connect the unusual energy transitions of electromagnetic\nfields in time-varying media with the exceptional point theory. This\nstate-matrix approach allows us to analyze further the electromagnetic waves in\nterms of parity and time-reversal symmetries and signify parity-time symmetric\nwave-states without the presence of a spatially symmetric distribution of gain\nand loss, or any inhomogeneities and material periodicity. This paper provides\na useful arsenal to study electromagnetic wave phenomena under time-varying\nmedia and points out novel physical insights connecting the resulting energy\ntransitions and electromagnetic modes with exceptional point physics and\noperator symmetries.",
    "authors": [
      "Theodoros T. Koutserimpas",
      "Romain Fleury"
    ],
    "publication_date": "2020-03-06T13:28:52Z",
    "arxiv_id": "http://arxiv.org/abs/2003.03188v2",
    "download_url": "http://arxiv.org/abs/2003.03188v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Amplitudes separation and strong-electromagnetic relative phase in the\n  $ψ(2S)$ decays into baryons",
    "abstract": "The strong, electromagnetic and mixed strong-electromagnetic amplitudes of\nthe $\\psi(2S)$ decays into baryon-anti-baryon pairs have been obtained by\nexploiting all available data sets in the framework of an effective Lagrangian\nmodel. We observed that at the $\\psi(2S)$ mass the QCD regime is not completely\nperturbative, as can be inferred by the relative strength of the strong and the\nmixed strong-electromagnetic amplitudes. Recently a similar conclusion has been\nreached also for the $J/\\psi$ decays. The relative phase between the strong and\nthe electromagnetic amplitudes is $\\varphi = (58\\pm 8)^\\circ$, to be compared\nwith $\\varphi = (73\\pm 8)^\\circ$ obtained for the $J/\\psi$. On the other hand,\nin the case of the $\\psi(2S)$ meson, different values of the ratio between\nstrong and mixed strong-electromagnetic amplitudes are phenomenologically\nrequired, while for the $J/\\psi$ meson only one ratio was enough to describe\nthe data. Finally, we also observed a peculiar behavior of the mixed\nstrong-electromagnetic amplitudes of the decays $\\psi(2S)\\to\\Sigma^+ \\overline\n\\Sigma{}^-$ and $\\psi(2S)\\to\\Sigma^- \\overline \\Sigma{}^+$.",
    "authors": [
      "Rinaldo Baldini Ferroli",
      "Alessio Mangoni",
      "Simone Pacetti",
      "Kai Zhu"
    ],
    "publication_date": "2020-05-22T16:34:37Z",
    "arxiv_id": "http://arxiv.org/abs/2005.11265v1",
    "download_url": "http://arxiv.org/abs/2005.11265v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Theoretical proposal for the experimental realisation of a monochromatic\n  electromagnetic knot",
    "abstract": "We propose an antenna designed to generate monochromatic electromagnetic\nknots and other \"unusual electromagnetic disturbances\" in the microwave domain.\nOur antenna is a spherical array of radiating dipolar elements configured to\napproximate the desired electromagnetic field near its centre. We show\nnumerically that a specific embodiment of the antenna with a radius of 61.2 cm\nand only 20 element pairs driven at a frequency of 2.45 GHz can yield linked\nand torus-knotted electric and magnetic field lines approximating those of an\n\"electromagnetic tangle\": a monochromatic electromagnetic knot closely related\nto the well-known Ra\\~nada-Hopf type electromagnetic knots but simpler in its\nconstruction. The antenna could be used to locally excite plasmas.",
    "authors": [
      "R. P. Cameron",
      "W. Löffler",
      "K. D. Stephan"
    ],
    "publication_date": "2021-01-22T11:12:53Z",
    "arxiv_id": "http://arxiv.org/abs/2101.10108v2",
    "download_url": "http://arxiv.org/abs/2101.10108v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relational electromagnetism and the electromagnetic force",
    "abstract": "The force exerted by an electromagnetic body on another body in relative\nmotion, and its minimal expression, the force on moving charges or\n\\emph{Lorentz' force} constitute the link between electromagnetism and\nmechanics. Expressions for the force were produced first by Maxwell and later\nby H. A. Lorentz, but their expressions disagree. The construction process was\nthe result, in both cases, of analogies rooted in the idea of the ether. Yet,\nthe expression of the force has remained despite its production context. We\npresent a path to the electromagnetic force that starts from Ludwig Lorenz'\nrelational electromagnetism. The present mathematical abduction does not rest\non analogies. Following this path we show that relational electromagnetism, as\npursued by the G\\\"ottingen school, is consistent with Maxwell's transformation\nlaws and compatible with the idea that the \"speed of light\" takes the same\nvalue in all (inertial) frames of reference, while it cannot be conceived on\nthe basis of analogies with material motion.",
    "authors": [
      "M. A. Natiello",
      "Hernán G Solari"
    ],
    "publication_date": "2021-02-25T15:53:37Z",
    "arxiv_id": "http://arxiv.org/abs/2102.13108v2",
    "download_url": "http://arxiv.org/abs/2102.13108v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Long time behavior of nonlinear electromagnetic wave in vacuum beyond\n  linear approximation",
    "abstract": "A quantum nature of vacuum is expected to affect electromagnetic fields in\nvacuum as a nonlinear correction, yielding nonlinear Maxwell's equations. We\nextend the finite-difference time-domain (FDTD) method in the case that the\nnonlinear electromagnetic Lagrangian is quartic with respect to the electric\nfield and magnetic flux density. With this extension, the nonlinear Maxwell's\nequations can be numerically solved without making any assumptions on the\nelectromagnetic field. We demonstrate examples of self-modulations of nonlinear\nelectromagnetic waves in a one-dimensional cavity, in particular, in a time\nscale beyond an applicable range of linear approximation. A momentarily small\nnonlinear correction can accumulate and a comparably large self-modulation can\nbe achieved in a long time scale even though the electromagnetic field is not\nextremely strong. Further, we analytically approximate the nonlinear\nelectromagnetic waves in the cavity and clarify the characteristics, for\nexample, how an external magnetic flux density changes the self-modulations of\nphase and polarization.",
    "authors": [
      "Kazunori Shibata"
    ],
    "publication_date": "2021-06-21T07:20:27Z",
    "arxiv_id": "http://arxiv.org/abs/2106.10892v2",
    "download_url": "http://arxiv.org/abs/2106.10892v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fluid-electromagnetic helicities and knotted solutions of the\n  fluid-electromagnetic equations",
    "abstract": "In this paper we consider an Euler fluid coupled to external\nelectromagnetism. We prove that the Hopfion fluid-electromagnetic knot,\ncarrying fluid and electromagnetic (EM) helicities, solves the fluid dynamical\nequations as well as the Abanov Wiegmann (AW) equations for helicities, which\nare inspired by the axial-current anomaly of a Dirac fermion. We also find a\nnontrivial knot solution with truly interacting fluid and electromagnetic\nfields. The key ingredients of these phenomena are the EM and fluid helicities.\nAn EM dual system, with a magnetically charged fluid, is proposed and the\nanalogs of the AW equations are written down. We consider a fluid coupled to a\nnonlinear generalizations for electromagnetism. The Hopfions are shown to be\nsolutions of the generalized equations. We write down the formalism of fluids\nin 2+1 dimensions, and we dimensionally reduce the 3+1 dimensional solutions.\nWe determine the EM knotted solutions, from which we derive the fluid knots, by\napplying special conformal transformations with imaginary parameters on\nun-knotted null constant EM fields.",
    "authors": [
      "Horatiu Nastase",
      "Jacob Sonnenschein"
    ],
    "publication_date": "2022-05-20T19:11:40Z",
    "arxiv_id": "http://arxiv.org/abs/2205.10415v2",
    "download_url": "http://arxiv.org/abs/2205.10415v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Supertoroidal light pulses: Propagating electromagnetic skyrmions in\n  free space",
    "abstract": "Topological structures of electromagnetic fields could give access to\nnontrivial light-matter interactions and additional degrees of freedom for\ninformation and energy transfer. A characteristic example of such\nelectromagnetic excitations are space-time non-separable single-cycle pulses,\nthe exact solutions of Maxwell equation of toroidal topology predicted by\nHellwarth and Nouchi in 1996 and recently observed experimentally. Here we\nintroduce a new family of electromagnetic excitation of toroidal topology with\nincreasing complexity in which the Hellwarth-Nouchi pulse is just the simplest\nmember. The electromagnetic excitations of the new family can be parametrised\nby a single real number and exhibit skyrmionic structures of various orders.\nThey feature multiple singularities in the electromagnetic and Poynting vector\nfields are accompanied by the fractal-like distributions of energy backflow.\nThe generalized family of toroidal electromagnetic excitation with salient\ntopologies are of interest for transient light-matter interactions, ultrafast\noptics, spectroscopy, and toroidal electrodynamics.",
    "authors": [
      "Yijie Shen",
      "Yaonan Hou",
      "Nikitas Papasimakis",
      "Nikolay I. Zheludev"
    ],
    "publication_date": "2021-03-15T14:59:54Z",
    "arxiv_id": "http://arxiv.org/abs/2103.08431v2",
    "download_url": "http://arxiv.org/abs/2103.08431v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Disguised Electromagnetic Connections in Classical Electron Theory",
    "abstract": "In the first quarter of the 20th century, physicists were not aware of the\nexistence of classical electromagnetic zero-point radiation nor of the\nimportance of special relativity. Inclusion of these aspects allows classical\nelectron theory to be extended beyond its 19th century successes. Here we\nreview spherical electromagnetic radiation modes in a conducting-walled\nspherical cavity and connect these modes to classical electromagnetic\nzero-point radiation and to electromagnetic scale invariance. Then we turn to\nthe scattering of radiation in classical electron theory within a simple\napproximation. We emphasize that, in steady-state, the interaction between\nmatter and radiation is disguised so that the mechanical motion appears to\noccur without the emission of radiation, even though the particle motion is\nactually driven by classical electromagnetic radiation. It is pointed out that,\nfor nonrelativistic particles, only the harmonic oscillator potential taken in\nthe low-velocity limit allows a consistent equilibrium with classical\nelectromagnetic zero-point radiation. For relativistic particles, only the\nCoulomb potential is consistent with electrodynamics. The classical analysis\nplaces restrictions on the value of $e^{2}/\\hbar c$.",
    "authors": [
      "Timothy H. Boyer"
    ],
    "publication_date": "2021-12-11T18:49:01Z",
    "arxiv_id": "http://arxiv.org/abs/2112.07358v1",
    "download_url": "http://arxiv.org/abs/2112.07358v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic fields in ultra-peripheral relativistic heavy-ion\n  collisions",
    "abstract": "Ultraperipheral heavy-ion collisions (UPCs) offer unique opportunities to\nstudy processes under strong electromagnetic fields. In these collisions,\nhighly charged fast-moving ions carry strong electromagnetic fields that can be\neffectively treated as photon fluxes. The exchange of photons can induce\nphotonuclear and two-photon interactions, and excite ions. This excitation of\nthe ions results in Coulomb dissociation with the emission of photons,\nneutrons, and other particles. Additionally, the electromagnetic fields\ngenerated by the ions can be sufficiently strong to enforce mutual interactions\nbetween the two colliding ions. Consequently, the two colliding ions\nexperienced an electromagnetic force that pushed them in opposite directions,\ncausing a back-to-back correlation in the emitted neutrons. Using a Monte Carlo\nsimulation, we qualitatively demonstrated that the above electromagnetic effect\nis large enough to be observed in UPCs, which would provide a clear means to\nstudy strong electromagnetic fields and their effects.",
    "authors": [
      "Jie Zhao",
      "Jinhui Chen",
      "Xu-Guang Huang",
      "Yu-Gang Ma"
    ],
    "publication_date": "2022-11-08T02:56:30Z",
    "arxiv_id": "http://arxiv.org/abs/2211.03968v2",
    "download_url": "http://arxiv.org/abs/2211.03968v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Metal Mesh-Based Infrared Transparent Electromagnetic Shielding Windows\n  with Balanced Shielding Properties over a Wide Frequency Range",
    "abstract": "With the increasing complexity of the electromagnetic environment,\nelectromagnetic interference has already been an important problem for\noptoelectronic systems to be reckoned with. The metal mesh film is a kind of\nwidely used electromagnetic shielding material with both visible and infrared\ntransparency. However, the shielding performance of previously reported mesh\nmaterials is frequency dependent. Here, we report an infrared-transparent\nelectromagnetic shielding windows based on metal mesh with irregular patterns.\nThe mesh coatings are prepared on sapphire substrate using ultraviolet\nphotolithography technology, and provide efficient electromagnetic shielding\neffectiveness of more than 20 dB in the wide frequency range of 1.7~18 GHz\nwhile maintaining high infrared optical transparency. In addition, there is no\ndistinct variation in shielding effectiveness between low and high frequency\nrange, exhibiting a balanced shielding characteristic throughout a broad\nfrequency band. This work could be significant in protecting infrared\noptoelectronic devices from electromagnetic interference.",
    "authors": [
      "Yuanlong Liang",
      "Kui Wen",
      "Zhaofeng Wu",
      "Jisheng Pan",
      "Wencong Liu",
      "Lixiang Yao",
      "Peiguo Liu",
      "Xianjun Huang"
    ],
    "publication_date": "2022-12-08T14:51:28Z",
    "arxiv_id": "http://arxiv.org/abs/2212.04304v1",
    "download_url": "http://arxiv.org/abs/2212.04304v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interaction between linear polarized plane gravitational waves and a\n  plane electromagnetic wave in the electromagnetic-gravity analogue",
    "abstract": "We study the interaction among gravitational and electromagnetic plane waves\nby means of an analogue electromagnetic model of gravity, where the\ngravitational properties are encoded in the electromagnetic properties of a\nmaterial in flat space-time. In this setup, the variations in the metric tensor\nproduced by the gravitational waves are codified as space-time-varying\nelectromagnetic properties. We used an in-housed code based in the\nfinite-difference time domain method to conduct numerical experiments, where we\nfound that, when a monochromatic gravitational plane wave interacts with a\nnarrow-band electromagnetic plane wave, an infinite number of sidebands,\nequally separated between themselves, are induced by the gravitational wave.\nFinally, we discuss possible future applications of this effect as an\nalternative method to directly detect gravitational waves.",
    "authors": [
      "Enderson Falcón-Gomez",
      "Vittorio De Falco",
      "Kerlos Atia Abdalmalak",
      "Adrián Amor-Martín",
      "Valentín De La Rubia",
      "Gabriel Santamaría-Botello",
      "Luis Enrique García Muñoz"
    ],
    "publication_date": "2023-03-10T09:32:01Z",
    "arxiv_id": "http://arxiv.org/abs/2303.05810v1",
    "download_url": "http://arxiv.org/abs/2303.05810v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dilaton photoproduction in a magnetic dipole field of pulsars and\n  magnetars",
    "abstract": "According to Einstein-Maxwell-Dilaton theory, the dilaton field $\\psi$ can be\nproduced by electromagnetic fields with non-zero Maxwell invariant. So\nelectromagnetic wave propagating in an external electromagnetic field is a\ntypical source of dilaton radiation. For study dilaton photoproduction in\nastrophysical conditions it's interesting to consider plane elliptically\npolarized electromagnetic wave propagating in the electromagnetic field of\nmagnetic dipole ${\\bf m}$ of pulsars and magnetars. The dilation field equation\nis solved in case $|\\psi| \\ll 1$. The angular distribution dilaton radiation is\nstudied in every point of space. It's shown that spectral composition of\ndilatons is similar to spectral composition of plane electromagnetic wave.\nAmount of dilaton energy radiated in time and all directions is greatest in\ncondition $(B_1^2-B_2^2)(m_x^2-m_y^2)\\geq 0,$ where $B_1$ and $B_2$ are\nelectromagnetic wave amplitudes along the axes of polarization ellipse. This\ncondition is valid for many neutron star systems.",
    "authors": [
      "Mikhail Astashenkov"
    ],
    "publication_date": "2023-04-21T14:39:47Z",
    "arxiv_id": "http://arxiv.org/abs/2304.10991v1",
    "download_url": "http://arxiv.org/abs/2304.10991v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuous-Aperture Array Based OAM High-Capacity Communication For\n  Metaverse",
    "abstract": "The extensive data interaction demands of an immersive metaverse necessitate\nthe adoption of emerging technologies to enable high-capacity communication.\nVortex electromagnetic waves with different orbital angular momentum (OAM)\nmodes are spatially orthogonal, providing a novel spatial multiplexing\ndimension to achieve high-capacity communication. However, the number of\northogonal OAM modes based on a discrete uniform circular array (UCA) is\nlimited by the number of array elements in the UCA, and traditional discrete\nchannel models are unable to accurately capture the physical properties of\nvortex electromagnetic wave propagation. The continuous-aperture array (CAPA)\nis composed of densely packed electromagnetic excitation elements, capable of\nflexibly and efficiently generating the desired surface currents to produce an\narbitrary number of mutually orthogonal OAM modes. From the perspective of\nelectromagnetic information theory (EIT), we propose a CAPA-based OAM\northogonal transmission scheme to realize high-capacity communication. We\ndesign the surface currents of the CAPA using Fourier basis functions, derive\nthe electromagnetic channel for vortex electromagnetic waves, and investigate\nthe upper bound of the spectrum efficiency for CAPA-based OAM orthogonal\ntransmission. This paper establishes a theoretical foundation for applying EIT\nto the orthogonal transmission of vortex electromagnetic waves, offering a\nnovel solution for achieving CAPA-based efficient and high-capacity\ncommunication.",
    "authors": [
      "Hongyun Jin",
      "Wenchi Cheng",
      "Jingqing Wang",
      "Wei Zhang"
    ],
    "publication_date": "2025-02-12T02:06:00Z",
    "arxiv_id": "http://arxiv.org/abs/2502.08064v1",
    "download_url": "http://arxiv.org/abs/2502.08064v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Circuits",
    "abstract": "The electromagnetic analog of an elastic spring-mass network is constructed.\nThese electromagnetic circuits offer the promise of manipulating\nelectromagnetic fields in new ways, and linear electrical circuits correspond\nto a subclass of them. They consist of thin triangular magnetic components\njoined at the edges by cylindrical dielectric components. (There are also dual\nelectromagnetic circuits consisting of thin triangular dielectric components\njoined at the edges by cylindrical magnetic components.) Some of the edges can\nbe terminal edges to which electric fields are applied. The response is\nmeasured in terms of the real or virtual free currents that are associated with\nthe terminal edges. The relation between the terminal electric fields and the\nterminal free currents is governed by a symmetric complex matrix $\\BW$. In the\ncase where all the terminal edges are disjoint, and the frequency is fixed, a\ncomplete characterization is obtained of all possible response matrices $\\BW$\nboth in the lossless and lossy cases. This is done by introducing a subclass of\nelectromagnetic circuits, called electromagnetic ladder networks. It is shown\nthat an electromagnetic ladder network, structured as a cubic network, can have\na macroscopic electromagnetic continuum response which is non-Maxwellian, and\nnovel.",
    "authors": [
      "Graeme W. Milton",
      "Pierre Seppecher"
    ],
    "publication_date": "2008-05-08T00:28:51Z",
    "arxiv_id": "http://arxiv.org/abs/0805.1079v2",
    "download_url": "http://arxiv.org/abs/0805.1079v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bio-Soliton Model that predicts Non-Thermal Electromagnetic Radiation\n  Frequency Bands, that either Stabilize or Destabilize Life Conditions",
    "abstract": "Solitons, as self-reinforcing solitary waves, interact with complex\nbiological phenomena such as cellular self-organisation. Soliton models are\nable to describe a spectrum of electromagnetism modalities that can be applied\nto understand the physical principles of biological effects in living cells, as\ncaused by electromagnetic radiation. A bio-soliton model is proposed, that\nenables to predict which eigen-frequencies of non-thermal electromagnetic waves\nare life-sustaining and which are, in contrast, detrimental for living cells.\nThe particular effects are exerted by a range of electromagnetic wave\nfrequencies of one-tenth of a Hertz till Peta Hertz, that show a pattern of\ntwelve bands, if positioned on an acoustic frequency scale. The model was\nsubstantiated by a meta-analysis of 240 published papers of biological\nradiation experiments, in which a spectrum of non-thermal electromagnetic waves\nwere exposed to living cells and intact organisms. These data support the\nconcept of coherent quantized electromagnetic states in living organisms and\nthe theories of Davydov, Fr\\\"ohlich and Pang. A spin-off strategy from our\nstudy is discussed in order to design bio-compatibility promoting\nsemi-conducting materials and to counteract potential detrimental effects due\nto specific types of electromagnetic radiation produced by man-made\nelectromagnetic technologies.",
    "authors": [
      "J. H. Geesink",
      "D. K. F. Meijer"
    ],
    "publication_date": "2016-10-16T13:15:27Z",
    "arxiv_id": "http://arxiv.org/abs/1610.04855v1",
    "download_url": "http://arxiv.org/abs/1610.04855v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Control of a sedimenting elliptical particle by electromagnetic forces",
    "abstract": "In this paper, the effectiveness of electromagnetic forces on controlling the\nmotion of a sedimenting elliptical particle is investigated using the immersed\ninterface-lattice Boltzmann method (II-LBM), in which a signed distance\nfunction is adopted to apply the jump conditions for the II-LBM and to add\nexternal electromagnetic forces. First, mechanisms of electromagnetic control\non suppressing vorticity generation based on the vorticity equation and vortex\nshedding based on the streamwise momentum equation are discussed. Then,\nsystematical investigations are performed to quantify and qualify the effects\nof the electromagnetic control by changing the electromagnetic strength, the\ninitial orientation angle of the elliptical particle, and the density ratio of\nthe particle to the fluid. To demonstrate the control effect of different\ncases, comparisons of vorticity fields, particle trajectories, orientation\nangles, and energy transfers of the particles are presented. Results show that\nthe rotational motion of the particle can be well controlled by appropriate\nmagnitudes of electromagnetic forces. In a relatively high solid to fluid\ndensity ratio case where vortex shedding appears, the sedimentation speed can\nincrease nearly 40\\% and the motion of the particle turns into a steady descent\nmotion once an appropriate magnitude of the electromagnetic force is applied.\nWhen the magnitude of the electromagnetic force is excessive, the particle will\ndeviate from the center of the side walls. In addition, the controlling\napproach is shown to be robust for various initial orientation angles and solid\nto fluid density ratios.",
    "authors": [
      "Jianhua Qin",
      "Guodan Dong",
      "Hui Zhang"
    ],
    "publication_date": "2021-02-21T02:33:31Z",
    "arxiv_id": "http://arxiv.org/abs/2102.10494v1",
    "download_url": "http://arxiv.org/abs/2102.10494v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gravito-Electromagnetic Properties of Superconductors - A Brief Review -",
    "abstract": "Starting from the generalised London equations, which include a\ngravitomagnetic term, the gravitational and the electromagnetic properties of\nsuperconductors are derived. A phenomenological synthesis of those properties\nis proposed.",
    "authors": [
      "C. J. de Matos",
      "M. Tajmar"
    ],
    "publication_date": "2004-06-30T13:14:19Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0406761v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0406761v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dynamic Localization and Electromagnetic Transparency of Semiconductor\n  Superlattice in Multifrequency Electric Fields",
    "abstract": "We consider the dynamics of electrons in semiconductor superlattices in\nintense multifrequency electric fields. We examine the conditions for dynamic\nlocalization and electromagnetic transparency. We investigate processes of\nformation, destruction and stabilization of electromagnetic transparency in\nbiharmonic field. The stable dc fields are founded.",
    "authors": [
      "J. Y. Romanova",
      "Y. A. Romanov"
    ],
    "publication_date": "2006-12-21T11:00:47Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0612550v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0612550v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fundamental equations for the gravitational and electromagnetic\n  perturbations of a charged black hole",
    "abstract": "A pair of wave equations is presented for the gravitational and\nelectromagnetic perturbations of a charged black hole. One of the equations is\nuncoupled and determines the propagation of the electromagnetic perturbation.\nThe other is for the propagation of the shear of a principal null direction and\nhas a source term given by the solution of the first equation. This result is\nexpected to have important applications in astrophysical models.",
    "authors": [
      "Zoltán Perjés"
    ],
    "publication_date": "2002-06-28T15:19:51Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0206088v1",
    "download_url": "http://arxiv.org/abs/gr-qc/0206088v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Precession of a particle with anomalous magnetic moment in\n  electromagnetic and gravitational pp-wave fields",
    "abstract": "We present an exact solution of the Bargmann-Michel-Telegdi (BMT) equations\nfor the dynamics of a spin particle in external electromagnetic and\ngravitational pp-wave fields. We demonstrate that an anomalous magnetic moment\ngives rise to an additional spin rotation which is modulated both by the\nelectromagnetic and by the gravitational wave periodicities.",
    "authors": [
      "Alexander Balakin",
      "Veronika Kurbanova",
      "Winfried Zimdahl"
    ],
    "publication_date": "2002-09-26T06:21:10Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0209099v1",
    "download_url": "http://arxiv.org/abs/gr-qc/0209099v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Minkowski electromagnetic analog for Kerr-Newman electrovac solution",
    "abstract": "An electromagnetic analog of the Kerr-Newman solution in general relativity\nis derived, based on Minkowski's formulation for electromagnetic fields in\nmoving media. The equivalent system is a distribution of charges and currents\nlargely localized within a spinning disk of radius a. This occurs in a rotating\nmedium of inhomogeneous index of refraction and \"frame dragging\" at exactly\nhalf the angular velocity of the electrical charge.",
    "authors": [
      "S. M. Blinder"
    ],
    "publication_date": "2004-09-06T14:59:16Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0409025v1",
    "download_url": "http://arxiv.org/abs/gr-qc/0409025v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tetrads in Geometrodynamics",
    "abstract": "A new tetrad is introduced within the framework of geometrodynamics for\nnon-null electromagnetic fields. This tetrad diagonalizes the electromagnetic\nstress-energy tensor and allows for maximum simplification of the expression of\nthe electromagnetic field. The Einstein-Maxwell equations will also be\nsimplified.",
    "authors": [
      "Alcides Garat"
    ],
    "publication_date": "2004-12-08T17:03:30Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0412037v2",
    "download_url": "http://arxiv.org/abs/gr-qc/0412037v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computing Electromagnetic Effects in Fully Unquenched QCD",
    "abstract": "The inclusion of electromagnetic effects in unquenched QCD can be\naccomplished using ensembles generated in dynamical simulations with pure QCD\nprovided the change in the quark determinant induced by a weak electromagnetic\nfield can be efficiently computed. A stochastic technique for achieving this in\nthe case of dynamical domain wall calculations is described.",
    "authors": [
      "A. Duncan",
      "E. Eichten",
      "R. Sedgewick"
    ],
    "publication_date": "2004-05-17T18:00:09Z",
    "arxiv_id": "http://arxiv.org/abs/hep-lat/0405014v1",
    "download_url": "http://arxiv.org/abs/hep-lat/0405014v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Contributions to Vector Meson Masses and Mixings",
    "abstract": "We use the 1/N_c method to estimate electromagnetic contributions to vector\nmeson masses and mixings. We identify several new sources of rho-omega mixing\ncoming from short-distance effects. We comment on the extraction of quark\nmasses from the vector meson masses. We also present a simple group theoretical\ndiscussion of the electromagnetic mass differences.",
    "authors": [
      "J. Bijnens",
      "P. Gosdzinsky"
    ],
    "publication_date": "1996-07-29T15:11:30Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/9607462v1",
    "download_url": "http://arxiv.org/abs/hep-ph/9607462v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Parametric Resonance Amplification of Neutrino Oscillations in\n  Electromagnetic Wave with Varying Amplitude and \"Castle Wall\" Magnetic Field",
    "abstract": "Within the Lorentz invariant formalizm for description of neutrino evolution\nin electromagnetic fields and matter we consider neutrino spin oscillations in\nthe electromagnetic wave with varying amplitude and in \"castle wall\" magnetic\nfield. It is shown for the first time that the parametric resonances of\nneutrino oscillations in such systems can occur.",
    "authors": [
      "M. S. Dvornikov",
      "A. I. Studenikin"
    ],
    "publication_date": "2001-07-10T08:41:51Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/0107109v1",
    "download_url": "http://arxiv.org/abs/hep-ph/0107109v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relativistic Effects in the Electromagnetic Structure of $ρ$-meson",
    "abstract": "The relativistic calculations of the electromagnetic form factors and static\nmoments of $\\rho$-meson are given in the framework of the relativistic\nHamiltonian dynamics with different model wave functions. The impulse\napproximation is used. Lorentz covariance and conservation law for the\nelectromagnetic current operator are taken into account.",
    "authors": [
      "A. F. Krutov",
      "V. E. Troitsky"
    ],
    "publication_date": "2004-03-04T14:01:58Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/0403046v1",
    "download_url": "http://arxiv.org/abs/hep-ph/0403046v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]