[
  {
    "title": "On Experimental Evidence of Uncertainty of Quantized Electromagnetic\n  Potential from QHE",
    "abstract": "It is shown that the observed potential drops on QHE samples can be\nconsidered as a realization of uncertainty relation for the quantized two\ndimensional electromagnetic potential.",
    "authors": [
      "F. Ghaboussi"
    ],
    "publication_date": "1997-05-12T12:56:25Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9705108v1",
    "download_url": "http://arxiv.org/abs/cond-mat/9705108v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comment on ''Electromagnetic Surface Modes at Interfaces with Negative\n  Refractive Index make a Non-Quite Perfect Lens''",
    "abstract": "Comment on ''Electromagnetic Surface Modes at Interfaces with Negative\nRefractive Index make a Non-Quite Perfect Lens''",
    "authors": [
      "N. Garcia",
      "M. Nieto-Vesperinas"
    ],
    "publication_date": "2002-07-19T16:56:31Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0207489v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0207489v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "What is the velocity of the electromagnetic field?",
    "abstract": "A new definition for the electromagnetic field velocity is proposed. The\nvelocity depends on the physical fields.",
    "authors": [
      "Wilhelm Fushchych"
    ],
    "publication_date": "1998-04-01T00:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/physics/9804037v1",
    "download_url": "http://arxiv.org/abs/physics/9804037v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Formula for Gauge Invariant Reduction of Electromagnetic Multipole\n  Tensors",
    "abstract": "Based on some previous results, one gives a general formula for introducing\nelectromagnetic multipole expansions in terms of symmetric and traceless\ncartesian tensors.",
    "authors": [
      "Constantin Vrejoiu"
    ],
    "publication_date": "2005-03-31T08:39:09Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0503228v1",
    "download_url": "http://arxiv.org/abs/physics/0503228v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "To Quantization of Free Electromagnetic Field",
    "abstract": "Correct quantization of free electromagnetic field is proposed",
    "authors": [
      "D. Yearchuck",
      "Y. Yerchak",
      "A. Alexandrov"
    ],
    "publication_date": "2009-09-22T23:00:05Z",
    "arxiv_id": "http://arxiv.org/abs/0909.4109v1",
    "download_url": "http://arxiv.org/abs/0909.4109v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding possible electromagnetic counterparts to loud\n  gravitational wave events: Binary black hole effects on electromagnetic\n  fields",
    "abstract": "In addition to producing loud gravitational waves (GW), the dynamics of a\nbinary black hole system could induce emission of electromagnetic (EM)\nradiation by affecting the behavior of plasmas and electromagnetic fields in\ntheir vicinity. We here study how the electromagnetic fields are affected by a\npair of orbiting black holes through the merger. In particular, we show how the\nbinary's dynamics induce a variability in possible electromagnetically induced\nemissions as well as an enhancement of electromagnetic fields during the\nlate-merge and merger epochs. These time dependent features will likely leave\ntheir imprint in processes generating detectable emissions and can be exploited\nin the detection of electromagnetic counterparts of gravitational waves.",
    "authors": [
      "Carlos Palenzuela",
      "Luis Lehner",
      "Shin Yoshida"
    ],
    "publication_date": "2009-11-19T20:48:18Z",
    "arxiv_id": "http://arxiv.org/abs/0911.3889v1",
    "download_url": "http://arxiv.org/abs/0911.3889v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some Wave Equations for Electromagnetism and Gravitation",
    "abstract": "The paper studies the inferences of wave equations for electromagnetic fields\nwhen there are gravitational fields at the same time. In the description with\nthe algebra of octonions, the inferences of wave equations are identical with\nthat in conventional electromagnetic theory with vector terminology. By means\nof the octonion exponential function, we can draw out that the electromagnetic\nwaves are transverse waves in a vacuum, and rephrase the law of reflection,\nSnell's law, Fresnel formula, and total internal reflection etc. The study\nclaims that the theoretical results of wave equations for electromagnetic\nstrength keep unchanged in the case for coexistence of gravitational and\nelectromagnetic fields. Meanwhile the electric and magnetic components of\nelectromagnetic waves can not be determined simultaneously in electromagnetic\nfields.",
    "authors": [
      "Zi-Hua Weng"
    ],
    "publication_date": "2010-08-11T07:37:53Z",
    "arxiv_id": "http://arxiv.org/abs/1008.2124v1",
    "download_url": "http://arxiv.org/abs/1008.2124v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Smoothing estimates for variable coefficients Schroedinger equation with\n  electromagnetic potentials",
    "abstract": "In this paper we develop the classical multiplier technique to prove a virial\nidentity and smoothing estimates (in a perturbative setting) for the\nelectromagnetic variable coefficients Schroedinger equation.",
    "authors": [
      "Federico Cacciafesta"
    ],
    "publication_date": "2012-06-22T15:29:06Z",
    "arxiv_id": "http://arxiv.org/abs/1206.5177v1",
    "download_url": "http://arxiv.org/abs/1206.5177v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unification of Gravity with Electromagnetism",
    "abstract": "Principles of Maxwell, Lorentz, Milne, Dirac and Feynman are combined to\nunify gravity with electromagnetism.",
    "authors": [
      "Geoffrey F. Chew"
    ],
    "publication_date": "2012-09-25T04:17:04Z",
    "arxiv_id": "http://arxiv.org/abs/1209.6290v1",
    "download_url": "http://arxiv.org/abs/1209.6290v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Three dimensional stationary cyclic symmetric Einstein-Maxwell\n  solutions; energy, mass, momentum, and algebraic tensors characteristics",
    "abstract": "The main purpose of this contribution is to determine physical and\ngeometrical characterizations of whole classes of stationary cyclic symmetric\ngravitational fields coupled to Maxwell electromagnetic fields within the\n$(2+1)$-dimensional gravity. The physical characterization is based on the\ndetermination of the local and global energy-momentum-mass quantities using the\nBrown-York approach. As far as to the algebraic-geometrical characterization is\nconcerned, the eigenvalue problem for the electromagnetic field,\nenergy-momentum and Cotton tensors is solved and their types are established.\n  The families of Einstein-Maxwell solutions to be considered are: all uniform\nelectromagnetic solutions possessing electromagnetic fields with vanishing\ncovariant derivatives (stationary uniform and spinning Clement classes), all\nfields having constant electromagnetic field and energy-momentum tensors'\ninvariants (Kamata-Koikawa solutions), the whole classes of hybrid\nelectromagnetic Ayon-Cataldo-Garcia solutions, a new family of stationary\nelectromagnetic solutions, the electrostatic and magnetostatic solutions with\nPeldan limit, the Clement spinning charged metric, the\nMartinez-Teitelboim-Zanelli black hole solution, and Dias-Lemos electromagnetic\nsolution.",
    "authors": [
      "Alberto A. Garcia-Diaz"
    ],
    "publication_date": "2013-07-25T07:57:31Z",
    "arxiv_id": "http://arxiv.org/abs/1307.6652v1",
    "download_url": "http://arxiv.org/abs/1307.6652v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Memory",
    "abstract": "An elementary derivation of the electromagnetic memory effect is given. An\nexperimental setup to detect it is suggested.",
    "authors": [
      "Leonard Susskind"
    ],
    "publication_date": "2015-07-09T16:37:49Z",
    "arxiv_id": "http://arxiv.org/abs/1507.02584v2",
    "download_url": "http://arxiv.org/abs/1507.02584v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetism at finite temperature: a density operator approach",
    "abstract": "In order to analyse classical electromagnetism in a medium at finite\ntemperature we introduce `an optical density operator', and reformulate\nMaxwell's equations with the operator, starting from the Dirac-equation-like\nformulation of electromagnetism. We find the thermal state of electromagnetic\nfield in the medium from the `optical Dirac Hamiltonian', which is the\neffective Hamiltonian in the Dirac-like formulation. In the thermal state, the\ntwo transverse modes (left-handed and right-handed circular polarisation) of\nelectromagnetic fields exist at the same ratio. We also analyse the asymptotics\nof the thermal state. At the low temperature limit, there is correlation\nbetween the electric field and the magnetic field. This means that there exists\nan electromagnetic wave at the thermal equilibrium, and this recovers Maxwell's\nclassical electromagnetism. In contrast, the correlation vanishes at the high\ntemperature limit. This means that electromagnetic waves are unsustainable and\nonly independent electric fields and magnetic fields exist at the high\ntemperature limit.",
    "authors": [
      "Daigo Oue"
    ],
    "publication_date": "2019-06-12T15:50:33Z",
    "arxiv_id": "http://arxiv.org/abs/1906.05219v3",
    "download_url": "http://arxiv.org/abs/1906.05219v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multi cloak invisibility, a new strategy for simultaneous acoustic and\n  electromagnetic invisibility",
    "abstract": "Based on electromagnetic and acoustic transformation theory, a new strategy\nhas been presented in this article to implement double invisibility cloaking,\nwhich has not been done yet. By applying a combination of four conventional\ncloaking methods, for cloaking an object by electromagnetic and acoustic waves,\nwhich are two essential methods for objects detection (sonar, radar, eye, ear,\ncamera ...), the object will be blind or deaf, while it will be undetectable\nacoustically and electromagnetically simultaneously. In deaf mode structure,\nthe object has an interaction with electromagnetic waves; so it can see what is\noutside the cloaking structure electromagnetically while it has not any\nacoustic interaction with the outside, but in blind mode arrangement, as\nopposed to the deaf arrangement, the acoustic link has turned on while there is\nno electromagnetic connection. Finally, the proposed approach in this paper\ndoes not generalize for any two classes of physics, electrical-mechanical,\nthermal-mechanical, electrical-thermal, electromagnetic-sonic, etc.",
    "authors": [
      "Hasanpour Tadi Saeed",
      "Shokri Babak"
    ],
    "publication_date": "2019-11-29T17:14:46Z",
    "arxiv_id": "http://arxiv.org/abs/1911.13206v1",
    "download_url": "http://arxiv.org/abs/1911.13206v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The electromagnetic symmetry sphere: a framework for energy, momentum,\n  spin and other electromagnetic quantities",
    "abstract": "Electromagnetic quantities such as energy density, momentum, spin, and\nhelicity bring meaning and intuition to electromagnetism and possess intricate\ninterrelations, particularly prominent in complex non-paraxial near-fields.\nThese quantities are conventionally expressed using electric and magnetic field\nvectors, yet the electric-magnetic basis is one among other often overlooked\nalternatives, including parallel-antiparallel and right-left-handed helicity\nbases, related to the parity and duality symmetries of electromagnetism.\nProjecting time-harmonic electromagnetic fields into a variety of bases allows\nre-interpreting established quantities and reveals underlying mathematical\nstructures: a Bloch sphere which describes asymmetries in electromagnetic\nenergy, a systematic path to unify and uncover relations between\nelectromagnetic quantities, and the unlocking of symmetry-driven equations in\nlight-matter interaction.",
    "authors": [
      "Sebastian Golat",
      "Alex J. Vernon",
      "Francisco J. Rodríguez-Fortuño"
    ],
    "publication_date": "2024-05-24T17:06:43Z",
    "arxiv_id": "http://arxiv.org/abs/2405.15718v2",
    "download_url": "http://arxiv.org/abs/2405.15718v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exact solution of the DeWitt-Brehme-Hobbs equation in copropagating\n  electromagetic and gravitational waves",
    "abstract": "An accelerated charge interacts with itself through the electromagnetic field\nthat it sources, a phenomenon known as electromagnetic radiation reaction. The\nDeWitt-Brehme-Hobbs (DWBH) equation describes the motion of a charged mass in\nthe presence of combined electromagnetic and gravitational fields, taking into\naccount electromagnetic radiation-reaction effects. Here, we find the first\nexact analytical solution of the DWBH equation in the case of a charged mass in\nthe presence of copropagating and otherwise arbitrary electromagnetic and\ngravitational plane waves. Apart from its intrinsic importance, this solution\napproximates that of an ultrarelativistic particle in arbitrary gravitational\nand electromagnetic fields. Finally, the paradigmatic example of an\nelectromagnetic wave in the presence of a constant-amplitude gravitational wave\nis worked out explicitly and it shows how the presence of the gravitational\nwave can qualitatively change electromagnetic radiation-reaction effects.",
    "authors": [
      "Giulio Audagnotto",
      "Antonino Di Piazza"
    ],
    "publication_date": "2025-09-08T16:05:36Z",
    "arxiv_id": "http://arxiv.org/abs/2509.07052v2",
    "download_url": "http://arxiv.org/abs/2509.07052v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Was The Electromagnetic Spectrum A Blackbody Spectrum In The Early\n  Universe?",
    "abstract": "It is assumed, in general, that the electromagnetic spectrum in the\nPrimordial Universe was a blackbody spectrum in vacuum. We derive the\nelectromagnetic spectrum, based on the Fluctuation-Dissipation Theorem that\ndescribes the electromagnetic fluctuations in a plasma. Our description\nincludes thermal and collisional effects in a plasma. The electromagnetic\nspectrum obtained differs from the blackbody spectrum in vacuum at low\nfrequencies. In particular, concentrating on the primordial nucleosynthesis\nera, it has more energy for frequencies less than 3 to $6\\omega_{pe}$, where\n$\\omega_{pe}$ is the electron plasma frequency.",
    "authors": [
      "Merav Opher",
      "Reuven Opher"
    ],
    "publication_date": "1997-08-27T08:32:00Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/9708246v1",
    "download_url": "http://arxiv.org/abs/astro-ph/9708246v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spacetime structure and Quantum physics",
    "abstract": "A description of electromagnetism as four-dimensional spacetime structure\nleads to the dynamics of a charged particle being determined only by the\nfour-vector potential and the existence of an electromagnetic field depending\non the topological structure of the background spacetime. When the spacetime\nstructure of electromagnetism is complex it is possible to connect spacetime\nstructure and quantum physics via the method of path integration. (This paper\nis a consequence of an attempt to incorporate gravitation into electromagnetism\nby describing gravity as a coupling of two electromagnetic fields.)",
    "authors": [
      "Vu B Ho"
    ],
    "publication_date": "1993-12-03T14:10:58Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9312007v1",
    "download_url": "http://arxiv.org/abs/gr-qc/9312007v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On linear electromagnetic constitutive laws that define almost-complex\n  structures",
    "abstract": "It is shown that not all linear electromagnetic constitutive laws will define\nalmost-complex structure on the bundle of 2-forms on the spacetime manifold\nwhen composed with the Poincare duality isomorphism, but only a restricted\nclass of them that includes linear spatially isotropic and some bi-isotropic\nlaws. Although this does not trivialize the formulation of the basic equations\nequations of pre-metric electromagnetism, it does affect their reduction to\nmetric electromagnetism by its effect on the types of media that are reducible,\nand possibly its effect on the way that such media support the propagation of\nelectromagnetic waves.",
    "authors": [
      "D. H. Delphenich"
    ],
    "publication_date": "2006-10-08T21:32:31Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0610031v1",
    "download_url": "http://arxiv.org/abs/gr-qc/0610031v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Neutrino Properties and Neutrino Oscillations in\n  Electromagnetic Fields",
    "abstract": "The presence of medium and external magnetic field change electromagnetic\nproperties of neutrino. In this article the behavior of neutrino magnetic\nmoment in electromagnetic field is considered. On the basis the\nBargmann-Michel-Telegdi equation for the case of models with CP invariance and\nP nonconservation the new type of neutrino resonances $\\nu_L \\leftrightarrow\n\\nu_R$ in the electromagnetic field is predicted.",
    "authors": [
      "A. M. Egorov",
      "A. E. Lobanov",
      "A. I. Studenikin"
    ],
    "publication_date": "1999-02-23T16:54:32Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/9902447v3",
    "download_url": "http://arxiv.org/abs/hep-ph/9902447v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic self-energies of vector mesons and electromagnetic mass\n  anomaly of the massive Yang-Mills particles",
    "abstract": "A systematic method developed by the authors to evaluate the one-loop\nelectromagnetic self-energies of the low-lying mesons is extended to the\ncalculation of the vector sector including $\\rho$, $\\omega$, and $\\phi$-mesons.\nThe theoretical result of $\\rho^0-\\rho^\\pm$ electromagnetic mass difference is\nin agreement with the measurements. An interesting effect called as\nelectromagnetic mass anomaly of the massive Yang-Mills particles is further\ndiscussed. There is no new parameter in this study.",
    "authors": [
      "Dao-Neng Gao",
      "Mu-Lin Yan"
    ],
    "publication_date": "1999-04-02T13:40:03Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/9904217v2",
    "download_url": "http://arxiv.org/abs/hep-ph/9904217v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New effects in neutrino oscillations in matter and electromagnetic\n  fields",
    "abstract": "Within the recently developed Lorentz invariant approach to neutrino spin and\nflavour oscillations the following four new effects are discussed: 1) neutrino\nspin oscillations in different electromagnetic field configurations, 2)\nneutrino spin precession and oscillations stimulated by weak interaction with\nbackground matter without presence of electromagnetic fields, 3) the\nsignificant shift of neutrino spin and flavour oscillation resonances by matter\nmoving with relativistic speed, if compared with the case of non-moving matter,\n4) the new mechanism of electromagnetic radiation by neutrino moving in\nbackground matter and/or electromagnetic fields.",
    "authors": [
      "Alexander Studenikin"
    ],
    "publication_date": "2003-06-27T17:10:56Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/0306280v1",
    "download_url": "http://arxiv.org/abs/hep-ph/0306280v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Induced current and redefinition of electric and magnetic fields from\n  non-compact Kaluza-Klein theory: An experimental signature of the fifth\n  dimension",
    "abstract": "The field equations for gravitation and electromagnetism with sources in four\ndimensions can be interpreted as arising from the vacuum Einstein equations in\nfive dimensions. Gauge invariance of the electromagnetic potentials leads to a\n``generalized'' electromagnetic field tensor. We use the action principle to\nderive the equations of motion for free electromagnetic fields in flat\nspacetime, and isolate an effective electromagnetic current with a source that\nis purely higher-dimensional in origin. This current provides, at least in\nprinciple, a means of detecting extra dimensions experimentally.",
    "authors": [
      "Tomas Liko"
    ],
    "publication_date": "2005-05-05T08:37:19Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/0505049v1",
    "download_url": "http://arxiv.org/abs/hep-th/0505049v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Model-independent definition and determination of electromagnetic\n  formfactors and multipole moments",
    "abstract": "A theoretical method for the systematic definition and determination of\nCartesian and spherical electromagnetic (onshell) formfactors and multipole\nmoments for particles or composite systems from electromagnetic Breit-frame\ncurrent distributions is presented. The method presented is free of sign\nambiguities and is not based on the underlying analytical substructure of the\nelectromagnetic current distributions. By construction the method contains all\nhigher order momentum derivative terms within the definition of electromagnetic\nformfactors and multipole moments, which are not taken into account in a lot of\nexisting theoretical calculations.",
    "authors": [
      "F. Kleefeld"
    ],
    "publication_date": "2000-12-20T17:24:18Z",
    "arxiv_id": "http://arxiv.org/abs/nucl-th/0012076v1",
    "download_url": "http://arxiv.org/abs/nucl-th/0012076v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relativistic Causality and Conservation of Energy in Classical\n  Electromagnetic Theory",
    "abstract": "The change of the electromagnetic field in a particular place due to the\nevent of a change in the motion of a charged particle can occur only after the\nlight signal from the event can reach this place. Naive calculations of the\nelectromagnetic energy and the work performed by the electromagnetic fields\nmight lead to paradoxes of apparent non-conservation of energy. A few paradoxes\nof this type for a simple motion of two charges are presented and resolved in a\nquantitative way providing deeper insight into various relativistic effects in\nthe classical electromagnetic theory.",
    "authors": [
      "Amnon Kislev",
      "Lev Vaidman"
    ],
    "publication_date": "2002-01-22T12:50:45Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0201042v1",
    "download_url": "http://arxiv.org/abs/physics/0201042v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Linear Momentum Density in Quasistatic Electromagnetic Systems",
    "abstract": "We discuss a couple of simple quasistatic electromagnetic systems in which\nthe density of electromagnetic linear momentum can be easily computed. The\nexamples are also used to illustrate how the total electromagnetic linear\nmomentum, which may also be calculated by using the vector potential, can be\nunderstood as a consequence of the violation of the action-reaction principle,\nbecause a non-null external force is required to maintain constant the\nmechanical linear momentum. We show how one can avoid the divergence in the\ninteraction linear electromagnetic momentum of a system composed by an\nidealization often used in textbooks (an infinite straight current) and a point\ncharge.",
    "authors": [
      "J. M. Aguirregabiria",
      "A. Hernandez",
      "M. Rivas"
    ],
    "publication_date": "2004-04-29T08:16:54Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0404139v1",
    "download_url": "http://arxiv.org/abs/physics/0404139v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the physical meaning of the gauge conditions of Classical\n  Electromagnetism : the hydrodynamics analogue viewpoint",
    "abstract": "Based on an analogy between Fluid Mechanics and Electromagnetism, we claim\nthat the gauge conditions of Classical Electromagnetism are not equivalent\ncontrary to the common belief. These \"gauges\" are usually considered as\nmathematical conditions that one must specify in order to solve any\nelectromagnetic problem. Here, the author shows that these conditions are\nphysical constraints which can be interpreted as electromagnetic continuity\nequations. As a consequence, light cannot be considered as a pure transverse\nwave in vacuum from the point of view of the potentials. We discuss the (lack\nof) meaning of gauge transformations.",
    "authors": [
      "Germain Rousseaux"
    ],
    "publication_date": "2005-11-05T11:00:57Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0511047v1",
    "download_url": "http://arxiv.org/abs/physics/0511047v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Radial-Dependent Dispersive Finite-Difference Time-Domain Method for\n  the Evaluation of Electromagnetic Cloaks",
    "abstract": "A radial-dependent dispersive finite-difference time-domain (FDTD) method is\nproposed to simulate electromagnetic cloaking devices. The Drude dispersion\nmodel is applied to model the electromagnetic characteristics of the cloaking\nmedium. Both lossless and lossy cloaking materials are examined and their\noperating bandwidth is also investigated. It is demonstrated that the perfect\n\"invisibility\" from electromagnetic cloaks is only available for lossless\nmetamaterials and within an extremely narrow frequency band.",
    "authors": [
      "Christos Argyropoulos",
      "Yan Zhao",
      "Yang Hao"
    ],
    "publication_date": "2008-05-14T12:50:34Z",
    "arxiv_id": "http://arxiv.org/abs/0805.2050v1",
    "download_url": "http://arxiv.org/abs/0805.2050v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Low Loss Metamaterials Based on Classical Electromagnetically Induced\n  Transparency",
    "abstract": "We demonstrate theoretically that electromagnetically induced transparency\ncan be achieved in metamaterials, in which electromagnetic radiation is\ninteracting resonantly with mesoscopic oscillators rather than with atoms. We\ndescribe novel metamaterial designs that can support full dark resonant state\nupon interaction with an electromagnetic beam and we present results of its\nfrequency-dependent effective permeability and permittivity. These results,\nshowing a transparency window with extremely low absorption and strong\ndispersion, are confirmed by accurate simulations of the electromagnetic field\npropagation in the metamaterial.",
    "authors": [
      "Ph. Tassin",
      "Lei Zhang",
      "Th. Koschny",
      "E. N. Economou",
      "C. M. Soukoulis"
    ],
    "publication_date": "2008-07-15T22:59:45Z",
    "arxiv_id": "http://arxiv.org/abs/0807.2478v1",
    "download_url": "http://arxiv.org/abs/0807.2478v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hybrid electromagnetic circuits",
    "abstract": "Electromagnetic circuits are the electromagnetic analog at fixed frequency of\nmass-spring networks in elastodynamics. By interchanging the roles of epsilon\nand mu in electromagnetic circuits one obtains magnetoelectric circuits. Here\nwe show that by introducing tetrahedral connectors having epsilon=mu=0 one can\njoin electromagnetic and magnetoelectric circuits to obtain hybrid circuits.\nTheir response is governed by a symmetric matrix with negative semidefinite\nimaginary part. Conversely given any such matrix a recipe is given for\nconstructing a hybrid circuit which has that matrix as its response matrix.",
    "authors": [
      "Graeme W. Milton",
      "Pierre Seppecher"
    ],
    "publication_date": "2009-10-05T16:22:43Z",
    "arxiv_id": "http://arxiv.org/abs/0910.0798v1",
    "download_url": "http://arxiv.org/abs/0910.0798v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Motion of charged particles in an electromagnetic knot",
    "abstract": "In this paper we consider the classical relativistic motion of charged\nparticles in a knotted electromagnetic field. After reviewing how to construct\nelectromagnetic knots from maps between the three-sphere and the two-sphere, we\nintroduce a mean quadratic radius of the energy density distribution in order\nto study some properties of this field. We study the classical relativistic\nmotion of electrons in the electromagnetic field of the Hopf map, and compute\ntheir trajectories. It is observed that these electrons initially at rest are\nstrongly accelerated by the electromagnetic force, becoming ultrarelativistic\nin a period of time that depends on the knot energy and size.",
    "authors": [
      "M. Arrayás",
      "J. L. Trueba"
    ],
    "publication_date": "2010-01-27T16:35:00Z",
    "arxiv_id": "http://arxiv.org/abs/1001.4985v1",
    "download_url": "http://arxiv.org/abs/1001.4985v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fractional Integro-Differential Equations for Electromagnetic Waves in\n  Dielectric Media",
    "abstract": "We prove that the electromagnetic fields in dielectric media whose\nsusceptibility follows a fractional power-law dependence in a wide frequency\nrange can be described by differential equations with time derivatives of\nnoninteger order. We obtain fractional integro-differential equations for\nelectromagnetic waves in a dielectric. The electromagnetic fields in\ndielectrics demonstrate a fractional power-law relaxation. The fractional\nintegro-differential equations for electromagnetic waves are common to a wide\nclass of dielectric media regardless of the type of physical structure, the\nchemical composition, or the nature of the polarizing species (dipoles,\nelectrons, or ions).",
    "authors": [
      "Vasily E. Tarasov"
    ],
    "publication_date": "2011-07-29T08:09:22Z",
    "arxiv_id": "http://arxiv.org/abs/1107.5892v2",
    "download_url": "http://arxiv.org/abs/1107.5892v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gravitationally Driven Electromagnetic Perturbations of Neutron Stars\n  and Black Holes",
    "abstract": "Gravitational perturbations of neutron stars and black holes are well known\nsources of gravitational radiation. If the compact object is immersed in or\nendowed with a magnetic field, the gravitational perturbations would couple to\nelectromagnetic perturbations and potentially trigger synergistic\nelectromagnetic signatures. We present a detailed analytic calculation of the\ndynamics of coupled gravitational and electromagnetic perturbations for both\nneutron stars and black holes. We discuss the prospects for detecting the\nelectromagnetic waves in these scenarios and the potential that these waves\nhave for providing information about their source.",
    "authors": [
      "Hajime Sotani",
      "Kostas D. Kokkotas",
      "Pablo Laguna",
      "Carlos F. Sopuerta"
    ],
    "publication_date": "2013-03-22T15:19:47Z",
    "arxiv_id": "http://arxiv.org/abs/1303.5641v1",
    "download_url": "http://arxiv.org/abs/1303.5641v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Storage of electromagnetic waves in a metamaterial that mimics\n  electromagnetically induced transparency",
    "abstract": "We propose a method for dynamically controlling the properties of a\nmetamaterial that mimics electromagnetically induced transparency (EIT) by\nintroducing varactor diodes to manipulate the structural symmetry of the\nmetamaterial. Dynamic modulation of the EIT property enables the storage and\nretrieval of electromagnetic waves. We confirmed that the electromagnetic waves\nwere stored and released, while maintaining the phase distribution in the\npropagating direction.",
    "authors": [
      "Toshihiro Nakanishi",
      "Takehiro Otani",
      "Yasuhiro Tamayama",
      "Masao Kitano"
    ],
    "publication_date": "2013-04-09T01:57:01Z",
    "arxiv_id": "http://arxiv.org/abs/1304.2443v2",
    "download_url": "http://arxiv.org/abs/1304.2443v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Problem of Ambiguity of Electromagnetic Potential",
    "abstract": "In the self-sufficient potential formalism, treating all electromagnetic\nphenomena as natural or forced oscillations of some distributed electromagnetic\noscillating system (Minkowski space-time), the electromagnetic potential must\nbe considered as some relative measure describing deviation of the system from\nits \"undisturbed\" state (when both natural and forced oscillations are absent).\nTherefore, there is no ambiguity in the gauge of one: all components of the\npotential four-vector are asymptotically verging towards zero while the\ndistance from all free charges and currents enlarges. Such interpretation turns\nthe electromagnetic potential into a physically real value.",
    "authors": [
      "A. V. Gritsunov"
    ],
    "publication_date": "2013-07-01T18:13:54Z",
    "arxiv_id": "http://arxiv.org/abs/1307.0460v1",
    "download_url": "http://arxiv.org/abs/1307.0460v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Neutrino electromagnetic interactions: a window to new physics",
    "abstract": "We review the theory and phenomenology of neutrino electromagnetic\ninteractions, which give us powerful tools to probe the physics beyond the\nStandard Model. After a derivation of the general structure of the\nelectromagnetic interactions of Dirac and Majorana neutrinos in the one-photon\napproximation, we discuss the effects of neutrino electromagnetic interactions\nin terrestrial experiments and in astrophysical environments. We present the\nexperimental bounds on neutrino electromagnetic properties and we confront them\nwith the predictions of theories beyond the Standard Model.",
    "authors": [
      "Carlo Giunti",
      "Alexander Studenikin"
    ],
    "publication_date": "2014-03-25T13:55:29Z",
    "arxiv_id": "http://arxiv.org/abs/1403.6344v3",
    "download_url": "http://arxiv.org/abs/1403.6344v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic neutrinos in laboratory experiments and astrophysics",
    "abstract": "An overview of neutrino electromagnetic properties, which open a door to the\nnew physics beyond the Standard Model, is given. The effects of neutrino\nelectromagnetic interactions both in terrestrial experiments and in\nastrophysical environments are discussed. The experimental bounds on neutrino\nelectromagnetic characteristics are summarized. Future astrophysical probes of\nelectromagnetic neutrinos are outlined.",
    "authors": [
      "Carlo Giunti",
      "Konstantin A. Kouzakov",
      "Yu-Feng Li",
      "Alexey V. Lokhov",
      "Alexander I. Studenikin",
      "Shun Zhou"
    ],
    "publication_date": "2015-06-17T17:21:06Z",
    "arxiv_id": "http://arxiv.org/abs/1506.05387v2",
    "download_url": "http://arxiv.org/abs/1506.05387v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Properties of a Hot and Dense Medium",
    "abstract": "We study the properties of an electromagnetically interacting medium in the\npresence of high concentration of electrons at extremely high temperatures and\nchemical potentials. We show that the electromagnetic properties of a medium\nsuch as the electric permittivity, magnetic permeability, magnetic moments and\nthe propagation speed of electromagnetic waves as well as the corresponding\nparticle processes depend on temperature and density of the medium.\nElectromagnetic properties of neutrinos are significantly modified due to their\ninteractions with electrons when they propagate through such a medium of hot\nand dense electrons.",
    "authors": [
      "Samina Masood"
    ],
    "publication_date": "2016-11-11T12:17:31Z",
    "arxiv_id": "http://arxiv.org/abs/1611.03675v1",
    "download_url": "http://arxiv.org/abs/1611.03675v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Monochromatic knots and other unusual electromagnetic disturbances:\n  light localised in 3D",
    "abstract": "We introduce and examine a collection of unusual electromagnetic\ndisturbances. Each of these is an exact, monochromatic solution of Maxwell's\nequations in free space with looped electric and magnetic field lines of finite\nextent and a localised appearance in all three spatial dimensions. Included are\nthe first explicit examples of monochromatic electromagnetic knots. We also\nconsider the generation of our unusual electromagnetic disturbances in the\nlaboratory, at both low and high frequencies, and highlight possible directions\nfor future research, including the use of unusual electromagnetic disturbances\nas the basis of a new form of three-dimensional display.",
    "authors": [
      "Robert P Cameron"
    ],
    "publication_date": "2017-02-16T15:59:23Z",
    "arxiv_id": "http://arxiv.org/abs/1702.05418v3",
    "download_url": "http://arxiv.org/abs/1702.05418v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Momentum exchange between an electromagnetic wave and a dispersive\n  medium",
    "abstract": "We present an elementary discussion of the momentum transferred by an\nelectromagnetic wave propagating in a dispersive medium. Our analysis is based\non Minkowski's electromagnetic momentum density which have been recently seen\nto be consistent with a fully covariant expression of the energy-momentum\ntensor of the electromagnetic field in a dispersive medium and with all the\nexperimental evidence. We show that the medium may be either pulled or pushed\nas the electromagnetic pulse enters in it depending on the value of the\nfrequency.",
    "authors": [
      "Rodrigo Medina",
      "J. Stephany"
    ],
    "publication_date": "2018-01-29T00:10:54Z",
    "arxiv_id": "http://arxiv.org/abs/1801.09323v1",
    "download_url": "http://arxiv.org/abs/1801.09323v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Air plasma key parameters for electromagnetic wave propagation at and\n  out of thermal equilibrium: applications to electromagnetic compatibility",
    "abstract": "This article addresses the importance of accurate characterization of plasma\nparameters for electromagnetic compatibility (EMC) purposes. Most of EMC issues\ninvolving plasma materials are obviously multi-physics problems (linking\nchemical, mechanical, thermal and electromagnetic wondering) with deep\ninteractions. One of the main objectives of this paper is to establish the\ntheoretical effect of thermal non-equilibrium on electromagnetic wave\npropagation. This will be characterized throughout plasma key parameters\n(including complex permittivity). Numerical simulations based upon Finite\nIntegral Technique (FIT) will demonstrate the EMC interest of this methodology\nfor shielding purposes and general air plasma.",
    "authors": [
      "P. Andre",
      "G Faure",
      "A Mahfouf",
      "S. Lalléchère"
    ],
    "publication_date": "2019-02-19T12:38:27Z",
    "arxiv_id": "http://arxiv.org/abs/1902.07026v1",
    "download_url": "http://arxiv.org/abs/1902.07026v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic self-force in the five dimensional Myers-Perry space\n  time",
    "abstract": "We calculate the effects of the electromagnetic self-force on a charged\nparticle outside a five dimensional Myers-Perry space-time. Based on our\nearlier work [1], we obtain the self-force using quaternions in Janis-Newman\nand Giampieri algorithms. In four dimensional rotating space-time the\nelectromagnetic self-force is repulsive at any point, however, in five\ndimensional rotational space-time, we find a point r0 where the electromagnetic\nself-force vanishes. For r < r0 (r > r0) the electromagnetic self-force is\nattractive (repulsive).",
    "authors": [
      "Hamideh Nadi",
      "Behrouz Mirza",
      "Zahra Mirzaiyan"
    ],
    "publication_date": "2019-04-13T14:10:19Z",
    "arxiv_id": "http://arxiv.org/abs/1904.06553v1",
    "download_url": "http://arxiv.org/abs/1904.06553v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Storage and retrieval of electromagnetic waves using electromagnetically\n  induced transparency in a nonlinear metamaterial",
    "abstract": "We investigate the storage and retrieval of electromagnetic waves using a\nnonlinear metamaterial, analogous to the electromagnetically induced\ntransparency (EIT) observed in atomic systems. We experimentally demonstrate\nthe storage of the electromagnetic wave by reducing an auxiliary \"control\"\nwave; the stored wave is then released by recovering the control wave. We also\nconfirm that the metamaterial can store and reproduce the phase distribution of\nthe original input wave. These effects confirm a remarkable analogy between the\nmetamaterial and an atomic EIT medium.",
    "authors": [
      "Toshihiro Nakanishi",
      "Masao Kitano"
    ],
    "publication_date": "2018-06-15T05:38:33Z",
    "arxiv_id": "http://arxiv.org/abs/1808.06595v1",
    "download_url": "http://arxiv.org/abs/1808.06595v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the creation of charged massless fermion pair by a photon in crossed\n  electromagnetic field",
    "abstract": "Creation of charged massless fermion pair by a photon in external constant\ncrossed electromagnetic field is considered. For this we use the expression of\nelastic scattering amplitude (EAS) of photon in the one-loop approximation of\nmassive quantum electrodynamics obtained earlier and calculate its massless\nlimit. We assume that the imaginary part of EAS of photon describes the total\nprobability of charged massless fermion pair creation in external\nelectromagnetic field. Photon emission by a charged massless fermion is also\nstudied in constant crossed electromagnetic field. We obtain the total\nprobability of photon emission calculating elastic scattering amplitude of\ncharged massive fermion in the electromagnetic field in the massless limit.",
    "authors": [
      "V. R. Khalilov"
    ],
    "publication_date": "2020-08-13T09:29:07Z",
    "arxiv_id": "http://arxiv.org/abs/2008.05771v1",
    "download_url": "http://arxiv.org/abs/2008.05771v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symmetry Principles and Group Theory in Electromagnetics",
    "abstract": "Group theory is used in many textbooks of contemporary physics. However,\nelectromagnetic community often considers group theory as an \"exotic\" tool.\nGraduate and postgraduate textbooks on electromagnetics and electrodynamics\nusually do not contain a description of properties of electromagnetic fields\nand waves on the basis of group theory. We discuss in this paper from the\ndidactic point of view, several types of symmetry and the corresponding groups\nand representations. The benefits of the use of group theoretical methods are a\nmore deep physical understanding of the electromagnetic phenomena and a\nsignificant reduction of numerical calculations. These methods are general and\nexact.",
    "authors": [
      "Victor Dmitriev"
    ],
    "publication_date": "2020-08-16T16:32:53Z",
    "arxiv_id": "http://arxiv.org/abs/2008.12644v1",
    "download_url": "http://arxiv.org/abs/2008.12644v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Interpretation of the Aharonov-Bohm Effect",
    "abstract": "The Aharonov-Bohm (A-B) effect showed that the phase of electron wave pattern\ncould be changed by the excluded electromagnetic field, the region where\nelectromagnetic field is zero. This apparent non-local effect has been\nexplained by mainly two salient interpretations called \"the interpretation of\nelectromagnetic potentials\" and \"the interpretation of interaction energy\". In\nthis paper the author reviews and investigates both the interpretations and\nanalysis their differences. Then the author clarifies in details and extend the\napproach of interaction energy interpretation and argue that as quantum\nmechanics involved energy of quantum systems and electromagnetic energy\ncontained in electromagnetic field, the natural and more physically acceptable\ninterpretation of the effect should be \"the interpretation of interaction\nenergy\".",
    "authors": [
      "Jay Solanki"
    ],
    "publication_date": "2021-05-14T15:47:35Z",
    "arxiv_id": "http://arxiv.org/abs/2105.07803v1",
    "download_url": "http://arxiv.org/abs/2105.07803v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dimensional reduction of electromagnetism",
    "abstract": "We derive one- and two-dimensional models for classical electromagnetism by\nmaking use of Hadamard's method of descent. Low-dimensional electromagnetism is\nconceived as a specialization of the higher dimensional one, in which the\nfields are uniform along the additional spatial directions. This strategy\nyields two independent electromagnetisms in two spatial coordinates, and four\nindependent electromagnetisms in one spatial coordinate.",
    "authors": [
      "Rocco Maggi",
      "Elisa Ercolessi",
      "Paolo Facchi",
      "Giuseppe Marmo",
      "Saverio Pascazio",
      "Francesco V. Pepe"
    ],
    "publication_date": "2021-11-11T16:45:17Z",
    "arxiv_id": "http://arxiv.org/abs/2111.10728v2",
    "download_url": "http://arxiv.org/abs/2111.10728v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic radiation and electromagnetic self-force of a point\n  charge in the vicinity of Schwarzschild black hole",
    "abstract": "Point charge, radially moving in the vicinity of a black hole is considered.\nElectromagnetic field in wave zone and in the small neighbourhood of the charge\nis calculated. Numerical results of the calculation of the spectrum of\nelectromagnetic radiation of the point charge are presented. Covariant approach\nfor the calculation of electromagnetic self-force is used for the case of the\nslowly moving charge. Numerical results for the self-force in the case of slow\nmotion of the particle are obtained and compared to the results in literature.",
    "authors": [
      "S. O. Komarov",
      "A. K. Gorbatsievich",
      "A. S. Garkun",
      "G. V. Vereshchagin"
    ],
    "publication_date": "2022-11-08T20:31:21Z",
    "arxiv_id": "http://arxiv.org/abs/2211.04544v1",
    "download_url": "http://arxiv.org/abs/2211.04544v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Analogs of Quantum Mechanical Tunnelling",
    "abstract": "In this paper, we introduce the theoretical framework underlying our proposed\nmethodology of verification and validation (V&V) for quantum mechanical\nemission models using analogous macroscopic electromagnetic systems. We derive\nthe correspondence between quantum mechanics and electromagnetism using the\ntransfer matrix approach, and describe the electromagnetic analog that will be\nused to anchor the atomistic quantum tunneling simulations. Finally, we\nillustrate this correspondence by comparing the quantum mechanical and\nelectromagnetic systems for some simple, analytically soluble examples and\noutline future V&V work based on the framework presented here.",
    "authors": [
      "Jeanne Riga",
      "Rebecca Seviour"
    ],
    "publication_date": "2022-11-28T15:05:33Z",
    "arxiv_id": "http://arxiv.org/abs/2211.16369v1",
    "download_url": "http://arxiv.org/abs/2211.16369v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Continuum Theory of Elastic-Ferromagnetic Conductors",
    "abstract": "In this paper, a phenomenological theory of saturated ferromagnetoelastic\nconductors is established using a multi-continuum model and the classical laws\nof mechanics, thermodynamics and electromagnetics. The theory is nonlinear and\nis valid for large deformations and strong electromagnetic fields. The\nconstitutive relations in the theory satisfy the saturation condition of the\nmagnetization vector. The theory is with full electromagnetic couplings as\ngoverned by the equations of electrodynamics. It can describe the interactions\nof elastic, electromagnetic and spin waves. The theory can be reduced to\nvarious quasistatic theories with appropriate approximations of the\nelectromagnetic fields. It is for anisotropic materials in general.",
    "authors": [
      "Jiashi Yang"
    ],
    "publication_date": "2023-07-31T13:47:07Z",
    "arxiv_id": "http://arxiv.org/abs/2307.16669v1",
    "download_url": "http://arxiv.org/abs/2307.16669v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cosmological electromagnetic hopfions",
    "abstract": "It is shown that any mathematical solution for null electromagnetic field\nknots in flat spacetime is also a null field knotted solution for cosmological\nelectromagnetic fields. This is obtained by replacing the time $t\\rightarrow\n\\tau=\\int dt/a$, where $a=a(t)$ is the scale factor of the Universe described\nby the Friedman-Lema\\^itre-Robertson-Walker (FLRW) cosmology, and by adequately\nrewriting the (empty flat spacetimes) electromagnetic fields solutions in a\nmedium defined by the FLRW metric. We found that the dispersion (evolution) of\nelectromagnetic Hopfions is faster on cosmological scenarios.\n  We discuss the implications of these results for different cosmological\nmodels.",
    "authors": [
      "Sergio A. Hojman",
      "Felipe A. Asenjo"
    ],
    "publication_date": "2023-08-14T13:48:56Z",
    "arxiv_id": "http://arxiv.org/abs/2308.07142v2",
    "download_url": "http://arxiv.org/abs/2308.07142v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]