[
  {
    "title": "Thermodynamics of Schwarzschild-de Sitter black hole: thermal stability\n  of Nariai black hole",
    "abstract": "We study thermodynamics of the Schwarzschild-de Sitter black hole in five\ndimensions by introducing two temperatures based on the standard and\nBousso-Hawking normalizations. We use the first-law of thermodynamics to derive\nthermodynamic quantities. The two temperatures indicate that the Nariai black\nhole is thermodynamically unstable. However, it seems that black hole\nthermodynamics favors the standard normalization, and does not favor the\nBousso-Hawking normalization.",
    "authors": [
      "Yun Soo Myung"
    ],
    "publication_date": "2007-12-20T01:01:06Z",
    "arxiv_id": "http://arxiv.org/abs/0712.3315v2",
    "download_url": "http://arxiv.org/abs/0712.3315v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complementary role of the pressure in the black hole thermodynamics",
    "abstract": "In black hole thermodynamics of certain models, the thermodynamic first law\nmay contain the pressure term. The corresponding entropy follows the area law\nwhereas the thermodynamic energy is not the same with the black hole mass. If\nthe pressure can be decomposed into two parts and recombined with the original\nthermodynamic quantities, then the thermodynamic energy becomes the black hole\nmass and the entropy satisfying the area law turns out to be the corrected\nentropy called the Wald entropy, respectively.",
    "authors": [
      "Edwin J. Son",
      "Wontae Kim"
    ],
    "publication_date": "2013-03-03T12:33:59Z",
    "arxiv_id": "http://arxiv.org/abs/1303.0491v2",
    "download_url": "http://arxiv.org/abs/1303.0491v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the ensemble dependence in black hole geometrothermodynamics",
    "abstract": "We investigate the dependence of thermodynamic properties of black holes on\nthe choice of statistical ensemble for a particular class of\nEinstein-Maxwell-Gauss-Bonnet black holes with cosmological constant. We use\npartial Legendre transformations in the thermodynamic limit in order to compare\nthe results in different ensembles, and show that the phase transition\nstructure depend on the choice of thermodynamic potential. This result implies\nthat thermodynamic metrics which are partially Legendre invariant cannot be\nemployed to describe black hole thermodynamics, and partly explains why a\nparticular thermodynamic metric has been used so far in the framework of black\nhole geometrothermodynamics.",
    "authors": [
      "Hernando Quevedo",
      "Alberto Sanchez",
      "Safia Taj"
    ],
    "publication_date": "2013-04-14T22:05:42Z",
    "arxiv_id": "http://arxiv.org/abs/1304.3954v1",
    "download_url": "http://arxiv.org/abs/1304.3954v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Geometry of Reissener-Nordström-de Sitter black hole\n  and its extremal case",
    "abstract": "We study the thermodynamics and the different thermodynamic geometric methods\nof Reissener-Nordstr\\\"{o}m-de Sitter black hole and its extremal case, which is\nsimilar to the de Sitter black hole coupled to a scalar field, rather called an\nMTZ black hole. While studying the thermodynamics of the systems, we could find\nsome abnormalities. In both cases, the thermodynamic geometric methods could\ngive the correct explanation for the all abnormal thermodynamic behaviors in\nthe system.",
    "authors": [
      "R. Tharanath",
      "Jishnu Suresh",
      "Nijo Varghese",
      "V. C. Kuriakose"
    ],
    "publication_date": "2014-04-27T17:04:28Z",
    "arxiv_id": "http://arxiv.org/abs/1404.6789v1",
    "download_url": "http://arxiv.org/abs/1404.6789v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Black holes and Boyle's law -- the thermodynamics of the cosmological\n  constant",
    "abstract": "When the cosmological constant, $\\Lambda$, is interpreted as a thermodynamic\nvariable in the study of black hole thermodynamics a very rich structure\nemerges. It is natural to interpret $\\Lambda$ as a pressure and define the\nthermodynamically conjugate variable to be the thermodynamic volume of the\nblack hole (which need not bear any relation to the geometric volume). Recent\nprogress in this new direction for black hole thermodynamics is reviewed.",
    "authors": [
      "Brian P. Dolan"
    ],
    "publication_date": "2014-08-18T14:40:53Z",
    "arxiv_id": "http://arxiv.org/abs/1408.4023v1",
    "download_url": "http://arxiv.org/abs/1408.4023v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Geometry and Phase Transitions of AdS Braneworld Black\n  Holes",
    "abstract": "The thermodynamics and phase transitions of charged RN-AdS and rotating\nKerr-AdS black holes in a generalized Randall-Sundrum braneworld are\ninvestigated in the framework of thermodynamic geometry. A detailed analysis of\nthe thermodynamics, stability and phase structures in the canonical and the\ngrand canonical ensembles for these AdS braneworld black holes are described.\nThe thermodynamic curvatures for both these AdS braneworld black holes are\ncomputed and studied as a function of the thermodynamic variables. Through this\nanalysis we illustrate an interesting dependence of the phase structures on the\nbraneworld parameter for these black holes.",
    "authors": [
      "Pankaj Chaturvedi",
      "Gautam Sengupta"
    ],
    "publication_date": "2015-01-30T12:28:27Z",
    "arxiv_id": "http://arxiv.org/abs/1501.07748v2",
    "download_url": "http://arxiv.org/abs/1501.07748v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic response functions and Maxwell relations for a Kerr black\n  hole",
    "abstract": "Assuming the existence of a fundamental thermodynamic relation, the classical\nthermodynamics of a black hole with mass and angular momentum is given. New\ndefinitions of response functions and $TdS$ equations are introduced and\nmathematical analogous of the Euler equation and Gibbs-Duhem relation are\nfounded. Thermodynamic stability is studied from concavity conditions,\nresulting in an unstable equilibrium at all the domain except for a region of\nlocal stable equilibrium. Maxwell relations are written, allowing to build the\nthermodynamic squares. Our results shown an interesting analogy between\nthermodynamics of gravitational and magnetic systems.",
    "authors": [
      "L. Escamilla",
      "J. Torres-Arenas"
    ],
    "publication_date": "2015-06-16T19:50:12Z",
    "arxiv_id": "http://arxiv.org/abs/1507.04929v1",
    "download_url": "http://arxiv.org/abs/1507.04929v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of noncommutative quantum Kerr black holes",
    "abstract": "Thermodynamic formalism for rotating black holes, characterized by\nnoncommutative and quantum corrections, is constructed. From a fundamental\nthermodynamic relation, equations of state and thermodynamic response functions\nare explicitly given and the effect of noncommutativity and quantum correction\nis discussed. It is shown that the well known divergence exhibited in specific\nheat is not removed by any of these corrections. However, regions of\nthermodynamic stability are affected by noncommutativity, increasing the\navailable states for which some thermodynamic stability conditions are\nsatisfied.",
    "authors": [
      "L. F. Escamilla-Herrera",
      "E. Mena-Barboza",
      "J. Torres-Arenas"
    ],
    "publication_date": "2016-02-16T06:57:15Z",
    "arxiv_id": "http://arxiv.org/abs/1602.05989v3",
    "download_url": "http://arxiv.org/abs/1602.05989v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information and the second law of thermodynamics",
    "abstract": "The second law of classical thermodynamics, based on the positivity of the\nentropy production, only holds for deterministic processes. Therefore the\nSecond Law in stochastic quantum thermodynamics may not hold. By making a\nfundamental connection between thermodynamics and information theory we will\nintroduce a new way of defining the Second Law which holds for both\ndeterministic classical and stochastic quantum thermodynamics. Our work\nincorporates information well into the Second Law and also provides a\nthermodynamic operational meaning for negative and positive entropy production.",
    "authors": [
      "B. Ahmadi",
      "S. Salimi",
      "A. S. Khorashad"
    ],
    "publication_date": "2018-09-03T14:11:22Z",
    "arxiv_id": "http://arxiv.org/abs/1809.00611v3",
    "download_url": "http://arxiv.org/abs/1809.00611v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Black Hole with Modified Chaplygin Gas as a Heat Engine",
    "abstract": "We assume that the negative cosmological constant as a thermodynamical\npressure and the asymptotically anti-de Sitter (AdS) black hole thermodynamics\nwith modified Chaplygin gas. We have written the mass of the black hole,\nvolume, entropy and temperature due to the thermodynamic system. We find a new\nsolution of Einstein's field equations of AdS black hole with modified\nChaplygin gas as a thermodynamic system. We also examine the weak, strong and\ndominant energy conditions for the source fluid of black hole. We also show\nthat the thermodynamic black hole with Chaplygin gas can be considered as a\nheat engine and then we calculate work done and its efficiency by this system.",
    "authors": [
      "Ujjal Debnath"
    ],
    "publication_date": "2019-03-11T15:43:54Z",
    "arxiv_id": "http://arxiv.org/abs/1903.04379v1",
    "download_url": "http://arxiv.org/abs/1903.04379v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "No Entropy Production in Quantum Thermodynamics",
    "abstract": "In this work we will show that there exists a fundamental difference between\nmicroscopic quantum thermodynamics and macroscopic classical thermodynamics. It\nwill be proved that the entropy production in quantum thermodynamics always\nvanishes for both closed and open quantum thermodynamic systems. This novel and\nvery surprising result is derived based on the genuine reasoning Clausius used\nto establish the science of thermodynamics in the first place. This result will\ninterestingly lead to define the generalized temperature for any\nnon-equilibrium quantum system.",
    "authors": [
      "B. Ahmadi",
      "S. Salimi",
      "A. S. Khorashad"
    ],
    "publication_date": "2020-02-25T09:04:04Z",
    "arxiv_id": "http://arxiv.org/abs/2002.10747v1",
    "download_url": "http://arxiv.org/abs/2002.10747v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of markets",
    "abstract": "We consider the thermodynamic approach to the description of economic systems\nand processes. The first and second laws of thermodynamics as applied to\neconomic systems are derived and analyzed. It is shown that there is a deep\nanalogy between the parameters of thermodynamic and economic systems (markets);\nin particular, each thermodynamic parameter can be associated with a certain\neconomic parameter or indicator. The economic meaning of such primordially\nthermodynamic concepts as pressure, volume, internal energy, heat, etc. has\nbeen established. The thermostatistics of the market is considered. It is shown\nthat, as in conventional thermostatistics, many market parameters, such as\nprice of goods, quantity of goods, etc., as well as their fluctuations can be\ncalculated formally using the partition function of an economic system.",
    "authors": [
      "Sergey Rashkovskiy"
    ],
    "publication_date": "2020-10-14T18:41:57Z",
    "arxiv_id": "http://arxiv.org/abs/2010.10260v1",
    "download_url": "http://arxiv.org/abs/2010.10260v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "NED-AdS black holes, extended phase space thermodynamics and\n  Joule--Thomson expansion",
    "abstract": "We study and discuss the critical behavior of charged by nonlinear\nelectrodynamics (NED) AdS black holes in an extended phase space. The negative\ncosmological constant is treated as a thermodynamic pressure and the black hole\nmass is considered as the chemical enthalpy. We show the analogy of\nthermodynamics and phase transitions studied with the Van der Waals liquid-gas\nsystem. We introduce new thermodynamic quantities conjugated to the NED\ncoupling and a magnetic charge. It was demonstrated that the first low of black\nhole thermodynamics and the Smarr relation hold. We have calculated the\nJoule--Thomson thermodynamic coefficient and inversion temperature and the\nJoule--Thomson adiabatic expansion is investigated.",
    "authors": [
      "S. I. Kruglov"
    ],
    "publication_date": "2022-09-17T15:27:44Z",
    "arxiv_id": "http://arxiv.org/abs/2209.10524v1",
    "download_url": "http://arxiv.org/abs/2209.10524v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hamiltonian thermodynamics on symplectic manifolds",
    "abstract": "We describe a symplectic approach to thermodynamics in which thermodynamic\ntransformations are described by Hamiltonian dynamics on thermodynamic spaces.\nBy identifying the spaces of equilibrium states with Lagrangian submanifolds of\na symplectic manifold, we construct a Hamiltonian description of thermodynamic\nprocesses where the space of equilibrium states of a system in a certain\nensemble is the level set on which the Hamiltonian takes a constant value. In\nparticular, we work out two explicit examples involving the ideal gas. Finally,\nwe describe a Hamiltonian approach towards constructing maps between related\nthermodynamic systems, e.g., the ideal (non-interacting) gas and interacting\ngases.",
    "authors": [
      "Aritra Ghosh",
      "E. Harikumar"
    ],
    "publication_date": "2024-10-06T21:10:32Z",
    "arxiv_id": "http://arxiv.org/abs/2410.04622v1",
    "download_url": "http://arxiv.org/abs/2410.04622v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamically Consistent Lindbladians for Quantum Stochastic\n  Thermodynamics",
    "abstract": "We develop a Lindblad framework for quantum stochastic thermodynamics to\nstudy the nonequilibrium thermodynamics of open quantum systems. Our approach\nadopts the local quantum detailed balance condition, ensuring thermodynamic\nconsistency and leading to a joint fluctuation theorem of quantum work and\nheat. Instead of solving the full evolution of the density matrix, we employ an\neffective parametrization to derive the full counting statistics of work and\nheat and determine the optimal protocols. As an application, we refine the\nquantum Brownian motion master equation to ensure the quantum detailed balance\ncondition, derive the optimal protocols at different temperatures, and study\nthe work statistics. Our framework provides fundamental insights and practical\nstrategies for optimizing thermodynamic processes in open quantum systems.",
    "authors": [
      "Jin-Fu Chen"
    ],
    "publication_date": "2025-02-27T14:10:21Z",
    "arxiv_id": "http://arxiv.org/abs/2502.20118v1",
    "download_url": "http://arxiv.org/abs/2502.20118v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A thermodynamical suspension model for blood",
    "abstract": "A complete thermodynamical analysis for a blood model, based on mixture\ntheory, is performed. The model is developed considering the blood as a\nsuspension of red blood cells (solid component) in the plasma (fluid\ncomponent), and taking into account the temperature effects. Furthermore, two\nindependent scalar internal variables are introduced accounting for additional\ndissipative effects. Using Clausius-Duhem inequality, the general thermodynamic\nrestrictions and residual dissipation inequality are derived. The thermodynamic\nadmissibility with the second law of thermodynamics is assessed by means of the\nextended Coleman-Noll procedure; in one space dimension we exhibit a solution\nof all the thermodynamical constraints.",
    "authors": [
      "M. Gorgone",
      "C. F. Munafo'",
      "A. Palumbo",
      "P. Rogolino"
    ],
    "publication_date": "2025-05-29T14:34:22Z",
    "arxiv_id": "http://arxiv.org/abs/2506.00067v1",
    "download_url": "http://arxiv.org/abs/2506.00067v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Notes on the Generalised Second Law of Thermodynamics",
    "abstract": "Several comments are given to previous proofs of the generalised second law\nof thermodynamics: black hole entropy plus ordinary matter entropy never\ndecreases for a thermally closed system. Arguments in favour of its truism are\ngiven in the spirit of conventional thermodynamics.",
    "authors": [
      "S. -T. Sung"
    ],
    "publication_date": "1997-03-22T22:56:25Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9703063v1",
    "download_url": "http://arxiv.org/abs/gr-qc/9703063v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A thermodynamic cycle more efficient than an infinite set of carnot\n  engines operating between the same temperature levels",
    "abstract": "A theoretical thermodynamic cycle more efficient than an infinite set of\nCarnot engines is presented. This result is unexpected from the point of view\nof classical thermodynamics.",
    "authors": [
      "Jose Belandria"
    ],
    "publication_date": "2005-10-12T03:15:24Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0510105v2",
    "download_url": "http://arxiv.org/abs/physics/0510105v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of rotating black holes and black rings: phase\n  transitions and thermodynamic volume",
    "abstract": "In this review we summarize, expand, and set in context recent developments\non the thermodynamics of black holes in extended phase space, where the\ncosmological constant is interpreted as thermodynamic pressure and treated as a\nthermodynamic variable in its own right. We specifically consider the\nthermodynamics of higher-dimensional rotating asymptotically flat and AdS black\nholes and black rings in a canonical (fixed angular momentum) ensemble. We plot\nthe associated thermodynamic potential-the Gibbs free energy-and study its\nbehaviour to uncover possible thermodynamic phase transitions in these black\nhole spacetimes. We show that the multiply-rotating Kerr-AdS black holes\nexhibit a rich set of interesting thermodynamic phenomena analogous to the\n\"every day thermodynamics\" of simple substances, such as reentrant phase\ntransitions of multicomponent liquids, multiple first-order solid/liquid/gas\nphase transitions, and liquid/gas phase transitions of the Van der Waals type.\nFurthermore, the reentrant phase transitions also occur for multiply-spinning\nasymptotically flat Myers-Perry black holes. The thermodynamic volume, a\nquantity conjugate to the thermodynamic pressure, is studied for AdS black\nrings and demonstrated to satisfy the reverse isoperimetric inequality; this\nprovides a first example of calculation confirming the validity of\nisoperimetric inequality conjecture for a black hole with non-spherical horizon\ntopology. The equation of state P=P(V,T) is studied for various black holes\nboth numerically and analytically-in the ultraspinning and slow rotation\nregimes.",
    "authors": [
      "Natacha Altamirano",
      "David Kubiznak",
      "Robert B. Mann",
      "Zeinab Sherkatghanad"
    ],
    "publication_date": "2014-01-12T02:45:03Z",
    "arxiv_id": "http://arxiv.org/abs/1401.2586v1",
    "download_url": "http://arxiv.org/abs/1401.2586v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytic phase structures and thermodynamic curvature for the charged\n  AdS black hole in alternative phase space",
    "abstract": "In this paper, we visit the thermodynamic criticality and thermodynamic\ncurvature of the charged AdS black hole in a new phase space. It is shown that\nwhen the square of the total charge of the charged black hole is considered as\na thermodynamic quantity, the charged AdS black hole also admits an van der\nWaals-type critical behavior without the help of thermodynamic pressure and\nthermodynamic volume. Based on this, we study the fine phase structures of the\ncharged AdS black hole with fixed AdS background in the new framework. On the\none hand, we give the phase diagram structures of the charged AdS black hole\naccurately and analytically, which fills up the gap in dealing with the phase\ntransition of the charged AdS black holes by taking the square of the charge as\na thermodynamic quantity. On the other hand, we analyse the thermodynamic\ncurvature of the black hole in two coordinate spaces. The thermodynamic\ncurvatures obtained in two different coordinate spaces are equivalent to each\nother and are also positive. Based on an empirical conclusion under the\nframework of thermodynamic geometry, we speculate that when the square of\ncharge is treated as an independent thermodynamic quantity, the charged AdS\nblack hole is likely to present a repulsive between its molecules. More\nimportantly, based on the thermodynamic curvature, we obtain an universal\nexponent at the critical point of phase transition.",
    "authors": [
      "Zhen-Ming Xu"
    ],
    "publication_date": "2020-11-13T02:56:56Z",
    "arxiv_id": "http://arxiv.org/abs/2011.06736v1",
    "download_url": "http://arxiv.org/abs/2011.06736v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric thermodynamics for the Fokker-Planck equation: Stochastic\n  thermodynamic links between information geometry and optimal transport",
    "abstract": "We propose a geometric theory of non-equilibrium thermodynamics, namely\ngeometric thermodynamics, using our recent developments of\ndifferential-geometric aspects of entropy production rate in non-equilibrium\nthermodynamics. By revisiting our recent results on geometrical aspects of\nentropy production rate in stochastic thermodynamics for the Fokker-Planck\nequation, we introduce a geometric framework of non-equilibrium thermodynamics\nin terms of information geometry and optimal transport theory. We show that the\nproposed geometric framework is useful for obtaining several non-equilibrium\nthermodynamic relations, such as thermodynamic trade-off relations between the\nthermodynamic cost and the fluctuation of the observable, optimal protocols for\nthe minimum thermodynamic cost and the decomposition of the entropy production\nrate for the non-equilibrium system. We clarify several\nstochastic-thermodynamic links between information geometry and optimal\ntransport theory via the excess entropy production rate based on a relation\nbetween the gradient flow expression and information geometry in the space of\nprobability densities and a relation between the velocity field in optimal\ntransport and information geometry in the space of path probability densities.",
    "authors": [
      "Sosuke Ito"
    ],
    "publication_date": "2022-09-01T15:21:37Z",
    "arxiv_id": "http://arxiv.org/abs/2209.00527v9",
    "download_url": "http://arxiv.org/abs/2209.00527v9",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The thermodynamic cost of choosing",
    "abstract": "Choice can be defined in thermodynamical terms and be shown to have a\nthermodynamic cost: choosing between a binary alternative at temperature T\ndissipates an energy E > kT ln 2.",
    "authors": [
      "Carlo Rovelli"
    ],
    "publication_date": "2023-09-13T19:10:00Z",
    "arxiv_id": "http://arxiv.org/abs/2309.08557v2",
    "download_url": "http://arxiv.org/abs/2309.08557v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-Time Processes In Quantum Thermodynamics: The Limits Of\n  Irreversibility",
    "abstract": "The emergence of irreversibility in physical processes, despite the\nfundamentally reversible nature of quantum mechanics, remains an open question\nin physics. This thesis explores the intricate relationship between quantum\nmechanics and thermodynamics, with a particular focus on minimizing entropy\nproduction in finite-time processes. By employing tools from quantum\ninformation theory and geometric thermodynamics, we tackle the challenge of\nderiving irreversible thermodynamic behavior from the reversible microscopic\nframework of quantum mechanics. We begin with a comprehensive review of the\nlaws of thermodynamics, setting the stage for the subsequent analyses. We\nintroduce novel developments in quantum thermodynamics through a generalized\nframework for geometric thermodynamics, which enables the derivation of\nfinite-time corrections beyond the Markovian regime. Building on this\nfoundation, we extend Landauer's principle by incorporating a finite-time\ncorrection that highlights the necessity of strong coupling for optimal\ninformation erasure processes. This result underscores the emergence of\nPlanckian time as a fundamental speed limit to thermalization. Additionally, we\nexplore how collective effects can be harnessed to reduce energy dissipation in\nthermodynamic operations, revealing that classical correlations between systems\ncan significantly mitigate dissipation, though this may pose new questions\nregarding the third law of thermodynamics. Finally, we optimize thermodynamic\nprocesses in mesoscopic systems, including quantum dot engines and information\nengines. These findings not only enhance our understanding of the fundamental\nlimits of irreversibility but also open new avenues for research. Future works\nwill focus on fully exploiting collective effects, aligning these with the\nthird law of thermodynamics, and understanding the thermodynamic consistency of\nmaster equations.",
    "authors": [
      "Alberto Rolandi"
    ],
    "publication_date": "2024-10-24T16:48:24Z",
    "arxiv_id": "http://arxiv.org/abs/2410.18903v1",
    "download_url": "http://arxiv.org/abs/2410.18903v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Uncertainty Relation for $f$-divergence Entropy Production",
    "abstract": "We propose an $f$-divergence extension of the Hasegawa-Nishiyama\nthermodynamic uncertainty relation. More precisely, we introduce the stochastic\nthermodynamic entropy production based on generalised $f$-divergences and\nderive corresponding uncertainty relations in connection with the symmetry\nentropy.",
    "authors": [
      "Yi C. Huang",
      "Xinhang Tong"
    ],
    "publication_date": "2025-04-16T07:14:01Z",
    "arxiv_id": "http://arxiv.org/abs/2504.11821v1",
    "download_url": "http://arxiv.org/abs/2504.11821v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Causal Thermodynamics in Relativity",
    "abstract": "I review the causal relativistic thermodynamics developed by Israel and\nStewart, and discuss some applications in cosmology and astrophysics. The\nlectures begin with an overview of relativistic fluid dynamics (in a covariant\nformalism) and equilibrium thermodynamics. Causal bulk viscosity in cosmology\nis considered in detail, including some new results.",
    "authors": [
      "Roy Maartens"
    ],
    "publication_date": "1996-09-18T14:20:32Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/9609119v1",
    "download_url": "http://arxiv.org/abs/astro-ph/9609119v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamical Bethe Ansatz and Condensed Matter",
    "abstract": "The basics of the thermodynamic Bethe ansatz equation are given. The simplest\ncase is repulsive delta function bosons, the thermodynamic equation contains\nonly one unknown function. We also treat the XXX model with spin 1/2 and the\nXXZ model and the XYZ model. This method is very useful for the investigation\nof the low temperature thermodynamics of solvable systems.",
    "authors": [
      "Minoru Takahashi"
    ],
    "publication_date": "1997-08-12T13:45:46Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9708087v1",
    "download_url": "http://arxiv.org/abs/cond-mat/9708087v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-equilibrium Thermodynamics and Hydrodynamic Fluctuations",
    "abstract": "The reformulation of nonequilibirum thermodynamics, to include the treatment\nof thermodynamic fluctuations, is applied to the hydrodynamic fluctuations of a\nsimple fluid. It is shown that the nonequilibrium thermodynamic scheme leads to\nthe explicit form of the Fokker-Planck equation which describes the time\nbehaviour of the probability distribution function of these hydrodynamic\nfluctuations as well as the irreversible processes which are connected with\nthis behaviour.",
    "authors": [
      "J. M. Rubi",
      "P. Mazur"
    ],
    "publication_date": "1999-09-09T15:15:33Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9909137v1",
    "download_url": "http://arxiv.org/abs/cond-mat/9909137v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics Far from Equilibrium: from Glasses to Black Holes",
    "abstract": "A framework for the non-equilibrium thermodynamics of glasses is discussed.\nIt also explains the non-equilibrium thermodynamics of a black hole isolated\nfrom matter. The first and second laws of black dynamics and black hole\nthermodynamics are shown to coincide, while the third laws deal with different\nissues.",
    "authors": [
      "Th. M. Nieuwenhuizen"
    ],
    "publication_date": "2001-03-02T16:18:20Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0103063v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0103063v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Thermodynamic Sector of Quantum Gravity",
    "abstract": "The connection between gravity and thermodynamics is explored. Examining a\nperfect fluid in gravitational equilibrium we find that the entropy is extremal\nonly if Einstein's equations are satisfied. Conversely, one can derive part of\nEinstein's equations from ordinary thermodynamical considerations. This allows\nthe theory of this system to be recast in such a way that a sector of general\nrelativity is purely thermodynamical and should not be quantized.",
    "authors": [
      "J. Oppenheim"
    ],
    "publication_date": "2001-12-04T01:36:24Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0112001v1",
    "download_url": "http://arxiv.org/abs/gr-qc/0112001v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of the φ^4 theory in tadpole approximation",
    "abstract": "Relying on the Luttinger-Ward theorem we derive a thermodynamically\nselfconsistent and scale independent approximation of the thermodynamic\npotential for the scalar $\\phi^4$ theory in the tadpole approximation. The\nresulting thermodynamic potential as a function of the temperature is similar\nto the one of the recently proposed screened perturbation theory.",
    "authors": [
      "A. Peshier",
      "B. Kämpfer",
      "O. P. Pavlenko",
      "G. Soff"
    ],
    "publication_date": "1998-01-19T15:19:23Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/9801344v1",
    "download_url": "http://arxiv.org/abs/hep-ph/9801344v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Conformal Version of Black Hole Thermodynamics",
    "abstract": "The conformal thermodynamics of rotating charged black holes in general\nrelativity and string theory is proposed by considering the first laws of\nthermodynamics for a pair of systems made up of the two horizons of a\nKerr-Newman or Kerr-Sen black hole. These two systems are constructed by only\ndemanding their ``horizon areas'' to be the sum and difference of that of the\nouter and inner horizons of their prototype. The thermodynamics present here is\na ``conformal version'' of black hole thermodynamics, since it is closely\nrelated to the near-horizon conformal symmetry of black holes. The concept of\nnon-quasinormal modes recently proposed by D. Birmingham and S. Carlip [9] is\ncompatible with this ``conformal thermodynamics'', rather than the usual\n``horizon thermodynamics''. In addition, we show that this conformal\nthermodynamics resembles to the thermodynamics of effective string or D-brane\nmodels, since the two newly-constructed systems bear a striking resemblance to\nthe right- and left-movers in string theory and D-brane physics.",
    "authors": [
      "Shuang-Qing Wu"
    ],
    "publication_date": "2004-10-30T03:00:52Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/0411002v2",
    "download_url": "http://arxiv.org/abs/hep-th/0411002v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemical Equilibrium as Balance of the Thermodynamic Forces",
    "abstract": "The article sets forth comprehensive basics of thermodynamics of chemical\nequilibrium as balance of the thermodynamic forces. Based on the linear\nequations of irreversible thermodynamics, De Donder definition of the\nthermodynamic force, and Le Chatelier's principle, new thermodynamics of\nchemical equilibrium offers an explicit account for multiple chemical\ninteractions within the system. Basic relations between energetic\ncharacteristics of chemical transformations and reaction extents are based on\nthe idea of chemical equilibrium as balance between internal and external\nthermodynamic forces, which is presented in the form of a logistic equation,\ncontaining only one new parameter. Solutions to the basic equation define the\ndomain of states of the chemical system, from true equilibrium to true chaos.\nThe new theory is derived exclusively from the currently recognized ideas and\ncovers equilibrium thermodynamics as well as non-equilibrium thermodynamics in\na unique concept.",
    "authors": [
      "B. Zilbergleyt"
    ],
    "publication_date": "2004-04-16T21:26:29Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0404082v1",
    "download_url": "http://arxiv.org/abs/physics/0404082v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Casimir Effect and Thermodynamic Instability",
    "abstract": "One loop field theory calculations of free energies quite often yield\nviolations of the stability conditions associated with the thermodynamic second\nlaw. Perhaps the best known example involves the equation of state of black\nholes. Here, it is pointed out that the Casimir force between two parallel\nconducting plates also violates a thermodynamic stability condition normally\nassociated with the second law of thermodynamics.",
    "authors": [
      "A. Widom",
      "E. Sassaroli",
      "Y. N. Srivastava",
      "J. Swain"
    ],
    "publication_date": "1998-03-04T22:05:12Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9803013v1",
    "download_url": "http://arxiv.org/abs/quant-ph/9803013v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Macroscopic Thermodynamical Witnesses of Quantum Entanglement",
    "abstract": "We show that macroscopic thermodynamical properties - such as functions of\ninternal energy and magnetization - can detect quantum entanglement in solids\nat nonzero temperatures in the thermodynamical limit. We identify the parameter\nregions (critical values of magnetic field and temperature) within which\nentanglement is witnessed by these thermodynamical quantities.",
    "authors": [
      "Caslav Brukner",
      "Vlatko Vedral"
    ],
    "publication_date": "2004-06-07T19:02:31Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0406040v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0406040v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Positive and negative entropy production in thermodynamics systems",
    "abstract": "This article presents a heuristic combination of the local and global\nformulations of the second law of thermodynamics that suggests the possibility\nof theoretical existence of thermodynamics processes with positive and negative\nentropy production.Such processes may exhibit entropy couplings that reveal an\nunusual behavior from the point of view of conventional thermodynamics.",
    "authors": [
      "Jose Iraides Belandria"
    ],
    "publication_date": "2008-12-30T22:19:42Z",
    "arxiv_id": "http://arxiv.org/abs/0901.0023v2",
    "download_url": "http://arxiv.org/abs/0901.0023v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Kinetic equilibrium and relativistic thermodynamics",
    "abstract": "Relativistic thermodynamics is treated from the point of view of kinetic\ntheory. It is shown that the generalized J\\\"uttner distribution suggested in\n[1] is compatible with kinetic equilibrium. The requirement of compatibility of\nkinetic and thermodynamic equilibrium reveals several generalizations of the\nGibbs relation where the velocity field is an independent thermodynamic\nvariable.",
    "authors": [
      "P. Ván"
    ],
    "publication_date": "2011-02-01T23:36:43Z",
    "arxiv_id": "http://arxiv.org/abs/1102.0323v1",
    "download_url": "http://arxiv.org/abs/1102.0323v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic derivation and use of a nonequilibrium canonical ensemble",
    "abstract": "A thermodynamic expression for the analog of the canonical ensemble for\nnonequilibrium systems is described based on a purely information theoretical\ninterpretation of entropy. As an application, it is shown that this\nnonequilibrium canonical distribution implies some important results from\nnonequilibrium thermodynamics, specifically, the fluctuation theorem and the\nJarzynski-equality.",
    "authors": [
      "Maarten H. P. Ambaum"
    ],
    "publication_date": "2011-03-29T14:59:26Z",
    "arxiv_id": "http://arxiv.org/abs/1103.5671v1",
    "download_url": "http://arxiv.org/abs/1103.5671v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of continua: the challenge of universality",
    "abstract": "The explanation of the apparent universality of thermodynamics points toward\nthe extension of the usual conceptual background of the second law. Arguments\nare collected that a basic guiding idea of stability of thermodynamic\nequilibrium combined with a proper interpretation of the entropy principle may\nprovide the necessary solid foundation with verifiable consequences.",
    "authors": [
      "P. Ván"
    ],
    "publication_date": "2013-05-14T16:42:41Z",
    "arxiv_id": "http://arxiv.org/abs/1305.3582v1",
    "download_url": "http://arxiv.org/abs/1305.3582v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Photon gas in a finite box: thermodynamics and finite size effects",
    "abstract": "Thermodynamic properties of a photon gas in a small box are explored taking\ninto account finite size effects. General thermodynamic relations are derived\nfor this finite system. Photon gas thermodynamic functions are calculated for\nthe case of cuboid cavity on the basis of first principles. New finite size\neffects are discussed.",
    "authors": [
      "A. A. Sokolsky",
      "M. A. Gorlach"
    ],
    "publication_date": "2013-06-29T13:47:18Z",
    "arxiv_id": "http://arxiv.org/abs/1307.0105v1",
    "download_url": "http://arxiv.org/abs/1307.0105v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic curvature and black holes",
    "abstract": "I give a relatively broad survey of thermodynamic curvature $R$, one spanning\nresults in fluids and solids, spin systems, and black hole thermodynamics. $R$\nresults from the thermodynamic information metric giving thermodynamic\nfluctuations. $R$ has a unique status in thermodynamics as being a geometric\ninvariant, the same for any given thermodynamic state. In fluid and solid\nsystems, the sign of $R$ indicates the character of microscopic interactions,\nrepulsive or attractive. $|R|$ gives the average size of organized mesoscopic\nfluctuating structures. The broad generality of thermodynamic principles might\nlead one to believe the same for black hole thermodynamics. This paper explores\nthis issue with a systematic tabulation of results in a number of cases.",
    "authors": [
      "George Ruppeiner"
    ],
    "publication_date": "2013-09-04T02:58:01Z",
    "arxiv_id": "http://arxiv.org/abs/1309.0901v2",
    "download_url": "http://arxiv.org/abs/1309.0901v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The intrinsic curvature of thermodynamic potentials for black holes with\n  critical points",
    "abstract": "The geometry of thermodynamic state space is studied for asymptotically\nanti-de Sitter black holes in D-dimensional space times. Convexity of\nthermodynamic potentials and the analytic structure of the response functions\nis analysed. The thermodynamic potentials can be used to define a metric on the\nspace of thermodynamic variables and two commonly used such metrics are the\nWeinhold metric, derived from the internal energy, and the Ruppeiner metric,\nderived from the entropy. The intrinsic curvature of these metrics is\ncalculated for charged and for rotating black holes and it is shown that the\ncurvature diverges when heat capacities diverge but, contrary to general\nexpectations, the singularities in the Ricci scalars do not reflect the\ncritical behaviour.\n  When a cosmological constant is included as a state space variable it can be\ninterpreted as a pressure and the thermodynamically conjugate variable as a\nthermodynamic volume. The geometry of the resulting extended thermodynamic\nstate space is also studied, in the context of rotating black holes, and there\nare curvature singularities when the heat capacity at constant angular velocity\ndiverges and when the black hole is incompressible. Again the critical\nbehaviour is not visible in the singularities of the thermodynamic Ricci\nscalar.",
    "authors": [
      "Brian P. Dolan"
    ],
    "publication_date": "2015-04-12T10:11:09Z",
    "arxiv_id": "http://arxiv.org/abs/1504.02951v1",
    "download_url": "http://arxiv.org/abs/1504.02951v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A short note on Reitlinger thermodynamic cycles",
    "abstract": "It is well known that Carnot cycle is the thermodynamic cycle which has the\nbest thermal efficiency. However, an entire class of cycles exists that can\nhave the same maximum efficiency: this class is that of the regenerative\nReitlinger cycles. Here we discuss them.",
    "authors": [
      "Amelia Carolina Sparavigna"
    ],
    "publication_date": "2015-10-01T12:27:11Z",
    "arxiv_id": "http://arxiv.org/abs/1510.00382v1",
    "download_url": "http://arxiv.org/abs/1510.00382v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hill's nano-thermodynamics is equivalent with Gibbs' thermodynamics for\n  curved surfaces",
    "abstract": "We review first how properties of curved surfaces can be studied using Hill's\nthermodynamics, also called nano-thermodynamics. We proceed to show for the\nfirst time that Hill's analysis is equivalent to Gibbs for curved surfaces.\nThis simplifies the study of surfaces that are curved on the nano-scale, and\nopens up a possibility to study non-equilibrium systems in a systematic manner.",
    "authors": [
      "Dick Bedeaux",
      "Signe Kjelstrup"
    ],
    "publication_date": "2018-06-09T08:51:15Z",
    "arxiv_id": "http://arxiv.org/abs/1806.03444v1",
    "download_url": "http://arxiv.org/abs/1806.03444v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of the Harmonic Oscillator: Derivation of the Planck\n  Blackbody Spectrum from Pure Thermodynamics",
    "abstract": "In 1893, Wien applied the first two laws of thermodynamics to blackbody\nradiation and derived his displacement theorem. Believing that the information\nfrom thermodynamics had been exhausted, Planck turned to statistical ideas in\n1900 in order to provide a physical understanding for his\nexperimental--data-based interpolation giving the Planck spectrum without\nzero-point radiation. Here we point out that the third law of thermodynamics\n(which was developed in the early years of the 20th century) introduces\nadditional thermodynamic information regarding thermal radiation. The Planck\nspectrum for thermal radiation can be derived from purely thermodynamic ideas\napplied to the classical simple harmonic oscillator, since every radiation mode\ntakes a simple oscillator form. Thermodynamics alone implies the Planck\nspectrum including zero-point energy without any need for quantum theory or\nstatistical ideas. It is pointed out that the inclusion of zero-point energy\ninvolves more natural thermodynamics than its exclusion.",
    "authors": [
      "Timothy H. Boyer"
    ],
    "publication_date": "2018-09-21T20:46:33Z",
    "arxiv_id": "http://arxiv.org/abs/1809.09093v1",
    "download_url": "http://arxiv.org/abs/1809.09093v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time and Thermodynamics Extended Discussion on \"Time & clocks: A\n  thermodynamic approach\"",
    "abstract": "In the paper, \"Time & clocks: A thermodynamic approach\" Lucia and Grisolia\ndescribe the connections between the physical nature of time and macroscopic\nirreversibility in thermodynamics. They also discuss the possibility of\nconstructing a thermodynamic clock that links the two, through an approach\nbased on the behaviour of a black body. Their work primarily focuses on the\nmacroscopic irreversibilty, and their attempt to define 'thermodynamic time' is\ngrounded on the concepts from non-equilibrium thermodynamics such as, entropy\ngeneration and time-dependent thermodynamic fluxes - in and out of the system.\nIn this letter, we present a first principles approach based on the Maupertuis\nprinciple to describe the connection between time and thermodynamics for\nequilibrium phenomena. Our novel interpretation of the temperature as a\nfunctional allows us to extend our formalism to irreversible processes when the\nlocal equilibrium hypothesis is satisfied. Through our framework we also\nestablish a functional relationship between equilibrium and non-equilibrium\ntime-scales while distinguishing between the two.",
    "authors": [
      "Atanu Chatterjee",
      "Germano Iannacchione"
    ],
    "publication_date": "2020-07-18T10:33:55Z",
    "arxiv_id": "http://arxiv.org/abs/2007.09398v1",
    "download_url": "http://arxiv.org/abs/2007.09398v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of 2+1 dimensional Coulomb-Like Black Holes from Non\n  Linear Electrodynamics with a traceless energy momentum tensor",
    "abstract": "In this work we study thermodynamics of 2+1-dimensional static black holes\nwith a nonlinear electric field. Besides employing the standard thermodynamic\napproach, we investigate the black hole thermodynamics by studying its\nthermodynamic geometry. We compute the Weinhold and Ruppeiner metrics and\ncompare the thermodynamic geometry with the standard description on the black\nhole thermodynamics. We further consider the cosmological constant as an\nadditional extensive thermodynamic variable. In the thermodynamic equilibrium\nthree dimensional space, we compute the efficiency of the heat engine and show\nthat it is possible to be built with this black hole.",
    "authors": [
      "Mauricio Cataldo",
      "P. A. González",
      "Joel Saavedra",
      "Yerko Vázquez",
      "Bin Wang"
    ],
    "publication_date": "2020-10-13T00:27:12Z",
    "arxiv_id": "http://arxiv.org/abs/2010.06089v2",
    "download_url": "http://arxiv.org/abs/2010.06089v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comment on \"Validity of path thermodynamic description of reactive\n  systems: Microscopic simulations''",
    "abstract": "The claims by Baras, Garcia, and Malek Mansour [Phys. Rev. E 107, 014106\n(2023)] on the validity of path thermodynamics are ill founded and contradict\nwell known results. Following up on a previous comment, I show that, for both\nmodels of chemical reaction networks considered in the aforementioned paper,\npath thermodynamics yields values of the entropy production rates fully\nconsistent with those expected from standard chemical thermodynamics in the\nlarge-system limit.",
    "authors": [
      "Pierre Gaspard"
    ],
    "publication_date": "2023-01-12T16:39:31Z",
    "arxiv_id": "http://arxiv.org/abs/2301.05132v1",
    "download_url": "http://arxiv.org/abs/2301.05132v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Matrix Exponentials and Thermodynamic Parallelism",
    "abstract": "Thermodynamic computing exploits fluctuations and dissipation in physical\nsystems to efficiently solve various mathematical problems. For example, it was\nrecently shown that certain linear algebra problems can be solved\nthermodynamically, leading to an asymptotic speedup scaling with the matrix\ndimension. The origin of this \"thermodynamic advantage\" has not yet been fully\nexplained, and it is not clear what other problems might benefit from it. Here\nwe provide a new thermodynamic algorithm for exponentiating a real matrix, with\napplications in simulating linear dynamical systems. We describe a simple\nelectrical circuit involving coupled oscillators, whose thermal equilibration\ncan implement our algorithm. We also show that this algorithm also provides an\nasymptotic speedup that is linear in the dimension. Finally, we introduce the\nconcept of thermodynamic parallelism to explain this speedup, stating that\nthermodynamic noise provides a resource leading to effective parallelization of\ncomputations, and we hypothesize this as a mechanism to explain thermodynamic\nadvantage more generally.",
    "authors": [
      "Samuel Duffield",
      "Maxwell Aifer",
      "Gavin Crooks",
      "Thomas Ahle",
      "Patrick J. Coles"
    ],
    "publication_date": "2023-11-21T18:10:33Z",
    "arxiv_id": "http://arxiv.org/abs/2311.12759v2",
    "download_url": "http://arxiv.org/abs/2311.12759v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic concentration inequalities and tradeoff relations",
    "abstract": "Thermodynamic tradeoff relations quantify the fundamental concept of ``no\nfree lunch'' in the physical world, suggesting that faster and more precise\nphysical processes come at a higher thermodynamic cost. The key elements in\nthese tradeoff relations are the thermodynamic uncertainty relation and speed\nlimit, which are closely tied to information inequalities from which other\ntradeoff relations are derived. Concentration inequalities are relations that\ncomplement information inequalities in statistical analyses and have been\nwidely used in various fields. However, their role in thermodynamic tradeoff\nrelations remains unclear. This Letter develops thermodynamic concentration\ninequalities that provide bounds for the distribution of observables in quantum\nand classical Markov processes. We derive a set of tradeoff relations that\ngeneralize speed limits and thermodynamic uncertainty relations from the\ndeveloped thermodynamic concentration inequalities. The derived tradeoff\nrelations hold under minimal assumptions of the underlying physical processes.\nThis Letter clarifies the role of concentration inequalities in thermodynamics,\npaving the way for deriving new tradeoff relations.",
    "authors": [
      "Yoshihiko Hasegawa",
      "Tomohiro Nishiyama"
    ],
    "publication_date": "2024-02-19T15:02:27Z",
    "arxiv_id": "http://arxiv.org/abs/2402.12197v5",
    "download_url": "http://arxiv.org/abs/2402.12197v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-time thermodynamics: A journey beginning with optimizing heat\n  engines",
    "abstract": "In this paper, we summarize the historical development of finite-time\nthermodynamics and review the current state of research over the past two\ndecades in this field, focusing on fundamental constraints of finite-time\nthermodynamic cycles, optimal control and optimization of thermodynamic\nprocesses, the operation of unconventional heat engines, and experimental\nprogress.",
    "authors": [
      "Yu-Han Ma",
      "Xiu-Hua Zhao"
    ],
    "publication_date": "2024-11-06T11:52:03Z",
    "arxiv_id": "http://arxiv.org/abs/2411.03853v1",
    "download_url": "http://arxiv.org/abs/2411.03853v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]