[
  {
    "title": "Multiscale Thermodynamics",
    "abstract": "Multiscale thermodynamics is a theory of relations among levels of investigation of complex systems. It includes the classical equilibrium thermodynamics as a special case but it is applicable to both static and time evolving processes in externally and internally driven macroscopic systems that are far from equilibrium and are investigated on microscopic, mesoscopic, and macroscopic levels. In this paper we formulate the multiscale thermodynamics, explain its origin, and illustrate it in mesoscopic dynamics that combines levels.",
    "authors": [
      "Miroslav Grmela"
    ],
    "publication_date": "2020-11-03T20:08:36Z",
    "arxiv_id": "http://arxiv.org/abs/2011.01989v2",
    "download_url": "https://arxiv.org/abs/2011.01989v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The postulates of gravitational thermodynamics",
    "abstract": "The general principles and logical structure of a thermodynamic formalism that incorporates strongly self-gravitating systems are presented. This framework generalizes and simplifies the formulation of thermodynamics developed by Callen. The definition of extensive variables, the homogeneity properties of intensive parameters, and the fundamental problem of gravitational thermodynamics are discussed in detail. In particular, extensive parameters include quasilocal quantities and are naturally incorporated into a set of basic general postulates for thermodynamics. These include additivity of entropies (Massieu functions) and the generalized second law. Fundamental equations are no longer homogeneous first-order functions of their extensive variables. It is shown that the postulates lead to a formal resolution of the fundamental problem despite non-additivity of extensive parameters and thermodynamic potentials. Therefore, all the results of (gravitational) thermodynamics are an outgrowth of these postulates. The origin and nature of the differences with ordinary thermodynamics are analyzed. Consequences of the formalism include the (spatially) inhomogeneous character of thermodynamic equilibrium states, a reformulation of the Euler equation, and the absence of a Gibbs-Duhem relation.",
    "authors": [
      "Erik A. Martinez"
    ],
    "publication_date": "1996-09-20T00:26:02Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9609048v2",
    "download_url": "https://arxiv.org/abs/gr-qc/9609048v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Encoding and Encoders",
    "abstract": "Non-isolated systems have diverse coupling relations with the external environment. These relations generate complex thermodynamics and information transmission between the system and its environment. The framework depicted in the current research attempts to glance at the critical role of the internal orders inside the non-isolated system in shaping the information thermodynamics coupling. We characterize the coupling as a generalized encoding process, where the system acts as an information thermodynamics encoder to encode the external information based on thermodynamics. We formalize the encoding process in the context of the nonequilibrium second law of thermodynamics, revealing an intrinsic difference in information thermodynamics characteristics between information thermodynamics encoders with and without internal correlations. During the information encoding process of an external source $\\mathsf{Y}$, specific sub-systems in an encoder $\\mathsf{X}$ with internal correlations can exceed the information thermodynamics bound on $\\left(\\mathsf{X},\\mathsf{Y}\\right)$ and encode more information than system $\\mathsf{X}$ works as a whole. We computationally verify this theoretical finding in an Ising model with a random external field and a neural data set of the human brain during visual perception and recognition. Our analysis demonstrates that the stronger internal correlation inside these systems implies a higher possibility for specific sub-systems to encode more information than the global one. These findings may suggest a new perspective in studying information thermodynamics in diverse physical and biological systems.",
    "authors": [
      "Yang Tian",
      "Pei Sun"
    ],
    "publication_date": "2021-11-12T09:37:52Z",
    "arxiv_id": "http://arxiv.org/abs/2111.06624v1",
    "download_url": "https://arxiv.org/abs/2111.06624v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Unification of Optimal Transport: Thermodynamic Uncertainty Relation, Minimum Dissipation, and Thermodynamic Speed Limits",
    "abstract": "Thermodynamics serves as a universal means for studying physical systems from an energy perspective. In recent years, with the establishment of the field of stochastic and quantum thermodynamics, the ideas of thermodynamics have been generalized to small fluctuating systems. Independently developed in mathematics and statistics, the optimal transport theory concerns the means by which one can optimally transport a source distribution to a target distribution, deriving a useful metric between probability distributions, called the Wasserstein distance. Despite their seemingly unrelated nature, an intimate connection between these fields has been unveiled in the context of continuous-state Langevin dynamics, providing several important implications for nonequilibrium systems. In this study, we elucidate an analogous connection for discrete cases by developing a thermodynamic framework for discrete optimal transport. We first introduce a novel quantity called dynamical state mobility, which significantly improves the thermodynamic uncertainty relation and provides insights into the precision of currents in nonequilibrium Markov jump processes. We then derive variational formulas that connect the discrete Wasserstein distances to stochastic and quantum thermodynamics of discrete Markovian dynamics described by master equations. Specifically, we rigorously prove that the Wasserstein distance equals the minimum product of irreversible entropy production and dynamical state mobility over all admissible Markovian dynamics. These formulas not only unify the relationship between thermodynamics and the optimal transport theory for discrete and continuous cases but also generalize it to the quantum case. In addition, we demonstrate that the obtained variational formulas lead to remarkable applications in stochastic and quantum thermodynamics.",
    "authors": [
      "Tan Van Vu",
      "Keiji Saito"
    ],
    "publication_date": "2022-06-06T15:37:59Z",
    "arxiv_id": "http://arxiv.org/abs/2206.02684v4",
    "download_url": "https://arxiv.org/abs/2206.02684v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and Thermodynamic geometry of Park black hole",
    "abstract": "We study the thermodynamics and thermodynamic geometry of Park black hole in Hořava gravity. By incorporating the ideas of differential geometry, we have investigated the thermodynamics using Weinhold geometry and Ruppeiner geometry. We have also analyzed it in the context of newly developed geometrothermodynamics(GTD). Divergence of specific heat is associated with the second order phase transition of black hole. Here in the context of Park black hole, both Weinhold's metric and Ruppeiner's metric well explain this phase transition. But these explanations depend on the choice of potential. Hence the Legendre invariant GTD is used, and with the true singularities in the curvature scalar, GTD well explain the second order phase transition. All these methods together give an exact idea of all the behaviors of the Park black hole thermodynamics.",
    "authors": [
      "Jishnu Suresh",
      "Tharanath R",
      "Nijo Varghese",
      "V C Kuriakose"
    ],
    "publication_date": "2014-03-19T07:07:29Z",
    "arxiv_id": "http://arxiv.org/abs/1403.4710v1",
    "download_url": "https://arxiv.org/abs/1403.4710v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Confronting the thermodynamics knowledge gap: A short course on computational thermodynamics in Julia",
    "abstract": "Computational elements in thermodynamics have become increasingly important in contemporary chemical-engineering research and practice. However, traditional thermodynamics instruction provides little exposure to computational thermodynamics, leaving students ill-equipped to engage with the state-of-the-art deployed in industry and academia. The recent rise of easy-to-use open-source thermodynamic codes presents an opportunity for educators to help bridge this gap. In this work, we present a short course that was developed and rolled-out using the Clapeyron.jl package, the material of which is all openly available on GitHub. The course can serve as a foundation for others to similarly integrate computational material in thermodynamics education. The course is structured into three sections. Section one serves as a refresher and covers core material in numerical methods and thermodynamics. Section two introduces a range of thermodynamic models such as activity-coefficient models and cubic equations of state, outlining their implementation. In section three the focus is moved to deployment, guiding students on how to implement computational-thermodynamics methods covering volume solvers, saturation solvers, chemical-stability analysis and flash problems. In a pilot study conducted with both undergraduate and graduate students, participants found the material engaging and highly relevant to their chemical-engineering education.",
    "authors": [
      "Luc Paoli",
      "Pavan K. Inguva",
      "Andrew J. Haslam",
      "Pierre J. Walker"
    ],
    "publication_date": "2023-10-20T02:44:42Z",
    "arxiv_id": "http://arxiv.org/abs/2310.13234v1",
    "download_url": "https://arxiv.org/abs/2310.13234v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Mathematics of Thermodynamics",
    "abstract": "We show that the mathematical structure of Gibbsian thermodynamics flows from the following simple elements: the state space of a thermodynamical substance is a measure space together with two orderings (corresponding to \"warmer than\" and \"adiabatically accessible from\") which satisfy certain plausible physical axioms and an area condition which was introduced by Paul Samuelson. We show how the basic identities of thermodynamics, in particular the Maxwell relations, follow and so the existence of energy, free energy, enthalpy and the Gibbs potential function. We also discuss some questions which we have not found dealt with in the literature, such as the amount of information required to reconstruct the equations of state of a substance and a systematic approach to thermodynamical identities.",
    "authors": [
      "J. B. Cooper",
      "T. Russell"
    ],
    "publication_date": "2011-02-08T09:15:03Z",
    "arxiv_id": "http://arxiv.org/abs/1102.1540v1",
    "download_url": "https://arxiv.org/abs/1102.1540v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The case for black hole thermodynamics, Part I: phenomenological thermodynamics",
    "abstract": "I give a fairly systematic and thorough presentation of the case for regarding black holes as thermodynamic systems in the fullest sense, aimed at students and non-specialists and not presuming advanced knowledge of quantum gravity. I pay particular attention to (i) the availability in classical black hole thermodynamics of a well-defined notion of adiabatic intervention; (ii) the power of the membrane paradigm to make black hole thermodynamics precise and to extend it to local-equilibrium contexts; (iii) the central role of Hawking radiation in permitting black holes to be in thermal contact with one another; (iv) the wide range of routes by which Hawking radiation can be derived and its back-reaction on the black hole calculated; (v) the interpretation of Hawking radiation close to the black hole as a gravitationally bound thermal atmosphere. In an appendix I discuss recent criticisms of black hole thermodynamics by Dougherty and Callender. This paper confines its attention to the thermodynamics of black holes; a sequel will consider their statistical mechanics.",
    "authors": [
      "David Wallace"
    ],
    "publication_date": "2017-10-07T19:17:10Z",
    "arxiv_id": "http://arxiv.org/abs/1710.02724v2",
    "download_url": "https://arxiv.org/abs/1710.02724v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Black Holes and Thermodynamics",
    "abstract": "We review the remarkable relationship between the laws of black hole mechanics and the ordinary laws of thermodynamics. It is emphasized that - in analogy with the laws of thermodynamics - the validity the laws of black hole mechanics does not appear to depend upon the details of the underlying dynamical theory (i.e., upon the particular field equations of general relativity). It also is emphasized that a number of unresolved issues arise in ``ordinary thermodynamics'' in the context of general relativity. Thus, a deeper understanding of the relationship between black holes and thermodynamics may provide us with an opportunity not only to gain a better understanding of the nature of black holes in quantum gravity, but also to better understand some aspects of the fundamental nature of thermodynamics itself.",
    "authors": [
      "Robert M. Wald"
    ],
    "publication_date": "1997-02-11T23:02:27Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9702022v1",
    "download_url": "https://arxiv.org/abs/gr-qc/9702022v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Macroscopic Stochastic Thermodynamics",
    "abstract": "Starting at the mesoscopic level with a general formulation of stochastic thermodynamics in terms of Markov jump processes, we identify the scaling conditions that ensure the emergence of a (typically nonlinear) deterministic dynamics and an extensive thermodynamics at the macroscopic level. We then use large deviations theory to build a macroscopic fluctuation theory around this deterministic behavior, which we show preserves the fluctuation theorem. For many systems (e.g. chemical reaction networks, electronic circuits, Potts models), this theory does not coincide with Langevin-equation approaches (obtained by adding Gaussian white noise to the deterministic dynamics) which, if used, are thermodynamically inconsistent. Einstein-Onsager theory of Gaussian fluctuations and irreversible thermodynamics are recovered at equilibrium and close to it, respectively. Far from equilibirum, the free energy is replaced by the dynamically generated quasi-potential (or self-information) which is a Lyapunov function for the macroscopic dynamics. Remarkably, thermodynamics connects the dissipation along deterministic and escape trajectories to the Freidlin-Wentzell quasi-potential, thus constraining the transition rates between attractors induced by rare fluctuations. A coherent perspective on minimum and maximum entropy production principles is also provided. For systems that admit a continuous-space limit, we derive a nonequilibrium fluctuating field theory with its associated thermodynamics. Finally, we coarse grain the macroscopic stochastic dynamics into a Markov jump process describing transitions among deterministic attractors and formulate the stochastic thermodynamics emerging from it.",
    "authors": [
      "Gianmaria Falasco",
      "Massimiliano Esposito"
    ],
    "publication_date": "2023-07-23T19:13:33Z",
    "arxiv_id": "http://arxiv.org/abs/2307.12406v3",
    "download_url": "https://arxiv.org/abs/2307.12406v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On relativistic thermodynamics",
    "abstract": "'Relativistic thermodynamics' should be understood not as a generalization of a non-relativistic theory but as an application of a general thermodynamic framework, neutral as to spacetime setting and allowing arbitrary conserved quantities, to the specific case of relativity. That framework gives an unambiguous result as to the thermodynamics of relativistically moving systems (an answer coinciding with Einstein's, and Planck's, original results.) Thermodynamic temperature is unambiguously defined as rate of change of energy with entropy at constant momentum; that said, its operational significance is limited and other measures of energy/entropy covariance, which incorporate momentum transfer, are often more useful.",
    "authors": [
      "David Wallace"
    ],
    "publication_date": "2023-07-01T14:44:09Z",
    "arxiv_id": "http://arxiv.org/abs/2307.00354v2",
    "download_url": "https://arxiv.org/abs/2307.00354v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of an accelerated expanding universe",
    "abstract": "We investigate the laws of thermodynamics in an accelerating universe driven by dark energy with a time-dependent equation of state. In the case we consider that the physically relevant part of the Universe is that envelopped by the dynamical apparent horizon, we have shown that both the first law and second law of thermodynamics are satisfied. On the other hand, if the boundary of the Universe is considered to be the cosmological event horizon the thermodynamical description based on the definitions of boundary entropy and temperature breaks down. No parameter redefinition can rescue the thermodynamics laws from such a fate, rendering the cosmological event horizon unphysical from the point of view of the laws of thermodynamics.",
    "authors": [
      "Bin Wang",
      "Yungui Gong",
      "Elcio Abdalla"
    ],
    "publication_date": "2005-11-10T13:47:28Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0511051v1",
    "download_url": "https://arxiv.org/abs/gr-qc/0511051v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tangible phenomenological thermodynamics",
    "abstract": "In this paper, the foundations of classical phenomenological thermodynamics are being thoroughly revisited. A new rigorous basis for thermodynamics is laid out in the main text and presented in full detail in the appendix. All relevant concepts, such as work, heat, internal energy, heat reservoirs, reversibility, absolute temperature and entropy, are introduced on an abstract level and connected through traditional results, such as Carnot's Theorem, Clausius' Theorem and the Entropy Theorem. The paper offers insights into the basic assumptions one has to make in order to formally introduce a phenomenological thermodynamic theory. This contribution is of particular importance when applying phenomenological thermodynamics to systems, such as black holes, where the microscopic physics is not yet fully understood. Altogether, this work can serve as a basis for a complete and rigorous introduction to thermodynamics in an undergraduate course which follows the traditional lines as closely as possible.",
    "authors": [
      "Philipp Kammerlander",
      "Renato Renner"
    ],
    "publication_date": "2020-02-20T19:00:04Z",
    "arxiv_id": "http://arxiv.org/abs/2002.08968v1",
    "download_url": "https://arxiv.org/abs/2002.08968v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entropy and Entropy Production in Multiscale Dynamics",
    "abstract": "Heat conduction is investigated on three levels: equilibrium, Fourier, and Cattaneo. The Fourier level is either the point of departure for investigating the approach to equilibrium or the final stage in the investigation of the approach from the Cattaneo level. Both investigations bring to the Fourier level an entropy and a thermodynamics. In the absence of external and internal influences preventing the approach to equilibrium the entropy that arises in the latter investigation is the production of the classical entropy that arises in the former investigation. If the approach to equilibrium is prevented, then the entropy that arises in the investigation of the approach from the Cattaneo level to the Fourier level still brings to the Fourier level the entropy and the thermodynamics even if the classical entropy and the classical thermodynamics is absent. We also note that vanishing total entropy production as a characterization of equilibrium state is insufficient.",
    "authors": [
      "Miroslav Grmela",
      "Michal Pavelka",
      "Vaclav Klika",
      "Bing-Yang Cao",
      "Nie Bendian"
    ],
    "publication_date": "2018-09-13T07:51:30Z",
    "arxiv_id": "http://arxiv.org/abs/1809.05412v1",
    "download_url": "https://arxiv.org/abs/1809.05412v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The importance of thermodynamics for molecular systems, and the importance of molecular systems for thermodynamics",
    "abstract": "Improved understanding of molecular systems has only emphasised the sophistication of networks within the cell. Simultaneously, the advance of nucleic acid nanotechnology, a platform within which reactions can be exquisitely controlled, has made the development of artificial architectures and devices possible. Vital to this progress has been a solid foundation in the thermodynamics of molecular systems. In this pedagogical review and perspective, I will discuss how thermodynamics determines both the overall potential of molecular networks, and the minute details of design. I will then argue that, in turn, the need to understand molecular systems is helping to drive the development of theories of thermodynamics at the microscopic scale.",
    "authors": [
      "Thomas E. Ouldridge"
    ],
    "publication_date": "2017-02-01T17:14:50Z",
    "arxiv_id": "http://arxiv.org/abs/1702.00360v2",
    "download_url": "https://arxiv.org/abs/1702.00360v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic holography",
    "abstract": "The holographic principle states that the information about a volume of a system is encoded on the boundary surface of the volume. Holography appears in many branches of physics, such as optics, electromagnetism, many-body physics, quantum gravity, and string theory. Here we show that holography is also an underlying principle in thermodynamics, a most important foundation of physics. The thermodynamics of a system is fully determined by its partition function. We prove that the partition function of a physical system is an analytic function of all the physical parameters, and therefore its values in any area on the complex plane of a physical parameter are uniquely determined by its values along the boundary. The thermodynamic holography has applications in studying thermodynamics of nano-scale systems (such as molecule engines, nano-generators and macromolecules) and provides a new approach to many-body physics.",
    "authors": [
      "Bo-Bo Wei",
      "Zhan-Feng Jiang",
      "Ren-Bao Liu"
    ],
    "publication_date": "2014-11-24T03:37:10Z",
    "arxiv_id": "http://arxiv.org/abs/1411.6342v1",
    "download_url": "https://arxiv.org/abs/1411.6342v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics without Time",
    "abstract": "Our fundamental theories, i.e., the quantum theory and general relativity, are invariant under time reversal. Only when we treat system from the point of view of thermodynamics, i.e., averaging between many subsystem components, an arrow of time emerges. The relation between thermodynamic and the quantum theory has been fertile, deeply explored and still a source of new investigations. The relation between the quantum theory and gravity, while it has not yet brought an established theory of quantum gravity, has certainly sparkled in depth analysis and tentative new theories. On the other hand, the connection between gravity and thermodynamics is less investigated and more puzzling. I review a selection of results in covariant thermodynamics, such as the construction of a covariant notion of thermal equilibrium by considering tripartite systems. I discuss how such construction requires a relational take on thermodynamics, similarly of what happens in the quantum theory and in gravity",
    "authors": [
      "Francesca Vidotto"
    ],
    "publication_date": "2024-09-27T18:58:14Z",
    "arxiv_id": "http://arxiv.org/abs/2409.19098v1",
    "download_url": "https://arxiv.org/abs/2409.19098v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum thermodynamics: thermodynamics at the nanoscale",
    "abstract": "A short introduction on quantum thermodynamics is given and three new topics are discussed: 1) Maximal work extraction from a finite quantum system. The thermodynamic prediction fails and a new, general result is derived, the ``ergotropy''. 2) In work extraction from two-temperature setups, the presence of correlations can push the effective efficiency beyond the Carnot bound. 3) In the presence of level crossing, non-slow changes may be more optimal than slow ones.",
    "authors": [
      "A. E. Allahverdyan",
      "R. Balian",
      "Th. M. Nieuwenhuizen"
    ],
    "publication_date": "2004-02-14T10:20:29Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0402387v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0402387v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonextensive thermodynamic relations",
    "abstract": "The generalized zeroth law of thermodynamics indicates that the physical temperature in nonextensive statistical mechanics is different from the inverse of the Lagrange multiplier, beta. This leads to modifications of some of thermodynamic relations for nonextensive systems. Here, taking the first law of thermodynamics and the Legendre transform structure as the basic premises, it is found that Clausius definition of the thermodynamic entropy has to be appropriately modified, and accordingly the thermodynamic relations proposed by Tsallis, Mendes and Plastino [Physica A 261 (1998) 534] are also to be rectified. It is shown that the definition of specific heat and the equation of state remain form invariant. As an application, the classical gas model is reexamined and, in marked contrast with the previous result obtained by Abe [Phys. Lett. A 263 (1999) 424: Erratum A 267 (2000) 456] using the unphysical temperature and the unphysical pressure, the specific heat and the equation of state are found to be similar to those in ordinary extensive thermodynamics.",
    "authors": [
      "Sumiyoshi Abe",
      "S. Martinez",
      "F. Pennini",
      "A. Plastino"
    ],
    "publication_date": "2000-11-01T14:26:37Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0011012v4",
    "download_url": "https://arxiv.org/abs/cond-mat/0011012v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Making Sense of Gravitational Thermodynamics",
    "abstract": "The use of statistical methods to model gravitational systems is crucial to physics practice, but the extent to which thermodynamics and statistical mechanics genuinely apply to these systems is a contentious issue. This paper provides new conceptual foundations for gravitational thermodynamics by reconsidering the nature of key concepts like equilibrium and advancing a novel way of understanding thermodynamics. The challenges arise from the peculiar characteristics of the gravitational potential, leading to non-extensive energy and entropy, negative heat capacity, and a lack of standard equilibrium. Hence it has been claimed that only non-equilibrium statistical mechanics is warranted in this domain, whereas thermodynamics is inapplicable. We argue instead that equilibrium statistical mechanics applies to self-gravitating systems at the relevant scale, as they display equilibrium in the form of metastable quasi-equilibrium states. We then develop a minimal framework for thermodynamics that can be applied to these systems and beyond. Thermodynamics applies in the sense that we can devise macroscopic descriptions and explanations of the behaviour of these systems in terms of coarse-grained quantities like energy and temperature within equilibrium statistical mechanics.",
    "authors": [
      "Lorenzo Lorenzetti"
    ],
    "publication_date": "2024-02-18T17:40:11Z",
    "arxiv_id": "http://arxiv.org/abs/2402.12410v2",
    "download_url": "https://arxiv.org/abs/2402.12410v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Fractal Universe",
    "abstract": "We investigate the thermodynamical properties of the apparent horizon in a fractal universe. We find that one can always rewrite the Friedmann equation of the fractal universe in the form of the entropy balance relation $ δQ=T_h d{S_h}$, where $ δQ $ and $ T_{h} $ are the energy flux and Unruh temperature seen by an accelerated observer just inside the apparent horizon. We find that the entropy $S_h$ consists two terms, the first one which obeys the usual area law and the second part which is the entropy production term due to nonequilibrium thermodynamics of fractal universe. This shows that in a fractal universe, a treatment with nonequilibrium thermodynamics of spacetime may be needed. We also study the generalized second law of thermodynamics in the framework of fractal universe. When the temperature of the apparent horizon and the matter fields inside the horizon are equal, i.e. $T=T_h$, the generalized second law of thermodynamics can be fulfilled provided the deceleration and the equation of state parameters ranges either as $-1 \\leq q < 0 $, $- 1 \\leq w < - 1/3$ or as $q<-1$, $w<-1$ which are consistent with recent observations. We also find that for $T_h=bT$, with $b<1$, the GSL of thermodynamics can be secured in a fractal universe by suitably choosing the fractal parameter $β$.",
    "authors": [
      "Ahmad Sheykhi",
      "Zeinab Teimoori",
      "Bin Wang"
    ],
    "publication_date": "2012-10-29T13:11:15Z",
    "arxiv_id": "http://arxiv.org/abs/1212.2137v3",
    "download_url": "https://arxiv.org/abs/1212.2137v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On thermodynamics of compact objects",
    "abstract": "With the recent progress in observations of astrophysical black holes, it has become more important to understand in detail the physics of strongly gravitating horizonless objects. If the objects identified in the observations are indeed horizonless and ultracompact, high curvature effects may become important, and their explorations may be intimately related to new physics beyond General Relativity (GR). In this paper, we revisit the concept of statistical thermodynamics in curved spacetime, focusing on self-gravitating compact systems without event horizons. In the literature, gravitational field equations are in general assumed a priori in the thermodynamic treatment, which may lead to difficulties for theories of modified gravity, given the more complicated structure of field equations. Here, we consider thermodynamic behavior of the matter source, instead of the physical mass, hence avoiding the explicit input of field equations in the derivation of thermodynamic laws. We show that the conventional first law of thermodynamics is retrieved once the thermodynamic volume, which is in general different from the geometric volume, is appropriately identified. For demonstrations of our approach, we consider familiar examples of self-gravitating gas in GR, where the connection to previous studies becomes clear. We also discuss 2-2-holes in quadratic gravity, a novel example of black hole mimickers that features super-Planckian curvatures in the interior. These objects exhibit universal high curvature effects in thermodynamics, which happen to be conveniently encoded in the thermodynamic volume. Interesting connections to black hole thermodynamics also emerge when the physical mass is treated as the total internal energy.",
    "authors": [
      "Ufuk Aydemir",
      "Jing Ren"
    ],
    "publication_date": "2021-12-31T19:00:26Z",
    "arxiv_id": "http://arxiv.org/abs/2201.00025v2",
    "download_url": "https://arxiv.org/abs/2201.00025v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entanglement Thermodynamics",
    "abstract": "We study entanglement entropy for an excited state by making use of the proposed holographic description of the entanglement entropy. For a sufficiently small entangling region and with reasonable identifications we find an equation between entanglement entropy and energy which is reminiscent of the first law of thermodynamics. We then suggest four statements which might be thought of as four laws of entanglement thermodynamics.",
    "authors": [
      "Mohsen Alishahiha",
      "Davood Allahbakhshi",
      "Ali Naseh"
    ],
    "publication_date": "2013-05-13T10:11:29Z",
    "arxiv_id": "http://arxiv.org/abs/1305.2728v4",
    "download_url": "https://arxiv.org/abs/1305.2728v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Two applications of stochastic thermodynamics to hydrodynamics",
    "abstract": "Recently, the theoretical framework of stochastic thermodynamics has been revealed to be useful for macroscopic systems. However, despite its conceptual and practical importance, the connection to hydrodynamics has yet to be explored. In this Letter, we reformulate the thermodynamics of compressible and incompressible Newtonian fluids so that it becomes comparable to stochastic thermodynamics and unveil their connections; we obtain the housekeeping--excess decomposition of entropy production rate (EPR) for hydrodynamic systems and find a lower bound on EPR given by relative fluctuation similar to the thermodynamic uncertainty relation. These results not only prove the universality of stochastic thermodynamics but also suggest the potential extensibility of the thermodynamic theory of hydrodynamic systems.",
    "authors": [
      "Kohei Yoshimura",
      "Sosuke Ito"
    ],
    "publication_date": "2023-05-31T03:01:39Z",
    "arxiv_id": "http://arxiv.org/abs/2305.19519v3",
    "download_url": "https://arxiv.org/abs/2305.19519v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of the Primordial Universe",
    "abstract": "This review delves into the pivotal primordial stage of the universe, a period that holds the key to understanding its current state. To fully grasp this epoch, it is essential to consider three fundamental domains of physics: gravity, particle physics, and thermodynamics. The thermal history of the universe recreates the extreme high-energy conditions that are critical for exploring the unification of the fundamental forces, making it a natural laboratory for high-energy physics. This thermal history also offers valuable insights into how the laws of thermodynamics have governed the evolution of the universe's constituents, shaping them into the forms we observe today. Focusing on the Standard Cosmological Model (SCM) and the Standard Model of Particles (SM), this paper provides an in-depth analysis of thermodynamics in the primordial universe. The structure of the study includes an introduction to the SCM and its strong ties to thermodynamic principles. It then explores equilibrium thermodynamics in the context of the expanding universe, followed by a detailed analysis of out-of-equilibrium phenomena that were pivotal in shaping key events during the early stages of the universe's evolution.",
    "authors": [
      "David S. Pereira",
      "João Ferraz",
      "Francisco S. N. Lobo",
      "José P. Mimoso"
    ],
    "publication_date": "2024-11-05T11:41:36Z",
    "arxiv_id": "http://arxiv.org/abs/2411.03018v1",
    "download_url": "https://arxiv.org/abs/2411.03018v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of entanglement in Schwarzschild spacetime",
    "abstract": "Extending the analysis in our previous paper, we construct the entanglement thermodynamics for a massless scalar field on the Schwarzschild spacetime. Contrary to the flat case, the entanglement energy $E_{ent}$ turns out to be proportional to area radius of the boundary if it is near the horizon. This peculiar behavior of $E_{ent}$ can be understood by the red-shift effect caused by the curved background. Combined with the behavior of the entanglement entropy, this result yields, quite surprisingly, the entanglement thermodynamics of the same structure as the black hole thermodynamics. On the basis of these results, we discuss the relevance of the concept of entanglement as the microscopic origin of the black hole thermodynamics.",
    "authors": [
      "Shinji Mukohyama",
      "Masafumi Seriu",
      "Hideo Kodama"
    ],
    "publication_date": "1997-12-03T02:25:01Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9712018v5",
    "download_url": "https://arxiv.org/abs/gr-qc/9712018v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics as a Consequence of Information Conservation",
    "abstract": "Thermodynamics and information have intricate interrelations. Often thermodynamics is considered to be the logical premise to justify that information is physical - through Landauer's principle -, thereby also linking information and thermodynamics. This approach towards information has been instrumental to understand thermodynamics of logical and physical processes, both in the classical and quantum domain. In the present work, we formulate thermodynamics as an exclusive consequence of information conservation. The framework can be applied to the most general situations, beyond the traditional assumptions in thermodynamics: we allow systems and thermal baths to be quantum, of arbitrary sizes and possessing inter-system correlations.\n  Here, systems and baths are not treated differently, rather both are considered on an equal footing. This leads us to introduce a \"temperature\"-independent formulation of thermodynamics. We rely on the fact that, for a fixed amount of information, measured by the von Neumann entropy, any system can be transformed to a state with the same entropy that possesses minimal energy. This state, known as a completely passive state, acquires Boltzmann-Gibbs canonical form with an intrinsic temperature. We introduce the notions of bound and free energy and use them to quantify heat and work, respectively. Guided by the principle of information conservation, we develop universal notions of equilibrium, heat and work, Landauer's principle and universal fundamental laws of thermodynamics. We demonstrate that the maximum efficiency of a quantum engine with a finite bath is in general lower than that of an ideal Carnot engine. We introduce a resource theoretic framework for our intrinsic temperature based thermodynamics, within which we address the problem of work extraction and state transformations. Finally, the framework is extended to multiple conserved quantities.",
    "authors": [
      "Manabendra Nath Bera",
      "Arnau Riera",
      "Maciej Lewenstein",
      "Zahra Baghali Khanian",
      "Andreas Winter"
    ],
    "publication_date": "2017-07-06T12:44:05Z",
    "arxiv_id": "http://arxiv.org/abs/1707.01750v3",
    "download_url": "https://arxiv.org/abs/1707.01750v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and the Origin of Life",
    "abstract": "Modern developments in nonequilibrium thermodynamics have significant implications for the origins of life. The reasons for this are closely related to a generalized version of the second law of thermodynamics recently found for entropy production during irreversible evolution of a given system such as self-replicating RNA. This paper is intended to serve as an introduction to these developments.",
    "authors": [
      "Gerald E. Marsh"
    ],
    "publication_date": "2022-03-07T17:31:52Z",
    "arxiv_id": "http://arxiv.org/abs/2204.00416v1",
    "download_url": "https://arxiv.org/abs/2204.00416v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Correct thermodynamic forces in Tsallis Thermodynamics: connection with Hill Nanothermodynamics",
    "abstract": "The equivalence between Tsallis Thermodynamics and Hill Nanothermodynamics is established. The correct thermodynamic forces in Tsallis thermodynamics are pointed out. Through this connection we also find a general expression for the entropic index $q$ which we illustrate with two physical examples, allowing in both cases to relate $q$ to the underlying dynamics of the Hamiltonian systems.",
    "authors": [
      "V. Garcia-Morales",
      "J. Cervera",
      "J. Pellicer"
    ],
    "publication_date": "2005-01-17T19:23:07Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0501396v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0501396v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of statistical inference by cells",
    "abstract": "The deep connection between thermodynamics, computation, and information is now well established both theoretically and experimentally. Here, we extend these ideas to show that thermodynamics also places fundamental constraints on statistical estimation and learning. To do so, we investigate the constraints placed by (nonequilibrium) thermodynamics on the ability of biochemical signaling networks within cells to estimate the concentration of an external signal. We show that accuracy is limited by energy consumption, suggesting that there are fundamental thermodynamic constraints on statistical inference.",
    "authors": [
      "Alex H. Lang",
      "Charles K. Fisher",
      "Thierry Mora",
      "Pankaj Mehta"
    ],
    "publication_date": "2014-05-15T20:25:57Z",
    "arxiv_id": "http://arxiv.org/abs/1405.4001v3",
    "download_url": "https://arxiv.org/abs/1405.4001v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Friedmann Thermodynamics and the Geometry of the Universe",
    "abstract": "In a recent article we have introduced Friedmann thermodynamics, where certain geometric parameters in Friedmann models are treated like their thermodynamic counterparts (temperature, entropy, Gibbs potential etc.). This model has the advantage of allowing us to determine the geometry of the universe by thermodynamic stability arguments. In this article we review connections between thermodynamics, geometry and cosmology.",
    "authors": [
      "Selcuk S. Bayin"
    ],
    "publication_date": "2008-04-01T12:12:36Z",
    "arxiv_id": "http://arxiv.org/abs/0804.0153v1",
    "download_url": "https://arxiv.org/abs/0804.0153v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unitary thermodynamics from thermodynamic geometry",
    "abstract": "Degenerate Fermi gases of atoms near a Feshbach resonance show universal thermodynamic properties, which are here calculated with the geometry of thermodynamics, and the thermodynamic curvature $R$. Unitary thermodynamics is expressed as the solution to a pair of ordinary differential equations, a \"superfluid\" one valid for small entropy per atom $z\\equiv S/N k_B$, and a \"normal\" one valid for high $z$. These two solutions are joined at a second-order phase transition at $z=z_c$. Define the internal energy per atom in units of the Fermi energy as $Y=Y(z)$. For small $z$, $Y(z)=y_0+y_1 z^α+y_2 z^{2 α}+\\cdots,$ where $α$ is a constant exponent, $y_0$ and $y_1$ are scaling factors, and the series coefficients $y_i$ ($i\\ge 2$) are determined uniquely in terms of $(α, y_0, y_1)$. For large $z$ the solution follows if we also specify $z_c$, with $Y(z)$ diverging as $z^{5/3}$ for high $z$. The four undetermined parameters $(α,y_0,y_1,z_c)$ were determined by fitting the theory to experimental data taken by a Duke University group on $^6$Li in an optical trap with a Gaussian potential. The very best fit of this theory to the data had $α=2.1$, $z_c=4.7$, $y_0=0.277$, and $y_1=0.0735$, with $χ^2=0.95$. The corresponding Bertsch parameter is $ξ_B=0.462(40)$.",
    "authors": [
      "George Ruppeiner"
    ],
    "publication_date": "2013-10-09T18:16:02Z",
    "arxiv_id": "http://arxiv.org/abs/1310.2566v1",
    "download_url": "https://arxiv.org/abs/1310.2566v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and Preferred Frame",
    "abstract": "The Lorentz covariant statistical physics and thermodynamics is formulated within the preferred frame approach. The transformation laws for geometrical and mechanical quantities such as volume and pressure as well as the Lorentz-invariant measure on the phase space are found using Lorentz transformation in absolute synchronization. Next, the probability density and partition function are investigated using the preferred frame approach and the transformation laws for internal energy, entropy, temperature as well as other thermodynamical potentials are established. The Lorentz covariance of basic thermodynamical relations, including Clapeyron's equation and Maxwell's relations is shown. Finally, the relation of presented approach to the previous approaches to relativistic thermodynamics is briefly discussed.",
    "authors": [
      "J. Rembielinski",
      "K. A. Smolinski",
      "G. Duniec"
    ],
    "publication_date": "2001-02-09T13:13:01Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0102170v2",
    "download_url": "https://arxiv.org/abs/cond-mat/0102170v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Thermodynamics",
    "abstract": "Quantum thermodynamics is an emerging research field aiming to extend standard thermodynamics and non-equilibrium statistical physics to ensembles of sizes well below the thermodynamic limit, in non-equilibrium situations, and with the full inclusion of quantum effects. Fuelled by experimental advances and the potential of future nanoscale applications this research effort is pursued by scientists with different backgrounds, including statistical physics, many-body theory, mesoscopic physics and quantum information theory, who bring various tools and methods to the field. A multitude of theoretical questions are being addressed ranging from issues of thermalisation of quantum systems and various definitions of \"work\", to the efficiency and power of quantum engines. This overview provides a perspective on a selection of these current trends accessible to postgraduate students and researchers alike.",
    "authors": [
      "Sai Vinjanampathy",
      "Janet Anders"
    ],
    "publication_date": "2015-08-25T10:20:08Z",
    "arxiv_id": "http://arxiv.org/abs/1508.06099v2",
    "download_url": "https://arxiv.org/abs/1508.06099v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of a transient phantom scenario",
    "abstract": "This work is devoted to the thermodynamics description of a phantom scenario proposed previously by the authors. The presence of negative chemical potential is unavoidable if we allege for a well defined thermodynamics framework since the cosmological model passages from phantom stage at present time to a future de Sitter evolution. As noted earlier in other works, we find that the negativity of the chemical potential is necessary to save phantom dark energy from thermodynamics inconsistencies.",
    "authors": [
      "Miguel Cruz",
      "Samuel Lepe"
    ],
    "publication_date": "2023-04-05T20:34:43Z",
    "arxiv_id": "http://arxiv.org/abs/2304.02735v4",
    "download_url": "https://arxiv.org/abs/2304.02735v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Laws of thermodynamics for exponential families",
    "abstract": "We develop the laws of thermodynamics in terms of general exponential families. By casting learning (log-loss minimization) problems in max-entropy and statistical mechanics terms, we translate thermodynamics results to learning scenarios. We extend the well-known way in which exponential families characterize thermodynamic and learning equilibria. Basic ideas of work and heat, and advanced concepts of thermodynamic cycles and equipartition of energy, find exact and useful counterparts in AI / statistics terms. These ideas have broad implications for quantifying and addressing distribution shift.",
    "authors": [
      "Akshay Balsubramani"
    ],
    "publication_date": "2025-01-03T19:36:09Z",
    "arxiv_id": "http://arxiv.org/abs/2501.02071v1",
    "download_url": "https://arxiv.org/abs/2501.02071v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Lemaitre-Tolman-Bondi Model",
    "abstract": "Here we consider our universe as inhomogeneous spherically symmetric Lemaitre-Tolman-Bondi Model and analyze the thermodynamics of this model of the universe. The trapping horizon is calculated and is found to coincide with the apparent horizon. The Einstein field equations are shown to be equivalent with the unified first law of thermodynamics. Finally assuming the first law of thermodynamics validity of the generalized second law of thermodynamics is examined at the apparent horizon for the perfect fluid and at the event horizon for holographic dark energy.",
    "authors": [
      "Subenoy Chakraborty",
      "Nairwita Mazumder",
      "Ritabrata Biswas"
    ],
    "publication_date": "2010-06-13T09:43:57Z",
    "arxiv_id": "http://arxiv.org/abs/1006.2519v1",
    "download_url": "https://arxiv.org/abs/1006.2519v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Adversarial Thermodynamics",
    "abstract": "In thermodynamics, an agent's ability to extract work is fundamentally constrained by their environment. Traditional frameworks struggle to capture how strategic decision-making under uncertainty, particularly an agent's tolerance for risk, determines the trade-off between extractable work and probability of success in finite-scale experiments. Here, we develop a framework for nonequilibrium thermodynamics based on adversarial resource theories, in which work extraction is modeled as an adversarial game for an agent extracting work. Within this perspective, we consider a Szilard-type engine as a game isomorphic to Kelly gambling, an information-theoretic model of optimal betting under uncertainty -- but with a thermodynamic utility function. Extending the framework to finite-size regimes, we apply a risk-reward trade-off to find an interpretation of the Renyi divergences in terms of extractable work for a given failure probability. By incorporating risk sensitivity via utility functions, we show that the guaranteed amount of work a rational agent would accept instead of undertaking a risky protocol is given by a Renyi divergence. This provides a unified picture of thermodynamics and gambling, and highlights how generalized free energies emerge from an adversarial setup.",
    "authors": [
      "Maite Arcos",
      "Philippe Faist",
      "Takahiro Sagawa",
      "Jonathan Oppenheim"
    ],
    "publication_date": "2025-10-09T14:50:51Z",
    "arxiv_id": "http://arxiv.org/abs/2510.08298v2",
    "download_url": "https://arxiv.org/abs/2510.08298v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics without ergodicity",
    "abstract": "We show that fundamental thermodynamic relations can be derived from deterministic mechanics for a non-ergodic system. This extend a similar derivation for ergodic systems and suggests that ergodicity should not be considered as a requirement for a system to exhibit a thermodynamic behavior. Our analysis emphasizes the role of adiabatic invariants in deterministic description and strengthens the link between mechanics and thermodynamics. In particular, we argue that macroscopic thermodynamic behavior of a system is caused by the existence of different time scales in its deterministic microscopic evolution.",
    "authors": [
      "V. L. Kulinskii",
      "K. S. Glavatskiy"
    ],
    "publication_date": "2018-11-12T07:45:12Z",
    "arxiv_id": "http://arxiv.org/abs/1811.04591v1",
    "download_url": "https://arxiv.org/abs/1811.04591v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Axiomatic Information Thermodynamics",
    "abstract": "We present an axiomatic framework for thermodynamics that incorporates information as a fundamental concept. The axioms describe both ordinary thermodynamic processes and those in which information is acquired, used and erased, as in the operation of Maxwell's demon. This system, like previous axiomatic systems for thermodynamics, supports the construction of conserved quantities and an entropy function governing state changes. Here, however, the entropy exhibits both information and thermodynamic aspects. Although our axioms are not based upon probabilistic concepts, a natural and highly useful concept of probability emerges from the entropy function itself. Our abstract system has many models, including both classical and quantum examples.",
    "authors": [
      "Austin Hulse",
      "Benjamin Schumacher",
      "Michael D. Westmoreland"
    ],
    "publication_date": "2018-01-11T16:20:50Z",
    "arxiv_id": "http://arxiv.org/abs/1801.05015v2",
    "download_url": "https://arxiv.org/abs/1801.05015v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring quantum thermodynamics with NMR",
    "abstract": "Quantum thermodynamics seeks to extend non-equilibrium stochastic thermodynamics to small quantum systems where non-classical features are essential to its description. Such a research area has recently provided meaningful theoretical and experimental advances by exploring the wealth and the power of quantum features along with informational aspects of a system's thermodynamics. The relevance of such investigations is related to the fact that quantum technological devices are currently at the forefront of science and engineering applications. This short review article provides an overview of some concepts in quantum thermodynamics highlighting test-of-principles experiments using nuclear magnetic resonance techniques.",
    "authors": [
      "Carlos H. S. Vieira",
      "Jefferson L. D. de Oliveira",
      "Jonas F. G. Santos",
      "Pedro R. Dieguez",
      "Roberto M. Serra"
    ],
    "publication_date": "2023-03-15T20:21:10Z",
    "arxiv_id": "http://arxiv.org/abs/2303.08917v1",
    "download_url": "https://arxiv.org/abs/2303.08917v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic properties of modified gravity theories",
    "abstract": "We review thermodynamic properties of modified gravity theories such as $F(R)$ gravity and $f(T)$ gravity, where $R$ is the scalar curvature and $T$ is the torsion scalar in teleparallelism. In particular, we explore the equivalence between the equations of motion for modified gravity theories and the Clausius relation in thermodynamics. In addition, thermodynamics of the cosmological apparent horizon is investigated in $f(T)$ gravity. We show both equilibrium and non-equilibrium descriptions of thermodynamics. It is demonstrated that the second law of thermodynamics in the universe can be met when the temperature of the outside of the apparent horizon is equivalent to that of the inside of it.",
    "authors": [
      "Kazuharu Bamba"
    ],
    "publication_date": "2016-04-10T03:08:42Z",
    "arxiv_id": "http://arxiv.org/abs/1604.02632v1",
    "download_url": "https://arxiv.org/abs/1604.02632v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonequilibrium Thermodynamics of Colloids",
    "abstract": "The common rules of classical nonequilibrium thermodynamics do not allow an Onsager coefficient like the viscosity to depend on the shear rate. Such a dependence is experimentally well documented, however. In this paper it is shown, using nonequilibrium thermodynamics alone, how it is possible that the effective viscosity coefficient of an isotropic colloidal system depends on both the shear rate and the frequency.",
    "authors": [
      "D. Bedeaux",
      "J. M. Rubi"
    ],
    "publication_date": "2000-03-17T17:48:50Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0003308v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0003308v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanical analogue of the zeroth law of thermodynamics. (On the problem of incorporating Thermodynamics into Quantum Theory)",
    "abstract": "This approach to the incorporation of stochastic thermodynamics into quantum theory is based on the conception of consistent inclusion of the holistic stochastic environmental influence described by wave functions of the arbitrary vacuum, which was proposed in our paper previously.\n  In this study, we implement the possibility of explicitly incorporating the zeroth law of stochastic thermodynamics in the form of the saturated Schrödinger uncertainty relation into quantum theory. This allows comparatively analyzing the sets of states of arbitrary vacuums, namely, squeezed coherent states (SCSs) and correlated coherent states (CCSs). In addition, we compare the results of the construction of stochastic thermodynamics using SCSs and TCCSs with the versions involving the incorporation of thermodynamics into quantum theory developed previously and based on thermofield dynamics and quantum statistical mechanics.",
    "authors": [
      "O. N. Golubjeva",
      "A. D. Sukhanov"
    ],
    "publication_date": "2013-03-25T12:00:31Z",
    "arxiv_id": "http://arxiv.org/abs/1303.6105v1",
    "download_url": "https://arxiv.org/abs/1303.6105v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic thermodynamic interpretation of information geometry",
    "abstract": "In recent years, the unified theory of information and thermodynamics has been intensively discussed in the context of stochastic thermodynamics. The unified theory reveals that information theory would be useful to understand non-stationary dynamics of systems far from equilibrium. In this letter, we have found a new link between stochastic thermodynamics and information theory well known as information geometry. By applying this link, an information geometric inequality can be interpreted as a thermodynamic uncertainty relationship between speed and thermodynamic cost. We have numerically applied an information geometric inequality to a thermodynamic model of biochemical enzyme reaction.",
    "authors": [
      "Sosuke Ito"
    ],
    "publication_date": "2017-12-12T14:34:58Z",
    "arxiv_id": "http://arxiv.org/abs/1712.04311v6",
    "download_url": "https://arxiv.org/abs/1712.04311v6",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics in Loop Quantum Cosmology",
    "abstract": "Loop quantum cosmology (LQC) is very powerful to deal with the behavior of early universe. And the effective loop quantum cosmology gives a successful description of the universe in the semiclassical region. We consider the apparent horizon of the Friedmann-Robertson-Walker universe as a thermodynamical system and investigate the thermodynamics of LQC in the semiclassical region. The effective density and effective pressure in the modified Friedmann equation from LQC not only determine the evolution of the universe in LQC scenario but are actually also found to be the thermodynamic quantities. This result comes from the energy definition in cosmology (the Misner-Sharp gravitational energy) and is consistent with thermodynamic laws. We prove that within the framework of loop quantum cosmology, the elementary equation of equilibrium thermodynamics is still valid.",
    "authors": [
      "Li-Fang Li",
      "Jian-Yang Zhu"
    ],
    "publication_date": "2008-12-18T14:38:13Z",
    "arxiv_id": "http://arxiv.org/abs/0812.3544v1",
    "download_url": "https://arxiv.org/abs/0812.3544v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and gravitational collapse",
    "abstract": "It is known now that a typical gravitational collapse in general relativity, evolving from regular initial data and under physically reasonable conditions would end in either a black hole or a naked singularity final state. An important question that needs to be answered in this connection is, whether the analogues of the laws of thermodynamics, as formulated for relativistic horizons are respected by the dynamical spacetimes for collapse that end in the formation of a naked singularity. We investigate here the thermodynamical behaviour of the dynamical horizons that form in spherically symmetric gravitational collapse and we show that the first and second laws of black hole thermodynamics, as extended to dynamical spacetimes in a suitable manner, are not violated whether the collapse ends in a black hole or a naked singularity. We then make a distinction between the naked singularities that result from gravitational collapse, and those that exist in solutions of Einstein equations in vacuum axially symmetric and stationary spacetimes, and discuss their connection with thermodynamics in view of the cosmic censorship conjecture and the validity of the third law of black hole mechanics.",
    "authors": [
      "Daniele Malafarina",
      "Pankaj S. Joshi"
    ],
    "publication_date": "2011-06-19T11:14:00Z",
    "arxiv_id": "http://arxiv.org/abs/1106.3734v1",
    "download_url": "https://arxiv.org/abs/1106.3734v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Global Thermodynamics for Heat Conduction Systems",
    "abstract": "We propose the concept of global temperature for spatially non-uniform heat conduction systems. With this novel quantity, we present an extended framework of thermodynamics for the whole system such that the fundamental relation of thermodynamics holds, which we call \"global thermodynamics\" for heat conduction systems. Associated with this global thermodynamics, we formulate a variational principle for determining thermodynamic properties of the liquid-gas phase coexistence in heat conduction, which corresponds to the natural extension of the Maxwell construction for equilibrium systems. We quantitatively predict that the temperature of the liquid-gas interface deviates from the equilibrium transition temperature. This result indicates that a super-cooled gas stably appears near the interface.",
    "authors": [
      "Naoko Nakagawa",
      "Shin-ichi Sasa"
    ],
    "publication_date": "2019-06-17T13:18:48Z",
    "arxiv_id": "http://arxiv.org/abs/1906.07022v2",
    "download_url": "https://arxiv.org/abs/1906.07022v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Thermodynamics of Micromagnetics",
    "abstract": "In this work, we study the stochastic thermodynamics of micro-magnetic systems. We first formulate the stochastic dynamics of micro-magnetic systems by incorporating noises into Landau-Lifshitz (LL) equation, which describes the irreversible and deterministic dynamics of magnetic moments. The resulting stochastic Landau-Lifshitz (sLL) equation obeys detailed balance, which guarantees that, with the external field fixed, the system converges to thermodynamic equilibrium with vanishing entropy production and with non-vanishing probability current. We then discuss various thermodynamic variables both at the trajectory level and at the ensemble level, and further establish both the first and the second laws of thermodynamics. Finally, we establish fluctuation theorems, and verify them using numerical simulations.",
    "authors": [
      "Mingnan Ding",
      "Jun Wu",
      "Xiangjun Xing"
    ],
    "publication_date": "2024-04-21T10:45:48Z",
    "arxiv_id": "http://arxiv.org/abs/2404.13612v2",
    "download_url": "https://arxiv.org/abs/2404.13612v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strong Coupling Thermodynamics and Stochastic Thermodynamics from the Unifying Perspective of Time-Scale Separation",
    "abstract": "Assuming time-scale separation, a simple and unified theory of thermodynamics and stochastic thermodynamics is constructed for small classical systems strongly interacting with its environment in a controllable fashion. The total Hamiltonian is decomposed into a bath part and a system part, the latter being the Hamiltonian of mean force. Both the conditional equilibrium of bath and the reduced equilibrium of the system are described by canonical ensemble theories with respect to their own Hamiltonians. The bath free energy is independent of the system variables and the control parameter. Furthermore, the weak coupling theory of stochastic thermodynamics becomes applicable almost verbatim, even if the interaction and correlation between the system and its environment are strong and varied externally. Finally, this TSS-based approach also leads to some new insights about the origin of the second law of thermodynamics.",
    "authors": [
      "Mingnan Ding",
      "Zhanchun Tu",
      "Xiangjun Xing"
    ],
    "publication_date": "2021-05-30T13:37:09Z",
    "arxiv_id": "http://arxiv.org/abs/2105.14539v2",
    "download_url": "https://arxiv.org/abs/2105.14539v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Linear Stochastic Thermodynamics",
    "abstract": "We study the thermodynamics of open systems weakly driven out-of-equilibrium by nonconservative and time-dependent forces using the linear regime of stochastic thermodynamics. We make use of conservation laws to identify the potential and nonconservative components of the forces. This allows us to formulate a unified near-equilibrium thermodynamics. For nonequilibrium steady states, we obtain an Onsager theory ensuring nonsingular response matrices that is consistent with phenomenological linear irreversible thermodynamics. For time-dependent driving protocols that do not produce nonconservative forces, we identify the equilibrium ensemble from which Green-Kubo relations are recovered. For arbitrary periodic drivings, the averaged entropy production (EP) is expressed as an independent sum over each driving frequency of non-negative contributions. These contributions are bilinear in the nonconservative and conservative forces and involve a novel generalized Onsager matrix that is symmetric. In the most general case of arbitrary time-dependent drivings, we advance a novel decomposition of the EP rate into two non-negative contributions - one solely due to nonconservative forces and the other solely due to deviation from the instantaneous steady-state - directly implying a minimum entropy production principle close to equilibrium. This setting reveals the geometric structure of near-equilibrium thermodynamics and generalizes previous approaches to cases with nonconservative forces.",
    "authors": [
      "Danilo Forastiere",
      "Riccardo Rao",
      "Massimiliano Esposito"
    ],
    "publication_date": "2022-05-31T17:33:06Z",
    "arxiv_id": "http://arxiv.org/abs/2205.15974v1",
    "download_url": "https://arxiv.org/abs/2205.15974v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Superfluidity",
    "abstract": "New, superfluid specific additive integral of motion is found. This facilitates investigation of general thermodynamic equilibrium conditions for superfluid. The analysis is performed in an extended space of thermodynamic variables containing (along with the usual thermodynamic coordinates such as pressure and temperature) superfluid velocity and momentum density. The equilibrium stability conditions lead to thermodynamic inequalities which replace the Landau superfluidity criterion at finite temperatures.",
    "authors": [
      "A. F. Andreev",
      "L. A. Melnikovsky"
    ],
    "publication_date": "2004-05-06T10:45:54Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0405111v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0405111v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of scale-dependent Friedmann equations",
    "abstract": "In this work, the role of a time-varying Newton constant under the scale-dependent approach is investigated in the thermodynamics of the Friedman equations. In particular, we show that the extended Friedman equations can be derived either from equilibrium thermodynamics when the non-matter energy momentum tensor is interpreted as a fluid or from non-equilibrium thermodynamics when an entropy production term, which depends on the time-varying Newton constant, is included. Finally, a comparison between black hole and cosmological thermodynamics in the framework of scale--dependent gravity is briefly discussed.",
    "authors": [
      "Pedro Bargueno",
      "Ernesto Contreras",
      "Angel Rincon"
    ],
    "publication_date": "2021-05-21T07:37:53Z",
    "arxiv_id": "http://arxiv.org/abs/2105.10178v1",
    "download_url": "https://arxiv.org/abs/2105.10178v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of an Empty Box",
    "abstract": "A gas in a box is perhaps the most important model system studied in thermodynamics and statistical mechanics. Usually, studies focus on the gas, whereas the box merely serves as an idealized confinement. The present article focuses on the box as the central object and develops a thermodynamic theory by treating the geometric degrees of freedom of the box as the degrees of freedom of a thermodynamic system. Applying standard mathematical methods to the thermodynamics of an empty box allows equations with the same structure as those of cosmology and classical and quantum mechanics to be derived. The simple model system of an empty box is shown to have interesting connections to classical mechanics, special relativity, and quantum field theory.",
    "authors": [
      "Georg J. Schmitz",
      "Michael te Vrugt",
      "Tore Haug-Warberg",
      "Lodin Ellingsen",
      "Paul Needham",
      "Raphael Wittkowski"
    ],
    "publication_date": "2023-02-10T01:28:49Z",
    "arxiv_id": "http://arxiv.org/abs/2302.05006v1",
    "download_url": "https://arxiv.org/abs/2302.05006v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Illustration of Generalized Thermodynamics by Several Physical Examples",
    "abstract": "It has been shown recently that Bose Gase with weak pair (enough well) interaction is non ergodic system. But Bose Gase with weak pair interaction is so general system that it is evident that the majority of statistical mechanics systems are non ergodic too. It is also has been shown that it is possible to generalize the scheme of standard statistical mechanics and thermodynamics to take into account non ergodicity. This generalization is called a generalized thermodynamics. In some points this generalized thermodynamics coincide with standard equilibrium thermodynamics but some new specific results take place. It has been shown that this new generalized thermodynamics can be used to explain some physiological phenomena which take place in the living cell when the cell is exciting and dying.\n  In the present paper we try to illustrate some basic points of this generalized thermodynamics on some physical examples.",
    "authors": [
      "D. V. Prokhorenko"
    ],
    "publication_date": "2011-10-15T12:44:26Z",
    "arxiv_id": "http://arxiv.org/abs/1110.3408v1",
    "download_url": "https://arxiv.org/abs/1110.3408v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Confusion in Thermodynamics",
    "abstract": "For a long time now, confusion has existed in the minds of many over the meaning of various concepts in thermodynamics. Recently, this point has been brought to people's attention by two articles appearing on the well-known archive (arxiv) web site. The content of these two pieces serves to illustrate many of the problems and has occasioned the construction of this answer to at least some of them. The position of the axiom proposed by Carathéodory is central in this matter and here its position is clarified and secured within the framework of thermodynamics. In particular, its relation to the First Law is examined and justified.",
    "authors": [
      "Jeremy Dunning-Davies",
      "David Sands"
    ],
    "publication_date": "2011-03-02T20:52:31Z",
    "arxiv_id": "http://arxiv.org/abs/1103.4360v2",
    "download_url": "https://arxiv.org/abs/1103.4360v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum thermodynamics of single particle systems",
    "abstract": "Classical thermodynamics is built with the concept of equilibrium states. However, it is less clear how equilibrium thermodynamics emerges through the dynamics that follows the principle of quantum mechanics. In this paper, we develop a theory to study the exact nonequilibrium thermodynamics of quantum systems that is applicable to arbitrary small systems, even for single particle systems, in contact with a reservoir. We generalize the concept of temperature into nonequilibrium regime that depends on the detailed dynamics of quantum states. When we apply the theory to the cavity system and the two-level atomic system interacting with a heat reservoir, the exact nonequilibrium theory unravels unambiguously (1) the emergence of classical thermodynamics from quantum dynamics in the weak system-reservoir coupling regime, without introducing equilibrium hypothesis; (2) the breakdown of classical thermodynamics in the strong coupling regime, which is induced by non-Markovian memory dynamics; and (3) the occurrence of dynamical quantum phase transition characterized by inflationary dynamics associated with a negative nonequilibrium temperature, from which the third law of thermodynamics, allocated in the deep quantum realm, is naturally proved. The corresponding dynamical criticality provides the border separating the classical and quantum thermodynamics. The inflationary dynamics may also provide a simple picture for the origin of big bang and universe inflation.",
    "authors": [
      "Md. Manirul Ali",
      "Wei-Ming Huang",
      "Wei-Min Zhang"
    ],
    "publication_date": "2018-03-13T07:08:39Z",
    "arxiv_id": "http://arxiv.org/abs/1803.04658v3",
    "download_url": "https://arxiv.org/abs/1803.04658v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Accelerating Black Holes",
    "abstract": "We address a long-standing problem of describing the thermodynamics of a charged accelerating black hole. We derive a standard first law of black hole thermodynamics, with the usual identification of entropy proportional to the area of the event horizon -- even though the event horizon contains a conical singularity. This result not only extends the applicability of black hole thermodynamics to realms previously not anticipated, it also opens a possibility for studying novel properties of an important class of exact radiative solutions of Einstein equations describing accelerated objects. We discuss the thermodynamic volume, stability and phase structure of these black holes.",
    "authors": [
      "Michael Appels",
      "Ruth Gregory",
      "David Kubiznak"
    ],
    "publication_date": "2016-04-29T13:00:43Z",
    "arxiv_id": "http://arxiv.org/abs/1604.08812v2",
    "download_url": "https://arxiv.org/abs/1604.08812v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Local equilibrium and the second law of thermodynamics for irreversible systems with thermodynamic inertia",
    "abstract": "Validity of local equilibrium has been questioned for non-equilibrium systems which are characterized by delayed response. In particular, for systems with non-zero thermodynamic inertia, the assumption of local equilibrium leads to negative values of the entropy production, which is in contradiction with the second law of thermodynamics. In this paper we address this question by suggesting a variational formulation of irreversible evolution of a system with non-zero thermodynamic inertia. We introduce the Lagrangian, which depends on the properties of the normal and the so-called \"mirror-image\" systems. We show that the standard evolution equations, in particular the Maxwell-Cattaneo-Vernotte equation, can be derived from the variational procedure without going beyond the assumption of local equilibrium. We also argue, that the second law of thermodynamics should be understood as a consequence of the variational procedure and the property of local equilibrium. For systems with instantaneous response this leads to the standard requirement of the local instantaneous entropy production being always positive. However, if a system is characterized by delayed response, the formulation of the second law of thermodynamics should be altered. In particular, the quantity, which is always positive, is not the instantaneous entropy production, but the entropy production averaged over the period of the heat wave.",
    "authors": [
      "K. S. Glavatskiy"
    ],
    "publication_date": "2015-07-28T06:02:40Z",
    "arxiv_id": "http://arxiv.org/abs/1507.07656v1",
    "download_url": "https://arxiv.org/abs/1507.07656v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gravitational and Gravitoscalar Thermodynamics",
    "abstract": "Gravitational thermodynamics and gravitoscalar thermodynamics with $S^2 \\times \\mathbb{R}$ boundary geometry are investigated through the partition function, assuming that all Euclidean saddle point geometries contribute to the path integral and dominant ones are in the $B^3 \\times S^1$ or $S^2 \\times Disc$ topology sector. In the first part, I concentrate on the purely gravitational case with or without a cosmological constant and show there exists a new type of saddle point geometry, which I call the \"bag of gold(BG) instanton,\" only for the $Λ>0$ case. Because of this existence, thermodynamical stability of the system and the entropy bound are absent for $Λ>0$, these being universal properties for $Λ\\leq 0$. In the second part, I investigate the thermodynamical properties of a gravity-scalar system with a $\\varphi^2$ potential. I show that when $Λ\\leq 0$ and the boundary value of scalar field $J_{\\varphi}$ is below some value, then the entropy bound and thermodynamical stability do exist. When either condition on the parameters does not hold, however, thermodynamical stability is (partially) broken. The properties of the system and the relation between BG instantons and the breakdown are discussed in detail.",
    "authors": [
      "Shoichiro Miyashita"
    ],
    "publication_date": "2021-06-23T09:50:27Z",
    "arxiv_id": "http://arxiv.org/abs/2106.12273v2",
    "download_url": "https://arxiv.org/abs/2106.12273v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classical Thermodynamics Revisited: A Systems and Control Perspective",
    "abstract": "The purpose of this paper is two-fold. First, to make clear (and de-mystify) the basic concepts of classical thermodynamics, and thus to enable the integration of thermodynamics within systems modeling and control. Second, to demonstrate that systems and control theory provides a natural context for the formulation and understanding of classical thermodynamics. This is not so surprising since classical thermodynamics, firmly rooted in engineering with questions such as the maximal efficiency of steam engines, deals from the very start with systems in interaction with their surrounding (by heat flow, mechanical work, flow of matter, etc.). In particular, it will be shown that dissipativity theory is key in the formulation and interpretation of the First and Second Law of thermodynamics. Also a geometric view on the state properties and the dynamics of thermodynamic systems will be emphasized, thereby unifying and simplifying different representations of thermodynamic systems. On the other hand, I will also argue that thermodynamics motivates paradigm shifts within systems and control; in particular, the use of non-minimal state space formulations, and a geometric view on them. Furthermore, while systems and control theory has been primarily based on linear systems with quadratic cost criteria, in line with basic system models in electrical and mechanical engineering (RLC-circuits, mass-spring-damper systems, etc.), thermodynamics necessitates to go beyond this linear-quadratic paradigm.",
    "authors": [
      "Arjan van der Schaft"
    ],
    "publication_date": "2020-10-08T18:54:06Z",
    "arxiv_id": "http://arxiv.org/abs/2010.04213v1",
    "download_url": "https://arxiv.org/abs/2010.04213v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of dynamical wormholes",
    "abstract": "We study thermodynamics of dynamical traversable wormholes. These wormholes are investigated in the background of different cosmological models, with and without the cosmological constant, and which include the power-law and exponential cosmologies also. We work out the generalized surface gravity for wormholes of different shapes. The surface gravity is evaluated at the trapping horizon and the unified first law of thermodynamics is set up. The thermodynamic stability of these wormholes has also been investigated. Some cases of asymptotically flat, de Sitter and anti-de Sitter wormholes have been considered as well. Our results generalize those that exist for static Morris-Thorne wormholes.",
    "authors": [
      "Mudassar Rehman",
      "Khalid Saifullah"
    ],
    "publication_date": "2020-01-23T11:36:07Z",
    "arxiv_id": "http://arxiv.org/abs/2001.08457v1",
    "download_url": "https://arxiv.org/abs/2001.08457v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Information",
    "abstract": "As early as 1867, two years after the introduction of the concept of entropy by Clausius, Maxwell showed that the limitations imposed by the second law of thermodynamics depend on the information that one possesses about the state of a physical system. A \"very observant and neat-fingered being\", later on named Maxwell demon by Kelvin, could arrange the molecules of a gas and induce a temperature or pressure gradient without performing work, in apparent contradiction to the second law. One century later, Landauer claimed that \"information is physical\", and showed that certain processes involving information, like overwriting a memory, need work to be completed and are unavoidably accompanied by heat dissipation. Thermodynamics of information analyzes this bidirectional influence between thermodynamics and information processing. The seminal ideas that Landauer and Bennett devised in the 1970s have been recently reformulated in a more precise and general way by realizing that informational states are out of equilibrium and applying new tools from non-equilibrium statistical mechanics.",
    "authors": [
      "Juan M. R. Parrondo"
    ],
    "publication_date": "2023-06-20T18:28:08Z",
    "arxiv_id": "http://arxiv.org/abs/2306.12447v1",
    "download_url": "https://arxiv.org/abs/2306.12447v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First law of de Sitter thermodynamics",
    "abstract": "The de Sitter state has a special symmetry: it is homogeneous, and its curvature is constant in space. Since all the points in the de Sitter space are equivalent, this state is described by local thermodynamics. This state has the local temperature $T=H/π$ (which is twice the Gibbons-Hawking temperature), the local entropy density, the local energy density, and also the local gravitational degrees of freedom -- the scalar curvature ${\\cal R}$ and the effective gravitational coupling $K$. On the other hand, there is the cosmological horizon, which can be also characterized by the thermodynamic relations. We consider the connections between the local thermodynamics and the thermodynamics of the cosmological horizon. In particular, there is the holographic connection between the entropy density integrated over the Hubble volume and the Gibbons-Hawking entropy of the horizon, $S_{\\rm volume}=S_{\\rm horizon}=A/4G$. We also consider the first law of thermodynamics in these two approaches. In the local thermodynamics, on the one hand, the first law is valid for an arbitrary volume $V$ of de Sitter space. On the other hand, the first law is also applicable to the thermodynamics of the horizon. In both cases, the temperature is the same. This consideration is extended to the contracting de Sitter with its negative entropy, $S_{\\rm volume}=S_{\\rm horizon}=-A/4G$.",
    "authors": [
      "G. E. Volovik"
    ],
    "publication_date": "2025-04-08T07:43:36Z",
    "arxiv_id": "http://arxiv.org/abs/2504.05763v4",
    "download_url": "https://arxiv.org/abs/2504.05763v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]