[
  {
    "title": "Regular black holes and reductions of thermodynamic phase spaces",
    "abstract": "The thermodynamic inconsistency observed in regular black holes is resolved\nthrough the framework of reduced thermodynamic phase spaces. We demonstrate\nthat regular black holes are essentially induced from singular black holes by\nadding an extra requirement, which imposes a constraint among black hole\nparameters. This constraint reduces the thermodynamic phase space, rendering\nthe standard form of the first law of black hole thermodynamics inapplicable.\nAccordingly, we propose a novel methodology to study the thermodynamic\nproperties of regular black holes. Thermodynamic quantities must be defined in\nthe full, unconstrained thermodynamic phase space of the underlying singular\nblack holes, only afterward is the constraint imposed to derive the consistent\nand meaningful thermodynamic quantities of the regular black holes. Crucially,\nthis framework extends beyond regular black holes and applies universally to\nany black hole with this kind of constraint.",
    "authors": [
      "Meng-Sen Ma",
      "Huai-Fan Li",
      "Jian-Hua Shi"
    ],
    "publication_date": "2025-07-13T09:32:46Z",
    "arxiv_id": "http://arxiv.org/abs/2507.09551v2",
    "download_url": "http://arxiv.org/abs/2507.09551v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimizing optimal transport: Role of final distributions in finite-time\n  thermodynamics",
    "abstract": "Performing thermodynamic tasks within finite time while minimizing\nthermodynamic costs is a central challenge in stochastic thermodynamics. Here,\nwe develop a unified framework for optimizing the thermodynamic cost of\nperforming various tasks in finite time for overdamped Langevin systems.\nConventional optimization of thermodynamic cost based on optimal transport\ntheory leaves room for varying the final distributions according to the\nintended task, enabling further optimization. Taking advantage of this freedom,\nwe use Lagrange multipliers to derive the optimal final distribution that\nminimizes the thermodynamic cost. Our framework applies to a wide range of\nthermodynamic tasks, including particle transport, thermal squeezing, and\ninformation processing such as information erasure, measurement, and feedback.\nOur results are expected to provide design principles for\ninformation-processing devices and thermodynamic machines that operate at high\nspeed with low energetic costs.",
    "authors": [
      "Kaito Tojo",
      "Rihito Nagase",
      "Ken Funo",
      "Takahiro Sagawa"
    ],
    "publication_date": "2025-09-14T15:16:32Z",
    "arxiv_id": "http://arxiv.org/abs/2509.11314v1",
    "download_url": "http://arxiv.org/abs/2509.11314v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classical and Multiscale Non-equilibrium Thermodynamics",
    "abstract": "Classical and multiscale non-equilibrium thermodynamics have different\nhistories and different objectives. In this Note we explain the differences and\nreview some topics in which the multiscale viewpoint of mesoscopic time\nevolution of macroscopic systems helped to advance the classical\nnon-equilibrium thermodynamics. Eventually, we illustrate the Braun-Le\nChatelier principle in dissipative thermodynamics.",
    "authors": [
      "Miroslav Grmela",
      "Michal Pavelka"
    ],
    "publication_date": "2025-10-01T07:37:29Z",
    "arxiv_id": "http://arxiv.org/abs/2510.00610v1",
    "download_url": "http://arxiv.org/abs/2510.00610v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modelling brain based on canonical ensemble with functional MRI: A\n  thermodynamic exploration on neural system",
    "abstract": "Objective. Modelling is an important way to study the working mechanism of\nbrain. While the characterization and understanding of brain are still\ninadequate. This study tried to build a model of brain from the perspective of\nthermodynamics at system level, which brought a new thinking to brain\nmodelling.\n  Approach. Regarding brain regions as systems, voxels as particles, and\nintensity of signals as energy of particles, the thermodynamic model of brain\nwas built based on canonical ensemble theory. Two pairs of activated regions\nand two pairs of inactivated brain regions were selected for comparison in this\nstudy, and the analysis on thermodynamic properties based on the model proposed\nwere performed. In addition, the thermodynamic properties were also extracted\nas input features for the detection of Alzheimer's disease.\n  Main results. The experiment results verified the assumption that the brain\nalso follows the thermodynamic laws. It demonstrated the feasibility and\nrationality of brain thermodynamic modelling method proposed, indicating that\nthermodynamic parameters could be applied to describe the state of neural\nsystem. Meanwhile, the brain thermodynamic model achieved much better accuracy\nin detection of Alzheimer's disease, suggesting the potential application of\nthermodynamic model in auxiliary diagnosis.\n  Significance. (1) Instead of applying some thermodynamic parameters to\nanalyze neural system, a brain model at system level was proposed from\nperspective of thermodynamics for the first time in this study. (2) The study\ndiscovered that the neural system also follows the laws of thermodynamics,\nwhich leads to increased internal energy, increased free energy and decreased\nentropy when system is activated. (3) The detection of neural disease was\ndemonstrated to be benefit from thermodynamic model, implying the immense\npotential of thermodynamics in auxiliary diagnosis.",
    "authors": [
      "Chenxi Zhou",
      "Bin Yang",
      "Wenliang Fan",
      "Wei Li"
    ],
    "publication_date": "2021-02-26T13:23:20Z",
    "arxiv_id": "http://arxiv.org/abs/2103.01026v2",
    "download_url": "http://arxiv.org/abs/2103.01026v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "de Sitter thermodynamics in the canonical ensemble",
    "abstract": "The existing thermodynamics of the cosmological horizon in de-Sitter\nspacetime is established in the micro-canonical ensemble, while thermodynamics\nof black hole horizons are established in the canonical ensemble. Generally in\nthe ordinary thermodynamics and statistical mechanics, both of the\nmicro-canonical and canonical ensembles yield the same equation of state for\nany thermodynamic system. This implies the existence of a formulation of\nde-Sitter thermodynamics based on the canonical ensemble. This paper reproduces\nthe de-Sitter thermodynamics in the canonical ensemble. The procedure is as\nfollows: We put a spherical wall at the center of de-Sitter spacetime, whose\nmass is negligible and perfectly reflects the Hawking radiation coming from the\ncosmological horizon. Then the region enclosed by the wall and horizon settles\ndown to a thermal equilibrium state, for which the Euclidean action is\nevaluated and the partition function is obtained. The integration constant\n(subtraction term) of Euclidean action is determined to reproduce the equation\nof state (e.g. entropy-area law) verified already in the micro-canonical\nensemble. Our de-Sitter canonical ensemble is well-defined to preserve the\n\"thermodynamic consistency\", which means that the state variables satisfy not\nonly the four laws of thermodynamics but also the appropriate differential\nrelations with thermodynamic functions; e.g. partial derivatives of the free\nenergy give the entropy, pressure, and so on. The special role of cosmological\nconstant in de-Sitter thermodynamics is also revealed.",
    "authors": [
      "Hiromi Saida"
    ],
    "publication_date": "2009-08-21T02:27:47Z",
    "arxiv_id": "http://arxiv.org/abs/0908.3041v3",
    "download_url": "http://arxiv.org/abs/0908.3041v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Branch in the Chemical System Response to External Impact",
    "abstract": "The paper gives an account of a detailed investigation of the thermodynamic\nbranch as a path of the chemical system deviation from its isolated\nthermodynamic equilibrium under an external impact. For a combination of direct\nand reverse reactions in the same chemical system, full thermodynamic branch is\npresented by an S-shaped curve, whose ends asymptotically achieve appropriate\ninitial states, which, in turn, are logistic ends of the opposite reactions.\nThe slope tangents of the steepest parts of the curves, the areas of the\nmaximum rate of the shift growth vs. the external thermodynamic force, occurred\nto be directly proportional to the force and, simultaneously, linearly\nproportional to the thermodynamic equivalent of chemical reaction, which is the\nratio between the amount in moles of any reaction participant, transformed in\nan isolated system, along the reaction way from its initial state to\nthermodynamic equilibrium, to its stoichiometric coefficient. The found\nlinearity is valid for arbitrary combination of the stoichiometric coefficients\nin a reaction of compound synthesis from chemical elements like aA+bB=AaBb, and\nconfirms the exclusive role of the thermodynamic equivalent of transformation\nas the chemical system characteristic of robustness and irreversibility.\nResults of this work allow for quantitative evaluation of the chemical system\nshift from thermodynamic equilibrium along thermodynamic branch and its rate\nvs. the shifting force. Such an investigation became possible due to the\ndevelopment of discrete thermodynamics of chemical equilibria.",
    "authors": [
      "B. Zilbergleyt"
    ],
    "publication_date": "2012-03-20T18:31:31Z",
    "arxiv_id": "http://arxiv.org/abs/1203.5247v1",
    "download_url": "http://arxiv.org/abs/1203.5247v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Black hole thermodynamics in finite time",
    "abstract": "Finite-time thermodynamics provides the means to revisit ideal thermodynamic\nequilibrium processes in the light of reality and investigate the energetic\n\"price of haste\", i.e. the consequences of carrying out a process in finite\ntime, when perfect equilibrium cannot be awaited due to economic reasons or the\nnature of the process. Employing the formalism of geometric thermodynamics, a\nlower bound on the energy dissipated during a process is derived from the\nthermodynamic length of that process. The notion of length is hereby defined\nvia a metric structure on the space of equilibrium thermodynamics, spanned by a\nset of thermodynamic variables describing the system. Since the aim of\nfinite-time thermodynamics is to obtain realistic limitations on idealized\nscenarios, it is a useful tool to reassess the efficiency of thermodynamic\nprocesses. We examine its implications for black hole thermodynamics, in\nparticular scenarios inspired by the Penrose process, a thought experiment by\nwhich work can be extracted from a rotating black hole. We consider a Kerr\nblack hole which, by some mechanism, is losing mass and angular momentum.\nThermodynamically speaking, such a process is described in the equilibrium\nphase space of the black hole, but in reality, it is neither reversible nor\ninfinitely slow. We thus calculate the dissipated energy due to non-ideal\nfinite-time effects.",
    "authors": [
      "Christine Gruber"
    ],
    "publication_date": "2016-01-03T23:15:24Z",
    "arxiv_id": "http://arxiv.org/abs/1601.00353v1",
    "download_url": "http://arxiv.org/abs/1601.00353v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Hamiltonian approach for the Thermodynamics of AdS black holes",
    "abstract": "In this work we study the Thermodynamics of D-dimensional Schwarzschild-anti\nde Sitter (SAdS) black holes. The minimal Thermodynamics of the SAdS spacetime\nis briefly discussed, highlighting some of its strong points and shortcomings.\nThe minimal SAdS Thermodynamics is extended within a Hamiltonian approach, by\nmeans of the introduction of an additional degree of freedom. We demonstrate\nthat the cosmological constant can be introduced in the thermodynamic\ndescription of the SAdS black hole with a canonical transformation of the\nSchwarzschild problem, closely related to the introduction of an anti-de Sitter\nthermodynamic volume. The treatment presented is consistent, in the sense that\nit is compatible with the introduction of new thermodynamic potentials, and\nrespects the laws of black hole Thermodynamics. By demanding homogeneity of the\nthermodynamic variables, we are able to construct a new equation of state that\ncompletely characterizes the Thermodynamics of SAdS black holes. The treatment\nnaturally generates phenomenological constants that can be associated with\ndifferent boundary conditions in underlying microscopic theories. A whole new\nset of phenomena can be expected from the proposed generalization of SAdS\nThermodynamics.",
    "authors": [
      "M. C. Baldiotti",
      "R. Fresneda",
      "C. Molina"
    ],
    "publication_date": "2017-01-04T19:00:10Z",
    "arxiv_id": "http://arxiv.org/abs/1701.01119v3",
    "download_url": "http://arxiv.org/abs/1701.01119v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of fluctuations in small systems interacting with the\n  environment",
    "abstract": "A few decades after Hill's work on nano-thermodynamics, the development of a\nthermodynamic framework, to account consistently for the fluctuations of small\nsystems due to their interactions with the surrounding environment, is still\nunderway. Here we discuss how, in a small system, the interaction energy with\nthe environment may be described through a conjugate pair of intensive and\nextensive variables, giving rise to a Gibbs thermodynamics with an additional\nthermodynamic degree of freedom. The relevant thermodynamic potentials help\ndescribe the equilibrium conditions and the material properties that measure\nthe susceptibility of the system to the interaction with the environment. The\nresulting generalized ensembles, which describe the non-negligible, small\nsystem fluctuations, are shown to be equivalent. Away from the average\nthermodynamic state, the availability describes the distance between system and\nthe environment, in terms of the maximum work extractable from the fluctuation,\nand a proper definition of entropy extends the thermodynamics to the generic\nfluctuating state. From the latter state, entropic forces arise to restore the\naverage thermodynamic state. Our framework unifies and extends the ensemble\nthermodynamics by Hill and the recent advances in statistical mechanics under\nstrong coupling and reduces to classical macroscopic thermodynamics when the\nsystem is large. The particular case of a small ideal gas system is discussed\nin detail and the example of a single particle immersed in a bath is revisited\nin the light of the new formalism.",
    "authors": [
      "Salvatore Calabrese",
      "Lamberto Rondoni",
      "Amilcare Porporato"
    ],
    "publication_date": "2019-09-19T16:06:24Z",
    "arxiv_id": "http://arxiv.org/abs/1909.09479v1",
    "download_url": "http://arxiv.org/abs/1909.09479v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ruppeiner thermodynamic geometry for the Schwarzschild-AdS black hole",
    "abstract": "Due to the non-independence of entropy and thermodynamic volume for\nspherically symmetric black holes in the AdS spacetime, when applying the\nRuppeiner thermodynamic geometry theory to these black holes, we often\nencounter an unavoidable problem of the singularity about the line element of\nthermodynamic geometry. In this paper, we propose a basic and natural scheme\nfor dealing with the thermodynamic geometry of spherically symmetric AdS black\nholes. We point out that enthalpy, not internal energy, is the fundamental\nthermodynamic characteristic function for the Ruppeiner thermodynamic geometry.\nBased on this fact, we give the specific forms of the line element of\nthermodynamic geometry for Schwarzschild AdS (SAdS) black hole in different\nphase spaces and the results show that the thermodynamic curvatures obtained in\ndifferent phase spaces are equivalent. It is shown that the thermodynamic\ncurvature is negative which implies that the attractive interaction dominates\nbetween black hole molecules for the SAdS black hole. Meanwhile we also give an\napproximate expression of the thermodynamic curvature of the Schwarzschild\nblack hole which indicates that the black hole is dominated by repulsion on low\ntemperature region and by attraction on high temperature region.",
    "authors": [
      "Zhen-Ming Xu",
      "Bin Wu",
      "Wen-Li Yang"
    ],
    "publication_date": "2019-10-27T05:05:39Z",
    "arxiv_id": "http://arxiv.org/abs/1910.12182v2",
    "download_url": "http://arxiv.org/abs/1910.12182v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Role of Second Law of Thermodynamics in Continuum Physics: A Muschik\n  and Ehrentraut Theorem Revisited",
    "abstract": "Second law of thermodynamics imposes that in any thermodynamic process the\nentropy production must be nonnegative. In continuum physics such a requirement\nis fulfilled by postulating the constitutive equations which represent the\nmaterial properties of the bodies in such a way that second law of\nthermodynamics is satisfied in arbitrary processes. Such an approach, first\nassumed in some pioneering papers by Coleman and Noll \\cite{ColNol} and Coleman\nand Mizel \\cite{ColMiz}, in practice regards second law of thermodynamics as a\nrestriction on the constitutive equations, which must guarantee that any\nsolution of the balance laws satisfies also the entropy inequality. As observed\nby Muschik and Ehrentraut \\cite{MusEhr}, this is a useful operative assumption,\nbut not a consequence of general physical laws. Indeed, a different point of\nview, which regards second law of thermodynamics as a restriction on the\nthermodynamic processes, i.e., on the solutions of the system of balance laws,\nis possible. This is tantamount to assume that there are solutions of the\nbalance laws which satisfy the entropy inequality, and solutions which do not\nsatisfy it. In order to decide what is the correct approach, Muschik and\nErhentraut postulated an amendment to the second law, which makes explicit the\nevident but rather hidden assumption that in any point of the body the entropy\nproduction is zero if, and only if, this point is thermodynamic equilibrium.\nThen they proved that, given the amendment, second law of thermodynamics is\nnecessarily a restriction on the constitutive equations and not on the\nthermodynamic processes. In the present paper we revisit their proof, lighting\nup some geometric aspects which were hidden in Ref. \\cite{MusEhr}. Moreover, we\npropose an alternative formulation of second law of thermodynamics which\nincorporates the amendment.",
    "authors": [
      "V. A. Cimmelli",
      "P. Rogolino"
    ],
    "publication_date": "2022-02-02T17:45:17Z",
    "arxiv_id": "http://arxiv.org/abs/2202.01162v1",
    "download_url": "http://arxiv.org/abs/2202.01162v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Variational Principle for Extended Irreversible Thermodynamics: Heat\n  Conducting Viscous Fluids",
    "abstract": "Extended irreversible thermodynamics is a theory that expands the classical\nframework of nonequilibrium thermodynamics by going beyond the\nlocal-equilibrium assumption. A notable example of this is the Maxwell-Cattaneo\nheat flux model, which introduces a time lag in the heat flux response to\ntemperature gradients. In this paper, we develop a variational formulation of\nthe equations of extended irreversible thermodynamics by introducing an action\nprinciple for a nonequilibrium Lagrangian that treats thermodynamic fluxes as\nindependent variables. A key feature of this approach is that it naturally\nextends both Hamilton's principle of reversible continuum mechanics and the\nearlier variational formulation of classical irreversible thermodynamics. The\nvariational principle is initially formulated in the material (Lagrangian)\ndescription, from which the Eulerian form is derived using material covariance\n(or relabeling symmetries). The tensorial structure of the thermodynamic fluxes\ndictates the choice of objective rate in the Eulerian description, and plays a\ncentral role in the emergence of nonequilibrium stresses - arising from both\nviscous and thermal effects - that are essential to ensure thermodynamic\nconsistency. This framework naturally results in the Cattaneo-Christov model\nfor heat flux. We also investigate the extension of the approach to accommodate\nhigher-order fluxes and the general form of entropy fluxes. The variational\nframework presented in this paper has promising applications in the development\nof structure-preserving and thermodynamically consistent numerical methods. It\nis particularly relevant for modeling systems where entropy production is a\ndelicate issue that requires careful treatment to ensure consistency with the\nlaws of thermodynamics.",
    "authors": [
      "François Gay-Balmaz"
    ],
    "publication_date": "2025-02-24T11:48:17Z",
    "arxiv_id": "http://arxiv.org/abs/2502.17079v2",
    "download_url": "http://arxiv.org/abs/2502.17079v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unifying Chemical and Electrochemical Thermodynamics of Electrodes",
    "abstract": "Batteries are critical for electrified transportation and aviation, yet\nthermodynamic understanding of electrode materials remains lacking, as\nindicated by the often-seen violation of the second law of thermodynamics of\nopen-circuit voltage (OCV) models. On the other hand, thermodynamic modeling\nrarely utilizes electrochemical data such as OCV, entropic heat (dOCV/dT),\nwhich contains rich thermodynamic information. This work introduces a framework\nof thermodynamic modeling of materials for electrochemical energy storage,\nusing differentiable programming and gradient-based optimization of\nthermodynamic parameters. Using a modified Debye model that accounts for the\nphonon density of states, the thermodynamics of pure substances is modeled from\nexperimental measurements of specific heat ($c_p$) as well as the phonon\ndensity of states $g(\\omega)$. Thermodynamics of mixing is modeled with\nmeasured entropic heat and OCV data. We demonstrate the differentiable\nthermodynamic modeling framework with forward and inverse problems. In the\nforward problem, i.e. determining phase diagram of graphite anode given\nthermochemical and electrochemical data, we show that in addition to accurate\nreproduction of phase diagram of LixC6, the fitted temperature-dependent OCV of\ngraphite reaches 3.8 mV mean absolute error (MAE) for test set data measured at\n10$^\\circ$C, compared with 2.9-3.6 mV MAE for training set data measured at\n25$^\\circ$C - 57$^\\circ$C. In the inverse problem, i.e. determining OCV of\nlithium iron phosphate (LFP) cathode from phase diagram constrained by\nthermochemical and electrochemical data, we demonstrate accurate reproduction\nof LFP OCV as well as phase diagram. This framework offers a unified treatment\nof chemical and electrochemical thermodynamic data for electrode materials.",
    "authors": [
      "Archie Mingze Yao",
      "Amal Sebastian",
      "Venkatasubramaian Viswanathan"
    ],
    "publication_date": "2025-07-14T18:01:36Z",
    "arxiv_id": "http://arxiv.org/abs/2507.10677v1",
    "download_url": "http://arxiv.org/abs/2507.10677v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Length, Time, Speed and Optimum Path to Minimize Entropy\n  Production",
    "abstract": "In addition to the Riemannian metricization of the thermodynamic state space,\nlocal relaxation times offer a natural time scale, too. Generalizing existing\nproposals, we relate {\\it thermodynamic} time scale to the standard kinetic\ncoefficients of irreversible thermodynamics. Criteria for minimum entropy\nproduction in slow, slightly irreversible processes are discussed.\nEuler-Lagrange equations are derived for optimum thermodynamic control for\nfixed clock-time period as well as for fixed {\\it thermodynamic} time period.\nOnly this latter requires constant thermodynamic speed as the optimum control\nproposed earlier. An easy-to-implement stepwise algorithm is constructed to\nrealize control at constant thermodynamic speed. Since thermodynamic time is\nshown to correspond to the number of steps, thus the sophisticated task of\ndetermining thermodynamic time in real control problems can be substituted by\nmeasuring ordinary intensive variables. Most remarkably, optimum paths are\nRiemannian geodesics which would not be the case had we used ordinary time.",
    "authors": [
      "L. Diosi",
      "K. Kulacsy",
      "B. Lukacs",
      "A. Rácz"
    ],
    "publication_date": "1995-04-01T23:14:00Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9503174v2",
    "download_url": "http://arxiv.org/abs/cond-mat/9503174v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A note on the dynamics and thermodynamics of dislocated crystals",
    "abstract": "The dynamics and thermodynamics of dislocated crystals are studied within the\nframework of the nonlinear theory of elastic and plastic deformations.",
    "authors": [
      "Ruslan Sharipov"
    ],
    "publication_date": "2005-04-07T19:45:34Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0504180v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0504180v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Microcanonical Ensemble Extensive Thermodynamics of Tsallis Statistics",
    "abstract": "The microscopic foundation of the generalized equilibrium statistical\nmechanics based on the Tsallis entropy is given by using the Gibbs idea of\nstatistical ensembles of the classical and quantum mechanics. The equilibrium\ndistribution functions are derived by the thermodynamic method based upon the\nuse of the fundamental equation of thermodynamics and the statistical\ndefinition of the functions of the state of the system. It is shown that if the\nentropic index $\\xi=1/(q-1)$ in the microcanonical ensemble is an extensive\nvariable of the state of the system, then in the thermodynamic limit\n$\\tilde{z}=1/(q-1)N=const$ the principle of additivity and the zero law of\nthermodynamics are satisfied. In particular, the Tsallis entropy of the system\nis extensive and the temperature is intensive. Thus, the Tsallis statistics\ncompletely satisfies all the postulates of the equilibrium thermodynamics.\nMoreover, evaluation of the thermodynamic identities in the microcanonical\nensemble is provided by the Euler theorem. The principle of additivity and the\nEuler theorem are explicitly proved by using the illustration of the classical\nmicrocanonical ideal gas in the thermodynamic limit.",
    "authors": [
      "A. S. Parvan"
    ],
    "publication_date": "2005-06-16T07:29:39Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0506392v2",
    "download_url": "http://arxiv.org/abs/cond-mat/0506392v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics for single-molecule stretching experiments",
    "abstract": "We show how to construct non-equilibrium thermodynamics for systems too small\nto be considered thermodynamically in a traditional sense. Through the use of a\nnon-equilibrium ensemble of many replicas of the system which can be viewed as\na large thermodynamic system, we discuss the validity of non-equilibrium\nthermodynamics relations and analyze the nature of dissipation in small systems\nthrough the entropy production rate. We show in particular that the Gibbs\nequation, when formulated in terms of average values of the extensive\nquantities, is still valid whereas the Gibbs-Duhem equation differs from the\nequation obtained for large systems due to the lack of the thermodynamic limit.\nSingle-molecule stretching experiments are interpreted under the prism of this\ntheory. The potentials of mean force and mean position, now introduced in these\nexperiments in substitution of the thermodynamic potentials, correspond\nrespectively to our Helmholtz and Gibbs energies. These results show that a\nthermodynamic formalism can indeed be applied at the single-molecule level.",
    "authors": [
      "J. M. Rubi",
      "D. Bedeaux",
      "S. Kjelstrup"
    ],
    "publication_date": "2006-06-14T09:29:19Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0606361v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0606361v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Causal, psychological, and electrodynamic time arrows as consequences of\n  the thermodynamic time arrow",
    "abstract": "A clear explanation is given on how the causal, psychological, and\nelectrodynamic time arrows emerge from the thermodynamic time arrow.",
    "authors": [
      "H. Nikolic"
    ],
    "publication_date": "1998-12-04T16:33:44Z",
    "arxiv_id": "http://arxiv.org/abs/physics/9812006v1",
    "download_url": "http://arxiv.org/abs/physics/9812006v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Clausius inequality does not follow from the second law of\n  thermodynamics",
    "abstract": "The example of macroscopic thermodynamical system violating the Clausius\ninequality is presented.",
    "authors": [
      "A. V. Gavrilov"
    ],
    "publication_date": "2006-11-05T06:55:13Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0611044v1",
    "download_url": "http://arxiv.org/abs/physics/0611044v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-Equilibrium Thermodynamics formalism for Marcus cross-exchange\n  electron transfer reaction rates",
    "abstract": "The cross-exchange electron transfer expression arising from Marcus theory is\ndeduced using Onsager's non-equilibrium Thermodynamics formalism.",
    "authors": [
      "Richa Sethi",
      "M. V. Sangaranarayanan"
    ],
    "publication_date": "2007-12-29T11:21:47Z",
    "arxiv_id": "http://arxiv.org/abs/0801.0053v1",
    "download_url": "http://arxiv.org/abs/0801.0053v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonequilibrium evolution thermodynamics",
    "abstract": "A new approach - nonequilibrium evolution thermodynamics, is compared with\nclassical variant of Landau approach",
    "authors": [
      "Leonid S. Metlov"
    ],
    "publication_date": "2010-03-01T21:00:55Z",
    "arxiv_id": "http://arxiv.org/abs/1003.0450v1",
    "download_url": "http://arxiv.org/abs/1003.0450v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Variational principles in chemical equilibria: Complex chemical systems\n  with interacting subsystems",
    "abstract": "The goal of the paper is to derive a revised condition of global equilibrium\nin complex chemical systems as variational principle in formalism of recently\ndeveloped discrete thermodynamics (DTD) of chemical equilibria. In classical\napproach the problem of complex equilibrium is solved by minimization of the\nsystem Gibbs' free energy subject to logistic constraints. DTD demands any\nisolated system to comprise smaller subentities, which individual equilibria\nare based on the balance of internal and external thermodynamic forces, acting\nagainst them. The internal forces are equal to the subsystems thermodynamic\naffinities, while external forces originate from subsystems mutual\ninteractions. Those interactions impose additional constraints on the mother\nsystem Gibbs' free energy minimum. Basic expression of discrete thermodynamics,\nbeing multiplied by subsystems deviations from their \"true\" thermodynamic\nequilibria, is naturally identical to d'Alembert's principle. A thermodynamic\nversion of d'Alembert's principle in combination with derived from it\nthermodynamic version of the principle of virtual work, allowed us to express\nthe interactive constraints as a condition, that the sum of all subsystems\nthermodynamic affinities, multiplied by their deviations from their \"true\"\nequilibria, must be equal to zero. The revised formula of global equilibrium\ncondition in complex chemical systems contains three terms - system Gibbs' free\nenergy, logistic constraints, identical to their classical version, and\ninteractive constraints, originated from the subsystems mutual interactions.",
    "authors": [
      "B. Zilbergleyt"
    ],
    "publication_date": "2010-10-14T22:21:00Z",
    "arxiv_id": "http://arxiv.org/abs/1010.3038v1",
    "download_url": "http://arxiv.org/abs/1010.3038v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complete Quantum Thermodynamics of the Black Body Photon Gas",
    "abstract": "Kelly and Leff demonstrated and discussed formal and conceptual similarities\nbetween basic thermodynamic formulas for the classical ideal gas and black body\nphoton gas. Leff pointed out that thermodynamic formulas for the photon gas\ncannot be deduced completely by thermodynamic methods since these formulas hold\ntwo characteristic parameters, {\\it r} and {\\it b}, whose accurate values can\nbe obtained exclusively by accurate methods of the quantum statistics (by\nexplicit use of the Planck's or Bose-Einstein distribution). In this work we\nprove that the complete quantum thermodynamics of the black body photon gas can\nbe done by simple, thermodynamic (non-statistical) methods. We prove that both\nmentioned parameters and corresponding variables (photons number and pressure)\ncan be obtained very simply and practically exactly (with relative error about\nfew percent), by non-statistical (without any use of the Planck's or\nBose-Einstein distribution), quantum thermodynamic methods. Corner-stone of\nthese methods represents a quantum thermodynamic stability condition that is,\nin some degree, very similar to quantum stability condition in the Bohr quantum\natomic theory (de Broglie's interpretation of the Bohr quantization postulate).\nFinally, we discuss conceptual similarities between black body photon gas\nentropy and Bekenstein-Hawking black hole entropy.",
    "authors": [
      "Vladan Pankovic",
      "Darko V. Kapor"
    ],
    "publication_date": "2011-03-16T13:02:40Z",
    "arxiv_id": "http://arxiv.org/abs/1103.3161v1",
    "download_url": "http://arxiv.org/abs/1103.3161v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum correlations in the thermodynamic limit: the XY-model",
    "abstract": "We investigate thermal properties of quantum correlations in the\nthermodynamic limit with reference to the XY-model",
    "authors": [
      "J. Batle",
      "A. Plastino",
      "A. R. Plastino",
      "M. Casas"
    ],
    "publication_date": "2011-08-10T20:42:03Z",
    "arxiv_id": "http://arxiv.org/abs/1108.2285v1",
    "download_url": "http://arxiv.org/abs/1108.2285v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and the moment map",
    "abstract": "We give a thermodynamical interpretation of the moment map for toric\nvarieties.",
    "authors": [
      "Mikhail Kapranov"
    ],
    "publication_date": "2011-08-17T13:07:43Z",
    "arxiv_id": "http://arxiv.org/abs/1108.3472v1",
    "download_url": "http://arxiv.org/abs/1108.3472v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and scale relativity",
    "abstract": "It is shown how the fractal paths of scale relativity (following Nottale) can\nbe introduced into a thermodynamical context (following Asadov-Kechkin).",
    "authors": [
      "Robert Carroll"
    ],
    "publication_date": "2011-10-13T20:27:44Z",
    "arxiv_id": "http://arxiv.org/abs/1110.3059v1",
    "download_url": "http://arxiv.org/abs/1110.3059v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of the universe bounded by the cosmological event horizon\n  and dominated by the tachyon fluid",
    "abstract": "Our aim is to investigate the thermodynamic properties of the universe\nbounded by the cosmological event horizon and dominated by the tachyon fluid.\nWe give two different laws of evolution of our universe. Further, we show the\nfirst law and the generalized second law of thermodynamics (GSLT) are both\nsatisfied in two cases, but their properties of the thermodynamic equilibrium\nare totally different. Besides, under our solutions, we find the validity of\nthe laws of thermodynamics is irrelevant with the parameters of the tachyon\nfluid. Finally, we conclude that the universe bounded by the cosmological event\nhorizon and dominated by the tachyon fluid has a good thermodynamic\ndescription. In turn, the thermodynamic description can provide a good physical\ninterpretation for the dynamic evolution of our universe due to the equivalence\nbetween the first law of thermodynamics and the Friedmann equation to some\nextent.",
    "authors": [
      "Fei-Quan Tu",
      "Yi-Xin Chen"
    ],
    "publication_date": "2013-10-28T02:20:39Z",
    "arxiv_id": "http://arxiv.org/abs/1310.7295v1",
    "download_url": "http://arxiv.org/abs/1310.7295v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Methodological principles of modern thermodynamics",
    "abstract": "The article describes basic principles of the theory which unites\nthermodynamics of reversible and irreversible processes also extends them\nmethods on processes of transfer and transformation of any forms of energy",
    "authors": [
      "V. A. Etkin"
    ],
    "publication_date": "2014-01-02T21:45:34Z",
    "arxiv_id": "http://arxiv.org/abs/1401.0550v1",
    "download_url": "http://arxiv.org/abs/1401.0550v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Thermodynamic Covariance Principle",
    "abstract": "The concept of {\\it equivalent systems} from the thermodynamic point of view,\noriginally introduced by Th. De Donder and I. Prigogine, is deeply investigated\nand revised. From our point of view, two systems are thermodynamically\nequivalent if, under transformation of the thermodynamic forces, both the\nentropy production and the Glansdorff-Prigogine dissipative quantity remain\nunaltered. This kind of transformations may be referred to as the {\\it\nThermodynamic Coordinate Transformations} (TCT). The general class of\ntransformations satisfying the TCT is determined. We shall see that, also in\nthe nonlinear region ({\\it i.e.}, out of the Onsager region), the TCT preserve\nthe reciprocity relations of the transformed transport matrix. The equivalent\ncharacter of two transformations under TCT, leads to the concept of {\\it\nThermodynamic Covariance Principle} (TCP) stating that all thermodynamic\nequations involving the thermodynamic forces and flows ({\\it e.g.}, the closure\nflux-force relations) should be covariant under TCT.",
    "authors": [
      "Giorgio Sonnino",
      "Alberto Sonnino"
    ],
    "publication_date": "2014-03-03T10:23:30Z",
    "arxiv_id": "http://arxiv.org/abs/1403.0370v4",
    "download_url": "http://arxiv.org/abs/1403.0370v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Legendre transforms of the fundamental thermodynamic relation and\n  statistical ensembles",
    "abstract": "We show how the Legendre transforms of the fundamental thermodynamic relation\ncan be used to introduce different statistical ensembles.",
    "authors": [
      "S. Stepanow"
    ],
    "publication_date": "2014-10-15T11:55:01Z",
    "arxiv_id": "http://arxiv.org/abs/1410.4026v1",
    "download_url": "http://arxiv.org/abs/1410.4026v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mass and Thermodynamic Volume in Lifshitz Spacetimes",
    "abstract": "We examine the concept of black hole thermodynamic volume and its consistency\nwith thermodynamic mass in spacetimes that are not asymptotically flat but\ninstead have anisotropic Lifshitz scaling symmetry. We find that the\ngeneralized Smarr relation in anti de Sitter space -- extended to include a\npressure-volume term -- holds here as well, and that there exists a definition\nof thermodynamic mass and thermodynamic volume that satisfy both this relation\nand the $1^{st}$ law of thermodynamics. We compare the thermodynamic mass with\nother known quantities such as ADM, Brown-York and Hollands-Ishibashi-Marolf\nmasses. We also conjecture methods for obtaining a thermodynamic mass where\nthere is ambiguity due to the cosmological constant lengthscale depending on\nthe horizon radius lengthscale.",
    "authors": [
      "Wilson G. Brenna",
      "Robert B. Mann",
      "Miok Park"
    ],
    "publication_date": "2015-05-23T13:51:02Z",
    "arxiv_id": "http://arxiv.org/abs/1505.06331v3",
    "download_url": "http://arxiv.org/abs/1505.06331v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The thermodynamic entropy of a macroscopic quantum system is a\n  continuous function of energy",
    "abstract": "The proper definition of entropy is fundamental to the relationship between\nstatistical mechanics and thermodynamics. It also plays a major role in the\nrecent debate about the validity of the concept of negative temperature. In\nthis paper, I analyze and calculate the thermodynamic entropy for large, but\nfinite quantum mechanical systems. A special feature of this analysis is that\nthe thermodynamic energy of a quantum system is shown to be a continuous\nvariable, rather than being associated with discrete energy eigenvalues.\nCalculations of the entropy as a function of energy can be carried out with a\nLegendre transform of thermodynamic potentials obtained from a canonical\nensemble. The resultant expressions for the entropy are also able to describe\nequilibrium between quantum systems having incommensurate energy-level\nspacings. This definition of entropy preserves all required thermodynamic\nproperties, including satisfaction of all postulates and laws of\nthermodynamics. It also demonstrates the consistency of the concept of negative\ntemperature with the principles of thermodynamics.",
    "authors": [
      "Robert H. Swendsen"
    ],
    "publication_date": "2015-08-06T08:47:05Z",
    "arxiv_id": "http://arxiv.org/abs/1508.01323v1",
    "download_url": "http://arxiv.org/abs/1508.01323v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic formalism for some systems with countable Markov\n  structures",
    "abstract": "We study ergodic properties of certain piecewise smooth two-dimensional\nsystems by constructing countable Markov partitions. Using thermodynamic\nformalism we prove exponential decay of correleations.",
    "authors": [
      "Michael Jakobson"
    ],
    "publication_date": "2016-01-22T14:24:36Z",
    "arxiv_id": "http://arxiv.org/abs/1601.06013v1",
    "download_url": "http://arxiv.org/abs/1601.06013v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Phase transition and thermodynamic stability of topological black holes\n  in Hořava-Lifshitz gravity",
    "abstract": "On the basis of horizon thermodynamics, we study the thermodynamic stability\nand $P-V$ criticality of topological black holes constructed in\nHo\\v{r}ava-Lifshitz (HL) gravity without the detailed-balance condition (with\ngeneral $\\epsilon$). In the framework of horizon thermodynamics, we do not need\nthe concrete black hole solution (the metric function) and the concrete matter\nfields. It is shown that the HL black hole for $k=0$ is always\nthermodynamically stable. For $k=1$, the thermodynamic behaviors and $P-V$\ncriticality of the HL black hole are similar to those of RN-AdS black hole for\nsome $\\epsilon$. For $k=-1$, the temperature is classified into six types by\ntheir different features. Among them, we mainly focus on the type with triply\ndegenerate thermodynamic state. It is also shown that there is a \"thermodynamic\nsingularity\" for the $k=-1$ HL black hole, where the temperature and Gibbs free\nenergy both diverge apart from a special pressure $P_s$.",
    "authors": [
      "Meng-Sen Ma",
      "Ren Zhao",
      "Yan-Song Liu"
    ],
    "publication_date": "2016-04-24T09:02:47Z",
    "arxiv_id": "http://arxiv.org/abs/1604.06998v3",
    "download_url": "http://arxiv.org/abs/1604.06998v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic stability of black holes surrounded by quintessence",
    "abstract": "We study the thermodynamic stabilities of uncharged and charged black holes\nsurrounded by quintessence (BHQ) by means of effective thermodynamic\nquantities. When the state parameter of quintessence $\\omega_q$ is\nappropriately chosen, the structures of BHQ are something like that of black\nholes in de Sitter space. Constructing the effective first law of\nthermodynamics in two different ways, we can derive the effective thermodynamic\nquantities of BHQ. Especially, these effective thermodynamic quantities also\nsatisfy Smarr-like formulae. It is found that the uncharged BHQ is always\nthermodynamically unstable due to negative heat capacity, while for the charged\nBHQ there are phase transitions of the second order. We also show that there is\na great deal of difference on the thermodynamic properties and critical\nbehaviors of BHQ between the two ways we employed.",
    "authors": [
      "Meng-Sen Ma",
      "Ren Zhao",
      "Ya-Qin Ma"
    ],
    "publication_date": "2016-06-20T11:38:00Z",
    "arxiv_id": "http://arxiv.org/abs/1606.06070v1",
    "download_url": "http://arxiv.org/abs/1606.06070v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A remark on the convergence of Betti numbers in the thermodynamic regime",
    "abstract": "The convergence of the expectations of Betti numbers of \\v{C}ech complexes\nbuilt on binomial point processes in the thermodynamic regime is established.",
    "authors": [
      "Trinh Khanh Duy"
    ],
    "publication_date": "2016-06-21T11:15:27Z",
    "arxiv_id": "http://arxiv.org/abs/1606.06518v1",
    "download_url": "http://arxiv.org/abs/1606.06518v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal thermodynamics in different gravity theories: Conditions for\n  generalized second law of thermodynamics and thermodynamical equilibrium on\n  the horizons",
    "abstract": "The present work deals with a detailed study of universal thermodynamics in\ndifferent modified gravity theories. The validity of the generalized second law\nof thermodynamics (GSLT) and thermodynamical equilibrium (TE) of the Universe\nbounded by a horizon (apparent/event) in f(R)-gravity, Einstein-Gauss-Bonnet\ngravity, RS-II brane scenario and DGP brane model has been investigated. In the\nperspective of recent observational evidences, the matter in the Universe is\nchosen as interacting holographic dark energy model. The entropy on the\nhorizons are evaluated from the validity of the unified first law and as a\nresult there is a correction (in integral form) to the usual Bekenstein\nentropy. The other thermodynamical parameter namely temperature on the horizon\nis chosen as the recently introduced corrected Hawking temperature. The above\nthermodynamical analysis is done for homogeneous and isotropic flat FLRW model\nof the Universe. The restrictions for the validity of GSLT and the TE are\npresented in tabular form for each gravity theory. Finally, due to complicated\nexpressions, the validity of GSLT and TE are also examined from graphical\nrepresentation, using three Planck data sets.",
    "authors": [
      "Saugata Mitra",
      "Subhajit Saha",
      "Subenoy Chakraborty"
    ],
    "publication_date": "2016-10-27T08:12:30Z",
    "arxiv_id": "http://arxiv.org/abs/1610.09283v1",
    "download_url": "http://arxiv.org/abs/1610.09283v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of low-dimensional trapped Fermi gases",
    "abstract": "The effects of low dimensionality on the thermodynamics of a Fermi gas\ntrapped by isotropic power law potentials are analyzed. Particular attention is\ngiven to different characteristic temperatures that emerge, at low\ndimensionality, in the thermodynamic functions of state and in the\nthermodynamic susceptibilities (isothermal compressibility and specific heat).\nAn energy-entropy argument that physically favors the relevance of one of these\ncharacteristic temperatures, namely, the non vanishing temperature at which the\nchemical potential reaches the Fermi energy value, is presented. Such an\nargument allows to interpret the nonmonotonic dependence of the chemical\npotential on temperature, as an indicator of the appearance of a thermodynamic\nregime, where the equilibrium states of a trapped Fermi gas are characterized\nby larger fluctuations in energy and particle density as is revealed in the\ncorresponding thermodynamics susceptibilities.",
    "authors": [
      "Francisco J. Sevilla"
    ],
    "publication_date": "2016-12-08T00:41:00Z",
    "arxiv_id": "http://arxiv.org/abs/1612.02496v1",
    "download_url": "http://arxiv.org/abs/1612.02496v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamical aspects of black holes in modified gravity",
    "abstract": "We discuss some thermodynamical definitions for black holes in modified\ntheories of gravity.",
    "authors": [
      "Lorenzo Sebastiani"
    ],
    "publication_date": "2017-09-27T12:46:00Z",
    "arxiv_id": "http://arxiv.org/abs/1709.09986v1",
    "download_url": "http://arxiv.org/abs/1709.09986v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bayesian strategies for uncertainty quantification of the thermodynamic\n  properties of materials",
    "abstract": "Reliable models of the thermodynamic properties of materials are critical for\nindustrially relevant applications that require a good understanding of\nequilibrium phase diagrams, thermal and chemical transport, and microstructure\nevolution. The goal of thermodynamic models is to capture data from both\nexperimental and computational studies and then make reliable predictions when\nextrapolating to new regions of parameter space. These predictions will be\nimpacted by artifacts present in real data sets such as outliers, systematics\nerrors and unreliable or missing uncertainty bounds. Such issues increase the\nprobability of the thermodynamic model producing erroneous predictions. We\npresent a Bayesian framework for the selection, calibration and quantification\nof uncertainty of thermodynamic property models. The modular framework\naddresses numerous concerns regarding thermodynamic models including\nthermodynamic consistency, robustness to outliers and systematic errors by the\nuse of hyperparameter weightings and robust Likelihood and Prior distribution\nchoices. Furthermore, the framework's inherent transparency (e.g. our choice of\nprobability functions and associated parameters) enables insights into the\ncomplex process of thermodynamic assessment. We introduce these concepts\nthrough examples where the true property model is known. In addition, we\ndemonstrate the utility of the framework through the creation of a property\nmodel from a large set of experimental specific heat and enthalpy measurements\nof Hafnium metal from 0 to 4900K.",
    "authors": [
      "Noah H. Paulson",
      "Elise Jennings",
      "Marius Stan"
    ],
    "publication_date": "2018-09-19T18:53:23Z",
    "arxiv_id": "http://arxiv.org/abs/1809.07365v1",
    "download_url": "http://arxiv.org/abs/1809.07365v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Martingale structure for general thermodynamic functionals of diffusion\n  processes under second-order averaging",
    "abstract": "Novel hidden thermodynamic structures have recently been uncovered during the\ninvestigation of nonequilibrium thermodynamics for multiscale stochastic\nprocesses. Here we reveal the martingale structure for a general thermodynamic\nfunctional of inhomogeneous singularly perturbed diffusion processes under\nsecond-order averaging, where a general thermodynamic functional is defined as\nthe logarithmic Radon-Nykodim derivative between the laws of the original\nprocess and a comparable process (forward case) or its time reversal (backward\ncase). In the forward case, we prove that the regular and anomalous parts of a\nthermodynamic functional are orthogonal martingales. In the backward case,\nwhile the regular part may not be a martingale, we prove that the anomalous\npart is still a martingale. With the aid of the martingale structure, we prove\nthe integral fluctuation theorem satisfied by the regular and anomalous parts\nof a general thermodynamic functional. Further extensions and applications to\nstochastic thermodynamics are also discussed, including the martingale\nstructure and fluctuation theorems for the regular and anomalous parts of\nentropy production and housekeeping heat in the absence or presence of odd\nvariables.",
    "authors": [
      "Hao Ge",
      "Chen Jia",
      "Xiao Jin"
    ],
    "publication_date": "2018-11-12T02:05:10Z",
    "arxiv_id": "http://arxiv.org/abs/1811.04529v3",
    "download_url": "http://arxiv.org/abs/1811.04529v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonequilibrium Thermodynamics",
    "abstract": "Aspects of the modern dynamical systems approach to thermodynamics of\nstationary states out of equilibrium with attention to the original conceptions\nwhich arose at the beginnings of Statistical Mechanics",
    "authors": [
      "Giovanni Gallavotti"
    ],
    "publication_date": "2019-01-25T10:44:59Z",
    "arxiv_id": "http://arxiv.org/abs/1901.08821v1",
    "download_url": "http://arxiv.org/abs/1901.08821v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamical multihair and phase transitions of 4-dimensional charged\n  Taub-NUT-AdS spacetimes",
    "abstract": "We study the behavior of phase transitions for the four-dimensional charged\nTaub-NUT-AdS spacetime with the Newman-Unti-Tamburino (NUT) parameter\ninterpreted as the thermodynamic multihair in the extended thermodynamic phase\nspace, and mainly focus on the effects of the NUT parameter on the phase\ntransitions. We find that there is an upper bound on the value of the NUT\nparameter beyond which the corresponding physical inflection point or critical\npoint will not exist, and the thermodynamic trihair interpretation of the NUT\nparameter would admit a little larger upper bound than the thermodynamic bihair\ninterpretation. Moreover, as long as the NUT parameter is vanishingly small,\nthe analogy to the van der Waals liquid/gas phase transition is valid\nirrespective of the multihair characteristics of the NUT parameter. However, as\nthe NUT parameter increases to be comparable to the electric charge, such\nanalogy to the van der Waals system will be broken, and the corresponding\ninflection point is not a thermodynamic critical point any more. For a large\nNUT parameter, there are frequent occurrences of the zeroth order phase\ntransition in the case of the thermodynamic bihair interpretation, while only\nthe first order phase transition happens in the case of the thermodynamic\ntrihair interpretation.",
    "authors": [
      "Yao Xiao",
      "Jialin Zhang",
      "Hongwei Yu"
    ],
    "publication_date": "2021-04-28T03:54:14Z",
    "arxiv_id": "http://arxiv.org/abs/2104.13563v1",
    "download_url": "http://arxiv.org/abs/2104.13563v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Economic thermodynamics",
    "abstract": "A thermodynamic approach to the description of economic systems and processes\nis developed. It is shown that there is a deep analogy between the parameters\nof thermodynamic and economic systems (markets); so each thermodynamic\nparameter can be associated with a certain economic parameter or indicator. The\neconomic meaning of such primordially thermodynamic concepts as internal energy\nand temperature has been established. It is shown that many economic laws,\nwhich in economic theory are a generalization of the results of observations,\nor are based on the analysis of the psychology of the behavior of market\nactors, within the framework of economic thermodynamics can be obtained as the\nnatural and formal results of the theory. In particular, we show that economic\nthermodynamics allows a natural description of such a phenomenon as inflation.\nThe thermodynamic conditions of market equilibrium stability are derived and\nanalyzed, as well as the Le Chatelier's principle as applied to economic\nsystems.",
    "authors": [
      "Sergey Rashkovskiy"
    ],
    "publication_date": "2021-05-07T15:24:52Z",
    "arxiv_id": "http://arxiv.org/abs/2106.08964v1",
    "download_url": "http://arxiv.org/abs/2106.08964v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A short note on basic of information geometry from thermodynamics and\n  thermostatistics",
    "abstract": "This is a short note for some basics of information geometry from\nthermodynamics and Callen's themostatistics.",
    "authors": [
      "Tatsuaki Wada"
    ],
    "publication_date": "2021-09-01T04:29:31Z",
    "arxiv_id": "http://arxiv.org/abs/2109.02438v1",
    "download_url": "http://arxiv.org/abs/2109.02438v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemical Thermodynamics for Growing Systems",
    "abstract": "We consider growing open chemical reaction systems (CRSs), in which\nautocatalytic chemical reactions are encapsulated in a finite volume and its\nsize can change in conjunction with the reactions. The thermodynamics of\ngrowing CRSs is indispensable for understanding biological cells and designing\nprotocells by clarifying the physical conditions and costs for their growing\nstates. In this work, we establish a thermodynamic theory of growing CRSs by\nextending the Hessian geometric structure of non-growing CRSs. The theory\nprovides the environmental conditions to determine the fate of the growing\nCRSs; growth, shrinking or equilibration. We also identify thermodynamic\nconstraints; one to restrict the possible states of the growing CRSs and the\nother to further limit the region where a nonequilibrium steady growing state\ncan exist. Moreover, we evaluate the entropy production rate in the steady\ngrowing state. The growing nonequilibrium state has its origin in the\nextensivity of thermodynamics, which is different from the conventional\nnonequilibrium states with constant volume. These results are derived from\ngeneral thermodynamic considerations without assuming any specific\nthermodynamic potentials or reaction kinetics; i.e., they are obtained based\nsolely on the second law of thermodynamics.",
    "authors": [
      "Yuki Sughiyama",
      "Atsushi Kamimura",
      "Dimitri Loutchko",
      "Tetsuya J. Kobayashi"
    ],
    "publication_date": "2022-01-24T02:12:12Z",
    "arxiv_id": "http://arxiv.org/abs/2201.09417v2",
    "download_url": "http://arxiv.org/abs/2201.09417v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamically consistent versions of approximations used in\n  modelling moist air",
    "abstract": "Some existing approaches to modeling the thermodynamics of moist air make\napproximations that break $\\textit{thermodynamic consistency}$, such that the\nresulting thermodynamics do not obey the 1st and 2nd laws or have other\ninconsistencies. Recently, an approach to avoid such inconsistency has been\nsuggested: the use of $\\textit{thermodynamic potentials}$ in terms of their\n$\\textit{natural variables}$, from which all thermodynamic quantities and\nrelationships are derived. In this paper, we develop this approach for\n$\\textit{unapproximated}$ moist air thermodynamics and two widely used\napproximations: the constant $\\kappa$ approximation and the dry heat capacities\napproximation. The consistent constant $\\kappa$ approximation is particularly\nattractive because it leads to, when using virtual potential temperature\n$\\theta_v$ as the thermodynamic variable, adiabatic dynamics that depend only\non total mass, independent of the breakdown between water forms. Additionally,\na wide variety of material from different sources in the literature on\nthermodynamics in atmospheric modelling is brought together. It is hoped that\nthis paper provides a comprehensive reference for the use of thermodynamic\npotentials in atmospheric modelling, especially for the three systems\nconsidered here.",
    "authors": [
      "Christopher Eldred",
      "Mark Taylor",
      "Oksana Guba"
    ],
    "publication_date": "2022-04-01T15:53:58Z",
    "arxiv_id": "http://arxiv.org/abs/2204.00534v3",
    "download_url": "http://arxiv.org/abs/2204.00534v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic geometry and complexity of black holes in theories with\n  broken translational invariance",
    "abstract": "The relationship between thermodynamics and the Lloyd bound on the\nholographic complexity for a black hole has been of interest. We consider $D$\ndimensional anti-de Sitter black holes with hyperbolic geometry as well as\nblack holes with momentum relaxation that have a minimum for temperature and\nmass. We show that the singular points of the thermodynamic curvature of the\nblack holes, as thermodynamic systems, correspond to the zero points of the\naction and volume complexity at the Lloyd bound. For such black holes with a\nsingle horizon, the complexity of volume and the complexity of action at\nminimum mass and minimum temperature are zero, respectively. We show that the\nthermodynamic curvature diverges at these minimal values. Because of the\nbehaviour of action complexity and thermodynamic curvature at minimum\ntemperature, we propose the action complexity as an order parameter of the\nblack holes as thermodynamic systems. Also, we derive the critical exponent\nrelated to the thermodynamic curvature in different dimensions.",
    "authors": [
      "H. Babaei-Aghbolagh",
      "Hosein Mohammadzadeh",
      "Davood Mahdavian Yekta",
      "Komeil Babaei Velni"
    ],
    "publication_date": "2022-04-11T07:56:57Z",
    "arxiv_id": "http://arxiv.org/abs/2204.04927v1",
    "download_url": "http://arxiv.org/abs/2204.04927v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic-Dynamic Interrelations in Glass-Forming Polymer Fluids",
    "abstract": "We utilize the lattice cluster theory (LCT) of polymer fluids to show that\nthe configurational entropy, enthalpy, and internal energy are all closely\ninterrelated, as suggested by recent measurements by Caruthers and Medvedev, so\nthat the generalized entropy theory (GET) of glass formation, a combination of\nthe LCT and Adam-Gibbs model, can be recast in terms of any of these\nthermodynamic properties as a matter of convenience. Thermodynamic scaling, a\nform of density-temperature scaling exhibited by dynamic and some thermodynamic\nproperties, is used to assess which thermodynamic properties are most naturally\nlinked to dynamics, and we explore the origin of this scaling by both direct\ncalculations based on the GET and molecular dynamics simulations of a\ncoarse-grained polymer model. Through a combination of our comprehensive\nmodeling of thermodynamic properties using the LCT and the highly predictive\nGET model for how the fluid thermodynamics relate to its dynamics, along with\nsimulation results confirming these theoretical frameworks, we obtain insights\ninto thermodynamic aspects of collective motion and the slow $\\beta$-relaxation\nprocesses of glass-forming liquids.",
    "authors": [
      "Xiaolei Xu",
      "Jack F. Douglas",
      "Wen-Sheng Xu"
    ],
    "publication_date": "2022-09-09T23:25:17Z",
    "arxiv_id": "http://arxiv.org/abs/2209.04555v1",
    "download_url": "http://arxiv.org/abs/2209.04555v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Limits of Predictions in Thermodynamic Systems: A Review",
    "abstract": "The past twenty years have seen a resurgence of interest in nonequilibrium\nthermodynamics, thanks to advances in the theory of stochastic processes and in\ntheir thermodynamic interpretation. Fluctuation theorems provide fundamental\nconstraints on the dynamics of systems arbitrarily far from thermal\nequilibrium. Thermodynamic uncertainty relations bound the dissipative cost of\nprecision in a wide variety of processes. Concepts of excess work and excess\nheat provide the basis for a complete thermodynamics of nonequilibrium steady\nstates, including generalized Clausius relations and thermodynamic potentials.\nBut these general results carry their own limitations: fluctuation theorems\ninvolve exponential averages that can depend sensitively on unobservably rare\ntrajectories; steady-state thermodynamics makes use of a dual dynamics that\nlacks any direct physical interpretation. This review aims to present these\ncentral results of contemporary nonequilibrium thermodynamics in such a way\nthat the power of each claim for making physical predictions can be clearly\nassessed, using examples from current topics in soft matter and biophysics.",
    "authors": [
      "Robert Marsland III",
      "Jeremy England"
    ],
    "publication_date": "2017-07-20T19:10:55Z",
    "arxiv_id": "http://arxiv.org/abs/1707.06680v3",
    "download_url": "http://arxiv.org/abs/1707.06680v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]