[
  {
    "title": "Symplectic structure of electromagnetic duality",
    "abstract": "We develop an electromagnetic symplectic structure on the space-time manifold\nby defining a Poisson bracket in terms of an invertible electromagnetic tensor\nF_{\\mu\\nu}. Moreover, we define electromagnetic symplectic diffeomorphisms by\nimposing a special condition on the electromagnetic tensor. This condition\nimplies a special constraint on the Levi-Civita tensor. Then, we express\ngeometrically the electromagnetic duality by defing a dual local coordinates\nsystem.",
    "authors": [
      "M. Kachkachi"
    ],
    "publication_date": "1997-07-15T18:37:38Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9707140v1",
    "download_url": "http://arxiv.org/abs/hep-th/9707140v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Properties for Arbitrary Spin Particles: Part 1 $-$\n  Electromagnetic Current and Multipole Decomposition",
    "abstract": "In a set of two papers, we propose to study an old-standing problem, namely\nthe electromagnetic interaction for particles of arbitrary spin. Based on the\nassumption that light-cone helicity at tree level and $Q^2=0$ should be\nconserved non-trivially by the electromagnetic interaction, we are able to\nderive \\emph{all} the natural electromagnetic moments for a pointlike particle\nof \\emph{any} spin. In this first paper, we propose a transparent decomposition\nof the electromagnetic current in terms of covariant vertex functions. We also\ndefine in a general way the electromagnetic multipole form factors, and show\ntheir relation with the electromagnetic moments. Finally, by considering the\nBreit frame, we relate the covariant vertex functions to multipole form\nfactors.",
    "authors": [
      "Cédric Lorcé"
    ],
    "publication_date": "2009-01-27T08:58:28Z",
    "arxiv_id": "http://arxiv.org/abs/0901.4199v1",
    "download_url": "http://arxiv.org/abs/0901.4199v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simultaneously realizing thermal and electromagnetic cloaking by\n  multi-physical null medium",
    "abstract": "Simultaneously manipulating multiple physical fields plays an important role\nin the increasingly complex integrated systems, aerospace equipment,\nbiochemical productions, etc. For on-chip systems with high integration level\n(e.g., electronic/photonic chips and radio-frequency/microwave circuits), where\nboth electromagnetic information/energy transporting and heat\ndissipation/recovery need to be considered, the precise and efficient control\nof the propagation of electromagnetic waves and heat fluxes simultaneously is\nparticularly important. In this study, we propose a graphical designing method\nbased on thermal-electromagnetic null medium to simultaneously control the\npropagation of electromagnetic waves and thermal fields according to the\npre-designed paths. A thermal-electromagnetic cloak, which can create a\ncloaking effect on both electromagnetic waves and thermal fields\nsimultaneously, is designed by thermal-electromagnetic surface transformation\nand verified by both numerical simulations and experimental measurements. The\nthermal-electromagnetic surface transformation proposed in this study provides\na new methodology for simultaneous controlling on electromagnetic and\ntemperature fields, which can be used to realize a series of novel\nthermal-electromagnetic devices such as thermal-electromagnetic shifter,\nsplitter, bender, multiplexer and mode converter. The designed\nthermal-electromagnetic cloak opens up new ways to create a concealed region\nwhere any object within it does not create any disturbance to the external\nelectromagnetic waves and temperature fields simultaneously, which may have\nsignificant applications in improving thermal-electromagnetic compatibility\nproblem, protecting of thermal-electromagnetic sensitive components, and\nimproving efficiency of energy usage for complex on-chip systems.",
    "authors": [
      "Yichao Liu",
      "Xiaomin Ma",
      "Kun Chao",
      "Fei Sun",
      "Zihao Chen",
      "Jinyuan Shan",
      "Hanchuan Chen",
      "Gang Zhao",
      "Shaojie Chen"
    ],
    "publication_date": "2023-01-02T02:33:10Z",
    "arxiv_id": "http://arxiv.org/abs/2302.13831v1",
    "download_url": "http://arxiv.org/abs/2302.13831v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding the electromagnetic 4-potential in the tetrad bundle",
    "abstract": "Separation of the spin and orbital angular momenta of the electromagnetic\nfield has been discussed frequently in recent years. The spin and orbital\nangular momenta cannot be made simultaneously gauge invariant and Lorentz\ncovariant and are not conserved separately. After analyzing the source of the\nproblem, we find that the electromagnetic 4-potential depends on the local\nreference frame instead of the global reference frame. The transformation of\nthe local reference frame is the intrinsic degree of freedom of the\nelectromagnetic field. Therefore, considering only the Lorentz transformation\nof the global reference frame and neglecting the Lorentz transformation of the\nlocal reference frame may lead to the noncovariance of the electromagnetic\n4-potential. Accordingly, we redescribe these difficulties of the\nelectromagnetic field from the perspective of quantum field theory. By using\nthe behavior of the electromagnetic 4-potential that satisfies the Coulomb\ngauge in Lorentz coordinate transformation, we can construct the\nelectromagnetic vector in the tetrad bundle. The various physical quantities\nthat are induced by this electromagnetic vector satisfy Lorentz covariance in\nthe tetrad bundle. This electromagnetic vector, which is projected onto\nspace-time, is an electromagnetic 4-potential that satisfies the Coulomb gauge;\nthus, the electromagnetic vector is gauge invariant.",
    "authors": [
      "Yufang Hao",
      "Jiayin Shen",
      "Jianhong Ruan"
    ],
    "publication_date": "2018-06-15T08:14:13Z",
    "arxiv_id": "http://arxiv.org/abs/1806.07236v2",
    "download_url": "http://arxiv.org/abs/1806.07236v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the genesis of Post constraint in modern electromagnetism",
    "abstract": "The genesis of the Post constraint is premised on two attributes of modern\nelectromagnetism: (i) its microscopic nature, and (ii) the status of e and b as\nthe primitive electromagnetic fields. This constraint can therefore not arise\nin EH--electromagnetism, wherein the primitive electromagnetic fields are the\nmacroscopic fields E and H.",
    "authors": [
      "Akhlesh Lakhtakia"
    ],
    "publication_date": "2004-03-04T22:47:40Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0403042v1",
    "download_url": "http://arxiv.org/abs/physics/0403042v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Achievable Transverse Cylindrical Electromagnetic Mode",
    "abstract": "The system of Maxwell equations with an initial condition in a vacuum is\nsolved in a cylindrical coordinate system. It derives the cylindrical\ntransverse electromagnetic wave mode in which the electric field and magnetic\nfield are not in phase. Such electromagnetic wave can generate and exist in\nactual application, and there is no violation of the law of conservation of\nenergy during the electromagnetic field interchanges.",
    "authors": [
      "R. Chen",
      "X. Li"
    ],
    "publication_date": "2011-06-04T05:01:45Z",
    "arxiv_id": "http://arxiv.org/abs/1106.1369v1",
    "download_url": "http://arxiv.org/abs/1106.1369v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Surface Plasmon Polaritons Excited By Electromagnetic Waves Under\n  General Boundary Conditions",
    "abstract": "We investigate single interface surface plasmon polaritons (SPPs) excited by\nelectromagnetic waves under general electromagnetic boundary conditions that\nallow for non-zero surface charge and surface current densities. Incorporating\nthese, we derive general conditions for single interface SPPs and solve both\nthe surface source distributions and the surface electromagnetic waves for such\nSPPs when excited by electromagnetic waves.",
    "authors": [
      "Weiguo Yang",
      "Michael A. Fiddy"
    ],
    "publication_date": "2014-09-15T15:34:15Z",
    "arxiv_id": "http://arxiv.org/abs/1409.4295v1",
    "download_url": "http://arxiv.org/abs/1409.4295v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fractional Electromagnetic Field Theory and Its Applications",
    "abstract": "Fractional electromagnetic field theory describes electromagnetic wave\npropagation through the complex, nonlocal, dissipative, fractal and also recent\nartificially engineered materials know as fractional metamaterials. In this\ntheory using the fractional Maxwell equations we are also able to consider the\nwell-known effect of electromagnetic memory. In this review we present some\napplications of the powerful theory of fractional electrodynamics.",
    "authors": [
      "Hosein Nasrolahpour"
    ],
    "publication_date": "2022-09-12T17:31:54Z",
    "arxiv_id": "http://arxiv.org/abs/2209.06857v2",
    "download_url": "http://arxiv.org/abs/2209.06857v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On-chip omnidirectional electromagnetic-thermal cloak",
    "abstract": "Simultaneously guiding electromagnetic waves and heat flow at any incidence\nangle to smoothly bypass some electromagnetic/thermal sensitive elements is a\nkey factor to ensure efficient communication and thermal protection for an\non-chip system. In this study, an omnidirectional on-chip\nelectromagnetic-thermal cloak is proposed. Firstly, a holey metallic plate with\nperiodic array of subwavelength apertures is designed by optical surface\ntransformation to realize an omnidirectional electromagnetic cloaking module\nfor on-chip electromagnetic signal. Secondly, a two-layer ring-shaped\nengineered thermal structure is designed by solving Laplace equation to realize\nan omnidirectional thermal cloaking module for in-chip heat flow. Finally,\nthese two cloaking modules are combined elaborately to achieve cloaking effect\nfor both the electromagnetic waves and thermal fields simultaneously from any\ndetecting direction, thus protecting the build-in electromagnetic/thermal\nsensitive elements without disturbing the external electromagnetic/thermal\nsignal. The proposed electromagnetic-thermal cloak may have potential advantage\nin dealing with omnidirectional electromagnetic compatibility/shielding and\nmulti-directional thermal management/dissipation of an on-chip system.",
    "authors": [
      "Yichao Liu",
      "Hanchuan Chen",
      "Gang Zhao",
      "Fei Sun"
    ],
    "publication_date": "2023-12-06T11:53:13Z",
    "arxiv_id": "http://arxiv.org/abs/2401.00856v1",
    "download_url": "http://arxiv.org/abs/2401.00856v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "General Geometry and Geometry of Electromagnetism",
    "abstract": "It is shown that Electromagnetism creates geometry different from Riemannian\ngeometry. General geometry including Riemannian geometry as a special case is\nconstructed. It is proven that the most simplest special case of General\nGeometry is geometry underlying Electromagnetism. Action for electromagnetic\nfield and Maxwell equations are derived from curvature function of geometry\nunderlying Electromagnetism. And it is shown that equation of motion for a\nparticle interacting with electromagnetic field coincides exactly with equation\nfor geodesics of geometry underlying Electromagnetism.",
    "authors": [
      "Shervgi S. Shahverdiyev"
    ],
    "publication_date": "2002-05-22T02:34:42Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/0205224v3",
    "download_url": "http://arxiv.org/abs/hep-th/0205224v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effect of an electromagnetic field on the spectra and elliptic flow of\n  particles",
    "abstract": "In 2+1 dimensions, the evolution of flow under the influence of an external\nelectromagnetic field is simulated. The external electromagnetic field is\nexponentially decaying with time. Under the same initial conditions, flow\nevolution with and without the external electromagnetic field is compared. It\nwas found that the production of particles was enhanced when the external\nelectromagnetic field was present. As the strength of the electromagnetic field\nincreased, more particles were produced. Enhancement is greater at the high\ntransverse momentum than at the low transverse momentum. In addition, the\nelectromagnetic field also modifies the elliptic flow and the modification is\nrelated to the mass and charge of the particles.",
    "authors": [
      "Bohao Feng",
      "Zeyan Wang"
    ],
    "publication_date": "2017-05-22T16:43:54Z",
    "arxiv_id": "http://arxiv.org/abs/1705.07842v1",
    "download_url": "http://arxiv.org/abs/1705.07842v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Frequencies of astrophysical jets and gravitational strengths in the\n  octonion spaces",
    "abstract": "The paper focuses on applying the octonions to explore the electromagnetic\nand gravitational equations in the presence of some material media, exploring\nthe frequencies of astrophysical jets. Maxwell was the first to use the algebra\nof quaternions to describe the electromagnetic equations. This method\nencourages scholars in adopting the quaternions and octonions to study the\nphysical properties of electromagnetic and gravitational fields, including the\nfield strength, field source, linear momentum, and angular momentum and so\nforth. In the paper, the field strength and angular momentum in the vacuum can\nbe combined together to become one new physical quantity, that is, the\ncomposite field strength within the material media. Substituting the latter for\nthe field strength in the vacuum will deduce the field equations within\nmaterial media, including the electromagnetic and gravitational equations in\nthe presence of some material media. In terms of the electromagnetic fields,\nthe electromagnetic equations in the presence of some electromagnetic media are\nable to explore a few new physical properties of electromagnetic media.\nEspecially, in case the magnetic flux density and magnetization intensity both\nfluctuate at a single-frequency, their frequencies must be identical to each\nother within electromagnetic media. In some extreme cases, the electromagnetic\nequations within electromagnetic media will be degenerated into the Maxwell's\nequations in the vacuum. The above reveals that the electromagnetic equations\nwithin electromagnetic media are capable of extending the scope of application\nof electromagnetic theory. For the gravitational fields, there are some similar\ninferences and conclusions within gravitational media. Further they can be\nutilized to research the frequencies of astrophysical jets.",
    "authors": [
      "Zi-Hua Weng"
    ],
    "publication_date": "2022-02-11T08:28:01Z",
    "arxiv_id": "http://arxiv.org/abs/2202.06818v1",
    "download_url": "http://arxiv.org/abs/2202.06818v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Contribution of electric self-forces to electromagnetic momentum in a\n  moving system",
    "abstract": "In moving electromagnetic systems, electromagnetic momentum calculated from\nthe vector potential is shown to be proportional to the field energy of the\nsystem. The momentum thus obtained is shown actually to be the same as derived\nfrom a Lorentz transformation of the rest-frame electromagnetic energy of the\nsystem, assuming electromagnetic energy-momentum to be a 4-vector. The\nenergy-momentum densities of electromagnetic fields form, however, components\nof the electromagnetic stress-energy tensor, and their transformations from\nrest frame to another frame involve additional contributions from stress terms\nin the Maxwell stress tensor which do not get represented in the momentum\ncalculated from the vector potential. The genesis of these additional\ncontributions, arising from stress in the electromagnetic fields, can be\ntraced, from a physical perspective, to electric self-forces contributing to\nthe electromagnetic momentum of moving systems that might not always be very\nobvious. Such subtle contributions to the electromagnetic momentum from stress\nin electromagnetic fields that could be significant even for non-relativistic\nmotion of the system. Such contributions from stress in electromagnetic fields\nalso provide a natural solution to some curious riddles in electromagnetic\nmomentum like the famous, century-old, enigmatic factor of 4/3, encountered in\nthe electromagnetic momentum of a moving charged sphere.",
    "authors": [
      "Ashok K. Singal"
    ],
    "publication_date": "2022-05-23T12:48:06Z",
    "arxiv_id": "http://arxiv.org/abs/2206.00431v6",
    "download_url": "http://arxiv.org/abs/2206.00431v6",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unification of Electromagnetism and Gravitation in the Framework of\n  General Geometry",
    "abstract": "A new geometry, called General geometry, is constructed. It is proven that\nits the most simplest special case is geometry underlying Electromagnetism.\nAnother special case is Riemannian geometry. Action for electromagnetic field\nand Maxwell equations are derived from curvature function of geometry\nunderlying Electromagnetism. It is shown that equation of motion for a particle\ninteracting with electromagnetic field coincides exactly with equation for\ngeodesics of geometry underlying Electromagnetism. It is also shown that\nElectromagnetism can not be geometrized in the framework of Riemannian\ngeometry. Using General Geometry we propose a unified model of electromagnetism\nand gravitation which reproduces Electromagnetism and Gravitation and predicts\nthat electromagnetic field is a source for gravitational field. This theory is\nformulated in four dimensional spacetime and does not contain additional\nfields.",
    "authors": [
      "Shervgi Shahverdiyev"
    ],
    "publication_date": "2005-07-05T20:34:07Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0507034v1",
    "download_url": "http://arxiv.org/abs/physics/0507034v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Consistent formalism for the momentum of electromagnetic waves in\n  lossless dispersive metamaterials and the conservation of momentum",
    "abstract": "A new formalism for electromagnetic and mechanical momenta in a metamaterial\nis developed by means of the technique of wave-packet integrals. The medium has\nhuge mass density and can therefore be regarded as almost stationary upon\nincident electromagnetic waves. A clear identification of momentum density and\nmomentum flow, including their electromagnetic and mechanical parts, is\nobtained by employing this formalism in a lossless dispersive metamaterial\n(including the cases of impedance matching and mismatching with vacuum). It is\nfound that the ratio of the electromagnetic momentum density to the mechanical\nmomentum density depends on the impedance and group velocity of the\nelectromagnetic wave inside the metamaterial. One of the definite results is\nthat both the electromagnetic momentum and the mechanical momentum in the\nmetamaterial are in the same direction as the energy flow, instead of in the\ndirection of the wave vector. The conservation of total momentum is verified.\nIn addition, the law of energy conservation in the process of normal incidence\nis also verified by using the wave-packet integral of both the electromagnetic\nenergy density and the electromagnetic power density, of which the latter is\ncaused by the interaction between the induced (polarized) currents and the\nelectromagnetic wave.",
    "authors": [
      "Yingran He",
      "Jianqi Shen",
      "Sailing He"
    ],
    "publication_date": "2011-03-21T11:16:05Z",
    "arxiv_id": "http://arxiv.org/abs/1103.3973v1",
    "download_url": "http://arxiv.org/abs/1103.3973v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Particle Physics in Intense Electromagnetic Fields",
    "abstract": "The quantum field theory in the presence of classical background\nelectromagnetic fields is reviewed. We give a pedagogical introduction to the\nFeynman-Furry method of describing non-perturbative interactions with very\nstrong electromagnetic fields. A particular emphasis is given to the case of\nthe plane-wave electromagnetic field for which the charged particles' wave\nfunctions and propagators are presented. Some general features of quantum\nprocesses proceeding in the intense electromagnetic background are argued. We\nalso discuss the possibilities of searching new physics through the\ninvestigations of quantum phenomena induced by the strong electromagnetic\nenvironment.",
    "authors": [
      "Alexander V. Kurilin"
    ],
    "publication_date": "2002-10-13T10:06:43Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/0210194v1",
    "download_url": "http://arxiv.org/abs/hep-ph/0210194v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Theory of electromagnetic fields",
    "abstract": "We discuss the theory of electromagnetic fields, with an emphasis on aspects\nrelevant to radiofrequency systems in particle accelerators. We begin by\nreviewing Maxwell's equations and their physical significance. We show that in\nfree space, there are solutions to Maxwell's equations representing the\npropagation of electromagnetic fields as waves. We introduce electromagnetic\npotentials, and show how they can be used to simplify the calculation of the\nfields in the presence of sources. We derive Poynting's theorem, which leads to\nexpressions for the energy density and energy flux in an electromagnetic field.\nWe discuss the properties of electromagnetic waves in cavities, waveguides and\ntransmission lines.",
    "authors": [
      "Andrzej Wolski"
    ],
    "publication_date": "2011-11-18T13:17:02Z",
    "arxiv_id": "http://arxiv.org/abs/1111.4354v2",
    "download_url": "http://arxiv.org/abs/1111.4354v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interaction between gravitational radiation and electromagnetic\n  radiation",
    "abstract": "In this review paper we investigate the connection between gravity and\nelectromagnetism from Faraday to the present day. The particular focus is on\nthe connection between gravitational and electromagnetic radiation. We discuss\nelectromagnetic radiation produced when a gravitational wave passes through a\nmagnetic field. We then discuss the interaction of electromagnetic radiation\nwith gravitational waves via Feynman diagrams of the process $graviton +\ngraviton \\to photon + photon$. Finally we review recent work on the vacuum\nproduction of counterpart electromagnetic radiation by gravitational waves.",
    "authors": [
      "Preston Jones",
      "Douglas Singleton"
    ],
    "publication_date": "2018-11-03T18:36:09Z",
    "arxiv_id": "http://arxiv.org/abs/1811.03002v1",
    "download_url": "http://arxiv.org/abs/1811.03002v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Learning about the QCD medium using electromagnetic and weak probes",
    "abstract": "Recent theoretical developments concerning radiation of electromagnetic and\nweak probes in ultra-relativistic heavy-ion collisions is overviewed. These\nproceedings focus on electromagnetic probes and briefly cover weak probes. An\noutlook regarding the future use of electromagnetic probes is formulated\nwhereby a quantitative Bayesian comparison, simultaneously employing\nelectromagnetic and hadronic calculations of experimental observables against\ndata, is highlighted as a path towards a better understanding of the properties\nof the QCD medium.",
    "authors": [
      "Gojko Vujanovic"
    ],
    "publication_date": "2020-08-26T22:05:28Z",
    "arxiv_id": "http://arxiv.org/abs/2008.11843v2",
    "download_url": "http://arxiv.org/abs/2008.11843v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical investigations on the Maxwell electromagnetic invariant in\n  the spinning and charged horizonless star background",
    "abstract": "We study properties of the Maxwell electromagnetic invariant in the external\nregion of spinning and charged horizonless stars. We analytically find that the\nminimum negative value of the Maxwell electromagnetic invariant is obtained on\nthe equator of the star surface. We are interested in scalar fields\nnon-minimally coupled to the Maxwell electromagnetic invariant. The negative\nenough Maxwell electromagnetic invariant can lead to a negative effective mass\nterm, which forms a binding potential well for the scalar field. It means that\nthe scalar field coupled to the Maxwell electromagnetic invariant may mostly\nexist around the surface of the star on the equator.",
    "authors": [
      "Yan Peng"
    ],
    "publication_date": "2024-01-02T01:59:52Z",
    "arxiv_id": "http://arxiv.org/abs/2401.00990v1",
    "download_url": "http://arxiv.org/abs/2401.00990v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Functional Programming in Learning Electromagnetic Theory",
    "abstract": "Electromagnetic theory is central to physics. An undergraduate major in\nphysics typically takes a semester or a year of electromagnetic theory as a\njunior or senior, and a graduate student in physics typically takes an\nadditional semester or year at a more advanced level. In fall 2023, the author\ntaught his undergraduate electricity and magnetism class using numerical\nmethods in Haskell in parallel with traditional analytical methods. This\narticle describes what functional programming has to offer to physics in\ngeneral, and electromagnetic theory in particular. We give examples from vector\ncalculus, the mathematical language in which electromagnetic theory is\nexpressed, and electromagnetic theory itself.",
    "authors": [
      "Scott N. Walck"
    ],
    "publication_date": "2024-07-10T23:27:37Z",
    "arxiv_id": "http://arxiv.org/abs/2407.08090v1",
    "download_url": "http://arxiv.org/abs/2407.08090v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetism as Space-Time Pseudo-Curvature",
    "abstract": "We propose a novel framework that interprets the electromagnetic field as a\nmanifestation of spacetime pseudo-curvature, bridging electromagnetism with the\ngeometric principles of general relativity. By introducing modified field\nequations, we recover classical electromagnetic results, including Coulomb's\nLaw, the magnetic field of a rotating sphere, and the propagation of\nelectromagnetic waves. Additionally, this framework predicts unique phenomena,\nsuch as test-charge-dependent time dilation and length contraction, which lie\noutside the scope of Maxwell's electromagnetism and Quantum Electrodynamics.\nThese results suggest new avenues for exploring the interplay between geometry\nand field theories in fundamental physics.",
    "authors": [
      "Faik Bouhrik",
      "Tiju Thomas"
    ],
    "publication_date": "2025-01-22T04:24:26Z",
    "arxiv_id": "http://arxiv.org/abs/2501.12628v3",
    "download_url": "http://arxiv.org/abs/2501.12628v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic structure of hadrons",
    "abstract": "In the previous papers (/quant-ph/0204037, /quant-ph/0204134,\nquant-ph/0205075), based on Dirac's equation we have considered the\nelectromagnetic structure of the leptons. In the present paper, using the\nYang-Mills equation we will analyse the electromagnetic structure of the\nhadrons.",
    "authors": [
      "Alexander G. Kyriakos"
    ],
    "publication_date": "2002-06-05T21:36:21Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/0206059v1",
    "download_url": "http://arxiv.org/abs/hep-ph/0206059v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modulo 2 periodicity of complex Clifford algebras and electromagnetic\n  field",
    "abstract": "Electromagnetic field is considered in the framework of Clifford algebra\n$\\C_2$ over a field of complex numbers. It is shown here that a modulo 2\nperiodicity of complex Clifford algebras may be connected with electromagnetic\nfield.",
    "authors": [
      "Vadim V. Varlamov"
    ],
    "publication_date": "1997-09-16T16:48:16Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9709112v1",
    "download_url": "http://arxiv.org/abs/hep-th/9709112v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The $ννγ$ Amplitude in an External Homogeneous\n  Electromagnetic Field",
    "abstract": "Neutrino-photon interactions in the presence of an external homogeneous\nconstant electromagnetic field are studied. The $\\nu \\nu \\gamma $ amplitude is\ncalculated in an electromagnetic field of the general type, when the two field\ninvariants are nonzero.",
    "authors": [
      "R. Shaisultanov"
    ],
    "publication_date": "2000-02-10T09:05:30Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/0002079v1",
    "download_url": "http://arxiv.org/abs/hep-th/0002079v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the gravitational fields created by the electromagnetic waves",
    "abstract": "We show that the Maxwell equations describing an electromagnetic wave are a\nmathematical consequence of the Einstein equations for the same wave. This fact\nis significant for the problem of the Einsteinian metrics corresponding to the\nelectromagnetic waves.",
    "authors": [
      "A. Loinger",
      "T. Marsico"
    ],
    "publication_date": "2011-06-11T06:41:04Z",
    "arxiv_id": "http://arxiv.org/abs/1106.2210v1",
    "download_url": "http://arxiv.org/abs/1106.2210v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic space-time crystals. III. Dispersion relations for\n  partial solutions",
    "abstract": "Partial solutions of the Dirac equation describing an electron motion in\nelectromagnetic crystals created by plane waves with linear and circular\npolarizations are treated. It is shown that the electromagnetic crystal formed\nby circularly polarized waves possesses the spin birefringence.",
    "authors": [
      "G. N. Borzdov"
    ],
    "publication_date": "2014-10-21T05:22:41Z",
    "arxiv_id": "http://arxiv.org/abs/1410.5536v1",
    "download_url": "http://arxiv.org/abs/1410.5536v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Localization of fremions in rotating electromagnetic fields",
    "abstract": "Parameters of localization are defined in the lab and rotating frame for\nsolutions of the Dirac equation in the field of a traveling circularly\npolarized electromagnetic wave and constant magnetic field. The radius of\nlocalization is of the order of the electromagnetic wavelength and lesser.",
    "authors": [
      "B. V. Gisin"
    ],
    "publication_date": "2015-06-15T19:14:22Z",
    "arxiv_id": "http://arxiv.org/abs/1506.04944v1",
    "download_url": "http://arxiv.org/abs/1506.04944v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic energy, momentum and forces in a dielectric medium with\n  losses",
    "abstract": "From the energy-momentum tensors of the electromagnetic field and the\nmechanical energy-momentum, the equations of energy conservation and balance of\nelectromagnetic and mechanical forces are obtained. The equation for the\nAbraham force in a dielectric medium with losses is obtained",
    "authors": [
      "Yurii A. Spirichev"
    ],
    "publication_date": "2017-05-23T03:12:35Z",
    "arxiv_id": "http://arxiv.org/abs/1705.08447v1",
    "download_url": "http://arxiv.org/abs/1705.08447v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How Standing Electromagnetic Wave Modulates Electron Current",
    "abstract": "Interaction of nonrelativistic electrons with a standing electromagnetic wave\nis considered. The modulation amplitude of an electron current in the field of\na standing or traveling electromagnetic wave is calculated in the quantum\napproach.",
    "authors": [
      "M. A. Kutlan"
    ],
    "publication_date": "2017-08-15T05:44:05Z",
    "arxiv_id": "http://arxiv.org/abs/1709.07057v1",
    "download_url": "http://arxiv.org/abs/1709.07057v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Space-time Curvature of Classical Electromagnetism",
    "abstract": "The space-time curvature carried by electromagnetic fields is discovered and\na new unification of geometry and electromagnetism is found. Curvature is\ninvariant under charge reversal symmetry. Electromagnetic field equations are\nexamined with De Rham co homology theory. Radiative electromagnetic fields must\nbe exact and co exact to preclude unobserved massless topological charges.\nWeyl's conformal tensor, here called ``the gravitational field'', is decomposed\ninto a divergence-free non-local piece with support everywhere and a local\npiece with the same support as the matter. By tuning a local gravitational\nfield to a Maxwell field the electromagnetic field's local gravitational field\nis discovered. This gravitational field carries the electromagnetic field's\npolarization or phase information, unlike Maxwell's stress-energy tensor. The\nunification assumes Einstein's equations and derives Maxwell's equations from\ncurvature assumptions. Gravity forbids magnetic monopoles! This unification is\nstronger than the Einstein-Maxwell equations alone, as those equations must\nproduce the electromagnetic field's local gravitational field and not just any\nconformal tensor. Charged black holes are examples. Curvature of radiative null\nelectromagnetic fields is characterized.",
    "authors": [
      "R. W. M. Woodside"
    ],
    "publication_date": "2004-10-08T19:33:23Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0410043v1",
    "download_url": "http://arxiv.org/abs/gr-qc/0410043v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Nature is Simple in Essence - Blueprint for Unification of Gravity\n  and Electromagnetism",
    "abstract": "The Temporal Fluctuation Model proposed in present paper represents an\nattempt for a unitary vision for gravity, inertia and electromagnetism. We\nobtain the main results of General Relativity and Electromagnetism and the\ntheory, until now, don't contain self-contradictions. As well, we obtain the\n\"unified potential\" which has terms that coupling gravitation with\nelectromagnetism and who could be the basis for future technological\napplications.",
    "authors": [
      "Viorel Drafta"
    ],
    "publication_date": "2001-05-28T23:13:14Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0105095v1",
    "download_url": "http://arxiv.org/abs/physics/0105095v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Plane electromagnetic wave in PEMC",
    "abstract": "Plane electromagnetic wave propagating in perfect electromagnetic conductor\n(PEMC) is considered. Its wave number has no connection with the frequency. An\ninterface is introduced between an ordinary isotropic medium and PEMC. The wave\nin PEMC is matched to plane electromagnetic wave incident normally on the\ninterface from the ordinary medium and reflected from it. Then the\nplane-parallel slab made of PEMC is considered and a plane wave is found in it.",
    "authors": [
      "Bernard Jancewicz"
    ],
    "publication_date": "2005-08-31T11:15:30Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0508231v1",
    "download_url": "http://arxiv.org/abs/physics/0508231v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic interpretation of leptons",
    "abstract": "In the previous papers (quant-ph/0204037), (quant-ph/0204134) on the basis of\nDirac's equation we have considered the electromagnetic interpretation of the\nquantum theory of electron. Here we continue the electron structure study.\nSince the Dirac equation is also the equation of the other leptons, in the\npresent paper from the electromagnetic point of view we analyse the structure\nof neutrino. We will show that not only the electron but also all the other\nleptons have the electromagnetic structure.",
    "authors": [
      "Alexander G. Kyriakos"
    ],
    "publication_date": "2002-05-13T20:46:55Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0205075v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0205075v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The electromagnetic momentum of static charge-current distributions",
    "abstract": "The origin of electromagnetic momentum for general static charge-current\ndistributions is examined. The electromagnetic momentum for static\nelectromagnetic fields is derived by implementing conservation of momentum for\nthe sum of mechanical momentum and electromagnetic momentum. The external force\nrequired to keep matter at rest during the production of the final static\nconfiguration produces the electromagnetic momentum. Examples of the\nelectromagnetic momentum in static electric and magnetic fields are given. The\n`center of energy' theorem is shown to be violated by electromagnetic momentum.\n`Hidden momentum' is shown to be generally absent, and not to cancel\nelectromagnetic momentum.",
    "authors": [
      "Jerrold Franklin"
    ],
    "publication_date": "2013-02-11T15:58:11Z",
    "arxiv_id": "http://arxiv.org/abs/1302.3880v3",
    "download_url": "http://arxiv.org/abs/1302.3880v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dynamical evolution of the electromagnetic perturbation with Weyl\n  corrections",
    "abstract": "We present firstly the master equation of an electromagnetic perturbation\nwith Weyl correction in the four-dimensional black hole spacetime, which\ndepends not only on the Weyl correction parameter, but also on the parity of\nthe electromagnetic field. It is quite different from that of the usual\nelectromagnetic perturbation without Weyl correction in the four-dimensional\nspacetime. And then we have investigated numerically the dynamical evolution of\nthe electromagnetic perturbation with Weyl correction in the background of a\nfour-dimensional Schwarzschild black hole spacetime. Our results show that the\nWeyl correction parameter $\\alpha$ and the parities imprint in the wave\ndynamics of the electromagnetic perturbation. For the odd parity\nelectromagnetic perturbation, we find it grows with exponential rate if the\nvalue of $\\alpha$ is below the negative critical value $\\alpha_c$. However, for\nthe electromagnetic perturbation with even parity, we find that there does not\nexist such a critical threshold value and the electromagnetic field always\ndecays in the allowed range of $\\alpha$.",
    "authors": [
      "Songbai Chen",
      "Jiliang Jing"
    ],
    "publication_date": "2013-07-29T04:47:53Z",
    "arxiv_id": "http://arxiv.org/abs/1307.7459v2",
    "download_url": "http://arxiv.org/abs/1307.7459v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic signatures of far-field gravitational radiation in the\n  1+3 approach",
    "abstract": "Gravitational waves from astrophysical sources can interact with background\nelectromagnetic fields, giving rise to distinctive and potentially detectable\nelectromagnetic signatures. In this paper, we study such interactions for\nfar-field gravitational radiation using the 1+3 approach to relativity.\nLinearised equations for the electromagnetic field on perturbed Minkowski space\nare derived and solved analytically. The inverse Gertsenshtein conversion of\ngravitational waves in a static electromagnetic field is rederived, and the\nresultant electromagnetic radiation is shown to be significant for highly\nmagnetised pulsars in compact binary systems. We also obtain a variety of\nnonlinear interference effects for interacting gravitational and\nelectromagnetic waves, although wave-wave resonances previously described in\nthe literature are absent when the electric-magnetic self-interaction is taken\ninto account. The fluctuation and amplification of electromagnetic energy flux\nas the gravitational wave strength increases towards the\ngravitational-electromagnetic frequency ratio is a possible signature of\ngravitational radiation from extended astrophysical sources.",
    "authors": [
      "Alvin J. K. Chua",
      "Priscilla Cañizares",
      "Jonathan R. Gair"
    ],
    "publication_date": "2014-06-14T16:07:08Z",
    "arxiv_id": "http://arxiv.org/abs/1406.3750v2",
    "download_url": "http://arxiv.org/abs/1406.3750v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic structure of light nuclei",
    "abstract": "The present understanding of nuclear electromagnetic properties including\nelectromagnetic moments, form factors and transitions in nuclei with A $\\le$ 10\nis reviewed. Emphasis is on calculations based on nuclear Hamiltonians that\ninclude two- and three-nucleon realistic potentials, along with one- and\ntwo-body electromagnetic currents derived from a chiral effective field theory\nwith pions and nucleons.",
    "authors": [
      "Saori Pastore"
    ],
    "publication_date": "2015-08-28T21:44:32Z",
    "arxiv_id": "http://arxiv.org/abs/1508.07363v1",
    "download_url": "http://arxiv.org/abs/1508.07363v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gravitation radiation observations",
    "abstract": "The notion of gravitational radiation begins with electromagnetic radiation.\nIn 1887 Heinrich Hertz, working in one room, generated and received\nelectromagnetic radiation. Maxwell's equations describe the electromagnetic\nfield. The quanta of electromagnetic radiation are spin 1 photons. They are\nfundamental to atomic physics and quantum electrodynamics.",
    "authors": [
      "E. N. Glass"
    ],
    "publication_date": "2017-01-16T19:02:01Z",
    "arxiv_id": "http://arxiv.org/abs/1701.08072v1",
    "download_url": "http://arxiv.org/abs/1701.08072v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prediction of neutron electromagnetic form factors behaviors just by the\n  proton electromagnetic form factors data",
    "abstract": "It is demonstrated how the neutron electromagnetic form factors behaviors in\nthe whole region of their definition can be predicted theoretically just by\nusing the proton form factors data to be described by the advanced proton\nelectromagnetic structure Unitary and Analytic model.",
    "authors": [
      "Anna Z. Dubničková",
      "Stanislav Dubnička"
    ],
    "publication_date": "2020-11-20T08:26:30Z",
    "arxiv_id": "http://arxiv.org/abs/2011.10271v1",
    "download_url": "http://arxiv.org/abs/2011.10271v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuous evolution of electromagnetic field in heavy-ion collisions",
    "abstract": "In heavy-ion collisions the electromagnetic field exists before the hot\nnuclear matter emergence. Requiring the field continuity we compute it in the\ncentral rapidity region by taking into account the electromagnetic response of\nthe Quark Gluon Plasma. We show that the electromagnetic field is nearly\ntime-independent from about 1~fm/c after the collision until the freezeout.",
    "authors": [
      "Evan Stewart",
      "Kirill Tuchin"
    ],
    "publication_date": "2021-06-16T20:54:18Z",
    "arxiv_id": "http://arxiv.org/abs/2106.09124v1",
    "download_url": "http://arxiv.org/abs/2106.09124v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Note on electromagnetic memories",
    "abstract": "In this note, we provide a tractable example of a polyhomogeneous solution\nspace for electromagnetism at null infinity in four dimensions. The memory\neffect for electromagnetism is then derived from the polyhomogeneous solution\nspace. We also comment on the connection between the electromagnetic memories\nand asymptotic symmetries.",
    "authors": [
      "Pujian Mao"
    ],
    "publication_date": "2021-05-13T06:07:09Z",
    "arxiv_id": "http://arxiv.org/abs/2105.06095v2",
    "download_url": "http://arxiv.org/abs/2105.06095v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Phenomenological model for the electromagnetic response of a black hole\n  binary immersed in magnetic field",
    "abstract": "Electromagnetic counterparts of gravitational wave events usually involve\nneutron stars during compact binary coalescences. On the other hand, the\ncommunity generally believes that electromagnetic emissions are hardly\ngenerated during the mergers of binary black holes. Nevertheless, some authors\nhave considered the possibility of an EM counterpart signal after the GW150914,\nopening the opportunity to investigate the electromagnetic emission of\nstellar-mass black holes (BHs) mergers. In the case of black holes in a strong\nmagnetic field or with electric charges, electromagnetic emissions would appear\naccompanied by gravitational waves. In this work, based on the membrane\nparadigm, we consider a phenomenological model to study the electromagnetic\nradiation generated by binary black holes surrounded by a uniform magnetic\nfield. We obtain the electromagnetic waveform detected by a far-distance\nobserver for varied black hole spins. By analytical Fourier transformation, we\nget the chirp property of the electromagnetic waves; we found that the\npower-law is 5/6, which has the opposite sign compared to gravitational waves.\nThe frequency of such electromagnetic waves is the same as gravitational waves.",
    "authors": [
      "Carlos A. Benavides-Gallego",
      "Wen-Biao Han"
    ],
    "publication_date": "2021-11-08T08:27:56Z",
    "arxiv_id": "http://arxiv.org/abs/2111.04323v1",
    "download_url": "http://arxiv.org/abs/2111.04323v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Electromagnetic Turbulence",
    "abstract": "Combining a generalized current in the set of Maxwell's equations offers a\nuseful framework to address the complex phenomena of electromagnetic\nturbulence. The fluidic-electromagnetic analogy implies that diffraction is the\nanalog phenomenon of EM turbulence and indicates norms to design suitable\nplasmon circuity to control electromagnetic turbulence in stealth technology\nand propulsion machines.",
    "authors": [
      "Mario J. Pinheiro"
    ],
    "publication_date": "2022-02-11T00:22:24Z",
    "arxiv_id": "http://arxiv.org/abs/2202.05840v1",
    "download_url": "http://arxiv.org/abs/2202.05840v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Presentation of the electromagnetic field in introductory physics\n  textbooks and consequences for its teaching",
    "abstract": "Textbooks play a fundamental role in teaching and learning in school science\nclassrooms. In this paper we investigate the presentation of the nature of the\nelectromagnetic field in a dozen of the world's most popular introductory\nuniversity physics textbooks. We analyse, from an epistemologically based\nteaching approach, the didactic treatment of the electromagnetic field in\nrelation to its sources, Maxwell's laws and electromagnetic waves. With this\nobjective, we elaborate a rational reconstruction of the developments that led\nto the formulation of the nature of the electromagnetic field, Maxwell's laws\nand their meaning, as well as electromagnetic waves. Next, we formulate\ncriteria based on the key aspects derived from the reconstruction that are\nuseful in the evaluation of electromagnetism textbooks at the introductory\nlevel and apply them to the sample of selected books. In light of the results,\nwe reflect on their consequences for teaching. Our analysis indicates the\nexistence of certain inconsistencies in the approach to the electromagnetic\nfield and its relationship with its sources, Maxwell's laws and electromagnetic\nwaves in many of the books analysed.",
    "authors": [
      "Álvaro Suárez",
      "Arturo C. Marti",
      "Kristina Zuza",
      "Jenaro Guisasola"
    ],
    "publication_date": "2023-05-09T13:19:25Z",
    "arxiv_id": "http://arxiv.org/abs/2305.05431v1",
    "download_url": "http://arxiv.org/abs/2305.05431v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Electromagnetic Mass Dilemma",
    "abstract": "We show that a charged sphere moving at a constant velocity $v$ exhibits a\nmass due to electromagnetic radiation, expressed as $4/(3+(v/c)^2) (E/c^2)$,\nwhere $E$ is the electromagnetic energy and $c$ the speed of light in vacuum.\nOur finding reconciles the longstanding mismatch between the electromagnetic\nmass calculated from the classical electrodynamics' $4/3 (E/c^2)$ and the\nrelativistic theory.",
    "authors": [
      "Qasem Exirifard",
      "Alessio D'Errico",
      "Ebrahim Karimi"
    ],
    "publication_date": "2024-04-29T23:17:21Z",
    "arxiv_id": "http://arxiv.org/abs/2405.00071v1",
    "download_url": "http://arxiv.org/abs/2405.00071v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonlinear electromagnetic generalization of the Kerr-Newman solution\n  with cosmological constant",
    "abstract": "We present the two exact solutions of the Einstein-Nonlinear electrodynamics\nequations that generalize the Kerr-Newman solution. We determined the\ngeneralized electromagnetic potentials using the alignment between the tetrad\nvectors of the metric and the eigenvectors of the electromagnetic field tensor.\nIt turns out that there are only two possible nonlinear electromagnetic\ngeneralizations of the Kerr-Newman geometry, corresponding to different\nelectromagnetic potentials. The new solutions possess horizons and satisfy\nphysical energy conditions such that they can represent black holes with\nnonlinear electromagnetic charges, characterized by the parameters of mass,\nangular momentum, charge, and one nonlinear parameter; the nonlinear parameter\nresembles the effect of a cosmological constant, negative or positive, such\nthat the solutions are asymptotically AdS or dS. The canonical form of the\nelectromagnetic nonlinear energy-momentum tensor is analyzed in relation with\nthe energy conditions; it is shown that the conformal symmetry is broken by the\nelectromagnetic nonlinear matter; the corresponding nonlinear electromagnetic\nLagrangian as a function of the coordinates is presented as well.",
    "authors": [
      "Oscar Galindo-Uriarte",
      "Nora Breton"
    ],
    "publication_date": "2024-06-24T19:03:34Z",
    "arxiv_id": "http://arxiv.org/abs/2406.17077v1",
    "download_url": "http://arxiv.org/abs/2406.17077v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dispersion of electromagnetic waves in a coaxial line filled with\n  ferrite",
    "abstract": "By solving Maxwell's equations the exact dispersion equation for\nelectromagnetic waves propagating in a layered coaxial ferrite line is\nobtained. In particular the analytical consideration is carried out for a\nsimpler case of complete filling of the coaxial line with ferrite (i.e.\nhomogeneous ferrite line). The behavior of dispersion curves of TEM -\nelectromagnetic waves, as well as E - and H - waveguide electromagnetic waves,\nis investigated.",
    "authors": [
      "V. A. Balakirev",
      "I. N. Onishchenko"
    ],
    "publication_date": "2025-05-28T10:00:31Z",
    "arxiv_id": "http://arxiv.org/abs/2505.22188v1",
    "download_url": "http://arxiv.org/abs/2505.22188v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electromagnetic Force on a Brane",
    "abstract": "A fundamental assumption in the theory of brane world is that all matter and\nradiation are confined on the four-dimensional brane and only gravitons can\npropagate in the five-dimensional bulk spacetime. The brane world theory did\nnot provide an explanation for the existence of electromagnetic fields and the\norigin of the electromagnetic field equation. In this paper, we propose a model\nfor explaining the existence of electromagnetic fields on a brane and deriving\nthe electromagnetic field equation. Similar to the case in Kaluza-Klein theory,\nwe find that electromagnetic fields and the electromagnetic field equation can\nbe derived from the five-dimensional Einstein field equation. However, the\nderived electromagnetic field equation differs from the Maxwell equation by\ncontaining a term with the electromagnetic potential vector coupled to the\nspacetime curvature tensor. So it can be considered as generalization of the\nMaxwell equation in a curved spacetime. The gravitational field equation on the\nbrane is also derived with the stress-energy tensor for electromagnetic fields\nexplicitly included and the Weyl tensor term explicitly expressed with matter\nfields and their derivatives in the direction of the extra-dimension. The model\nproposed in the paper can be regarded as unification of electromagnetic and\ngravitational interactions in the framework of brane world theory.",
    "authors": [
      "Li-Xin Li"
    ],
    "publication_date": "2016-09-29T02:11:35Z",
    "arxiv_id": "http://arxiv.org/abs/1609.09177v1",
    "download_url": "http://arxiv.org/abs/1609.09177v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gamma Ray Bursts as Electromagnetic Outflows",
    "abstract": "(Abridged) We interpret gamma ray bursts as relativistic, electromagnetic\nexplosions. Specifically, we propose that they are created when a rotating,\nrelativistic, stellar-mass progenitor loses much of its rotational energy in\nthe form of a Poynting flux during an active period lasting $\\sim 100$ s.\nInitially, a non-spherically symmetric, electromagnetically-dominated bubble\nexpands non-relativistically inside the star, most rapidly along the rotational\naxis of the progenitor. After the bubble breaks out from the stellar surface\nand most of the electron-positron pairs annihilate, the bubble expansion\nbecomes highly relativistic. After the end of the source activity most of the\nelectromagnetic energy is concentrated in a thin shell inside the contact\ndiscontinuity between the ejecta and the shocked circumstellar material. This\nelectromagnetic shell pushes a relativistic blast wave into the circumstellar\nmedium. Current-driven instabilities develop in this shell at a radius\n$\\sim3\\times10^{16}$ cm and lead to dissipation of magnetic field and\nacceleration of pairs which are responsible for the $\\gamma$-ray burst. At\nlarger radii, the energy contained in the electromagnetic shell is mostly\ntransferred to the preceding blast wave. Particles accelerated at the forward\nshock may combine with electromagnetic field from the electromagnetic shell to\nproduce the afterglow emission.",
    "authors": [
      "Maxim Lyutikov",
      "Roger Blandford"
    ],
    "publication_date": "2003-12-12T21:06:37Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0312347v1",
    "download_url": "http://arxiv.org/abs/astro-ph/0312347v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]