[
  {
    "title": "Student understanding of quantum mechanics at the beginning of graduate instruction",
    "abstract": "A survey was developed to probe student understanding of quantum mechanics at the beginning of graduate instruction. The survey was administered to 202 physics graduate students enrolled in first-year quantum mechanics courses from seven universities at the beginning of the first semester. We also conducted one-on-one interviews with fifteen graduate or advanced undergraduate students who had just completed a course in which all the content on the survey was covered. Although students from some universities performed better on average than others, we found that students share universal difficulties understanding the concepts of quantum mechanics. The difficulties were often due to over-generalizations of concepts learned in one context to other contexts where they are not directly applicable. Difficulties in distinguishing between closely related concepts and making sense of the formalism of quantum mechanics were common. The results of this study can sensitize instructors of first-year graduate quantum physics to some of the difficulties students are likely to face.",
    "authors": [
      "Chandralekha Singh"
    ],
    "publication_date": "2016-02-22T06:45:56Z",
    "arxiv_id": "http://arxiv.org/abs/1602.06660v1",
    "download_url": "https://arxiv.org/abs/1602.06660v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Relativity Principle at the Foundation of Quantum Mechanics",
    "abstract": "Quantum information theorists have created axiomatic reconstructions of quantum mechanics (QM) that are very successful at identifying precisely what distinguishes quantum probability theory from classical and more general probability theories in terms of information-theoretic principles. Herein, we show how one such principle, Information Invariance & Continuity, at the foundation of those axiomatic reconstructions maps to \"no preferred reference frame\" (NPRF, aka \"the relativity principle\") as it pertains to the invariant measurement of Planck's constant h for Stern-Gerlach (SG) spin measurements. This is in exact analogy to the relativity principle as it pertains to the invariant measurement of the speed of light c at the foundation of special relativity (SR). Essentially, quantum information theorists have extended Einstein's use of NPRF from the boost invariance of measurements of c to include the SO(3) invariance of measurements of h between different reference frames of mutually complementary spin measurements via the principle of Information Invariance & Continuity. Consequently, the \"mystery\" of the Bell states that is responsible for the Tsirelson bound and the exclusion of the no-signalling, \"superquantum\" Popescu-Rohrlich joint probabilities is understood to result from conservation per Information Invariance & Continuity between different reference frames of mutually complementary qubit measurements, and this maps to conservation per NPRF in spacetime. If one falsely conflates the relativity principle with the classical theory of SR, then it may seem impossible that the relativity principle resides at the foundation of non-relativisitic QM. In fact, there is nothing inherently classical or quantum about NPRF. Thus, the axiomatic reconstructions of QM have succeeded in producing a principle account of QM that reveals as much about Nature as the postulates of SR.",
    "authors": [
      "W. M. Stuckey",
      "Timothy McDevitt",
      "Michael Silberstein"
    ],
    "publication_date": "2021-07-14T19:11:28Z",
    "arxiv_id": "http://arxiv.org/abs/2107.06942v3",
    "download_url": "https://arxiv.org/abs/2107.06942v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum gravity and the square of Bell operators",
    "abstract": "The Bell's inequality is a strong criterion to distinguish classical and quantum mechanical aspects of reality. Its violation is the net effect of the existence of non-locality in systems, an advantage for quantum mechanics (QM) over classical physics. The quantum mechanical world is under the control of the Heisenberg uncertainty principle (HUP) that is generalized by quantum gravity (QG) scenarios, called generalized uncertainty principle (GUP). Here, the effects of GUP on the square of Bell operators of qubits and qutrits are studied. The achievements claim that the violation quality of the square of Bell inequalities may be a tool to get a better understanding of the quantum features of gravity. In this regard, it is obtained that the current accuracy of the Stern-Gerlach experiments implies upper bounds on the values of the GUP parameters.",
    "authors": [
      "S. Aghababaei",
      "H. Moradpour",
      "H. Shabani"
    ],
    "publication_date": "2021-06-28T05:20:29Z",
    "arxiv_id": "http://arxiv.org/abs/2106.14400v2",
    "download_url": "https://arxiv.org/abs/2106.14400v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-Abelian Quantum Transport and Thermosqueezing Effects",
    "abstract": "Modern quantum experiments provide examples of transport with non-commuting quantities, offering a tool to understand the interplay between thermal and quantum effects. Here we set forth a theory for non-Abelian transport in the linear response regime. Our key insight is to use generalized Gibbs ensembles with non-commuting charges as the basic building blocks and strict charge-preserving unitaries in a collisional setup. The linear response framework is then built using a collisional model between two reservoirs. We show that the transport coefficients obey Onsager reciprocity. Moreover, we find that quantum coherence, associated to the non-commutativity, acts so as to reduce the net entropy production, when compared to the case of commuting transport. This therefore provides a clear connection between quantum coherent transport and dissipation. As an example, we study heat and squeezing fluxes in bosonic systems, characterizing a set of thermosqueezing coefficients with potential applications in metrology and heat-to-work conversion in the quantum regime.",
    "authors": [
      "Gonzalo Manzano",
      "Juan M. R. Parrondo",
      "Gabriel T. Landi"
    ],
    "publication_date": "2020-11-09T16:58:22Z",
    "arxiv_id": "http://arxiv.org/abs/2011.04560v2",
    "download_url": "https://arxiv.org/abs/2011.04560v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Using and reusing coherence to realize quantum processes",
    "abstract": "Coherent superposition is a key feature of quantum mechanics that underlies the advantage of quantum technologies over their classical counterparts. Recently, coherence has been recast as a resource theory in an attempt to identify and quantify it in an operationally well-defined manner. Here we study how the coherence present in a state can be used to implement a quantum channel via incoherent operations and, in turn, to assess its degree of coherence. We introduce the robustness of coherence of a quantum channel---which reduces to the homonymous measure for states when computed on constant-output channels---and prove that: i) it quantifies the minimal rank of a maximally coherent state required to implement the channel; ii) its logarithm quantifies the amortized cost of implementing the channel provided some coherence is recovered at the output; iii) its logarithm also quantifies the zero-error asymptotic cost of implementation of many independent copies of a channel. We also consider the generalized problem of imperfect implementation with arbitrary resource states. Using the robustness of coherence, we find that in general a quantum channel can be implemented without employing a maximally coherent resource state. In fact, we prove that \\textit{every} pure coherent state in dimension larger than $2$, however weakly so, turns out to be a valuable resource to implement \\textit{some} coherent unitary channel. We illustrate our findings for the case of single-qubit unitary channels.",
    "authors": [
      "María García Díaz",
      "Kun Fang",
      "Xin Wang",
      "Matteo Rosati",
      "Michalis Skotiniotis",
      "John Calsamiglia",
      "Andreas Winter"
    ],
    "publication_date": "2018-05-10T16:20:22Z",
    "arxiv_id": "http://arxiv.org/abs/1805.04045v3",
    "download_url": "https://arxiv.org/abs/1805.04045v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolution in bouncing quantum cosmology",
    "abstract": "We present the method of describing an evolution in quantum cosmology in the framework of the reduced phase space quantization of loop cosmology. We apply our method to the flat Friedman-Robertson-Walker model coupled to a massless scalar field. We identify the physical quantum Hamiltonian that is positive-definite and generates globally an unitary evolution of considered quantum system. We examine properties of expectation values of physical observables in the process of the quantum big bounce transition. The dispersion of evolved observables are studied for the Gaussian state. Calculated relative fluctuations enable an examination of the semi-classicality conditions and possible occurrence of the cosmic forgetfulness. Preliminary estimations based on the cosmological data suggest that there was no cosmic amnesia. Presented results are analytical, and numerical computations are only used for the visualization purposes. Our method may be generalized to sophisticated cosmological models including the Bianchi type universes.",
    "authors": [
      "Jakub Mielczarek",
      "Wlodzimierz Piechocki"
    ],
    "publication_date": "2011-07-23T12:31:52Z",
    "arxiv_id": "http://arxiv.org/abs/1107.4686v2",
    "download_url": "https://arxiv.org/abs/1107.4686v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum information processing using nuclear and electron magnetic resonance: review and prospects",
    "abstract": "This paper describes recent progress using nuclear magnetic resonance (NMR) as a platform for implementing quantum information processing (QIP) tasks. The basic ideas of NMR QIP are detailed, examining the successes and limitations of liquid and solid state experiments. Finally, a future direction for implementing quantum processors is suggested,utilizing both nuclear and electron spin degrees of freedom.",
    "authors": [
      "J. Baugh",
      "J. Chamilliard",
      "C. M. Chandrashekar",
      "M. Ditty",
      "A. Hubbard",
      "R. Laflamme",
      "M. Laforest",
      "D. Maslov",
      "O. Moussa",
      "C. Negrevergne",
      "M. Silva",
      "S. Simmons",
      "C. A. Ryan",
      "D. G. Cory",
      "J. S. Hodges",
      "C. Ramanathan"
    ],
    "publication_date": "2007-10-07T22:47:34Z",
    "arxiv_id": "http://arxiv.org/abs/0710.1447v1",
    "download_url": "https://arxiv.org/abs/0710.1447v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum generative classification with mixed states",
    "abstract": "Classification can be performed using either a discriminative or a generative learning approach. Discriminative learning consists of constructing the conditional probability of the outputs given the inputs, while generative learning consists of constructing the joint probability density of the inputs and outputs. Although most classical and quantum methods are discriminative, there are some advantages of the generative learning approach. For instance, it can be applied to unsupervised learning, statistical inference, uncertainty estimation, and synthetic data generation. In this article, we present a quantum generative multiclass classification strategy, called quantum generative classification (QGC). This model uses a variational quantum algorithm to estimate the joint probability density function of features and labels of a data set by means of a mixed quantum state. We also introduce a quantum map called quantum-enhanced Fourier features (QEFF), which leverages quantum superposition to prepare high-dimensional data samples in quantum hardware using a small number of qubits. We show that the quantum generative classification algorithm can be viewed as a Gaussian mixture that reproduces a kernel Hilbert space of the training data. In addition, we developed a hybrid quantum-classical neural network that shows that it is possible to perform generative classification on high-dimensional data sets. The method was tested on various low- and high-dimensional data sets including the 10-class MNIST and Fashion-MNIST data sets, illustrating that the generative classification strategy is competitive against other previous quantum models.",
    "authors": [
      "Diego H. Useche",
      "Sergio Quiroga-Sandoval",
      "Sebastian L. Molina",
      "Vladimir Vargas-Calderón",
      "Juan E. Ardila-García",
      "Fabio A. González"
    ],
    "publication_date": "2025-02-27T10:56:47Z",
    "arxiv_id": "http://arxiv.org/abs/2502.19970v2",
    "download_url": "https://arxiv.org/abs/2502.19970v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structure optimization for parameterized quantum circuits",
    "abstract": "We propose an efficient method for simultaneously optimizing both the structure and parameter values of quantum circuits with only a small computational overhead. Shallow circuits that use structure optimization perform significantly better than circuits that use parameter updates alone, making this method particularly suitable for noisy intermediate-scale quantum computers. We demonstrate the method for optimizing a variational quantum eigensolver for finding the ground states of Lithium Hydride and the Heisenberg model in simulation, and for finding the ground state of Hydrogen gas on the IBM Melbourne quantum computer.",
    "authors": [
      "Mateusz Ostaszewski",
      "Edward Grant",
      "Marcello Benedetti"
    ],
    "publication_date": "2019-05-23T14:55:40Z",
    "arxiv_id": "http://arxiv.org/abs/1905.09692v3",
    "download_url": "https://arxiv.org/abs/1905.09692v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum-optimal information encoding using noisy passive linear optics",
    "abstract": "The amount of information that a noisy channel can transmit has been one of the primary subjects of interest in information theory. In this work we consider a practically-motivated family of optical quantum channels that can be implemented without an external energy source. We optimize the Holevo information over procedures that encode information in attenuations and phase-shifts applied by these channels on a resource state of finite energy. It is shown that for any given input state and environment temperature, the maximum Holevo information can be achieved by an encoding procedure that uniformly distributes the channel's phase-shift parameter. Moreover for large families of input states, any maximizing encoding scheme has a finite number of channel attenuation values, simplifying the codewords to a finite number of rings around the origin in the output phase space. The above results and numerical evidence suggests that this property holds for all resource states. Our results are directly applicable to the quantum reading of an optical memory in the presence of environmental thermal noise.",
    "authors": [
      "Andrew Tanggara",
      "Ranjith Nair",
      "Syed Assad",
      "Varun Narasimhachar",
      "Spyros Tserkis",
      "Jayne Thompson",
      "Ping Koy Lam",
      "Mile Gu"
    ],
    "publication_date": "2023-04-24T18:01:46Z",
    "arxiv_id": "http://arxiv.org/abs/2304.12365v3",
    "download_url": "https://arxiv.org/abs/2304.12365v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fault-tolerant Quantum Error Correction Using a Linear Array of Emitters",
    "abstract": "We propose a fault-tolerant quantum error correction architecture consisting of a linear array of emitters and delay lines. In our scheme, a resource state for fault-tolerant quantum computation is generated by letting the emitters interact with a stream of photons and their neighboring emitters. Depending on the number of emitters $n_e$, we study the effect of delay line errors in two regimes: when $n_e$ is a small constant of order unity and when $n_e$ scales with the code distance. Between these two regimes, the logical error rate steadily decreases as $n_e$ increases, from a scaling of $\\exp(-cη^{-1/2})$ to $\\exp(-c'η^{-1})$, where $η$ is the error rate per unit length in the delay line, for some constants $c,c'>0$. We also carry out a detailed study of the break-even point and the fault-tolerance overhead. These studies suggest that the multi-emitter architecture, using the state-of-the-art delay lines, can be used to demonstrate error suppression, assuming other sources of errors are sufficiently small.",
    "authors": [
      "Jintae Kim",
      "Jung Hoon Han",
      "Isaac H. Kim"
    ],
    "publication_date": "2024-03-03T02:40:29Z",
    "arxiv_id": "http://arxiv.org/abs/2403.01376v2",
    "download_url": "https://arxiv.org/abs/2403.01376v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Proposal for a simple quantum error correction test gate in linear optics",
    "abstract": "We describe a linear quantum optical circuit capable of demonstrating a simple quantum error correction code in a four photon experiment.",
    "authors": [
      "T. C. Ralph"
    ],
    "publication_date": "2003-06-27T21:24:50Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0306190v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0306190v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weakly invasive metrology: quantum advantage and physical implementations",
    "abstract": "We consider the estimation of a Hamiltonian parameter of a set of highly photosensitive samples, which are damaged after a few photons $N_{\\rm abs}$ are absorbed, for a total time $T$. The samples are modelled as a two mode photonic system, where photons simultaneously acquire information on the unknown parameter and are absorbed at a fixed rate. We show that arbitrarily intense coherent states can obtain information at a rate that scales at most linearly with $N_{\\rm abs}$ and $T$, whereas quantum states with finite intensity can overcome this bound. We characterise the quantum advantage as a function of $N_{\\rm abs}$ and $T$, as well as its robustness to imperfections (non-ideal detectors, finite preparation and measurement rates for quantum photonic states). We discuss an implementation in cavity QED, where Fock states are both prepared and measured by coupling atomic ensembles to the cavities. We show that superradiance, arising due to a collective coupling between the cavities and the atoms, can be exploited for improving the speed and efficiency of the measurement.",
    "authors": [
      "M. Perarnau-Llobet",
      "D. Malz",
      "J. I. Cirac"
    ],
    "publication_date": "2020-06-22T10:14:36Z",
    "arxiv_id": "http://arxiv.org/abs/2006.12114v4",
    "download_url": "https://arxiv.org/abs/2006.12114v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Thermodynamics at the Quantum-Classical Boundary: A Self-Consistent Framework Based on Adiabatic-Response Theory",
    "abstract": "Microscopic thermal machines promise to play an important role in future quantum technologies. Making such devices widely applicable will require effective strategies to channel their output into easily accessible storage systems like classical degrees of freedom. Here, we develop a self-consistent theoretical framework that makes it possible to model such quantum-classical hybrid devices in a thermodynamically consistent manner. Our approach is based on the assumption that the quantum part of the device is subject to strong decoherence and dissipation induced by a thermal reservoir. Due to the ensuing separation of time scales between slowly evolving classical and fast relaxing quantum degrees of freedom, the dynamics of the hybrid system can be described by means of adiabatic-response theory. We show that, upon including fluctuations in a minimally consistent way, the resulting equations of motion can be equipped with a first and second law, both on the ensemble level and on the level of individual trajectories of the classical part of the system, where thermodynamic quantities like heat and work become stochastic variables. As an application of our theory, we work out a physically transparent model of a quantum-classical hybrid engine, whose working system consists of a chain of Rydberg atoms, which is confined in an optical cavity and driven by periodic temperature variations. We demonstrate through numerical simulations that the engine can sustain periodic oscillations of a movable mirror, which acts as a classical load, against external friction and extract the full distributions of input heat and output work. By making the statistics of thermodynamic processes in quantum-classical hybrid systems accessible without the need to further specify a measurement protocol, our work contributes to bridging the long-standing gap between classical and quantum stochastic thermodynamics.",
    "authors": [
      "Joshua Eglinton",
      "Federico Carollo",
      "Igor Lesanovsky",
      "Kay Brandner"
    ],
    "publication_date": "2024-04-15T20:13:42Z",
    "arxiv_id": "http://arxiv.org/abs/2404.10118v2",
    "download_url": "https://arxiv.org/abs/2404.10118v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Einstein was right: Proof of absence of spooky state reduction in quantum mechanics",
    "abstract": "The present standard interpretation of quantum mechanics invokes nonlocality and state reduction at space-like separated points during measurements on entangled systems. While there is no understanding of the physical mechanism of such nonlocal state reduction, the experimental verifications of quantum correlations different from that predicted by local realistic theories have polarized the physicists' opinion in favour of nonlocality. I show conclusively that there is no such spooky state reduction, vindicating the strong views against nonlocality held by Einstein and Popper. Experimental support to this proof is also discussed. The Bell's inequalities arise due to ignoring the phase information in the correlation function and not due to nonlocality. This result goes against the current belief of quantum nonlocality held by the majority of physicists; yet the proof is transparent and rigorous, and therefore demands a change in the interpretation of quantum mechanics and quantum measurements. The hypothesis of wave function collapse is inconsistent with experimental observations on entangled correlated systems.",
    "authors": [
      "C. S. Unnikrishnan"
    ],
    "publication_date": "2002-06-25T05:37:42Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0206175v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0206175v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Possibilistic and maximal indefinite causal order in the quantum switch",
    "abstract": "It was recently found that the indefinite causal order in the quantum switch can be certified device-independently when assuming the impossibility of superluminal influences. Here we strengthen this result in two ways. First, we give a proof of this fact which is possibilistic rather than probabilistic, i.e. which does not rely on the validity of probability theory at the hidden variable level. Then, returning to the probabilistic setting, we show that the indefinite causal order in the quantum switch is also maximal, in the sense that the observed correlations are incompatible even with the existence of a causal order on only a small fraction of the runs of the experiment. While the original result makes use of quantum theory's violation of a Clauser-Horne-Shimony-Holt inequality, the proofs presented here are based on Greenberger, Horne, and Zeilinger's and Mermin's proofs of nonlocality, respectively.",
    "authors": [
      "Tein van der Lugt",
      "Nick Ormrod"
    ],
    "publication_date": "2023-11-01T14:55:03Z",
    "arxiv_id": "http://arxiv.org/abs/2311.00557v2",
    "download_url": "https://arxiv.org/abs/2311.00557v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Accessible coherence in open quantum system dynamics",
    "abstract": "Quantum coherence generated in a physical process can only be cast as a potentially useful resource if its effects can be detected at a later time. Recently, the notion of non-coherence-generating-and-detecting (NCGD) dynamics has been introduced and related to the classicality of the statistics associated with sequential measurements at different times. However, in order for a dynamics to be NCGD, its propagators need to satisfy a given set of conditions for all triples of consecutive times. We reduce this to a finite set of $d(d-1)$ conditions, where $d$ is the dimension of the quantum system, provided that the generator is time-independent. Further conditions are derived for the more general time-dependent case. The application of this result to the case of a qubit dynamics allows us to elucidate which kind of noise gives rise to non-coherence-generation-and-detection.",
    "authors": [
      "María García Díaz",
      "Benjamin Desef",
      "Matteo Rosati",
      "Dario Egloff",
      "John Calsamiglia",
      "Andrea Smirne",
      "Michaelis Skotiniotis",
      "Susana F. Huelga"
    ],
    "publication_date": "2019-10-11T11:34:40Z",
    "arxiv_id": "http://arxiv.org/abs/1910.05089v2",
    "download_url": "https://arxiv.org/abs/1910.05089v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Room-temperature hybrid 2D-3D quantum spin system for enhanced magnetic sensing and many-body dynamics",
    "abstract": "Advances in hybrid quantum systems and their precise control are pivotal for developing advanced quantum technologies. Two-dimensional (2D) materials with optically accessible spin defects have emerged as a promising platform for building integrated quantum spin systems due to their exceptional flexibility and scalability. However, experimentally realizing such systems and demonstrating their superiority remains challenging. Here, we present a hybrid spin system operating under ambient conditions, integrating boron vacancy (V_B^-) spins in 2D hexagonal boron nitride flakes with a single nitrogen vacancy (NV) center in 3D single-crystal diamonds. This combined system achieves full controllability and exhibits enhanced performance for nanoscale magnetic sensing, including an improved dynamic range. Moreover, we investigate the rich many-body spin dynamics within the hybrid system, which enables us to estimate the concentration of V_B^- spins. This work provides a critical foundation for advancing the development of 2D-3D integrated quantum spin systems.",
    "authors": [
      "Haoyu Sun",
      "Pei Yu",
      "Xu Zhou",
      "Xiangyu Ye",
      "Mengqi Wang",
      "Zhaoxin Liu",
      "Yuhang Guo",
      "Wenzhao Liu",
      "You Huang",
      "Pengfei Wang",
      "Fazhan Shi",
      "Kangwei Xia",
      "Ya Wang"
    ],
    "publication_date": "2025-04-15T02:30:07Z",
    "arxiv_id": "http://arxiv.org/abs/2504.10815v2",
    "download_url": "https://arxiv.org/abs/2504.10815v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Photon engineering for quantum information processing",
    "abstract": "We study distinguishing information in the context of quantum interference involving more than one parametric downconversion (PDC) source and in the context of polarization-entangled photon pairs based on PDC. We arrive at specific design criteria for two-photon sources so that when used as part of complex optical systems, such as photon-based quantum information processing schemes, distinguishing information between the photons is eliminated guaranteeing high visibility interference. We propose practical techniques which lead to suitably engineered two-photon states that can be realistically implemented with available technology. Finally, we study an implementation of the nonlinear-sign shift (NS) logic gate with PDC sources and show the effect of distinguishing information on the performance of the gate.",
    "authors": [
      "A. B. U'Ren",
      "K. Banaszek",
      "I. A. Walmsley"
    ],
    "publication_date": "2003-05-30T17:18:53Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0305192v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0305192v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Trapping Sets of Quantum LDPC Codes",
    "abstract": "Iterative decoders for finite length quantum low-density parity-check (QLDPC) codes are attractive because their hardware complexity scales only linearly with the number of physical qubits. However, they are impacted by short cycles, detrimental graphical configurations known as trapping sets (TSs) present in a code graph as well as symmetric degeneracy of errors. These factors significantly degrade the decoder decoding probability performance and cause so-called error floor. In this paper, we establish a systematic methodology by which one can identify and classify quantum trapping sets (QTSs) according to their topological structure and decoder used. The conventional definition of a TS from classical error correction is generalized to address the syndrome decoding scenario for QLDPC codes. We show that the knowledge of QTSs can be used to design better QLDPC codes and decoders. Frame error rate improvements of two orders of magnitude in the error floor regime are demonstrated for some practical finite-length QLDPC codes without requiring any post-processing.",
    "authors": [
      "Nithin Raveendran",
      "Bane Vasić"
    ],
    "publication_date": "2020-12-30T19:35:17Z",
    "arxiv_id": "http://arxiv.org/abs/2012.15297v2",
    "download_url": "https://arxiv.org/abs/2012.15297v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Protecting entanglement from correlated amplitude damping channel using weak measurement and quantum measurement reversal",
    "abstract": "Based on the quantum technique of weak measurement, we propose a scheme to protect the entanglement from correlated amplitude damping decoherence. In contrast to the results of memoryless amplitude damping channel, we show that the memory effects play a significant role in the suppression of entanglement sudden death and protection of entanglement under severe decoherence. Moreover, we find that the initial entanglement could be drastically amplified by the combination of weak measurement and quantum measurement reversal even under the correlated amplitude damping channel. The underlying mechanism can be attributed to the probabilistic nature of weak measurements.",
    "authors": [
      "Xing Xiao",
      "Yao Yao",
      "Ying-Mao Xie",
      "Xing-Hua Wang",
      "Yan-Ling Li"
    ],
    "publication_date": "2016-02-05T12:21:03Z",
    "arxiv_id": "http://arxiv.org/abs/1602.01998v1",
    "download_url": "https://arxiv.org/abs/1602.01998v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fault tolerance for holonomic quantum computation",
    "abstract": "We review an approach to fault-tolerant holonomic quantum computation on stabilizer codes. We explain its workings as based on adiabatic dragging of the subsystem containing the logical information around suitable loops along which the information remains protected.",
    "authors": [
      "Ognyan Oreshkov",
      "Todd A. Brun",
      "Daniel A. Lidar"
    ],
    "publication_date": "2013-12-01T00:30:43Z",
    "arxiv_id": "http://arxiv.org/abs/1312.0165v1",
    "download_url": "https://arxiv.org/abs/1312.0165v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coins, Quantum Measurements, and Turing's Barrier",
    "abstract": "Is there any hope for quantum computing to challenge the Turing barrier, i.e. to solve an undecidable problem, to compute an uncomputable function? According to Feynman's '82 argument, the answer is {\\it negative}. This paper re-opens the case: we will discuss solutions to a few simple problems which suggest that {\\it quantum computing is {\\it theoretically} capable of computing uncomputable functions}. In this paper a mathematical quantum \"device\" (with sensitivity $ε$) is constructed to solve the Halting Problem. The \"device\" works on a randomly chosen test-vector for $T$ units of time. If the \"device\" produces a click, then the program halts. If it does not produce a click, then either the program does not halt or the test-vector has been chosen from an {\\it undistinguishable set of vectors} ${\\IF}_{ε, T}$. The last case is not dangerous as our main result proves: {\\it the Wiener measure of} ${\\IF}_{ε, T}$ {\\it constructively tends to zero when} $T$ {\\it tends to infinity}. The \"device\", working in time $T$, appropriately computed, will determine with a pre-established precision whether an arbitrary program halts or not. {\\it Building the \"halting machine\" is mathematically possible.}",
    "authors": [
      "Cristian S. Calude",
      "Boris Pavlov"
    ],
    "publication_date": "2001-12-15T22:27:53Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0112087v3",
    "download_url": "https://arxiv.org/abs/quant-ph/0112087v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum state preparation for multivariate functions",
    "abstract": "A fundamental step of any quantum algorithm is the preparation of qubit registers in a suitable initial state. Often qubit registers represent a discretization of continuous variables and the initial state is defined by a multivariate function. We develop protocols for preparing quantum states whose amplitudes encode multivariate functions by linearly combining block-encodings of Fourier and Chebyshev basis functions. Without relying on arithmetic circuits, quantum Fourier transforms, or multivariate quantum signal processing, our algorithms are simpler and more effective than previous proposals. We analyze requirements both asymptotically and pragmatically in terms of near/medium-term resources. Numerically, we prepare bivariate Student's t-distributions, 2D Ricker wavelets and electron wavefunctions in a 3D Coulomb potential, which are initial states with potential applications in finance, physics and chemistry simulations. Finally, we prepare bivariate Gaussian distributions on the Quantinuum H2-1 trapped-ion quantum processor using 24 qubits and up to 237 two-qubit gates.",
    "authors": [
      "Matthias Rosenkranz",
      "Eric Brunner",
      "Gabriel Marin-Sanchez",
      "Nathan Fitzpatrick",
      "Silas Dilkes",
      "Yao Tang",
      "Yuta Kikuchi",
      "Marcello Benedetti"
    ],
    "publication_date": "2024-05-31T17:49:27Z",
    "arxiv_id": "http://arxiv.org/abs/2405.21058v2",
    "download_url": "https://arxiv.org/abs/2405.21058v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Does Quantum Mechanics allow for Infinite Parallelism?",
    "abstract": "Recent works have independently suggested that Quantum Mechanics might permit for procedures that transcend the power of Turing Machines as well as of `standard' Quantum Computers. These approaches rely on and indicate that Quantum Mechanics seems to support some infinite variant of classical parallel computing. We compare this new one with other attempts towards hypercomputation by separating 1) its principal computing capabilities from 2) realizability issues. The first are shown to coincide with recursive enumerability; the second are considered in analogy to `existence' in mathematical logic.",
    "authors": [
      "Martin Ziegler"
    ],
    "publication_date": "2004-10-19T16:02:25Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0410141v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0410141v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimizing quantum codes with an application to the loss channel with partial erasure information",
    "abstract": "Quantum error correcting codes (QECCs) are the means of choice whenever quantum systems suffer errors, e.g., due to imperfect devices, environments, or faulty channels. By now, a plethora of families of codes is known, but there is no universal approach to finding new or optimal codes for a certain task and subject to specific experimental constraints. In particular, once found, a QECC is typically used in very diverse contexts, while its resilience against errors is captured in a single figure of merit, the distance of the code. This does not necessarily give rise to the most efficient protection possible given a certain known error or a particular application for which the code is employed. In this paper, we investigate the loss channel, which plays a key role in quantum communication, and in particular in quantum key distribution over long distances. We develop a numerical set of tools that allows to optimize an encoding specifically for recovering lost particles both deterministically and probabilistically, where some knowledge about what was lost is available, and demonstrate its capabilities. This allows us to arrive at new codes ideal for the distribution of entangled states in this particular setting, and also to investigate if encoding in qudits or allowing for non-deterministic correction proves advantageous compared to known QECCs. While we here focus on the case of losses, our methodology is applicable whenever the errors in a system can be characterized by a known linear map.",
    "authors": [
      "Benjamin Desef",
      "Martin B. Plenio"
    ],
    "publication_date": "2021-05-27T15:24:57Z",
    "arxiv_id": "http://arxiv.org/abs/2105.13233v3",
    "download_url": "https://arxiv.org/abs/2105.13233v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unifying and benchmarking state-of-the-art quantum error mitigation techniques",
    "abstract": "Error mitigation is an essential component of achieving a practical quantum advantage in the near term, and a number of different approaches have been proposed. In this work, we recognize that many state-of-the-art error mitigation methods share a common feature: they are data-driven, employing classical data obtained from runs of different quantum circuits. For example, Zero-noise extrapolation (ZNE) uses variable noise data and Clifford-data regression (CDR) uses data from near-Clifford circuits. We show that Virtual Distillation (VD) can be viewed in a similar manner by considering classical data produced from different numbers of state preparations. Observing this fact allows us to unify these three methods under a general data-driven error mitigation framework that we call UNIfied Technique for Error mitigation with Data (UNITED). In certain situations, we find that our UNITED method can outperform the individual methods (i.e., the whole is better than the individual parts). Specifically, we employ a realistic noise model obtained from a trapped ion quantum computer to benchmark UNITED, as well as other state-of-the-art methods, in mitigating observables produced from random quantum circuits and the Quantum Alternating Operator Ansatz (QAOA) applied to Max-Cut problems with various numbers of qubits, circuit depths and total numbers of shots. We find that the performance of different techniques depends strongly on shot budgets, with more powerful methods requiring more shots for optimal performance. For our largest considered shot budget ($10^{10}$), we find that UNITED gives the most accurate mitigation. Hence, our work represents a benchmarking of current error mitigation methods and provides a guide for the regimes when certain methods are most useful.",
    "authors": [
      "Daniel Bultrini",
      "Max Hunter Gordon",
      "Piotr Czarnik",
      "Andrew Arrasmith",
      "M. Cerezo",
      "Patrick J. Coles",
      "Lukasz Cincio"
    ],
    "publication_date": "2021-07-28T16:29:08Z",
    "arxiv_id": "http://arxiv.org/abs/2107.13470v2",
    "download_url": "https://arxiv.org/abs/2107.13470v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum walks on a circle with optomechanical systems",
    "abstract": "We propose an implementation of a quantum walk on a circle on an optomechanical system by encoding the walker on the phase space of a radiation field and the coin on a two-level state of a mechanical resonator. The dynamics of the system is obtained by applying Suzuki-Trotter decomposition. We numerically show that the system displays typical behaviors of quantum walks, namely, the probability distribution evolves ballistically and the standard deviation of the phase distribution is linearly proportional to the number of steps. We also analyze the effects of decoherence by using the phase damping channel on the coin space, showing the possibility to implement the quantum walk with present day technology.",
    "authors": [
      "Jalil Khatibi Moqadam",
      "Renato Portugal",
      "Marcos Cesar de Oliveira"
    ],
    "publication_date": "2014-03-20T17:15:07Z",
    "arxiv_id": "http://arxiv.org/abs/1403.5205v2",
    "download_url": "https://arxiv.org/abs/1403.5205v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spontaneous emission can locally create quantum discord out of classical correlations",
    "abstract": "We consider local time evolution given by spontaneous emission in the system of independent two-level atoms. It is shown that all classically correlated initial states are driven into the states with transient non-zero quantum discord. Thus local creation of genuine quantum correlations can be observed in a simple physical system of non-interacting atoms which are not completely isolated from the environment.",
    "authors": [
      "M. Gwozdz",
      "L. Jakobczyk"
    ],
    "publication_date": "2013-06-01T17:42:48Z",
    "arxiv_id": "http://arxiv.org/abs/1306.0130v2",
    "download_url": "https://arxiv.org/abs/1306.0130v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal adjointation of isometry operations using conversion of quantum supermaps",
    "abstract": "Identification of possible transformations of quantum objects including quantum states and quantum operations is indispensable in developing quantum algorithms. Universal transformations, defined as input-independent transformations, appear in various quantum applications. Such is the case for universal transformations of unitary operations. However, extending these transformations to non-unitary operations is nontrivial and largely unresolved. Addressing this, we introduce isometry adjointation protocols that transform an input isometry operation into its adjoint operation, which include both unitary operation and quantum state transformations. The paper details the construction of parallel and sequential isometry adjointation protocols, derived from unitary inversion protocols using quantum combs and the (dual) Clebsch-Gordan transforms, and achieving optimal approximation error. This error is shown to be independent of the output dimension of the isometry operation. In particular, we explicitly obtain an asymptotically optimal parallel protocol achieving an approximation error $ε= Θ(d^2/n)$, where $d$ is the input dimension of the isometry operation and $n$ is the number of calls of the isometry operation. The research also extends to isometry inversion and universal error detection, employing semidefinite programming to assess optimal performances. The findings suggest that the optimal performance of general protocols in isometry adjointation and universal error detection is not dependent on the output dimension, and that indefinite causal order protocols offer advantages over sequential ones in isometry inversion and universal error detection.",
    "authors": [
      "Satoshi Yoshida",
      "Akihito Soeda",
      "Mio Murao"
    ],
    "publication_date": "2024-01-18T17:05:51Z",
    "arxiv_id": "http://arxiv.org/abs/2401.10137v3",
    "download_url": "https://arxiv.org/abs/2401.10137v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Encoding trade-offs and design toolkits in quantum algorithms for discrete optimization: coloring, routing, scheduling, and other problems",
    "abstract": "Challenging combinatorial optimization problems are ubiquitous in science and engineering. Several quantum methods for optimization have recently been developed, in different settings including both exact and approximate solvers. Addressing this field of research, this manuscript has three distinct purposes. First, we present an intuitive method for synthesizing and analyzing discrete (i.e., integer-based) optimization problems, wherein the problem and corresponding algorithmic primitives are expressed using a discrete quantum intermediate representation (DQIR) that is encoding-independent. This compact representation often allows for more efficient problem compilation, automated analyses of different encoding choices, easier interpretability, more complex runtime procedures, and richer programmability, as compared to previous approaches, which we demonstrate with a number of examples. Second, we perform numerical studies comparing several qubit encodings; the results exhibit a number of preliminary trends that help guide the choice of encoding for a particular set of hardware and a particular problem and algorithm. Our study includes problems related to graph coloring, the traveling salesperson problem, factory/machine scheduling, financial portfolio rebalancing, and integer linear programming. Third, we design low-depth graph-derived partial mixers (GDPMs) up to 16-level quantum variables, demonstrating that compact (binary) encodings are more amenable to QAOA than previously understood. We expect this toolkit of programming abstractions and low-level building blocks to aid in designing quantum algorithms for discrete combinatorial problems.",
    "authors": [
      "Nicolas PD Sawaya",
      "Albert T Schmitz",
      "Stuart Hadfield"
    ],
    "publication_date": "2022-03-28T01:01:12Z",
    "arxiv_id": "http://arxiv.org/abs/2203.14432v3",
    "download_url": "https://arxiv.org/abs/2203.14432v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum walks and their algorithmic applications",
    "abstract": "Quantum walks are quantum counterparts of Markov chains. In this article, we give a brief overview of quantum walks, with emphasis on their algorithmic applications.",
    "authors": [
      "Andris Ambainis"
    ],
    "publication_date": "2004-03-16T21:49:43Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0403120v3",
    "download_url": "https://arxiv.org/abs/quant-ph/0403120v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanics and the manifestation of the world",
    "abstract": "Quantum theory's irreducible empirical core is a probability calculus. While it presupposes the events to which (and on the basis of which) it serves to assign probabilities, and therefore cannot account for their occurrence, it has to be consistent with it. It must make it possible to identify a system of observables that have measurement-independent values. What makes this possible is the incompleteness of the spatiotemporal differentiation of the physical world. This is shown by applying a novel interpretive principle to interfering alternatives involving distinctions between regions of space. Applying the same interpretive principle to alternatives involving distinctions between things makes it safe to claim that the macroworld comes into being through a progressive differentiation of a single, intrinsically undifferentiated entity. By entering into reflexive spatial relations, this entity gives rise to (i) what looks like a multiplicity of relata if the reflexive quality of the relations is not taken into account, and (ii) what looks like a substantial expanse if the spatial quality of the relations is reified. The necessary distinction between two domains (classical and quantum, or macro and micro) and their mutual dependence is best understood as a distinction between the manifested world and its manifestation.",
    "authors": [
      "Ulrich Mohrhoff"
    ],
    "publication_date": "2014-04-29T05:36:39Z",
    "arxiv_id": "http://arxiv.org/abs/1404.7240v2",
    "download_url": "https://arxiv.org/abs/1404.7240v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric Formulation of Nonlinear Quantum Mechanics for Density Matrices",
    "abstract": "Proposals for nonlinear extenstions of quantum mechanics are discussed. Two different concepts of \"mixed state\" for any nonlinear version of quantum theory are introduced: (i) >genuine mixture< corresponds to operational \"mixing\" of different ensembles, and (ii) a mixture described by single density matrix without having a canonical operational possibility to pick out its specific convex decomposition is called here an >elementary mixture<. Time evolution of a class of nonlinear extensions of quantum mechanics is introduced. Evolution of an elementary mixture cannot be generally given by evolutions of components of its arbitrary convex decompositions. The theory is formulated in a \"geometric form\": It can be considered as a version of Hamiltonian mechanics on infinite dimensional space of density matrices. A quantum interpretation of the theory is sketched.",
    "authors": [
      "Pavel Bona"
    ],
    "publication_date": "1999-10-04T14:27:34Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9910011v1",
    "download_url": "https://arxiv.org/abs/quant-ph/9910011v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Is Pseudo-Hermitian Quantum Mechanics an Indefinite-Metric Quantum Theory?",
    "abstract": "With a view to eliminate an important misconception in some recent publications, we give a brief review of the notion of a pseudo-Hermitian operator, outline pseudo-Hermitian quantum mechanics, and discuss its basic difference with the indefinite-metric quantum mechanics. In particular, we show that the answer to the question posed in the title is a definite No.",
    "authors": [
      "Ali Mostafazadeh"
    ],
    "publication_date": "2003-08-05T12:08:26Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0308028v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0308028v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Entropic Dynamics approach to Quantum Mechanics",
    "abstract": "Entropic Dynamics (ED) is a framework in which Quantum Mechanics is derived as an application of entropic methods of inference. In ED the dynamics of the probability distribution is driven by entropy subject to constraints that are codified into a quantity later identified as the phase of the wave function. The central challenge is to specify how those constraints are themselves updated. In this paper we review and extend the ED framework in several directions. A new version of ED is introduced in which particles follow smooth differentiable Brownian trajectories (as opposed to non-differentiable Brownian paths). To construct the ED we make use of the fact that the space of probabilities and phases has a natural symplectic structure (i.e., it is a phase space with Hamiltonian flows and Poisson brackets). Then, using an argument based on information geometry, a metric structure is introduced. It is shown that the ED that preserves the symplectic and metric structures -- which is a Hamilton-Killing flow in phase space -- is the linear Schrödinger equation. These developments allow us to discuss why wave functions are complex and the connections between the superposition principle, the single-valuedness of wave functions, and the quantization of electric charges. Finally, it is observed that Hilbert spaces are not necessary ingredients in this construction. They are a clever but merely optional trick that turns out to be convenient for practical calculations.",
    "authors": [
      "Ariel Caticha"
    ],
    "publication_date": "2019-08-13T15:06:18Z",
    "arxiv_id": "http://arxiv.org/abs/1908.04693v3",
    "download_url": "https://arxiv.org/abs/1908.04693v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A generative modeling approach for benchmarking and training shallow quantum circuits",
    "abstract": "Hybrid quantum-classical algorithms provide ways to use noisy intermediate-scale quantum computers for practical applications. Expanding the portfolio of such techniques, we propose a quantum circuit learning algorithm that can be used to assist the characterization of quantum devices and to train shallow circuits for generative tasks. The procedure leverages quantum hardware capabilities to its fullest extent by using native gates and their qubit connectivity. We demonstrate that our approach can learn an optimal preparation of the Greenberger-Horne-Zeilinger states, also known as \"cat states\". We further demonstrate that our approach can efficiently prepare approximate representations of coherent thermal states, wave functions that encode Boltzmann probabilities in their amplitudes. Finally, complementing proposals to characterize the power or usefulness of near-term quantum devices, such as IBM's quantum volume, we provide a new hardware-independent metric called the qBAS score. It is based on the performance yield in a specific sampling task on one of the canonical machine learning data sets known as Bars and Stripes. We show how entanglement is a key ingredient in encoding the patterns of this data set; an ideal benchmark for testing hardware starting at four qubits and up. We provide experimental results and evaluation of this metric to probe the trade off between several architectural circuit designs and circuit depths on an ion-trap quantum computer.",
    "authors": [
      "Marcello Benedetti",
      "Delfina Garcia-Pintos",
      "Oscar Perdomo",
      "Vicente Leyton-Ortega",
      "Yunseong Nam",
      "Alejandro Perdomo-Ortiz"
    ],
    "publication_date": "2018-01-23T18:15:22Z",
    "arxiv_id": "http://arxiv.org/abs/1801.07686v4",
    "download_url": "https://arxiv.org/abs/1801.07686v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum optimization using variational algorithms on near-term quantum devices",
    "abstract": "Universal fault-tolerant quantum computers will require error-free execution of long sequences of quantum gate operations, which is expected to involve millions of physical qubits. Before the full power of such machines will be available, near-term quantum devices will provide several hundred qubits and limited error correction. Still, there is a realistic prospect to run useful algorithms within the limited circuit depth of such devices. Particularly promising are optimization algorithms that follow a hybrid approach: the aim is to steer a highly entangled state on a quantum system to a target state that minimizes a cost function via variation of some gate parameters. This variational approach can be used both for classical optimization problems as well as for problems in quantum chemistry. The challenge is to converge to the target state given the limited coherence time and connectivity of the qubits. In this context, the quantum volume as a metric to compare the power of near-term quantum devices is discussed.\n  With focus on chemistry applications, a general description of variational algorithms is provided and the mapping from fermions to qubits is explained. Coupled-cluster and heuristic trial wave-functions are considered for efficiently finding molecular ground states. Furthermore, simple error-mitigation schemes are introduced that could improve the accuracy of determining ground-state energies. Advancing these techniques may lead to near-term demonstrations of useful quantum computation with systems containing several hundred qubits.",
    "authors": [
      "Nikolaj Moll",
      "Panagiotis Barkoutsos",
      "Lev S. Bishop",
      "Jerry M. Chow",
      "Andrew Cross",
      "Daniel J. Egger",
      "Stefan Filipp",
      "Andreas Fuhrer",
      "Jay M. Gambetta",
      "Marc Ganzhorn",
      "Abhinav Kandala",
      "Antonio Mezzacapo",
      "Peter Müller",
      "Walter Riess",
      "Gian Salis",
      "John Smolin",
      "Ivano Tavernelli",
      "Kristan Temme"
    ],
    "publication_date": "2017-10-03T08:08:56Z",
    "arxiv_id": "http://arxiv.org/abs/1710.01022v2",
    "download_url": "https://arxiv.org/abs/1710.01022v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complexity of Digital Quantum Simulation in the Low-Energy Subspace: Applications and a Lower Bound",
    "abstract": "Digital quantum simulation has broad applications in approximating unitary evolution of Hamiltonians. In practice, many simulation tasks for quantum systems focus on quantum states in the low-energy subspace instead of the entire Hilbert space. In this paper, we systematically investigate the complexity of digital quantum simulation based on product formulas in the low-energy subspace. We show that the simulation error depends on the effective low-energy norm of the Hamiltonian for a variety of digital quantum simulation algorithms and quantum systems, allowing improvements over the previous complexities for full unitary simulations even for imperfect state preparations due to thermalization. In particular, for simulating spin models in the low-energy subspace, we prove that randomized product formulas such as qDRIFT and random permutation require smaller Trotter numbers. Such improvement also persists in symmetry-protected digital quantum simulations. We prove a similar improvement in simulating the dynamics of power-law quantum interactions. We also provide a query lower bound for general digital quantum simulations in the low-energy subspace.",
    "authors": [
      "Weiyuan Gong",
      "Shuo Zhou",
      "Tongyang Li"
    ],
    "publication_date": "2023-12-14T12:44:11Z",
    "arxiv_id": "http://arxiv.org/abs/2312.08867v3",
    "download_url": "https://arxiv.org/abs/2312.08867v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic length in open quantum systems",
    "abstract": "The dissipation generated during a quasistatic thermodynamic process can be characterised by introducing a metric on the space of Gibbs states, in such a way that minimally-dissipating protocols correspond to geodesic trajectories. Here, we show how to generalize this approach to open quantum systems by finding the thermodynamic metric associated to a given Lindblad master equation. The obtained metric can be understood as a perturbation over the background geometry of equilibrium Gibbs states, which is induced by the Kubo-Mori-Bogoliubov (KMB) inner product. We illustrate this construction on two paradigmatic examples: an Ising chain and a two-level system interacting with a bosonic bath with different spectral densities.",
    "authors": [
      "Matteo Scandi",
      "Martí Perarnau-Llobet"
    ],
    "publication_date": "2018-10-12T15:48:53Z",
    "arxiv_id": "http://arxiv.org/abs/1810.05583v5",
    "download_url": "https://arxiv.org/abs/1810.05583v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic resetting in discrete-time quantum dynamics: steady states and correlations in few-qubit systems",
    "abstract": "Time evolution in several classes of quantum devices is generated through the application of quantum gates. Resetting is a critical technological feature in these systems allowing for mid-circuit measurement and complete or partial qubit reset. The possibility of realizing discrete-time reset dynamics on quantum computers makes it important to investigate the steady-state properties of such dynamics. Here, we explore the behavior of generic discrete-time unitary dynamics interspersed by random reset events. For Poissonian resets, we compute the stationary state of the process and demonstrate, by taking a weak-reset limit, the existence of \"resonances\" in the quantum gates, allowing for the emergence of steady state density matrices which are not diagonal in the eigenbasis of the generator of the unitary gate. Such resonances are a genuine discrete-time feature and impact on quantum and classical correlations even beyond the weak-reset limit. Furthermore, we consider non-Poissonian reset processes and explore conditions for the existence of a steady state. We show that, when the reset probability vanishes sufficiently rapidly with time, the system does not approach a steady state. Our results highlight key differences between continuous-time and discrete-time stochastic resetting and may be useful to engineer states with controllable correlations on existing devices.",
    "authors": [
      "Sascha Wald",
      "Louie Hong Yao",
      "Thierry Platini",
      "Chris Hooley",
      "Federico Carollo"
    ],
    "publication_date": "2024-10-15T11:07:25Z",
    "arxiv_id": "http://arxiv.org/abs/2410.11497v3",
    "download_url": "https://arxiv.org/abs/2410.11497v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nashian game theory is incompatible with quantum physics",
    "abstract": "We suggest to look at quantum measurement outcomes not through the lens of probability theory, but instead through decision theory. We introduce an original game-theoretical framework, model and algorithmic procedure where measurement scenarios are multiplayer games with a structure all observers agree on. Measurement axes and, newly, measurement outcomes are modeled as decisions with nature being an action-minimizing economic agent. We translate physical notions of causality, correlation, counterfactuals, and contextuality to particular aspects of game theory. We investigate the causal consistency of dynamic games with imperfect information from the quantum perspective and conclude that counterfactual dependencies should be distinguished from causation and correlation as a separate phenomenon of its own. Most significantly, we observe that game theory based on Nash equilibria stands in contradiction with a violation of Bell inequalities. Hence, we propose that quantum physics should be analyzed with non-Nashian game theory, the inner workings of which we demonstrate using our proposed model.",
    "authors": [
      "Michal Baczyk",
      "Ghislain Fourny"
    ],
    "publication_date": "2021-12-07T18:23:59Z",
    "arxiv_id": "http://arxiv.org/abs/2112.03881v3",
    "download_url": "https://arxiv.org/abs/2112.03881v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entanglement entropy production in Quantum Neural Networks",
    "abstract": "Quantum Neural Networks (QNN) are considered a candidate for achieving quantum advantage in the Noisy Intermediate Scale Quantum computer (NISQ) era. Several QNN architectures have been proposed and successfully tested on benchmark datasets for machine learning. However, quantitative studies of the QNN-generated entanglement have been investigated only for up to few qubits. Tensor network methods allow to emulate quantum circuits with a large number of qubits in a wide variety of scenarios. Here, we employ matrix product states to characterize recently studied QNN architectures with random parameters up to fifty qubits showing that their entanglement, measured in terms of entanglement entropy between qubits, tends to that of Haar distributed random states as the depth of the QNN is increased. We certify the randomness of the quantum states also by measuring the expressibility of the circuits, as well as using tools from random matrix theory. We show a universal behavior for the rate at which entanglement is created in any given QNN architecture, and consequently introduce a new measure to characterize the entanglement production in QNNs: the entangling speed. Our results characterise the entanglement properties of quantum neural networks, and provides new evidence of the rate at which these approximate random unitaries.",
    "authors": [
      "Marco Ballarin",
      "Stefano Mangini",
      "Simone Montangero",
      "Chiara Macchiavello",
      "Riccardo Mengoni"
    ],
    "publication_date": "2022-06-06T10:17:17Z",
    "arxiv_id": "http://arxiv.org/abs/2206.02474v3",
    "download_url": "https://arxiv.org/abs/2206.02474v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Learning Boolean Linear Functions w.r.t. Product Distributions",
    "abstract": "The problem of learning Boolean linear functions from quantum examples w.r.t. the uniform distribution can be solved on a quantum computer using the Bernstein-Vazirani algorithm. A similar strategy can be applied in the case of noisy quantum training data, as was observed in arXiv:1702.08255v2 [quant-ph]. However, extensions of these learning algorithms beyond the uniform distribution have not yet been studied. We employ the biased quantum Fourier transform introduced in arXiv:1802.05690v2 [quant-ph] to develop efficient quantum algorithms for learning Boolean linear functions on $n$ bits from quantum examples w.r.t. a biased product distribution. Our first procedure is applicable to any (except full) bias and requires $\\mathcal{O}(\\ln (n))$ quantum examples. The number of quantum examples used by our second algorithm is independent of $n$, but the strategy is applicable only for small bias. Moreover, we show that the second procedure is stable w.r.t. noisy training data and w.r.t. faulty quantum gates. This also enables us to solve a version of the learning problem in which the underlying distribution is not known in advance. Finally, we prove lower bounds on the classical and quantum sample complexities of the learning problem. Whereas classically, $Ω(n)$ examples are necessary independently of the bias, we are able to establish a quantum sample complexity lower bound of $Ω(\\ln (n))$ only under an assumption of large bias. Nevertheless, this allows for a discussion of the performance of our suggested learning algorithms w.r.t. sample complexity. With our analysis we contribute to a more quantitative understanding of the power and limitations of quantum training data for learning classical functions.",
    "authors": [
      "Matthias C. Caro"
    ],
    "publication_date": "2019-02-23T08:20:09Z",
    "arxiv_id": "http://arxiv.org/abs/1902.08753v2",
    "download_url": "https://arxiv.org/abs/1902.08753v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relative Facts of Relational Quantum Mechanics are Incompatible with Quantum Mechanics",
    "abstract": "Relational Quantum Mechanics (RQM) claims to be an interpretation of quantum theory [see arXiv:2109.09170, which appears in the Oxford Handbook of the History of Interpretation of Quantum Physics]. However, there are significant departures from quantum theory: (i) in RQM measurement outcomes arise from interactions which entangle a system $S$ and an observer $A$ without decoherence, and (ii) such an outcome is a \"fact\" relative to the observer $A$, but it is not a fact relative to another observer $B$ who has not interacted with $S$ or $A$ during the foregoing measurement process. For $B$ the system $S \\otimes A$ remains entangled. We derive a GHZ-like contradiction showing that relative facts described by these statements are incompatible with quantum theory. Hence Relational Quantum Mechanics should not be considered an interpretation of quantum theory, according to a criterion for interpretations that we have introduced. The criterion states that whenever an interpretation introduces a notion of outcomes, these outcomes, whatever they are, must follow the probability distribution specified by the Born rule.",
    "authors": [
      "Jay Lawrence",
      "Marcin Markiewicz",
      "Marek Żukowski"
    ],
    "publication_date": "2022-08-24T23:15:00Z",
    "arxiv_id": "http://arxiv.org/abs/2208.11793v2",
    "download_url": "https://arxiv.org/abs/2208.11793v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strawberry Fields: A Software Platform for Photonic Quantum Computing",
    "abstract": "We introduce Strawberry Fields, an open-source quantum programming architecture for light-based quantum computers, and detail its key features. Built in Python, Strawberry Fields is a full-stack library for design, simulation, optimization, and quantum machine learning of continuous-variable circuits. The platform consists of three main components: (i) an API for quantum programming based on an easy-to-use language named Blackbird; (ii) a suite of three virtual quantum computer backends, built in NumPy and TensorFlow, each targeting specialized uses; and (iii) an engine which can compile Blackbird programs on various backends, including the three built-in simulators, and -- in the near future -- photonic quantum information processors. The library also contains examples of several paradigmatic algorithms, including teleportation, (Gaussian) boson sampling, instantaneous quantum polynomial, Hamiltonian simulation, and variational quantum circuit optimization.",
    "authors": [
      "Nathan Killoran",
      "Josh Izaac",
      "Nicolás Quesada",
      "Ville Bergholm",
      "Matthew Amy",
      "Christian Weedbrook"
    ],
    "publication_date": "2018-04-09T18:00:16Z",
    "arxiv_id": "http://arxiv.org/abs/1804.03159v2",
    "download_url": "https://arxiv.org/abs/1804.03159v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Introductory quantum information science coursework at US institutions: Content coverage",
    "abstract": "Despite rapid growth of quantum information science and engineering (QIS/QISE) workforce development initiatives, perceived lack of agreement among faculty on core content has made prior research-based curriculum and assessment development initiatives difficult to scale. To identify areas if consensus on content coverage, we report findings from a survey of N=63 instructors teaching introductory QISE courses at US institutions of higher learning. We identify a subset of content items common across a large fraction (>=80%) of introductory QISE courses that are potentially amenable to research-based curriculum development, with an emphasis on foundational skills in mathematics, physics, and engineering. As a further guide for curriculum development, we also examine differences in content coverage by level (undergraduate/graduate) and discipline. Finally, we briefly discuss the implications of our findings for the development of a research-based QISE assessment at the postsecondary level.",
    "authors": [
      "Josephine C. Meyer",
      "Gina Passante",
      "Steven J. Pollock",
      "Bethany R. Wilcox"
    ],
    "publication_date": "2023-08-24T17:06:48Z",
    "arxiv_id": "http://arxiv.org/abs/2308.12929v1",
    "download_url": "https://arxiv.org/abs/2308.12929v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimizing Quantum Error Correction Codes with Reinforcement Learning",
    "abstract": "Quantum error correction is widely thought to be the key to fault-tolerant quantum computation. However, determining the most suited encoding for unknown error channels or specific laboratory setups is highly challenging. Here, we present a reinforcement learning framework for optimizing and fault-tolerantly adapting quantum error correction codes. We consider a reinforcement learning agent tasked with modifying a family of surface code quantum memories until a desired logical error rate is reached. Using efficient simulations with about 70 data qubits with arbitrary connectivity, we demonstrate that such a reinforcement learning agent can determine near-optimal solutions, in terms of the number of data qubits, for various error models of interest. Moreover, we show that agents trained on one setting are able to successfully transfer their experience to different settings. This ability for transfer learning showcases the inherent strengths of reinforcement learning and the applicability of our approach for optimization from off-line simulations to on-line laboratory settings.",
    "authors": [
      "Hendrik Poulsen Nautrup",
      "Nicolas Delfosse",
      "Vedran Dunjko",
      "Hans J. Briegel",
      "Nicolai Friis"
    ],
    "publication_date": "2018-12-20T09:54:05Z",
    "arxiv_id": "http://arxiv.org/abs/1812.08451v5",
    "download_url": "https://arxiv.org/abs/1812.08451v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Origin of time and probability in quantum cosmology",
    "abstract": "We discuss how the classical notions of time and causal structure may emerge together with quantum-mechanical probabilities from a universal quantum state. For this, the process of decoherence between semiclassical branches is important. Our discussion is based on quantum geometrodynamics, a canonical approach to quantum gravity. In this framework, a particular boundary condition may illuminate the issue of the arrow of (classical) time in connection to the growth of entanglement entropy.",
    "authors": [
      "Leonardo Chataignier",
      "Claus Kiefer",
      "Mritunjay Tyagi"
    ],
    "publication_date": "2025-03-13T18:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/2503.10752v1",
    "download_url": "https://arxiv.org/abs/2503.10752v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Picturalism: Learning Quantum Theory in High School",
    "abstract": "Quantum theory is often regarded as challenging to learn and teach, with advanced mathematical prerequisites ranging from complex numbers and probability theory to matrix multiplication, vector space algebra and symbolic manipulation within the Hilbert space formalism. It is traditionally considered an advanced undergraduate or graduate-level subject.\n  In this work, we challenge the conventional view by proposing \"Quantum Picturalism\" as a new approach to teaching the fundamental concepts of quantum theory and computation. We establish the foundations and methodology for an ongoing educational experiment to investigate the question \"From what age can students learn quantum theory if taught using a diagrammatic approach?\". We anticipate that the primary benefit of leveraging such a diagrammatic approach, which is conceptually intuitive yet mathematically rigorous, will be eliminating some of the most daunting barriers to teaching and learning this subject while enabling young learners to reason proficiently about high-level problems. We posit that transitioning from symbolic presentations to pictorial ones will increase the appeal of STEM education, attracting more diverse audience.",
    "authors": [
      "Selma Dündar-Coecke",
      "Lia Yeh",
      "Caterina Puca",
      "Sieglinde M. -L. Pfaendler",
      "Muhammad Hamza Waseem",
      "Thomas Cervoni",
      "Aleks Kissinger",
      "Stefano Gogioso",
      "Bob Coecke"
    ],
    "publication_date": "2023-12-06T18:16:12Z",
    "arxiv_id": "http://arxiv.org/abs/2312.03653v1",
    "download_url": "https://arxiv.org/abs/2312.03653v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric phases, Everett's many-worlds interpretation of quantum mechanics, and wormholes",
    "abstract": "We present how the formalism of geometric phases in adiabatic quantum dynamics provides geometric realisations permitting to ``embody'' the Everett's many-worlds interpretation of quantum mechanics, including interferences between the worlds needed for the probability changes and the decoherence processes needed to solve the preferred basis problem. We show also that this geometric realisation is intimately related to quantum gravity (especially to matrix models), showing that the many-world interpretation can be consistent with quantum gravity. The concept of wormhole borrowed to general relativity is central in this geometric realisation. It appears not only as an image by analogy to help the interpretations, but also as a true physical model of quantum wormhole in quantum gravity, the two ones being consistent which each other.",
    "authors": [
      "David Viennot"
    ],
    "publication_date": "2023-02-27T10:38:05Z",
    "arxiv_id": "http://arxiv.org/abs/2302.13651v2",
    "download_url": "https://arxiv.org/abs/2302.13651v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Noise-enhanced quantum transport on a closed loop using quantum walks",
    "abstract": "We study the effect of noise on the transport of a quantum state from a closed loop of $n-$sites with one of the sites as a sink. Using a discrete-time quantum walk dynamics, we demonstrate that the transport efficiency can be enhanced with noise when the number of sites in the loop is small and reduced when the number of sites in the loop grows. By using the concept of measurement induced disturbance we identify the regimes in which genuine quantum effects are responsible for the enhanced transport.",
    "authors": [
      "C. M. Chandrashekar",
      "Th. Busch"
    ],
    "publication_date": "2012-09-14T10:05:52Z",
    "arxiv_id": "http://arxiv.org/abs/1209.3144v2",
    "download_url": "https://arxiv.org/abs/1209.3144v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Violation of CPT and Quantum Mechanics in the K0--K0bar System",
    "abstract": "We reconsider the model of quantum mechanics violation in the $\\ko$--$\\kob$ system, due to Ellis, Hagelin, Nanopoulos, and Srednicki, in which \\cp- and \\cpt-violating signatures arise from the evolution of pure states into mixed states. We present a formalism for computing time-dependent asymmetries in this model and show that present data constrains its parameters significantly. In the future, this model will be put to very stringent tests at a $φ$ factory. We present the theory of these tests and show the relation between particular $φ$ decay correlations and the parameters of quantum mechanics violation.",
    "authors": [
      "Patrick Huet",
      "Michael E. Peskin"
    ],
    "publication_date": "1994-03-09T20:14:00Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/9403257v2",
    "download_url": "https://arxiv.org/abs/hep-ph/9403257v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pairwise quantum and classical correlations in multi-qubits states via linear relative entropy",
    "abstract": "The pairwise correlations in a multi-qubit state are quantified through a linear variant of relative entropy. In particular, we derive the explicit expressions of total, quantum and classical bipartite correlations. Two different bi-partioning schemes are considered. We discuss the derivation of closest product, quantum-classical and quantum-classical product states. We also investigate the additivity relation between the various pairwise correlations existing in pure and mixed states. As illustration, some special cases are examined.",
    "authors": [
      "M. Daoud",
      "R. Ahl Laamara",
      "H. El Hadfi"
    ],
    "publication_date": "2014-12-01T10:03:56Z",
    "arxiv_id": "http://arxiv.org/abs/1412.0398v1",
    "download_url": "https://arxiv.org/abs/1412.0398v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum arithmetic operations based on quantum Fourier transform on signed integers",
    "abstract": "The quantum Fourier transform (QFT) brings efficiency in many respects, especially usage of resource, for most operations on quantum computers. In this study, the existing QFT-based and non-QFT-based quantum arithmetic operations are examined. The capabilities of QFT-based addition and multiplication are improved with some modifications. The proposed operations are compared with the nearest quantum arithmetic operations. Furthermore, novel QFT-based subtraction, division and exponentiation operations are presented. The proposed arithmetic operations can perform nonmodular operations on all signed numbers without any limitation by using less resources. In addition, novel quantum circuits of two's complement, absolute value and comparison operations are also presented by using the proposed QFT-based addition and subtraction operations.",
    "authors": [
      "Engin Şahin"
    ],
    "publication_date": "2020-05-01T15:25:06Z",
    "arxiv_id": "http://arxiv.org/abs/2005.00443v3",
    "download_url": "https://arxiv.org/abs/2005.00443v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Improved Quantum Query Complexity on Easier Inputs",
    "abstract": "Quantum span program algorithms for function evaluation sometimes have reduced query complexity when promised that the input has a certain structure. We design a modified span program algorithm to show these improvements persist even without a promise ahead of time, and we extend this approach to the more general problem of state conversion. As an application, we prove exponential and superpolynomial quantum advantages in average query complexity for several search problems, generalizing Montanaro's Search with Advice [Montanaro, TQC 2010].",
    "authors": [
      "Noel T. Anderson",
      "Jay-U Chung",
      "Shelby Kimmel",
      "Da-Yeon Koh",
      "Xiaohan Ye"
    ],
    "publication_date": "2023-03-01T03:40:37Z",
    "arxiv_id": "http://arxiv.org/abs/2303.00217v3",
    "download_url": "https://arxiv.org/abs/2303.00217v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information geometry of nonmonotonic quantum natural gradient",
    "abstract": "Natural gradient is an advanced optimization method based on information geometry, where the Fisher metric plays a crucial role.\n  Its quantum counterpart, known as quantum natural gradient (QNG), employs the symmetric logarithmic derivative (SLD) metric, one of the quantum Fisher metrics.\n  While quantization in physics is typically well-defined via the canonical commutation relations, the quantization of information-theoretic quantities introduces inherent arbitrariness.\n  To resolve this ambiguity, monotonicity has been used as a guiding principle for constructing geometries in physics, as it aligns with physical intuition.\n  Recently, a variant of QNG, which we refer to as nonmonotonic QNG in this paper, was proposed by relaxing the monotonicity condition.\n  It was shown to achieve faster convergence compared to conventional QNG.\n  In this paper, we investigate the properties of nonmonotonic QNG.\n  To ensure the paper is self-contained, we first demonstrate that the SLD metric is locally optimal under the monotonicity condition and that non-monotone quantum Fisher metrics can lead to faster convergence in QNG.\n  Previous studies primarily relied on a specific type of quantum divergence and assumed that density operators are full-rank.\n  Here, we explicitly consider an alternative quantum divergence and extend the analysis to non-full-rank cases.\n  Additionally, we explore how geometries can be designed using Petz functions, given that quantum Fisher metrics are characterized through them.\n  Finally, we present numerical simulations comparing different quantum Fisher metrics in the context of parameter estimation problems in quantum circuit learning.",
    "authors": [
      "Hideyuki Miyahara"
    ],
    "publication_date": "2025-10-21T04:27:10Z",
    "arxiv_id": "http://arxiv.org/abs/2510.18286v1",
    "download_url": "https://arxiv.org/abs/2510.18286v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Benchmarking Study of Quantum Algorithms for Combinatorial Optimization",
    "abstract": "We study the performance scaling of three quantum algorithms for combinatorial optimization: measurement-feedback coherent Ising machines (MFB-CIM), discrete adiabatic quantum computation (DAQC), and the Dürr-Hoyer algorithm for quantum minimum finding (DH-QMF) that is based on Grover's search. We use MaxCut problems as a reference for comparison, and time-to-solution (TTS) as a practical measure of performance for these optimization algorithms. For each algorithm, we analyze its performance in solving two types of MaxCut problems: weighted graph instances with randomly generated edge weights attaining 21 equidistant values from $-1$ to $1$; and randomly generated Sherrington-Kirkpatrick (SK) spin glass instances. We empirically find a significant performance advantage for the studied MFB-CIM in comparison to the other two algorithms. We empirically observe a sub-exponential scaling for the median TTS for the MFB-CIM, in comparison to the almost exponential scaling for DAQC and the proven $\\widetilde{O}\\left(\\sqrt{2^n}\\right)$ scaling for DH-QMF. We conclude that the MFB-CIM outperforms DAQC and DH-QMF in solving MaxCut problems.",
    "authors": [
      "Krishanu Sankar",
      "Artur Scherer",
      "Satoshi Kako",
      "Sam Reifenstein",
      "Navid Ghadermarzy",
      "Willem B. Krayenhoff",
      "Yoshitaka Inui",
      "Edwin Ng",
      "Tatsuhiro Onodera",
      "Pooya Ronagh",
      "Yoshihisa Yamamoto"
    ],
    "publication_date": "2021-05-07T22:35:02Z",
    "arxiv_id": "http://arxiv.org/abs/2105.03528v2",
    "download_url": "https://arxiv.org/abs/2105.03528v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A random quantum key distribution by using Bell states",
    "abstract": "We proposed a new scheme for quantum key distribution based on entanglement swapping. By this protocol \\QTR{em}{Alice} can securely share a random quantum key with \\QTR{em}{Bob}, without transporting any particle.",
    "authors": [
      "Chong Li",
      "He-Shan Song",
      "Ling Zhou",
      "Chun-Feng Wu"
    ],
    "publication_date": "2003-02-27T08:52:13Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0302193v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0302193v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Remnant loop quantum black holes",
    "abstract": "Polymer models inspired by Loop Quantum Gravity (LQG) have been used to describe non-singular quantum black holes with spherical symmetry, with the classical singularity replaced by a transition from a black hole to a white hole. A recent model, with a single polymerisation parameter, leads to a symmetric transition with same mass for the black and white phases, and to an asymptotically flat exterior metric. The radius of the transition surface is, however, not fixed, increasing with the mass. Following similar procedures, in a previous paper we have fixed that radius by identifying the minimal area on the transition surface with the area gap of LQG. This allowed to find a dependence of the polymerisation parameter on the black hole mass, with the former increasing as the latter decreases. It also permitted to extend the model to Planck scale black holes, with quantum fluctuations remaining small at the horizon. In the present paper we extend this analysis to charged black holes, showing that the Cauchy horizon lies beyond of the transition surface. We also show the existence of limiting states with zero surface gravity, the lightest one with $Q = 0$ and $m = \\sqrt{2}/4$, and the heaviest with $Q = m = \\sqrt{2}/2$. Using our solutions to approximate quasi-steady horizons, we show that Hawking evaporation leads asymptotically to these extremal states, leaving remnant black holes of Planck size.",
    "authors": [
      "H. A. Borges",
      "I. P. R. Baranov",
      "F. C. Sobrinho",
      "S. Carneiro"
    ],
    "publication_date": "2023-10-02T18:53:01Z",
    "arxiv_id": "http://arxiv.org/abs/2310.01560v3",
    "download_url": "https://arxiv.org/abs/2310.01560v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Protecting information in a parametrically driven hybrid quantum system",
    "abstract": "The transfer and storage of quantum information in a hybrid quantum system, consisting of an ensemble of atoms or spins interacting with a cavity, is adversely affected by the inhomogeneity of the spins, which negates the coherent exchange of excitations between the physical components. Using a full quantum treatment based on variational renormalization group, we show how quantum information encoded in the states of a parametrically driven hybrid system is strongly protected against any decoherence that may arise due to the inhomogeneity in the spin-ensemble.",
    "authors": [
      "Siddharth Tiwary",
      "Harsh Sharma",
      "Himadri Shekhar Dhar"
    ],
    "publication_date": "2022-07-28T19:19:26Z",
    "arxiv_id": "http://arxiv.org/abs/2207.14354v4",
    "download_url": "https://arxiv.org/abs/2207.14354v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Attractor and the Quantum States",
    "abstract": "The dissipative dynamics anticipated in the proof of 't Hooft's existence theorem -- \"For any quantum system there exists at least one deterministic model that reproduces all its dynamics after prequantization\" -- is constructed here explicitly. We propose a generalization of Liouville's classical phase space equation, incorporating dissipation and diffusion, and demonstrate that it describes the emergence of quantum states and their dynamics in the Schroedinger picture. Asymptotically, there is a stable ground state and two decoupled sets of degrees of freedom, which transform into each other under the energy-parity symmetry of Kaplan and Sundrum. They recover the familiar Hilbert space and its dual. Expectations of observables are shown to agree with the Born rule, which is not imposed a priori. This attractor mechanism is applicable in the presence of interactions, to few-body or field theories in particular.",
    "authors": [
      "Hans-Thomas Elze"
    ],
    "publication_date": "2008-06-20T19:23:53Z",
    "arxiv_id": "http://arxiv.org/abs/0806.3408v1",
    "download_url": "https://arxiv.org/abs/0806.3408v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Resource frugal optimizer for quantum machine learning",
    "abstract": "Quantum-enhanced data science, also known as quantum machine learning (QML), is of growing interest as an application of near-term quantum computers. Variational QML algorithms have the potential to solve practical problems on real hardware, particularly when involving quantum data. However, training these algorithms can be challenging and calls for tailored optimization procedures. Specifically, QML applications can require a large shot-count overhead due to the large datasets involved. In this work, we advocate for simultaneous random sampling over both the dataset as well as the measurement operators that define the loss function. We consider a highly general loss function that encompasses many QML applications, and we show how to construct an unbiased estimator of its gradient. This allows us to propose a shot-frugal gradient descent optimizer called Refoqus (REsource Frugal Optimizer for QUantum Stochastic gradient descent). Our numerics indicate that Refoqus can save several orders of magnitude in shot cost, even relative to optimizers that sample over measurement operators alone.",
    "authors": [
      "Charles Moussa",
      "Max Hunter Gordon",
      "Michal Baczyk",
      "M. Cerezo",
      "Lukasz Cincio",
      "Patrick J. Coles"
    ],
    "publication_date": "2022-11-09T15:29:03Z",
    "arxiv_id": "http://arxiv.org/abs/2211.04965v3",
    "download_url": "https://arxiv.org/abs/2211.04965v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum walk on distinguishable non-interacting many-particles and indistinguishable two-particle",
    "abstract": "We present an investigation of many-particle quantum walks in systems of non-interacting distinguishable particles. Along with a redistribution of the many-particle density profile we show that the collective evolution of the many-particle system resembles the single-particle quantum walk evolution when the number of steps is greater than the number of particles in the system. For non-uniform initial states we show that the quantum walks can be effectively used to separate the basis states of the particle in position space and grouping like state together. We also discuss a two-particle quantum walk on a two- dimensional lattice and demonstrate an evolution leading to the localization of both particles at the center of the lattice. Finally we discuss the outcome of a quantum walk of two indistinguishable particles interacting at some point during the evolution.",
    "authors": [
      "C. M. Chandrashekar",
      "Th. Busch"
    ],
    "publication_date": "2012-03-04T23:11:16Z",
    "arxiv_id": "http://arxiv.org/abs/1203.0785v1",
    "download_url": "https://arxiv.org/abs/1203.0785v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Teleportation through Noisy Channels with Multi-Qubit GHZ States",
    "abstract": "We investigate two-party quantum teleportation through noisy channels for multi-qubit Greenberger-Horne-Zeilinger (GHZ) states and find which state loses less quantum information in the process. The dynamics of states is described by the master equation with the noisy channels that lead to the quantum channels to be mixed states. We analytically solve the Lindblad equation for $n$-qubit GHZ states $n\\in\\{4,5,6\\}$ where Lindblad operators correspond to the Pauli matrices and describe the decoherence of states. Using the average fidelity we show that 3GHZ state is more robust than $n$GHZ state under most noisy channels. However, $n$GHZ state preserves same quantum information with respect to EPR and 3GHZ states where the noise is in $x$ direction in which the fidelity remains unchanged. We explicitly show that Jung ${\\it et\\, al.}$ conjecture [Phys. Rev. A ${\\bf 78}$, 012312 (2008)], namely, \"average fidelity with same-axis noisy channels are in general larger than average fidelity with different-axis noisy channels\" is not valid for 3GHZ and 4GHZ states.",
    "authors": [
      "Pakhshan Espoukeh",
      "Pouria Pedram"
    ],
    "publication_date": "2014-03-05T14:44:20Z",
    "arxiv_id": "http://arxiv.org/abs/1403.1147v2",
    "download_url": "https://arxiv.org/abs/1403.1147v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sketching phase diagrams using low-depth variational quantum algorithms",
    "abstract": "Mapping out phase diagrams of quantum systems using classical simulations can be challenging or intractable due to the computational resources required to simulate even small quantum systems far away from the thermodynamic limit. We investigate using quantum computers and the Variational Quantum Eigensolver (VQE) for this task. In contrast to the task of preparing the exact ground state using VQE, sketching phase diagrams might require less quantum resources and accuracy, because low fidelity approximations to the ground state may be enough to correctly identify different phases. We used classical numerical simulations of low-depth VQE circuits to compute order parameters for four well-studied spin and fermion models which represent a mix of 1D and 2D, and exactly-solvable and classically hard systems. We find that it is possible to predict the location of phase transitions up to reasonable accuracy using states produced by VQE even when their overlap with the true ground state is small. Further, we introduce a model-agnostic predictor of phase transitions based on the speed with which the VQE energy improves with respect to the circuit depth, and find that in some cases this is also able to predict phase transitions.",
    "authors": [
      "Jan Lukas Bosse",
      "Raul Santos",
      "Ashley Montanaro"
    ],
    "publication_date": "2023-01-23T11:25:04Z",
    "arxiv_id": "http://arxiv.org/abs/2301.09369v2",
    "download_url": "https://arxiv.org/abs/2301.09369v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Non-Hermitian Linear Response to Dynamical Correlations and Fluctuation-Dissipation Relations in Quantum Many-Body Systems",
    "abstract": "Quantum many-body systems are characterized by their correlations. While equal-time correlators and unequal-time commutators between operators are standard observables, the direct access to unequal-time anti-commutators poses a formidable experimental challenge. Here, we propose a general technique for measuring unequal-time anti-commutators using the linear response of a system to a non-Hermitian perturbation. We illustrate the protocol at the example of a Bose-Hubbard model, where the approach to thermal equilibrium in a closed quantum system can be tracked by measuring both sides of the fluctuation-dissipation relation. We relate the scheme to the quantum Zeno effect and weak measurements, and illustrate possible implementations at the example of a cold-atom system. Our proposal provides a way of characterizing dynamical correlations in quantum many-body systems with potential applications in understanding strongly correlated matter as well as for novel quantum technologies.",
    "authors": [
      "Kevin T. Geier",
      "Philipp Hauke"
    ],
    "publication_date": "2021-04-08T18:00:06Z",
    "arxiv_id": "http://arxiv.org/abs/2104.03983v2",
    "download_url": "https://arxiv.org/abs/2104.03983v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the horizon area of effective loop quantum black holes",
    "abstract": "Effective models of quantum black holes inspired by Loop Quantum Gravity (LQG) have had success in resolving the classical singularity with polymerisation procedures and by imposing the LQG area gap as a minimum area. The singularity is replaced by a hypersurface of transition from black to white holes, and a recent example is the Ashtekar, Olmedo and Singh (AOS) model for a Schwarzschild black hole. More recently, a one-parameter model, with equal masses for the black and white solutions, was suggested by Alonso-Bardaji, Brizuela and Vera (ABBV). An interesting feature of their quantisation is that the angular part of the metric retains its classical form and the horizon area is therefore the same as in the classical theory. In the present contribution we solve the dynamical equations derived from the ABBV effective Hamiltonian and, by applying the AOS minimal area condition, we obtain the scaling of the polymerisation parameter with the black hole mass. We then show that this effective model can also describe Planck scale black holes, and that the curvature and quantum corrections at the horizon are small even at this scale. By generating the exterior metric through a phase rotation in the dynamical variables, we also show that, for an asymptotic observer, the Kretschmann scalar is the same as in the classical Schwarzschild solution, but with a central mass screened by the quantum fluctuations.",
    "authors": [
      "F. C. Sobrinho",
      "H. A. Borges",
      "I. P. R. Baranov",
      "S. Carneiro"
    ],
    "publication_date": "2022-12-21T17:14:20Z",
    "arxiv_id": "http://arxiv.org/abs/2212.11199v3",
    "download_url": "https://arxiv.org/abs/2212.11199v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Error Correction resilient against Atom Loss",
    "abstract": "We investigate quantum error correction protocols for neutral atoms quantum processors in the presence of atom loss. We complement the surface code with loss detection units (LDU) and analyze its performances by means of circuit-level simulations for two distinct protocols -- the standard LDU and a teleportation-based LDU --, focussing on the impact of both atom loss and depolarizing noise on the logical error probability. We introduce and employ a new adaptive decoding procedure that leverages the knowledge of loss locations provided by the LDUs, improving logical error probabilities by nearly three orders of magnitude compared to a naive decoder. For the considered error models, our results demonstrate the existence of an error threshold line that depends linearly on the probabilities of atom loss and of depolarizing errors. For zero depolarizing noise, the atom loss threshold is about $2.6\\%$.",
    "authors": [
      "Hugo Perrin",
      "Sven Jandura",
      "Guido Pupillo"
    ],
    "publication_date": "2024-12-10T19:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/2412.07841v3",
    "download_url": "https://arxiv.org/abs/2412.07841v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Piquasso: A Photonic Quantum Computer Simulation Software Platform",
    "abstract": "We introduce the Piquasso quantum programming framework, a full-stack open-source software platform for the simulation and programming of photonic quantum computers. Piquasso can be programmed via a high-level Python programming interface enabling users to perform efficient quantum computing with discrete and continuous variables. Via optional high-performance C++ backends, Piquasso provides state-of-the-art performance in the simulation of photonic quantum computers. The Piquasso framework is supported by an intuitive web-based graphical user interface where the users can design quantum circuits, run computations, and visualize the results.",
    "authors": [
      "Zoltán Kolarovszki",
      "Tomasz Rybotycki",
      "Péter Rakyta",
      "Ágoston Kaposi",
      "Boldizsár Poór",
      "Szabolcs Jóczik",
      "Dániel T. R. Nagy",
      "Henrik Varga",
      "Kareem H. El-Safty",
      "Gregory Morse",
      "Michał Oszmaniec",
      "Tamás Kozsik",
      "Zoltán Zimborás"
    ],
    "publication_date": "2024-03-06T19:31:50Z",
    "arxiv_id": "http://arxiv.org/abs/2403.04006v3",
    "download_url": "https://arxiv.org/abs/2403.04006v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Energy conservation and fluctuation theorem are incompatible for quantum work",
    "abstract": "Characterizing fluctuations of work in coherent quantum systems is notoriously problematic. Here we reveal the ultimate source of the problem by proving that ($\\mathfrak{A}$) energy conservation and ($\\mathfrak{B}$) the Jarzynski fluctuation theorem cannot be observed at the same time. Condition $\\mathfrak{A}$ stipulates that, for any initial state of the system, the measured average work must be equal to the difference of initial and final average energies, and that untouched systems must exchange deterministically zero work. Condition $\\mathfrak{B}$ is only for thermal initial states and encapsulates the second law of thermodynamics. We prove that $\\mathfrak{A}$ and $\\mathfrak{B}$ are incompatible for work measurement schemes that are differentiable functions of the state and satisfy two mild structural constraints. This covers all existing schemes and leaves the theoretical possibility of jointly observing $\\mathfrak{A}$ and $\\mathfrak{B}$ open only for a narrow class of exotic schemes. For the special but important case of state-independent schemes, the situation is much more rigid: we prove that, essentially, only the two-point measurement scheme is compatible with $\\mathfrak{B}$.",
    "authors": [
      "Karen V. Hovhannisyan",
      "Alberto Imparato"
    ],
    "publication_date": "2021-04-19T14:53:32Z",
    "arxiv_id": "http://arxiv.org/abs/2104.09364v4",
    "download_url": "https://arxiv.org/abs/2104.09364v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Clustering for Cybersecurity",
    "abstract": "In this study, we develop a novel quantum machine learning (QML) framework to analyze cybersecurity vulnerabilities using data from the 2022 CISA Known Exploited Vulnerabilities catalog, which includes detailed information on vulnerability types, severity levels, common vulnerability scoring system (CVSS) scores, and product specifics. Our framework preprocesses this data into a quantum-compatible format, enabling clustering analysis through our advanced quantum techniques, QCSWAPK-means and QkernelK-means. These quantum algorithms demonstrate superior performance compared to state-of-the-art classical clustering techniques like k-means and spectral clustering, achieving Silhouette scores of 0.491, Davies-Bouldin indices below 0.745, and Calinski-Harabasz scores exceeding 884, indicating more distinct and well-separated clusters. Our framework categorizes vulnerabilities into distinct groups, reflecting varying levels of risk severity: Cluster 0, primarily consisting of critical Microsoft-related vulnerabilities; Cluster 1, featuring medium severity vulnerabilities from various enterprise software vendors and network solutions; Cluster 2, with high severity vulnerabilities from Adobe, Cisco, and Google; and Cluster 3, encompassing vulnerabilities from Microsoft and Oracle with high to medium severity. These findings highlight the potential of QML to enhance the precision of vulnerability assessments and prioritization, advancing cybersecurity practices by enabling more strategic and proactive defense mechanisms.",
    "authors": [
      "Walid El Maouaki",
      "Nouhaila Innan",
      "Alberto Marchisio",
      "Taoufik Said",
      "Mohamed Bennai",
      "Muhammad Shafique"
    ],
    "publication_date": "2024-08-05T08:48:03Z",
    "arxiv_id": "http://arxiv.org/abs/2408.02314v1",
    "download_url": "https://arxiv.org/abs/2408.02314v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Learning Theory Beyond Batch Binary Classification",
    "abstract": "Arunachalam and de Wolf (2018) showed that the sample complexity of quantum batch learning of boolean functions, in the realizable and agnostic settings, has the same form and order as the corresponding classical sample complexities. In this paper, we extend this, ostensibly surprising, message to batch multiclass learning, online boolean learning, and online multiclass learning. For our online learning results, we first consider an adaptive adversary variant of the classical model of Dawid and Tewari (2022). Then, we introduce the first (to the best of our knowledge) model of online learning with quantum examples.",
    "authors": [
      "Preetham Mohan",
      "Ambuj Tewari"
    ],
    "publication_date": "2023-02-15T00:22:44Z",
    "arxiv_id": "http://arxiv.org/abs/2302.07409v5",
    "download_url": "https://arxiv.org/abs/2302.07409v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards detecting traces of non-contact quantum friction in the corrections of the accumulated geometric phase",
    "abstract": "The geometric phase can be used as a fruitful venue of investigation to infer features of the quantum systems. Its application can reach new theoretical frontiers and imply innovative and challenging experimental proposals. Herein, we take advantage of the geometric phase to sense the corrections induced while a neutral particle travels at constant velocity in front of an imperfect sheet in quantum vacuum. As it is already known, two bodies in relative motion at constant velocity experience a quantum contactless dissipative force, known as quantum friction. This force has eluded experimental detection so far due to its small magnitude and short range. However, we give details of an innovative experiment designed to track traces of the quantum friction by measuring the velocity dependence of corrections to the geometric phase. We notice that the environmentally induced corrections can be decomposed in different contributions: corrections induced by the presence of the dielectric sheet and the motion of the particle in quantum vacuum. As the geometric phase accumulates over time, its correction becomes relevant at a relative short timescale, while the system still preserves purity. The experimentally viable scheme presented would be the first one in tracking traces of quantum friction through the study of decoherence effects on a NV center in diamond.",
    "authors": [
      "M. Belén Farías",
      "Fernando C. Lombardo",
      "Alejandro Soba",
      "Paula I. Villar",
      "Ricardo S. Decca"
    ],
    "publication_date": "2019-12-11T18:23:06Z",
    "arxiv_id": "http://arxiv.org/abs/1912.05513v2",
    "download_url": "https://arxiv.org/abs/1912.05513v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum and classical areas of black hole thermodynamics",
    "abstract": "Most calculations of black hole entropy in loop quantum gravity indicate a term proportional to the area eigenvalue A with a correction involving the logarithm of A. This violates the additivity of the entropy. An entropy proportional to A, with a correction term involving the logarithm of the classical area k, which is consistent with the additivity of entropy, is derived in both U(1) and SU(2) formulations.",
    "authors": [
      "A. Ghosh",
      "P. Mitra"
    ],
    "publication_date": "2015-06-23T12:11:38Z",
    "arxiv_id": "http://arxiv.org/abs/1506.08068v1",
    "download_url": "https://arxiv.org/abs/1506.08068v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "One-dimensional continuous-time quantum walks",
    "abstract": "We survey the equations of continuous-time quantum walks on simple one-dimensional lattices, which include the finite and infinite lines and the finite cycle, and compare them with the classical continuous-time Markov chains. The focus of our expository article is on analyzing these processes using the Laplace transform on the stochastic recurrences. The resulting time evolution equations, classical versus quantum, are strikingly similar in form, although dissimilar in behavior. We also provide comparisons with analyses performed using spectral methods.",
    "authors": [
      "D. ben-Avraham",
      "E. Bollt",
      "C. Tamon"
    ],
    "publication_date": "2004-09-20T18:00:19Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0409514v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0409514v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Experimental demonstration of quantum walks with initial superposition states",
    "abstract": "The preparation of initial superposition states of discrete-time quantum walks (DTQWs) are necessary for the study and applications of DTQWs. In linear optics, it is easy to prepare initial superposition states of the coin, which are always encoded by polarization states; while the preparation of superposition states of the walker is challenging. Based on a novel encoding method, we here propose a DTQW protocol in linear optics which enables the preparation of arbitrary initial superposition states of the walker and the coin. With this protocol, we report an experimental demonstration of DTQW with the walker initially in superposition states, by using only passive linear-optical elements. The effects of the walker's different initial superposition states on the spread speed of the DTQW and on the entanglement between the coin and the walker are also experimentally investigated, which have not been reported before. When the walker starts with superposition states, we show that the properties of DTQW are very different from those of DTQW starting with a single position. Our findings reveal different properties of DTQW and paves an avenue to study DTQW with arbitrary initial states. Moreover, the encoding method enables one to encode an arbitrary high-dimensional quantum state using a single physical qubit and may be adopted to implement other quantum information tasks.",
    "authors": [
      "Qi-Ping Su",
      "Yu Zhang",
      "Li Yu",
      "Jia-Qi Zhou",
      "Jin-Shuang Jin",
      "Xiao-Qiang Xu",
      "Shao-Jie Xiong",
      "QingJun Xu",
      "Zhe Sun",
      "Kefei Chen",
      "Franco Nori",
      "Chui-Ping Yang"
    ],
    "publication_date": "2018-05-24T17:05:22Z",
    "arxiv_id": "http://arxiv.org/abs/1805.09784v3",
    "download_url": "https://arxiv.org/abs/1805.09784v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolutionarily Stable Sets in Quantum Penny Flip Games",
    "abstract": "In game theory, an Evolutionarily Stable Set (ES set) is a set of Nash Equilibrium (NE) strategies that give the same payoffs. Similar to an Evolutionarily Stable Strategy (ES strategy), an ES set is also a strict NE. This work investigates the evolutionary stability of classical and quantum strategies in the quantum penny flip games. In particular, we developed an evolutionary game theory model to conduct a series of simulations where a population of mixed classical strategies from the ES set of the game were invaded by quantum strategies. We found that when only one of the two players' mixed classical strategies were invaded, the results were different. In one case, due to the interference phenomenon of superposition, quantum strategies provided more payoff, hence successfully replaced the mixed classical strategies in the ES set. In the other case, the mixed classical strategies were able to sustain the invasion of quantum strategies and remained in the ES set. Moreover, when both players' mixed classical strategies were invaded by quantum strategies, a new quantum ES set emerged. The strategies in the quantum ES set give both players payoff 0, which is the same as the payoff of the strategies in the mixed classical ES set of this game.",
    "authors": [
      "Tina Yu",
      "Radel Ben-Av"
    ],
    "publication_date": "2012-11-30T11:00:15Z",
    "arxiv_id": "http://arxiv.org/abs/1211.7210v1",
    "download_url": "https://arxiv.org/abs/1211.7210v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Homodyne Detection Quadrature Phase Shift Keying Continuous-Variable Quantum Key Distribution with High Excess Noise Tolerance",
    "abstract": "Discrete-modulated continuous-variable quantum key distribution with homodyne detection is widely recognized for its ease of implementation, efficiency with respect to error correction, and its compatibility with modern optical communication devices. However, recent studies report that the application of homodyne detection obtains poor tolerance to excess noise and insufficient transmission distance, hence seriously restricting the large-scale deployment of quantum secure communication networks. In this paper, we propose a homodyne detection protocol using the quadrature phase shift keying technique. By limiting information leakage, our proposed protocol enhances excess noise tolerance to a high level. Furthermore, we demonstrate that homodyne detection performs better than heterodyne detection in quaternary-modulated continuous-variable quantum key distribution under the untrusted detector noise scenario. The security is analyzed using the tight numerical method against collective attacks in the asymptotic regime. Our results imply that the current protocol is able to distribute keys in nearly intercity area and thus paves the way for constructing low-cost quantum secure communication networks.",
    "authors": [
      "Wen-Bo Liu",
      "Chen-Long Li",
      "Yuan-Mei Xie",
      "Chen-Xun Weng",
      "Jie Gu",
      "Xiao-Yu Cao",
      "Yu-Shuo Lu",
      "Bing-Hong Li",
      "Hua-Lei Yin",
      "Zeng-Bing Chen"
    ],
    "publication_date": "2021-04-22T16:10:35Z",
    "arxiv_id": "http://arxiv.org/abs/2104.11152v4",
    "download_url": "https://arxiv.org/abs/2104.11152v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ultrastrong coupling, nonselective measurement and quantum Zeno dynamics",
    "abstract": "We study the dynamics of an open quantum system linearly coupled to a bosonic reservoir. We show that, in the ultrastrong coupling limit, the system undergoes a nonselective measurement and then evolves unitarily according to an effective Zeno Hamiltonian. This dynamical process is largely independent of the reservoir state. We examine the entanglement breaking effect of the ultrastrong coupling on the system. We also derive the evolution equation for systems in contact with several reservoirs when one coupling is ultrastrong. The effective system dynamics displays a rich structure and, contrarily to the single reservoir case, it is generally non-Markovian. Our approach is based on a Dyson series expansion, in which we can take the ultrastrong limit termwise, and a subsequent resummation of the series. Our derivation is mathematically rigorous and uncomplicated.",
    "authors": [
      "Stefano Marcantoni",
      "Marco Merkli"
    ],
    "publication_date": "2024-11-11T09:24:52Z",
    "arxiv_id": "http://arxiv.org/abs/2411.06817v2",
    "download_url": "https://arxiv.org/abs/2411.06817v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuous-time quantum error correction",
    "abstract": "Continuous-time quantum error correction (CTQEC) is an approach to protecting quantum information from noise in which both the noise and the error correcting operations are treated as processes that are continuous in time. This chapter investigates CTQEC based on continuous weak measurements and feedback from the point of view of the subsystem principle, which states that protected quantum information is contained in a subsystem of the Hilbert space. We study how to approach the problem of constructing CTQEC protocols by looking at the evolution of the state of the system in an encoded basis in which the subsystem containing the protected information is explicit. This point of view allows us to reduce the problem to that of protecting a known state, and to design CTQEC procedures from protocols for the protection of a single qubit. We show how previously studied CTQEC schemes with both direct and indirect feedback can be obtained from strategies for the protection of a single qubit via weak measurements and weak unitary operations. We also review results on the performance of CTQEC with direct feedback in cases of Markovian and non-Markovian decoherence, where we have shown that due to the existence of a Zeno regime in non-Markovian dynamics, the performance of CTQEC can exhibit a quadratic improvement if the time resolution of the weak error-correcting operations is high enough to reveal the non-Markovian character of the noise process.",
    "authors": [
      "Ognyan Oreshkov"
    ],
    "publication_date": "2013-11-11T16:34:10Z",
    "arxiv_id": "http://arxiv.org/abs/1311.2485v2",
    "download_url": "https://arxiv.org/abs/1311.2485v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A game of quantum advantage: linking verification and simulation",
    "abstract": "We present a formalism that captures the process of proving quantum superiority to skeptics as an interactive game between two agents, supervised by a referee. Bob, is sampling from a classical distribution on a quantum device that is supposed to demonstrate a quantum advantage. The other player, the skeptical Alice, is then allowed to propose mock distributions supposed to reproduce Bob's device's statistics. He then needs to provide witness functions to prove that Alice's proposed mock distributions cannot properly approximate his device. Within this framework, we establish three results. First, for random quantum circuits, Bob being able to efficiently distinguish his distribution from Alice's implies efficient approximate simulation of the distribution. Secondly, finding a polynomial time function to distinguish the output of random circuits from the uniform distribution can also spoof the heavy output generation problem in polynomial time. This pinpoints that exponential resources may be unavoidable for even the most basic verification tasks in the setting of random quantum circuits. Beyond this setting, by employing strong data processing inequalities, our framework allows us to analyse the effect of noise on classical simulability and verification of more general near-term quantum advantage proposals.",
    "authors": [
      "Daniel Stilck França",
      "Raul Garcia-Patron"
    ],
    "publication_date": "2020-11-24T15:51:33Z",
    "arxiv_id": "http://arxiv.org/abs/2011.12173v2",
    "download_url": "https://arxiv.org/abs/2011.12173v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Robust Interior Point Method for Quantum Key Distribution Rate Computation",
    "abstract": "Security proof methods for quantum key distribution, QKD, that are based on the numerical key rate calculation problem, are powerful in principle. However, the practicality of the methods are limited by computational resources and the efficiency and accuracy of the underlying algorithms for convex optimization. We derive a stable reformulation of the convex nonlinear semidefinite programming, SDP, model for the key rate calculation problems. We use this to develop an efficient, accurate algorithm. The stable reformulation is based on novel forms of facial reduction, FR, for both the linear constraints and nonlinear quantum relative entropy objective function. This allows for a Gauss-Newton type interior-point approach that avoids the need for perturbations to obtain strict feasibility, a technique currently used in the literature. The result is high accuracy solutions with theoretically proven lower bounds for the original QKD from the FR stable reformulation. This provides novel contributions for FR for general SDP. We report on empirical results that dramatically improve on speed and accuracy, as well as solving previously intractable problems.",
    "authors": [
      "Hao Hu",
      "Jiyoung Im",
      "Jie Lin",
      "Norbert Lütkenhaus",
      "Henry Wolkowicz"
    ],
    "publication_date": "2021-04-08T15:49:37Z",
    "arxiv_id": "http://arxiv.org/abs/2104.03847v2",
    "download_url": "https://arxiv.org/abs/2104.03847v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Matrix product state approximations to quantum states of low energy variance",
    "abstract": "We show how to efficiently simulate pure quantum states in one dimensional systems that have both finite energy density and vanishingly small energy fluctuations. We do so by studying the performance of a tensor network algorithm that produces matrix product states whose energy variance decreases as the bond dimension increases. Our results imply that variances as small as $\\propto 1/\\log N$ can be achieved with polynomial bond dimension. With this, we prove that there exist states with a very narrow support in the bulk of the spectrum that still have moderate entanglement entropy, in contrast with typical eigenstates that display a volume law. Our main technical tool is the Berry-Esseen theorem for spin systems, a strengthening of the central limit theorem for the energy distribution of product states. We also give a simpler proof of that theorem, together with slight improvements in the error scaling, which should be of independent interest.",
    "authors": [
      "Kshiti Sneh Rai",
      "J. Ignacio Cirac",
      "Álvaro M. Alhambra"
    ],
    "publication_date": "2023-07-11T12:10:15Z",
    "arxiv_id": "http://arxiv.org/abs/2307.05200v3",
    "download_url": "https://arxiv.org/abs/2307.05200v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Categorification of quantum symmetric pairs I",
    "abstract": "We categorify a coideal subalgebra of the quantum group of $\\mathfrak{sl}_{2r+1}$ by introducing a $2$-category à la Khovanov-Lauda-Rouquier, and show that self-dual indecomposable $1$-morphisms categorify the canonical basis of this algebra. This allows us to define a categorical action of this coideal algebra on the categories of modules over cohomology rings of partial flag varieties and on the BGG category $\\mathcal{O}$ of type B/C.",
    "authors": [
      "Huanchen Bao",
      "Peng Shan",
      "Weiqiang Wang",
      "Ben Webster"
    ],
    "publication_date": "2016-05-12T12:23:44Z",
    "arxiv_id": "http://arxiv.org/abs/1605.03780v3",
    "download_url": "https://arxiv.org/abs/1605.03780v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On supersymmetric quantum mechanics",
    "abstract": "This paper constitutes a review on N=2 fractional supersymmetric Quantum Mechanics of order k. The presentation is based on the introduction of a generalized Weyl-Heisenberg algebra W_k. It is shown how a general Hamiltonian can be associated with the algebra W_k. This general Hamiltonian covers various supersymmetrical versions of dynamical systems (Morse system, Poschl-Teller system, fractional supersymmetric oscillator of order k, etc.). The case of ordinary supersymmetric Quantum Mechanics corresponds to k=2. A connection between fractional supersymmetric Quantum Mechanics and ordinary supersymmetric Quantum Mechanics is briefly described. A realization of the algebra W_k, of the N=2 supercharges and of the corresponding Hamiltonian is given in terms of deformed-bosons and k-fermions as well as in terms of differential operators.",
    "authors": [
      "Maurice Robert Kibler",
      "Mohammed Daoud"
    ],
    "publication_date": "2004-09-25T16:14:46Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0409169v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0409169v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the missing axiom of Quantum Mechanics",
    "abstract": "The debate on the nature of quantum probabilities in relation to Quantum Non Locality has elevated Quantum Mechanics to the level of an \"Operational Epistemic Theory\". In such context the quantum superposition principle has an extraneous non epistemic nature. This leads us to seek purely operational foundations for Quantum Mechanics, from which to derive the current mathematical axiomatization based on Hilbert spaces.\n  In the present work I present a set of axioms of purely operational nature, based on a general definition of \"the experiment\", the operational/epistemic archetype of information retrieval from reality. As we will see, this starting point logically entails a series of notions [state, conditional state, local state, pure state, faithful state, instrument, propensity (i.e. \"effect\"), dynamical and informational equivalence, dynamical and informational compatibility, predictability, discriminability, programmability, locality, a-causality, rank of the state, maximally chaotic state, maximally entangled state, informationally complete propensity, etc. ], along with a set of rules (addition, convex combination, partial orderings, ...), which, far from being of quantum origin as often considered, instead constitute the universal \"syntactic manual\" of the operational/epistemic approach. The missing ingredient is, of course, the quantum superposition axiom for probability amplitudes: for this I propose some substitute candidates of purely operational/epistemic nature.",
    "authors": [
      "Giacomo Mauro D'Ariano"
    ],
    "publication_date": "2005-06-03T18:30:27Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0506034v2",
    "download_url": "https://arxiv.org/abs/quant-ph/0506034v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Violation of Bell's inequalities in a quantum realistic framework",
    "abstract": "We discuss the recently observed \"loophole free\" violation of Bell's inequalities in the framework of a physically realist view of quantum mechanics, which requires that physical properties are attributed jointly to a system, and to the context in which it is embedded. This approach is clearly different from classical realism, but it does define a meaningful \"quantum realism\" from a general philosophical point of view. Consistently with Bell test experiments, this quantum realism embeds some form of non-locality, but does not contain any action at a distance, in agreement with quantum mechanics.",
    "authors": [
      "Alexia Auffèves",
      "Philippe Grangier"
    ],
    "publication_date": "2016-01-15T15:42:19Z",
    "arxiv_id": "http://arxiv.org/abs/1601.03966v2",
    "download_url": "https://arxiv.org/abs/1601.03966v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Operational Quantum Mereology and Minimal Scrambling",
    "abstract": "In this paper we will attempt to answer the following question: what are the natural quantum subsystems which emerge out of a system's dynamical laws? To answer this question we first define generalized tensor product structures (gTPS) in terms of observables, as dual pairs of an operator subalgebra $\\cal A$ and its commutant. Second, we propose an operational criterion of minimal information scrambling at short time scales to dynamically select gTPS. In this way the emergent subsystems are those which maintain the longest informational identity. This strategy is made quantitative by defining a Gaussian scrambling rate in terms of the short-time expansion of an algebraic version of the Out of Time Order Correlation (OTOC) function i.e., the $\\cal A$-OTOC. The Gaussian scrambling rate is computed analytically for physically important cases of general division into subsystems, and is shown to have an intuitive and compelling physical interpretation in terms of minimizing the interaction strength between subsystems.",
    "authors": [
      "Paolo Zanardi",
      "Emanuel Dallas",
      "Faidon Andreadakis",
      "Seth Lloyd"
    ],
    "publication_date": "2022-12-29T15:14:38Z",
    "arxiv_id": "http://arxiv.org/abs/2212.14340v5",
    "download_url": "https://arxiv.org/abs/2212.14340v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Style-based quantum generative adversarial networks for Monte Carlo events",
    "abstract": "We propose and assess an alternative quantum generator architecture in the context of generative adversarial learning for Monte Carlo event generation, used to simulate particle physics processes at the Large Hadron Collider (LHC). We validate this methodology by implementing the quantum network on artificial data generated from known underlying distributions. The network is then applied to Monte Carlo-generated datasets of specific LHC scattering processes. The new quantum generator architecture leads to a generalization of the state-of-the-art implementations, achieving smaller Kullback-Leibler divergences even with shallow-depth networks. Moreover, the quantum generator successfully learns the underlying distribution functions even if trained with small training sample sets; this is particularly interesting for data augmentation applications. We deploy this novel methodology on two different quantum hardware architectures, trapped-ion and superconducting technologies, to test its hardware-independent viability.",
    "authors": [
      "Carlos Bravo-Prieto",
      "Julien Baglio",
      "Marco Cè",
      "Anthony Francis",
      "Dorota M. Grabowska",
      "Stefano Carrazza"
    ],
    "publication_date": "2021-10-13T18:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/2110.06933v2",
    "download_url": "https://arxiv.org/abs/2110.06933v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanics as a sociology of matter",
    "abstract": "Analogies between quantum mechanics and sociology lead to the hypothesis that quantum objects are complex products of evolution. Like biological objects they are able to receive, to work on, and to spread semantic information. In general meaning we can name it \"consciousness\". The important ability of consciousness is ability to predict future. Key words: Evolution, consciousness, information, quantum mechanics, EPR, decoherence.",
    "authors": [
      "Raoul Nakhmanson"
    ],
    "publication_date": "2003-03-26T14:07:55Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0303162v2",
    "download_url": "https://arxiv.org/abs/quant-ph/0303162v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hadamard quantum broadcast channels",
    "abstract": "We consider three different communication tasks for quantum broadcast channels, and we determine the capacity region of a Hadamard broadcast channel for these various tasks. We define a Hadamard broadcast channel to be such that the channel from the sender to one of the receivers is entanglement-breaking and the channel from the sender to the other receiver is complementary to this one. As such, this channel is a quantum generalization of a degraded broadcast channel, which is well known in classical information theory. The first communication task we consider is classical communication to both receivers, the second is quantum communication to the stronger receiver and classical communication to other, and the third is entanglement-assisted classical communication to the stronger receiver and unassisted classical communication to the other. The structure of a Hadamard broadcast channel plays a critical role in our analysis: the channel to the weaker receiver can be simulated by performing a measurement channel on the stronger receiver's system, followed by a preparation channel. As such, we can incorporate the classical output of the measurement channel as an auxiliary variable and solve all three of the above capacities for Hadamard broadcast channels, in this way avoiding known difficulties associated with quantum auxiliary variables.",
    "authors": [
      "Qingle Wang",
      "Siddhartha Das",
      "Mark M. Wilde"
    ],
    "publication_date": "2016-11-23T05:31:48Z",
    "arxiv_id": "http://arxiv.org/abs/1611.07651v3",
    "download_url": "https://arxiv.org/abs/1611.07651v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A-unital Operations and Quantum Conditional Entropy",
    "abstract": "Negative quantum conditional entropy states are key ingredients for information theoretic tasks such as superdense coding, state merging and one-way entanglement distillation. In this work, we ask: how does one detect if a channel is useful in preparing negative conditional entropy states? We answer this question by introducing the class of A-unital channels, which we show are the largest class of conditional entropy non-decreasing channels. We also prove that A-unital channels are precisely the completely free operations for the class of states with non-negative conditional entropy. Furthermore, we study the relationship between A-unital channels and other classes of channels pertinent to the resource theory of entanglement. We then prove similar results for ACVENN: a previously defined, relevant class of states and also relate the maximum and minimum conditional entropy of a state with its von Neumann entropy.\n  The definition of A-unital channels naturally lends itself to a procedure for determining membership of channels in this class. Thus, our work is valuable for the detection of resourceful channels in the context of conditional entropy.",
    "authors": [
      "Mahathi Vempati",
      "Saumya Shah",
      "Nirman Ganguly",
      "Indranil Chakrabarty"
    ],
    "publication_date": "2021-10-24T21:10:50Z",
    "arxiv_id": "http://arxiv.org/abs/2110.12527v3",
    "download_url": "https://arxiv.org/abs/2110.12527v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuous majorization in quantum phase space",
    "abstract": "We explore the role of majorization theory in quantum phase space. To this purpose, we restrict ourselves to quantum states with positive Wigner functions and show that the continuous version of majorization theory provides an elegant and very natural approach to exploring the information-theoretic properties of Wigner functions in phase space. After identifying all Gaussian pure states as equivalent in the precise sense of continuous majorization, which can be understood in light of Hudson's theorem, we conjecture a fundamental majorization relation: any positive Wigner function is majorized by the Wigner function of a Gaussian pure state (especially, the bosonic vacuum state or ground state of the harmonic oscillator). As a consequence, any Schur-concave function of the Wigner function is lower bounded by the value it takes for the vacuum state. This implies in turn that the Wigner entropy is lower bounded by its value for the vacuum state, while the converse is notably not true. Our main result is then to prove this fundamental majorization relation for a relevant subset of Wigner-positive quantum states which are mixtures of the three lowest eigenstates of the harmonic oscillator. Beyond that, the conjecture is also supported by numerical evidence. We conclude by discussing some implications of this conjecture in the context of entropic uncertainty relations in phase space.",
    "authors": [
      "Zacharie Van Herstraeten",
      "Michael G. Jabbour",
      "Nicolas J. Cerf"
    ],
    "publication_date": "2021-08-20T13:26:04Z",
    "arxiv_id": "http://arxiv.org/abs/2108.09167v2",
    "download_url": "https://arxiv.org/abs/2108.09167v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lower bound of quantum uncertainty from extractable classical information",
    "abstract": "The sum of entropic uncertainties for the measurement of two non-commuting observables is not always reduced by the amount of entanglement (quantum memory) between two parties, and in certain cases may be impacted by quantum correlations beyond entanglement (discord). An optimal lower bound of entropic uncertainty in the presence of any correlations may be determined by fine-graining. Here we express the uncertainty relation in a new form where the maximum possible reduction of uncertainty is shown to be given by the extractable classical information. We show that the lower bound of uncertainty matches with that using fine-graining for several examples of two-qubit pure and mixed entangled states, and also separable states with non-vanishing discord.\n  Using our uncertainty relation we further show that even in the absence of any quantum correlations between the two parties, the sum of uncertainties may be reduced with the help of classical correlations.",
    "authors": [
      "T. Pramanik",
      "S. Mal",
      "A. S. Majumdar"
    ],
    "publication_date": "2013-04-16T16:10:14Z",
    "arxiv_id": "http://arxiv.org/abs/1304.4506v4",
    "download_url": "https://arxiv.org/abs/1304.4506v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Probabilities of failure for quantum error correction",
    "abstract": "We investigate the performance of a quantum error-correcting code when pushed beyond its intended capacity to protect information against errors, presenting formulae for the probability of failure when the errors affect more qudits than that specified by the code's minimum distance. Such formulae provide a means to rank different codes of the same minimum distance. We consider both error detection and error correction, treating explicit examples in the case of stabilizer codes constructed from qubits and encoding a single qubit.",
    "authors": [
      "A. J. Scott"
    ],
    "publication_date": "2004-06-09T21:46:12Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0406063v3",
    "download_url": "https://arxiv.org/abs/quant-ph/0406063v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysis for satellite-based high-dimensional extended B92 and high-dimensional BB84 quantum key distribution",
    "abstract": "A systematic analysis of the advantages and challenges associated with the satellite-based implementation of the high dimensional extended B92 (HD-Ext-B92) and high-dimensional BB84 (HD-BB84) protocol is analyzed. The method used earlier for obtaining the key rate for the HD-Ext-B92 is modified here and subsequently the variations of the key rate, probability distribution of key rate (PDR), and quantum bit error rate (QBER) with respect to dimension and noise parameter of a depolarizing channel is studied using the modified key rate equation. Further, the variations of average key rate (per pulse) with zenith angle and link length in different weather conditions in day and night considering extremely low noise for dimension d=32 are investigated using elliptic beam approximation. The effectiveness of the HD-(extended) protocols used here in creating satellite-based quantum key distribution links (both up-link and down-link) is established by appropriately modeling the atmosphere and analyzing the variation of average key rates with the probability distribution of the transmittance (PDT). The analysis performed here has revealed that in higher dimensions, HD-BB84 outperforms HD-Ext-B92 in terms of both key rate and noise tolerance. However, HD-BB84 experiences a more pronounced saturation of QBER in high dimensions.",
    "authors": [
      "Arindam Dutta",
      "Muskan",
      "Subhashish Banerjee",
      "Anirban Pathak"
    ],
    "publication_date": "2023-11-01T05:42:27Z",
    "arxiv_id": "http://arxiv.org/abs/2311.00309v2",
    "download_url": "https://arxiv.org/abs/2311.00309v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Predictive Approach for Selecting the Best Quantum Solver for an Optimization Problem",
    "abstract": "Leveraging quantum computers for optimization problems holds promise across various application domains. Nevertheless, utilizing respective quantum computing solvers requires describing the optimization problem according to the Quadratic Unconstrained Binary Optimization (QUBO) formalism and selecting a proper solver for the application of interest with a reasonable setting. Both demand significant proficiency in quantum computing, QUBO formulation, and quantum solvers, a background that usually cannot be assumed by end users who are domain experts rather than quantum computing specialists. While tools aid in QUBO formulations, support for selecting the best-solving approach remains absent. This becomes even more challenging because selecting the best solver for a problem heavily depends on the problem itself. In this work, we are accepting this challenge and propose a predictive selection approach, which aids end users in this task. To this end, the solver selection task is first formulated as a classification task that is suitable to be solved by supervised machine learning. Based on that, we then propose strategies for adjusting solver parameters based on problem size and characteristics. Experimental evaluations, considering more than 500 different QUBO problems, confirm the benefits of the proposed solution. In fact, we show that in more than 70% of the cases, the best solver is selected, and in about 90% of the problems, a solver in the top two, i.e., the best or its closest suboptimum, is selected. This exploration proves the potential of machine learning in quantum solver selection and lays the foundations for its automation, broadening access to quantum optimization for a wider range of users.",
    "authors": [
      "Deborah Volpe",
      "Nils Quetschlich",
      "Mariagrazia Graziano",
      "Giovanna Turvani",
      "Robert Wille"
    ],
    "publication_date": "2024-08-07T08:14:58Z",
    "arxiv_id": "http://arxiv.org/abs/2408.03613v1",
    "download_url": "https://arxiv.org/abs/2408.03613v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Noncommutative Spacetime and Quantum Mechanics",
    "abstract": "In this paper we will analyze the the status of gauge freedom in quantum mechanics (QM) and quantum field theory (QFT). Along with this analysis comparison with ordinary QFT will be given. We will show how the gauge freedom problem is connected with the spacetime coordinates status - the very point at which the difficulties of QM begin. A natural solution of the above mentioned problem will be proposed in which we give a slightly more general form of QM and QFT (in comparison to the ordinary QFT) with noncommutative structure of spacetime playing fundamental role in it. We achieve it by reinterpretation of the Bohr's complementarity principle on the one hand and by incorporation of our gauge freedom analysis on the other. We will present a generalization of the Bargmann's theory of exponents of ray representations. It will be given an example involving time dependent gauge freedom describing non-relativistic quantum particle in nonrelativistic gravitational field. In this example we infer the most general Schroedinger equation and prove equality of the (passive) inertial and the gravitational masses of quantum particle.",
    "authors": [
      "Jaroslaw Wawrzycki"
    ],
    "publication_date": "2004-04-05T13:19:42Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0404028v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0404028v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]