[
  {
    "title": "Phase Space Formulation of Quantum Mechanics. Insight into the\n  Measurement Problem",
    "abstract": "A phase space mathematical formulation of quantum mechanical processes\naccompanied by and ontological interpretation is presented in an axiomatic\nform. The problem of quantum measurement, including that of quantum state\nfiltering, is treated in detail. Unlike standard quantum theory both quantum\nand classical measuring device can be accommodated by the present approach to\nsolve the quantum measurement problem",
    "authors": [
      "Daniela Dragoman"
    ],
    "publication_date": "2004-02-03T10:07:22Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0402021v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0402021v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Entanglement and Decoherence: Beyond Particle Models. A Farewell\n  to Quantum Mechanics's Weirdness",
    "abstract": "Combining abstract to laboratory projected quantum states a general analysis\nof headline quantum phenomena is presented. Standard representation mode is\nreplaced; instead quantum states sustained by elementary material constituents\noccupy its place. Renouncing to assign leading roles to language originated in\nclassical physics when describing genuine quantum processes, together with\nsustainment concept most, if not all weirdness associated to Quantum Mechanics\nvanishes.",
    "authors": [
      "O. Tapia"
    ],
    "publication_date": "2014-04-02T13:42:49Z",
    "arxiv_id": "http://arxiv.org/abs/1404.0552v1",
    "download_url": "http://arxiv.org/abs/1404.0552v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum diffusion as a process of linear quantum dynamics",
    "abstract": "Quantum diffusion, as developed in the 1990s, could explain how a system,\nsubject to measurement, goes into an eigenstate of the measured observable.\nHere it is shown that quantum diffusion theory can be interpreted as a result\nwithin linear relativistic quantum mechanics. Thus, in contrast to what is\nwidely believed, quantum measurement can be analyzed within the theory of\nquantum mechanics itself.",
    "authors": [
      "Karl-Erik Eriksson"
    ],
    "publication_date": "2022-03-01T16:16:17Z",
    "arxiv_id": "http://arxiv.org/abs/2203.00586v1",
    "download_url": "http://arxiv.org/abs/2203.00586v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Quantum Codes to Gravity: A Journey of Gravitizing Quantum\n  Mechanics",
    "abstract": "In this note, I review a recent approach to quantum gravity that \"gravitizes\"\nquantum mechanics by emerging geometry and gravity from complex quantum states.\nDrawing further insights from tensor network toy models in AdS/CFT, I propose\nthat approximate quantum error correction codes, when re-adapted into the\naforementioned framework, also has promise in emerging gravity in near-flat\ngeometries.",
    "authors": [
      "ChunJun Cao"
    ],
    "publication_date": "2021-12-01T00:48:17Z",
    "arxiv_id": "http://arxiv.org/abs/2112.00199v1",
    "download_url": "http://arxiv.org/abs/2112.00199v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin Glass: A Bridge between quantum computation and statistical\n  mechanics",
    "abstract": "We show two fascinating topics lying between quantum information processing\nand statistical mechanics. First, we introduce an elaborated technique, the\nsurface code, to prepare the particular quantum state with robustness against\ndecoherence. Second, we show another interesting technique to employ quantum\nnature, quantum annealing. Through both of the topics, we would shed light on\nthe birth of the interdisciplinary field between quantum mechanics and\nstatistical mechanics.",
    "authors": [
      "Masayuki Ohzeki"
    ],
    "publication_date": "2012-04-13T02:32:57Z",
    "arxiv_id": "http://arxiv.org/abs/1204.2865v3",
    "download_url": "http://arxiv.org/abs/1204.2865v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the gravitization of quantum mechanics and wave function reduction in\n  Bohmian quantum mechanics",
    "abstract": "The main topic of this paper is using Einstein's equivalence principle in the\ndescription of the gravity-induced wave function reduction in the framework of\nBohmian causal quantum theory. However, such concept has been introduced and\nexplored by Penrose for the standard quantum mechanics, but the capabilities of\nBohmian quantum mechanics makes it possible to get some of results more\nclearly. In this regard, the critical mass for transition from the quantum\nworld to the classical world, the reduction time of the wave function and the\ntemperature that corresponds to the Unruh temperature will be obtained by\napplying Einstein's equivalence principle for the quantum motion of particle.",
    "authors": [
      "Faramarz Rahmani",
      "Mehdi Golshani"
    ],
    "publication_date": "2022-09-01T14:58:35Z",
    "arxiv_id": "http://arxiv.org/abs/2209.00513v2",
    "download_url": "http://arxiv.org/abs/2209.00513v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PT - symmetrized supersymmetric quantum mechanics",
    "abstract": "Supersymmetry between bosons and fermions is modeled within PT- symmetric\nquantum mechanics. A non-Hermitian alternative to the Witten's supersymmetric\nquantum mechanics is obtained.",
    "authors": [
      "Miloslav Znojil"
    ],
    "publication_date": "2001-01-04T13:25:46Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/0101038v1",
    "download_url": "http://arxiv.org/abs/hep-ph/0101038v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Berry's phase in noncommutative spaces",
    "abstract": "We introduce the perturbative aspects of noncommutative quantum mechanics.\nThen we study the Berry's phase in the framework of noncommutative quantum\nmechanics. The results show deviations from the usual quantum mechanics which\ndepend on the parameter of space/space noncommtativity.",
    "authors": [
      "S. A. Alavi"
    ],
    "publication_date": "2002-08-14T11:02:33Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/0208098v1",
    "download_url": "http://arxiv.org/abs/hep-th/0208098v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Mechanical Description of Fluid Dynamics",
    "abstract": "In this paper, we deal with fluid motion in terms of quantum mechanics.\nMechanism accounting for the appearance of quantum behavior is discussed.",
    "authors": [
      "H. Y. Cui"
    ],
    "publication_date": "2001-03-08T14:24:54Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0103019v2",
    "download_url": "http://arxiv.org/abs/physics/0103019v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Mechanics and Black Holes",
    "abstract": "This paper discusses the existence of black holes from the foundations of\nquantum mechanics. It is found that quantum mechanics rule out a possible\ngravitational collapse.",
    "authors": [
      "Jose N. Pecina-Cruz"
    ],
    "publication_date": "2005-11-11T07:02:38Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0511099v3",
    "download_url": "http://arxiv.org/abs/physics/0511099v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "No contradictions between Bohmian and quantum mechanics",
    "abstract": "Two recent claims by A. Neumaier (quant-ph/0001011) and P. Ghose\n(quant-ph/0001024) that Bohmian mechanics is incompatible with quantum\nmechanics for correlations involving time are shown to be unfounded.",
    "authors": [
      "Louis Marchildon"
    ],
    "publication_date": "2000-07-19T17:48:42Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0007068v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0007068v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanics: last stop for reductionism",
    "abstract": "The state space of a homogeneous body is derived under two different\nassumptions: infinitesimal reducibility and irreducibility. The first\nassumption leads to a real vector space, used in classical mechanics, while the\nsecond one leads to a complex vector space, used in quantum mechanics.",
    "authors": [
      "Gabriele Carcassi"
    ],
    "publication_date": "2012-03-16T14:58:24Z",
    "arxiv_id": "http://arxiv.org/abs/1203.3726v1",
    "download_url": "http://arxiv.org/abs/1203.3726v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Equivalence Principle of Quantum Mechanics",
    "abstract": "A recent concept in theoretical physics, motivated in string duality and\nM-theory, is the notion that not all quantum theories arise from quantising a\nclassical system. Also, a given quantum model may possess more than just one\nclassical limit. In view of these developments, we analyse some general\nproperties that quantum mechanics must satisfy, if it is not to be formulated\nas a quantisation of a given classical mechanics. Instead, our approach to\nquantum mechanics is modelled on a statement that is close in spirit to the\nequivalence principle of general relativity, thus bearing a strong resemblance\nwith the equivalence principle of quantum mechanics formulated by\nFaraggi-Matone.",
    "authors": [
      "J. M. Isidro"
    ],
    "publication_date": "2001-05-03T13:06:16Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0105012v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0105012v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "What Connects Different Interpretations of Quantum Mechanics?",
    "abstract": "We investigate the idea that different interpretations of quantum mechanics\ncan be seen as restrictions of the consistent (or decoherent) histories quantum\nmechanics of closed systems to particular classes of histories,together with\nthe approximations and descriptions of these histories that the restrictions\npermit. (Talk at the the workshop Quo Vadis Quantum Mechanics, Center for\nFrontier Sciences, Temple University, Philadelphia, PA, September 24--27,\n2002.)",
    "authors": [
      "James B. Hartle"
    ],
    "publication_date": "2003-05-15T23:19:30Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0305089v2",
    "download_url": "http://arxiv.org/abs/quant-ph/0305089v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Orthodox Quantum Mechanics Free from Paradoxes",
    "abstract": "A formulation of quantum mechanics based on an operational definition of\nstate is presented. This formulation, which includes explicitly the macroscopic\nsystems, assumes the probabilistic interpretation and is nevertheless\nobjective. The classical paradoxes of quantum mechanics are analyzed and their\norigin is found to be the fictitious properties that are usually attributed to\nquantum-mechanical states. The hypothesis that any mixed state can always be\nconsidered as an incoherent superposition of pure states is found to contradict\nquantum mechanics. A solution of EPR paradox is proposed. It is shown that\nentanglement of quantum states is compatible with realism and locality of\nevents, but implies non-local encoding of information.",
    "authors": [
      "Rodrigo Medina"
    ],
    "publication_date": "2005-08-02T02:28:38Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0508014v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0508014v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Background Independent Quantum Mechanics, Classical Geometric Forms and\n  Geometric Quantum Mechanics-I",
    "abstract": "The geometry of the symplectic structures and Fubini-Study metric is\ndiscussed. Discussion in the paper addresses geometry of Quantum Mechanics in\nthe classical phase space. Also, geometry of Quantum Mechanics in the\nprojective Hilbert space has been discussed for the chosen Quantum states.\nSince the theory of classical gravity is basically geometric in nature and\nQuantum Mechanics is in no way devoid of geometry, the explorations pertaining\nto more and more geometry in Quantum Mechanics could prove to be valuable for\nlarger objectives such as understanding of gravity.",
    "authors": [
      "Aalok Pandya"
    ],
    "publication_date": "2008-09-08T14:55:48Z",
    "arxiv_id": "http://arxiv.org/abs/0809.1351v1",
    "download_url": "http://arxiv.org/abs/0809.1351v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Semi-classical limit and minimum decoherence in the Conditional\n  Probability Interpretation of Quantum Mechanics",
    "abstract": "The Conditional Probability Interpretation of Quantum Mechanics replaces the\nabstract notion of time used in standard Quantum Mechanics by the time that can\nbe read off from a physical clock. The use of physical clocks leads to apparent\nnon-unitary and decoherence. Here we show that a close approximation to\nstandard Quantum Mechanics can be recovered from conditional Quantum Mechanics\nfor semi-classical clocks, and we use these clocks to compute the minimum\ndecoherence predicted by the Conditional Probability Interpretation.",
    "authors": [
      "Vincent Corbin",
      "Neil J. Cornish"
    ],
    "publication_date": "2008-11-17T22:49:50Z",
    "arxiv_id": "http://arxiv.org/abs/0811.2814v2",
    "download_url": "http://arxiv.org/abs/0811.2814v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "One flight over the quantum chromodynamics. Part Two: Quantum Mechanics",
    "abstract": "This is the second of a series of popular lectures on quantum chromodynamics.\nThe first (introductory) lecture can be found here:\nhttps://scfh.ru/blogs/O_fizike_i_fizikah/polet-nad-kvantovoy-khromodinamikoy/\nThe lecture deals with the one of the main pillars of quantum chromodynamics\n--- quantum mechanics . Non-physicists usually consider quantum mechanics as an\nextremely weird subject far from the everyday common sense. Partly this is\ntrue. However we will try to argue in this lecture that in its essence quantum\nmechanics is, in a some sense, even more natural than classical mechanics, and\nit is not so far from the common sense as a layman usually assumes.",
    "authors": [
      "Z. K. Silagadze"
    ],
    "publication_date": "2018-11-08T14:14:33Z",
    "arxiv_id": "http://arxiv.org/abs/1811.03428v1",
    "download_url": "http://arxiv.org/abs/1811.03428v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanics as a noncommutative representation of classical\n  conditional probabilities",
    "abstract": "The aim of this paper is to analyze the reconstructability of quantum\nmechanics from classical conditional probabilities representing measurement\noutcomes conditioned on measurement choices. We will investigate how the\nquantum mechanical representation of classical conditional probabilities is\nsituated within the broader frame of noncommutative representations. To this\ngoal, we adopt some parts of the quantum formalism and ask whether empirical\ndata can constrain the rest of the representation to conform to quantum\nmechanics. We will show that as the set of empirical data grows conventional\nelements in the representation gradually shrink and the noncommutative\nrepresentations narrow down to the unique quantum mechanical representation.",
    "authors": [
      "Gábor Hofer-Szabó"
    ],
    "publication_date": "2019-06-12T06:05:28Z",
    "arxiv_id": "http://arxiv.org/abs/1906.04955v1",
    "download_url": "http://arxiv.org/abs/1906.04955v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Validation and Administration of a Conceptual Survey on the Formalism\n  and Postulates of Quantum Mechanics",
    "abstract": "We developed and validated a conceptual survey that focuses on the formalism\nand postulates of quantum mechanics covered in upper-level undergraduate\nquantum mechanics courses. The concepts included in the Quantum Mechanics\nFormalism and Postulate Survey (QMFPS) focus on Dirac notation, the Hilbert\nspace, state vectors, physical observables and their corresponding Hermitian\noperators, compatible and incompatible observables, quantum measurement,\ntime-dependence of quantum states and expectation values, and spin angular\nmomenta. Here we describe the validation and administration of the survey,\nwhich has been administered to over 400 upper-level undergraduate and graduate\nstudents from six institutions. The QMFPS is valid and reliable for use as a\nlow-stakes test to measure the effectiveness of instruction in an undergraduate\nquantum mechanics course that covers relevant content. The survey can also be\nused by instructors to identify student understanding of the formalism and\npostulates of quantum mechanics at the beginning and end of a graduate quantum\nmechanics course since graduate students are expected to have taken an\nundergraduate quantum mechanics course that covers the content included in the\nsurvey. We found that undergraduate students who engaged with\nresearch-validated learning tools performed better than students who did not on\nthe QMFPS after the first semester of a junior/senior level quantum mechanics\ncourse. In addition, the performance of graduate students on QMFPS after\ninstruction in the first semester of a core graduate-level quantum mechanics\ncourse was significantly better than the performance of undergraduate students\nat the end of the first semester of an undergraduate quantum mechanics course.\nA comparison with the base line data on the validated QMFPS presented here can\naid instructors in assessing the effectiveness of their instructional\napproaches.",
    "authors": [
      "Emily Marshman",
      "Chandralekha Singh"
    ],
    "publication_date": "2020-06-07T03:05:15Z",
    "arxiv_id": "http://arxiv.org/abs/2006.04030v1",
    "download_url": "http://arxiv.org/abs/2006.04030v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Correlations and Work Statistics in Critical Quantum Systems",
    "abstract": "In this dissertation, we analyze equilibrium and out-of-equilibrium quantum\nphase transitions present in quantum spin-$\\frac{1}{2}$ models, using a quantum\ninformation approach through quantum correlations and phase space formalism,\nand a quantum thermodynamic approach through the work statistics formalism.",
    "authors": [
      "Zakaria Mzaouali"
    ],
    "publication_date": "2022-03-29T12:06:39Z",
    "arxiv_id": "http://arxiv.org/abs/2203.15464v1",
    "download_url": "http://arxiv.org/abs/2203.15464v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comments on some recently proposed experiments that should distinguish\n  Bohmian mechanics from quantum mechanics",
    "abstract": "Recently Ghose (quant-ph/0001024,quant-ph/0003037,quant-ph/0103126) and\nGolshani and Akhavan (quant-ph/0009040,quant-ph/0103100,quant-ph/0103101)\nclaimed to have found experiments that should be able to distinguish between\nStandard Quantum Mechanics and Bohmian Mechanics. It is our aim to show that\nthe claims made by Ghose, Golshani and Akhavan are unfounded.",
    "authors": [
      "W. Struyve",
      "W. De Baere"
    ],
    "publication_date": "2001-08-08T16:00:44Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0108038v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0108038v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fractional Quantum Mechanics",
    "abstract": "A path integral approach to quantum physics has been developed. Fractional\npath integrals over the paths of the L\\'evy flights are defined. It is shown\nthat if the fractality of the Brownian trajectories leads to standard quantum\nand statistical mechanics, then the fractality of the L\\'evy paths leads to\nfractional quantum mechanics and fractional statistical mechanics. The\nfractional quantum and statistical mechanics have been developed via our\nfractional path integral approach. A fractional generalization of the\nSchr\\\"odinger equation has been found. A relationship between the energy and\nthe momentum of the nonrelativistic quantum-mechanical particle has been\nestablished. The equation for the fractional plane wave function has been\nobtained. We have derived a free particle quantum-mechanical kernel using Fox's\nH function. A fractional generalization of the Heisenberg uncertainty relation\nhas been established. Fractional statistical mechanics has been developed via\nthe path integral approach. A fractional generalization of the motion equation\nfor the density matrix has been found. The density matrix of a free particle\nhas been expressed in terms of the Fox's H function. We also discuss the\nrelationships between fractional and the well-known Feynman path integral\napproaches to quantum and statistical mechanics.",
    "authors": [
      "Nick Laskin"
    ],
    "publication_date": "2008-11-11T20:40:31Z",
    "arxiv_id": "http://arxiv.org/abs/0811.1769v1",
    "download_url": "http://arxiv.org/abs/0811.1769v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Improving Students' Understanding of Quantum Mechanics by Using Peer\n  Instruction Tools",
    "abstract": "Quantum mechanics is a challenging subject, even for advanced undergraduate\nand graduate students. Here, we discuss the development and evaluation of\nresearch-based concept tests for peer instruction as a formative assessment\ntool in quantum mechanics (QM) courses. The preliminary evaluations show that\nthese tools are effective in helping students develop a good grasp of quantum\nmechanics.",
    "authors": [
      "Chandralekha Singh",
      "Guangtian Zhu"
    ],
    "publication_date": "2016-02-17T16:03:43Z",
    "arxiv_id": "http://arxiv.org/abs/1602.05461v1",
    "download_url": "http://arxiv.org/abs/1602.05461v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Three theorems of quantum mechanics and their classical counterparts",
    "abstract": "The Hellmann-Feynman, virial and comparison theorems are three fundamental\ntheorems of quantum mechanics. For the first two, counterparts exist for\nclassical mechanics with relativistic or nonrelativistic kinetic energy. It is\nshown here that these three theorems are valid for classical mechanics with a\nnonstandard kinetic energy. This brings some information about the connections\nbetween the quantum and classical worlds. Constraints about the functional form\nof the kinetic energy are also discussed.",
    "authors": [
      "Claude Semay"
    ],
    "publication_date": "2018-03-24T10:34:46Z",
    "arxiv_id": "http://arxiv.org/abs/1803.09088v1",
    "download_url": "http://arxiv.org/abs/1803.09088v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanics without spacetime - a possible case for noncommutative\n  differential geometry?",
    "abstract": "The rules of quantum mechanics require a time coordinate for their\nformulation. However, a notion of time is in general possible only when a\nclassical spacetime geometry exists. Such a geometry is itself produced by\nclassical matter sources. Thus it could be said that the currently known\nformulation of quantum mechanics pre-assumes the presence of classical matter\nfields. A more fundamental formulation of quantum mechanics should exist, which\navoids having to use a notion of time. In this paper we discuss as to how such\na fundamental formulation could be constructed for single particle,\nnon-relativistic quantum mechanics. We argue that there is an underlying\nnon-linear theory of quantum gravity, to which both standard quantum mechanics\nand classical general relativity are approximations. The timeless formulation\nof quantum mechanics follows from the underlying theory when the mass of the\nparticle is much smaller than Planck mass. On the other hand, when the\nparticle's mass is much larger than Planck mass, spacetime emerges and the\nunderlying theory should reduce to classical mechanics and general relativity.\nWe also suggest that noncommutative differential geometry is a possible\ncandidate for describing this underlying theory.",
    "authors": [
      "T. P. Singh"
    ],
    "publication_date": "2001-12-20T06:35:41Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0112119v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0112119v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric formulation of quantum mechanics",
    "abstract": "Quantum mechanics is among the most important and successful mathematical\nmodel for describing our physical reality. The traditional formulation of\nquantum mechanics is linear and algebraic. In contrast classical mechanics is a\ngeometrical and non-linear theory that is defined on a symplectic manifold.\nHowever, after invention of general relativity, we are convinced that geometry\nis physical and effect us in all scale. Hence the geometric formulation of\nquantum mechanics sought to give a unified picture of physical systems based on\nits underling geometrical structures, e.g., now, the states are represented by\npoints of a symplectic manifold with a compatible Riemannian metric, the\nobservables are real-valued functions on the manifold, and the quantum\nevolution is governed by a symplectic flow that is generated by a Hamiltonian\nfunction. In this work we will give a compact introduction to main ideas of\ngeometric formulation of quantum mechanics. We will provide the reader with the\ndetails of geometrical structures of both pure and mixed quantum states. We\nwill also discuss and review some important applications of geometric quantum\nmechanics.",
    "authors": [
      "Hoshang Heydari"
    ],
    "publication_date": "2015-03-01T08:38:35Z",
    "arxiv_id": "http://arxiv.org/abs/1503.00238v2",
    "download_url": "http://arxiv.org/abs/1503.00238v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classical Mechanics as an Emergent Compression of Quantum Information",
    "abstract": "The correspondence principle states that classical mechanics emerges from\nquantum mechanics in the appropriate limits. However, beyond this heuristic\nrule, an information-theoretic perspective reveals that classical mechanics is\na compressed, lower-information representation of quantum reality. Quantum\nmechanics encodes significantly more information through superposition,\nentanglement, and phase coherence, which are lost due to decoherence, phase\naveraging, and measurement, reducing the system to a classical probability\ndistribution. This transition is quantified using Kolmogorov complexity, where\nclassical systems require \\( O(N) \\) bits of information, while quantum\ndescriptions require \\( O(2^N) \\), showing an exponential reduction in\ncomplexity. Further justification comes from Ehrenfest's theorem, which ensures\nthat quantum expectation values obey Newton's laws, and path integral\nsuppression, which eliminates non-classical trajectories when \\( S \\gg \\hbar\n\\). Thus, rather than viewing quantum mechanics as an extension of classical\nmechanics, we argue that classical mechanics is a lossy, computationally\nreduced encoding of quantum physics, emerging from a systematic loss of quantum\ncorrelations.",
    "authors": [
      "Krzysztof Sienicki"
    ],
    "publication_date": "2025-03-09T00:51:55Z",
    "arxiv_id": "http://arxiv.org/abs/2503.07666v1",
    "download_url": "http://arxiv.org/abs/2503.07666v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time in quantum mechanics: A fresh look on quantum hydrodynamics and\n  quantum trajectories",
    "abstract": "Quantum hydrodynamics is a formulation of quantum mechanics based on the\nprobability density and flux (current) density of a quantum system. It can be\nused to define trajectories which allow for a particle-based interpretation of\nquantum mechanics, commonly known as Bohmian mechanics. However, quantum\nhydrodynamics rests on the usual time-dependent formulation of quantum\nmechanics where time appears as a parameter. This parameter describes the\ncorrelation of the state of the quantum system with an external system -- a\nclock -- which behaves according to classical mechanics. With the Exact\nFactorization of a quantum system into a marginal and a conditional system,\nquantum mechanics and hence quantum hydrodynamics can be generalized for\nquantum clocks. In this article, the theory is developed and it is shown that\ntrajectories for the quantum system can still be defined, and that these\ntrajectories depend conditionally on the trajectory of the clock. Such\ntrajectories are not only interesting from a fundamental point of view, but\nthey can also find practical applications whenever a dynamics relative to an\nexternal time parameter is composed of \"fast\" and \"slow\" degrees of freedom and\nthe interest is in the fast ones, while quantum effects of the slow ones (like\na branching of the wavepacket) cannot be neglected. As an illustration, time-\nand clock-dependent trajectories are calculated for a model system of a\nnon-adiabatic dynamics, where an electron is the quantum system, a nucleus is\nthe quantum clock, and an external time parameter is provided, e.g. via an\ninteraction with a laser field that is not treated explicitly.",
    "authors": [
      "Axel Schild"
    ],
    "publication_date": "2019-11-29T10:12:51Z",
    "arxiv_id": "http://arxiv.org/abs/1911.13033v1",
    "download_url": "http://arxiv.org/abs/1911.13033v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Mechanics as an Approximation to Classical Mechanics in Hilbert\n  Space",
    "abstract": "Classical mechanics is formulated in complex Hilbert space with the\nintroduction of a commutative product of operators, an antisymmetric bracket,\nand a quasidensity operator. These are analogues of the star product, the Moyal\nbracket, and the Wigner function in the phase space formulation of quantum\nmechanics. Classical mechanics can now be viewed as a deformation of quantum\nmechanics. The forms of semiquantum approximations to classical mechanics are\nindicated.",
    "authors": [
      "A. J. Bracken"
    ],
    "publication_date": "2002-10-24T04:42:13Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0210164v2",
    "download_url": "http://arxiv.org/abs/quant-ph/0210164v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Cbits to Qbits: Teaching computer scientists quantum mechanics",
    "abstract": "A strategy is suggested for teaching mathematically literate students, with\nno background in physics, just enough quantum mechanics for them to understand\nand develop algorithms in quantum computation and quantum information theory.\nAlthough the article as a whole addresses teachers of physics, well versed in\nquantum mechanics, the central pedagogical development is addressed directly to\ncomputer scientists and mathematicians, with only occasional asides to their\nteacher. Physicists uninterested in quantum pedagogy may be amused (or\nirritated) by some of the views of standard quantum mechanics that arise\nnaturally from this unorthodox perspective.",
    "authors": [
      "N. David Mermin"
    ],
    "publication_date": "2002-07-19T16:15:09Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0207118v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0207118v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Mechanics interpreted in Quantum Real Numbers",
    "abstract": "The concept of number is fundamental to the formulation of any physical\ntheory. We give a heuristic motivation for the reformulation of Quantum\nMechanics in terms of non-standard real numbers called Quantum Real Numbers.\nThe standard axioms of quantum mechanics are re-interpreted. Our aim is to show\nthat, when formulated in the language of quantum real numbers, the laws of\nquantum mechanics appear more natural, less counterintuitive than when they are\npresented in terms of standard numbers.",
    "authors": [
      "John V Corbett",
      "Thomas Durt"
    ],
    "publication_date": "2002-11-27T13:22:23Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0211180v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0211180v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding Quantum Entanglement: Qubits, Rebits and the Quaternionic\n  Approach",
    "abstract": "It has been recently pointed out by Caves, Fuchs, and Rungta that real\nquantum mechanics (that is, quantum mechanics defined over real vector spaces\nprovides an interesting foil theory whose study may shed some light on just\nwhich particular aspects of quantum entanglement are unique to standard quantum\ntheory, and which ones are more generic over other physical theories endowed\nwith this phenomenon. Following this work, we discuss some entanglement\nproperties of two-rebits systems, making a comparison with the basic properties\nof two-qubits systems, i.e., the ones described by standard complex quantum\nmechanics. We also discuss the use of quaternionic quantum mechanics as applied\nto the phenomenon of entanglement.",
    "authors": [
      "J. Batle",
      "A. R. Plastino",
      "M. Casas",
      "A. Plastino"
    ],
    "publication_date": "2006-03-07T18:33:01Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0603060v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0603060v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graph structure of quantum mechanics",
    "abstract": "The quantum mechanics is proved to admit no hidden-variable in 1960s, which\nmeans the quantum systems are contextual. Revealing the mathematical structure\nof quantum mechanics is a significant task. We develop the approach of partial\nBoolean algebra to characterize the contextuality theory with local consistency\nand exclusivity, and then prove that the finite dimensional quantum systems are\ndetermined by atoms using two graph structure theorems. We also generalize our\nwork to infinite dimensional cases. Our conclusions indicate that the quantum\nmechanics is a graph-structured combination of multiple hidden-variable\ntheories, and provide a precise mathematical framework for quantum\ncontextuality.",
    "authors": [
      "Songyi Liu",
      "Yongjun Wang",
      "Baoshan Wang",
      "Jian Yan",
      "Heng Zhou"
    ],
    "publication_date": "2024-11-27T08:49:12Z",
    "arxiv_id": "http://arxiv.org/abs/2411.18146v2",
    "download_url": "http://arxiv.org/abs/2411.18146v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Classical Limit of Quantum Mechanics",
    "abstract": "Contrary to the widespread belief, the problem of the emergence of classical\nmechanics from quantum mechanics is still open. In spite of many results on the\n$\\h \\to 0$ asymptotics, it is not yet clear how to explain within standard\nquantum mechanics the classical motion of macroscopic bodies. In this paper we\nshall analyze special cases of classical behavior in the framework of a precise\nformulation of quantum mechanics, Bohmian mechanics, which contains in its own\nstructure the possibility of describing real objects in an observer-independent\nway.",
    "authors": [
      "Valia Allori",
      "Nino Zanghì"
    ],
    "publication_date": "2001-12-02T18:32:42Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0112009v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0112009v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bohmian Trajectories as the Foundation of Quantum Mechanics",
    "abstract": "Bohmian trajectories have been used for various purposes, including the\nnumerical simulation of the time-dependent Schroedinger equation and the\nvisualization of time-dependent wave functions. We review the purpose they were\ninvented for: to serve as the foundation of quantum mechanics, i.e., to explain\nquantum mechanics in terms of a theory that is free of paradoxes and allows an\nunderstanding that is as clear as that of classical mechanics. Indeed, they\nsucceed in serving that purpose in the context of a theory known as Bohmian\nmechanics, to which this article is an introduction.",
    "authors": [
      "Sheldon Goldstein",
      "Roderich Tumulka",
      "Nino Zanghi"
    ],
    "publication_date": "2009-12-14T15:32:54Z",
    "arxiv_id": "http://arxiv.org/abs/0912.2666v1",
    "download_url": "http://arxiv.org/abs/0912.2666v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Do We Understand Quantum Mechanics - Finally?",
    "abstract": "After some historical remarks concerning Schroedinger's discovery of wave\nmechanics, we present a unified formalism for the mathematical description of\nclassical and quantum-mechanical systems, utilizing elements of the theory of\noperator algebras. We then review some basic aspects of quantum mechanics and,\nin particular, of its interpretation. We attempt to clarify what Quantum\nMechanics tells us about Nature when appropriate experiments are made. We\ndiscuss the importance of the mechanisms of \"dephasing\" and \"decoherence\" in\nassociating \"facts\" with possible events and rendering complementary possible\nevents mutually exclusive.",
    "authors": [
      "Juerg Froehlich",
      "Baptiste Schubnel"
    ],
    "publication_date": "2012-03-16T11:55:33Z",
    "arxiv_id": "http://arxiv.org/abs/1203.3678v1",
    "download_url": "http://arxiv.org/abs/1203.3678v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inferential vs. Dynamical Conceptions of Physics",
    "abstract": "I contrast two possible attitudes towards a given branch of physics: as\ninferential (i.e., as concerned with an agent's ability to make predictions\ngiven finite information), and as dynamical (i.e., as concerned with the\ndynamical equations governing particular degrees of freedom). I contrast these\nattitudes in classical statistical mechanics, in quantum mechanics, and in\nquantum statistical mechanics; in this last case, I argue that the\nquantum-mechanical and statistical-mechanical aspects of the question become\ninseparable. Along the way various foundational issues in statistical and\nquantum physics are (hopefully!) illuminated.",
    "authors": [
      "David Wallace"
    ],
    "publication_date": "2013-06-20T15:22:13Z",
    "arxiv_id": "http://arxiv.org/abs/1306.4907v1",
    "download_url": "http://arxiv.org/abs/1306.4907v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coupling spins to nanomechanical resonators: Toward quantum\n  spin-mechanics",
    "abstract": "Spin-mechanics studies interactions between spin systems and mechanical\nvibrations in a nanomechanical resonator and explores their potential\napplications in quantum information processing. In this tutorial, we summarize\nvarious types of spin-mechanical resonators and discuss both the\ncavity-QED-like and the trapped-ion-like spin-mechanical coupling processes.\nThe implementation of these processes using negatively charged nitrogen vacancy\nand silicon vacancy centers in diamond is reviewed. Prospects for reaching the\nfull quantum regime of spin-mechanics, in which quantum control can occur at\nthe level of both single spin and single phonon, are discussed with an emphasis\non the crucial role of strain coupling to the orbital degrees of freedom of the\ndefect centers.",
    "authors": [
      "Hailin Wang",
      "Ignas Lekavicius"
    ],
    "publication_date": "2020-11-19T17:39:51Z",
    "arxiv_id": "http://arxiv.org/abs/2011.09990v1",
    "download_url": "http://arxiv.org/abs/2011.09990v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Theory and Probabilities",
    "abstract": "It is often stated that quantum mechanics only makes statistical predictions\nand that a quantum state is described by the various probability distributions\nassociated with it. Can we describe a quantum state completely in terms of\nprobabilities and then use it to describe quantum dynamics? What is the origin\nof the probability distribution for a maximally specified quantum state?\n  Is quantum mechanics `local' or is there an essential nonlocality\n(nonseparability) inherent in quantum mechanics? These questions are discussed\nin this paper. The decay of an unstable quantum state and the time dependence\nof a minimum uncertainty states for future times as well as past times are also\ndiscussed.",
    "authors": [
      "E. C. G. Sudarshan"
    ],
    "publication_date": "2001-09-28T18:12:25Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0109159v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0109159v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Algebraic Approach to Koopman Classical Mechanics",
    "abstract": "Classical mechanics is presented here in a unary operator form, constructed\nusing the binary multiplication and Poisson bracket operations that are given\nin a phase space formalism, then a Gibbs equilibrium state over this unary\noperator algebra is introduced, which allows the construction of a Hilbert\nspace as a representation space of a Heisenberg algebra, giving a\nnoncommutative operator algebraic variant of the Koopman-von Neumann approach.\nIn this form, the measurement theory for unary classical mechanics can be the\nsame as and inform that for quantum mechanics, expanding classical mechanics to\ninclude noncommutative operators so that it is close to quantum mechanics,\ninstead of attempting to squeeze quantum mechanics into a classical mechanics\nmold. The measurement problem as it appears in unary classical mechanics\nsuggests a classical signal analysis approach that can also be successfully\napplied to the measurement problem of quantum mechanics. The development offers\nelementary mathematics that allows a formal reconciliation of \"collapse\" and\n\"no-collapse\" interpretations of quantum mechanics.",
    "authors": [
      "Peter Morgan"
    ],
    "publication_date": "2019-01-02T20:29:33Z",
    "arxiv_id": "http://arxiv.org/abs/1901.00526v5",
    "download_url": "http://arxiv.org/abs/1901.00526v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bohmian Mechanics with Complex Action: A New Trajectory-Based\n  Formulation of Quantum Mechanics",
    "abstract": "In recent years there has been a resurgence of interest in Bohmian mechanics\nas a numerical tool because of its local dynamics, which suggest the\npossibility of significant computational advantages for the simulation of large\nquantum systems. However, closer inspection of the Bohmian formulation reveals\nthat the nonlocality of quantum mechanics has not disappeared -- it has simply\nbeen swept under the rug into the quantum force. In this paper we present a new\nformulation of Bohmian mechanics in which the quantum action, S, is taken to be\ncomplex. This leads to a single equation for complex S, and ultimately complex\nx and p but there is a reward for this complexification -- a significantly\nhigher degree of localization. The quantum force in the new approach vanishes\nfor Gaussian wavepacket dynamics, and its effect on barrier tunneling processes\nis orders of magnitude lower than that of the classical force. We demonstrate\ntunneling probabilities that are in virtually perfect agreement with the exact\nquantum mechanics down to 10^{-7} calculated from strictly localized quantum\ntrajectories that do not communicate with their neighbors. The new formulation\nmay have significant implications for fundamental quantum mechanics, ranging\nfrom the interpretation of non-locality to measures of quantum complexity.",
    "authors": [
      "Yair Goldfarb",
      "Ilan Degani",
      "David J. Tannor"
    ],
    "publication_date": "2006-04-20T13:03:43Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0604150v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0604150v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Depicting qudit quantum mechanics and mutually unbiased qudit theories",
    "abstract": "We generalize the ZX calculus to quantum systems of dimension higher than\ntwo. The resulting calculus is sound and universal for quantum mechanics. We\ndefine the notion of a mutually unbiased qudit theory and study two particular\ninstances of these theories in detail: qudit stabilizer quantum mechanics and\nSpekkens-Schreiber toy theory for dits. The calculus allows us to analyze the\nstructure of qudit stabilizer quantum mechanics and provides a geometrical\npicture of qudit stabilizer theory using D-toruses, which generalizes the Bloch\nsphere picture for qubit stabilizer quantum mechanics. We also use our\nframework to describe generalizations of Spekkens toy theory to higher\ndimensional systems. This gives a novel proof that qudit stabilizer quantum\nmechanics and Spekkens-Schreiber toy theory for dits are operationally\nequivalent in three dimensions. The qudit pictorial calculus is a useful tool\nto study quantum foundations, understand the relationship between qubit and\nqudit quantum mechanics, and provide a novel, high level description of quantum\ninformation protocols.",
    "authors": [
      "André Ranchin"
    ],
    "publication_date": "2014-04-04T15:32:22Z",
    "arxiv_id": "http://arxiv.org/abs/1404.1288v3",
    "download_url": "http://arxiv.org/abs/1404.1288v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Galilean Relativity and the Path Integral Formalism in Quantum Mechanics",
    "abstract": "Closed systems in Newtonian mechanics obey the principle of Galilean\nrelativity. However, the usual Lagrangian for Newtonian mechanics, formed from\nthe difference of kinetic and potential energies, is not invariant under the\nfull group of Galilean transformations. In quantum mechanics Galilean boosts\nrequire a non-trivial transformation rule for the wave function and a\nconcomitant \"projective representation\" of the Galilean symmetry group. Using\nFeynman's path integral formalism this latter result can be shown to be\nequivalent to the non-invariance of the Lagrangian. Thus, using path integral\nmethods, the representation of certain symmetry groups in quantum mechanics can\nbe simply understood in terms of the transformation properties of the classical\nLagrangian and conversely. The main results reported here should be accessible\nto students and teachers of physics -- particularly classical mechanics,\nquantum mechanics, and mathematical physics -- at the advanced undergraduate\nand beginning graduate levels, providing a useful exposition for those wanting\nto explore topics such as the path integral formalism for quantum mechanics,\nrelativity principles, Lagrangian mechanics, and representations of symmetries\nin classical and quantum mechanics.",
    "authors": [
      "Charles Torre"
    ],
    "publication_date": "2023-06-23T13:09:19Z",
    "arxiv_id": "http://arxiv.org/abs/2306.13487v1",
    "download_url": "http://arxiv.org/abs/2306.13487v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Chaos and Statistical Mechanics",
    "abstract": "We briefly review the well known connection between classical chaos and\nclassical statistical mechanics, and the recently discovered connection between\nquantum chaos and quantum statistical mechanics.",
    "authors": [
      "Mark Srednicki"
    ],
    "publication_date": "1994-06-14T01:24:28Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9406056v1",
    "download_url": "http://arxiv.org/abs/cond-mat/9406056v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Generalized Quantum Deformations and Symmetries in Quantum Mechanics",
    "abstract": "Supersymmetric and parasupersymmetric quantum mechanics are now recognized as\ntwo further parts of quantum mechanics containing a lot of new informations\nenlightening (solvable) physical applications. Both contents are here analysed\nin connection with generalized quantum deformations. In fact, the\nparasupersymmetric context is visited when the order of paraquantization p is\nlimited to the first nontrivial value p = 2.",
    "authors": [
      "Jules Beckers"
    ],
    "publication_date": "1997-01-02T11:42:52Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9701003v1",
    "download_url": "http://arxiv.org/abs/hep-th/9701003v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "p-Brane Quantum Mechanical Wave Equations",
    "abstract": "Several quantum mechanical wave equations for $p$-branes are proposed based\non the role that the volume-preserving diffeomorphisms group has on the physics\nof extended objects. The $p$-brane quantum mechanical wave equations determine\nthe quantum dynamics involving the creation/destruction of $p$-branes in a $D$\ndimensional spacetime background with a given world-volume measure\nconfiguration in a given quantum state $\\Psi$.",
    "authors": [
      "Carlos Castro"
    ],
    "publication_date": "1998-12-21T15:48:44Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9812189v2",
    "download_url": "http://arxiv.org/abs/hep-th/9812189v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Intrinsic and operational observables in quantum mechanics",
    "abstract": "The concept of intrinsic and operational observables in quantum mechanics is\nintroduced. In any realistic description of a quantum measurement that includes\na macroscopic detecting device, it is possible to construct from the statistics\nof the recorded raw data a set of operational quantities that correspond to the\nintrinsic quantum mechanical observable.",
    "authors": [
      "B. G. Englert",
      "K. Wodkiewicz"
    ],
    "publication_date": "1995-02-15T15:08:32Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9502013v1",
    "download_url": "http://arxiv.org/abs/quant-ph/9502013v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanical retrocausation? Call for nonlocal causal models!",
    "abstract": "A new possible version of multisimultaneous causality is proposed, and real\nexperiments allowing us to decide between this view and quantum mechanical\nretrocausation are further discussed. The interest of testing quantum mechanics\nagainst as many nonlocal causal models as possible is stressed.",
    "authors": [
      "Antoine Suarez"
    ],
    "publication_date": "1998-02-12T10:46:45Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9802032v1",
    "download_url": "http://arxiv.org/abs/quant-ph/9802032v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanical 'Backward in Time'? Comments, Answers, and the Causal\n  Indistinguishability Condition",
    "abstract": "We discuss a number of comments on quant-ph/9801061, and propose to introduce\nthe concept of 'Causal Indistinguishability'. The incompatibility between\nQuantum Mechanics and Nonlocal Causality appears to be unavoidable: upholding\nof Quantum Mechanics by experiment would mean to live with influences backward\nin time, just as we are now living with such faster than light.",
    "authors": [
      "Antoine Suarez"
    ],
    "publication_date": "1998-05-07T19:02:34Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9805021v1",
    "download_url": "http://arxiv.org/abs/quant-ph/9805021v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]