[
  {
    "title": "Thermodynamic and Quantum Thermodynamic Analyses of Brownian Movement",
    "abstract": "Thermodynamic and quantum thermodynamic analyses of Brownian movement of a\nsolvent and a colloid passing through neutral thermodynamic equilibrium states\nonly. It is shown that Brownian motors and E. coli do not represent Brownian\nmovement.",
    "authors": [
      "Elias P. Gyftopoulos"
    ],
    "publication_date": "2006-07-06T14:59:21Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0607044v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0607044v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic potentials and Thermodynamic Relations in Nonextensive\n  Thermodynamics",
    "abstract": "The generalized Gibbs free energy and enthalpy is derived in the framework of\nnonextensive thermodynamics by using the so-called physical temperature and the\nphysical pressure. Some thermodynamical relations are studied by considering\nthe difference between the physical temperature and the inverse of Lagrange\nmultiplier. The thermodynamical relation between the heat capacities at a\nconstant volume and at a constant pressure is obtained using the generalized\nthermodynamical potential, which is found to be different from the traditional\none in Gibbs thermodynamics. But, the expressions for the heat capacities using\nthe generalized thermodynamical potentials are unchanged.",
    "authors": [
      "Lina Gu",
      "Jiulin Du"
    ],
    "publication_date": "2010-04-02T13:50:14Z",
    "arxiv_id": "http://arxiv.org/abs/1004.0337v2",
    "download_url": "http://arxiv.org/abs/1004.0337v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and Rate Thermodynamics",
    "abstract": "Approach of mesoscopic state variables to time independent equilibrium sates\n(zero law of thermodynamics) gives birth to the classical equilibrium\nthermodynamics. Approach of fluxes and forces to fixed points (equilibrium\nfluxes and forces) that drive reduced mesoscopic dynamics gives birth to the\nrate thermodynamics that is applicable to driven systems. We formulate the rate\nthermodynamics and dynamics, investigate its relation to the classical\nthermodynamics, to extensions involving more details, to the hierarchy\nreformulations of dynamical theories, and to the Onsager variational principle.\nWe also compare thermodynamic and dynamic critical behavior observed in closed\nand open systems. Dynamics and thermodynamics of the van der Waals gas provides\nan illustration.",
    "authors": [
      "Miroslav Grmela"
    ],
    "publication_date": "2023-10-23T21:09:37Z",
    "arxiv_id": "http://arxiv.org/abs/2310.15370v1",
    "download_url": "http://arxiv.org/abs/2310.15370v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gravity as a thermodynamic phenomenon",
    "abstract": "The analogy between the laws of black hole mechanics and the laws of\nthermodynamics led Bekenstein and Hawking to argue that black holes should be\nconsidered as real thermodynamic systems that are characterised by entropy and\ntemperature. Black hole thermodynamics indicates a deeper connection between\nthermodynamics and gravity. We review and examine in detail the arguments that\nsuggest an interpretation of gravity itself as a thermodynamic theory.",
    "authors": [
      "Dimitris Moustos"
    ],
    "publication_date": "2017-01-31T09:52:31Z",
    "arxiv_id": "http://arxiv.org/abs/1701.08967v1",
    "download_url": "http://arxiv.org/abs/1701.08967v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Affine geometric description of thermodynamics",
    "abstract": "Thermodynamics provides a unified perspective of thermodynamic properties of\nvarious substances. To formulate thermodynamics in the language of\nsophisticated mathematics, thermodynamics is described by a variety of\ndifferential geometries, including contact and symplectic geometries. Meanwhile\naffine geometry is a branch of differential geometry and is compatible with\ninformation geometry, where information geometry is known to be compatible with\nthermodynamics. By combining above, it is expected that thermodynamics is\ncompatible with affine geometry, and is expected that several affine geometric\ntools can be introduced in the analysis of thermodynamic systems. In this paper\naffine geometric descriptions of equilibrium and nonequilibrium thermodynamics\nare proposed. For equilibrium systems, it is shown that several thermodynamic\nquantities can be identified with geometric objects in affine geometry, and\nthat several geometric objects can be introduced in thermodynamics. Examples of\nthese include: specific heat is identified with the affine fundamental form, a\nflat connection is introduced in thermodynamic phase space. For nonequilibrium\nsystems, two classes of relaxation processes are shown to be described in the\nlanguage of an extension of affine geometry. Finally this affine geometric\ndescription of thermodynamics for equilibrium and nonequilibrium systems is\ncompared with a contact geometric description.",
    "authors": [
      "Shin-itiro Goto"
    ],
    "publication_date": "2022-09-04T04:24:31Z",
    "arxiv_id": "http://arxiv.org/abs/2209.01529v2",
    "download_url": "http://arxiv.org/abs/2209.01529v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic Geodesics in Bardeen Regular Black Hole: Conventional vs.\n  Modified Geometrothermodynamics Metrics",
    "abstract": "Thermodynamic geometry allow us to study the microscopic behavior of black\nhole system by defining a metric structure in thermodynamic phase space. Among\nthe various thermodynamic metric structures, metrics defined by\ngeometrothermodynamics (GTD) are extensively used to study the various\nthermodynamic system due to its Legendre invariant nature. In this work we\ninvestigate the behavior of thermodynamic geodesic of Bardeen regular black\nhole in thermodynamic space defined by three different GTD metrics. Based on\nthe behavior of thermodynamic geodesic as well as thermodynamic curvature we\nargued that conventional GTD metric need some modifications to reflect all the\nthermodynamical properties of a system. We also modified the conventional GTD\nmetrics and explore the behavior of thermodynamic geodesic defined by the\nmodified metrics. Our study shows that the modified GTD metrics contain most of\nthe information about the thermodynamical boundaries such as temperature\nvanishing line, spinodal line etc. of a black hole system. Based on the\nproperty of geodesic and Ricci scalar defined by the modified metrics we argued\nthat the modified version of GTD metric are most suitable metric structures for\nstudying the underlying thermodynamic behavior of a black hole system.",
    "authors": [
      "Gunindra Krishna Mahanta"
    ],
    "publication_date": "2025-10-25T18:50:28Z",
    "arxiv_id": "http://arxiv.org/abs/2510.22398v1",
    "download_url": "http://arxiv.org/abs/2510.22398v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entanglement thermodynamics",
    "abstract": "Entanglement entropy is a statistical entropy measuring information loss due\nto coarse-graining corresponding to a spatial division of a system. In this\npaper we construct a thermodynamics (entanglement thermodynamics) which\nincludes the entanglement entropy as the entropy variable, for a massless\nscalar field in Minkowski, Schwarzschild and Reissner-Nordstr{\\\"o}m spacetimes\nto understand the statistical origin of black-hole thermodynamics. It is shown\nthat the entanglement thermodynamics in Minkowski spacetime differs\nsignificantly from black-hole thermodynamics. On the contrary, the entanglement\nthermodynamics in Schwarzschild and Reissner-Nordstr{\\\"o}m spacetimes has close\nrelevance to black-hole thermodynamics.",
    "authors": [
      "Shinji Mukohyama",
      "Masafumi Seriu",
      "Hideo Kodama"
    ],
    "publication_date": "1998-02-13T08:05:13Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9802028v1",
    "download_url": "http://arxiv.org/abs/gr-qc/9802028v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Measuring thermodynamic length",
    "abstract": "Thermodynamic length is a metric distance between equilibrium thermodynamic\nstates. Among other interesting properties, this metric asymptotically bounds\nthe dissipation induced by a finite time transformation of a thermodynamic\nsystem. It is also connected to the Jensen-Shannon divergence, Fisher\ninformation and Rao's entropy differential metric. Therefore, thermodynamic\nlength is of central interest in understanding matter out-of-equilibrium. In\nthis paper, we will consider how to define thermodynamic length for a small\nsystem described by equilibrium statistical mechanics and how to measure\nthermodynamic length within a computer simulation. Surprisingly, Bennett's\nclassic acceptance ratio method for measuring free energy differences also\nmeasures thermodynamic length.",
    "authors": [
      "Gavin E. Crooks"
    ],
    "publication_date": "2007-06-04T23:34:57Z",
    "arxiv_id": "http://arxiv.org/abs/0706.0559v2",
    "download_url": "http://arxiv.org/abs/0706.0559v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Control by Interconnection of Port-Thermodynamic Systems",
    "abstract": "The power conserving interconnection of port-thermodynamic systems via their\npower ports results in another port-thermodynamic system, while the same holds\nfor the rate of entropy increasing interconnection via their entropy flow\nports. Control by interconnection of port-thermodynamic systems seeks to\ncontrol a plant port-thermodynamic system by the interconnection with a\ncontroller port-thermodynamic system. The stability of the interconnected\nport-thermodynamic system is investigated by Lyapunov functions based on\ngenerating functions for the submanifold characterizing the state properties as\nwell as additional conserved quantities. Crucial tool is the use of canonical\npoint transformations on the symplectized thermodynamic phase space.",
    "authors": [
      "Arjan van der Schaft"
    ],
    "publication_date": "2021-04-13T09:03:18Z",
    "arxiv_id": "http://arxiv.org/abs/2104.06034v1",
    "download_url": "http://arxiv.org/abs/2104.06034v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bond Graphs Unify Stoichiometric Analysis and Thermodynamics",
    "abstract": "Whole-cell modelling is constrained by the laws of nature in general and the\nlaws of thermodynamics in particular. This paper shows how one prolific source\nof information, stoichiometric models of biomolecular systems, can be\nintegrated with thermodynamic principles using the bond graph approach to\nnetwork thermodynamics.",
    "authors": [
      "Peter J. Gawthrop"
    ],
    "publication_date": "2020-07-31T09:24:50Z",
    "arxiv_id": "http://arxiv.org/abs/2007.15917v1",
    "download_url": "http://arxiv.org/abs/2007.15917v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quasi-Homogeneous Thermodynamics and Black Holes",
    "abstract": "We propose a generalized thermodynamics in which quasi-homogeneity of the\nthermodynamic potentials plays a fundamental role. This thermodynamic formalism\narises from a generalization of the approach presented in paper [1], and it is\nbased on the requirement that quasi-homogeneity is a non-trivial symmetry for\nthe Pfaffian form $\\delta Q_{rev}$. It is shown that quasi-homogeneous\nthermodynamics fits the thermodynamic features of at least some\nself-gravitating systems. We analyze how quasi-homogeneous thermodynamics is\nsuggested by black hole thermodynamics. Then, some existing results involving\nself-gravitating systems are also shortly discussed in the light of this\nthermodynamic framework. The consequences of the lack of extensivity are also\nrecalled. We show that generalized Gibbs-Duhem equations arise as a consequence\nof quasi-homogeneity of the thermodynamic potentials. An heuristic link between\nthis generalized thermodynamic formalism and the thermodynamic limit is also\ndiscussed.",
    "authors": [
      "F. Belgiorno"
    ],
    "publication_date": "2002-10-07T15:29:59Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0210021v2",
    "download_url": "http://arxiv.org/abs/gr-qc/0210021v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Notes on Quasi-Homogeneous Functions in Thermodynamics",
    "abstract": "A special kind of quasi-homogeneity occurring in thermodynamic potentials of\nstandard thermodynamics is pointed out. Some formal consequences are also\ndiscussed.",
    "authors": [
      "F. Belgiorno"
    ],
    "publication_date": "2002-10-07T15:53:31Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0210031v1",
    "download_url": "http://arxiv.org/abs/physics/0210031v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Contact Symmetries and Hamiltonian Thermodynamics",
    "abstract": "It has been shown that contact geometry is the proper framework underlying\nclassical thermodynamics and that thermodynamic fluctuations are captured by an\nadditional metric structure related to Fisher's Information Matrix. In this\nwork we analyze several unaddressed aspects about the application of contact\nand metric geometry to thermodynamics. We consider here the Thermodynamic Phase\nSpace and start by investigating the role of gauge transformations and Legendre\nsymmetries for metric contact manifolds and their significance in\nthermodynamics. Then we present a novel mathematical characterization of first\norder phase transitions as equilibrium processes on the Thermodynamic Phase\nSpace for which the Legendre symmetry is broken. Moreover, we use contact\nHamiltonian dynamics to represent thermodynamic processes in a way that\nresembles the classical Hamiltonian formulation of conservative mechanics and\nwe show that the relevant Hamiltonian coincides with the irreversible entropy\nproduction along thermodynamic processes. Therefore, we use such property to\ngive a geometric definition of thermodynamically admissible fluctuations\naccording to the Second Law of thermodynamics. Finally, we show that the length\nof a curve describing a thermodynamic process measures its entropy production.",
    "authors": [
      "A. Bravetti",
      "C. S. Lopez-Monsalvo",
      "F. Nettel"
    ],
    "publication_date": "2014-09-25T17:37:14Z",
    "arxiv_id": "http://arxiv.org/abs/1409.7340v2",
    "download_url": "http://arxiv.org/abs/1409.7340v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hamiltonian thermodynamics",
    "abstract": "It is believed that thermodynamic laws are associated with random processes\noccurring in the system and, therefore, deterministic mechanical systems cannot\nbe described within the framework of the thermodynamic approach. In this paper,\nwe show that thermodynamics (or, more precisely, a thermodynamically-like\ndescription) can be constructed even for deterministic Hamiltonian systems, for\nexample, systems with only one degree of freedom. We show that for such systems\nit is possible to introduce analogs of thermal energy, temperature, entropy,\nHelmholtz free energy, etc., which are related to each other by the usual\nthermodynamic relations. For the considered Hamiltonian systems, the first and\nsecond laws of thermodynamics are rigorously derived, which have the same form\nas in ordinary (molecular) thermodynamics. It is shown that for Hamiltonian\nsystems it is possible to introduce the concepts of a thermodynamic state, a\nthermodynamic process, and thermodynamic cycles, in particular, the Carnot\ncycle, which are described by the same relations as their usual thermodynamic\nanalogs.",
    "authors": [
      "Sergey Rashkovskiy"
    ],
    "publication_date": "2020-09-21T08:59:33Z",
    "arxiv_id": "http://arxiv.org/abs/2009.12323v1",
    "download_url": "http://arxiv.org/abs/2009.12323v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparison of extended irreversible thermodynamics and nonequilibrium\n  statistical operator method with thermodynamics based on a distribution\n  containing the first-passage time",
    "abstract": "An analogy is drawn between version of non-equilibrium thermodynamics a\ndistribution-based containing an additional thermodynamic first-passage time\nparameter, nonequilibrium statistical operator method and extended irreversible\nthermodynamics with flows as an additional thermodynamic parameter.\nThermodynamics containing an additional thermodynamic first-passage time\nparameter maps to extended irreversible thermodynamics. Various conditions for\nthe dependence of the distribution parameters of the first-passage time on the\nrandom value of energy, the first thermodynamic parameter, are considered. Time\nparameter relaxation time {\\tau} of extended irreversible thermodynamics is\nreplaced by the average first-passage time. Expressions are obtained for the\nthermodynamic parameter, the conjugate of the first passage time through the\nentropy change, and for the average first passage time through the flows.",
    "authors": [
      "V. V. Ryazanov"
    ],
    "publication_date": "2022-10-14T12:09:37Z",
    "arxiv_id": "http://arxiv.org/abs/2210.07734v5",
    "download_url": "http://arxiv.org/abs/2210.07734v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information vs Thermodynamic Entropy",
    "abstract": "The Shannon information is shown to be different to the thermodynamic\nentropy, and indifferent to the Second Law of Thermodynamics.",
    "authors": [
      "Phil Attard"
    ],
    "publication_date": "2024-07-12T03:25:05Z",
    "arxiv_id": "http://arxiv.org/abs/2407.08962v1",
    "download_url": "http://arxiv.org/abs/2407.08962v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Are there Thermodynamical Degrees of Freedom of Gravitation?",
    "abstract": "In discussing fundamentals of general-relativistic irreversible continuum\nthermodynamics, this theory is shown to be characterized by the feature that no\nthermodynamical degrees of freedom are ascribed to gravitation. However,\naccepting that black hole thermodynamics seems to oppose this harmlessness of\ngravitation one is called on consider other approaches. Therefore, in brief\nsome gravitational and thermodynamical alternatives are reviewed.",
    "authors": [
      "H. -H. v. Borzeszkowski",
      "T. Chrobok"
    ],
    "publication_date": "2003-10-16T10:12:07Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0310082v1",
    "download_url": "http://arxiv.org/abs/gr-qc/0310082v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weakly nonlocal non-equilibrium thermodynamics - variational principles\n  and Second Law",
    "abstract": "A general, uniform, rigorous and constructive thermodynamic approach to\nweakly nonlocal non-equilibrium thermodynamics is reviewed. A method is given\nto construct and restrict the evolution equations of physical theories\naccording to the Second Law of thermodynamics and considering weakly nonlocal\nconstitutive state spaces. The evolution equations of internal variables, the\nclassical irreversible thermodynamics and Korteweg fluids are treated.",
    "authors": [
      "P. Ván"
    ],
    "publication_date": "2009-02-18T21:49:08Z",
    "arxiv_id": "http://arxiv.org/abs/0902.3261v2",
    "download_url": "http://arxiv.org/abs/0902.3261v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Braun-Le Chatelier principle in dissipative thermodynamics",
    "abstract": "Braun-Le Chatelier principle is a fundamental result of equilibrium\nthermodynamics, showing how stable equilibrium states shift when external\nconditions are varied. The principle follows from convexity of thermodynamic\npotential. Analogously, from convexity of dissipation potential it follows how\nsteady non-equilibrium states shift when thermodynamic forces are varied, which\nis the extension of the principle to dissipative thermodynamics.",
    "authors": [
      "Michal Pavelka",
      "Miroslav Grmela"
    ],
    "publication_date": "2016-09-08T07:37:25Z",
    "arxiv_id": "http://arxiv.org/abs/1609.02308v1",
    "download_url": "http://arxiv.org/abs/1609.02308v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonequilibrium thermodynamics with thermodynamic parameter of lifetime\n  of system. II. Possibilities of increase lifetime",
    "abstract": "The thermodynamics is studied with the thermodynamic parameter of the\nlifetime, first-passage time, generalizing the equilibrium thermodynamics.\nVarious ways of describing several stationary nonequilibrium states in the\nsystem are considered. The possibilities of increasing the lifetime of the\nsystem under external influences on it are investigated.",
    "authors": [
      "V. V. Ryazanov"
    ],
    "publication_date": "2019-10-17T19:28:24Z",
    "arxiv_id": "http://arxiv.org/abs/1910.08075v1",
    "download_url": "http://arxiv.org/abs/1910.08075v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and Dynamic Stability: Extended Theories of Heat\n  Conduction",
    "abstract": "The fundamental dynamic stability of heat conduction theories beyond Fourier\nis analyzed in the framework of nonequilibrium thermodynamics. It is shown,\nthat the thermodynamic framework, concave entropy and nonnegative entropy\nproduction, can ensure the stability of homogeneous thermodynamic equilibrium.\nVarious special heat conduction theories of Extended Thermodynamics are\ncompared and analysed in the general framework.",
    "authors": [
      "R. Somogyfoki",
      "A. Famà",
      "L. Restuccia",
      "P. Ván"
    ],
    "publication_date": "2024-04-26T08:55:49Z",
    "arxiv_id": "http://arxiv.org/abs/2404.17257v2",
    "download_url": "http://arxiv.org/abs/2404.17257v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Discrete Thermodynamics of Chemical Equilibria",
    "abstract": "The paper sets forth comprehensive basics of Discrete Thermodynamics of\nChemical Equilibria (DTD), developed by the author during the last decade and\nspread over series of publications. Based on the linear equations of\nirreversible thermodynamics, De Donder's definition of the thermodynamic force,\nand the Le Chatelier principle, DTD brings forward a notion of chemical\nequilibrium as a balance of internal and external thermodynamic forces, acting\nagainst a chemical system. The basic expression of DTD is a logistic map that\nties together energetic characteristics of the chemical transformation in the\nsystem, its deviation from true thermodynamic equilibrium, and the sum of\nthermodynamic forces, causing that deviation. System deviation from\nthermodynamic equilibrium is the major variable of the theory. Solutions to the\nbasic map define the chemical system domain of states comprising bifurcation\ndiagrams with four areas, from true thermodynamic equilibrium to chaos, having\nspecific distinctive meaning for chemical systems. The theory is derived from\nthe currently recognized ideas of chemical thermodynamics and binds classical\nand contemporary thermodynamics of chemical equilibria into a unique concept.\nDTD opens new opportunities in understanding and analysis of equilibria in\nchemical systems. Some new results, included in the paper, have never been\npublished before.",
    "authors": [
      "B. Zilbergleyt"
    ],
    "publication_date": "2008-08-04T19:32:55Z",
    "arxiv_id": "http://arxiv.org/abs/0808.0340v1",
    "download_url": "http://arxiv.org/abs/0808.0340v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and time-directional invariance",
    "abstract": "Time directions are not invariant in conventional thermodynamics. We broadly\nfollow ideas of Ludwig Boltzmann and investigate implications of postulating\ntime-directional invariance in thermodynamics. In this investigation, we\nrequire that thermodynamic descriptions are not changed under time reversal\naccompanied by replacement of matter by antimatter (i.e. CPT-invariant\nthermodynamics). The matter and antimatter are defined as thermodynamic\nconcepts without detailing their physical structure.\n  Our analysis stays within the limits of conceptual thermodynamics and leads\nto effective negative temperatures, to thermodynamic restrictions on time\ntravel and to inherent antagonism of matter and antimatter. This antagonism is\npurely thermodynamic; it explains the difficulty in achieving thermodynamic\nequilibrium between matter and antimatter and does not postulate their mutual\nannihilation on contact. We believe that the conclusions of this work can be of\ninterest not only for people researching or teaching thermodynamics but also\nfor a wider scientific audience.",
    "authors": [
      "A. Y. Klimenko",
      "U. Maas"
    ],
    "publication_date": "2012-09-10T13:26:15Z",
    "arxiv_id": "http://arxiv.org/abs/1209.1982v1",
    "download_url": "http://arxiv.org/abs/1209.1982v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coherence and measurement in quantum thermodynamics",
    "abstract": "Thermodynamics is a highly successful macroscopic theory widely used across\nthe natural sciences and for the construction of everyday devices, from car\nengines and fridges to power plants and solar cells. With thermodynamics\npredating quantum theory, research now aims to uncover the thermodynamic laws\nthat govern finite size systems which may in addition host quantum effects.\nHere we identify information processing tasks, the so-called \"projections\",\nthat can only be formulated within the framework of quantum mechanics. We show\nthat the physical realisation of such projections can come with a non-trivial\nthermodynamic work only for quantum states with coherences. This contrasts with\ninformation erasure, first investigated by Landauer, for which a thermodynamic\nwork cost applies for classical and quantum erasure alike. Implications are\nfar-reaching, adding a thermodynamic dimension to measurements performed in\nquantum thermodynamics experiments, and providing key input for the\nconstruction of a future quantum thermodynamic framework. Repercussions are\ndiscussed for quantum work fluctuation relations and thermodynamic single-shot\napproaches.",
    "authors": [
      "Philipp Kammerlander",
      "Janet Anders"
    ],
    "publication_date": "2015-02-09T21:00:16Z",
    "arxiv_id": "http://arxiv.org/abs/1502.02673v2",
    "download_url": "http://arxiv.org/abs/1502.02673v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Energy partition in nonabelian gauge fields with thermodynamic\n  interactions",
    "abstract": "The thermodynamic interaction at thermodynamic equilibrium in the free\nfermion gas is alternatively described by the coupling of particles with a\nscalar thermodynamic field which features a self-interaction. The gauge fields\nin $SU_c(3)$ symmetry are investigated with thermodynamic interactions. Six\noff-diagonal gluons acquire effective masses through the decolorization of\nthermodynamic fields using the Higgs mechanism. Together with the rise of the\nfermion mass in the thermal bath, this gives the partition of the thermodynamic\nenergy under the classical limit.",
    "authors": [
      "W. Z. Jiang"
    ],
    "publication_date": "2003-07-25T12:13:46Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ph/0307315v2",
    "download_url": "http://arxiv.org/abs/hep-ph/0307315v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the geometrical thermodynamics of chemical reactions",
    "abstract": "The formal structure of geometrical thermodynamics is reviewed with\nparticular emphasis on the geometry of equilibria submanifolds. On these\nsubmanifolds thermodynamic metrics are defined as the Hessian of thermodynamic\npotentials. Links between geometry and thermodynamics are explored for single\nand multiple component, closed and open systems. For multi-component closed and\nopen systems the Gibbs free energy is employed as the thermodynamic potential\nto investigate the connection between geometry and thermodynamics. The Gibbs\nfree energy is chosen for the analysis of multicomponent systems and, in\nparticular, chemical reactions.",
    "authors": [
      "Manuel Santoro",
      "Albert S. Benight"
    ],
    "publication_date": "2005-07-08T16:01:39Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0507026v1",
    "download_url": "http://arxiv.org/abs/math-ph/0507026v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric description of BTZ black holes thermodynamics",
    "abstract": "We study the properties of the space of thermodynamic equilibrium states of\nthe Ba\\~nados-Teitelboim-Zanelli (BTZ) black hole in (2+1)-gravity. We use the\nformalism of geometrothermodynamics to introduce in the space of equilibrium\nstates a $2-$dimensional thermodynamic metric whose curvature is non-vanishing,\nindicating the presence of thermodynamic interaction, and free of\nsingularities, indicating the absence of phase transitions. Similar results are\nobtained for generalizations of the BTZ black hole which include a Chern-Simons\nterm and a dilatonic field. Small logarithmic corrections of the entropy turn\nout to be represented by small corrections of the thermodynamic curvature,\nreinforcing the idea that thermodynamic curvature is a measure of thermodynamic\ninteraction.",
    "authors": [
      "Hernando Quevedo",
      "Alberto Sanchez"
    ],
    "publication_date": "2008-11-15T20:08:03Z",
    "arxiv_id": "http://arxiv.org/abs/0811.2524v1",
    "download_url": "http://arxiv.org/abs/0811.2524v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Thermodynamics",
    "abstract": "Quantum thermodynamics addresses the emergence of thermodynamical laws from\nquantum mechanics. The link is based on the intimate connection of quantum\nthermodynamics with the theory of open quantum systems. Quantum mechanics\ninserts dynamics into thermodynamics giving a sound foundation to\nfinite-time-thermodynamics. The emergence of the 0-law I-law II-law and III-law\nof thermodynamics from quantum considerations is presented. The emphasis is on\nconsistence between the two theories which address the same subject from\ndifferent foundations. We claim that inconsistency is the result of faulty\nanalysis pointing to flaws in approximations.",
    "authors": [
      "Ronnie Kosloff"
    ],
    "publication_date": "2013-05-10T07:06:22Z",
    "arxiv_id": "http://arxiv.org/abs/1305.2268v1",
    "download_url": "http://arxiv.org/abs/1305.2268v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extended quasilocal Thermodynamics of Schwarzchild-anti de Sitter black\n  holes",
    "abstract": "In this work we study a homogeneous and quasilocal Thermodynamics associated\nto the Schwarzschild-anti de Sitter black hole. The usual thermodynamic\ndescription is extended within a Hamiltonian approach with the introduction of\nthe cosmological constant in the thermodynamic phase space. The treatment\npresented is consistent in as much as it respects the laws of black hole\nThermodynamics and accepts the introduction of any thermodynamic potential. We\nare able to construct new equations of state that characterize the\nThermodynamics. Novel phenomena can be expected from the proposed setup.",
    "authors": [
      "W. B. Fontana",
      "M. C. Baldiotti",
      "R. Fresneda",
      "C. Molina"
    ],
    "publication_date": "2018-06-14T18:34:07Z",
    "arxiv_id": "http://arxiv.org/abs/1806.05699v2",
    "download_url": "http://arxiv.org/abs/1806.05699v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-equilibrium thermodynamics as gauge fixing",
    "abstract": "By considering a thermodynamic force as gauge field, we extend constitutive\nequations of Onsager's non-equilibrium thermodynamics to non-linear equations.\nIn Onsager's non-equilibrium thermodynamics, the thermodynamic force\ncorresponds to a pure gauge, for which the constitutive equations are obtained\nby gauge fixing. If we extend the thermodynamic force from pure gauge to\nphysical one, we obtain the non-linear constitutive equations of\nnon-equilibrium thermodynamics.",
    "authors": [
      "So Katagiri"
    ],
    "publication_date": "2018-06-16T11:18:05Z",
    "arxiv_id": "http://arxiv.org/abs/1806.07816v2",
    "download_url": "http://arxiv.org/abs/1806.07816v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Modified Cosmic Chaplygin Gas",
    "abstract": "In this paper, we examine the thermodynamic features of an exotic fluid known\nas modified cosmic Chaplygin gas in the context of homogeneous isotropic\nuniverse model. For this purpose, the behavior of physical parameters are\ndiscussed that help to analyze nature of the universe. Using specific heat\nformalism, the validity of third law of thermodynamics is checked. Furthermore,\nwith the help of thermodynamic entities, the thermal equation of state is also\ndiscussed. The thermodynamic stability is explored by means of adiabatic,\nspecific heat and isothermal conditions from classical thermodynamics. It is\nconcluded that the considered fluid configuration is thermodynamically stable\nand expands adiabatically for an appropriate choice of parameters.",
    "authors": [
      "M. Sharif",
      "Sara Ashraf"
    ],
    "publication_date": "2018-10-01T09:18:43Z",
    "arxiv_id": "http://arxiv.org/abs/1810.01286v1",
    "download_url": "http://arxiv.org/abs/1810.01286v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A note of the first law of thermodynamics by gravitational decoupling",
    "abstract": "We provide a way of decoupling the first law of thermodynamics in two sectors\n: the standard first law of thermodynamics and the quasi first law of\nthermodynamics. It is showed that both sectors share the same thermodynamics\nvolume and the same entropy. However, the total thermodynamics pressure, the\ntotal temperature and the total local energy correspond to a simple sum of the\nthermodynamics contributions of each sector. Furthermore, it is showed a simple\nexample, where there is a phase transition due to the behavior of the\ntemperature at the quasi sector.",
    "authors": [
      "Milko Estrada",
      "Reginaldo Prado"
    ],
    "publication_date": "2020-03-30T00:28:20Z",
    "arxiv_id": "http://arxiv.org/abs/2003.13168v1",
    "download_url": "http://arxiv.org/abs/2003.13168v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamically free quantum measurements",
    "abstract": "Thermal channels -- the free processes allowed in the resource theory of\nquantum thermodynamics -- are generalised to thermal instruments, which we\ninterpret as implementing thermodynamically free quantum measurements; a\nMaxwellian demon using such measurements never violates the second law of\nthermodynamics. Further properties of thermal instruments are investigated and,\nin particular, it is shown that they only measure observables commuting with\nthe Hamiltonian, and they thermalise the measured system when performing a\ncomplete measurement, the latter of which indicates a thermodynamically induced\ninformation-disturbance trade-off. The demarcation of measurements that are not\nthermodynamically free paves the way for a resource-theoretic quantification of\ntheir thermodynamic cost.",
    "authors": [
      "M. Hamed Mohammady"
    ],
    "publication_date": "2022-05-22T15:09:56Z",
    "arxiv_id": "http://arxiv.org/abs/2205.10847v2",
    "download_url": "http://arxiv.org/abs/2205.10847v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Comprehensive Review of Geometrical Thermodynamics: From Fluctuations\n  to Black Holes",
    "abstract": "This paper presents a comprehensive review of geometrical thermodynamics,\nwhich employs geometric concepts to study the thermodynamic properties of\nphysical systems. The review covers key topics such as thermodynamic\nfluctuation theory, proposed thermodynamic metrics in various coordinate\nsystems, and thermodynamic curvature. Additionally, the paper discusses the\ngeometrical approach to black hole thermodynamics and provides an overview of\nrecent research in this field.",
    "authors": [
      "S. Mahmoudi",
      "Kh. Jafarzade",
      "S. H. Hendi"
    ],
    "publication_date": "2023-06-21T09:24:36Z",
    "arxiv_id": "http://arxiv.org/abs/2307.00010v3",
    "download_url": "http://arxiv.org/abs/2307.00010v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics-Consistent Graph Neural Networks",
    "abstract": "We propose excess Gibbs free energy graph neural networks (GE-GNNs) for\npredicting composition-dependent activity coefficients of binary mixtures. The\nGE-GNN architecture ensures thermodynamic consistency by predicting the molar\nexcess Gibbs free energy and using thermodynamic relations to obtain activity\ncoefficients. As these are differential, automatic differentiation is applied\nto learn the activity coefficients in an end-to-end manner. Since the\narchitecture is based on fundamental thermodynamics, we do not require\nadditional loss terms to learn thermodynamic consistency. As the output is a\nfundamental property, we neither impose thermodynamic modeling limitations and\nassumptions. We demonstrate high accuracy and thermodynamic consistency of the\nactivity coefficient predictions.",
    "authors": [
      "Jan G. Rittig",
      "Alexander Mitsos"
    ],
    "publication_date": "2024-07-08T06:58:56Z",
    "arxiv_id": "http://arxiv.org/abs/2407.18372v1",
    "download_url": "http://arxiv.org/abs/2407.18372v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Including gravity in equilibrium thermodynamics",
    "abstract": "This paper is part of a bottom-up approach to gravitational thermodynamics\nthat is guided by the axiomatic frameworks of equilibrium thermodynamics. We\nidentify a novel form of the microcanonical distribution for systems in\nbackground gravitational fields that respects the kinetic theory and the\nthermodynamic symmetries. Thermodynamic consistency dictates the treatment of\nthe gravitational field as a thermodynamic variable. We introduce the\nthermodynamic conjugate to the gravitational field, the gravitational pull, an\nadditive variable that is a structural element of our microcanonical\ndistribution. We demonstrate the validity of our results to inhomogenous\nbackground fields, a class of self-gravitating systems, relativistic gases in\nRindler spacetime, and quantum gases.",
    "authors": [
      "Eirini Sourtzinou",
      "Charis Anastopoulos"
    ],
    "publication_date": "2025-08-18T16:32:31Z",
    "arxiv_id": "http://arxiv.org/abs/2508.13061v1",
    "download_url": "http://arxiv.org/abs/2508.13061v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nontriviality in Black Hole Thermodynamics: towards physically and\n  mathematically rigorous foundation as phenomenology",
    "abstract": "Comparing black hole thermodynamics with the axiomatic formulation of\nthermodynamics for laboratory systems, it is found that some basic assumptions\n(required by experimental facts) in laboratory thermodynamics do not hold for\nblack hole thermodynamics. Hence, at present, it is not obvious whether black\nhole thermodynamics retains some crucial theorems of laboratory thermodynamics\n(e.g. Carnot's theorem, increase of entropy by arbitrary adiabatic process, and\nuniqueness of entropy) whose proofs use the basic assumptions which do not hold\nfor black holes. This paper aims to clarify such nontriviality in black hole\nthermodynamics, and propose a suitable set of basic assumptions in black hole\nthermodynamics, which are regarded as the rigorous foundation of black hole\nthermodynamics as phenomenology.",
    "authors": [
      "Hiromi Saida"
    ],
    "publication_date": "2013-03-19T01:09:17Z",
    "arxiv_id": "http://arxiv.org/abs/1303.4462v1",
    "download_url": "http://arxiv.org/abs/1303.4462v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stability of black holes based on horizon thermodynamics",
    "abstract": "On the basis of horizon thermodynamics we study the thermodynamic stability\nof black holes constructed in general relativity and Gauss-Bonnet gravity. In\nthe framework of horizon thermodynamics there are only five thermodynamic\nvariables $E,P,V,T,S$. It is not necessary to consider concrete matter fields,\nwhich may contribute to the pressure of black hole thermodynamic system. In\nnon-vacuum cases, we can derive the equation of state, $P=P(V,T)$. According to\nthe requirements of stable equilibrium in conventional thermodynamics, we start\nfrom these thermodynamic variables to calculate the heat capacity at constant\npressure and Gibbs free energy and analyze the local and global thermodynamic\nstability of black holes. It is shown that $P>0$ is the necessary condition for\nblack holes in general relativity to be thermodynamically stable, however this\ncondition cannot be satisfied by many black holes in general relativity. For\nblack hole in Gauss-Bonnet gravity negative pressure can be feasible, but only\nlocal stable black hole exists in this case.",
    "authors": [
      "Meng-Sen Ma",
      "Ren Zhao"
    ],
    "publication_date": "2015-11-11T14:07:49Z",
    "arxiv_id": "http://arxiv.org/abs/1511.03508v1",
    "download_url": "http://arxiv.org/abs/1511.03508v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic optimization of a Penrose process: an engineers' approach\n  to black hole thermodynamics",
    "abstract": "In this work we present a new view on the thermodynamics of black holes\nintroducing effects of irreversibility by employing thermodynamic optimization\nand finite-time thermodynamics. These questions are of importance both in\nphysics and in engineering, combining standard thermodynamics with optimal\ncontrol theory in order to find optimal protocols and bounds for realistic\nprocesses without assuming anything about the microphysics involved. We find\ngeneral bounds on the maximum work and the efficiency of thermodynamic\nprocesses involving black holes that can be derived exclusively from the\nknowledge of thermodynamic relations at equilibrium. Since these new bounds\nconsider the finite duration of the processes, they are more realistic and\nstringent than their reversible counterparts. To illustrate our arguments, we\nconsider in detail the thermodynamic optimization of a Penrose process, i.e.\nthe problem of finding the least dissipative process extracting all the angular\nmomentum from a Kerr black hole in finite time. We discuss the relevance of our\nresults for real astrophysical phenomena, for the comparison with laboratory\nblack holes analogues and for other theoretical aspects of black hole\nthermodynamics.",
    "authors": [
      "Alessandro Bravetti",
      "Christine Gruber",
      "Cesar S. Lopez-Monsalvo"
    ],
    "publication_date": "2015-11-20T23:58:09Z",
    "arxiv_id": "http://arxiv.org/abs/1511.06801v1",
    "download_url": "http://arxiv.org/abs/1511.06801v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonequilibrium Phase Transitions and Pattern Formation as Consequences\n  of Second Order Thermodynamic Induction",
    "abstract": "Development of thermodynamic induction up to second order gives a dynamical\nbifurcation for thermodynamic variables and allows for the prediction and\ndetailed explanation of nonequilibrium phase transitions with associated\nspontaneous symmetry breaking. By taking into account nonequilibrium\nfluctuations, long range order is analyzed for possible pattern formation.\nConsolidation of results up to second order produces thermodynamic potentials\nthat are maximized by stationary states of the system of interest. These new\npotentials differ from the traditional thermodynamic potentials. In particular\na generalized entropy is formulated for the system of interest which becomes\nthe traditional entropy when thermodynamic equilibrium is restored. This\ngeneralized entropy is maximized by stationary states under nonequilibrium\nconditions where the standard entropy for the system of interest is not\nmaximized. These new nonequilibrium concepts are incorporated into traditional\nthermodynamics, such as a revised thermodynamic identity, and a revised\ncanonical distribution. Detailed analysis shows that the second law of\nthermodynamics is never violated even during any pattern formation, thus\nsolving the entropic coupling problem.\n  Examples discussed include pattern formation during phase front propagation\nunder nonequilibrium conditions and the formation of Turing patterns. The\npredictions of second order thermodynamic induction are consistent with both\nobservational data in the literature as well as the modeling of this data.",
    "authors": [
      "S. N. Patitsas"
    ],
    "publication_date": "2021-10-05T23:31:15Z",
    "arxiv_id": "http://arxiv.org/abs/2110.02410v1",
    "download_url": "http://arxiv.org/abs/2110.02410v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Are the black hole remnants produced from binary black hole mergers in\n  GWTC-3 thermodynamically stable?",
    "abstract": "Black hole thermodynamics has brought strong hints of a profound and\nfundamental connection between gravity, thermodynamics, and quantum theory. If\nthe black hole does behave like a natural thermodynamic system, it should be\nthermodynamically stable in a clean environment. In this paper, using the\nobservational data of binary black hole (BBH) mergers observed by LIGO, Virgo,\nand KAGRA detectors, we check whether the black hole remnants produced from BBH\nmergers in the LIGO-Virgo-KAGRA catalog GWTC-3 are thermodynamically stable.\nThe criterion for the thermodynamic stability is quite simple and is directly\nrelated to the black hole's spin, which states that a thermodynamically stable\nblack hole remnant requires its dimensionless spin $a>a_* \\simeq 0.68$. We\ncheck the posterior distributions of final spin $a_f$ for 83 black hole\nremnants in GWTC-3 and find the whole remnant population is consistent with the\nthermodynamically stable black hole with $99.98\\%$ probability. This is the\nfirst verification of the thermodynamic stability of black hole remnants\nproduced from BBH mergers.",
    "authors": [
      "Qiang Wu",
      "Shao-Wen Wei",
      "Tao Zhu"
    ],
    "publication_date": "2022-02-18T16:32:00Z",
    "arxiv_id": "http://arxiv.org/abs/2202.09290v2",
    "download_url": "http://arxiv.org/abs/2202.09290v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-quasistatic response coefficients and dissipated availability for\n  macroscopic thermodynamic systems",
    "abstract": "The characterization of finite-time thermodynamic processes is of crucial\nimportance for extending equilibrium thermodynamics to nonequilibrium\nthermodynamics. The central issue is to quantify responses of thermodynamic\nvariables and irreversible dissipation associated with non-quasistatic changes\nof thermodynamic forces applied to the system. In this study, we derive a\nsimple formula that incorporates the non-quasistatic response coefficients with\nOnsager's kinetic coefficients, where the Onsager coefficients characterize the\nrelaxation dynamics of fluctuation of extensive thermodynamic variables of\nsemi-macroscopic systems. Moreover, the thermodynamic length and the dissipated\navailability that quantifies the efficiency of irreversible thermodynamic\nprocesses are formulated in terms of the derived non-quasistatic response\ncoefficients. The present results are demonstrated by using an ideal gas model.\nThe present results are, in principle, verifiable through experiments and are\nthus expected to provide a guiding principle for the nonequilibrium control of\nmacroscopic thermodynamic systems.",
    "authors": [
      "Yuki Izumida"
    ],
    "publication_date": "2023-01-28T07:37:12Z",
    "arxiv_id": "http://arxiv.org/abs/2301.12116v4",
    "download_url": "http://arxiv.org/abs/2301.12116v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integration of Quantum, Statistical, and Irreversible Thermodynamics in\n  A Coherent Framework",
    "abstract": "The combined law of thermodynamics derived by Gibbs laid the foundation of\nthermodynamics though only applicable to systems without internal processes.\nGibbs further derived the classical statistical thermodynamics in terms of the\nprobability of configurations in a system, which was extended to quantum\nmechanics-based statistical thermodynamics by Landau, while the irreversible\nthermodynamics was systemized by Onsager and expanded to chemical reactions by\nPrigogine. The development of density function theory (DFT) by Kohn enabled the\nquantitative prediction of properties of the ground-state configuration of a\nsystem from quantum mechanics. Here, we will present our theories that\nintegrate quantum, statistical, and irreversible thermodynamics in a coherent\nframework by utilizing the predicative capability of DFT to revise the\nstatistical thermodynamics (zentropy theory) and by keeping the entropy\nproduction due to irreversible processes in the combine law of thermodynamics\nto derive flux equations (theory of cross phenomena). The zentropy theory is\nshown capable of predicting the free energy landscape including singularity and\ninstability at critical point and emergent positive or negative divergences of\nproperties. The theory of cross phenomena can predict the coefficients of\ninternal processes between conjugate variables (direct phenomena) and\nnon-conjugate variables (cross phenomena) in the combined law of\nthermodynamics. Both are with inputs from DFT-based calculations only and\nwithout fitting parameters.",
    "authors": [
      "Zi-Kui Liu"
    ],
    "publication_date": "2023-09-18T14:46:52Z",
    "arxiv_id": "http://arxiv.org/abs/2309.09823v1",
    "download_url": "http://arxiv.org/abs/2309.09823v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generating Kerr-anti-de Sitter thermodynamics",
    "abstract": "In the present work we study the construction of different thermodynamic\ndescriptions for the Kerr-anti-de Sitter (KadS) black holes. The early versions\nof the KadS thermodynamics are briefly discussed, highlighting some of its\nstrong points and shortcomings. Isohomogeneous transformations, a procedure for\ngenerating new thermodynamics, are presented and geometrically interpreted for\nKadS. This tool is used to determine possible KadS thermodynamics that can be\nconstructed to satisfy a Smarr formula, and the validity of the first law in\nthe generated thermodynamics. The connection between new thermodynamic theories\nand early Hawking's approach is considered. In this new framework, the usual\nKadS thermodynamics is complemented with its geometric construction, and\nHawking's proposal, which does not satisfy the first law, is improved to an\nalternative thermodynamic theory. With the quantum statistical relation,\nHawking's and this alternative KadS thermodynamics are also generalized from\nfour to higher dimensions.",
    "authors": [
      "T. L. Campos",
      "M. C. Baldiotti",
      "C. Molina"
    ],
    "publication_date": "2024-07-12T18:00:06Z",
    "arxiv_id": "http://arxiv.org/abs/2407.09610v1",
    "download_url": "http://arxiv.org/abs/2407.09610v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A dynamical systems perspective on the thermodynamics of late-time\n  cosmology",
    "abstract": "A thermodynamic description of cosmological spacetimes may provide insights\ninto the fundamentals of the cosmic evolution that remain otherwise obscure, in\nclose analogy with 'black hole thermodynamics'. We investigate the\nthermodynamic properties of late-time cosmological evolution using the\ndynamical systems approach, focusing on the $\\Lambda$CDM model and quintessence\nmodels with an exponential potential. Thermodynamic quantities obtained through\nthe Hayward-Kodama formalism are mapped onto the phase space of these models,\nallowing us to investigate thermodynamic stability and phase transitions in a\nmanner independent of the initial condition of the evolution of the universe.\nIn both models, the universe inevitably undergoes a thermodynamic phase\ntransition, marked by diverging specific heats, irrespective of its initial\nconfiguration. We further demonstrate that the thermodynamic stability can\noccur only during an accelerating phase of the universe. However, the necessary\nstability conditions are never satisfied anywhere in the phase space, rendering\nboth models inherently thermodynamically unstable within the Hayward-Kodama\nframework. Importantly, our analysis highlights the dynamical system approach\nas a natural and powerful framework to probe the thermodynamic aspects of\ncosmological evolution.",
    "authors": [
      "Dipayan Mukherjee",
      "Harkirat Singh Sahota",
      "Swati Gavas"
    ],
    "publication_date": "2025-09-05T09:43:14Z",
    "arxiv_id": "http://arxiv.org/abs/2509.04964v1",
    "download_url": "http://arxiv.org/abs/2509.04964v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New Thermodynamic Paradigm of Chemical Equilibria",
    "abstract": "The paper presents new thermodynamic paradigm of chemical equilibrium,\nsetting forth comprehensive basics of Discrete Thermodynamics of Chemical\nEquilibria (DTd). Along with previous results by the author during the last\ndecade, this work contains also some new developments of DTd. Based on the\nOnsager's constitutive equations, reformulated by the author thermodynamic\naffinity and reaction extent, and Le Chatelier's principle, DTd brings forward\na notion of chemical equilibrium as a balance of internal and external\nthermodynamic forces (TdF), acting against a chemical system. Basic expression\nof DTd is the chemical system logistic map of thermodynamic states that ties\ntogether energetic characteristics of chemical reaction, occurring in the\nsystem, the system shift from \"true\" thermodynamic equilibrium (TdE), and\ncausing that shift external thermodynamic forces. Solutions to the basic map\nare pitchfork bifurcation diagrams in coordinates \"shift from TdE - growth\nfactor (or TdF)\"; points, corresponding to the system thermodynamic states, are\ndwelling on its branches. The diagrams feature three typical areas: true\nthermodynamic equilibrium and open equilibrium along the thermodynamic branch\nbefore the threshold of its stability, i.e. bifurcation point, and bifurcation\narea with bistability and chaotic oscillations after the point. The set of\nsolutions makes up the chemical system domain of states. The new paradigm\ncomplies with the correspondence principle: in isolated chemical system\nexternal TdF vanish, and the basic map turns into traditional expression of\nchemical equilibrium via thermodynamic affinity. The theory binds together\nclassical and contemporary thermodynamics of chemical equilibria on a unique\nconceptual basis. The paper is essentially reworked and refocused version of\nthe earlier preprint on the DTd basics, supplemented with new results.",
    "authors": [
      "B. Zilbergleyt"
    ],
    "publication_date": "2011-10-28T02:17:22Z",
    "arxiv_id": "http://arxiv.org/abs/1110.6234v1",
    "download_url": "http://arxiv.org/abs/1110.6234v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of quantum systems strongly coupled to a heat bath I.\n  Operator thermodynamic functions and relations",
    "abstract": "The thermodynamics of small quantum many-body systems strongly coupled to a\nheat bath at low temperatures with non-Markovian behavior are new challenges\nfor quantum thermodynamics, as traditional thermodynamics is built on large\nsystems vanishingly weakly coupled to a non-dynamical reservoir. Important also\nare the quantum attributes, as in quantum coherence, correlations, entanglement\nand fluctuations. All told, one needs to reexamine the meaning of the\nthermodynamic functions, the viability of the thermodynamic relations and the\nvalidity of the thermodynamic laws anew. In one popular approach to quantum\nthermodynamics the closed system, comprising the system of interest and the\nbath it is strongly coupled to, is assumed to be in a global thermal state\nthroughout. In this set-up three theories of thermodynamics at strong coupling\nhave been proposed, those of Gelin & Thoss [1], Seifert [2] and Jarzynski [3].\nThis paper provides a quantum formulation of them, with Jarzynski's two\ndifferent representations encompassing the former two. Operator thermodynamic\npotentials and thermodynamic relations are presented. We mention issues related\nto energy and entropy in the two representations, a possible way to define\nquantum work in our functional formulation, and how to connect with the open\nsystem nonequilibrium dynamics approach to quantum thermodynamics, as proposed\nin [4].",
    "authors": [
      "Jen-Tsung Hsiang",
      "B. L. Hu"
    ],
    "publication_date": "2017-10-11T02:16:22Z",
    "arxiv_id": "http://arxiv.org/abs/1710.03882v1",
    "download_url": "http://arxiv.org/abs/1710.03882v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Schroedinger link between non-equilibrium thermodynamics and Fisher\n  information",
    "abstract": "It is known that equilibrium thermodynamics can be deduced from a constrained\nFisher information extemizing process. We show here that, more generally, both\nnon-equilibrium and equilibrium thermodynamics can be obtained from such a\nFisher treatment. Equilibrium thermodynamics corresponds to the ground state\nsolution, and non-equilibrium thermodynamics corresponds to excited state\nsolutions, of a Schroedinger wave equation (SWE). That equation appears as an\noutput of the constrained variational process that extremizes Fisher\ninformation. Both equilibrium- and non-equilibrium situations can thereby be\ntackled by one formalism that clearly exhibits the fact that thermodynamics and\nquantum mechanics can both be expressed in terms of a formal SWE, out of a\ncommon informational basis.",
    "authors": [
      "B. R. Frieden",
      "A. Plastino",
      "A. R. Plastino",
      "B. Soffer"
    ],
    "publication_date": "2002-06-07T14:14:37Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0206107v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0206107v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gravitation, Thermodynamics, and Quantum Theory",
    "abstract": "During the past 30 years, research in general relativity has brought to light\nstrong hints of a very deep and fundamental relationship between gravitation,\nthermodynamics, and quantum theory. The most striking indication of such a\nrelationship comes from black hole thermodynamics, where it appears that\ncertain laws of black hole mechanics are, in fact, simply the ordinary laws of\nthermodynamics applied to a system containing a black hole. This article will\nreview the present status of black hole thermodynamics and will discuss some of\nthe related unresolved issues concerning gravitation, thermodynamics, and\nquantum theory.",
    "authors": [
      "Robert M. Wald"
    ],
    "publication_date": "1999-01-12T22:00:13Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9901033v1",
    "download_url": "http://arxiv.org/abs/gr-qc/9901033v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic theory of kinetic overshoots",
    "abstract": "Everything that is not prohibited is permissible. So, what is prohibited in\nthe course of chemical reactions, heat transfer and other dissipative\nprocesses? Is it possible to \"overshoot\" the equilibrium, and if yes, then how\nfar? Thermodynamically allowed and prohibited trajectories of processes are\ndiscussed by the example of effects of equilibrium encircling. The complete\ntheory of thermodynamically accessible states is presented. The space of all\nthermodynamically admissible paths is presented by projection on the\n\"thermodynamic tree\", that is the tree of the related thermodynamic potential\n(entropy, free energy, free enthalpy) in the balance polyhedron. The stationary\nstates and limit points for open systems are localized too.",
    "authors": [
      "A. N. Gorban",
      "G. S. Yablonsky"
    ],
    "publication_date": "2005-05-19T16:36:42Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0505135v1",
    "download_url": "http://arxiv.org/abs/physics/0505135v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]