[
  {
    "title": "Can you sign a quantum state?",
    "abstract": "Cryptography with quantum states exhibits a number of surprising and counterintuitive features. In a 2002 work, Barnum et al. argue that these features imply that digital signatures for quantum states are impossible (Barnum et al., FOCS 2002). In this work, we ask: can all forms of signing quantum data, even in a possibly weak sense, be completely ruled out? We give two results which shed significant light on this basic question.\n  First, we prove an impossibility result for digital signatures for quantum data, which extends the result of Barnum et al. Specifically, we show that no nontrivial combination of correctness and security requirements can be fulfilled, beyond what is achievable simply by measuring the quantum message and then signing the outcome. In other words, only classical signature schemes exist.\n  We then show a positive result: a quantum state can be signed with the same security guarantees as classically, provided that it is also encrypted with the public key of the intended recipient. Following classical nomenclature, we call this notion quantum signcryption. Classically, signcryption is only interesting if it provides superior performance to encypt-then-sign. Quantumly, it is far more interesting: it is the only signing method available. We develop \"as-strong-as-classical\" security definitions for quantum signcryption and give secure constructions based on post-quantum public-key primitives. Along the way, we show that a natural hybrid method of combining classical and quantum schemes can be used to \"upgrade\" a secure classical scheme to the fully-quantum setting, in a wide range of cryptographic settings including signcryption, authenticated encryption, and CCA security.",
    "authors": [
      "Gorjan Alagic",
      "Tommaso Gagliardoni",
      "Christian Majenz"
    ],
    "publication_date": "2018-11-28T22:11:24Z",
    "arxiv_id": "http://arxiv.org/abs/1811.11858v5",
    "download_url": "https://arxiv.org/abs/1811.11858v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Optimal Control via Semi-Automatic Differentiation",
    "abstract": "We develop a framework of \"semi-automatic differentiation\" that combines existing gradient-based methods of quantum optimal control with automatic differentiation. The approach allows to optimize practically any computable functional and is implemented in two open source Julia packages, GRAPE.jl and Krotov.jl, part of the QuantumControl.jl framework. Our method is based on formally rewriting the optimization functional in terms of propagated states, overlaps with target states, or quantum gates. An analytical application of the chain rule then allows to separate the time propagation and the evaluation of the functional when calculating the gradient. The former can be evaluated with great efficiency via a modified GRAPE scheme. The latter is evaluated with automatic differentiation, but with a profoundly reduced complexity compared to the time propagation. Thus, our approach eliminates the prohibitive memory and runtime overhead normally associated with automatic differentiation and facilitates further advancement in quantum control by enabling the direct optimization of non-analytic functionals for quantum information and quantum metrology, especially in open quantum systems. We illustrate and benchmark the use of semi-automatic differentiation for the optimization of perfectly entangling quantum gates on superconducting qubits coupled via a shared transmission line. This includes the first direct optimization of the non-analytic gate concurrence.",
    "authors": [
      "Michael H. Goerz",
      "Sebastián C. Carrasco",
      "Vladimir S. Malinovsky"
    ],
    "publication_date": "2022-05-27T16:40:00Z",
    "arxiv_id": "http://arxiv.org/abs/2205.15044v2",
    "download_url": "https://arxiv.org/abs/2205.15044v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ferroelastic twin reorientation mechanisms in shape memory alloys elucidated with 3D X-ray microscopy",
    "abstract": "Three-dimensional (3D) X-ray diffraction methods were used to analyze the evolution of the load-induced rearrangements of monoclinic twin microstructures within bulk nickel-titanium specimens in 3D and across six orders of magnitude in length scales: changes in lattice plane spacings and orientations at the nanoscale, growth and nucleation of martensite twin variants at the microscale, and localization of plastic strain into deformation bands at the macroscale. Portions of the localized deformation bands were reconstructed in situ and in 3D. Analyses of the data elucidate the sequence of twin rearrangement mechanisms that occur within the propagating localized deformation bands, connect these mechanisms to the texture evolution, and reveal the effects of geometrically necessary lattice curvature across the band interfaces. The similarities between shear bands and localized deformation bands in twin reorientation are also discussed. These findings will guide future researchers in employing twin rearrangement in novel multiferroic technologies, and they demonstrate the strength of 3D, multiscale, in situ experiments to improve our understanding of complicated material behaviors and to provide opportunities to advance our abilities to model them.",
    "authors": [
      "Ashley N. Bucsek",
      "Darren C. Pagan",
      "L. Casalena",
      "Yuriy Chumlyakov",
      "Michael J. Mills",
      "Aaron P. Stebner"
    ],
    "publication_date": "2018-10-02T20:14:42Z",
    "arxiv_id": "http://arxiv.org/abs/1810.01493v2",
    "download_url": "https://arxiv.org/abs/1810.01493v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Single-shot Adaptive Measurement for Quantum-enhanced Metrology",
    "abstract": "Quantum-enhanced metrology aims to estimate an unknown parameter such that the precision scales better than the shot-noise bound. Single-shot adaptive quantum-enhanced metrology (AQEM) is a promising approach that uses feedback to tweak the quantum process according to previous measurement outcomes. Techniques and formalism for the adaptive case are quite different from the usual non-adaptive quantum metrology approach due to the causal relationship between measurements and outcomes. We construct a formal framework for AQEM by modeling the procedure as a decision-making process, and we derive the imprecision and the Cramér-Rao lower bound with explicit dependence on the feedback policy. We also explain the reinforcement learning approach for generating quantum control policies, which is adopted due to the optimal policy being non-trivial to devise. Applying a learning algorithm based on differential evolution enables us to attain imprecision for adaptive interferometric phase estimation, which turns out to be SQL when non-entangled particles are used in the scheme.",
    "authors": [
      "Pantita Palittapongarnpim",
      "Peter Wittek",
      "Barry C. Sanders"
    ],
    "publication_date": "2016-08-22T17:52:28Z",
    "arxiv_id": "http://arxiv.org/abs/1608.06238v1",
    "download_url": "https://arxiv.org/abs/1608.06238v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Orthogonal-state-based cryptography in quantum mechanics and local post-quantum theories",
    "abstract": "We introduce the concept of cryptographic reduction, in analogy with a similar concept in computational complexity theory. In this framework, class $A$ of crypto-protocols reduces to protocol class $B$ in a scenario $X$, if for every instance $a$ of $A$, there is an instance $b$ of $B$ and a secure transformation $X$ that reproduces $a$ given $b$, such that the security of $b$ guarantees the security of $a$. Here we employ this reductive framework to study the relationship between security in quantum key distribution (QKD) and quantum secure direct communication (QSDC). We show that replacing the streaming of independent qubits in a QKD scheme by block encoding and transmission (permuting the order of particles block by block) of qubits, we can construct a QSDC scheme. This forms the basis for the \\textit{block reduction} from a QSDC class of protocols to a QKD class of protocols, whereby if the latter is secure, then so is the former. Conversely, given a secure QSDC protocol, we can of course construct a secure QKD scheme by transmitting a random key as the direct message. Then the QKD class of protocols is secure, assuming the security of the QSDC class which it is built from. We refer to this method of deduction of security for this class of QKD protocols, as \\textit{key reduction}. Finally, we propose an orthogonal-state-based deterministic key distribution (KD) protocol which is secure in some local post-quantum theories. Its security arises neither from geographic splitting of a code state nor from Heisenberg uncertainty, but from post-measurement disturbance.",
    "authors": [
      "S. Aravinda",
      "Anindita Banerjee",
      "Anirban Pathak",
      "R. Srikanth"
    ],
    "publication_date": "2014-09-30T12:06:22Z",
    "arxiv_id": "http://arxiv.org/abs/1409.8505v2",
    "download_url": "https://arxiv.org/abs/1409.8505v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Immanent Powers versus Causal Powers (Propensities, Latencies and Dispositions) in Quantum Mechanics",
    "abstract": "In this paper we compare two different notions of 'power', both of which attempt to provide a realist understanding of quantum mechanics grounded on the potential mode of existence. For this propose we will begin by introducing two different notions of potentiality present already within Aristotelian metaphysics, namely, irrational potentiality and rational potentiality. After discussing the role played by potentiality within classical and quantum mechanics, we will address the notion of causal power which is directly related to irrational potentiality and has been adopted by many interpretations of QM. We will then present the notion of immanent power which relates to rational potentiality and argue that this new concept presents important advantages regarding the possibilities it provides for understanding in a novel manner the theory of quanta. We end our paper with a comparison between both notions of 'power', stressing some radical differences between them.",
    "authors": [
      "Christian de Ronde"
    ],
    "publication_date": "2017-11-06T22:13:19Z",
    "arxiv_id": "http://arxiv.org/abs/1711.02997v1",
    "download_url": "https://arxiv.org/abs/1711.02997v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Coulomb potential in quantum mechanics revisited",
    "abstract": "The procedure commonly used in textbooks for determining the eigenvalues and eigenstates for a particle in an attractive Coulomb potential is not symmetric in the way the boundary conditions at $r=0$ and $r \\rightarrow \\infty$ are considered. We highlight this fact by solving a model for the Coulomb potential with a cutoff (representing the finite extent of the nucleus); in the limit that the cutoff is reduced to zero we recover the standard result, albeit in a non-standard way. This example is used to emphasize that a more consistent approach to solving the Coulomb problem in quantum mechanics requires an examination of the non-standard solution. The end result is, of course, the same.",
    "authors": [
      "A. A. Othman",
      "M. de Montigny",
      "F. Marsiglio"
    ],
    "publication_date": "2016-12-16T04:44:12Z",
    "arxiv_id": "http://arxiv.org/abs/1612.06706v1",
    "download_url": "https://arxiv.org/abs/1612.06706v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Implementation security in quantum key distribution",
    "abstract": "The problem of implementation security in quantum key distribution (QKD) refers to the difficulty of meeting the requirements of mathematical security proofs in real-life QKD systems. Here, we provide a succint review on this topic, focusing on discrete variable QKD setups. Particularly, we discuss some of their main vulnerabilities and comment on possible approaches to overcome them.",
    "authors": [
      "Víctor Zapatero",
      "Álvaro Navarrete",
      "Marcos Curty"
    ],
    "publication_date": "2023-10-31T11:36:58Z",
    "arxiv_id": "http://arxiv.org/abs/2310.20377v1",
    "download_url": "https://arxiv.org/abs/2310.20377v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gauge invariant information concerning quantum channels",
    "abstract": "Motivated by the gate set tomography we study quantum channels from the perspective of information which is invariant with respect to the gauge realized through similarity of matrices representing channel superoperators. We thus use the complex spectrum of the superoperator to provide necessary conditions relevant for complete positivity of qubit channels and to express various metrics such as average gate fidelity.",
    "authors": [
      "Łukasz Rudnicki",
      "Zbigniew Puchała",
      "Karol Zyczkowski"
    ],
    "publication_date": "2017-07-21T15:00:41Z",
    "arxiv_id": "http://arxiv.org/abs/1707.06926v2",
    "download_url": "https://arxiv.org/abs/1707.06926v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Confinement and Kink Entanglement Asymmetry on a Quantum Ising Chain",
    "abstract": "In this work, we explore the interplay of confinement, string breaking and entanglement asymmetry on a 1D quantum Ising chain. We consider the evolution of an initial domain wall and show that, surprisingly, while the introduction of confinement through a longitudinal field typically suppresses entanglement, it can also serve to increase it beyond a bound set for free particles. Our model can be tuned to conserve the number of domain walls, which gives an opportunity to explore entanglement asymmetry associated with link variables. We study two approaches to deal with the non-locality of the link variables, either directly or following a Kramers-Wannier transformation that maps bond variables (kinks) to site variables (spins). We develop a numerical procedure for computing the asymmetry using tensor network methods and use it to demonstrate the different types of entanglement and entanglement asymmetry.",
    "authors": [
      "Brian J. J. Khor",
      "D. M. Kürkçüoglu",
      "T. J. Hobbs",
      "G. N. Perdue",
      "Israel Klich"
    ],
    "publication_date": "2023-12-14T01:55:12Z",
    "arxiv_id": "http://arxiv.org/abs/2312.08601v3",
    "download_url": "https://arxiv.org/abs/2312.08601v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Digital Quantum Simulation with Rydberg Atoms",
    "abstract": "We discuss in detail the implementation of an open-system quantum simulator with Rydberg states of neutral atoms held in an optical lattice. Our scheme allows one to realize both coherent as well as dissipative dynamics of complex spin models involving many-body interactions and constraints. The central building block of the simulation scheme is constituted by a mesoscopic Rydberg gate that permits the entanglement of several atoms in an efficient, robust and quick protocol. In addition, optical pumping on ancillary atoms provides the dissipative ingredient for engineering the coupling between the system and a tailored environment. As an illustration, we discuss how the simulator enables the simulation of coherent evolution of quantum spin models such as the two-dimensional Heisenberg model and Kitaev's toric code, which involves four-body spin interactions. We moreover show that in principle also the simulation of lattice fermions can be achieved. As an example for controlled dissipative dynamics, we discuss ground state cooling of frustration-free spin Hamiltonians.",
    "authors": [
      "H. Weimer",
      "M. Müller",
      "H. P. Büchler",
      "I. Lesanovsky"
    ],
    "publication_date": "2011-04-15T15:11:01Z",
    "arxiv_id": "http://arxiv.org/abs/1104.3081v2",
    "download_url": "https://arxiv.org/abs/1104.3081v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Monte Carlo simulations for financial risk analytics: scenario generation for equity, rate, and credit risk factors",
    "abstract": "Monte Carlo (MC) simulations are widely used in financial risk management, from estimating value-at-risk (VaR) to pricing over-the-counter derivatives. However, they come at a significant computational cost due to the number of scenarios required for convergence. If a probability distribution is available, Quantum Amplitude Estimation (QAE) algorithms can provide a quadratic speed-up in measuring its properties as compared to their classical counterparts. Recent studies have explored the calculation of common risk measures and the optimisation of QAE algorithms by initialising the input quantum states with pre-computed probability distributions. If such distributions are not available in closed form, however, they need to be generated numerically, and the associated computational cost may limit the quantum advantage. In this paper, we bypass this challenge by incorporating scenario generation -- i.e. simulation of the risk factor evolution over time to generate probability distributions -- into the quantum computation; we refer to this process as Quantum MC (QMC) simulations. Specifically, we assemble quantum circuits that implement stochastic models for equity (geometric Brownian motion), interest rate (mean-reversion models), and credit (structural, reduced-form, and rating migration credit models) risk factors. We then integrate these models with QAE to provide end-to-end examples for both market and credit risk use cases.",
    "authors": [
      "Titos Matsakos",
      "Stuart Nield"
    ],
    "publication_date": "2023-03-16T22:57:15Z",
    "arxiv_id": "http://arxiv.org/abs/2303.09682v2",
    "download_url": "https://arxiv.org/abs/2303.09682v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multi-Armed Bandits and Quantum Channel Oracles",
    "abstract": "Multi-armed bandits are one of the theoretical pillars of reinforcement learning. Recently, the investigation of quantum algorithms for multi-armed bandit problems was started, and it was found that a quadratic speed-up (in query complexity) is possible when the arms and the randomness of the rewards of the arms can be queried in superposition. Here we introduce further bandit models where we only have limited access to the randomness of the rewards, but we can still query the arms in superposition. We show that then the query complexity is the same as for classical algorithms. This generalizes the prior result that no speed-up is possible for unstructured search when the oracle has positive failure probability.",
    "authors": [
      "Simon Buchholz",
      "Jonas M. Kübler",
      "Bernhard Schölkopf"
    ],
    "publication_date": "2023-01-20T13:01:40Z",
    "arxiv_id": "http://arxiv.org/abs/2301.08544v4",
    "download_url": "https://arxiv.org/abs/2301.08544v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Maxwell quantum mechanics",
    "abstract": "We extend classical Maxwell field theory to a first quantized theory of the photon by deriving a conserved Lorentz four-current whose zero component is a positive definite number density. Fields are real and their positive (negative) frequency parts are interpreted as absorption (emission) of a positive energy photon. With invariant plane wave normalization, the photon position operator is Hermitian with instantaneously localized eigenvectors that transform as Lorentz four-vectors. Reality of the fields and wave function ensure causal propagation and zero net absorption of energy in the absence of charged matter. The photon probability amplitude is the real part of the projection of the photon's state vector onto a basis of position eigenvectors and its square implements the Born rule. Manifest covariance and consistency with quantum field theory is maintained through use of the electromagnetic four-potential and the Lorenz gauge.",
    "authors": [
      "Margaret Hawton"
    ],
    "publication_date": "2019-02-27T13:56:03Z",
    "arxiv_id": "http://arxiv.org/abs/1902.10537v2",
    "download_url": "https://arxiv.org/abs/1902.10537v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Extended Bloch Representation of Quantum Mechanics for Infinite-Dimensional Entities",
    "abstract": "We show that the extended Bloch representation of quantum mechanics also applies to infinite-dimensional entities, to the extent that the number of (possibly infinitely degenerate) outcomes of a measurement remains finite, which is always the case in practical situations.",
    "authors": [
      "Diederik Aerts",
      "Massimiliano Sassoli de Bianchi"
    ],
    "publication_date": "2017-04-20T17:51:07Z",
    "arxiv_id": "http://arxiv.org/abs/1704.06249v1",
    "download_url": "https://arxiv.org/abs/1704.06249v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Hoare logic with classical variables",
    "abstract": "Hoare logic provides a syntax-oriented method to reason about program correctness and has been proven effective in the verification of classical and probabilistic programs. Existing proposals for quantum Hoare logic either lack completeness or support only quantum variables, thus limiting their capability in practical use. In this paper, we propose a quantum Hoare logic for a simple while language which involves both classical and quantum variables. Its soundness and relative completeness are proven for both partial and total correctness of quantum programs written in the language. Remarkably, with novel definitions of classical-quantum states and corresponding assertions, the logic system is quite simple and similar to the traditional Hoare logic for classical programs. Furthermore, to simplify reasoning in real applications, auxiliary proof rules are provided which support standard logical operation in the classical part of assertions, and of super-operator application in the quantum part. Finally, a series of practical quantum algorithms, in particular the whole algorithm of Shor's factorisation, are formally verified to show the effectiveness of the logic.",
    "authors": [
      "Yuan Feng",
      "Mingsheng Ying"
    ],
    "publication_date": "2020-08-15T23:56:18Z",
    "arxiv_id": "http://arxiv.org/abs/2008.06812v2",
    "download_url": "https://arxiv.org/abs/2008.06812v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Next Generation Reservoir Computing: An Efficient Quantum Algorithm for Forecasting Quantum Dynamics",
    "abstract": "Next Generation Reservoir Computing (NG-RC) is a modern class of model-free machine learning that enables an accurate forecasting of time series data generated by dynamical systems. We demonstrate that NG-RC can accurately predict full many-body quantum dynamics in both integrable and chaotic systems. This is in contrast to the conventional application of reservoir computing that concentrates on the prediction of the dynamics of observables. In addition, we apply a technique which we refer to as skipping ahead to predict far future states accurately without the need to extract information about the intermediate states. However, adopting a classical NG-RC for many-body quantum dynamics prediction is computationally prohibitive due to the large Hilbert space of sample input data. In this work, we propose an end-to-end quantum algorithm for many-body quantum dynamics forecasting with a quantum computational speedup via the block-encoding technique. This proposal presents an efficient model-free quantum scheme to forecast quantum dynamics coherently, bypassing inductive biases incurred in a model-based approach.",
    "authors": [
      "Apimuk Sornsaeng",
      "Ninnat Dangniam",
      "Thiparat Chotibut"
    ],
    "publication_date": "2023-08-28T00:34:40Z",
    "arxiv_id": "http://arxiv.org/abs/2308.14239v2",
    "download_url": "https://arxiv.org/abs/2308.14239v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The fundamental connections between classical Hamiltonian mechanics, quantum mechanics and information entropy",
    "abstract": "We show that the main difference between classical and quantum systems can be understood in terms of information entropy. Classical systems can be considered the ones where the internal dynamics can be known with arbitrary precision while quantum systems can be considered the ones where the internal dynamics cannot be accessed at all. As information entropy can be used to characterize how much the state of the whole system identifies the state of its parts, classical systems can have arbitrarily small information entropy while quantum systems cannot. This provides insights that allow us to understand the analogies and differences between the two theories.",
    "authors": [
      "Gabriele Carcassi",
      "Christine A. Aidala"
    ],
    "publication_date": "2020-01-20T18:47:40Z",
    "arxiv_id": "http://arxiv.org/abs/2001.07206v1",
    "download_url": "https://arxiv.org/abs/2001.07206v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interactive learning tutorials on quantum mechanics",
    "abstract": "We discuss the development and evaluation of quantum interactive learning tutorials (QuILTs) which are suitable for undergraduate courses in quantum mechanics. QuILTs are based on the investigation of student difficulties in learning quantum physics. They exploit computer-based visualization tools and help students build links between the formal and conceptual aspects of quantum physics without compromising the technical content. They can be used both as supplements to lectures or as a self-study tool.",
    "authors": [
      "Chandralekha Singh"
    ],
    "publication_date": "2016-03-10T00:16:21Z",
    "arxiv_id": "http://arxiv.org/abs/1603.03108v1",
    "download_url": "https://arxiv.org/abs/1603.03108v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Parameter Setting in Quantum Approximate Optimization of Weighted Problems",
    "abstract": "Quantum Approximate Optimization Algorithm (QAOA) is a leading candidate algorithm for solving combinatorial optimization problems on quantum computers. However, in many cases QAOA requires computationally intensive parameter optimization. The challenge of parameter optimization is particularly acute in the case of weighted problems, for which the eigenvalues of the phase operator are non-integer and the QAOA energy landscape is not periodic. In this work, we develop parameter setting heuristics for QAOA applied to a general class of weighted problems. First, we derive optimal parameters for QAOA with depth $p=1$ applied to the weighted MaxCut problem under different assumptions on the weights. In particular, we rigorously prove the conventional wisdom that in the average case the first local optimum near zero gives globally-optimal QAOA parameters. Second, for $p\\geq 1$ we prove that the QAOA energy landscape for weighted MaxCut approaches that for the unweighted case under a simple rescaling of parameters. Therefore, we can use parameters previously obtained for unweighted MaxCut for weighted problems. Finally, we prove that for $p=1$ the QAOA objective sharply concentrates around its expectation, which means that our parameter setting rules hold with high probability for a random weighted instance. We numerically validate this approach on general weighted graphs and show that on average the QAOA energy with the proposed fixed parameters is only $1.1$ percentage points away from that with optimized parameters. Third, we propose a general heuristic rescaling scheme inspired by the analytical results for weighted MaxCut and demonstrate its effectiveness using QAOA with the XY Hamming-weight-preserving mixer applied to the portfolio optimization problem. Our heuristic improves the convergence of local optimizers, reducing the number of iterations by 7.4x on average.",
    "authors": [
      "Shree Hari Sureshbabu",
      "Dylan Herman",
      "Ruslan Shaydulin",
      "Joao Basso",
      "Shouvanik Chakrabarti",
      "Yue Sun",
      "Marco Pistoia"
    ],
    "publication_date": "2023-05-24T14:37:33Z",
    "arxiv_id": "http://arxiv.org/abs/2305.15201v3",
    "download_url": "https://arxiv.org/abs/2305.15201v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Contributions of different parts of spin-spin interactions to quantum correlations in a spin ring model in an external magnetic field",
    "abstract": "We study quantum correlations in a bipartite heteronuclear $(N-1)\\times1$ system in an external magnetic field. The system consists of a spin ring with an arbitrary number $N-1$ of spins on the ring and one spin in its center. The spins on the ring are connected by secular dipole-dipole interactions and interact with the central spin through the Heisenberg $zz$-interaction. We show that the quantum discord, describing quantum correlations between the ring and the central spin, can be obtained analytically for this model in the high temperature approximation. The model allows us to find contributions of different parts of the spin-spin interactions to quantum correlations. We also investigate the evolution of quantum and classical correlations at different numbers of spins.",
    "authors": [
      "S. I. Doronin",
      "E. B. Fel'dman",
      "E. I. Kuznetsova"
    ],
    "publication_date": "2015-05-14T15:02:59Z",
    "arxiv_id": "http://arxiv.org/abs/1505.03748v1",
    "download_url": "https://arxiv.org/abs/1505.03748v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hidden variable model for quantum computation with magic states on qudits of any dimension",
    "abstract": "It was recently shown that a hidden variable model can be constructed for universal quantum computation with magic states on qubits. Here we show that this result can be extended, and a hidden variable model can be defined for quantum computation with magic states on qudits with any Hilbert space dimension. This model leads to a classical simulation algorithm for universal quantum computation.",
    "authors": [
      "Michael Zurel",
      "Cihan Okay",
      "Robert Raussendorf",
      "Arne Heimendahl"
    ],
    "publication_date": "2021-10-23T23:57:03Z",
    "arxiv_id": "http://arxiv.org/abs/2110.12318v3",
    "download_url": "https://arxiv.org/abs/2110.12318v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Realization of quantum signal processing on a noisy quantum computer",
    "abstract": "Quantum signal processing (QSP) is a powerful toolbox for the design of quantum algorithms and can lead to asymptotically optimal computational costs. Its realization on noisy quantum computers without fault tolerance, however, is challenging because it requires a deep quantum circuit in general. We propose a strategy to run an entire QSP protocol on noisy quantum hardware by carefully reducing overhead costs at each step. To illustrate the approach, we consider the application of Hamiltonian simulation for which QSP implements a polynomial approximation of the time evolution operator. We test the protocol by running the algorithm on the Quantinuum H1-1 trapped-ion quantum computer powered by Honeywell. In particular, we compute the time dependence of bipartite entanglement entropies for Ising spin chains and find good agreements with exact numerical simulations. To make the best use of the device, we determine optimal experimental parameters by using a simplified error model for the hardware and numerically studying the trade-off between Hamiltonian simulation time, polynomial degree, and total accuracy. Our results are the first step in the experimental realization of QSP-based quantum algorithms.",
    "authors": [
      "Yuta Kikuchi",
      "Conor Mc Keever",
      "Luuk Coopmans",
      "Michael Lubasch",
      "Marcello Benedetti"
    ],
    "publication_date": "2023-03-09T19:00:17Z",
    "arxiv_id": "http://arxiv.org/abs/2303.05533v3",
    "download_url": "https://arxiv.org/abs/2303.05533v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simplifying a classical-quantum algorithm interpolation with quantum singular value transformations",
    "abstract": "The problem of Phase Estimation (or Amplitude Estimation) admits a quadratic quantum speedup. Wang, Higgott and Brierley [2019, Phys. Rev. Lett. 122 140504] have shown that there is a continuous trade-off between quantum speedup and circuit depth (by defining a family of algorithms known as $α$-QPE). In this work, we show that the scaling of $α$-QPE can be naturally and succinctly derived within the framework of Quantum Singular Value Transformation (QSVT). From the QSVT perspective, a greater number of coherent oracle calls translates into a better polynomial approximation to the sign function, which is the key routine for solving Phase Estimation. The better the approximation to the sign function, the fewer samples one needs to determine the sign accurately. With this idea, we simplify the proof of $α$-QPE, while providing a new interpretation of the interpolation parameters, and show that QSVT is a promising framework for reasoning about classical-quantum interpolations.",
    "authors": [
      "Duarte Magano",
      "Miguel Murça"
    ],
    "publication_date": "2022-07-29T17:57:03Z",
    "arxiv_id": "http://arxiv.org/abs/2207.14810v3",
    "download_url": "https://arxiv.org/abs/2207.14810v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entropic distinguishability of quantum fields in phase space",
    "abstract": "We present a general way of quantifying the entropic uncertainty of quantum field configurations in phase space in terms of entropic distinguishability with respect to the vacuum. Our approach is based on the functional Husimi $Q$-distribution and a suitably chosen relative entropy, which we show to be non-trivially bounded from above by the uncertainty principle. The resulting relative entropic uncertainty relation is as general as the concept of coherent states and thus holds for quantum fields of bosonic and fermionic type. Its simple form enables diverse applications, among which we present a complete characterization of the uncertainty surplus of arbitrary states in terms of the total particle number for a scalar field and the fermionic description of the Ising model. Moreover, we provide a quantitative interpretation of the role of the uncertainty principle for quantum phase transitions.",
    "authors": [
      "Sara Ditsch",
      "Tobias Haas"
    ],
    "publication_date": "2023-07-12T12:31:38Z",
    "arxiv_id": "http://arxiv.org/abs/2307.06128v2",
    "download_url": "https://arxiv.org/abs/2307.06128v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Hairs and Entropy of Quantum Isolated Horizon from Chern-Simons Theory",
    "abstract": "We articulate the fact that the loop quantum gravity description of the quantum macrostates of black hole horizons, modeled as Quantum Isolated Horizons (QIHs), is completely characterized in terms of two independent integer-valued `quantum hairs', viz,. the coupling constant $(k)$ of the quantum $SU(2)$ Chern-Simons theory describing QIH dynamics, and the number of punctures $(N)$ produced by the bulk spin network edges piercing the isolated horizon (which act as pointlike sources for the Chern- Simons fields). We demonstrate that the microcanonical entropy of macroscopic (both parameters assuming very large values) QIHs can be obtained directly from the microstates of this Chern-Simons theory, using standard statistical mechanical methods, without having to additionally postulate the horizon as an ideal gas of punctures, or incorporate any additional classical or semi-classical input from general relativity vis-a-vis the functional dependence of the IH mass on its area, or indeed, without having to restrict to any special class of spins. Requiring the validity of the Bekenstein-Hawking area law relates these two parameters (as an equilibrium `equation of state') and consequently allows the Barbero-Immirzi parameter to take any real and positive value depending on the value of $k/N$. The logarithmic correction to the area law obtained a decade ago by R. Kaul and one of us (P.M.), ensues straightforwardly, with precisely the coefficient -3/2, making it a signature of the loop quantum gravity approach to black hole entropy.",
    "authors": [
      "Abhishek Majhi",
      "Parthasarathi Majumdar"
    ],
    "publication_date": "2013-01-19T10:10:24Z",
    "arxiv_id": "http://arxiv.org/abs/1301.4553v3",
    "download_url": "https://arxiv.org/abs/1301.4553v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spectral chaos bounds from scaling theory of maximally efficient quantum-dynamical scrambling",
    "abstract": "A key conjecture about the evolution of complex quantum systems towards an ergodic steady state, known as scrambling, is that this process acquires universal features when it is most efficient. We develop a single-parameter scaling theory for the spectral statistics in this scenario, which embodies exact self-similarity of the spectral correlations along the complete scrambling dynamics. We establish that the scaling predictions are matched by a privileged stochastic process and serve as bounds for other dynamical scrambling scenarios, allowing one to quantify inefficient or incomplete scrambling on all time scales.",
    "authors": [
      "Tara Kalsi",
      "Alessandro Romito",
      "Henning Schomerus"
    ],
    "publication_date": "2023-10-17T15:41:50Z",
    "arxiv_id": "http://arxiv.org/abs/2310.11355v3",
    "download_url": "https://arxiv.org/abs/2310.11355v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An experiment that proves the absence of nonlocality in quantum mechanics",
    "abstract": "I have been arguing that quantum nonlocality, deeply entrenched in the present formalism of quantum mechanics and widely believed as a reality by physicists, is in fact absent. Spooky nonlocal state reduction is the most, and perhaps the only irrational feature of present day physics. There are experimental results that reject nonlocal state reduction at a distance. Also, there are arguments that show that signal locality itself can be violated if there is true nonlocal collapse of the wavefunction. The Bell's inequalities, the violation of which polarized physicists in favour of nonlocality, arise not due to nonlocality, but due to ignoring prior information on correlations encoded in the phase of local probability amplitudes. Here I discuss an experiment involving particles entangled in energy and time variables that shows that there is no nonlocal state reduction during measurements on entangled particles. Quantum mechanics is inconsistent if it includes the concept of wavefunction collapse as a physical process for entangled multi-particle systems.",
    "authors": [
      "C . S. Unnikrishnan"
    ],
    "publication_date": "2002-06-27T14:58:25Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0206190v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0206190v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Instantaneous Quantum Polynomial-Time Sampling and Verifiable Quantum Advantage: Stabilizer Scheme and Classical Security",
    "abstract": "Sampling problems demonstrating beyond classical computing power with noisy intermediate scale quantum devices have been experimentally realized. In those realizations, however, our trust that the quantum devices faithfully solve the claimed sampling problems is usually limited to simulations of smaller-scale instances and is, therefore, indirect. The problem of verifiable quantum advantage aims to resolve this critical issue and provides us with greater confidence in a claimed advantage. Instantaneous quantum polynomial-time (IQP) sampling has been proposed to achieve beyond classical capabilities with a verifiable scheme based on quadratic-residue codes (QRC). Unfortunately, this verification scheme was recently broken by an attack proposed by Kahanamoku-Meyer. In this work, we revive IQP-based verifiable quantum advantage by making two major contributions. Firstly, we introduce a family of IQP sampling protocols called the stabilizer scheme, which builds on results linking IQP circuits, the stabilizer formalism, coding theory, and an efficient characterization of IQP circuit correlation functions. This construction extends the scope of existing IQP-based schemes while maintaining their simplicity and verifiability. Secondly, we introduce the Hidden Structured Code (HSC) problem as a well-defined mathematical challenge that underlies the stabilizer scheme. To assess classical security, we explore a class of attacks based on secret extraction, including the Kahanamoku-Meyer's attack as a special case. We provide evidence of the security of the stabilizer scheme, assuming the hardness of the HSC problem. We also point out that the vulnerability observed in the original QRC scheme is primarily attributed to inappropriate parameter choices, which can be naturally rectified with proper parameter settings.",
    "authors": [
      "Michael J. Bremner",
      "Bin Cheng",
      "Zhengfeng Ji"
    ],
    "publication_date": "2023-08-14T14:03:33Z",
    "arxiv_id": "http://arxiv.org/abs/2308.07152v2",
    "download_url": "https://arxiv.org/abs/2308.07152v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The arrow of time in operational formulations of quantum theory",
    "abstract": "The operational formulations of quantum theory are drastically time oriented. However, to the best of our knowledge, microscopic physics is time-symmetric. We address this tension by showing that the asymmetry of the operational formulations does not reflect a fundamental time-orientation of physics. Instead, it stems from built-in assumptions about the $users$ of the theory. In particular, these formalisms are designed for predicting the future based on information about the past, and the main mathematical objects contain implicit assumption about the past, but not about the future. The main asymmetry in quantum theory is the difference between knowns and unknowns.",
    "authors": [
      "Andrea Di Biagio",
      "Pietro Donà",
      "Carlo Rovelli"
    ],
    "publication_date": "2020-10-12T14:27:21Z",
    "arxiv_id": "http://arxiv.org/abs/2010.05734v2",
    "download_url": "https://arxiv.org/abs/2010.05734v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Does universality of free-fall apply to the motion of quantum probes?",
    "abstract": "Can quantum-mechanical particles propagating on a fixed spacetime background be approximated as test bodies satisfying the weak equivalence principle? We ultimately answer the question in the negative but find that, when universality of free-fall is assessed locally, a nontrivial agreement between quantum mechanics and the weak equivalence principle exists. Implications for mass sensing by quantum probes are discussed in some details.",
    "authors": [
      "Luigi Seveso",
      "Valerio Peri",
      "Matteo G. A. Paris"
    ],
    "publication_date": "2017-02-24T10:22:55Z",
    "arxiv_id": "http://arxiv.org/abs/1702.07526v1",
    "download_url": "https://arxiv.org/abs/1702.07526v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Autonomous Quantum Error Correction in a Four-Photon Kerr Parametric Oscillator",
    "abstract": "Autonomous quantum error correction has gained considerable attention to avoid complicated measurements and feedback. Despite its simplicity compared with the conventional measurement-based quantum error correction, it is still a far from practical technique because of significant hardware overhead. We propose an autonomous quantum error correction scheme for a rotational symmetric bosonic code in a four-photon Kerr parametric oscillator. Our scheme is the simplest possible error correction scheme that can surpass the break-even point -- it requires only a single continuous microwave tone. We also introduce an unconditional reset scheme that requires one more continuous microwave tone in addition to that for the error correction. The key properties underlying this simplicity are protected quasienergy states of a four-photon Kerr parametric oscillator and the degeneracy in its quasienergy level structure. These properties eliminate the need for state-by-state correction in the Fock basis. Our schemes greatly reduce the complexity of autonomous quantum error correction and thus may accelerate the use of the bosonic code for practical quantum computation.",
    "authors": [
      "Sangil Kwon",
      "Shohei Watabe",
      "Jaw-Shen Tsai"
    ],
    "publication_date": "2022-03-17T10:54:18Z",
    "arxiv_id": "http://arxiv.org/abs/2203.09234v1",
    "download_url": "https://arxiv.org/abs/2203.09234v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entanglement for discrete-time quantum walks on the line",
    "abstract": "The discrete-time quantum walk is a quantum counterpart of the random walk. It is expected that the model plays important roles in the quantum field. In the quantum information theory, entanglement is a key resource. We use the von Neumann entropy to measure the entanglement between the coin and the particle's position of the quantum walks. Also we deal with the Shannon entropy which is an important quantity in the information theory. In this paper, we show limits of the von Neumann entropy and the Shannon entropy of the quantum walks on the one dimensional lattice starting from the origin defined by arbitrary coin and initial state. In order to derive these limits, we use the path counting method which is a combinatorial method for computing probability amplitude.",
    "authors": [
      "Yusuke Ide",
      "Norio Konno",
      "Takuya Machida"
    ],
    "publication_date": "2010-12-19T12:55:21Z",
    "arxiv_id": "http://arxiv.org/abs/1012.4164v2",
    "download_url": "https://arxiv.org/abs/1012.4164v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multivariate trace estimation in constant quantum depth",
    "abstract": "There is a folkloric belief that a depth-$Θ(m)$ quantum circuit is needed to estimate the trace of the product of $m$ density matrices (i.e., a multivariate trace), a subroutine crucial to applications in condensed matter and quantum information science. We prove that this belief is overly conservative by constructing a constant quantum-depth circuit for the task, inspired by the method of Shor error correction. Furthermore, our circuit demands only local gates in a two dimensional circuit -- we show how to implement it in a highly parallelized way on an architecture similar to that of Google's Sycamore processor. With these features, our algorithm brings the central task of multivariate trace estimation closer to the capabilities of near-term quantum processors. We instantiate the latter application with a theorem on estimating nonlinear functions of quantum states with \"well-behaved\" polynomial approximations.",
    "authors": [
      "Yihui Quek",
      "Eneet Kaur",
      "Mark M. Wilde"
    ],
    "publication_date": "2022-06-30T16:44:58Z",
    "arxiv_id": "http://arxiv.org/abs/2206.15405v3",
    "download_url": "https://arxiv.org/abs/2206.15405v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum games: a review of the history, current state, and interpretation",
    "abstract": "We review both theoretical and experimental developments in the area of quantum games since the inception of the subject circa 1999. We will also offer a narrative on the controversy that surrounded the subject in its early days, and how this controversy has affected the development of the subject.",
    "authors": [
      "Faisal Shah Khan",
      "Neal Solmeyer",
      "Radhakrishnan Balu",
      "Travis Humble"
    ],
    "publication_date": "2018-03-21T13:43:26Z",
    "arxiv_id": "http://arxiv.org/abs/1803.07919v2",
    "download_url": "https://arxiv.org/abs/1803.07919v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time-optimal quantum transformations with bounded bandwidth",
    "abstract": "In this paper, we derive sharp lower bounds, also known as quantum speed limits, for the time it takes to transform a quantum system into a state such that an observable assumes its lowest average value. We assume that the system is initially in an incoherent state relative to the observable and that the state evolves according to a von Neumann equation with a Hamiltonian whose bandwidth is uniformly bounded. The transformation time depends intricately on the observable's and the initial state's eigenvalue spectrum and the relative constellation of the associated eigenspaces. The problem of finding quantum speed limits consequently divides into different cases requiring different strategies. We derive quantum speed limits in a large number of cases, and we simultaneously develop a method to break down complex cases into manageable ones. The derivations involve both combinatorial and differential geometric techniques. We also study multipartite systems and show that allowing correlations between the parts can speed up the transformation time. In a final section, we use the quantum speed limits to obtain upper bounds on the power with which energy can be extracted from quantum batteries.",
    "authors": [
      "Dan Allan",
      "Niklas Hörnedal",
      "Ole Andersson"
    ],
    "publication_date": "2020-11-24T08:42:08Z",
    "arxiv_id": "http://arxiv.org/abs/2011.11963v3",
    "download_url": "https://arxiv.org/abs/2011.11963v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classical and quantum speed limits",
    "abstract": "The new bound on quantum speed limit (in terms of relative purity) is derived by applying the original Mandelstam-Tamm one to the evolution in the space of Hilbert-Schmidt operators acting in the initial space of states. It is shown that it provides the quantum counterpart of the classical speed limit derived in Phys. Rev. Lett. 120 (2018), 070402 and the $\\hbar\\rightarrow 0$ limit of the former yields the latter. The existence of classical limit is related to the degree of mixing of the quantum state.",
    "authors": [
      "Katarzyna Bolonek-Lason",
      "Joanna Gonera",
      "Piotr Kosinski"
    ],
    "publication_date": "2019-02-06T11:02:51Z",
    "arxiv_id": "http://arxiv.org/abs/1902.02110v6",
    "download_url": "https://arxiv.org/abs/1902.02110v6",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Adaptive quantum error mitigation using pulse-based inverse evolutions",
    "abstract": "Quantum Error Mitigation (QEM) enables the extraction of high-quality results from the presently-available noisy quantum computers. In this approach, the effect of the noise on observables of interest can be mitigated using multiple measurements without additional hardware overhead. Unfortunately, current QEM techniques are limited to weak noise or lack scalability. In this work, we introduce a QEM method termed `Adaptive KIK' that adapts to the noise level of the target device, and therefore, can handle moderate-to-strong noise. The implementation of the method is experimentally simple -- it does not involve any tomographic information or machine-learning stage, and the number of different quantum circuits to be implemented is independent of the size of the system. Furthermore, we have shown that it can be successfully integrated with randomized compiling for handling both incoherent as well as coherent noise. Our method handles spatially correlated and time-dependent noise which enables to run shots over the scale of days or more despite the fact that noise and calibrations change in time. Finally, we discuss and demonstrate why our results suggest that gate calibration protocols should be revised when using QEM. We demonstrate our findings in the IBM quantum computers and through numerical simulations.",
    "authors": [
      "Ivan Henao",
      "Jader P. Santos",
      "Raam Uzdin"
    ],
    "publication_date": "2023-03-09T02:50:53Z",
    "arxiv_id": "http://arxiv.org/abs/2303.05001v2",
    "download_url": "https://arxiv.org/abs/2303.05001v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Maximal nonlocality from maximal entanglement and mutually unbiased bases, and self-testing of two-qutrit quantum systems",
    "abstract": "Bell inequalities are an important tool in device-independent quantum information processing because their violation can serve as a certificate of relevant quantum properties. Probably the best known example of a Bell inequality is due to Clauser, Horne, Shimony and Holt (CHSH), which is defined in the simplest scenario involving two dichotomic measurements and whose all key properties are well understood. There have been many attempts to generalise the CHSH Bell inequality to higher-dimensional quantum systems, however, for most of them the maximal quantum violation---the key quantity for most device-independent applications---remains unknown. On the other hand, the constructions for which the maximal quantum violation can be computed, do not preserve the natural property of the CHSH inequality, namely, that the maximal quantum violation is achieved by the maximally entangled state and measurements corresponding to mutually unbiased bases. In this work we propose a novel family of Bell inequalities which exhibit precisely these properties, and whose maximal quantum violation can be computed analytically. In the simplest scenario it recovers the CHSH Bell inequality. These inequalities involve $d$ measurements settings, each having $d$ outcomes for an arbitrary prime number $d\\geq 3$. We then show that in the three-outcome case our Bell inequality can be used to self-test the maximally entangled state of two-qutrits and three mutually unbiased bases at each site. Yet, we demonstrate that in the case of more outcomes, their maximal violation does not allow for self-testing in the standard sense, which motivates the definition of a new weak form of self-testing. The ability to certify high-dimensional MUBs makes these inequalities attractive from the device-independent cryptography point of view.",
    "authors": [
      "Jędrzej Kaniewski",
      "Ivan Šupić",
      "Jordi Tura",
      "Flavio Baccari",
      "Alexia Salavrakos",
      "Remigiusz Augusiak"
    ],
    "publication_date": "2018-07-09T18:36:55Z",
    "arxiv_id": "http://arxiv.org/abs/1807.03332v3",
    "download_url": "https://arxiv.org/abs/1807.03332v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Policies for elementary links in a quantum network",
    "abstract": "Distributing entanglement over long distances is one of the central tasks in quantum networks. An important problem, especially for near-term quantum networks, is to develop optimal entanglement distribution protocols that take into account the limitations of current and near-term hardware, such as quantum memories with limited coherence time. We address this problem by initiating the study of quantum network protocols for entanglement distribution using the theory of decision processes, such that optimal protocols (referred to as policies in the context of decision processes) can be found using dynamic programming or reinforcement learning algorithms. As a first step, in this work we focus exclusively on the elementary link level. We start by defining a quantum decision process for elementary links, along with figures of merit for evaluating policies. We then provide two algorithms for determining policies, one of which we prove to be optimal (with respect to fidelity and success probability) among all policies. Then we show that the previously-studied memory-cutoff protocol can be phrased as a policy within our decision process framework, allowing us to obtain several new fundamental results about it. The conceptual developments and results of this work pave the way for the systematic study of the fundamental limitations of near-term quantum networks, and the requirements for physically realizing them.",
    "authors": [
      "Sumeet Khatri"
    ],
    "publication_date": "2020-07-07T04:10:41Z",
    "arxiv_id": "http://arxiv.org/abs/2007.03193v4",
    "download_url": "https://arxiv.org/abs/2007.03193v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Scalable Architecture for Quantum Information Processing with Atoms in Optical Micro-Structures",
    "abstract": "We review recent experimental progress towards quantum information processing and quantum simulation using neutral atoms in two-dimensional (2D) arrays of optical microtraps as 2D registers of qubits. We describe a scalable quantum information architecture based on micro-fabricated optical elements, simultaneously targeting the important issues of single-site addressability and scalability. This approach provides flexible and integrable configurations for quantum state storage, manipulation, and retrieval. We present recent experimental results on the initialization and coherent one-qubit rotation of up to 100 individually addressable qubits, the coherent transport of atomic quantum states in a scalable quantum shift register, and discuss the feasibility of two-qubit gates in 2D microtrap arrays.",
    "authors": [
      "Malte Schlosser",
      "Sascha Tichelmann",
      "Jens Kruse",
      "Gerhard Birkl"
    ],
    "publication_date": "2011-08-25T17:38:09Z",
    "arxiv_id": "http://arxiv.org/abs/1108.5136v1",
    "download_url": "https://arxiv.org/abs/1108.5136v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symmetries and monotones in Markovian quantum dynamics",
    "abstract": "What can one infer about the dynamical evolution of quantum systems just by symmetry considerations? For Markovian dynamics in finite dimensions, we present a simple construction that assigns to each symmetry of the generator a family of scalar functions over quantum states that are monotonic under the time evolution. The aforementioned monotones can be utilized to identify states that are non-reachable from an initial state by the time evolution and include all constraints imposed by conserved quantities, providing a generalization of Noether's theorem for this class of dynamics. As a special case, the generator itself can be considered a symmetry, resulting in non-trivial constraints over the time evolution, even if all conserved quantities trivialize. The construction utilizes tools from quantum information-geometry, mainly the theory of monotone Riemannian metrics. We analyze the prototypical cases of dephasing and Davies generators.",
    "authors": [
      "Georgios Styliaris",
      "Paolo Zanardi"
    ],
    "publication_date": "2019-12-10T19:24:17Z",
    "arxiv_id": "http://arxiv.org/abs/1912.04939v3",
    "download_url": "https://arxiv.org/abs/1912.04939v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Super-quantum discord in ferromagnetic and antiferromagnetic materials",
    "abstract": "Super-quantum discord is an extension of the quantum discord concept where weak measurements are made instead of projective measurements. We study the temperature behavior of the super-quantum discord for two real magnetic materials. We extract information about super-quantum discord from the magnetic susceptibility data for iron nitrosyl complexes $\\mathrm{ Fe_2(SC_3 H_5N_2)_2(NO)_4}$ and binuclear Cu(II) acetate complex $\\mathrm{[Cu_2 L(OAc)]\\cdot 6 H_2O}$, where $\\mathrm{ L}$ is a ligand that allows us to compare the super-quantum discord with the standard one. The dependence of the super-quantum discord on the parameter describing weak measurements is studied. Obtained difference between super-quantum and quantum discords confirms the detection of additional quantum correlations that are usually destroyed during projective measurements. The use of the approach allows to predict quantitatively in advance the advantages of use of weak measurements versus projective one for quantum technologies in real settings where quantum discord is used as resource. This can be relevant particularly in macroscopic quantum systems where weak measurements can be used to extract information about the system.",
    "authors": [
      "A. V. Fedorova",
      "T. Byrnes",
      "A. N. Pyrkov"
    ],
    "publication_date": "2019-09-08T21:05:18Z",
    "arxiv_id": "http://arxiv.org/abs/1909.03545v1",
    "download_url": "https://arxiv.org/abs/1909.03545v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Benchmarking the Quantum Approximate Optimization Algorithm",
    "abstract": "The performance of the quantum approximate optimization algorithm is evaluated by using three different measures: the probability of finding the ground state, the energy expectation value, and a ratio closely related to the approximation ratio. The set of problem instances studied consists of weighted MaxCut problems and 2-satisfiability problems. The Ising model representations of the latter possess unique ground states and highly-degenerate first excited states. The quantum approximate optimization algorithm is executed on quantum computer simulators and on the IBM Q Experience. Additionally, data obtained from the D-Wave 2000Q quantum annealer is used for comparison, and it is found that the D-Wave machine outperforms the quantum approximate optimization algorithm executed on a simulator. The overall performance of the quantum approximate optimization algorithm is found to strongly depend on the problem instance.",
    "authors": [
      "Madita Willsch",
      "Dennis Willsch",
      "Fengping Jin",
      "Hans De Raedt",
      "Kristel Michielsen"
    ],
    "publication_date": "2019-07-04T12:22:31Z",
    "arxiv_id": "http://arxiv.org/abs/1907.02359v2",
    "download_url": "https://arxiv.org/abs/1907.02359v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuous-Variable Entanglement through Central Forces: Application to Gravity between Quantum Masses",
    "abstract": "We describe a complete method for a precise study of gravitational interaction between two nearby quantum masses. Since the displacements of these masses are much smaller than the initial separation between their centers, the displacement-to-separation ratio is a natural parameter in which the gravitational potential can be expanded. We show that entanglement in such experiments is sensitive to initial relative momentum only when the system evolves into non-Gaussian states, i.e., when the potential is expanded at least up to the cubic term. A pivotal role of force gradient as the dominant contributor to position-momentum correlations is demonstrated. We establish a closed-form expression for the entanglement gain, which shows that the contribution from the cubic term is proportional to momentum and from the quartic term is proportional to momentum squared. From a quantum information perspective, the results find applications as a momentum witness of non-Gaussian entanglement. Our methods are versatile and apply to any number of central interactions expanded to any order.",
    "authors": [
      "Ankit Kumar",
      "Tanjung Krisnanda",
      "P. Arumugam",
      "Tomasz Paterek"
    ],
    "publication_date": "2022-06-26T15:07:14Z",
    "arxiv_id": "http://arxiv.org/abs/2206.12897v3",
    "download_url": "https://arxiv.org/abs/2206.12897v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum scale estimation",
    "abstract": "Quantum scale estimation, as introduced and explored here, establishes the most precise framework for the estimation of scale parameters that is allowed by the laws of quantum mechanics. This addresses an important gap in quantum metrology, since current practice focuses almost exclusively on the estimation of phase and location parameters. For given prior probability and quantum state, and using Bayesian principles, a rule to construct the optimal probability-operator measurement is provided. Furthermore, the corresponding minimum mean logarithmic error is identified. This is then generalised as to accommodate the simultaneous estimation of multiple scale parameters, and a procedure to classify practical measurements into optimal, almost-optimal or sub-optimal is highlighted. As a means of illustration, the new framework is exploited to generalise scale-invariant global thermometry, as well as to address the estimation of the lifetime of an atomic state. On a more conceptual note, the optimal strategy is employed to construct an observable for scale parameters, an approach which may serve as a template for a more systematic search of quantum observables. Quantum scale estimation thus opens a new line of enquire - the precise measurement of scale parameters such as temperatures and rates - within the quantum information sciences.",
    "authors": [
      "Jesús Rubio"
    ],
    "publication_date": "2021-11-23T15:03:19Z",
    "arxiv_id": "http://arxiv.org/abs/2111.11921v3",
    "download_url": "https://arxiv.org/abs/2111.11921v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mixing thermal coherent states for precision and range enhancement in quantum thermometry",
    "abstract": "The unavoidable interaction between thermal environments and quantum systems typically leads to the degradation of quantum coherence, which can be fought against by reservoir engineering. We propose the realization of a special mixture of thermal coherent states by coupling a thermal bath with a two-level system that is longitudinally coupled to a resonator. We find that the state of the resonator is a special mixture of two oppositely displaced thermal coherent states, whereas the two-level system remains thermal. This observation is verified by evaluating the second-order correlation coefficient for the resonator state. Moreover, we reveal the potential benefits of employing the mixture of thermal coherent states of the resonator in quantum thermometry. In this context, the resonator functions as a probe to measure the unknown temperature of a bath mediated by a two-level system, strategically bridging the connection between the two. Our results show that the use of an ancillary-assisted probe may enhance the precision and broaden the applicable temperature range.",
    "authors": [
      "Asghar Ullah",
      "M. Tahir Naseem",
      "Özgür E. Müstecaplıoğlu"
    ],
    "publication_date": "2023-06-07T12:04:55Z",
    "arxiv_id": "http://arxiv.org/abs/2306.04369v5",
    "download_url": "https://arxiv.org/abs/2306.04369v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum error mitigation via matrix product operators",
    "abstract": "In the era of noisy intermediate-scale quantum (NISQ) devices, the number of controllable hardware qubits is insufficient to implement quantum error correction (QEC). As an alternative, quantum error mitigation (QEM) can suppress errors in measurement results via repeated experiments and postprocessing of data. Typical techniques for error mitigation, e.g., the quasi-probability decomposition method, ignore correlated errors between different gates. Here, we introduce a QEM method based on the matrix product operator (MPO) representation of a quantum circuit that can characterize the noise channel with polynomial complexity. Our technique is demonstrated on a $\\rm{depth}=20$ fully parallel quantum circuit of up to $N_q=20$ qubits undergoing local and global noise. The circuit error is reduced by several times with only a small bond dimension $D^{\\prime} = 1$ for the noise channel. The MPO representation increases the accuracy of modeling noise without consuming more experimental resources, which improves the QEM performance and broadens its scope of application. Our method is hopeful of being applied to circuits in higher dimensions with more qubits and deeper depth.",
    "authors": [
      "Yuchen Guo",
      "Shuo Yang"
    ],
    "publication_date": "2022-01-03T16:57:43Z",
    "arxiv_id": "http://arxiv.org/abs/2201.00752v5",
    "download_url": "https://arxiv.org/abs/2201.00752v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Universally Composable Oblivious Linear Evaluation",
    "abstract": "Oblivious linear evaluation is a generalization of oblivious transfer, whereby two distrustful parties obliviously compute a linear function, f (x) = ax + b, i.e., each one provides their inputs that remain unknown to the other, in order to compute the output f (x) that only one of them receives. From both a structural and a security point of view, oblivious linear evaluation is fundamental for arithmetic-based secure multi-party computation protocols. In the classical case, oblivious linear evaluation protocols can be generated using oblivious transfer, and their quantum counterparts can, in principle, be constructed as straightforward extensions using quantum oblivious transfer. Here, we present the first, to the best of our knowledge, quantum protocol for oblivious linear evaluation that, furthermore, does not rely on quantum oblivious transfer. We start by presenting a semi-honest protocol, and then extend it to the dishonest setting employing a commit-and-open strategy. Our protocol uses high-dimensional quantum states to obliviously compute f (x) on Galois Fields of prime and prime-power dimension. These constructions utilize the existence of a complete set of mutually unbiased bases in prime-power dimension Hilbert spaces and their linear behaviour upon the Heisenberg-Weyl operators. We also generalize our protocol to achieve vector oblivious linear evaluation, where several instances of oblivious linear evaluation are generated, thus making the protocol more efficient. We prove the protocols to have static security in the framework of quantum universal composability.",
    "authors": [
      "Manuel B. Santos",
      "Paulo Mateus",
      "Chrysoula Vlachou"
    ],
    "publication_date": "2022-04-29T15:55:35Z",
    "arxiv_id": "http://arxiv.org/abs/2204.14171v3",
    "download_url": "https://arxiv.org/abs/2204.14171v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Quadratic Speedup in Finding Nash Equilibria of Quantum Zero-Sum Games",
    "abstract": "Recent developments in domains such as non-local games, quantum interactive proofs, and quantum generative adversarial networks have renewed interest in quantum game theory and, specifically, quantum zero-sum games. Central to classical game theory is the efficient algorithmic computation of Nash equilibria, which represent optimal strategies for both players. In 2008, Jain and Watrous proposed the first classical algorithm for computing equilibria in quantum zero-sum games using the Matrix Multiplicative Weight Updates (MMWU) method to achieve a convergence rate of $\\mathcal{O}(d/ε^2)$ iterations to $ε$-Nash equilibria in the $4^d$-dimensional spectraplex. In this work, we propose a hierarchy of quantum optimization algorithms that generalize MMWU via an extra-gradient mechanism. Notably, within this proposed hierarchy, we introduce the Optimistic Matrix Multiplicative Weights Update (OMMWU) algorithm and establish its average-iterate convergence complexity as $\\mathcal{O}(d/ε)$ iterations to $ε$-Nash equilibria. This quadratic speed-up relative to Jain and Watrous' original algorithm sets a new benchmark for computing $ε$-Nash equilibria in quantum zero-sum games.",
    "authors": [
      "Francisca Vasconcelos",
      "Emmanouil-Vasileios Vlatakis-Gkaragkounis",
      "Panayotis Mertikopoulos",
      "Georgios Piliouras",
      "Michael I. Jordan"
    ],
    "publication_date": "2023-11-17T20:38:38Z",
    "arxiv_id": "http://arxiv.org/abs/2311.10859v2",
    "download_url": "https://arxiv.org/abs/2311.10859v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Toolbox for reconstructing quantum theory from rules on information acquisition",
    "abstract": "We develop an operational approach for reconstructing the quantum theory of qubit systems from elementary rules on information acquisition. The focus lies on an observer O interrogating a system S with binary questions and S's state is taken as O's `catalogue of knowledge' about S. The mathematical tools of the framework are simple and we attempt to highlight all underlying assumptions. Four rules are imposed, asserting (1) a limit on the amount of information available to O; (2) the mere existence of complementary information; (3) O's total amount of information to be preserved in-between interrogations; and, (4) O's `catalogue of knowledge' to change continuously in time in-between interrogations and every consistent such evolution to be possible. This approach permits a constructive derivation of quantum theory, elucidating how the ensuing independence, complementarity and compatibility structure of O's questions matches that of projective measurements in quantum theory, how entanglement and monogamy of entanglement, non-locality and, more generally, how the correlation structure of arbitrarily many qubits and rebits arises. The rules yield a reversible time evolution and a quadratic measure, quantifying O's information about S. Finally, it is shown that the four rules admit two solutions for the simplest case of a single elementary system: the Bloch ball and disc as state spaces for a qubit and rebit, respectively, together with their symmetries as time evolution groups. The reconstruction for arbitrarily many qubits is completed in a companion paper (arXiv:1511.01130) where an additional rule eliminates the rebit case. This approach is inspired by (but does not rely on) the relational interpretation and yields a novel formulation of quantum theory in terms of questions.",
    "authors": [
      "Philipp A Hoehn"
    ],
    "publication_date": "2014-12-29T12:46:28Z",
    "arxiv_id": "http://arxiv.org/abs/1412.8323v9",
    "download_url": "https://arxiv.org/abs/1412.8323v9",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum simulation with just-in-time compilation",
    "abstract": "Quantum technologies are moving towards the development of novel hardware devices based on quantum bits (qubits). In parallel to the development of quantum devices, efficient simulation tools are needed in order to design and benchmark quantum algorithms and applications before deployment on quantum hardware. In this context, we present a first attempt to perform circuit-based quantum simulation using the just-in-time (JIT) compilation technique on multiple hardware architectures and configurations based on single-node central processing units (CPUs) and graphics processing units (GPUs). One of the major challenges in scientific code development is to balance the level of complexity between algorithms and programming techniques without losing performance or degrading code readability. In this context, we have developed qibojit: a new module for the Qibo quantum computing framework, which uses a just-in-time compilation approach through Python. We perform systematic performance benchmarks between our JIT approach and a subset of relevant publicly available libraries for quantum computing. We show that our novel approach simplifies the complex aspects of the implementation without deteriorating performance.",
    "authors": [
      "Stavros Efthymiou",
      "Marco Lazzarin",
      "Andrea Pasquale",
      "Stefano Carrazza"
    ],
    "publication_date": "2022-03-16T18:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/2203.08826v2",
    "download_url": "https://arxiv.org/abs/2203.08826v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An energetic perspective on rapid quenches in quantum annealing",
    "abstract": "There are well developed theoretical tools to analyse how quantum dynamics can solve computational problems by varying Hamiltonian parameters slowly, near the adiabatic limit. On the other hand, there are relatively few tools to understand the opposite limit of rapid quenches, as used in quantum annealing and (in the limit of infinitely rapid quenches) in quantum walks. In this paper, we develop several tools which are applicable in the rapid quench regime. Firstly, we analyse the energy expectation value of different elements of the Hamiltonian. From this, we show that monotonic quenches, where the strength of the problem Hamiltonian is consistently increased relative to fluctuation (driver) terms, will yield a better result on average than random guessing. Secondly, we develop methods to determine whether dynamics will occur locally under rapid quench Hamiltonians, and identify cases where a rapid quench will lead to a substantially improved solution. In particular, we find that a technique we refer to as \"pre-annealing\" can significantly improve the performance of quantum walks. We also show how these tools can provide efficient heuristic estimates for Hamiltonian parameters, a key requirement for practical application of quantum annealing.",
    "authors": [
      "Adam Callison",
      "Max Festenstein",
      "Jie Chen",
      "Laurentiu Nita",
      "Viv Kendon",
      "Nicholas Chancellor"
    ],
    "publication_date": "2020-07-22T18:00:33Z",
    "arxiv_id": "http://arxiv.org/abs/2007.11599v5",
    "download_url": "https://arxiv.org/abs/2007.11599v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On contraction coefficients, partial orders and approximation of capacities for quantum channels",
    "abstract": "The data processing inequality is the most basic requirement for any meaningful measure of information. It essentially states that distinguishability measures between states decrease if we apply a quantum channel and is the centerpiece of many results in information theory. Moreover, it justifies the operational interpretation of most entropic quantities. In this work, we revisit the notion of contraction coefficients of quantum channels, which provide sharper and specialized versions of the data processing inequality. A concept closely related to data processing is partial orders on quantum channels. First, we discuss several quantum extensions of the well-known less noisy ordering and relate them to contraction coefficients. We further define approximate versions of the partial orders and show how they can give strengthened and conceptually simple proofs of several results on approximating capacities. Moreover, we investigate the relation to other partial orders in the literature and their properties, particularly with regard to tensorization. We then examine the relation between contraction coefficients with other properties of quantum channels such as hypercontractivity. Next, we extend the framework of contraction coefficients to general f-divergences and prove several structural results. Finally, we consider two important classes of quantum channels, namely Weyl-covariant and bosonic Gaussian channels. For those, we determine new contraction coefficients and relations for various partial orders.",
    "authors": [
      "Christoph Hirche",
      "Cambyse Rouzé",
      "Daniel Stilck França"
    ],
    "publication_date": "2020-11-11T18:11:15Z",
    "arxiv_id": "http://arxiv.org/abs/2011.05949v4",
    "download_url": "https://arxiv.org/abs/2011.05949v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Do quantum strategies always win?",
    "abstract": "In a seminal paper, Meyer [David Meyer, Phys. Rev. Lett. 82, 1052 (1999)] described the advantages of quantum game theory by looking at the classical penny flip game. A player using a quantum strategy can win against a classical player almost 100\\% of the time. Here we make a slight modification to the quantum game, with the two players sharing an entangled state to begin with. We then analyze two different scenarios, first in which quantum player makes unitary transformations to his qubit while the classical player uses a pure strategy of either flipping or not flipping the state of his qubit. In this case the quantum player always wins against the classical player. In the second scenario we have the quantum player making similar unitary transformations while the classical player makes use of a mixed strategy wherein he either flips or not with some probability \"p\". We show that in the second scenario, 100\\% win record of a quantum player is drastically reduced and for a particular probability \"p\" the classical player can even win against the quantum player. This is of possible relevance to the field of quantum computation as we show that in this quantum game of preserving versus destroying entanglement a particular classical algorithm can beat the quantum algorithm.",
    "authors": [
      "Namit Anand",
      "Colin Benjamin"
    ],
    "publication_date": "2014-12-23T15:17:45Z",
    "arxiv_id": "http://arxiv.org/abs/1412.7399v3",
    "download_url": "https://arxiv.org/abs/1412.7399v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Mpemba effect from initial system-reservoir entanglement",
    "abstract": "The Mpemba effect -- where hot systems cool faster than colder ones -- has intrigued both classical and quantum thermodynamics. As compared to classical systems, quantum systems add complexity due to quantum correlations. Recent works have explored anomalous relaxation and Mpemba-like effects in several quantum systems, considering isolated systems at zero temperature or open systems in contact with reservoirs under Markovian or non-Markovian dynamics. However, these models typically assume an initial unentangled system-bath state, overlooking the role of initial system-environment correlations. Here we propose a type of quantum Mpemba effect, distinct from the strong Mpemba effect, originating from initial system-bath entanglement solely. It is shown that the degree of initial entanglement significantly influences the early relaxation dynamics, with certain conditions causing backflow and retarded thermalization. As an example, we investigate the spontaneous emission of a two-level atom in a photonic waveguide at zero temperature, where an initial atom-photon entangled state results in delayed relaxation and pronounced Mpemba effect. These findings highlight the crucial role of quantum correlations in thermalization processes and open new avenues for identifying and engineering quantum Mpemba phenomena. Controlling relaxation dynamics through system-environment entanglement may have potential applications in quantum thermal machines, state initialization protocols, and quantum information processing, where precise control over thermalization is essential.",
    "authors": [
      "Stefano Longhi"
    ],
    "publication_date": "2025-04-30T15:58:17Z",
    "arxiv_id": "http://arxiv.org/abs/2504.21758v1",
    "download_url": "https://arxiv.org/abs/2504.21758v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Practical randomness amplification and privatisation with implementations on quantum computers",
    "abstract": "We present an end-to-end and practical randomness amplification and privatisation protocol based on Bell tests. This allows the building of device-independent random number generators which output (near-)perfectly unbiased and private numbers, even if using an uncharacterised quantum device potentially built by an adversary. Our generation rates are linear in the repetition rate of the quantum device and the classical randomness post-processing has quasi-linear complexity - making it efficient on a standard personal laptop. The statistical analysis is also tailored for real-world quantum devices.\n  Our protocol is then showcased on several different quantum computers. Although not purposely built for the task, we show that quantum computers can run faithful Bell tests by adding minimal assumptions. In this semi-device-independent manner, our protocol generates (near-)perfectly unbiased and private random numbers on today's quantum computers.",
    "authors": [
      "Cameron Foreman",
      "Sherilyn Wright",
      "Alec Edgington",
      "Mario Berta",
      "Florian J. Curchod"
    ],
    "publication_date": "2020-09-14T16:25:11Z",
    "arxiv_id": "http://arxiv.org/abs/2009.06551v3",
    "download_url": "https://arxiv.org/abs/2009.06551v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Power of Adiabatic Quantum Computation with No Sign Problem",
    "abstract": "We show a superpolynomial oracle separation between the power of adiabatic quantum computation with no sign problem and the power of classical computation.",
    "authors": [
      "M. B. Hastings"
    ],
    "publication_date": "2020-05-07T22:37:53Z",
    "arxiv_id": "http://arxiv.org/abs/2005.03791v2",
    "download_url": "https://arxiv.org/abs/2005.03791v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Ontology Conservation Law as an Alternative to the Many World Interpretation of Quantum Mechanics",
    "abstract": "A sharper formulation is presented for an interpretation of quantum mechanics advocated by author. As an essential element we put forward conservation laws concerning the ontological nature of a variable, and the uncertainties concerning the realisation of states. Quantum mechanics can then be treated as a device that combines statistics with mechanical, deterministic laws, such that uncertainties are passed on from initial states to final states.",
    "authors": [
      "Gerard t Hooft"
    ],
    "publication_date": "2019-04-28T18:40:32Z",
    "arxiv_id": "http://arxiv.org/abs/1904.12364v1",
    "download_url": "https://arxiv.org/abs/1904.12364v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Performance Analysis of Quantum CSS Error-Correcting Codes via MacWilliams Identities",
    "abstract": "We analyze the performance of quantum stabilizer codes, one of the most important classes for practical implementations, on both symmetric and asymmetric quantum channels. To this aim, we first derive the weight enumerator (WE) for the undetectable errors based on the quantum MacWilliams identities. The WE is then used to evaluate tight upper bounds on the error rate of CSS quantum codes with \\acl{MW} decoding. For surface codes we also derive a simple closed form expression of the bounds over the depolarizing channel. We introduce a novel approach that combines the knowledge of WE with a logical operator analysis, allowing the derivation of the exact asymptotic error rate for short codes. For example, on a depolarizing channel with physical error rate $ρ\\to 0$, the logical error rate $ρ_\\mathrm{L}$ is asymptotically $ρ_\\mathrm{L} \\approx 16 ρ^2$ for the $[[9,1,3]]$ Shor code, $ρ_\\mathrm{L} \\approx 16.3 ρ^2$ for the $[[7,1,3]]$ Steane code, $ρ_\\mathrm{L} \\approx 18.7 ρ^2$ for the $[[13,1,3]]$ surface code, and $ρ_\\mathrm{L} \\approx 149.3 ρ^3$ for the $[[41,1,5]]$ surface code. For larger codes our bound provides $ρ_\\mathrm{L} \\approx 1215 ρ^4$ and $ρ_\\mathrm{L} \\approx 663 ρ^5$ for the $[[85,1,7]]$ and the $[[181,1,10]]$ surface codes, respectively. Finally, we extend our analysis to include realistic, noisy syndrome extraction circuits by modeling error propagation throughout gadgets. This enables estimation of logical error rates under faulty measurements. The performance analysis serves as a design tool for developing fault-tolerant quantum systems by guiding the selection of quantum codes based on their error correction capability. Additionally, it offers a novel perspective on quantum degeneracy, showing it represents the fraction of non-correctable error patterns shared by multiple logical operators.",
    "authors": [
      "Diego Forlivesi",
      "Lorenzo Valentini",
      "Marco Chiani"
    ],
    "publication_date": "2023-05-02T10:19:02Z",
    "arxiv_id": "http://arxiv.org/abs/2305.01301v4",
    "download_url": "https://arxiv.org/abs/2305.01301v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A General Approach to Dropout in Quantum Neural Networks",
    "abstract": "In classical Machine Learning, \"overfitting\" is the phenomenon occurring when a given model learns the training data excessively well, and it thus performs poorly on unseen data. A commonly employed technique in Machine Learning is the so called \"dropout\", which prevents computational units from becoming too specialized, hence reducing the risk of overfitting. With the advent of Quantum Neural Networks as learning models, overfitting might soon become an issue, owing to the increasing depth of quantum circuits as well as multiple embedding of classical features, which are employed to give the computational nonlinearity. Here we present a generalized approach to apply the dropout technique in Quantum Neural Network models, defining and analysing different quantum dropout strategies to avoid overfitting and achieve a high level of generalization. Our study allows to envision the power of quantum dropout in enabling generalization, providing useful guidelines on determining the maximal dropout probability for a given model, based on overparametrization theory. It also highlights how quantum dropout does not impact the features of the Quantum Neural Networks model, such as expressibility and entanglement. All these conclusions are supported by extensive numerical simulations, and may pave the way to efficiently employing deep Quantum Machine Learning models based on state-of-the-art Quantum Neural Networks.",
    "authors": [
      "Francesco Scala",
      "Andrea Ceschini",
      "Massimo Panella",
      "Dario Gerace"
    ],
    "publication_date": "2023-10-06T09:39:30Z",
    "arxiv_id": "http://arxiv.org/abs/2310.04120v1",
    "download_url": "https://arxiv.org/abs/2310.04120v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Testing symmetry on quantum computers",
    "abstract": "Symmetry is a unifying concept in physics. In quantum information and beyond, it is known that quantum states possessing symmetry are not useful for certain information-processing tasks. For example, states that commute with a Hamiltonian realizing a time evolution are not useful for timekeeping during that evolution, and bipartite states that are highly extendible are not strongly entangled and thus not useful for basic tasks like teleportation. Motivated by this perspective, this paper details several quantum algorithms that test the symmetry of quantum states and channels. For the case of testing Bose symmetry of a state, we show that there is a simple and efficient quantum algorithm, while the tests for other kinds of symmetry rely on the aid of a quantum prover. We prove that the acceptance probability of each algorithm is equal to the maximum symmetric fidelity of the state being tested, thus giving a firm operational meaning to these latter resource quantifiers. Special cases of the algorithms test for incoherence or separability of quantum states. We evaluate the performance of these algorithms on choice examples by using the variational approach to quantum algorithms, replacing the quantum prover with a parameterized circuit. We demonstrate this approach for numerous examples using the IBM quantum noiseless and noisy simulators, and we observe that the algorithms perform well in the noiseless case and exhibit noise resilience in the noisy case. We also show that the maximum symmetric fidelities can be calculated by semi-definite programs, which is useful for benchmarking the performance of these algorithms for sufficiently small examples. Finally, we establish various generalizations of the resource theory of asymmetry, with the upshot being that the acceptance probabilities of the algorithms are resource monotones and thus well motivated from the resource-theoretic perspective.",
    "authors": [
      "Margarite L. LaBorde",
      "Soorya Rethinasamy",
      "Mark M. Wilde"
    ],
    "publication_date": "2021-05-26T18:01:54Z",
    "arxiv_id": "http://arxiv.org/abs/2105.12758v3",
    "download_url": "https://arxiv.org/abs/2105.12758v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Learning with Noise and Decoherence: A Robust Quantum Neural Network",
    "abstract": "Noise and decoherence are two major obstacles to the implementation of large-scale quantum computing. Because of the no-cloning theorem, which says we cannot make an exact copy of an arbitrary quantum state, simple redundancy will not work in a quantum context, and unwanted interactions with the environment can destroy coherence and thus the quantum nature of the computation. Because of the parallel and distributed nature of classical neural networks, they have long been successfully used to deal with incomplete or damaged data. In this work, we show that our model of a quantum neural network (QNN) is similarly robust to noise, and that, in addition, it is robust to decoherence. Moreover, robustness to noise and decoherence is not only maintained but improved as the size of the system is increased. Noise and decoherence may even be of advantage in training, as it helps correct for overfitting. We demonstrate the robustness using entanglement as a means for pattern storage in a qubit array. Our results provide evidence that machine learning approaches can obviate otherwise recalcitrant problems in quantum computing.",
    "authors": [
      "Nam H. Nguyen",
      "Elizabeth C. Behrman",
      "James E. Steck"
    ],
    "publication_date": "2016-12-22T13:35:13Z",
    "arxiv_id": "http://arxiv.org/abs/1612.07593v3",
    "download_url": "https://arxiv.org/abs/1612.07593v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Seedless extractors for device-independent quantum cryptography",
    "abstract": "Device-independent (DI) quantum cryptography aims at providing secure cryptography with minimal trust in, or characterisation of, the underlying quantum devices. A key step in DI protocols is randomness extraction (or privacy amplification), which typically requires a \\textit{seed} of additional bits with sufficient entropy and statistical independence from any bits generated during the protocol. In this work, we propose a method for extraction in DI protocols that does not require a seed and is secure against computationally unbounded quantum adversaries. The core idea is to use the Bell violation of the raw data, rather than its min-entropy, as the extractor promise. We present a complete security proof in a model where the experiment uses memoryless measurement devices acting on an arbitrary joint (across all rounds) state. Our results mark a first step in this alternative, seedless, approach to extraction in DI protocols.",
    "authors": [
      "Cameron Foreman",
      "Lluis Masanes"
    ],
    "publication_date": "2024-03-07T18:07:52Z",
    "arxiv_id": "http://arxiv.org/abs/2403.04713v2",
    "download_url": "https://arxiv.org/abs/2403.04713v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum one-time tables for unconditionally secure qubit-commitment",
    "abstract": "The commodity-based cryptography is an alternative approach to realize conventionally impossible cryptographic primitives such as unconditionally secure bit-commitment by consuming pre-established correlation between distrustful participants. A unit of such classical correlation is known as the one-time table (OTT). In this paper, we introduce a new example besides quantum key distribution in which quantum correlation is useful for cryptography. We propose a scheme for unconditionally secure qubit-commitment, a quantum cryptographic primitive forbidden by the recently proven no-masking theorem in the standard model, based on the consumption of the quantum generalization of the OTT, the bipartite quantum state we named quantum one-time tables (QOTT). The construction of the QOTT is based on the newly analyzed internal structure of quantum masker and the quantum secret sharing schemes. Our qubit-commitment scheme is shown to be universally composable. We propose to measure the randomness cost of preparing a (Q)OTT in terms of its entropy, and show that the QOTT with superdense coding can increase the security level with half the cost of OTTs for unconditionally secure bit-commitment. The QOTT exemplifies an operational setting where neither maximally classically correlated state nor maximally entangled state, but rather a well-structured partially entangled mixed state is more valuable resource.",
    "authors": [
      "Seok Hyung Lie",
      "Hyukjoon Kwon",
      "M. S Kim",
      "Hyunseok Jeong"
    ],
    "publication_date": "2019-03-29T00:09:46Z",
    "arxiv_id": "http://arxiv.org/abs/1903.12304v4",
    "download_url": "https://arxiv.org/abs/1903.12304v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Emergence of Quantum Mechanics from a Sub-Quantum Statistical Mechanics",
    "abstract": "A research program within the scope of theories on \"Emergent Quantum Mechanics\" is presented, which has gained some momentum in recent years. Via the modeling of a quantum system as a non-equilibrium steady-state maintained by a permanent throughput of energy from the zero-point vacuum, the quantum is considered as an emergent system. We implement a specific \"bouncer-walker\" model in the context of an assumed sub-quantum statistical physics, in analogy to the results of experiments by Couder's group on a classical wave-particle duality. We can thus give an explanation of various quantum mechanical features and results on the basis of a \"21st century classical physics\", such as the appearance of Planck's constant, the Schrödinger equation, etc. An essential result is given by the proof that averaged particle trajectories' behaviors correspond to a specific type of anomalous diffusion termed \"ballistic\" diffusion on a sub-quantum level. It is further demonstrated both analytically and with the aid of computer simulations that our model provides explanations for various quantum effects such as double-slit or n-slit interference. We show the averaged trajectories emerging from our model to be identical to Bohmian trajectories, albeit without the need to invoke complex wave functions or any other quantum mechanical tool. Finally, the model provides new insights into the origins of entanglement, and, in particular, into the phenomenon of a \"systemic\" nonlocality.",
    "authors": [
      "Gerhard Groessing"
    ],
    "publication_date": "2013-04-12T14:25:21Z",
    "arxiv_id": "http://arxiv.org/abs/1304.3719v1",
    "download_url": "https://arxiv.org/abs/1304.3719v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Measurements in the Light of Quantum State Estimation",
    "abstract": "Starting from a simple estimation problem, here we propose a general approach for decoding quantum measurements from the perspective of information extraction. By virtue of the estimation fidelity only, we provide surprisingly simple characterizations of rank-1 projective measurements, mutually unbiased measurements, and symmetric informationally complete measurements. Notably, our conclusions do not rely on any assumption on the rank, purity, or the number of measurement outcomes, and we do not need bases to start with. Our work demonstrates that all these elementary quantum measurements are uniquely determined by their information-extraction capabilities, which are not even anticipated before. In addition, we offer a new perspective for understanding noncommutativity and incompatibility from tomographic performances, which also leads to a universal criterion for detecting quantum incompatibility. Furthermore, we show that the estimation fidelity can be used to distinguish inequivalent mutually unbiased bases and symmetric informationally complete measurements. In the course of study, we introduce the concept of (weighted complex projective) $1/2$-designs and show that all $1/2$-designs are tied to symmetric informationally complete measurements, and vice versa.",
    "authors": [
      "Huangjun Zhu"
    ],
    "publication_date": "2021-11-04T13:00:11Z",
    "arxiv_id": "http://arxiv.org/abs/2111.02841v2",
    "download_url": "https://arxiv.org/abs/2111.02841v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optical designs for realization of a set of schemes for quantum cryptography",
    "abstract": "Several quantum cryptographic schemes have been proposed and realized experimentally in the past. However, even with an advancement in quantum technology and escalated interest in the designing of direct secure quantum communication schemes there are not many experimental implementations of these cryptographic schemes. In this paper, we have provided a set of optical circuits for such quantum cryptographic schemes, which have not yet been realized experimentally by modifying some of our theoretically proposed secure communication schemes. Specifically, we have proposed optical designs for the implementation of two single photon and one entangled state based controlled quantum dialogue schemes and subsequently reduced our optical designs to yield simpler designs for realizing other secure quantum communication tasks, i.e., controlled deterministic secure quantum communication, quantum dialogue, quantum secure direct communication, quantum key agreement, and quantum key distribution. We have further proposed an optical design for an entanglement swapping based deterministic secure quantum communication and its controlled counterpart.",
    "authors": [
      "Mitali Sisodia",
      "Kishore Thapliyal",
      "Anirban Pathak"
    ],
    "publication_date": "2020-02-12T19:14:12Z",
    "arxiv_id": "http://arxiv.org/abs/2002.05184v1",
    "download_url": "https://arxiv.org/abs/2002.05184v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Restoring Heisenberg scaling in noisy quantum metrology by monitoring the environment",
    "abstract": "We study quantum frequency estimation for $N$ qubits subjected to independent Markovian noise, via strategies based on time-continuous monitoring of the environment. Both physical intuition and an extended convexity property of the quantum Fisher information (QFI) suggest that these strategies are more effective than the standard ones based on the measurement of the unconditional state after the noisy evolution. Here we focus on initial GHZ states and on parallel or transverse noise. For parallel noise, i.e. dephasing, we show that perfectly efficient time-continuous photo-detection allows to recover the unitary (noiseless) QFI, and thus to obtain a Heisenberg scaling for every value of the monitoring time. For finite detection efficiency, one falls back to the noisy standard quantum limit scaling, but with a constant enhancement due to an effective reduced dephasing. Also in the transverse noise case we obtain that the Heisenberg scaling is recovered for perfectly efficient detectors, and we find that both homodyne and photo-detection based strategies are optimal. For finite detectors efficiency, our numerical simulations show that, as expected, an enhancement can be observed, but we cannot give any conclusive statement regarding the scaling. We finally describe in detail the stable and compact numerical algorithm that we have developed in order to evaluate the precision of such time-continuous estimation strategies, and that may find application in other quantum metrology schemes.",
    "authors": [
      "Francesco Albarelli",
      "Matteo A. C. Rossi",
      "Dario Tamascelli",
      "Marco G. Genoni"
    ],
    "publication_date": "2018-03-15T17:44:23Z",
    "arxiv_id": "http://arxiv.org/abs/1803.05891v3",
    "download_url": "https://arxiv.org/abs/1803.05891v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classical mechanics as nonlinear quantum mechanics",
    "abstract": "All measurable predictions of classical mechanics can be reproduced from a quantum-like interpretation of a nonlinear Schrodinger equation. The key observation leading to classical physics is the fact that a wave function that satisfies a linear equation is real and positive, rather than complex. This has profound implications on the role of the Bohmian classical-like interpretation of linear quantum mechanics, as well as on the possibilities to find a consistent interpretation of arbitrary nonlinear generalizations of quantum mechanics.",
    "authors": [
      "H. Nikolic"
    ],
    "publication_date": "2007-07-16T13:24:13Z",
    "arxiv_id": "http://arxiv.org/abs/0707.2319v1",
    "download_url": "https://arxiv.org/abs/0707.2319v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Asynchronous Entanglement Routing for the Quantum Internet",
    "abstract": "With the emergence of the Quantum Internet, the need for advanced quantum networking techniques has significantly risen. Various models of quantum repeaters have been presented, each delineating a unique strategy to ensure quantum communication over long distances. We focus on repeaters that employ entanglement generation and swapping. This revolves around establishing remote end-to-end entanglement through repeaters, a concept we denote as the \"quantum-native\" repeaters (also called \"first-generation\" repeaters in some literature). The challenges in routing with quantum-native repeaters arise from probabilistic entanglement generation and restricted coherence time. Current approaches use synchronized time slots to search for entanglement-swapping paths, resulting in inefficiencies. Here, we propose a new set of asynchronous routing protocols for quantum networks by incorporating the idea of maintaining a dynamic topology in a distributed manner, which has been extensively studied in classical routing for lossy networks, such as using a destination-oriented directed acyclic graph (DODAG) or a spanning tree. The protocols update the entanglement-link topology asynchronously, identify optimal entanglement-swapping paths, and preserve unused direct-link entanglements. Our results indicate that asynchronous protocols achieve a larger upper bound with an appropriate setting and significantly higher entanglement rate than existing synchronous approaches, and the rate increases with coherence time, suggesting that it will have a much more profound impact on quantum networks as technology advances.",
    "authors": [
      "Zebo Yang",
      "Ali Ghubaish",
      "Raj Jain",
      "Hassan Shapourian",
      "Alireza Shabani"
    ],
    "publication_date": "2023-12-21T21:14:21Z",
    "arxiv_id": "http://arxiv.org/abs/2312.14300v1",
    "download_url": "https://arxiv.org/abs/2312.14300v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum linear network coding for entanglement distribution in restricted architectures",
    "abstract": "In this paper we propose a technique for distributing entanglement in architectures in which interactions between pairs of qubits are constrained to a fixed network $G$. This allows for two-qubit operations to be performed between qubits which are remote from each other in $G$, through gate teleportation. We demonstrate how adapting \\emph{quantum linear network coding} to this problem of entanglement distribution in a network of qubits can be used to solve the problem of distributing Bell states and GHZ states in parallel, when bottlenecks in $G$ would otherwise force such entangled states to be distributed sequentially. In particular, we show that by reduction to classical network coding protocols for the $k$-pairs problem or multiple multicast problem in a fixed network $G$, one can distribute entanglement between the transmitters and receivers with a Clifford circuit whose quantum depth is some (typically small and easily computed) constant, which does not depend on the size of $G$, however remote the transmitters and receivers are, or the number of transmitters and receivers. These results also generalise straightforwardly to qudits of any prime dimension. We demonstrate our results using a specialised formalism, distinct from and more efficient than the stabiliser formalism, which is likely to be helpful to reason about and prototype such quantum linear network coding circuits.",
    "authors": [
      "Niel de Beaudrap",
      "Steven Herbert"
    ],
    "publication_date": "2019-10-08T10:15:40Z",
    "arxiv_id": "http://arxiv.org/abs/1910.03315v3",
    "download_url": "https://arxiv.org/abs/1910.03315v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Distributing Multipartite Entanglement over Noisy Quantum Networks",
    "abstract": "A quantum internet aims at harnessing networked quantum technologies, namely by distributing bipartite entanglement between distant nodes. However, multipartite entanglement between the nodes may empower the quantum internet for additional or better applications for communications, sensing, and computation. In this work, we present an algorithm for generating multipartite entanglement between different nodes of a quantum network with noisy quantum repeaters and imperfect quantum memories, where the links are entangled pairs. Our algorithm is optimal for GHZ states with 3 qubits, maximising simultaneously the final state fidelity and the rate of entanglement distribution. Furthermore, we determine the conditions yielding this simultaneous optimality for GHZ states with a higher number of qubits, and for other types of multipartite entanglement. Our algorithm is general also in the sense that it can optimise simultaneously arbitrary parameters. This work opens the way to optimally generate multipartite quantum correlations over noisy quantum networks, an important resource for distributed quantum technologies.",
    "authors": [
      "Luís Bugalho",
      "Bruno C. Coutinho",
      "Francisco A. Monteiro",
      "Yasser Omar"
    ],
    "publication_date": "2021-03-26T22:48:05Z",
    "arxiv_id": "http://arxiv.org/abs/2103.14759v3",
    "download_url": "https://arxiv.org/abs/2103.14759v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Four questions for quantum-classical hybrid theory",
    "abstract": "Four questions are discussed which may be addressed to any proposal of a quantum-classical hybrid theory which concerns the direct coupling of classical and quantum mechanical degrees of freedom. In particular, we consider the formulation of hybrid dynamics presented recently in Ref.[1]. This linear theory differs from the nonlinear ensemble theory of Hall and Reginatto, but shares with it to fulfil all consistency requirements discussed in the literature, while earlier attempts failed. - Here, we additionally ask: Does the theory allow for superposition, separable, and entangled states originating in the quantum mechanical sector? Does it allow for \"Free Will\", as introduced, in this context, by Diosi [2]. Is it local? Does it provide hints for the emergence of quantum mechanics from dynamics beneath?",
    "authors": [
      "Hans-Thomas Elze"
    ],
    "publication_date": "2012-02-15T21:20:10Z",
    "arxiv_id": "http://arxiv.org/abs/1202.3448v1",
    "download_url": "https://arxiv.org/abs/1202.3448v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Numerical approach to SUSY quantum mechanics and the gauge/gravity duality",
    "abstract": "We demonstrate that Monte-Carlo simulation is a practical tool to study nonperturbative aspects of supersymmetric quantum mechanics. As an example we study D0-brane quantum mechanics in the context of superstring theory. Numerical data nicely reproduce predictions from gravity side, including the coupling constant dependence of the string alpha' correction. This strongly suggests the duality to hold beyond the supergravity approximation. Although detail of the stringy correction cannot be obtained by state-of-the-art techniques in gravity side, in the matrix quantum mechanics we can obtain concrete values. Therefore the Monte-Carlo simulation combined with the duality provides a powerful tool to study the superstring theory.",
    "authors": [
      "Masanori Hanada"
    ],
    "publication_date": "2010-11-04T22:16:37Z",
    "arxiv_id": "http://arxiv.org/abs/1011.1284v1",
    "download_url": "https://arxiv.org/abs/1011.1284v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Noise-tolerant public-key quantum money from a classical oracle",
    "abstract": "Quantum money is the task of verifying the validity of banknotes while ensuring that they cannot be counterfeited. Public-key quantum money allows anyone to perform verification, while the private-key setting restricts the ability to verify to banks, as in Wiesner's original scheme. The current state of technological progress means that errors are impossible to entirely suppress, hence the requirement for noise-tolerant schemes. We show for the first time how to achieve noise-tolerance in the public-key setting. Our techniques follow Aaronson and Christiano's oracle model, where we use the ideas of quantum error correction to extend their scheme: a valid banknote is now a subspace state possibly affected by noise, and verification is performed by using classical oracles to check for membership in \"larger spaces.\" Additionally, a banknote in our scheme is minted by preparing conjugate coding states and applying a unitary that permutes the standard basis vectors.",
    "authors": [
      "Peter Yuen"
    ],
    "publication_date": "2024-07-08T23:53:07Z",
    "arxiv_id": "http://arxiv.org/abs/2407.06463v2",
    "download_url": "https://arxiv.org/abs/2407.06463v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time averaged distribution of a discrete-time quantum walk on the path",
    "abstract": "The discrete time quantum walk which is a quantum counterpart of random walk plays important roles in the theory of quantum information theory. In the present paper, we focus on discrete time quantum walks viewed as quantization of random walks on the path. We obtain a weak limit theorem for the time averaged distribution of our quantum walks.",
    "authors": [
      "Yusuke Ide",
      "Norio Konno",
      "Etsuo Segawa"
    ],
    "publication_date": "2011-12-17T08:58:12Z",
    "arxiv_id": "http://arxiv.org/abs/1112.4036v2",
    "download_url": "https://arxiv.org/abs/1112.4036v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The quantum state as spatial displacement",
    "abstract": "We give a simple demonstration that the Schrödinger equation may be recast as a self-contained second-order Newtonian law for a congruence of spacetime trajectories. This provides a pictorial representation of the quantum state as the displacement function of the collective whereby quantum evolution is represented as the deterministic unfolding of a continuous coordinate transformation. Introducing gauge potentials for the density and current density it is shown that the wave-mechanical and trajectory pictures are connected by a canonical transformation. The canonical trajectory theory is shown to provide an alternative basis for the quantum operator calculus and the issue of the observability of the quantum state is examined within this context. The construction illuminates some of the problems involved in connecting the quantum and classical descriptions.",
    "authors": [
      "Peter Holland"
    ],
    "publication_date": "2016-01-15T16:46:24Z",
    "arxiv_id": "http://arxiv.org/abs/1601.03993v1",
    "download_url": "https://arxiv.org/abs/1601.03993v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Single-qubit gate teleportation provides a quantum advantage",
    "abstract": "Gate-teleportation circuits are arguably among the most basic examples of computations believed to provide a quantum computational advantage: In seminal work [Quantum Inf. Comput., 4(2):134--145], Terhal and DiVincenzo have shown that these circuits elude simulation by efficient classical algorithms under plausible complexity-theoretic assumptions. Here we consider possibilistic simulation [Phys. Rev. A 106, 062430 (2022)], a particularly weak form of this task where the goal is to output any string appearing with non-zero probability in the output distribution of the circuit. We show that even for single-qubit Clifford-gate-teleportation circuits this simulation problem cannot be solved by constant-depth classical circuits with bounded fan-in gates. Our results are unconditional and are obtained by a reduction to the problem of computing the parity, a well-studied problem in classical circuit complexity.",
    "authors": [
      "Libor Caha",
      "Xavier Coiteux-Roy",
      "Robert Koenig"
    ],
    "publication_date": "2022-09-28T15:11:39Z",
    "arxiv_id": "http://arxiv.org/abs/2209.14158v3",
    "download_url": "https://arxiv.org/abs/2209.14158v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum state space-dimension as a quantum resource",
    "abstract": "We argue that the dimensionality of the space of quantum systems' states should be considered as a legitimate resource for quantum information tasks. The assertion is supported by the fact that quantum states with discord-like capacities can be obtained from classically correlated states in spaces of dimension large enough. We illustrate things with some simple examples that justify our claim.",
    "authors": [
      "Angelo Plastino",
      "Guido Bellomo",
      "Angel R. Plastino"
    ],
    "publication_date": "2015-05-20T17:22:04Z",
    "arxiv_id": "http://arxiv.org/abs/1505.05455v2",
    "download_url": "https://arxiv.org/abs/1505.05455v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A volumetric framework for quantum computer benchmarks",
    "abstract": "We propose a very large family of benchmarks for probing the performance of quantum computers. We call them volumetric benchmarks (VBs) because they generalize IBM's benchmark for measuring quantum volume \\cite{Cross18}. The quantum volume benchmark defines a family of square circuits whose depth $d$ and width $w$ are the same. A volumetric benchmark defines a family of rectangular quantum circuits, for which $d$ and $w$ are uncoupled to allow the study of time/space performance trade-offs. Each VB defines a mapping from circuit shapes -- $(w,d)$ pairs -- to test suites $\\mathcal{C}(w,d)$. A test suite is an ensemble of test circuits that share a common structure. The test suite $\\mathcal{C}$ for a given circuit shape may be a single circuit $C$, a specific list of circuits $\\{C_1\\ldots C_N\\}$ that must all be run, or a large set of possible circuits equipped with a distribution $Pr(C)$. The circuits in a given VB share a structure, which is limited only by designers' creativity. We list some known benchmarks, and other circuit families, that fit into the VB framework: several families of random circuits, periodic circuits, and algorithm-inspired circuits. The last ingredient defining a benchmark is a success criterion that defines when a processor is judged to have \"passed\" a given test circuit. We discuss several options. Benchmark data can be analyzed in many ways to extract many properties, but we propose a simple, universal graphical summary of results that illustrates the Pareto frontier of the $d$ vs $w$ trade-off for the processor being benchmarked.\n  [1] A. Cross, et al., Phys. Rev. A, 100, 032328, September 2019.",
    "authors": [
      "Robin Blume-Kohout",
      "Kevin C. Young"
    ],
    "publication_date": "2019-04-11T06:25:26Z",
    "arxiv_id": "http://arxiv.org/abs/1904.05546v4",
    "download_url": "https://arxiv.org/abs/1904.05546v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Condition for zero and non-zero discord in graph Laplacian quantum states",
    "abstract": "This work is at the interface of graph theory and quantum mechanics. Quantum correlations epitomize the usefulness of quantum mechanics. Quantum discord is an interesting facet of bipartite quantum correlations. Earlier, it was shown that every combinatorial graph corresponds to quantum states whose characteristics are reflected in the structure of the underlined graph. A number of combinatorial relations between quantum discord and simple graphs were studied. To extend the scope of these studies, we need to generalize the earlier concepts applicable to simple graphs to weighted graphs, corresponding to a diverse class of quantum states. To this effect, we determine the class of quantum states whose density matrix representation can be derived from graph Laplacian matrices associated with a weighted directed graph and call them graph Laplacian quantum states. We find the graph-theoretic conditions for zero and non-zero quantum discord for these states. We apply these results on some important pure two qubit states, as well as a number of mixed quantum states, such as the Werner, Isotropic, and $X$-states. We also consider graph Laplacian states corresponding to simple graphs as a special case.",
    "authors": [
      "Supriyo Dutta",
      "Bibhas Adhikari",
      "Subhashish Banerjee"
    ],
    "publication_date": "2017-05-02T06:04:31Z",
    "arxiv_id": "http://arxiv.org/abs/1705.00808v2",
    "download_url": "https://arxiv.org/abs/1705.00808v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reinforcement Learning with Neural Networks for Quantum Multiple Hypothesis Testing",
    "abstract": "Reinforcement learning with neural networks (RLNN) has recently demonstrated great promise for many problems, including some problems in quantum information theory. In this work, we apply RLNN to quantum hypothesis testing and determine the optimal measurement strategy for distinguishing between multiple quantum states $\\{ ρ_{j} \\}$ while minimizing the error probability. In the case where the candidate states correspond to a quantum system with many qubit subsystems, implementing the optimal measurement on the entire system is experimentally infeasible.\n  We use RLNN to find locally-adaptive measurement strategies that are experimentally feasible, where only one quantum subsystem is measured in each round. We provide numerical results which demonstrate that RLNN successfully finds the optimal local approach, even for candidate states up to 20 subsystems. We additionally demonstrate that the RLNN strategy meets or exceeds the success probability for a modified locally greedy approach in each random trial.\n  While the use of RLNN is highly successful for designing adaptive local measurement strategies, in general a significant gap can exist between the success probability of the optimal locally-adaptive measurement strategy and the optimal collective measurement. We build on previous work to provide a set of necessary and sufficient conditions for collective protocols to strictly outperform locally adaptive protocols. We also provide a new example which, to our knowledge, is the simplest known state set exhibiting a significant gap between local and collective protocols. This result raises interesting new questions about the gap between theoretically optimal measurement strategies and practically implementable measurement strategies.",
    "authors": [
      "Sarah Brandsen",
      "Kevin D. Stubbs",
      "Henry D. Pfister"
    ],
    "publication_date": "2020-10-16T18:49:23Z",
    "arxiv_id": "http://arxiv.org/abs/2010.08588v3",
    "download_url": "https://arxiv.org/abs/2010.08588v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Helping Students Learn Quantum Mechanics for Quantum Computing",
    "abstract": "Quantum information science and technology is a rapidly growing interdisciplinary field drawing researchers from science and engineering fields. Traditional instruction in quantum mechanics is insufficient to prepare students for research in quantum computing because there is a lack of emphasis in the current curriculum on quantum formalism and dynamics. We are investigating the difficulties students have with quantum mechanics and are developing and evaluating quantum interactive learning tutorials (QuILTs) to reduce the difficulties. Our investigation includes interviews with individual students and the development and administration of free-response and multiple-choice tests. We discuss the implications of our research and development project on helping students learn quantum mechanics relevant for quantum computing.",
    "authors": [
      "Chandralekha Singh"
    ],
    "publication_date": "2016-02-22T06:58:36Z",
    "arxiv_id": "http://arxiv.org/abs/1602.06666v1",
    "download_url": "https://arxiv.org/abs/1602.06666v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Estimating quantum Markov chains using coherent absorber post-processing and pattern counting estimator",
    "abstract": "We propose a two step strategy for estimating one-dimensional dynamical parameters of a quantum Markov chain, which involves quantum post-processing the output using a coherent quantum absorber and a \"pattern counting'' estimator computed as a simple additive functional of the outcomes trajectory produced by sequential, identical measurements on the output units. We provide strong theoretical and numerical evidence that the estimator achieves the quantum Cramer-Rao bound in the limit of large output size. Our estimation method is underpinned by an asymptotic theory of translationally invariant modes (TIMs) built as averages of shifted tensor products of output operators, labelled by binary patterns. For large times, the TIMs form a bosonic algebra and the output state approaches a joint coherent state of the TIMs whose amplitude depends linearly on the mismatch between system and absorber parameters. Moreover, in the asymptotic regime the TIMs capture the full quantum Fisher information of the output state. While directly probing the TIMs' quadratures seems impractical, we show that the standard sequential measurement is an effective joint measurement of all the TIMs number operators; indeed, we show that counts of different binary patterns extracted from the measurement trajectory have the expected joint Poisson distribution. Together with the displaced-null methodology of J. Phys. A: Math. Theor. 57 245304 2024 this provides a computationally efficient estimator which only depends on the total number of patterns. This opens the way for similar estimation strategies in continuous-time dynamics, expanding the results of Phys. Rev. X 13, 031012 2023.",
    "authors": [
      "Federico Girotti",
      "Alfred Godley",
      "Mădălin Guţă"
    ],
    "publication_date": "2024-08-01T15:12:01Z",
    "arxiv_id": "http://arxiv.org/abs/2408.00626v3",
    "download_url": "https://arxiv.org/abs/2408.00626v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sandwiched Rényi Convergence for Quantum Evolutions",
    "abstract": "We study the speed of convergence of a primitive quantum time evolution towards its fixed point in the distance of sandwiched Rényi divergences. For each of these distance measures the convergence is typically exponentially fast and the best exponent is given by a constant (similar to a logarithmic Sobolev constant) depending only on the generator of the time evolution. We establish relations between these constants and the logarithmic Sobolev constants as well as the spectral gap. An important consequence of these relations is the derivation of mixing time bounds for time evolutions directly from logarithmic Sobolev inequalities without relying on notions like lp-regularity. We also derive strong converse bounds for the classical capacity of a quantum time evolution and apply these to obtain bounds on the classical capacity of some examples, including stabilizer Hamiltonians under thermal noise.",
    "authors": [
      "Alexander Müller-Hermes",
      "Daniel Stilck Franca"
    ],
    "publication_date": "2016-06-30T20:49:56Z",
    "arxiv_id": "http://arxiv.org/abs/1607.00041v3",
    "download_url": "https://arxiv.org/abs/1607.00041v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An optimal measurement strategy to beat the quantum uncertainty in correlated system",
    "abstract": "Uncertainty principle is an inherent nature of quantum system that undermines the precise measurement of incompatible observables and hence the applications of quantum theory. Entanglement, another unique feature of quantum physics, was found may help to reduce the quantum uncertainty. In this paper, we propose a practical method to reduce the one party measurement uncertainty by determining the measurement on the other party of an entangled bipartite system. In light of this method, a family of conditional majorization uncertainty relations in the presence of quantum memory is constructed, which is applicable to arbitrary number of observables. The new family of uncertainty relations implies sophisticated structures of quantum uncertainty and nonlocality, that were usually studied by using scalar measures. Applications to reduce the local uncertainty and to witness quantum nonlocalities are also presented.",
    "authors": [
      "Jun-Li Li",
      "Cong-Feng Qiao"
    ],
    "publication_date": "2020-02-23T05:27:36Z",
    "arxiv_id": "http://arxiv.org/abs/2002.09833v2",
    "download_url": "https://arxiv.org/abs/2002.09833v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Why should we care about quantum discord?",
    "abstract": "Entanglement is a central feature of quantum theory. Mathematical properties and physical applications of pure state entanglement make it a template to study quantum correlations. However, an extension of entanglement measures to mixed states in terms of separability does not always correspond to all the operational aspects. Quantum discord measures allow an alternative way to extend the idea of quantum correlations to mixed states. In many cases these extensions are motivated by physical scenarios and quantum information protocols. In this chapter we discuss several settings involving correlated quantum systems, ranging from distributed gates to detectors testing quantum fields. In each setting we show how entanglement fails to capture the relevant features of the correlated system, and discuss the role of discord as a possible alternative.",
    "authors": [
      "Aharon Brodutch",
      "Daniel R. Terno"
    ],
    "publication_date": "2016-08-05T15:43:53Z",
    "arxiv_id": "http://arxiv.org/abs/1608.01920v1",
    "download_url": "https://arxiv.org/abs/1608.01920v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Nash equilibrium in the thermodynamic limit",
    "abstract": "The quantum Nash equilibrium in the thermodynamic limit is studied for games like quantum Prisoner's dilemma and the quantum game of chicken. A phase transition is seen in both games as a function of the entanglement in the game. We observe that for maximal entanglement irrespective of the classical payoffs, a majority of players choose Quantum strategy over Defect in the thermodynamic limit.",
    "authors": [
      "Shubhayan Sarkar",
      "Colin Benjamin"
    ],
    "publication_date": "2018-06-19T16:51:06Z",
    "arxiv_id": "http://arxiv.org/abs/1806.07343v3",
    "download_url": "https://arxiv.org/abs/1806.07343v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient classical simulation of noisy random quantum circuits in one dimension",
    "abstract": "Understanding the computational power of noisy intermediate-scale quantum (NISQ) devices is of both fundamental and practical importance to quantum information science. Here, we address the question of whether error-uncorrected noisy quantum computers can provide computational advantage over classical computers. Specifically, we study noisy random circuit sampling in one dimension (or 1D noisy RCS) as a simple model for exploring the effects of noise on the computational power of a noisy quantum device. In particular, we simulate the real-time dynamics of 1D noisy random quantum circuits via matrix product operators (MPOs) and characterize the computational power of the 1D noisy quantum system by using a metric we call MPO entanglement entropy. The latter metric is chosen because it determines the cost of classical MPO simulation. We numerically demonstrate that for the two-qubit gate error rates we considered, there exists a characteristic system size above which adding more qubits does not bring about an exponential growth of the cost of classical MPO simulation of 1D noisy systems. Specifically, we show that above the characteristic system size, there is an optimal circuit depth, independent of the system size, where the MPO entanglement entropy is maximized. Most importantly, the maximum achievable MPO entanglement entropy is bounded by a constant that depends only on the gate error rate, not on the system size. We also provide a heuristic analysis to get the scaling of the maximum achievable MPO entanglement entropy as a function of the gate error rate. The obtained scaling suggests that although the cost of MPO simulation does not increase exponentially in the system size above a certain characteristic system size, it does increase exponentially as the gate error rate decreases, possibly making classical simulation practically not feasible even with state-of-the-art supercomputers.",
    "authors": [
      "Kyungjoo Noh",
      "Liang Jiang",
      "Bill Fefferman"
    ],
    "publication_date": "2020-03-29T23:55:16Z",
    "arxiv_id": "http://arxiv.org/abs/2003.13163v3",
    "download_url": "https://arxiv.org/abs/2003.13163v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The super-indeterminism in orthodox quantum mechanics does not implicate the reality of experimenter free will",
    "abstract": "The concept of 'super-indeterminism' captures the notion that the free choice assumption of orthodox quantum mechanics necessitates only the following requirement: an agent's free-choice performance in the selection of measurement settings must not represent an exception to the rule of irreducible quantum indeterminism in the physical universe (i.e, \"universal indeterminism\"). Any additional metaphysical speculation, such as to whether quantum indeterminism, i.e., intrinsic randomness, implicates the reality of experimenter \"freedom\", \"free will\", or \"free choice\", is redundant in relation to the predictive success of orthodox quantum mechanics. Accordingly, super-indeterminism views as redundant also, from a technical standpoint, whether an affirmative or a negative answer is claimed in reference to universal indeterminism as a necessary precondition for experimenter freedom. Super-indeterminism accounts, for example, for the circular reasoning which is implicit in the free will theorem by Conway and Kochen. The concept of super-indeterminism is of great assistance in clarifying the often misunderstood meaning of the concept of \"free variables\" as used by John Bell. The present work argues that Bell sought an operational, effective free will theorem, one based upon the notion of \"determinism without predetermination\", i.e., one wherein \"free variables\" represent universally uncomputable variables. In conclusion, the standard interpretation of quantum theory does not answer, and does not need to answer in order to ensure the predictive success of orthodox theory, the question of whether either incompatibilism or compatibilism is valid in relation to free-will metaphysics and to the free-will phenomenology of experimenter agents in quantum mechanics.",
    "authors": [
      "Jan Walleczek"
    ],
    "publication_date": "2016-03-10T20:09:10Z",
    "arxiv_id": "http://arxiv.org/abs/1603.03400v2",
    "download_url": "https://arxiv.org/abs/1603.03400v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic Quantum Mechanics and Pregeometry",
    "abstract": "We discuss the relation between the q-number approach to quantum mechanics suggested by Dirac and the notion of \"pregeometry\" introduced by Wheeler. By associating the q-numbers with the elements of an algebra and regarding the primitive idempotents as \"generalized points\" we suggest an approach that may make it possible to dispense with an a priori given space manifold. In this approach the algebra itself would carry the symmetries of translation, rotation, etc. Our suggestion is illustrated in a preliminary way by using a particular generalized Clifford Algebra proposed originally by Weyl, which approaches the ordinary Heisenberg algebra in a suitable limit. We thus obtain a certain insight into how quantum mechanics may be regarded as a purely algebraic theory, provided that we further introduce a new set of \"neighbourhood operators\", which remove an important kind of arbitrariness that has thus far been present in the attempt to treat quantum mechanics solely in terms of a Heisenberg algebra.",
    "authors": [
      "D. J. Bohm",
      "P. G. Davies",
      "B. J. Hiley"
    ],
    "publication_date": "2006-11-30T22:23:55Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0612002v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0612002v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Implementable Hybrid Quantum Ant Colony Optimization Algorithm",
    "abstract": "We propose a new hybrid quantum algorithm based on the classical Ant Colony Optimization algorithm to produce approximate solutions for NP-hard problems, in particular optimization problems. First, we discuss some previously proposed Quantum Ant Colony Optimization algorithms, and based on them, we develop an improved algorithm that can be truly implemented on near-term quantum computers. Our iterative algorithm codifies only the information about the pheromones and the exploration parameter in the quantum state, while subrogating the calculation of the numerical result to a classical computer. A new guided exploration strategy is used in order to take advantage of the quantum computation power and generate new possible solutions as a superposition of states. This approach is specially useful to solve constrained optimization problems, where we can implement efficiently the exploration of new paths without having to check the correspondence of a path to a solution before the measurement of the state. As an example of a NP-hard problem, we choose to solve the Quadratic Assignment Problem. The benchmarks made by simulating the noiseless quantum circuit and the experiments made on IBM quantum computers show the validity of the algorithm.",
    "authors": [
      "Mikel Garcia de Andoin",
      "Javier Echanobe"
    ],
    "publication_date": "2021-07-08T13:50:51Z",
    "arxiv_id": "http://arxiv.org/abs/2107.03845v2",
    "download_url": "https://arxiv.org/abs/2107.03845v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On efficient quantum block encoding of pseudo-differential operators",
    "abstract": "Block encoding lies at the core of many existing quantum algorithms. Meanwhile, efficient and explicit block encodings of dense operators are commonly acknowledged as a challenging problem. This paper presents a comprehensive study of the block encoding of a rich family of dense operators: the pseudo-differential operators (PDOs). First, a block encoding scheme for generic PDOs is developed. Then we propose a more efficient scheme for PDOs with a separable structure. Finally, we demonstrate an explicit and efficient block encoding algorithm for PDOs with a dimension-wise fully separable structure. Complexity analysis is provided for all block encoding algorithms presented. The application of theoretical results is illustrated with worked examples, including the representation of variable coefficient elliptic operators and the computation of the inverse of elliptic operators without invoking quantum linear system algorithms (QLSAs).",
    "authors": [
      "Haoya Li",
      "Hongkang Ni",
      "Lexing Ying"
    ],
    "publication_date": "2023-01-21T07:18:57Z",
    "arxiv_id": "http://arxiv.org/abs/2301.08908v3",
    "download_url": "https://arxiv.org/abs/2301.08908v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Decompositions of general quantum gates",
    "abstract": "Quantum algorithms may be described by sequences of unitary transformations called quantum gates and measurements applied to the quantum register of n quantum bits, qubits. A collection of quantum gates is called universal if it can be used to construct any n-qubit gate. In 1995, the universality of the set of one-qubit gates and controlled NOT gate was shown by Barenco et al. using QR decomposition of unitary matrices. Almost ten years later the decomposition was improved to include essentially fewer elementary gates. In addition, the cosine-sine matrix decomposition was applied to efficiently implement decompositions of general quantum gates. In this chapter, we review the different types of general gate decompositions and slightly improve the best known gate count for the controlled NOT gates to (23/48)4^n in the leading order. In physical realizations, the interaction strength between the qubits can decrease strongly as a function of their distance. Therefore, we also discuss decompositions with the restriction to nearest-neighbor interactions in a linear chain of qubits.",
    "authors": [
      "M. Mottonen",
      "J. J. Vartiainen"
    ],
    "publication_date": "2005-04-14T02:02:37Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0504100v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0504100v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Temperatures of renormalizable quantum field theories in curved spacetime",
    "abstract": "In this paper we compute the temperature registered by an Unruh-DeWitt detector coupled to a Hadamard renormalizable quantum field in an arbitrary state, moving along an accelerated trajectory in a curved spacetime. For a massless and conformally invariant field, the generalized expression for the temperature is given by the quadratic sum of the 4-acceleration, Raychaudhuri scalar, and renormalized field polarization. We can further find a novel constraint on the renormalized quantum field polarization in relativistic systems that are in global thermal equilibrium.",
    "authors": [
      "Morgan H. Lynch",
      "Niayesh Afshordi"
    ],
    "publication_date": "2016-11-21T00:43:44Z",
    "arxiv_id": "http://arxiv.org/abs/1611.06619v2",
    "download_url": "https://arxiv.org/abs/1611.06619v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient solution of the non-unitary time-dependent Schrodinger equation on a quantum computer with complex absorbing potential",
    "abstract": "We explore the possibility of adding complex absorbing potential at the boundaries when solving the one-dimensional real-time Schrödinger evolution on a grid using a quantum computer with a fully quantum algorithm described on a $n$ qubit register. Due to the complex potential, the evolution mixes real- and imaginary-time propagation and the wave function can potentially be continuously absorbed during the time propagation. We use the dilation quantum algorithm to treat the imaginary-time evolution in parallel to the real-time propagation. This method has the advantage of using only one reservoir qubit at a time, that is measured with a certain success probability to implement the desired imaginary-time evolution. We propose a specific prescription for the dilation method where the success probability is directly linked to the physical norm of the continuously absorbed state evolving on the mesh. We expect that the proposed prescription will have the advantage of keeping a high probability of success in most physical situations. Applications of the method are made on one-dimensional wave functions evolving on a mesh. Results obtained on a quantum computer identify with those obtained on a classical computer. We finally give a detailed discussion on the complexity of implementing the dilation matrix. Due to the local nature of the potential, for $n$ qubits, the dilation matrix only requires $2^n$ CNOT and $2^n$ unitary rotation for each time step, whereas it would require of the order of $4^{n+1}$ C-NOT gates to implement it using the best-known algorithm for general unitary matrices.",
    "authors": [
      "Mariane Mangin-Brinet",
      "Jing Zhang",
      "Denis Lacroix",
      "Edgar Andres Ruiz Guzman"
    ],
    "publication_date": "2023-11-27T14:25:41Z",
    "arxiv_id": "http://arxiv.org/abs/2311.15859v2",
    "download_url": "https://arxiv.org/abs/2311.15859v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum algorithms: an overview",
    "abstract": "Quantum computers are designed to outperform standard computers by running quantum algorithms. Areas in which quantum algorithms can be applied include cryptography, search and optimisation, simulation of quantum systems, and solving large systems of linear equations. Here we briefly survey some known quantum algorithms, with an emphasis on a broad overview of their applications rather than their technical details. We include a discussion of recent developments and near-term applications of quantum algorithms.",
    "authors": [
      "Ashley Montanaro"
    ],
    "publication_date": "2015-11-13T09:16:47Z",
    "arxiv_id": "http://arxiv.org/abs/1511.04206v2",
    "download_url": "https://arxiv.org/abs/1511.04206v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient quantum simulation of fermionic and bosonic models in trapped ions",
    "abstract": "We analyze the efficiency of quantum simulations of fermionic and bosonic models in trapped ions. In particular, we study the optimal time of entangling gates and the required number of total elementary gates. Furthermore, we exemplify these estimations in the light of quantum simulations of quantum field theories, condensed-matter physics, and quantum chemistry. Finally, we show that trapped-ion technologies are a suitable platform for implementing quantum simulations involving interacting fermionic and bosonic modes, paving the way for overcoming classical computers in the near future.",
    "authors": [
      "L. Lamata",
      "A. Mezzacapo",
      "J. Casanova",
      "E. Solano"
    ],
    "publication_date": "2013-12-10T16:10:22Z",
    "arxiv_id": "http://arxiv.org/abs/1312.2849v3",
    "download_url": "https://arxiv.org/abs/1312.2849v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]