[
  {
    "title": "Recent experiments performed at \"Carlo Novero\" lab at INRIM on Quantum Information and Foundations of Quantum Mechanics",
    "abstract": "In this paper we present some recent work performed at \"Carlo Novero\" lab on Quantum Information and Foundations of Quantum Mechanics.",
    "authors": [
      "G. Brida",
      "N. Antonietti",
      "M. Gramegna",
      "L. Krivitsky",
      "F. Piacentini",
      "M. L. Rastello",
      "I. Ruo Berchera",
      "P. Traina",
      "M. Genovese"
    ],
    "publication_date": "2007-05-22T15:09:59Z",
    "arxiv_id": "http://arxiv.org/abs/0705.3203v1",
    "download_url": "https://arxiv.org/abs/0705.3203v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tianyan: Cloud services with quantum advantage",
    "abstract": "Tianyan Quantum Cloud Platform offers cloud services demonstrating quantum advantage capabilities with a Zuchongzhi 3.0-like superconducting quantum processor. This cloud-accessible superconducting quantum prototype, named Tianyan-287, features 105 qubits and achieves high operational fidelities, with single-qubit gates, two-qubit gates, and readout fidelity at 99.90%, 99.56%, 98.7%, respectively. For a specific benchmark task involving random circuit sampling on a 74-qubit system over 24 cycles, the platform completes one million samples in just 18.4 minutes. In contrast, state-of-the-art classical supercomputers would require approximately 16,000 years to complete the equivalent calculation. To facilitate this, the platform provides access via Cqlib, an open-source SDK designed for working with quantum systems at the level of extended quantum circuits, operators, and primitives. The cloud service aims to democratize access to high-performance quantum hardware, enabling the community to validate and explore practical quantum advantages.",
    "authors": [
      "Tianyan Quantum Group"
    ],
    "publication_date": "2025-12-11T10:23:39Z",
    "arxiv_id": "http://arxiv.org/abs/2512.10504v2",
    "download_url": "https://arxiv.org/abs/2512.10504v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Doubly Quantum Mechanics",
    "abstract": "Motivated by the expectation that relativistic symmetries might acquire quantum features in Quantum Gravity, we take the first steps towards a theory of ''Doubly'' Quantum Mechanics, a modification of Quantum Mechanics in which the geometrical configurations of physical systems, measurement apparata, and reference frame transformations are themselves quantized and described by ''geometry'' states in a Hilbert space. We develop the formalism for spin-$\\frac{1}{2}$ measurements by promoting the group of spatial rotations $SU(2)$ to the quantum group $SU_q(2)$ and generalizing the axioms of Quantum Theory in a covariant way. As a consequence of our axioms, the notion of probability becomes a self-adjoint operator acting on the Hilbert space of geometry states, hence acquiring novel non-classical features. After introducing a suitable class of semi-classical geometry states, which describe near-to-classical geometrical configurations of physical systems, we find that probability measurements are affected, in these configurations, by intrinsic uncertainties stemming from the quantum properties of $SU_q(2)$. This feature translates into an unavoidable fuzziness for observers attempting to align their reference frames by exchanging qubits, even when the number of exchanged qubits approaches infinity, contrary to the standard $SU(2)$ case.",
    "authors": [
      "Vittorio D'Esposito",
      "Giuseppe Fabiano",
      "Domenico Frattulillo",
      "Flavio Mercati"
    ],
    "publication_date": "2024-12-08T17:10:35Z",
    "arxiv_id": "http://arxiv.org/abs/2412.05997v3",
    "download_url": "https://arxiv.org/abs/2412.05997v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ontological Models for Quantum Mechanics and the Kochen-Specker theorem",
    "abstract": "Certain concrete \"ontological models\" for quantum mechanics (models in which measurement outcomes are deterministic and quantum states are equivalent to classical probability distributions over some space of `hidden variables') are examined. The models are generalizations of Kochen and Specker's such model for a single 2-dimensional system - in particular a model for a three dimensional quantum system is considered in detail. Unfortunately, it appears the models do not quite reproduce the quantum mechanical statistics. They do, however, come close to doing so, and in as much as they simply involve probability distributions over the complex projective space they do reproduce pretty much everything else in quantum mechanics.\n  The Kochen-Specker theorem is examined in the light of these models, and the rather mild nature of the manifested contextuality is discussed.",
    "authors": [
      "Terry Rudolph"
    ],
    "publication_date": "2006-08-15T04:11:21Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0608120v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0608120v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generalizing Quantum Mechanics for Quantum Spacetime",
    "abstract": "Familiar textbook quantum mechanics assumes a fixed background spacetime to define states on spacelike surfaces and their unitary evolution between them. Quantum theory has changed as our conceptions of space and time have evolved. But quantum mechanics needs to be generalized further for quantum gravity where spacetime geometry is fluctuating and without definite value. This paper reviews a fully four-dimensional, sum-over-histories, generalized quantum mechanics of cosmological spacetime geometry. This generalization is constructed within the framework of generalized quantum theory. This is a minimal set of principles for quantum theory abstracted from the modern quantum mechanics of closed systems, most generally the universe. In this generalization, states of fields on spacelike surfaces and their unitary evolution are emergent properties appropriate when spacetime geometry behaves approximately classically. The principles of generalized quantum theory allow for the further generalization that would be necessary were spacetime not fundamental. Emergent spacetime phenomena are discussed in general and illustrated with the example of the classical spacetime geometries with large spacelike surfaces that emerge from the `no-boundary' wave function of the universe. These must be Lorentzian with one, and only one, time direction. The essay concludes by raising the question of whether quantum mechanics itself is emergent.",
    "authors": [
      "James B. Hartle"
    ],
    "publication_date": "2006-02-02T21:37:43Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0602013v2",
    "download_url": "https://arxiv.org/abs/gr-qc/0602013v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Mechanics in symmetry language",
    "abstract": "We consider symmetry as a foundational concept in quantum mechanics and rewrite quantum mechanics and measurement axioms in this description. We argue that issues related to measurements and physical reality of states can be better understood in this view. In particular, the abstract concept of symmetry provides a basis-independent definition for observables. Moreover, we show that the apparent projection/collapse of the state as the final step of measurement or decoherence is the result of breaking of symmetries. This phenomenon is comparable with a phase transition by spontaneous symmetry breaking, and makes the process of decoherence and classicality a natural fate of complex systems consisting of many interacting subsystems. Additionally, we demonstrate that the property of state space as a vector space representing symmetries is more fundamental than being an abstract Hilbert space, and its $L2$ integrability can be obtained from the imposed condition of being a representation of a symmetry group and general properties of probability distributions.",
    "authors": [
      "Houri Ziaeepour"
    ],
    "publication_date": "2013-05-19T11:28:13Z",
    "arxiv_id": "http://arxiv.org/abs/1305.4349v6",
    "download_url": "https://arxiv.org/abs/1305.4349v6",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interference in Quantum Mechanics",
    "abstract": "Physicist and Nobel Laureate Richard P. Feynman once remarked ``We choose to examine a phenomenon which is impossible, absolutely impossible, to explain in any classical way, and which has in it the heart of quantum mechanics. In reality, it contains the only mystery. We cannot make the mystery go away by ``explaining'' how it works. We will just tell you how it works. In telling you how it works, we will have told you about the basic peculiarities of all quantum mechanics'' [Feynman RP, Leighton RB, Sands M (1963 and 1965)]. The phenomenon of interference is ubiquitous in the quantum world and indeed holds within itself the explanation for many counterintuitive quantum phenomena. In this review, we choose to focus on a few ramifications and manifestations of quantum interference that have deep implications for the foundations of quantum mechanics. These include single-photon or second-order interference, two-photon or fourth-order interference and higher-order interference.",
    "authors": [
      "Debadrita Ghosh",
      "Urbasi Sinha"
    ],
    "publication_date": "2025-08-18T14:13:55Z",
    "arxiv_id": "http://arxiv.org/abs/2508.12940v1",
    "download_url": "https://arxiv.org/abs/2508.12940v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Double or nothing: a Kolmogorov extension theorem for multitime (bi)probabilities in quantum mechanics",
    "abstract": "The multitime probability distributions obtained by repeatedly probing a quantum system via the measurement of an observable generally violate Kolmogorov's consistency property. Therefore, one cannot interpret such distributions as the result of the sampling of a single trajectory. We show that, nonetheless, they do result from the sampling of one pair of trajectories. In this sense, rather than give up on trajectories, quantum mechanics requires to double down on them. To this purpose, we prove a generalization of the Kolmogorov extension theorem that applies to families of complex-valued bi-probability distributions (that is, defined on pairs of elements of the original sample spaces), and we employ this result in the quantum mechanical scenario. We also discuss the relation of our results with the quantum comb formalism.",
    "authors": [
      "Davide Lonigro",
      "Fattah Sakuldee",
      "Łukasz Cywiński",
      "Dariusz Chruściński",
      "Piotr Szańkowski"
    ],
    "publication_date": "2024-02-02T08:40:03Z",
    "arxiv_id": "http://arxiv.org/abs/2402.01218v3",
    "download_url": "https://arxiv.org/abs/2402.01218v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Mechanics Without Observers",
    "abstract": "The measurement problem and the role of observers have plagued quantum mechanics since its conception. Attempts to resolve these have introduced anthropomorphic or non-realist notions into physics. A shift of perspective based upon process theory and utilizing methods from combinatorial games, interpolation theory and complex systems theory results in a novel realist version of quantum mechanics incorporating quasi-local, nondeterministic hidden variables that are compatible with the no-hidden variable theorems and relativistic invariance, and reproduce the standard results of quantum mechanics to a high degree of accuracy without invoking observers.",
    "authors": [
      "W. H. Sulis"
    ],
    "publication_date": "2013-02-18T04:01:20Z",
    "arxiv_id": "http://arxiv.org/abs/1302.4156v2",
    "download_url": "https://arxiv.org/abs/1302.4156v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanics from invariance principles",
    "abstract": "Quantum mechanics is an extremely successful theory of nature and yet it lacks an intuitive axiomatization. In contrast, the special theory of relativity is well understood and is rooted into natural or experimentally justified postulates. Here we introduce an axiomatization approach to quantum mechanics which is very similar to special theory of relativity derivation. The core idea is that a composed system obeys the same laws of nature as its components. This leads to a Jordan-Lie algebraic formulation of quantum mechanics. The starting assumptions are minimal: the laws of nature are invariant under time evolution, the laws of nature are invariant under tensor composition, the laws of nature are relational, together with the ability to define a physical state (positivity). Quantum mechanics is singled out by a fifth experimentally justified postulate: nature violates Bell inequalities.",
    "authors": [
      "Florin Moldoveanu"
    ],
    "publication_date": "2013-03-16T00:50:24Z",
    "arxiv_id": "http://arxiv.org/abs/1303.3935v3",
    "download_url": "https://arxiv.org/abs/1303.3935v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the classical limit of the hyperbolic quantum mechanics",
    "abstract": "We demonstrated that classical mechanics have, besides the well known quantum deformation, another deformation -- so called hyperbolic quantum mechanics. The classical Poisson bracket can be obtained as the limit $h\\to 0$ not only of the ordinary Moyal bracket, but also hyperbolic analogue of the Moyal bracket. Thus there are two different deformations of classical phase-space: complex Hilbert space and hyperbolic Hilbert space (module over a so called hyperbolic algebra -- the two dimensional Clifford algebra). To prove the correspondence principle we use the calculus over the hyperbolic algebra similar to functional superanalysis of Vladimirov-Volovich. Ordinary (complex) and hyperbolic quantum mechanics are characterized by two types of interference perturbation of the classical formula of total probability: ordinary $\\cos$-interference and hyperbolic $\\cosh$-interference.",
    "authors": [
      "Andrei Yu. Khrennikov"
    ],
    "publication_date": "2004-01-08T17:10:44Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0401035v3",
    "download_url": "https://arxiv.org/abs/quant-ph/0401035v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Galilei group as quantum reference frame transformations",
    "abstract": "Quantum groups have been widely explored as a tool to encode possible nontrivial generalisations of reference frame transformations, relevant in quantum gravity. In quantum information, it was found that the reference frames can be associated to quantum particles, leading to quantum reference frames transformations. The connection between these two frameworks is still unexplored, but if clarified it will lead to a more profound understanding of symmetries in quantum mechanics and quantum gravity. Here, we establish a correspondence between quantum reference frame transformations and transformations generated by a quantum deformation of the Galilei group with commutative time, taken at first order in the quantum deformation parameter. This is found once the quantum group noncommutative transformation parameters are represented on the phase space of a quantum particle, and upon setting the quantum deformation parameter to be proportional to the inverse of the mass of the particle serving as the quantum reference frame. These results allow us to show that quantum reference frame transformations are physically relevant when the state of the quantum reference frame is in a quantum superposition of semiclassical states. We conjecture that the all-order quantum Galilei group describes quantum reference frame transformations between more general quantum states of the quantum reference frame.",
    "authors": [
      "Angel Ballesteros",
      "Diego Fernandez-Silvestre",
      "Flaminia Giacomini",
      "Giulia Gubitosi"
    ],
    "publication_date": "2025-04-01T09:25:58Z",
    "arxiv_id": "http://arxiv.org/abs/2504.00569v3",
    "download_url": "https://arxiv.org/abs/2504.00569v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Mechanics in Phase Space: An introduction",
    "abstract": "Informal collection of lecture notes introducing quantum mechanics in phase space and basic Gaussian quantum mechanics.",
    "authors": [
      "Eduardo Martín-Martínez"
    ],
    "publication_date": "2022-08-18T07:32:37Z",
    "arxiv_id": "http://arxiv.org/abs/2208.08682v6",
    "download_url": "https://arxiv.org/abs/2208.08682v6",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Can quantum mechanics be an emergent phenomenon?",
    "abstract": "We raise the issue whether conventional quantum mechanics, which is not a hidden variable theory in the usual Jauch-Piron's sense, might nevertheless be a hidden variable theory in the sense recently conjectured by G. 't Hooft in his pre-quantization scheme. We find that quantum mechanics might indeed have a fully deterministic underpinning by showing that Born's rule naturally emerges (i.e., it is not postulated) when 't Hooft's Hamiltonian for be-ables is combined with the Koopmann - von Neumann operatorial formulation of classical physics.",
    "authors": [
      "Massimo Blasone",
      "Petr Jizba",
      "Fabio Scardigli"
    ],
    "publication_date": "2009-01-26T18:14:46Z",
    "arxiv_id": "http://arxiv.org/abs/0901.3907v2",
    "download_url": "https://arxiv.org/abs/0901.3907v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Testing quantum mechanics: a statistical approach",
    "abstract": "As experiments continue to push the quantum-classical boundary using increasingly complex dynamical systems, the interpretation of experimental data becomes more and more challenging: when the observations are noisy, indirect, and limited, how can we be sure that we are observing quantum behavior? This tutorial highlights some of the difficulties in such experimental tests of quantum mechanics, using optomechanics as the central example, and discusses how the issues can be resolved using techniques from statistics and insights from quantum information theory.",
    "authors": [
      "Mankei Tsang"
    ],
    "publication_date": "2013-06-12T02:51:25Z",
    "arxiv_id": "http://arxiv.org/abs/1306.2699v4",
    "download_url": "https://arxiv.org/abs/1306.2699v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bohmian Mechanics as the Foundation of Quantum Mechanics",
    "abstract": "In order to arrive at Bohmian mechanics from standard nonrelativistic quantum mechanics one need do almost nothing! One need only complete the usual quantum description in what is really the most obvious way: by simply including the positions of the particles of a quantum system as part of the state description of that system, allowing these positions to evolve in the most natural way. The entire quantum formalism, including the uncertainty principle and quantum randomness, emerges from an analysis of this evolution. This can be expressed succinctly---though in fact not succinctly enough---by declaring that the essential innovation of Bohmian mechanics is the insight that {\\it particles move }!",
    "authors": [
      "D. Dürr",
      "S. Goldstein",
      "N. Zanghi"
    ],
    "publication_date": "1995-11-14T11:18:31Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9511016v1",
    "download_url": "https://arxiv.org/abs/quant-ph/9511016v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Superpositions of thermalisations in relativistic quantum field theory",
    "abstract": "Recent results in relativistic quantum information and quantum thermodynamics have independently shown that in the quantum regime, a system may fail to thermalise when subject to quantum-controlled application of the same, single thermalisation channel. For example, an accelerating system with fixed proper acceleration is known to thermalise to an acceleration-dependent temperature, known as the Unruh temperature. However, the same system in a superposition of spatially translated trajectories that share the same proper acceleration fails to thermalise. Here, we provide an explanation of these results using the framework of quantum field theory in relativistic noninertial reference frames. We show how a probe that accelerates in a superposition of spatial translations interacts with incommensurate sets of field modes. In special cases where the modes are orthogonal (for example, when the Rindler wedges are translated in a direction orthogonal to the plane of motion), thermalisation does indeed result, corroborating the here provided explanation. We then discuss how this description relates to an information-theoretic approach aimed at studying quantum aspects of temperature through quantum-controlled thermalisations. The present work draws a connection between research in quantum information, relativistic physics, and quantum thermodynamics, in particular showing that relativistic quantum effects can provide a natural realisation of quantum thermodynamical scenarios.",
    "authors": [
      "Joshua Foo",
      "Magdalena Zych"
    ],
    "publication_date": "2023-07-05T18:42:17Z",
    "arxiv_id": "http://arxiv.org/abs/2307.02593v2",
    "download_url": "https://arxiv.org/abs/2307.02593v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The linearity of quantum mechanics from the perspective of Hamiltonian cellular automata",
    "abstract": "We discuss the action principle and resulting Hamiltonian equations of motion for a class of integer-valued cellular automata introduced recently [1]. Employing sampling theory, these deterministic finite-difference equations are mapped reversibly on continuum equations describing a set of bandwidth limited harmonic oscillators. They represent the Schroedinger equation. However, modifications reflecting the bandwidth limit are incorporated, i.e., the presence of a time (or length) scale. When this discreteness scale is taken to zero, the usual results are obtained. Thus, the linearity of quantum mechanics can be traced to the postulated action principle of such cellular automata and its conservation laws to discrete ones. The cellular automaton conservation laws are in one-to-one correspondence with those of the related quantum mechanical model, while admissible symmetries are not.",
    "authors": [
      "Hans-Thomas Elze"
    ],
    "publication_date": "2014-03-11T16:56:43Z",
    "arxiv_id": "http://arxiv.org/abs/1403.2646v1",
    "download_url": "https://arxiv.org/abs/1403.2646v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Maxwell meets Reeh-Schlieder: the quantum mechanics of neutral bosons",
    "abstract": "We find that biorthogonal quantum mechanics with a scalar product that counts both absorbed and emitted particles leads to covariant position operators with localized eigenvectors. In this manifestly covariant formulation the probability for a transition from a one-photon state to a position eigenvector is the first order Glauber correlation function, bridging the gap between photon counting and the sensitivity of light detectors to electromagnetic energy density. The position eigenvalues are identified as the spatial parameters in the canonical quantum field operators and the position basis describes an array of localized devices that instantaneously absorb and re-emit bosons.",
    "authors": [
      "Margaret Hawton",
      "Vincent Debierre"
    ],
    "publication_date": "2016-10-25T15:49:11Z",
    "arxiv_id": "http://arxiv.org/abs/1610.07927v2",
    "download_url": "https://arxiv.org/abs/1610.07927v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Against (unitary) interpretation (of quantum mechanics): removing the metaphysical load",
    "abstract": "In June 1925 Heisenberg arrived at Helgoland/Heligoland island to escape a fit of hay fever. He returned with a sketch of a strange theory of the micro-world, which we now call quantum mechanics. This essay attempts to present a look at this theory, which tries to return to the original insight of Heisenberg on what should be the essence of a theory of atomic realm: it must be a theory of the observable events, in which fundamentally unobservable quantities have no place. No ontological status is given to elements of the mathematical formulation of the theory. The theory is about our description of events in laboratories, probabilities of which are given by the Born rule.\n  Following Bohr, these events involve macroscopic measuring apparatuses, and the accessible final events are classically describable. Information about the events is cloneable, as it is of a classical nature.\n  The modern quantum theory of classicality is the decoherence theory. It treats \"the pointer variable\" of measuring apparatus as an open system interacting with an environment consisting of all other \"zillions\" of degrees of freedom of the device, and anything coupled to it. Because such environment is uncontrollable we have no possibility to reverse measurements. The quantum mechanical measurement theory based on decoherence theory is reproducing the predictions of Born rule.\n  Notwithstanding, possibility of reversing measurements and of application of Born rule in situations other than these which lead to macroscopically observable events are features of a modification of quantum mechanics which is called by its adherents \"unitary quantum mechanics\".\n  As its predictions, which go beyond quantum mechanics, are not testable - we claim that unitary quantum mechanics in an interpretation of quantum mechanics. As such it is metaphysics.",
    "authors": [
      "Marek Żukowski",
      "Marcin Markiewicz"
    ],
    "publication_date": "2024-09-25T16:19:44Z",
    "arxiv_id": "http://arxiv.org/abs/2409.17061v3",
    "download_url": "https://arxiv.org/abs/2409.17061v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Achieving the quantum field theory limit in far-from-equilibrium quantum link models",
    "abstract": "Realizations of gauge theories in setups of quantum synthetic matter open up the possibility of probing salient exotic phenomena in condensed matter and high-energy physics, along with potential applications in quantum information and science technologies. In light of the impressive ongoing efforts to achieve such realizations, a fundamental question regarding quantum link model regularizations of lattice gauge theories is how faithfully they capture the quantum field theory limit of gauge theories. Recent work [Zache, Van Damme, Halimeh, Hauke, and Banerjee, at https://journals.aps.org/prd/abstract/10.1103/PhysRevD.106.L091502 has shown through analytic derivations, exact diagonalization, and infinite matrix product state calculations that the low-energy physics of $1+1$D $\\mathrm{U}(1)$ quantum link models approaches the quantum field theory limit already at small link spin length $S$. Here, we show that the approach to this limit also lends itself to the far-from-equilibrium quench dynamics of lattice gauge theories, as demonstrated by our numerical simulations of the Loschmidt return rate and the chiral condensate in infinite matrix product states, which work directly in the thermodynamic limit. Similar to our findings in equilibrium that show a distinct behavior between half-integer and integer link spin lengths, we find that criticality emerging in the Loschmidt return rate is fundamentally different between half-integer and integer spin quantum link models in the regime of strong electric-field coupling. Our results further affirm that state-of-the-art finite-size ultracold-atom and NISQ-device implementations of quantum link lattice gauge theories have the real potential to simulate their quantum field theory limit even in the far-from-equilibrium regime.",
    "authors": [
      "Jad C. Halimeh",
      "Maarten Van Damme",
      "Torsten V. Zache",
      "Debasish Banerjee",
      "Philipp Hauke"
    ],
    "publication_date": "2021-12-08T19:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/2112.04501v3",
    "download_url": "https://arxiv.org/abs/2112.04501v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time's Arrow in a Quantum Universe: On the Status of Statistical Mechanical Probabilities",
    "abstract": "In a quantum universe with a strong arrow of time, it is standard to postulate that the initial wave function started in a particular macrostate--the special low-entropy macrostate selected by the Past Hypothesis. Moreover, there is an additional postulate about statistical mechanical probabilities according to which the initial wave function is a \"typical\" choice in the macrostate (the Statistical Postulate). Together, they support a probabilistic version of the Second Law of Thermodynamics: typical initial wave functions will increase in entropy. Hence, there are two sources of randomness in such a universe: the quantum-mechanical probabilities of the Born rule and the statistical mechanical probabilities of the Statistical Postulate. I propose a new way to understand time's arrow in a quantum universe. It is based on what I call the Thermodynamic Theories of Quantum Mechanics. According to this perspective, there is a natural choice for the initial quantum state of the universe, which is given by not a wave function but by a density matrix. The initial density matrix of the universe is exactly the (normalized) projection operator onto the Past Hypothesis subspace (of the Hilbert space of the universe). Thus, given an initial subspace, we obtain a unique choice of the initial density matrix. I call this property \"the conditional uniqueness\" of the initial quantum state. The conditional uniqueness provides a new and general strategy to eliminate statistical mechanical probabilities in the fundamental physical theories, by which we can reduce the two sources of randomness to only the quantum mechanical one. I also explore the idea of an \"absolutely unique\" initial quantum state, in a way that might realize Penrose's idea (1989) of a strongly deterministic universe.",
    "authors": [
      "Eddy Keming Chen"
    ],
    "publication_date": "2019-02-12T02:43:03Z",
    "arxiv_id": "http://arxiv.org/abs/1902.04564v1",
    "download_url": "https://arxiv.org/abs/1902.04564v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Searching for Coherent States: From Origins to Quantum Gravity",
    "abstract": "We discuss the notion of coherent states from three different perspectives: the seminal approach of Schroedinger, the experimental take of quantum optics, and the theoretical developments in quantum gravity. This comparative study tries to emphasise the connections between the approaches, and to offer a coherent short story of the field, so to speak. It may be useful for pedagogical purposes, as well as for specialists of quantum optics and quantum gravity willing to embed their perspective within a wider landscape.",
    "authors": [
      "Pierre Martin-Dussaud"
    ],
    "publication_date": "2020-03-26T09:30:00Z",
    "arxiv_id": "http://arxiv.org/abs/2003.11810v4",
    "download_url": "https://arxiv.org/abs/2003.11810v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Space, Quantum Time, and Relativistic Quantum Mechanics",
    "abstract": "We treat space and time as bona fide quantum degrees of freedom on an equal footing in Hilbert space. Motivated by considerations in quantum gravity, we focus on a paradigm dealing with linear, first-order Hamiltonian and momentum constraints that lead to emergent features of temporal and spatial translations. Unlike the conventional treatment, we show that Klein-Gordon and Dirac equations in relativistic quantum mechanics can be unified in our paradigm by applying relativistic dispersion relations to eigenvalues rather than treating them as operator-valued equations. With time and space being treated on an equal footing in Hilbert space, we show symmetry transformations to be implemented by unitary basis changes in Hilbert space, giving them a stronger quantum mechanical footing. Global symmetries, such as Lorentz transformations, modify the decomposition of Hilbert space; and local symmetries, such as $U(1)$ gauge symmetry are diagonal in coordinate basis and do not alter the decomposition of Hilbert space. We briefly discuss extensions of this paradigm to quantum field theory and quantum gravity.",
    "authors": [
      "Ashmeet Singh"
    ],
    "publication_date": "2020-04-20T09:04:15Z",
    "arxiv_id": "http://arxiv.org/abs/2004.09139v2",
    "download_url": "https://arxiv.org/abs/2004.09139v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Remarks on unsharp quantum observables, objectification, and modal interpretations",
    "abstract": "This paper addresses the question whether a variant of a modal interpretation is conceivable that could accommodate property ascriptions associated with nonorthogonal resolutions of the unity and nonorthogonal families of relative states as they occur in imperfect or genuinely unsharp measurements. I will review a recent formulation of the quantum measurement problem in the form of an insolubility theorem that incorporates the case of unsharp object observables as well as certain types of unsharp pointers. In addition to demonstrating the necessity for some modification of quantum mechanics, this allows me to specify the logical position of the modal interpretations as a resolution to the measurement problem and to indicate why I think their current versions are not yet capable of dealing adequately with unsharp quantum observables. The technical tools that will have been explained along this line of reasoning will finally serve to make precise the notion of (unsharp) value ascription that I would find desirable for a modal interpretation to ascertain.",
    "authors": [
      "P. Busch"
    ],
    "publication_date": "1998-02-02T16:32:03Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9802006v1",
    "download_url": "https://arxiv.org/abs/quant-ph/9802006v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Platonic solids and fundamental tests of quantum mechanics",
    "abstract": "The Platonic solids is the name traditionally given to the five regular convex polyhedra, namely the tetradron, the octahedron, the cube, the icosahedron and the dodecahedron. Perhaps strongly boosted by the towering historical influence of their namesake, these beautiful solids have, in well over two millenia, transcended traditional boundaries and entered the stage in a range of disciplines. Examples include natural philosophy and mathematics from classical antiquity, scientific modeling during the days of the european scientific revolution and visual arts ranging from the renaissance to modernity. Motivated by mathematical beauty and a rich history, we consider the Platonic solids in the context of modern quantum mechanics. Specifically, we construct Bell inequalities whose maximal violations are achieved with measurements pointing to the vertices of the Platonic solids. These Platonic Bell inequalities are constructed only by inspecting the visible symmetries of the Platonic solids. We also construct Bell inequalities for more general polyhedra and find a Bell inequality that is more robust to noise than the celebrated Clauser-Horne-Shimony-Holt Bell inequality. Finally, we elaborate on the tension between mathematical beauty, which was our initial motivation, and experimental friendliness, which is necessary in all empirical sciences.",
    "authors": [
      "Armin Tavakoli",
      "Nicolas Gisin"
    ],
    "publication_date": "2020-01-01T10:46:15Z",
    "arxiv_id": "http://arxiv.org/abs/2001.00188v3",
    "download_url": "https://arxiv.org/abs/2001.00188v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Determinism beneath Quantum Mechanics",
    "abstract": "Contrary to common belief, it is not difficult to construct deterministic models where stochastic behavior is correctly described by quantum mechanical amplitudes, in precise accordance with the Copenhagen-Bohr-Bohm doctrine. What is difficult however is to obtain a Hamiltonian that is bounded from below, and whose ground state is a vacuum that exhibits complicated vacuum fluctuations, as in the real world.\n  Beneath Quantum Mechanics, there may be a deterministic theory with (local) information loss. This may lead to a sufficiently complex vacuum state, and to an apparent non-locality in the relation between the deterministic (\"ontological\") states and the quantum states, of the kind needed to explain away the Bell inequalities.\n  Theories of this kind would not only be appealing from a philosophical point of view, but may also be essential for understanding causality at Planckian distance scales.",
    "authors": [
      "Gerard 't Hooft"
    ],
    "publication_date": "2002-12-16T17:21:02Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0212095v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0212095v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Intrinsic vulnerabilities to mechanical failure in nanoscale films",
    "abstract": "We use molecular simulations to explore how sample dimensions and interfacial properties impact some generic aspects of the mechanical and structural behavior of nanoconfined materials. Specifically, we calculate the strain-dependent properties of minimum-energy thin-film particle configurations (i.e., inherent structures) confined between attractive, parallel substrates. We examine how the relationship between the transverse strain and the stress tensor (the equation of state of the energy landscape) depends on the properties of the film and substrate. We find that both film thickness and film-substrate attractions influence not only the mechanical properties of thin films, but also the shape and location of the \"weak spots\" where voids preferentially form in a film as it is strained beyond its point of maximum tensile stress. The sensitivity of weak spots to film properties suggests that nanoscale materials may be intrinsically vulnerabile to specific mechanisms of mechanical failure.",
    "authors": [
      "Pooja Shah",
      "Thomas M. Truskett"
    ],
    "publication_date": "2005-02-12T08:16:46Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0502303v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0502303v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantumness beyond quantum mechanics",
    "abstract": "Bohmian mechanics allows us to understand quantum systems in the light of other quantum traits than the well-known ones (coherence, diffraction, interference, tunneling, discreteness, entanglement, etc.). Here the discussion focusses precisely on two of these interesting aspects, which arise when quantum mechanics is though within this theoretical framework: the non-crossing property, which allows for distinguishability without erasing interference patterns, and the possibility to define quantum probability tubes, along which the probability remains constant all the way. Furthermore, taking into account this hydrodynamic-like description as a link, it is also shown how this knowledge (concepts and ideas) can be straightforwardly transferred to other fields of physics (for example, the transmission of light along waveguides).",
    "authors": [
      "A. S. Sanz"
    ],
    "publication_date": "2012-02-23T13:57:43Z",
    "arxiv_id": "http://arxiv.org/abs/1202.5181v1",
    "download_url": "https://arxiv.org/abs/1202.5181v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time-delocalized quantum subsystems and operations: on the existence of processes with indefinite causal structure in quantum mechanics",
    "abstract": "It has been shown that it is theoretically possible for there to exist higher-order quantum processes in which the operations performed by separate parties cannot be ascribed a definite causal order. Some of these processes are believed to have a physical realization in standard quantum mechanics via coherent control of the times of the operations. A prominent example is the quantum SWITCH, which was recently demonstrated experimentally. However, the interpretation of such experiments as realizations of a process with indefinite causal structure as opposed to some form of simulation of such a process has remained controversial. Where exactly are the local operations of the parties in such an experiment? On what spaces do they act given that their times are indefinite? Can we probe them directly rather than assume what they ought to be based on heuristic considerations? How can we reconcile the claim that these operations really take place, each once as required, with the fact that the structure of the presumed process implies that they cannot be part of any acyclic circuit? Here, I offer a precise answer to these questions: the input and output systems of the operations in such a process are generally nontrivial subsystems of Hilbert spaces that are tensor products of Hilbert spaces associated with systems at different times---a fact that is directly experimentally verifiable. With respect to these time-delocalized subsystems, the structure of the process is one of a circuit with a causal cycle. I also identify a whole class of isometric processes, of which the quantum SWITCH is a special case, that admit a physical realization on time-delocalized subsystems. These results unveil a novel structure within quantum mechanics, which may have important implications for physics and information processing.",
    "authors": [
      "Ognyan Oreshkov"
    ],
    "publication_date": "2018-01-23T14:55:15Z",
    "arxiv_id": "http://arxiv.org/abs/1801.07594v4",
    "download_url": "https://arxiv.org/abs/1801.07594v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Collapse-in and Collapse-out in Partial Measurement in Quantum Mechanics and its WISE Interpretation",
    "abstract": "In this short communication, I gave a generalization of measurement postulate in quantum mechanics. It is regarding the case with partial measurement, namely, measurement on only part of a wave function. Upon a partial measurement, the wavefunction will either collapse in one of the eigenstate covered by the measured partial wavefunction; or collapses out of the measured part and shifts to the unmeasured part. An explanation in the WISE (Wavefunction Is System Entity) interpretation is given.",
    "authors": [
      "Gui-Lu Long"
    ],
    "publication_date": "2021-05-23T01:38:55Z",
    "arxiv_id": "http://arxiv.org/abs/2106.00466v1",
    "download_url": "https://arxiv.org/abs/2106.00466v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum ontology de-naturalized: What we can't learn from quantum mechanics",
    "abstract": "Philosophers of science commonly connect ontology and science, stating that these disciplines maintain a two-way relationship: on the one hand, we can extract ontology from scientific theories; on the other hand, ontology provides the realistic content of our scientific theories. In this article, we will critically examine the process of naturalizing ontology, i.e., confining the work of ontologists merely to the task of pointing out which entities certain theories commit themselves to. We will use non-relativistic quantum mechanics as a case study. We begin by distinguishing two roles for ontology: the first would be characterized by cataloging existing entities according to quantum mechanics; the second would be characterized by establishing more general ontological categories in which existing entities must be classified. We argue that only the first step is available for a naturalistic approach; the second step not being open for determination or anchoring in science. Finally, we also argue that metaphysics is still a step beyond ontology, not contained in either of the two tasks of ontology, being thus even farther from science.",
    "authors": [
      "Raoni Arroyo",
      "Jonas R. Becker Arenhart"
    ],
    "publication_date": "2024-02-08T13:26:13Z",
    "arxiv_id": "http://arxiv.org/abs/2402.05661v1",
    "download_url": "https://arxiv.org/abs/2402.05661v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Alchemy and Universal Orthogonality Catastrophe in One-Dimensional Anyons",
    "abstract": "Many-particle quantum systems with intermediate anyonic exchange statistics are supported in one spatial dimension. In this context, the anyon-anyon mapping is recast as a continuous transformation that generates shifts of the statistical parameter $κ$. We characterize the geometry of quantum states associated with different values of $κ$, i.e., different quantum statistics. While states in the bosonic and fermionic subspaces are always orthogonal, overlaps between anyonic states are generally finite and exhibit a universal form of the orthogonality catastrophe governed by a fundamental statistical factor, independent of the microscopic Hamiltonian. We characterize this decay using quantum speed limits on the flow of $κ$, illustrate our results with a model of hard-core anyons, and discuss possible experiments in quantum simulation.",
    "authors": [
      "Naim E. Mackel",
      "Jing Yang",
      "Adolfo del Campo"
    ],
    "publication_date": "2022-10-19T17:59:59Z",
    "arxiv_id": "http://arxiv.org/abs/2210.10776v3",
    "download_url": "https://arxiv.org/abs/2210.10776v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relativistic Bohmian interpretation of quantum mechanics",
    "abstract": "I present a relativistic covariant version of the Bohmian interpretation of quantum mechanics and discuss the corresponding measurable predictions. The covariance is incoded in the fact that the nonlocal quantum potential transforms as a scalar, which is a consequence of the fact that the nonlocal wave function transforms as a scalar. The measurable predictions that can be obtained with the deterministic Bohmian interpretation cannot be obtained with the conventional interpretation simply because the conventional probabilistic interpretation does not work in the case of relativistic quantum mechanics.",
    "authors": [
      "H. Nikolic"
    ],
    "publication_date": "2005-12-08T14:43:42Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0512065v3",
    "download_url": "https://arxiv.org/abs/quant-ph/0512065v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Probability and Irreversibility in Modern Statistical Mechanics: Classical and Quantum",
    "abstract": "Through extended consideration of two wide classes of case studies -- dilute gases and linear systems -- I explore the ways in which assumptions of probability and irreversibility occur in contemporary statistical mechanics, where the latter is understood as primarily concerned with the derivation of quantitative higher-level equations of motion, and only derivatively with underpinning the equilibrium concept in thermodynamics. I argue that at least in this wide class of examples, (i) irreversibility is introduced through a reasonably well-defined initial-state condition which does not precisely map onto those in the extant philosophical literature; (ii) probability is explicitly required both in the foundations and in the predictions of the theory. I then consider the same examples, as well as the more general context, in the light of quantum mechanics, and demonstrate that while the analysis of irreversibility is largely unaffected by quantum considerations, the notion of statistical-mechanical probability is entirely reduced to quantum-mechanical probability.",
    "authors": [
      "David Wallace"
    ],
    "publication_date": "2021-04-22T17:58:41Z",
    "arxiv_id": "http://arxiv.org/abs/2104.11223v1",
    "download_url": "https://arxiv.org/abs/2104.11223v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Differential geometry of time-dependent $\\mathcal{PT}$-symmetric quantum mechanics",
    "abstract": "Time-dependent $\\mathcal{PT}$-symmetric quantum mechanics is featured by a varying inner-product metric and has stimulated a number of interesting studies beyond conventional quantum mechanics. In this paper, we explore geometric aspects of time-dependent $\\mathcal{PT}$-symmetric quantum mechanics. We not only find a geometric phase factor emerging naturally from cyclic evolutions of $\\mathcal{PT}$-symmetric systems, but also formulate a series of differential geometry concepts, including connection, curvature, parallel transport, metric tensor, and quantum geometric tensor. Our findings constitute a useful, perhaps indispensible, tool to tackle physical problems involving $\\mathcal{PT}$-symmetric systems with time-varying system's parameters. To exemplify the application of our findings, we show that the unconventional geometrical phase [Phys. Rev. Lett. 91, 187902 (2003)], consisting of a geometric phase and a dynamical phase proportional to the geometric phase, can be expressed as a single geometric phase identified in this work.",
    "authors": [
      "Da-Jian Zhang",
      "Qing-hai Wang",
      "Jiangbin Gong"
    ],
    "publication_date": "2018-11-12T10:30:28Z",
    "arxiv_id": "http://arxiv.org/abs/1811.04640v1",
    "download_url": "https://arxiv.org/abs/1811.04640v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics of Quantum Causal Models: An Inclusive, Hamiltonian Approach",
    "abstract": "Operational quantum stochastic thermodynamics is a recently proposed theory to study the thermodynamics of open systems based on the rigorous notion of a quantum stochastic process or quantum causal model. In there, a stochastic trajectory is defined solely in terms of experimentally accessible measurement results, which serve as the basis to define the corresponding thermodynamic quantities. In contrast to this observer-dependent point of view, a `black box', which evolves unitarily and can simulate a quantum causal model, is constructed here. The quantum thermodynamics of this big isolated system can then be studied using widely accepted arguments from statistical mechanics. It is shown that the resulting definitions of internal energy, heat, work, and entropy have a natural extension to the trajectory level. The canonical choice of them coincides with the proclaimed definitions of operational quantum stochastic thermodynamics, thereby providing strong support in favour of that novel framework. However, a few remaining ambiguities in the definition of stochastic work and heat are also discovered and in light of these findings some other proposals are reconsidered. Finally, it is demonstrated that the first and second law hold for an even wider range of scenarios than previously thought, covering a large class of quantum causal models based solely on a single assumption about the initial system-bath state.",
    "authors": [
      "Philipp Strasberg"
    ],
    "publication_date": "2019-11-05T11:45:23Z",
    "arxiv_id": "http://arxiv.org/abs/1911.01730v3",
    "download_url": "https://arxiv.org/abs/1911.01730v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Can PT-Symmetric Quantum Mechanics be a Viable Alternative Quantum Theory?",
    "abstract": "Update: A time-independent $n\\times n$ PT-symmetric (and symmetric) Hamiltonian is diagonalizable since it has all distinct real eigenvalues and the resulting diagonal matrix is a real symmetric matrix. The diagonalization results an isometry so there shouldn't be any issue with unitarity and unfortunately this very elementary mathematical fact somehow did not draw the authors' attention. However, PT-symmetric quantum mechanics is not out of trouble. For time-dependent PT-symmetric (and symmetric) Hamiltonians (even $2\\times 2$ ones) the authors observed that there is a violation of unitarity. Moreover, the first named author showed in his recent article arXiv:1312.7738 that PT-symmetric quantum mechanics is indeed a certain kind of Hermitian quantum mechanics and that in order for time-evolution to be unitary with respect to $J$-inner product (one that gives rise to a Hilbert space structure on the space of state functions), the potential energy operator $V(x)$ must be real. This means that those complex PT-symmetric Hamiltonians that have been studied by physicists are unfortunately unphysical. The first named author discussed in a subsequent article arXiv:1401.5149 that while finite-state PT-symmetric quantum mechanics with time-independent Hamiltonians is not physically any different from Hermitian quantum mechanics, PT-symmetric quantum mechanics exhibits a distinctive symmetry from that of Hermitian quantum mechanics.",
    "authors": [
      "Sungwook Lee",
      "Lawrence R. Mead"
    ],
    "publication_date": "2013-03-25T22:39:55Z",
    "arxiv_id": "http://arxiv.org/abs/1303.6339v3",
    "download_url": "https://arxiv.org/abs/1303.6339v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The group structure of dynamical transformations between quantum reference frames",
    "abstract": "Recently, it was shown that when reference frames are associated to quantum systems, the transformation laws between such quantum reference frames need to be modified to take into account the quantum and dynamical features of the reference frames. This led to a relational description of the phase space variables of the quantum system of which the quantum reference frames are part of. While such transformations were shown to be symmetries of the system's Hamiltonian, the question remained unanswered as to whether they enjoy a group structure, similar to that of the Galilei group relating classical reference frames in quantum mechanics. In this work, we identify the canonical transformations on the phase space of the quantum systems comprising the quantum reference frames, and show that these transformations close a group structure defined by a Lie algebra, which is different from the usual Galilei algebra of quantum mechanics. We further find that the elements of this new algebra are in fact the building blocks of the quantum reference frames transformations previously identified, which we recover. Finally, we show how the transformations between classical reference frames described by the standard Galilei group symmetries can be obtained from the group of transformations between quantum reference frames by taking the zero limit of the parameter that governs the additional noncommutativity introduced by the quantum nature of inertial transformations.",
    "authors": [
      "Angel Ballesteros",
      "Flaminia Giacomini",
      "Giulia Gubitosi"
    ],
    "publication_date": "2020-12-31T17:42:13Z",
    "arxiv_id": "http://arxiv.org/abs/2012.15769v2",
    "download_url": "https://arxiv.org/abs/2012.15769v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The construction of quantum mechanics from electromagnetism. Part II: the Hydrogen atom",
    "abstract": "In Part I we constructed the Quantum Mechanics of a charged unitary entity and prescribed the form in which such a particle interacts with other charged particles and matter in general. In this second part we extend the description to the hydrogen atom testing the correctness and accuracy of the general description. The relation between electron and proton in the atom is described systematically in a construction that is free from analogies or ad-hoc derivations and it supersedes conventional Quantum Mechanics (whose equations linked to measurements can be recovered). We briefly discuss why the concept of isolation built in Schrödinger's time evolution is not acceptable and how it immediately results in the well known measurement paradoxes of quantum mechanics. We also discuss the epistemic grounds of the development as well as those of conventional Quantum Mechanics.",
    "authors": [
      "Hernán Gustavo Solari",
      "Mario Alberto Natiello"
    ],
    "publication_date": "2024-11-14T13:08:44Z",
    "arxiv_id": "http://arxiv.org/abs/2412.06790v2",
    "download_url": "https://arxiv.org/abs/2412.06790v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Bethe Ansatz as a Quantum Circuit",
    "abstract": "The Bethe ansatz represents an analytical method enabling the exact solution of numerous models in condensed matter physics and statistical mechanics. When a global symmetry is present, the trial wavefunctions of the Bethe ansatz consist of plane wave superpositions. Previously, it has been shown that the Bethe ansatz can be recast as a deterministic quantum circuit. An analytical derivation of the quantum gates that form the circuit was lacking however. Here we present a comprehensive study of the transformation that brings the Bethe ansatz into a quantum circuit, which leads us to determine the analytical expression of the circuit gates. As a crucial step of the derivation, we present a simple set of diagrammatic rules that define a novel Matrix Product State network building Bethe wavefunctions. Remarkably, this provides a new perspective on the equivalence between the coordinate and algebraic versions of the Bethe ansatz.",
    "authors": [
      "Roberto Ruiz",
      "Alejandro Sopena",
      "Max Hunter Gordon",
      "Germán Sierra",
      "Esperanza López"
    ],
    "publication_date": "2023-09-25T18:00:06Z",
    "arxiv_id": "http://arxiv.org/abs/2309.14430v2",
    "download_url": "https://arxiv.org/abs/2309.14430v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Particle Path Formulation of Quantum Mechanics",
    "abstract": "An extension of the classical action principle obtained in the framework of the gauge transformations, is used to describe the motion of a particle. This extension assigns many, but not all, paths to a particle. Properties of the particle paths are shown to impart wave like behaviour to a particle in motion and to imply various other assumptions and conjectures attributed to the formalism of Quantum Mechanics. The Klein-Gordon and other similar equations are derived by incorporating these properties in the path-integral formalism.",
    "authors": [
      "S. R. Vatsya"
    ],
    "publication_date": "1996-01-03T20:24:29Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9601003v1",
    "download_url": "https://arxiv.org/abs/quant-ph/9601003v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complexity of operators generated by quantum mechanical Hamiltonians",
    "abstract": "We propose how to compute the complexity of operators generated by Hamiltonians in quantum field theory (QFT) and quantum mechanics (QM). The Hamiltonians in QFT/QM and quantum circuit have a few essential differences, for which we introduce new principles and methods for complexity. We show that the complexity geometry corresponding to one-dimensional quadratic Hamiltonians is equivalent to AdS$_3$ spacetime. Here, the requirement that the complexity is nonnegative corresponds to the fact that the Hamiltonian is lower bounded and the speed of a particle is not superluminal. Our proposal proves the complexity of the operator generated by a free Hamiltonian is zero, as expected. By studying a non-relativistic particle in compact Riemannian manifolds we find the complexity is given by the global geometric property of the space. In particular, we show that in low energy limit the critical spacetime dimension to ensure the \"nonnegative\" complexity is the 3+1 dimension.",
    "authors": [
      "Run-Qiu Yang",
      "Keun-Young Kim"
    ],
    "publication_date": "2018-10-22T17:06:07Z",
    "arxiv_id": "http://arxiv.org/abs/1810.09405v2",
    "download_url": "https://arxiv.org/abs/1810.09405v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A model of quantum spacetime",
    "abstract": "We consider a global quantum system (the \"Universe\") satisfying a double constraint, both on total energy and total momentum. Generalizing the Page and Wootters quantum clock formalism, we provide a model of 3+1 dimensional, non-relativistic, quantum spacetime emerging from entanglement among different subsystems in a globally \"timeless\" and \"positionless\" Universe.",
    "authors": [
      "Tommaso Favalli",
      "Augusto Smerzi"
    ],
    "publication_date": "2022-07-03T10:40:45Z",
    "arxiv_id": "http://arxiv.org/abs/2207.01005v3",
    "download_url": "https://arxiv.org/abs/2207.01005v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Pondicherry interpretation of quantum mechanics",
    "abstract": "This article presents a novel interpretation of quantum mechanics. It extends the meaning of ``measurement'' to include all property-indicating facts. Intrinsically space is undifferentiated: there are no points on which a world of locally instantiated physical properties could be built. Instead, reality is built on facts, in the sense that the properties of things are extrinsic, or supervenient on property-indicating facts. The actual extent to which the world is spatially and temporally differentiated (that is, the extent to which spatiotemporal relations and distinctions are warranted by the facts) is necessarily limited. Notwithstanding that the state vector does nothing but assign probabilities, quantum mechanics affords a complete understanding of the actual world. If there is anything that is incomplete, it is the actual world, but its incompleteness exists only in relation to a conceptual framework that is more detailed than the actual world. Two deep-seated misconceptions are responsible for the interpretational difficulties associated with quantum mechanics: the notion that the spatial and temporal aspects of the world are adequately represented by sets with the cardinality of the real numbers, and the notion of an instantaneous state that evolves in time. The latter is an unwarranted (in fact, incoherent) projection of our apparent ``motion in time'' into the world of physics. Equally unwarranted, at bottom, is the use of causal concepts. There nevertheless exists a ``classical'' domain in which language suggestive of nomological necessity may be used. Quantum mechanics not only is strictly consistent with the existence of this domain but also presupposes it in several ways.",
    "authors": [
      "Ulrich Mohrhoff"
    ],
    "publication_date": "1999-03-15T03:06:42Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9903051v3",
    "download_url": "https://arxiv.org/abs/quant-ph/9903051v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Decomposable coherence and quantum fluctuation relations",
    "abstract": "In Newtonian mechanics, any closed-system dynamics of a composite system in a microstate will leave all its individual subsystems in distinct microstates, however this fails dramatically in quantum mechanics due to the existence of quantum entanglement. Here we introduce the notion of a `coherent work process', and show that it is the direct extension of a work process in classical mechanics into quantum theory. This leads to the notion of `decomposable' and `non-decomposable' quantum coherence and gives a new perspective on recent results in the theory of asymmetry as well as early analysis in the theory of classical random variables. Within the context of recent fluctuation relations, originally framed in terms of quantum channels, we show that coherent work processes play the same role as their classical counterparts, and so provide a simple physical primitive for quantum coherence in such systems. We also introduce a pure state effective potential as a tool with which to analyze the coherent component of these fluctuation relations, and which leads to a notion of temperature-dependent mean coherence, provides connections with multi-partite entanglement, and gives a hierarchy of quantum corrections to the classical Crooks relation in powers of inverse temperature.",
    "authors": [
      "Erick Hinds Mingo",
      "David Jennings"
    ],
    "publication_date": "2018-12-19T18:52:58Z",
    "arxiv_id": "http://arxiv.org/abs/1812.08159v3",
    "download_url": "https://arxiv.org/abs/1812.08159v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symmetry as a foundational concept in Quantum Mechanics",
    "abstract": "Symmetries are widely used in modeling quantum systems but they do not contribute in postulates of quantum mechanics. Here we argue that logical, mathematical, and observational evidence require that symmetry should be considered as a fundamental concept in the construction of physical systems. Based on this idea, we propose a series of postulates for describing quantum systems, and establish their relation and correspondence with axioms of standard quantum mechanics. Through some examples we show that this reformulation helps better understand some of ambiguities of standard description. Nonetheless its application is not limited to explaining confusing concept and it may be a necessary step toward a consistent model of quantum cosmology and gravity.",
    "authors": [
      "Houri Ziaeepour"
    ],
    "publication_date": "2015-02-15T12:51:22Z",
    "arxiv_id": "http://arxiv.org/abs/1502.05339v1",
    "download_url": "https://arxiv.org/abs/1502.05339v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanics and consciousness: fact and fiction",
    "abstract": "This article was written in response to a request from an editor of American Vedantist. It is shown that the idea that consciousness is essential to understanding quantum mechanics arises from logical fallacies. This may be welcome news to those who share the author's annoyance at consciousness being dragged into discussions of physics, but beware: The same fallacies may underlie the reader's own way of making sense of quantum mechanics. The article ends up embracing a Vedantic world view, for two reasons. For one, such a world view seems to the author to be the most sensible alternative to a materialistic one. For another, quantum mechanics is inconsistent with a materialistic world view but makes perfect sense within a Vedantic framework of thought.",
    "authors": [
      "Ulrich Mohrhoff"
    ],
    "publication_date": "2001-02-09T04:45:11Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0102047v2",
    "download_url": "https://arxiv.org/abs/quant-ph/0102047v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum States of Fields for Quantum Split Sources",
    "abstract": "Field mediated entanglement experiments probe the quantum superposition of macroscopically distinct field configurations. We show that this phenomenon can be described by using a transparent quantum field theoretical formulation of electromagnetism and gravity in the field basis. The strength of such a description is that it explicitly displays the superposition of macroscopically distinct states of the field. In the case of (linearised) quantum general relativity, this formulation exhibits the quantum superposition of geometries giving rise to the effect.",
    "authors": [
      "Lin-Qing Chen",
      "Flaminia Giacomini",
      "Carlo Rovelli"
    ],
    "publication_date": "2022-07-21T16:33:11Z",
    "arxiv_id": "http://arxiv.org/abs/2207.10592v2",
    "download_url": "https://arxiv.org/abs/2207.10592v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Universal Two--Bit Gate for Quantum Computation",
    "abstract": "We prove the existence of a class of two--input, two--output gates any one of which is universal for quantum computation. This is done by explicitly constructing the three--bit gate introduced by Deutsch [Proc.~R.~Soc.~London.~A {\\bf 425}, 73 (1989)] as a network consisting of replicas of a single two--bit gate.",
    "authors": [
      "A. Barenco"
    ],
    "publication_date": "1995-05-24T13:38:19Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9505016v1",
    "download_url": "https://arxiv.org/abs/quant-ph/9505016v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring the Quantum Speed Limit with Computer Games",
    "abstract": "Humans routinely solve problems of immense computational complexity by intuitively forming simple, low-dimensional heuristic strategies. Citizen science exploits this ability by presenting scientific research problems to non-experts. Gamification is an effective tool for attracting citizen scientists to provide solutions to research problems. While citizen science games Foldit, EteRNA and EyeWire have been used successfully to study protein and RNA folding and neuron mapping, so far gamification has not been applied to problems in quantum physics. Does the fact that everyday experiences are based on classical physics hinder the use of non-expert citizen scientists in the realm of quantum mechanics? Here we report on Quantum Moves, an online platform gamifying optimization problems in quantum physics. We show that human players are able to find solutions to difficult problems associated with the task of quantum computing. Players succeed where purely numerical optimization fails, and analyses of their solutions provide insights into the problem of optimization of a more profound and general nature. Based on player strategies, we have thus developed a new, few-parameter heuristic optimization method which efficiently outperforms the most prominent established numerical methods. The numerical complexity associated with time-optimal solutions increases for shorter process durations. To better understand this, we have made a low-dimensional rendering of the optimization landscape. These studies show why traditional optimization methods fail near the quantum speed limit, and they bring promise that combined analyses of optimization landscapes and heuristic solution strategies may benefit wider classes of optimization problems in quantum physics and beyond.",
    "authors": [
      "Jens Jakob W. H. Sørensen",
      "Mads Kock Pedersen",
      "Michael Munch",
      "Pinja Haikka",
      "Jesper Halkjær Jensen",
      "Tilo Planke",
      "Morten Ginnerup Andreasen",
      "Miroslav Gajdacz",
      "Klaus Mølmer",
      "Andreas Lieberoth",
      "Jacob F. Sherson",
      "Quantum Moves players"
    ],
    "publication_date": "2015-06-26T09:17:57Z",
    "arxiv_id": "http://arxiv.org/abs/1506.09091v3",
    "download_url": "https://arxiv.org/abs/1506.09091v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spacetime Quantum Reference Frames and superpositions of proper times",
    "abstract": "In general relativity, the description of spacetime relies on idealised rods and clocks, which identify a reference frame. In any concrete scenario, reference frames are associated to physical systems, which are ultimately quantum in nature. A relativistic description of the laws of physics hence needs to take into account such quantum reference frames (QRFs), through which spacetime can be given an operational meaning. Here, we introduce the notion of a spacetime QRF, associated to a quantum particle in spacetime. Such formulation has the advantage of treating space and time on equal footing, and of describing the dynamical evolution of a set of quantum systems from the perspective of another quantum system, where the evolution parameter coincides with the proper time of the particle taken as the QRF. Crucially, the proper times in two different QRFs are not related by a standard transformation, but they might be in a quantum superposition. Concretely, we consider N relativistic quantum particles in a weak gravitational field and introduce a timeless formulation in which the global state of the N particles appears \"frozen\", but the dynamical evolution is recovered in terms of relational quantities. The position and momentum Hilbert space of the particles is used to fix the QRF via a transformation to the local frame of the particle such that the metric is locally inertial at the origin of the QRF. The internal Hilbert space corresponds to the clock space, keeping the proper time in the local frame of the particle. This fully relational construction shows how the remaining particles evolve from the perspective of the QRF and includes the Page-Wootters mechanism for non interacting clocks when the external degrees of freedom are neglected. Finally, we observe a quantum superposition of gravitational redshifts and a quantum superposition of special-relativistic time dilations in the QRF.",
    "authors": [
      "Flaminia Giacomini"
    ],
    "publication_date": "2021-01-27T19:00:04Z",
    "arxiv_id": "http://arxiv.org/abs/2101.11628v2",
    "download_url": "https://arxiv.org/abs/2101.11628v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Equivalence principle, quantum mechanics, and atom-interferometric tests",
    "abstract": "That gravitation can be understood as purely metric phenomenon depends crucially on the validity of a number of hypotheses which are summarised by the Einstein Equivalence Principle, the least well tested part of which being the Universality of Gravitational Redshift. A recent and currently widely debated proposal (Nature 463 (2010) 926-929) to re-interpret some 10-year old experiments in atom interferometry would imply, if tenable, substantial reductions on upper bounds for possible violations of the Universality of Gravitational Redshift by four orders of magnitude. This interpretation, however, is problematic and raises various compatibility issues concerning basic principles of General Relativity and Quantum Mechanics. I review some relevant aspects of the equivalence principle and its import into quantum mechanics, and then turn to the problems raised by the mentioned proposal. I conclude that this proposal is too problematic to warrant the claims that were launched with it.",
    "authors": [
      "Domenico Giulini"
    ],
    "publication_date": "2011-05-04T07:56:53Z",
    "arxiv_id": "http://arxiv.org/abs/1105.0749v2",
    "download_url": "https://arxiv.org/abs/1105.0749v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum conformal symmetries for spacetimes in superposition",
    "abstract": "Without a complete theory of quantum gravity, the question of how quantum fields and quantum particles behave in a superposition of spacetimes seems beyond the reach of theoretical and experimental investigations. Here we use an extension of the quantum reference frame formalism to address this question for the Klein-Gordon field residing on a superposition of conformally equivalent metrics. Based on the group structure of ``quantum conformal transformations'', we construct an explicit quantum operator that can map states describing a quantum field on a superposition of spacetimes to states representing a quantum field with a superposition of masses on a Minkowski background. This constitutes an extended symmetry principle, namely invariance under quantum conformal transformations. The latter allows to build an understanding of superpositions of diffeomorphically non-equivalent spacetimes by relating them to a more intuitive superposition of quantum fields on curved spacetime. Furthermore, it can be used to import the phenomenon of particle production in curved spacetime to its conformally equivalent counterpart, thus revealing new features in modified Minkowski spacetime.",
    "authors": [
      "Viktoria Kabel",
      "Anne-Catherine de la Hamette",
      "Esteban Castro-Ruiz",
      "Časlav Brukner"
    ],
    "publication_date": "2022-06-30T18:00:02Z",
    "arxiv_id": "http://arxiv.org/abs/2207.00021v3",
    "download_url": "https://arxiv.org/abs/2207.00021v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classical (ontological) dual states in quantum theory and the minimal group representation Hilbert space",
    "abstract": "We investigate the classical aspects of Quantum theory and under which description Quantum theory does appear Classical. Although such descriptions or variables are known as \"ontological\" or \"hidden\", they are not hidden at all, but are dual classical states (in the sense of the general classical-quantum duality of Nature). The application of the Minimal Group Representation immediately classicalizes the system, Mp(2) emerging as the group of the classical-quantum duality symmetry. (Abridged)",
    "authors": [
      "Diego J. Cirilo-Lombardo",
      "Norma G. Sanchez"
    ],
    "publication_date": "2025-01-19T17:26:28Z",
    "arxiv_id": "http://arxiv.org/abs/2501.11119v1",
    "download_url": "https://arxiv.org/abs/2501.11119v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Observations in Quantum Cosmology",
    "abstract": "In this review, we focus on whether a canonical quantization of general relativity can produce testable predictions for cosmology. In particular, we examine how this approach can be used to model the evolution of primordial perturbations. This program of quantum geometrodynamics, first advocated by John Wheeler and Bryce DeWitt, has a straightforward classical limit, and it describes the quantum dynamics of all fields, gravitational and matter. In this context, in which a classical background metric is absent, it is necessary to discuss what constitutes an observation. We first address this issue in the classical theory and then turn to the quantum theory. We argue that predictions are relational, that is, relative to physical clocks and rods, and that they can be straightforwardly obtained in a perturbative approach with respect to Newton's constant, which serves as a coupling parameter. This weak-coupling expansion leads to a perturbative Hilbert space for quantum cosmology, and to corrections to the dynamics of quantum fields on a classical, fixed background metric. These corrections imply modifications of primordial power spectra, which may lead to signatures in the anisotropy spectrum of the Cosmic Microwave Background (CMB) radiation, for which we discuss concrete results. We conclude that the subject of quantum geometrodynamics, the oldest and most conservative approach to canonical quantum gravity, not only illuminates conceptual issues in quantum gravitation, but may also lead to observational prospects in cosmology and elsewhere.",
    "authors": [
      "Leonardo Chataignier",
      "Claus Kiefer",
      "Paulo Moniz"
    ],
    "publication_date": "2023-06-26T18:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/2306.14948v2",
    "download_url": "https://arxiv.org/abs/2306.14948v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The double well potential in quantum mechanics: a simple, numerically exact formulation",
    "abstract": "The double well potential is arguably one of the most important potentials in quantum mechanics, because the solution contains the notion of a state as a linear superposition of `classical' states, a concept which has become very important in quantum information theory. It is therefore desirable to have solutions to simple double well potentials that are accessible to the undergraduate student. We describe a method for obtaining the numerically exact eigenenergies and eigenstates for such a model, along with the energies obtained through the Wentzel-Kramers-Brillouin (WKB) approximation. The exact solution is accessible with elementary mathematics, though numerical solutions are required. We also find that the WKB approximation is remarkably accurate, not just for the ground state, but for the excited states as well.",
    "authors": [
      "V. Jelic",
      "F. Marsiglio"
    ],
    "publication_date": "2012-09-12T08:44:00Z",
    "arxiv_id": "http://arxiv.org/abs/1209.2521v1",
    "download_url": "https://arxiv.org/abs/1209.2521v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum networks theory",
    "abstract": "The formalism of quantum theory over discrete systems is extended in two significant ways. First, quantum evolutions are generalized to act over entire network configurations, so that nodes may find themselves in a quantum superposition of being connected or not, and be allowed to merge, split and reconnect coherently in a superposition. Second, tensors and traceouts are generalized, so that systems can be partitioned according to almost arbitrary logical predicates in a robust manner. The hereby presented mathematical framework is anchored on solid grounds through numerous lemmas. Indeed, one might have feared that the familiar interrelations between the notions of unitarity, complete positivity, trace-preservation, non-signalling causality, locality and localizability that are standard in quantum theory be jeopardized as the neighbourhood and partitioning between systems become both quantum, dynamical, and logical. Such interrelations in fact carry through, albeit two new notions become instrumental: consistency and comprehension.",
    "authors": [
      "Pablo Arrighi",
      "Amélia Durbec",
      "Matt Wilson"
    ],
    "publication_date": "2021-10-20T14:29:47Z",
    "arxiv_id": "http://arxiv.org/abs/2110.10587v3",
    "download_url": "https://arxiv.org/abs/2110.10587v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum mechanics as a consistency condition on initial and final boundary conditions",
    "abstract": "If the block universe view is correct, the future and the past have similar status and one would expect physical theories to involve final as well as initial boundary conditions. A plausible consistency condition between the initial and final boundary conditions in non-relativistic quantum mechanics leads to the idea that the properties of macroscopic quantum systems, relevantly measuring instruments, are uniquely determined by the boundary conditions. An important element in reaching that conclusion is that preparations and measurements belong in a special class because they involve many subsystems, at least some of which do not form superpositions of their physical properties before the boundary conditions are imposed. It is suggested that the primary role of the formalism of standard quantum mechanics is to provide the consistency condition on the boundary conditions rather than the properties of quantum systems. Expressions are proposed for assigning a set of (unmeasured) physical properties to a quantum system at all times. The physical properties avoid the logical inconsistencies implied by the no-go theorems because they are assigned differently from standard quantum mechanics. Since measurement outcomes are determined by the boundary conditions, they help determine, rather than are determined by, the physical properties of quantum systems.",
    "authors": [
      "D. J. Miller"
    ],
    "publication_date": "2006-07-25T01:57:27Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0607169v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0607169v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Testing axioms for Quantum Mechanics on Probabilistic toy-theories",
    "abstract": "In Ref. [1] one of the authors proposed postulates for axiomatizing Quantum Mechanics as a \"fair operational framework\", namely regarding the theory as a set of rules that allow the experimenter to predict future events on the basis of suitable tests, having local control and low experimental complexity. In addition to causality, the following postulates have been considered: PFAITH (existence of a pure preparationally faithful state), and FAITHE (existence of a faithful effect). These postulates have exhibited an unexpected theoretical power, excluding all known nonquantum probabilistic theories. Later in Ref. [2] in addition to causality and PFAITH, postulate LDISCR (local discriminability) and PURIFY (purifiability of all states) have been considered, narrowing the probabilistic theory to something very close to Quantum Mechanics. In the present paper we test the above postulates on some nonquantum probabilistic models. The first model, \"the two-box world\" is an extension of the Popescu-Rohrlich model, which achieves the greatest violation of the CHSH inequality compatible with the no-signaling principle. The second model \"the two-clock world\" is actually a full class of models, all having a disk as convex set of states for the local system. One of them corresponds to the \"the two-rebit world\", namely qubits with real Hilbert space. The third model--\"the spin-factor\"--is a sort of n-dimensional generalization of the clock. Finally the last model is \"the classical probabilistic theory\". We see how each model violates some of the proposed postulates, when and how teleportation can be achieved, and we analyze other interesting connections between these postulate violations, along with deep relations between the local and the non-local structures of the probabilistic theory.",
    "authors": [
      "Giacomo Mauro D'Ariano",
      "Alessandro Tosini"
    ],
    "publication_date": "2009-11-29T18:34:56Z",
    "arxiv_id": "http://arxiv.org/abs/0911.5409v2",
    "download_url": "https://arxiv.org/abs/0911.5409v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards a measurement theory in QFT: \"Impossible\" quantum measurements are possible but not ideal",
    "abstract": "Naive attempts to put together relativity and quantum measurements lead to signaling between space-like separated regions. In QFT, these are known as impossible measurements. We show that the same problem arises in non-relativistic quantum physics, where joint nonlocal measurements (i.e., between systems kept spatially separated) in general lead to signaling, while one would expect no-signaling (based for instance on the principle of no-nonphysical communication). This raises the question: Which nonlocal quantum measurements are physically possible? We review and develop further a non-relativistic quantum information approach developed independently of the impossible measurements in QFT, and show that these two have been addressing virtually the same problem. The non-relativistic solution shows that all nonlocal measurements are localizable (i.e., they can be carried out at a distance without violating no-signaling) but they (i) may require arbitrarily large entangled resources and (ii) cannot in general be ideal, i.e., are not immediately reproducible. These considerations could help guide the development of a complete theory of measurement in QFT.",
    "authors": [
      "Nicolas Gisin",
      "Flavio Del Santo"
    ],
    "publication_date": "2023-11-22T19:00:16Z",
    "arxiv_id": "http://arxiv.org/abs/2311.13644v2",
    "download_url": "https://arxiv.org/abs/2311.13644v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Monitoring Quantum Simulators via Quantum Non-Demolition Couplings to Atomic Clock Qubits",
    "abstract": "We discuss monitoring the time evolution of an analog quantum simulator via a quantum non-demolition (QND) coupling to an auxiliary `clock' qubit. The QND variable of interest is the `energy' of the quantum many-body system, represented by the Hamiltonian of the quantum simulator. We describe a physical implementation of the underlying QND Hamiltonian for Rydberg atoms trapped in tweezer arrays using laser dressing schemes for a broad class of spin models. As an application, we discuss a quantum protocol for measuring the spectral form factor of quantum many-body systems, where the aim is to identify signatures of ergodic vs. non-ergodic dynamics, which we illustrate for disordered 1D Heisenberg and Floquet spin models on Rydberg platforms. Our results also provide the physical ingredients for running quantum phase estimation protocols for measurement of energies, and preparation of energy eigenstates for a specified spectral resolution on an analog quantum simulator.",
    "authors": [
      "Denis V. Vasilyev",
      "Andrey Grankin",
      "Mikhail A. Baranov",
      "Lukas M. Sieberer",
      "Peter Zoller"
    ],
    "publication_date": "2020-05-30T08:02:12Z",
    "arxiv_id": "http://arxiv.org/abs/2006.00214v2",
    "download_url": "https://arxiv.org/abs/2006.00214v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Kinetic and electrostatic energies in quantum mechanics",
    "abstract": "A concept of kinetic energy in quantum mechanics is analyzed. Kinetic energy is a non-zero positive value in many cases of bound states, when a wave function is a real-valued one and there are no visible motion and flux. This can be understood, using expansion of the wave function into Fourier integral, that is, on the basis of virtual plane waves. The ground state energy of a hydrogen atom is calculated in a special way, regarding explicitly all the terms of electrostatic and kinetic energies. The correct values of the ground state energy and the radius of decay are achieved only when the electrostatic energies of the electron and the proton (self-energies) are not taken into account. This proves again that self-action should be excluded in quantum mechanics. A model of a spherical ball with uniformly distributed charge of particles is considered. It is shown that for a neutral ball (with compensated electric charge) the electrostatic energy is a non-zero negative value in this model. This occurs because the self-energy of the constituting particles should be subtracted. So it shown that the energy of the electric field does not have to be of a positive value in any imaginable problem.",
    "authors": [
      "Yuri Kornyushin"
    ],
    "publication_date": "2008-06-24T07:19:19Z",
    "arxiv_id": "http://arxiv.org/abs/0806.3828v5",
    "download_url": "https://arxiv.org/abs/0806.3828v5",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universality in Quantum Computation",
    "abstract": "We show that in quantum computation almost every gate that operates on two or more bits is a universal gate. We discuss various physical considerations bearing on the proper definition of universality for computational components such as logic gates.",
    "authors": [
      "D. Deutsch",
      "A. Barenco",
      "A. Ekert"
    ],
    "publication_date": "1995-05-24T16:27:15Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9505018v1",
    "download_url": "https://arxiv.org/abs/quant-ph/9505018v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuous variable methods in relativistic quantum information: Characterisation of quantum and classical correlations of scalar field modes in noninertial frames",
    "abstract": "We review a recently introduced unified approach to the analytical quantification of correlations in Gaussian states of bosonic scalar fields by means of Renyi-2 entropy. This allows us to obtain handy formulae for classical, quantum, total correlations, as well as bipartite and multipartite entanglement. We apply our techniques to the study of correlations between two modes of a scalar field as described by observers in different states of motion. When one or both observers are in uniform acceleration, the quantum and classical correlations are degraded differently by the Unruh effect, depending on which mode is detected. Residual quantum correlations, in the form of quantum discord without entanglement, may survive in the limit of an infinitely accelerated observer Rob, provided they are revealed in a measurement performed by the inertial Alice.",
    "authors": [
      "Gerardo Adesso",
      "Sammy Ragy",
      "Davide Girolami"
    ],
    "publication_date": "2012-05-01T17:27:22Z",
    "arxiv_id": "http://arxiv.org/abs/1205.0222v2",
    "download_url": "https://arxiv.org/abs/1205.0222v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Duplex numbers, diffusion systems, and generalized quantum mechanics",
    "abstract": "We show that the relation between the Schrödinger equation and diffusion processes has an algebraic nature and can be revealed via the structure of \"duplex numbers.\" This helps one to clarify that quantum mechanics cannot be reduced to diffusion theory. Also, a generalized version of quantum mechanics where $\\C$ is replaced by a normed algebra with a unit is proposed.",
    "authors": [
      "Jerzy Kocik"
    ],
    "publication_date": "2012-01-15T08:52:41Z",
    "arxiv_id": "http://arxiv.org/abs/1201.3069v1",
    "download_url": "https://arxiv.org/abs/1201.3069v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Emergent quantum mechanics without wave functions",
    "abstract": "We present our model of an Emergent Quantum Mechanics which can be characterized by \"realism without pre-determination\". This is illustrated by our analytic description and corresponding computer simulations of Bohmian-like \"surreal\" trajectories, which are obtained classically, i.e. without the use of any quantum mechanical tool such as wave functions. However, these trajectories do not necessarily represent ontological paths of particles but rather mappings of the probability density flux in a hydrodynamical sense. Modelling emergent quantum mechanics in a high-low intesity double slit scenario gives rise to the \"quantum sweeper effect\" with a characteristic intensity pattern. This phenomenon should be experimentally testable via weak measurement techniques.",
    "authors": [
      "Johannes Mesa Pascasio",
      "Siegfried Fussy",
      "Herbert Schwabl",
      "Gerhard Groessing"
    ],
    "publication_date": "2016-02-16T07:45:28Z",
    "arxiv_id": "http://arxiv.org/abs/1602.04932v1",
    "download_url": "https://arxiv.org/abs/1602.04932v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Adiabatic quantum trajectories in engineered reservoirs",
    "abstract": "We analyze the efficiency of protocols for adiabatic quantum state transfer assisted by an engineered reservoir. The target dynamics is a quantum trajectory in the Hilbert space and is a fixed point of a time-dependent master equation in the limit of adiabatic dynamics. We specialize to quantum state transfer in a qubit and determine the optimal schedule for a class of time-dependent Lindblad equations. The speed limit on state transfer is extracted from a physical model of a qubit coupled to a reservoir, from which the Lindblad equation is derived in the Born-Markov limit. Our analysis shows that the resulting efficiency is comparable to the efficiency of the optimal unitary dynamics. Numerical studies indicate that reservoir-engineered protocols could outperform unitary protocols outside the regime of the Born-Markov master equation, namely, when correlations between the qubit and reservoir become relevant. Our study contributes to the theory of shortcuts to adiabaticity for open quantum systems and to the toolbox of protocols of the NISQ era.",
    "authors": [
      "Emma C. King",
      "Luigi Giannelli",
      "Raphaël Menu",
      "Johannes N. Kriel",
      "Giovanna Morigi"
    ],
    "publication_date": "2023-11-20T17:21:36Z",
    "arxiv_id": "http://arxiv.org/abs/2311.11937v2",
    "download_url": "https://arxiv.org/abs/2311.11937v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effects of entanglement on vortex dynamics in the hydrodynamic representation of quantum mechanics",
    "abstract": "The hydrodynamic representation of quantum mechanics describes virtual flow as if a quantum system were fluid in motion. This formulation illustrates pointlike vortices when the phase of a wavefunction becomes nonintegrable at nodal points. We study the dynamics of such pointlike vortices in the hydrodynamic representation for a two-particle wavefunction. In particular, we discuss how quantum entanglement influences vortex-vortex dynamics. For this purpose, we employ the time-dependent quantum variational principle combined with the Rayleigh-Ritz method. We analyze the vortex dynamics and establish connections with Dirac's generalized Hamiltonian formalism.",
    "authors": [
      "Satoya Imai"
    ],
    "publication_date": "2019-02-22T08:44:46Z",
    "arxiv_id": "http://arxiv.org/abs/1902.08400v3",
    "download_url": "https://arxiv.org/abs/1902.08400v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Foundations of quantum mechanics and their impact on contemporary society",
    "abstract": "Nearing a century since its inception, quantum mechanics is as lively as ever. Its signature manifestations, such as superposition, wave-particle duality, uncertainty principle, entanglement and nonlocality, were long confronted as weird predictions of an incomplete theory, paradoxes only suitable for philosophical discussions, or mere mathematical artifacts with no counterpart in the physical reality. Nevertheless, decades of progress in the experimental verification and control of quantum systems have routinely proven detractors wrong. While fundamental questions still remain wide open on the foundations and interpretations of quantum mechanics, its modern technological applications have captured the fascination of the general public and are having a transformative impact on society. This brief article acts as Introduction to a Special Issue in the Philosophical Transactions of Royal Society A, following from a dedicated Scientific Discussion Meeting where these fascinating topics were explored, giving rise to stimulating debates among speakers and audience. The present issue thus aims at conveying the spirit of those discussions.",
    "authors": [
      "Gerardo Adesso",
      "Rosario Lo Franco",
      "Valentina Parigi"
    ],
    "publication_date": "2018-05-31T17:36:38Z",
    "arxiv_id": "http://arxiv.org/abs/1806.00538v1",
    "download_url": "https://arxiv.org/abs/1806.00538v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Quantum Mechanics of Being and Its Manifestation",
    "abstract": "How can quantum mechanics be (i) the fundamental theoretical framework of contemporary physics and (ii) a probability calculus that presupposes the events to which, and on the basis of which, it assigns probabilities? The question is answered without invoking knowledge or observers, by interpreting the necessary distinction between two kinds of physical quantities - unconditionally definite quantities and quantities that have values only if they are measured - as a distinction between the manifested world and its manifestation.",
    "authors": [
      "Ulrich Mohrhoff"
    ],
    "publication_date": "2016-04-04T03:21:32Z",
    "arxiv_id": "http://arxiv.org/abs/1604.01016v1",
    "download_url": "https://arxiv.org/abs/1604.01016v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Roads to objectivity: Quantum Darwinism, Spectrum Broadcast Structures, and Strong quantum Darwinism -- a review",
    "abstract": "The problem of objectivity, i.e. how to explain on quantum grounds the objective character of the macroscopic world, is one of the aspects of the celebrated quantum-to-classical transition. Initiated by W. H. Zurek and collaborators, this problem gained some attention recently with several approaches being developed. The aim of this work is to compare three of them: quantum Darwinism, Spectrum Broadcast Structures, and strong quantum Darwinism. The paper is concentrated on foundations, providing a synthetic analysis of how the three approaches realize the idea of objectivity and how they are related to each other. As a byproduct of this analysis, a proof of a generalized Spectrum Broadcast Structure theorem is presented. Recent quantum Darwinism experiments are also briefly discussed.",
    "authors": [
      "J. K. Korbicz"
    ],
    "publication_date": "2020-07-08T17:22:02Z",
    "arxiv_id": "http://arxiv.org/abs/2007.04276v2",
    "download_url": "https://arxiv.org/abs/2007.04276v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Measuring Holographic Entanglement Entropy on a Quantum Simulator",
    "abstract": "Quantum simulation promises to have wide applications in many fields where problems are hard to model with classical computers. Various quantum devices of different platforms have been built to tackle the problems in, say, quantum chemistry, condensed matter physics, and high-energy physics. Here, we report an experiment towards the simulation of quantum gravity by simulating the holographic entanglement entropy. On a six-qubit nuclear magnetic resonance quantum simulator, we demonstrate a key result of Anti-de Sitter/conformal field theory(\\adscft) correspondence---the Ryu-Takayanagi formula is demonstrated by measuring the relevant entanglement entropies on the perfect tensor state. The fidelity of our experimentally prepared the six-qubit state is 85.0\\% via full state tomography and reaches 93.7\\% if the signal-decay due to decoherence is taken into account. Our experiment serves as the basic module of simulating more complex tensor network states that exploring \\adscft correspondence. As the initial experimental attempt to study \\adscft via quantum information processing, our work opens up new avenues exploring quantum gravity phenomena on quantum simulators.",
    "authors": [
      "Keren Li",
      "Muxin Han",
      "Dongxue Qu",
      "Zichang Huang",
      "Guilu Long",
      "Yidun Wan",
      "Dawei Lu",
      "Bei Zeng",
      "Raymond Laflamme"
    ],
    "publication_date": "2017-04-30T19:22:29Z",
    "arxiv_id": "http://arxiv.org/abs/1705.00365v2",
    "download_url": "https://arxiv.org/abs/1705.00365v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum state of fields in $SU(\\infty)$ Quantum Gravity ($SU(\\infty)$-QGR)",
    "abstract": "Our Universe is ruled by quantum mechanics and should be treated as a quantum system. $SU(\\infty)$-QGR is a recently proposed quantum model for the Universe, in which gravity is associated to $SU(\\infty)$ symmetry of its Hilbert space. Fragmentation of its infinite dimensional state due to random quantum fluctuations divides the Universe to approximately isolated subsystems. In addition to parameters of their {\\it internal} finite rank symmetries, states and dynamics of subsystems are characterized by 4 continuous parameters and the perceived classical spacetime is their effective representation, reflecting quantum states of subsystems and their relative evolution. At lowest order the effective Lagrangian of $SU(\\infty)$-QGR~has the form of Yang-Mills gauge theories for both $SU(\\infty)$ - gravity - and internal symmetries defined on the aforementioned 4D parameter space. In the present work we study more thoroughly some of the fundamental aspects of $SU(\\infty)$-QGR. Specifically, we clarify the impact of the degeneracies of $\\mathcal{SU}(\\infty)$ algebra on the construction of the model; describe mixed states of subsystems and their purification; calculate measures of their entanglement to the rest of the Universe; and discuss their role in the emergence of local gauge symmetries. We also describe the relationship between what is called {\\it internal space} of $SU(\\infty)$ Yang-Mills with the 4D parameter space, and analytically demonstrate irrelevance of the geometry of parameter space for physical observables. Along with these topics, we demonstrate the equivalence of two sets of criteria for compositeness of a quantum system, and show uniqueness of the limit of various algebras leading to $\\mathcal{SU}(\\infty)$.",
    "authors": [
      "Houri Ziaeepour"
    ],
    "publication_date": "2024-02-28T11:06:45Z",
    "arxiv_id": "http://arxiv.org/abs/2402.18237v3",
    "download_url": "https://arxiv.org/abs/2402.18237v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Introduction to Quantum Mechanics ... for those who dwell in the macroscopic world",
    "abstract": "There is a huge number of excellent and comprehensive textbooks on quantum mechanics. They mainly differ for the approach, more or less oriented to the formalism rather than to the phenomenology, as well as for the topics covered. These lectures have been based mainly on the classical textbook by Gasiorowicz (1974). I must confess that the main reason for my choice of Gasiorowicz (1974) is affective, as it was the textbook where I first learned the basic principles of quantum mechanics. Beyond my personal taste, I now recognize that Gasiorowicz (1974) is still a very good textbook on quantum mechanics, with a rigorous theoretical approach accompanied by a wide collection of applications. If the textbook by Gasiorowicz was my main basis, I have taken much also from other textbooks such as Phillips (2003), as well as from the excellent classical textbook by Dirac (1981). In order to avoid complications in the mathematics and in the notation, the topic is presented in these notes with reference to one-dimensional systems, with just a few marginal extensions to the three-dimensional formulation.",
    "authors": [
      "Antonio Barletta"
    ],
    "publication_date": "2012-01-20T08:54:23Z",
    "arxiv_id": "http://arxiv.org/abs/1201.4234v3",
    "download_url": "https://arxiv.org/abs/1201.4234v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum-accelerated constraint programming",
    "abstract": "Constraint programming (CP) is a paradigm used to model and solve constraint satisfaction and combinatorial optimization problems. In CP, problems are modeled with constraints that describe acceptable solutions and solved with backtracking tree search augmented with logical inference. In this paper, we show how quantum algorithms can accelerate CP, at both the levels of inference and search. Leveraging existing quantum algorithms, we introduce a quantum-accelerated filtering algorithm for the $\\texttt{alldifferent}$ global constraint and discuss its applicability to a broader family of global constraints with similar structure. We propose frameworks for the integration of quantum filtering algorithms within both classical and quantum backtracking search schemes, including a novel hybrid classical-quantum backtracking search method. This work suggests that CP is a promising candidate application for early fault-tolerant quantum computers and beyond.",
    "authors": [
      "Kyle E. C. Booth",
      "Bryan O'Gorman",
      "Jeffrey Marshall",
      "Stuart Hadfield",
      "Eleanor Rieffel"
    ],
    "publication_date": "2021-03-08T01:29:53Z",
    "arxiv_id": "http://arxiv.org/abs/2103.04502v2",
    "download_url": "https://arxiv.org/abs/2103.04502v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Searches for massive neutrinos with mechanical quantum sensors",
    "abstract": "The development of quantum optomechanics now allows mechanical sensors with femtogram masses to be controlled and measured in the quantum regime. If the mechanical element contains isotopes that undergo nuclear decay, measuring the recoil of the sensor following the decay allows reconstruction of the total momentum of all emitted particles, including any neutral particles that may escape detection in traditional detectors. As an example, for weak nuclear decays the momentum of the emitted neutrino can be reconstructed on an event-by-event basis. We present the concept that a single nanometer-scale, optically levitated sensor operated with sensitivity near the standard quantum limit can search for heavy sterile neutrinos in the keV-MeV mass range with sensitivity significantly beyond existing constraints. We also comment on the possibility that mechanical sensors operated well into the quantum regime might ultimately reach the sensitivities required to provide an absolute measurement of the mass of the light neutrino states.",
    "authors": [
      "Daniel Carney",
      "Kyle G. Leach",
      "David C. Moore"
    ],
    "publication_date": "2022-07-12T23:12:49Z",
    "arxiv_id": "http://arxiv.org/abs/2207.05883v2",
    "download_url": "https://arxiv.org/abs/2207.05883v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient algorithms for quantum information bottleneck",
    "abstract": "The ability to extract relevant information is critical to learning. An ingenious approach as such is the information bottleneck, an optimisation problem whose solution corresponds to a faithful and memory-efficient representation of relevant information from a large system. The advent of the age of quantum computing calls for efficient methods that work on information regarding quantum systems. Here we address this by proposing a new and general algorithm for the quantum generalisation of information bottleneck. Our algorithm excels in the speed and the definiteness of convergence compared with prior results. It also works for a much broader range of problems, including the quantum extension of deterministic information bottleneck, an important variant of the original information bottleneck problem. Notably, we discover that a quantum system can achieve strictly better performance than a classical system of the same size regarding quantum information bottleneck, providing new vision on justifying the advantage of quantum machine learning.",
    "authors": [
      "Masahito Hayashi",
      "Yuxiang Yang"
    ],
    "publication_date": "2022-08-22T14:20:05Z",
    "arxiv_id": "http://arxiv.org/abs/2208.10342v2",
    "download_url": "https://arxiv.org/abs/2208.10342v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Operational Environment for Quantum Self-Testing",
    "abstract": "Observed quantum correlations are known to determine in certain cases the underlying quantum state and measurements. This phenomenon is known as (quantum) self-testing.\n  Self-testing constitutes a significant research area with practical and theoretical ramifications for quantum information theory. But since its conception two decades ago by Mayers and Yao, the common way to rigorously formulate self-testing has been in terms of operator-algebraic identities, and this formulation lacks an operational interpretation. In particular, it is unclear how to formulate self-testing in other physical theories, in formulations of quantum theory not referring to operator-algebra, or in scenarios causally different from the standard one.\n  In this paper, we explain how to understand quantum self-testing operationally, in terms of causally structured dilations of the input-output channel encoding the correlations. These dilations model side-information which leaks to an environment according to a specific schedule, and we show how self-testing concerns the relative strength between such scheduled leaks of information. As such, the title of our paper has double meaning: we recast conventional quantum self-testing in terms of information-leaks to an environment -- and this realises quantum self-testing as a special case within the surroundings of a general operational framework.\n  Our new approach to quantum self-testing not only supplies an operational understanding apt for various generalisations, but also resolves some unexplained aspects of the existing definition, naturally suggests a distance measure suitable for robust self-testing, and points towards self-testing as a modular concept in a larger, cryptographic perspective.",
    "authors": [
      "Matthias Christandl",
      "Nicholas Gauguin Houghton-Larsen",
      "Laura Mancinska"
    ],
    "publication_date": "2021-08-13T14:06:52Z",
    "arxiv_id": "http://arxiv.org/abs/2108.06254v3",
    "download_url": "https://arxiv.org/abs/2108.06254v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Switching quantum reference frames in the N-body problem and the absence of global relational perspectives",
    "abstract": "Given the importance of quantum reference frames (QRFs) to both quantum and gravitational physics, it is pertinent to develop a systematic method for switching between the descriptions of physics relative to different choices of QRFs, which is valid in both fields. Here we continue with such a unifying approach, begun in arxiv:1809.00556, whose key ingredient is a symmetry principle, which enforces physics to be relational. Thanks to gauge related redundancies, this leads to a perspective-neutral structure which contains all frame choices at once and via which frame perspectives can be consistently switched. Formulated in the language of constrained systems, the perspective-neutral structure is the constraint surface classically and the gauge invariant Hilbert space in the Dirac quantized theory. By contrast, a perspective relative to a specific frame corresponds to a gauge choice and the associated reduced phase and Hilbert space. QRF changes thus amount to a gauge transformation. We show that they take the form of `quantum coordinate changes'. We illustrate this in a general mechanical model, namely the relational $N$-body problem in 3D space with rotational and translational symmetry. This model is especially interesting because it features the Gribov problem so that globally valid gauge fixing conditions, and hence relational frame perspectives, are absent. The constraint surface is topologically non-trivial and foliated by 3-, 5- and 6-dimensional gauge orbits, where the lower dimensional orbits are a set of measure zero. The $N$-body problem also does not admit globally valid canonically conjugate pairs of Dirac observables. These challenges notwithstanding, we exhibit how one can construct the QRF transformations for the 3-body problem. Our construction also sheds new light on the generic inequivalence of Dirac and reduced quantization through its interplay with QRF perspectives.",
    "authors": [
      "Augustin Vanrietvelde",
      "Philipp A. Hoehn",
      "Flaminia Giacomini"
    ],
    "publication_date": "2018-09-13T17:58:13Z",
    "arxiv_id": "http://arxiv.org/abs/1809.05093v3",
    "download_url": "https://arxiv.org/abs/1809.05093v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A centennial reappraisal of Heisenberg's Quantum Mechanics with a perspective on Einstein's Quantum Riddle",
    "abstract": "Heisenberg's breakthrough in his July 1925 paper that set in motion the development of Quantum Mechanics through subsequent papers by Born, Jordan, Heisenberg and also Dirac (from 1925 to 1927) is reexamined through a modern lens. In this paper, we shall discuss some new perspectives on (i) what could be the guiding intuitions for his discoveries and (ii) the origin of the Born-Jordan-Heisenberg canonical quantization rule. From this vantage point we may get an insight into Einstein's Quantum Riddle (Lande1974,Sommerfeld1918,Born1926) and a possible glimpse of what might come next after the last 100 years of Heisenberg's quantum mechanics.",
    "authors": [
      "Tuck C. Choy"
    ],
    "publication_date": "2023-08-08T11:59:47Z",
    "arxiv_id": "http://arxiv.org/abs/2308.04199v1",
    "download_url": "https://arxiv.org/abs/2308.04199v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum reference frame transformations as symmetries and the paradox of the third particle",
    "abstract": "In a quantum world, reference frames are ultimately quantum systems too -- but what does it mean to \"jump into the perspective of a quantum particle\"? In this work, we show that quantum reference frame (QRF) transformations appear naturally as symmetries of simple physical systems. This allows us to rederive and generalize known QRF transformations within an alternative, operationally transparent framework, and to shed new light on their structure and interpretation. We give an explicit description of the observables that are measurable by agents constrained by such quantum symmetries, and apply our results to a puzzle known as the `paradox of the third particle'. We argue that it can be reduced to the question of how to relationally embed fewer into more particles, and give a thorough physical and algebraic analysis of this question. This leads us to a generalization of the partial trace (`relational trace') which arguably resolves the paradox, and it uncovers important structures of constraint quantization within a simple quantum information setting, such as relational observables which are key in this resolution. While we restrict our attention to finite Abelian groups for transparency and mathematical rigor, the intuitive physical appeal of our results makes us expect that they remain valid in more general situations.",
    "authors": [
      "Marius Krumm",
      "Philipp A. Hoehn",
      "Markus P. Mueller"
    ],
    "publication_date": "2020-11-03T19:00:14Z",
    "arxiv_id": "http://arxiv.org/abs/2011.01951v2",
    "download_url": "https://arxiv.org/abs/2011.01951v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum simulation and computing with Rydberg-interacting qubits",
    "abstract": "Arrays of optically trapped atoms excited to Rydberg states have recently emerged as a competitive physical platform for quantum simulation and computing, where high-fidelity state preparation and readout, quantum logic gates and controlled quantum dynamics of more than 100 qubits have all been demonstrated. These systems are now approaching the point where reliable quantum computations with hundreds of qubits and realistically thousands of multiqubit gates with low error rates should be within reach for the first time. In this article we give an overview of the Rydberg quantum toolbox, emphasizing the high degree of flexibility for encoding qubits, performing quantum operations and engineering quantum many-body Hamiltonians. We then review the state-of-the-art concerning high-fidelity quantum operations and logic gates as well as quantum simulations in many-body regimes. Finally, we discuss computing schemes that are particularly suited to the Rydberg platform and some of the remaining challenges on the road to general purpose quantum simulators and quantum computers.",
    "authors": [
      "M. Morgado",
      "S. Whitlock"
    ],
    "publication_date": "2020-11-05T18:44:11Z",
    "arxiv_id": "http://arxiv.org/abs/2011.03031v2",
    "download_url": "https://arxiv.org/abs/2011.03031v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unraveling the emergence of quantum state designs in systems with symmetry",
    "abstract": "Quantum state designs, by enabling an efficient sampling of random quantum states, play a quintessential role in devising and benchmarking various quantum protocols with broad applications ranging from circuit designs to black hole physics. Symmetries, on the other hand, are expected to reduce the randomness of a state. Despite being ubiquitous, the effects of symmetry on quantum state designs remain an outstanding question. The recently introduced projected ensemble framework generates efficient approximate state $t$-designs by hinging on projective measurements and many-body quantum chaos. In this work, we examine the emergence of state designs from the random generator states exhibiting symmetries. Leveraging on translation symmetry, we analytically establish a sufficient condition for the measurement basis leading to the state $t$-designs. Then, by making use of the trace distance measure, we numerically investigate the convergence to the designs. Subsequently, we inspect the violation of the sufficient condition to identify bases that fail to converge. We further demonstrate the emergence of state designs in a physical system by studying the dynamics of a chaotic tilted field Ising chain with translation symmetry. We find faster convergence of the trace distance during the early time evolution in comparison to the cases when the symmetry is broken. To delineate the general applicability of our results, we extend our analysis to other symmetries. We expect our findings to pave the way for further exploration of deep thermalization and equilibration of closed and open quantum many-body systems.",
    "authors": [
      "Naga Dileep Varikuti",
      "Soumik Bandyopadhyay"
    ],
    "publication_date": "2024-02-14T05:35:03Z",
    "arxiv_id": "http://arxiv.org/abs/2402.08949v3",
    "download_url": "https://arxiv.org/abs/2402.08949v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ProjectQ: An Open Source Software Framework for Quantum Computing",
    "abstract": "We introduce ProjectQ, an open source software effort for quantum computing. The first release features a compiler framework capable of targeting various types of hardware, a high-performance simulator with emulation capabilities, and compiler plug-ins for circuit drawing and resource estimation. We introduce our Python-embedded domain-specific language, present the features, and provide example implementations for quantum algorithms. The framework allows testing of quantum algorithms through simulation and enables running them on actual quantum hardware using a back-end connecting to the IBM Quantum Experience cloud service. Through extension mechanisms, users can provide back-ends to further quantum hardware, and scientists working on quantum compilation can provide plug-ins for additional compilation, optimization, gate synthesis, and layout strategies.",
    "authors": [
      "Damian S. Steiger",
      "Thomas Häner",
      "Matthias Troyer"
    ],
    "publication_date": "2016-12-23T21:00:03Z",
    "arxiv_id": "http://arxiv.org/abs/1612.08091v2",
    "download_url": "https://arxiv.org/abs/1612.08091v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hybrid optomechanics for Quantum Technologies",
    "abstract": "We review the physics of hybrid optomechanical systems consisting of a mechanical oscillator interacting with both a radiation mode and an additional matter-like system. We concentrate on the cases embodied by either a single or a multi-atom system (a Bose-Einstein condensate, in particular) and discuss a wide range of physical effects, from passive mechanical cooling to the set-up of multipartite entanglement, from optomechanical non-locality to the achievement of non-classical states of a single mechanical mode. The reviewed material showcases the viability of hybridised cavity optomechanical systems as basic building blocks for quantum communication networks and quantum state-engineering devices, possibly empowered by the use of quantum and optimal control techniques. The results that we discuss are instrumental to the promotion of hybrid optomechanical devices as promising experimental platforms for the study of non-classicality at the genuine mesoscopic level.",
    "authors": [
      "Benjamin Rogers",
      "Nicola Lo Gullo",
      "Gabriele De Chiara",
      "G. Massimo Palma",
      "Mauro Paternostro"
    ],
    "publication_date": "2014-02-05T22:01:31Z",
    "arxiv_id": "http://arxiv.org/abs/1402.1195v2",
    "download_url": "https://arxiv.org/abs/1402.1195v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Advantage for Shared Randomness Generation",
    "abstract": "Sharing correlated random variables is a resource for a number of information theoretic tasks such as privacy amplification, simultaneous message passing, secret sharing and many more. In this article, we show that to establish such a resource called shared randomness, quantum systems provide an advantage over their classical counterpart. Precisely, we show that appropriate albeit fixed measurements on a shared two-qubit state can generate correlations which cannot be obtained from any possible state on two classical bits. In a resource theoretic set-up, this feature of quantum systems can be interpreted as an advantage in winning a two players co-operative game, which we call the `non-monopolize social subsidy' game. It turns out that the quantum states leading to the desired advantage must possess non-classicality in the form of quantum discord. On the other hand, while distributing such sources of shared randomness between two parties via noisy channels, quantum channels with zero capacity as well as with classical capacity strictly less than unity perform more efficiently than the perfect classical channel. Protocols presented here are noise-robust and hence should be realizable with state-of-the-art quantum devices.",
    "authors": [
      "Tamal Guha",
      "Mir Alimuddin",
      "Sumit Rout",
      "Amit Mukherjee",
      "Some Sankar Bhattacharya",
      "Manik Banik"
    ],
    "publication_date": "2020-01-07T05:02:51Z",
    "arxiv_id": "http://arxiv.org/abs/2001.01889v4",
    "download_url": "https://arxiv.org/abs/2001.01889v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum continuous measurements: The stochastic Schroedinger equations and the spectrum of the output",
    "abstract": "The stochastic Schrödinger equation, of classical or quantum type, allows to describe open quantum systems under measurement in continuous time. In this paper we review the link between these two descriptions and we study the properties of the output of the measurement. For simplicity we deal only with the diffusive case. Firstly, we discuss the quantum stochastic Schrödinger equation, which is based on quantum stochastic calculus, and we show how to transform it into the classical stochastic Schrödinger equation by diagonalization of suitable quantum observables, based on the isomorphism between Fock space and Wiener space. Then, we give the a posteriori state, the conditional system state at time $t$ given the output up to that time and we link its evolution to the classical stochastic Schrödinger equation. Finally, we study the output of the continuous measurement, which is a stochastic process with probability distribution given by the rules of quantum mechanics. When the output process is stationary, at least in the long run, the spectrum of the process can be introduced and its properties studied. In particular we show how the Heisenberg uncertainty relations give rise to characteristic bounds on the possible spectra and we discuss how this is related to the typical quantum phenomenon of squeezing. We use a simple quantum system, a two-level atom stimulated by a laser, to discuss the differences between homodyne and heterodyne detection and to explicitly show squeezing and anti-squeezing and the Mollow triplet in the fluorescence spectrum.",
    "authors": [
      "Alberto Barchielli",
      "Matteo Gregoratti"
    ],
    "publication_date": "2013-01-16T08:32:36Z",
    "arxiv_id": "http://arxiv.org/abs/1301.3626v2",
    "download_url": "https://arxiv.org/abs/1301.3626v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On low-depth algorithms for quantum phase estimation",
    "abstract": "Quantum phase estimation is one of the critical building blocks of quantum computing. For early fault-tolerant quantum devices, it is desirable for a quantum phase estimation algorithm to (1) use a minimal number of ancilla qubits, (2) allow for inexact initial states with a significant mismatch, (3) achieve the Heisenberg limit for the total resource used, and (4) have a diminishing prefactor for the maximum circuit length when the overlap between the initial state and the target state approaches one. In this paper, we prove that an existing algorithm from quantum metrology can achieve the first three requirements. As a second contribution, we propose a modified version of the algorithm that also meets the fourth requirement, which makes it particularly attractive for early fault-tolerant quantum devices.",
    "authors": [
      "Hongkang Ni",
      "Haoya Li",
      "Lexing Ying"
    ],
    "publication_date": "2023-02-05T18:40:49Z",
    "arxiv_id": "http://arxiv.org/abs/2302.02454v4",
    "download_url": "https://arxiv.org/abs/2302.02454v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum technologies need a Quantum Energy Initiative",
    "abstract": "Quantum technologies are currently the object of high expectations from governments and private companies, as they hold the promise to shape safer and faster ways to extract, exchange and treat information. However, despite its major potential impact for industry and society, the question of their energetic footprint has remained in a blind spot of current deployment strategies. In this Perspective, I argue that quantum technologies must urgently plan for the creation and structuration of a transverse quantum energy initiative, connecting quantum thermodynamics, quantum information science, quantum physics and engineering. Such initiative is the only path towards energy efficient, sustainable quantum technologies, and to possibly bring out an energetic quantum advantage.",
    "authors": [
      "A. Auffèves"
    ],
    "publication_date": "2021-11-17T17:17:26Z",
    "arxiv_id": "http://arxiv.org/abs/2111.09241v3",
    "download_url": "https://arxiv.org/abs/2111.09241v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum measurements without sums",
    "abstract": "Sums play a prominent role in the formalisms of quantum mechanics, be it for mixing and superposing states, or for composing state spaces. Surprisingly, a conceptual analysis of quantum measurement seems to suggest that quantum mechanics can be done without direct sums, expressed entirely in terms of the tensor product. The corresponding axioms define classical spaces as objects that allow copying and deleting data. Indeed, the information exchange between the quantum and the classical worlds is essentially determined by their distinct capabilities to copy and delete data. The sums turn out to be an implicit implementation of this capabilities. Realizing it through explicit axioms not only dispenses with the unnecessary structural baggage, but also allows a simple and intuitive graphical calculus. In category-theoretic terms, classical data types are dagger-compact Frobenius algebras, and quantum spectra underlying quantum measurements are Eilenberg-Moore coalgebras induced by these Frobenius algebras.",
    "authors": [
      "Bob Coecke",
      "Dusko Pavlovic"
    ],
    "publication_date": "2006-08-03T16:53:06Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0608035v2",
    "download_url": "https://arxiv.org/abs/quant-ph/0608035v2",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient Characterization of Quantum Evolutions via a Recommender System",
    "abstract": "We demonstrate characterizing quantum evolutions via matrix factorization algorithm, a particular type of the recommender system (RS). A system undergoing a quantum evolution can be characterized in several ways. Here we choose (i) quantum correlations quantified by measures such as entropy, negativity, or discord, and (ii) state-fidelity. Using quantum registers with up to 10 qubits, we demonstrate that an RS can efficiently characterize both unitary and nonunitary evolutions. After carrying out a detailed performance analysis of the RS in two qubits, we show that it can be used to distinguish a clean database of quantum correlations from a noisy or a fake one. Moreover, we find that the RS brings about a significant computational advantage for building a large database of quantum discord, for which no simple closed-form expression exists. Also, RS can efficiently characterize systems undergoing nonunitary evolutions in terms of quantum discord reduction as well as state-fidelity. Finally, we utilize RS for the construction of discord phase space in a nonlinear quantum system.",
    "authors": [
      "Priya Batra",
      "Anukriti Singh",
      "T. S. Mahesh"
    ],
    "publication_date": "2020-05-21T10:28:10Z",
    "arxiv_id": "http://arxiv.org/abs/2005.10555v4",
    "download_url": "https://arxiv.org/abs/2005.10555v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum signatures in nonlinear gravitational waves",
    "abstract": "The effective quantum field theory description of gravity, despite its non-renormalizability, allows for predictions beyond classical general relativity. As we enter the age of gravitational wave astronomy, an important and timely question is whether measurable quantum predictions that depart from classical gravity, analogous to quantum optics effects which cannot be explained by classical electrodynamics, can be found. In this work, we investigate quantum signatures in gravitational waves using tools from quantum optics. Squeezed-coherent gravitational waves, which can exhibit sub-Poissonian graviton statistics, can enhance or suppress the signal measured by an interferometer, a characteristic effect of quantum squeezing. Moreover, we show that Gaussian gravitational wave quantum states can be reconstructed from measurements over an ensemble of optical fields interacting with a single copy of the gravitational wave, thus opening the possibility of detecting quantum features of gravity beyond classical general relativity.",
    "authors": [
      "Thiago Guerreiro",
      "Francesco Coradeschi",
      "Antonia Micol Frassino",
      "Jennifer Rittenhouse West",
      "Enrico Junior Schioppa"
    ],
    "publication_date": "2021-11-02T17:55:53Z",
    "arxiv_id": "http://arxiv.org/abs/2111.01779v4",
    "download_url": "https://arxiv.org/abs/2111.01779v4",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum statistical mechanics from a Bohmian perspective",
    "abstract": "We develop a general formulation of quantum statistical mechanics in terms of probability currents that satisfy continuity equations in the multi-particle position space, for closed and open systems with a fixed number of particles. The continuity equation for any closed or open system suggests a natural Bohmian interpretation in terms of microscopic particle trajectories, that make the same measurable predictions as standard quantum theory. The microscopic trajectories are not directly observable, but provide a general, simple and intuitive microscopic interpretation of macroscopic phenomena in quantum statistical mechanics. In particular, we discuss how various notions of entropy, proper and improper mixtures, and thermodynamics are understood from the Bohmian perspective.",
    "authors": [
      "Hrvoje Nikolic"
    ],
    "publication_date": "2023-08-21T06:39:10Z",
    "arxiv_id": "http://arxiv.org/abs/2308.10500v3",
    "download_url": "https://arxiv.org/abs/2308.10500v3",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Probing tripartite entanglement and coherence dynamics in pure and mixed independent classical environments",
    "abstract": "Quantum information processing exploits non-local functionality that has led to significant breakthroughs in the successful deployment of quantum mechanical protocols. In this regard, we address the dynamics of entanglement and coherence for three non-interacting qubits initially prepared as maximally entangled GHZ-like state coupled with independent classical environments. Two different Gaussian noises in pure and mixed noisy situations, namely, pure power-law noise, pure fractional Gaussian noise, power-law noise maximized and fractional Gaussian noise maximized cases are assumed to characterize the environments. With the help of time-dependent entanglement witnesses, purity, and decoherence measures, within the full range of parameters, we show that the current mixed noise cases are more detrimental than pure ones where entanglement and coherence are found short-lived. The power-law noise phase, in particular, appears to be more flexible and exploitable for long-term preservation effects. In contrast, we find that in both pure and mixed noise cases, where entanglement and coherence degrade at a relatively high rate, there is no ultimate solution for avoiding the detrimental dephasing effects of fractional Gaussian noise. The three-qubit state becomes disentangled and decoherent within independent classical environments driven by both pure and mixed Gaussian noises, either in long or short interaction time. In addition, due to the lack of the entanglement revival phenomenon, there is no information exchange between the system and the environment. The three-qubit GHZ-like states have thus been realized to be an excellent resource for long enough quantum correlations, coherence, and quantum information preservation in classical independent channels driven by pure power-law noise with extremely low parameter values.",
    "authors": [
      "Atta Ur Rahman",
      "Muhammad Javed",
      "Arif Ullah",
      "Quantum Optics",
      "Quantum Information Research Group",
      "Department of Physics",
      "University of Malakand",
      "Chakdara Dir",
      "Pakistan"
    ],
    "publication_date": "2021-07-23T14:18:40Z",
    "arxiv_id": "http://arxiv.org/abs/2107.11259v1",
    "download_url": "https://arxiv.org/abs/2107.11259v1",
    "field_of_study": "physics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]