[
  {
    "title": "G-quadruplexes and mRNA localization",
    "abstract": "G-quadruplexes represent a novelty for molecular biology. Their role inside\nthe cell remains mysterious. We investigate a possible correlation with mRNA\nlocalization. In particular, we hypothesize that Gquadruplexes influence fluid\ndynamics.",
    "authors": [
      "Valentina Agoni"
    ],
    "publication_date": "2013-10-01T09:43:40Z",
    "arxiv_id": "http://arxiv.org/abs/1310.0213v1",
    "download_url": "http://arxiv.org/abs/1310.0213v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computing Pathways to Systems Biology: Key Contributions of\n  Computational Methods in Pathway Identification",
    "abstract": "Understanding large molecular networks consisting of entities such as genes,\nproteins or RNAs that interact in complex ways to drive the cellular machinery\nhas been an active focus of systems biology. Computational approaches have\nplayed a key role in systems biology by complementing theoretical and\nexperimental approaches. Here we roadmap some key contributions of\ncomputational methods developed over the last decade in the reconstruction of\nbiological pathways. We position these contributions in a 'systems biology\nperspective' to reemphasize their roles in unraveling cellular mechanisms and\nto understand 'systems biology diseases' including cancer.",
    "authors": [
      "Sriganesh Srihari",
      "Mark A. Ragan"
    ],
    "publication_date": "2013-04-20T00:17:03Z",
    "arxiv_id": "http://arxiv.org/abs/1304.5565v1",
    "download_url": "http://arxiv.org/abs/1304.5565v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Concerns regarding the deterioration of objectivity in molecular biology",
    "abstract": "Scientific objectivity was not a problem in the early days of molecular\nbiology. However, relativism seems to have invaded some areas of the field,\ndamaging the objectivity of its analyses. This review reports on the status of\nthis issue by investigating a number of cases.",
    "authors": [
      "Tomokazu Konishi"
    ],
    "publication_date": "2018-07-10T02:54:49Z",
    "arxiv_id": "http://arxiv.org/abs/1807.04190v1",
    "download_url": "http://arxiv.org/abs/1807.04190v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Biology at the Cellular Level - elements of the research program",
    "abstract": "Quantum Biology is emerging as a new field at the intersection between\nfundamental physics and biology, promising novel insights into the nature and\norigin of biological order. We discuss several elements of QBCL (Quantum\nBiology at Cellular Level), a research program designed to extend the reach of\nquantum concepts to higher than molecular levels of biological organization.\n  Key words. decoherence, macroscopic superpositions, basis-dependence, formal\nsuperposition, non-classical correlations, Basis-Dependent Selection (BDS),\nsynthetic biology, evolvability mechanism loophole.",
    "authors": [
      "Michael Bordonaro",
      "Vasily Ogryzko"
    ],
    "publication_date": "2013-04-02T16:38:18Z",
    "arxiv_id": "http://arxiv.org/abs/1304.0683v2",
    "download_url": "http://arxiv.org/abs/1304.0683v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Cloud Biology",
    "abstract": "Some astrobiological models suggest that molecular clouds may serve as\nhabitats for extraterrestrial life. This study reviews recent theoretical work\naddressing the physical and biochemical prerequisites for life in such\nenvironments, with particular focus on three subjects: (1) bioenergetic\npathways under extreme low-temperature conditions; (2) the emergence and\npreservation of biomolecular chirality; and (3) detection methodologies for\npotential biosignatures. In this paper, we formally introduce the molecular\ncloud biology concept, which integrates all physicochemical and metabolic\nprocesses hypothesized to sustain life within molecular clouds. As a potential\nbranch of astrobiology, molecular cloud biology warrants interdisciplinary\ncollaborative research to validate its foundational assumptions and explore its\nscientific implications.",
    "authors": [
      "Lei Feng"
    ],
    "publication_date": "2025-02-23T15:37:45Z",
    "arxiv_id": "http://arxiv.org/abs/2502.16615v1",
    "download_url": "http://arxiv.org/abs/2502.16615v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computer algebra in systems biology",
    "abstract": "Systems biology focuses on the study of entire biological systems rather than\non their individual components. With the emergence of high-throughput data\ngeneration technologies for molecular biology and the development of advanced\nmathematical modeling techniques, this field promises to provide important new\ninsights. At the same time, with the availability of increasingly powerful\ncomputers, computer algebra has developed into a useful tool for many\napplications. This article illustrates the use of computer algebra in systems\nbiology by way of a well-known gene regulatory network, the Lac Operon in the\nbacterium E. coli.",
    "authors": [
      "Reinhard Laubenbacher",
      "Bernd Sturmfels"
    ],
    "publication_date": "2007-12-27T16:01:35Z",
    "arxiv_id": "http://arxiv.org/abs/0712.4248v2",
    "download_url": "http://arxiv.org/abs/0712.4248v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Energy flow in biological system: Bioenergy transduction of V1-ATPase\n  molecular rotary motor from E. hirae",
    "abstract": "We classify research fields in biology into those on flows of materials,\nenergy, and information. As a representative energy transducing machinery in\nbiology, our research target, V1-ATPase from a bacterium Enterococcus hirae, a\ntypical molecular rotary motor is introduced. Structures of several\nintermediates of the rotary motor are described and the molecular mechanism of\nthe motor converting chemical energy into mechanical energy is discussed.\nComments and considerations on the information flow in biology, especially on\nthe thermodynamic entropy in quantum physical and biological systems, are added\nin a separate section containing the biologist friendly presentation of this\ncomplicated question.",
    "authors": [
      "Ichiro Yamato",
      "Takeshi Murata",
      "Andrei Khrennikov"
    ],
    "publication_date": "2017-05-27T21:31:53Z",
    "arxiv_id": "http://arxiv.org/abs/1705.09868v1",
    "download_url": "http://arxiv.org/abs/1705.09868v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complexity in Biology",
    "abstract": "We will review some of the theoretical progresses that have been in the study\nof complex systems in physics and of their applications to biology.",
    "authors": [
      "Giorgio Parisi"
    ],
    "publication_date": "1994-12-05T08:59:32Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9412018v1",
    "download_url": "http://arxiv.org/abs/cond-mat/9412018v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Giulio Fermi's contributions to biophysics and molecular biology",
    "abstract": "This paper presents a comprehensive list of the scientific articles of Giulio\nFermi (1936-1997), son of the Italian-American physicist Enrico Fermi,\npublished between 1962 and 1997. The initial research activity of Giulio was\nconcerned with virology and biological cybernetics while, from 1975 onward, his\nwork was completely devoted to protein crystallography. The crystallographic\nresearch was carried out in collaboration with Nobel laureate Max Perutz at the\nMedical Research Council (MRC) Laboratory of Molecular Biology in Cambridge\n(United Kingdom). A short biography of Giulio (Judd) Fermi appears inside John\nFinch's book A Nobel Fellow on Every Floor: A History of the Medical Research\nCouncil Laboratory of Molecular Biology published by the MRC in 2008.",
    "authors": [
      "Fabio Pichierri"
    ],
    "publication_date": "2018-01-07T05:40:55Z",
    "arxiv_id": "http://arxiv.org/abs/1801.03119v1",
    "download_url": "http://arxiv.org/abs/1801.03119v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Molecular Implementation of the Least Mean Squares Estimator",
    "abstract": "In order to function reliably, synthetic molecular circuits require\nmechanisms that allow them to adapt to environmental disturbances. Least mean\nsquares (LMS) schemes, such as commonly encountered in signal processing and\ncontrol, provide a powerful means to accomplish that goal. In this paper we\nshow how the traditional LMS algorithm can be implemented at the molecular\nlevel using only a few elementary biomolecular reactions. We demonstrate our\napproach using several simulation studies and discuss its relevance to\nsynthetic biology.",
    "authors": [
      "Christoph Zechner",
      "Mustafa Khammash"
    ],
    "publication_date": "2017-01-03T08:55:23Z",
    "arxiv_id": "http://arxiv.org/abs/1701.00602v1",
    "download_url": "http://arxiv.org/abs/1701.00602v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Challenges in experimental data integration within genome-scale\n  metabolic models",
    "abstract": "A report of the meeting \"Challenges in experimental data integration within\ngenome-scale metabolic models\", Institut Henri Poincar\\'e, Paris, October 10-11\n2009, organized by the CNRS-MPG joint program in Systems Biology.",
    "authors": [
      "Pierre-Yves Bourguignon",
      "Areejit Samal",
      "François Képès",
      "Jürgen Jost",
      "Olivier C. Martin"
    ],
    "publication_date": "2010-04-25T22:41:35Z",
    "arxiv_id": "http://arxiv.org/abs/1004.4387v1",
    "download_url": "http://arxiv.org/abs/1004.4387v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Some Recent Insights in Integral Biomathics",
    "abstract": "This paper summarizes the results in Integral Biomathics obtained to this\nmoment and provides an outlook for future research in the field.",
    "authors": [
      "Plamen L. Simeonov"
    ],
    "publication_date": "2013-06-11T05:45:57Z",
    "arxiv_id": "http://arxiv.org/abs/1306.2843v3",
    "download_url": "http://arxiv.org/abs/1306.2843v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Paths to Unconventional Computing: Causality in Complexity",
    "abstract": "I describe my path to unconventionality in my exploration of theoretical and\napplied aspects of computation towards revealing the algorithmic and\nreprogrammable properties and capabilities of the world, in particular related\nto applications of algorithmic complexity in reshaping molecular biology and\ntackling the challenges of causality in science.",
    "authors": [
      "Hector Zenil"
    ],
    "publication_date": "2017-06-01T03:31:20Z",
    "arxiv_id": "http://arxiv.org/abs/1706.08803v1",
    "download_url": "http://arxiv.org/abs/1706.08803v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ten Simple Rules for Creating Biomolecular Graphics",
    "abstract": "One need only compare the number of three-dimensional molecular illustrations\nin the first (1990) and third (2004) editions of Voet & Voet's \"Biochemistry\"\nin order to appreciate this field's profound communicative value in modern\nbiological sciences -- ranging from medicine, physiology, and cell biology, to\npharmaceutical chemistry and drug design, to structural and computational\nbiology. The clich\\'e about a picture being worth a thousand words is quite\npoignant here: The information 'content' of an effectively-constructed piece of\nmolecular graphics can be immense. Because biological function arises from\nstructure, it is difficult to overemphasize the utility of visualization and\ngraphics in molding our current understanding of the molecular nature of\nbiological systems. Nevertheless, creating effective molecular graphics is not\neasy -- neither conceptually, nor in terms of effort required. The present\ncollection of Rules is meant as a guide for those embarking upon their first\nmolecular illustrations.",
    "authors": [
      "Cameron Mura"
    ],
    "publication_date": "2014-07-15T17:48:16Z",
    "arxiv_id": "http://arxiv.org/abs/1407.4071v1",
    "download_url": "http://arxiv.org/abs/1407.4071v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Prediction to Simulation: AlphaFold 3 as a Differentiable Framework\n  for Structural Biology",
    "abstract": "AlphaFold 3 represents a transformative advancement in computational biology,\nenhancing protein structure prediction through novel multi-scale transformer\narchitectures, biologically informed cross-attention mechanisms, and\ngeometry-aware optimization strategies. These innovations dramatically improve\npredictive accuracy and generalization across diverse protein families,\nsurpassing previous methods. Crucially, AlphaFold 3 embodies a paradigm shift\ntoward differentiable simulation, bridging traditional static structural\nmodeling with dynamic molecular simulations. By reframing protein folding\npredictions as a differentiable process, AlphaFold 3 serves as a foundational\nframework for integrating deep learning with physics-based molecular",
    "authors": [
      "Alireza Abbaszadeh",
      "Armita Shahlaee"
    ],
    "publication_date": "2025-08-25T19:49:28Z",
    "arxiv_id": "http://arxiv.org/abs/2508.18446v1",
    "download_url": "http://arxiv.org/abs/2508.18446v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Dynamics Analysis of Biomolecular Systems Including Nucleic\n  Acids",
    "abstract": "Along with recent progress in structural biology and genome biology,\nstructural dynamics of molecular systems including nucleic acids has attracted\nattention in the context of gene regulation. Structure-function relationship is\nan important topic, where physicochemical properties of nucleotides are\nimportant as well as those of amino acids in proteins. Simulation is a useful\ntool for the analysis of molecular dynamics in detail, complementary to\nexperiments. However, molecular simulation of nucleic acids has less developed\nthan that of proteins yet, partly due to the physical nature of nucleic acids.\nIn this review, we briefly describe the current situation and future directions\nof the field, hopefully as a guide to collaboration between experiment and\ncomputation.",
    "authors": [
      "Takeru Kameda",
      "Akinori Awazu",
      "Yuichi Togashi"
    ],
    "publication_date": "2021-11-21T06:00:06Z",
    "arxiv_id": "http://arxiv.org/abs/2111.10749v1",
    "download_url": "http://arxiv.org/abs/2111.10749v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Toy Models and Statistical Mechanics of Subgraphs and Motifs of Genetic\n  and Protein Networks",
    "abstract": "Theoretical physics is used for a toy model of molecular biology to assess\nconditions that lead to the edge of chaos (EOC) in a network of biomolecules.\nResults can enhance our ability to understand complex diseases and their\ntreatment or cure.",
    "authors": [
      "S. Bumble"
    ],
    "publication_date": "2004-01-22T07:47:03Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0401029v1",
    "download_url": "http://arxiv.org/abs/q-bio/0401029v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Intra-molecular refrigeration in enzymes",
    "abstract": "We present a simple mechanism for intra-molecular refrigeration, where parts\nof a molecule are actively cooled below the environmental temperature. We\ndiscuss the potential role and applications of such a mechanism in biology, in\nparticular in enzymatic reactions.",
    "authors": [
      "Hans J. Briegel",
      "Sandu Popescu"
    ],
    "publication_date": "2009-12-14T17:17:40Z",
    "arxiv_id": "http://arxiv.org/abs/0912.2365v1",
    "download_url": "http://arxiv.org/abs/0912.2365v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Markov Field Models: scaling molecular kinetics approaches to large\n  molecular machines",
    "abstract": "With recent advances in structural biology, including experimental techniques\nand deep learning-enabled high-precision structure predictions, molecular\ndynamics methods that scale up to large biomolecular systems are required.\nCurrent state-of-the-art approaches in molecular dynamics modeling focus on\nencoding global configurations of molecular systems as distinct states. This\nparadigm commands us to map out all possible structures and sample transitions\nbetween them, a task that becomes impossible for large-scale systems such as\nbiomolecular complexes. To arrive at scalable molecular models, we suggest\nmoving away from global state descriptions to a set of coupled models that each\ndescribe the dynamics of local domains or sites of the molecular system. We\ndescribe limitations in the current state-of-the-art global-state Markovian\nmodeling approaches and then introduce Markov Field Models as an umbrella term\nthat includes models from various scientific communities, including Independent\nMarkov Decomposition, Ising and Potts Models, and (Dynamic) Graphical Models,\nand evaluate their use for computational molecular biology. Finally, we give a\nfew examples of early adoptions of these ideas for modeling molecular kinetics\nand thermodynamics.",
    "authors": [
      "Tim Hempel",
      "Simon Olsson",
      "Frank Noé"
    ],
    "publication_date": "2022-06-23T11:05:30Z",
    "arxiv_id": "http://arxiv.org/abs/2206.11620v1",
    "download_url": "http://arxiv.org/abs/2206.11620v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "When physics meets biology: a less known Feynman",
    "abstract": "We discuss a less known aspect of Feynman's multifaceted scientific work,\ncentered about his interest in molecular biology, which came out around 1959\nand lasted for several years. After a quick historical reconstruction about the\nbirth of molecular biology, we focus on Feynman's work on genetics with Robert\nS. Edgar in the laboratory of Max Delbruck, which was later quoted by Francis\nCrick and others in relevant papers, as well as in Feynman's lectures given at\nthe Hughes Aircraft Company on biology, organic chemistry and microbiology,\nwhose notes taken by the attendee John Neer are available. An intriguing\nperspective comes out about one of the most interesting scientists of the XX\ncentury.",
    "authors": [
      "Marco Di Mauro",
      "Salvatore Esposito",
      "Adele Naddeo"
    ],
    "publication_date": "2018-05-10T06:59:00Z",
    "arxiv_id": "http://arxiv.org/abs/1805.03854v1",
    "download_url": "http://arxiv.org/abs/1805.03854v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Synthetic Biology in Leishmaniasis: Design,simulation and validation of\n  constructed Genetic circuit",
    "abstract": "Building circuits and studying their behavior in cells is a major goal of\nsystems and synthetic biology. Synthetic biology enables the precise control of\ncellular states for systems studies, the discovery of novel parts, control\nstrategies, and interactions for the design of robust synthetic systems. To the\nbest of our knowledge,there are no literature reports for the synthetic circuit\nconstruction for protozoan parasites. This paper describes the construction of\ngenetic circuit for the targeted enzyme inositol phosphorylceramide synthase\nbelonging to the protozoan parasite Leishmania. To explore the dynamic nature\nof the circuit designed, simulation was done followed by circuit validation by\nqualitative and quantitative approaches. The genetic circuit designed for\ninositol phosphorylceramide synthase shows responsiveness, oscillatory and\nbistable behavior, together with intrinsic robustness.",
    "authors": [
      "Dixita Limbachiya"
    ],
    "publication_date": "2013-04-01T12:32:52Z",
    "arxiv_id": "http://arxiv.org/abs/1304.0342v1",
    "download_url": "http://arxiv.org/abs/1304.0342v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Physics of liquid crystals in cell biology",
    "abstract": "The last decade has witnessed a rapid growth in understanding of the pivotal\nroles of mechanical stresses and physical forces in cell biology. As a result\nan integrated view of cell biology is evolving, where genetic and molecular\nfeatures are scrutinized hand in hand with physical and mechanical\ncharacteristics of cells. Physics of liquid crystals has emerged as a\nburgeoning new frontier in cell biology over the past few years, fueled by an\nincreasing identification of orientational order and topological defects in\ncell biology, spanning scales from subcellular filaments to individual cells\nand multicellular tissues. Here, we provide an account of most recent findings\nand developments together with future promises and challenges in this rapidly\nevolving interdisciplinary research direction.",
    "authors": [
      "Amin Doostmohammadi",
      "Benoit Ladoux"
    ],
    "publication_date": "2021-10-07T06:42:11Z",
    "arxiv_id": "http://arxiv.org/abs/2110.03207v1",
    "download_url": "http://arxiv.org/abs/2110.03207v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evaluating the Potential of Leading Large Language Models in Reasoning\n  Biology Questions",
    "abstract": "Recent advances in Large Language Models (LLMs) have presented new\nopportunities for integrating Artificial General Intelligence (AGI) into\nbiological research and education. This study evaluated the capabilities of\nleading LLMs, including GPT-4, GPT-3.5, PaLM2, Claude2, and SenseNova, in\nanswering conceptual biology questions. The models were tested on a\n108-question multiple-choice exam covering biology topics in molecular biology,\nbiological techniques, metabolic engineering, and synthetic biology. Among the\nmodels, GPT-4 achieved the highest average score of 90 and demonstrated the\ngreatest consistency across trials with different prompts. The results\nindicated GPT-4's proficiency in logical reasoning and its potential to aid\nbiology research through capabilities like data analysis, hypothesis\ngeneration, and knowledge integration. However, further development and\nvalidation are still required before the promise of LLMs in accelerating\nbiological discovery can be realized.",
    "authors": [
      "Xinyu Gong",
      "Jason Holmes",
      "Yiwei Li",
      "Zhengliang Liu",
      "Qi Gan",
      "Zihao Wu",
      "Jianli Zhang",
      "Yusong Zou",
      "Yuxi Teng",
      "Tian Jiang",
      "Hongtu Zhu",
      "Wei Liu",
      "Tianming Liu",
      "Yajun Yan"
    ],
    "publication_date": "2023-11-05T03:34:17Z",
    "arxiv_id": "http://arxiv.org/abs/2311.07582v1",
    "download_url": "http://arxiv.org/abs/2311.07582v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Athena: Modular CAM/CAD Software for Synthetic Biology",
    "abstract": "Synthetic biology is the engineering of cellular networks. It combines\nprinciples of engineering and the knowledge of biological networks to program\nthe behavior of cells. Computational modeling techniques in conjunction with\nmolecular biology techniques have been successful in constructing biological\ndevices such as switches, oscillators, and gates. The ambition of synthetic\nbiology is to construct complex systems from such fundamental devices, much in\nthe same way electronic circuits are built from basic parts. As this ambition\nbecomes a reality, engineering concepts such as interchangeable parts and\nencapsulation will find their way into biology. We realize that there is a need\nfor computational tools that would support such engineering concepts in\nbiology. As a solution, we have developed the software Athena that allows\nbiological models to be constructed as modules. Modules can be connected to one\nanother without altering the modules themselves. In addition, Athena houses\nvarious tools useful for designing synthetic networks including tools to\nperform simulations, automatically derive transcription rate expressions, and\nview and edit synthetic DNA sequences. New tools can be incorporated into\nAthena without modifying existing program via a plugin interface, IronPython\nscripts, Systems Biology Workbench interfacing and the R statistical language.\nThe program is currently for Windows operating systems, and the source code for\nAthena is made freely available through CodePlex, www.codeplex.com/athena.",
    "authors": [
      "Deepak Chandran",
      "Frank T. Bergmann",
      "Herbert M. Sauro"
    ],
    "publication_date": "2009-02-16T03:31:27Z",
    "arxiv_id": "http://arxiv.org/abs/0902.2598v1",
    "download_url": "http://arxiv.org/abs/0902.2598v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Atomic Biology, Electrostatics, and Ionic Channels",
    "abstract": "I believe an atomic biology is needed to supplement present day molecular\nbiology, if we are to design and understand proteins, as well as define, make,\nand use them. Topics in the paper are molecular biology and atomic biology.\nElectrodiffusion in the open channel. Electrodiffusion in mixed electrolytes.\nModels of permeation. State Models of Permeation are Inconsistent with the\nElectric Field. Making models in atomic biology. Molecular dynamics. Temporal\nLimitations; Spatial Limitations; Periodic boundary conditions. Hierarchy of\nmodels of the open channel. Stochastic Motion of the Channel. Langevin\nDynamics. Simulations of the Reaction Path: the Permion. Chemical reactions.\nWhat was wrong? Back to the hierarchy: Occam's razor can slit your throat.\nPoisson-Nernst-Planck PNP Models Flux Ratios; Pumping by Field Coupling. Gating\nin channels of one conformation. Gating by Field Switching; Gating Current;\nGating in Branched Channels; Blocking. Back to the hierarchy: Linking levels.\nIs there a theory? At what level will the adaptation be found? Simplicity,\nevolution, and natural function.",
    "authors": [
      "R. S. Eisenberg"
    ],
    "publication_date": "2008-07-04T10:35:06Z",
    "arxiv_id": "http://arxiv.org/abs/0807.0715v3",
    "download_url": "http://arxiv.org/abs/0807.0715v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic approximations of higher-molecular by bi-molecular reactions",
    "abstract": "Biochemical reactions involving three or more reactants, called\nhigher-molecular reactions, play an important role in theoretical systems and\nsynthetic biology. In particular, such reactions underpin a variety of\nimportant bio-dynamical phenomena, such as multi-stability/multi-modality,\noscillations, bifurcations, and noise-induced effects. However, only reactions\nwith at most two reactants, called bi-molecular reactions, are experimentally\nfeasible. To bridge the gap, in this paper we put forward an algorithm for\nsystematically approximating arbitrary higher-molecular reactions with\nbi-molecular ones, while preserving the underlying stochastic dynamics.\nProperties of the algorithm and convergence are established via singular\nperturbation theory. The algorithm is applied to a variety of higher-molecular\nbiochemical networks, and is shown to play an important role in\nnucleic-acid-based synthetic biology.",
    "authors": [
      "Tomislav Plesa"
    ],
    "publication_date": "2018-11-07T05:34:59Z",
    "arxiv_id": "http://arxiv.org/abs/1811.02766v2",
    "download_url": "http://arxiv.org/abs/1811.02766v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information theory in molecular biology",
    "abstract": "This article introduces the physics of information in the context of\nmolecular biology and genomics. Entropy and information, the two central\nconcepts of Shannon's theory of information and communication, are often\nconfused with each other but play transparent roles when applied to statistical\nensembles (i.e., identically prepared sets) of symbolic sequences. Such an\napproach can distinguish between entropy and information in genes, predict the\nsecondary structure of ribozymes, and detect the covariation between residues\nin folded proteins. We also review applications to molecular sequence and\nstructure analysis, and introduce new tools in the characterization of\nresistance mutations, and in drug design.",
    "authors": [
      "Christoph Adami"
    ],
    "publication_date": "2004-05-05T20:52:48Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0405004v1",
    "download_url": "http://arxiv.org/abs/q-bio/0405004v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular causality in the advent of foundation models",
    "abstract": "Correlation is not causation. As simple as this widely agreed-upon statement\nmay seem, scientifically defining causality and using it to drive our modern\nbiomedical research is immensely challenging. In this perspective, we attempt\nto synergise the partly disparate fields of systems biology, causal reasoning,\nand machine learning, to inform future approaches in the field of systems\nbiology and molecular networks.",
    "authors": [
      "Sebastian Lobentanzer",
      "Pablo Rodriguez-Mier",
      "Stefan Bauer",
      "Julio Saez-Rodriguez"
    ],
    "publication_date": "2024-01-17T19:25:04Z",
    "arxiv_id": "http://arxiv.org/abs/2401.09558v1",
    "download_url": "http://arxiv.org/abs/2401.09558v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Erwin Schroedinger, Francis Crick and epigenetic stability",
    "abstract": "Schroedinger's book 'What is Life?' is widely credited for having played a\ncrucial role in development of molecular and cellular biology. My essay\nrevisits the issues raised by this book from the modern perspective of\nepigenetics and systems biology. I contrast two classes of potential mechanisms\nof epigenetic stability: 'epigenetic templating' and 'systems biology'\napproaches, and consider them from the point of view expressed by Schroedinger.\nI also discuss how quantum entanglement, a nonclassical feature of quantum\nmechanics, can help to address the 'problem of small numbers' that lead\nSchroedinger to promote the idea of molecular code-script for explanation of\nstability of biological order.",
    "authors": [
      "Vasily Ogryzko"
    ],
    "publication_date": "2007-04-30T17:35:02Z",
    "arxiv_id": "http://arxiv.org/abs/0704.3957v2",
    "download_url": "http://arxiv.org/abs/0704.3957v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reproducibility and scientific interpretation in the age of AI:\n  consilience in biological systematics, ecology, and molecular biology",
    "abstract": "Achieving complete reproducibility in science, particularly in research\nfields such as biodiversity, is challenging due to analytical choices, bias and\ninterpretation. Here, we examine examples of reproducibility in biological\nsystematics, ecology, and molecular biology. To mitigate the impact of\ninterpretation and analytical choices, Artificial Intelligence (AI) has\nprovided potential tools. In the present work, while emphasizing the need for\nmethodological rigor and transparency, we acknowledge the role of\ninterpretation in activities such as coding biological characters and detecting\nmorphological patterns in nature. We explore the opportunities and limitations\nassociated with the synergy between big data and AI in molecular biology,\nemphasizing the need for a more comprehensive and integrated approach based on\ndataset quality and usefulness. We conclude by advocating for AI-based tools to\nassist biologists, reinforcing consilience as a criterion for scientific\nvalidity without hindering scientific progress.",
    "authors": [
      "Charles Morphy D. Santos",
      "Luciana Campos Paulino",
      "Michaella P. Andrade",
      "Gabriel Tognella-Poccia",
      "João Paulo Gois"
    ],
    "publication_date": "2025-07-25T16:43:40Z",
    "arxiv_id": "http://arxiv.org/abs/2507.22942v1",
    "download_url": "http://arxiv.org/abs/2507.22942v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deciphering cell signaling rewiring in human disorders",
    "abstract": "The knowledge of cell molecular mechanisms implicated in human diseases is\nexpanding and should be converted into guidelines for deciphering pathological\ncell signaling and suggesting appropriate treatment. The basic assumption is\nthat during a pathological transformation, the cell does not create new\nsignaling mechanisms, but rather it hijacks the existing molecular programs.\nThis affects not only intracellular functions, but also a crosstalk between\ndifferent cell types resulting in a new, yet pathological status of the system.\nThere is a certain combination of molecular characteristics dictating specific\ncell signaling states that sustains the pathological disease status.\nIdentifying and manipulating the key molecular players controlling these cell\nsignaling states, and shifting the pathological status toward the desired\nhealthy phenotype, are the major challenge for molecular biology of human\ndiseases.",
    "authors": [
      "Inna Kuperstein"
    ],
    "publication_date": "2015-12-16T16:26:35Z",
    "arxiv_id": "http://arxiv.org/abs/1512.05234v1",
    "download_url": "http://arxiv.org/abs/1512.05234v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A central partition of molecular conformational space. I. Basic\n  structures",
    "abstract": "On the basis of empirical evidence from molecular dynamics simulations,\nmolecular conformational space can be described by means of a partition of\ncentral conical regions characterized by the dominance relations between\ncartesian coordinates. This work presents a geometric and combinatorial\ndescription of this structure.",
    "authors": [
      "Jacques Gabarro-Arpa"
    ],
    "publication_date": "2002-04-12T20:06:12Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0204035v1",
    "download_url": "http://arxiv.org/abs/physics/0204035v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Heterogeneous anomalous transport in cellular and molecular biology",
    "abstract": "It is well established that a wide variety of phenomena in cellular and\nmolecular biology involve anomalous transport e.g. the statistics for the\nmotility of cells and molecules are fractional and do not conform to the\narchetypes of simple diffusion or ballistic transport. Recent research\ndemonstrates that anomalous transport is in many cases heterogeneous in both\ntime and space. Thus single anomalous exponents and single generalized\ndiffusion coefficients are unable to satisfactorily describe many crucial\nphenomena in cellular and molecular biology. We consider advances in the field\nof heterogeneous anomalous transport (HAT) highlighting: experimental\ntechniques (single molecule methods, microscopy, image analysis, fluorescence\ncorrelation spectroscopy, inelastic neutron scattering, and NMR), theoretical\ntools for data analysis (robust statistical methods such as first passage\nprobabilities, survival analysis, different varieties of mean square\ndisplacements, etc), analytic theory and generative theoretical models based on\nsimulations. Special emphasis is made on high throughput analysis techniques\nbased on machine learning and neural networks. Furthermore, we consider\nanomalous transport in the context of microrheology and the heterogeneous\nviscoelasticity of complex fluids. HAT in the wavefronts of reaction-diffusion\nsystems is also considered since it plays an important role in morphogenesis\nand signalling. In addition, we present specific examples from cellular biology\nincluding embryonic cells, leukocytes, cancer cells, bacterial cells, bacterial\nbiofilms, and eukaryotic microorganisms. Case studies from molecular biology\ninclude DNA, membranes, endosomal transport, endoplasmic reticula, mucins,\nglobular proteins, and amyloids.",
    "authors": [
      "Thomas A. Waigh",
      "Nickolay Korabel"
    ],
    "publication_date": "2023-10-15T21:00:19Z",
    "arxiv_id": "http://arxiv.org/abs/2310.09950v1",
    "download_url": "http://arxiv.org/abs/2310.09950v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The IBEX Knowledge-Base: Achieving more together with open science",
    "abstract": "Iterative Bleaching Extends multipleXity (IBEX) is a versatile method for\nhighly multiplexed imaging of diverse tissues. Based on open science\nprinciples, we created the IBEX Knowledge-Base, a resource for reagents,\nprotocols and more, to empower innovation.",
    "authors": [
      "Andrea J. Radtke",
      "Ifeanyichukwu Anidi",
      "Leanne Arakkal",
      "Armando Arroyo-Mejias",
      "Rebecca T. Beuschel",
      "Katy Borner",
      "Colin J. Chu",
      "Beatrice Clark",
      "Menna R. Clatworthy",
      "Jake Colautti",
      "Joshua Croteau",
      "Saven Denha",
      "Rose Dever",
      "Walderez O. Dutra",
      "Sonja Fritzsche",
      "Spencer Fullam",
      "Michael Y. Gerner",
      "Anita Gola",
      "Kenneth J. Gollob",
      "Jonathan M. Hernandez",
      "Jyh Liang Hor",
      "Hiroshi Ichise",
      "Zhixin Jing",
      "Danny Jonigk",
      "Evelyn Kandov",
      "Wolfgang Kastenmueller",
      "Joshua F. E. Koenig",
      "Aanandita Kothurkar",
      "Alexandra Y. Kreins",
      "Ian Lamborn",
      "Yuri Lin",
      "Katia Luciano Pereira Morais",
      "Aleksandra Lunich",
      "Jean C. S. Luz",
      "Ryan B. MacDonald",
      "Chen Makranz",
      "Vivien I. Maltez",
      "Ryan V. Moriaty",
      "Juan M. Ocampo-Godinez",
      "Vitoria M. Olyntho",
      "Kartika Padhan",
      "Kirsten Remmert",
      "Nathan Richoz",
      "Edward C. Schrom",
      "Wanjing Shang",
      "Lihong Shi",
      "Rochelle M. Shih",
      "Emily Speranza",
      "Salome Stierli",
      "Sarah A. Teichmann",
      "Tibor Z. Veres",
      "Megan Vierhout",
      "Brianna T. Wachter",
      "Adam K. Wade-Vallance",
      "Margaret Williams",
      "Nathan Zangger",
      "Ronald N. Germain",
      "Ziv Yaniv"
    ],
    "publication_date": "2024-07-26T19:35:20Z",
    "arxiv_id": "http://arxiv.org/abs/2407.19059v1",
    "download_url": "http://arxiv.org/abs/2407.19059v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integral feedback in synthetic biology: Negative-equilibrium catastrophe",
    "abstract": "A central goal of synthetic biology is the design of molecular controllers\nthat can manipulate the dynamics of intracellular networks in a stable and\naccurate manner. To address the fact that detailed knowledge about\nintracellular networks is unavailable, integral-feedback controllers (IFCs)\nhave been put forward for controlling molecular abundances. These controllers\ncan maintain accuracy in spite of the uncertainties in the controlled networks.\nHowever, this desirable feature is achieved only if stability is also\nmaintained. In this paper, we show that molecular IFCs can suffer from a\nhazardous instability called negative-equilibrium catastrophe (NEC), whereby\nall nonnegative equilibria vanish under the action of the controllers, and some\nof the molecular abundances blow up. We show that unimolecular IFCs do not\nexist due to a NEC. We then derive a family of bimolecular IFCs that are\nsafeguarded against NECs when uncertain unimolecular networks, with any number\nof molecular species, are controlled. However, when IFCs are applied on\nuncertain bimolecular (and hence most intracellular) networks, we show that\npreventing NECs generally becomes an intractable problem as the number of\ninteracting molecular species increases.",
    "authors": [
      "Tomislav Plesa",
      "Alex Dack",
      "Thomas E. Ouldridge"
    ],
    "publication_date": "2021-02-21T19:28:43Z",
    "arxiv_id": "http://arxiv.org/abs/2102.10668v3",
    "download_url": "http://arxiv.org/abs/2102.10668v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Group testing problems in experimental molecular biology",
    "abstract": "In group testing, the task is to determine the distinguished members of a set\nof objects L by asking subset queries of the form ``does the subset Q of L\ncontain a distinguished object?'' The primary biological application of group\ntesting is for screening libraries of clones with hybridization probes. This is\na crucial step in constructing physical maps and for finding genes. Group\ntesting has also been considered for sequencing by hybridization. Another\nimportant application includes screening libraries of reagents for useful\nchemically active zones. This preliminary report discusses some of the\nconstrained group testing problems which arise in biology.",
    "authors": [
      "Emanuel Knill",
      "S. Muthukrishnan"
    ],
    "publication_date": "1995-05-04T00:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/math/9505211v1",
    "download_url": "http://arxiv.org/abs/math/9505211v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Parameter inference and model selection in signaling pathway models",
    "abstract": "To support and guide an extensive experimental research into systems biology\nof signaling pathways, increasingly more mechanistic models are being developed\nwith hopes of gaining further insight into biological processes. In order to\nanalyse these models, computational and statistical techniques are needed to\nestimate the unknown kinetic parameters. This chapter reviews methods from\nfrequentist and Bayesian statistics for estimation of parameters and for\nchoosing which model is best for modeling the underlying system. Approximate\nBayesian Computation (ABC) techniques are introduced and employed to explore\ndifferent hypothesis about the JAK-STAT signaling pathway.",
    "authors": [
      "Tina Toni",
      "Michael P. H. Stumpf"
    ],
    "publication_date": "2009-05-27T16:35:40Z",
    "arxiv_id": "http://arxiv.org/abs/0905.4468v1",
    "download_url": "http://arxiv.org/abs/0905.4468v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information theory and adaptation",
    "abstract": "In this Chapter, we ask questions (1) What is the right way to measure the\nquality of information processing in a biological system? and (2) What can\nreal-life organisms do in order to improve their performance in\ninformation-processing tasks? We then review the body of work that investigates\nthese questions experimentally, computationally, and theoretically in\nbiological domains as diverse as cell biology, population biology, and\ncomputational neuroscience",
    "authors": [
      "Ilya Nemenman"
    ],
    "publication_date": "2010-11-24T19:49:58Z",
    "arxiv_id": "http://arxiv.org/abs/1011.5466v1",
    "download_url": "http://arxiv.org/abs/1011.5466v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal relations in the self-assembly of proteins and RNA",
    "abstract": "Concepts rooted in physics are becoming increasingly important in biology as\nwe transition to an era in which quantitative descriptions of all processes\nfrom molecular to cellular level are needed. In this essay I discuss two\nunexpected findings of universal behavior, uncommon in biology, in the\nself-assembly of proteins and RNA. These findings, which are surprising, reveal\nthat physics ideas applied to biological problems ranging from folding to gene\nexpression to cellular movement and communication between cells might lead to\ndiscovery of universal principles operating in adoptable living systems.",
    "authors": [
      "D. Thirumalai"
    ],
    "publication_date": "2014-06-29T10:32:20Z",
    "arxiv_id": "http://arxiv.org/abs/1406.7485v1",
    "download_url": "http://arxiv.org/abs/1406.7485v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Identification of Key Proteins Involved in Axon Guidance Related\n  Disorders: A Systems Biology Approach",
    "abstract": "Axon guidance is a crucial process for growth of the central and peripheral\nnervous systems. In this study, 3 axon guidance related disorders, namely-\nDuane Retraction Syndrome (DRS) , Horizontal Gaze Palsy with Progressive\nScoliosis (HGPPS) and Congenital fibrosis of the extraocular muscles type 3\n(CFEOM3) were studied using various Systems Biology tools to identify the genes\nand proteins involved with them to get a better idea about the underlying\nmolecular mechanisms including the regulatory mechanisms. Based on the analyses\ncarried out, 7 significant modules have been identified from the PPI network.\nFive pathways/processes have been found to be significantly associated with\nDRS, HGPPS and CFEOM3 associated genes. From the PPI network, 3 have been\nidentified as hub proteins- DRD2, UBC and CUL3.",
    "authors": [
      "Ishtiaque Ahammad"
    ],
    "publication_date": "2018-04-17T18:22:45Z",
    "arxiv_id": "http://arxiv.org/abs/1805.01011v1",
    "download_url": "http://arxiv.org/abs/1805.01011v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deciphering neural circuits for Caenorhabditis elegans behavior by\n  computations and perturbations to genome and connectome",
    "abstract": "{\\it Caenorhabditis elegans} nematode worms are the only animals with the\nknown detailed neural connectivity diagram, well characterized genomics, and\nrelatively simple quantifiable behavioral output. With this in mind, many\nresearchers view this animal as the best candidate for a systems biology\napproach, where one can integrate molecular and cellular knowledge to gain\nglobal understanding of worm's behavior. This work reviews some research in\nthis direction, emphasizing computational perspective, and points out some\nsuccesses and challenges to meet this lofty goal.",
    "authors": [
      "Jan Karbowski"
    ],
    "publication_date": "2019-10-16T16:17:33Z",
    "arxiv_id": "http://arxiv.org/abs/1910.07451v1",
    "download_url": "http://arxiv.org/abs/1910.07451v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How to address cellular heterogeneity by distribution biology",
    "abstract": "Cellular heterogeneity is an immanent property of biological systems that\ncovers very different aspects of life ranging from genetic diversity to\ncell-to-cell variability driven by stochastic molecular interactions, and noise\ninduced cell differentiation. Here, we review recent developments in\ncharacterizing cellular heterogeneity by distributions and argue that\nunderstanding multicellular life requires the analysis of heterogeneity\ndynamics at single cell resolution by integrative approaches that combine\nmethods from non-equilibrium statistical physics, information theory and omics\nbiology.",
    "authors": [
      "Niko Komin",
      "Alexander Skupin"
    ],
    "publication_date": "2021-09-13T16:46:58Z",
    "arxiv_id": "http://arxiv.org/abs/2109.06691v1",
    "download_url": "http://arxiv.org/abs/2109.06691v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Opportunities in deep learning methods development for computational\n  biology",
    "abstract": "Advances in molecular technologies underlie an enormous growth in the size of\ndata sets pertaining to biology and biomedicine. These advances parallel those\nin the deep learning subfield of machine learning. Components in the\ndifferentiable programming toolbox that makes deep learning possible are\nallowing computer scientists to address an increasingly large array of problems\nwith flexible and effective tools. However many of these tools have not fully\nproliferated into the computational biology and bioinformatics fields. In this\nperspective we survey some of these advances and highlight exemplary examples\nof their utilization in the biosciences, with the goal of increasing awareness\namong practitioners of emerging opportunities to blend expert knowledge with\nnewly emerging deep learning architectural tools.",
    "authors": [
      "Alex Jihun Lee",
      "Reza Abbasi-Asl"
    ],
    "publication_date": "2024-06-12T22:58:45Z",
    "arxiv_id": "http://arxiv.org/abs/2406.08686v1",
    "download_url": "http://arxiv.org/abs/2406.08686v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Computing for Molecular Biology",
    "abstract": "Molecular biology and biochemistry interpret microscopic processes in the\nliving world in terms of molecular structures and their interactions, which are\nquantum mechanical by their very nature. Whereas the theoretical foundations of\nthese interactions are very well established, the computational solution of the\nrelevant quantum mechanical equations is very hard. However, much of molecular\nfunction in biology can be understood in terms of classical mechanics, where\nthe interactions of electrons and nuclei have been mapped onto effective\nclassical surrogate potentials that model the interaction of atoms or even\nlarger entities. The simple mathematical structure of these potentials offers\nhuge computational advantages; however, this comes at the cost that all quantum\ncorrelations and the rigorous many-particle nature of the interactions are\nomitted. In this work, we discuss how quantum computation may advance the\npractical usefulness of the quantum foundations of molecular biology by\noffering computational advantages for simulations of biomolecules. We not only\ndiscuss typical quantum mechanical problems of the electronic structure of\nbiomolecules in this context, but also consider the dominating classical\nproblems (such as protein folding and drug design) as well as data-driven\napproaches of bioinformatics and the degree to which they might become amenable\nto quantum simulation and quantum computation.",
    "authors": [
      "Alberto Baiardi",
      "Matthias Christandl",
      "Markus Reiher"
    ],
    "publication_date": "2022-12-23T09:23:04Z",
    "arxiv_id": "http://arxiv.org/abs/2212.12220v2",
    "download_url": "http://arxiv.org/abs/2212.12220v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Physics to Biology by Extending Criticality and Symmetry Breakings",
    "abstract": "Symmetries play a major role in physics, in particular since the work by E.\nNoether and H. Weyl in the first half of last century. Herein, we briefly\nreview their role by recalling how symmetry changes allow to conceptually move\nfrom classical to relativistic and quantum physics. We then introduce our\nongoing theoretical analysis in biology and show that symmetries play a\nradically different role in this discipline, when compared to those in current\nphysics. By this comparison, we stress that symmetries must be understood in\nrelation to conservation and stability properties, as represented in the\ntheories. We posit that the dynamics of biological organisms, in their various\nlevels of organization, are not \"just\" processes, but permanent (extended, in\nour terminology) critical transitions and, thus, symmetry changes. Within the\nlimits of a relative structural stability (or interval of viability),\nvariability is at the core of these transitions.",
    "authors": [
      "Giuseppe Longo",
      "Maël Montévil"
    ],
    "publication_date": "2011-03-09T17:08:48Z",
    "arxiv_id": "http://arxiv.org/abs/1103.1833v2",
    "download_url": "http://arxiv.org/abs/1103.1833v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The challenges of purely mechanistic models in biology and the minimum\n  need for a 'mechanism-plus-X' framework",
    "abstract": "Ever since the advent of molecular biology in the 1970s, mechanical models\nhave become the dogma in the field, where a \"true\" understanding of any subject\nis equated to a mechanistic description. This has been to the detriment of the\nbiomedical sciences, where, barring some exceptions, notable new feats of\nunderstanding have arguably not been achieved in normal and disease biology,\nincluding neurodegenerative disease and cancer pathobiology. I argue for a\n\"mechanism-plus-X\" paradigm, where mainstay elements of mechanistic models such\nas hierarchy and correlation are combined with nomological principles such as\ngeneral operative rules and generative principles. Depending on the question at\nhand and the nature of the inquiry, X could range from proven physical laws to\nspeculative biological generalizations, such as the notional principle of\ncellular synchrony. I argue that the \"mechanism-plus-X\" approach should\nultimately aim to move biological inquiries out of the deadlock of\noft-encountered mechanistic pitfalls and reposition biology to its former\ncapacity of illuminating fundamental truths about the world.",
    "authors": [
      "Sepehr Ehsani"
    ],
    "publication_date": "2019-05-27T00:56:00Z",
    "arxiv_id": "http://arxiv.org/abs/1905.10916v1",
    "download_url": "http://arxiv.org/abs/1905.10916v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Practical Resources for Enhancing the Reproducibility of Mechanistic\n  Modeling in Systems Biology",
    "abstract": "Although reproducibility is a core tenet of the scientific method, it remains\nchallenging to reproduce many results. Surprisingly, this also holds true for\ncomputational results in domains such as systems biology where there have been\nextensive standardization efforts. For example, Tiwari et al. recently found\nthat they could only repeat 50% of published simulation results in systems\nbiology. Toward improving the reproducibility of computational systems\nresearch, we identified several resources that investigators can leverage to\nmake their research more accessible, executable, and comprehensible by others.\nIn particular, we identified several domain standards and curation services, as\nwell as powerful approaches pioneered by the software engineering industry that\nwe believe many investigators could adopt. Together, we believe these\napproaches could substantially enhance the reproducibility of systems biology\nresearch. In turn, we believe enhanced reproducibility would accelerate the\ndevelopment of more sophisticated models that could inform precision medicine\nand synthetic biology.",
    "authors": [
      "Michael L. Blinov",
      "John H. Gennari",
      "Jonathan R. Karr",
      "Ion I. Moraru",
      "David P. Nickerson",
      "Herbert M. Sauro"
    ],
    "publication_date": "2021-04-09T21:09:27Z",
    "arxiv_id": "http://arxiv.org/abs/2104.04604v1",
    "download_url": "http://arxiv.org/abs/2104.04604v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Foundations of a Compositional Systems Biology",
    "abstract": "Composition is a powerful principle for systems biology, focused on the\ninterfaces, interconnections, and orchestration of distributed processes to\nenable integrative multiscale simulations. Whereas traditional models focus on\nthe structure or dynamics of specific subsystems in controlled conditions,\ncompositional systems biology aims to connect these models, asking critical\nquestions about the space between models: What variables should a submodel\nexpose through its interface? How do coupled models connect and translate\nacross scales? How do domain-specific models connect across biological and\nphysical disciplines to drive the synthesis of new knowledge? This approach\nrequires robust software to integrate diverse datasets and submodels, providing\nresearchers with tools to flexibly recombine, iteratively refine, and\ncollaboratively expand their models. This article offers a comprehensive\nframework to support this vision, including: a conceptual and graphical\nframework to define interfaces and composition patterns; standardized schemas\nthat facilitate modular data and model assembly; biological templates that\nintegrate detailed submodels that connect molecular processes to the emergence\nof the cellular interface; and user-friendly software interfaces that empower\nresearch communities to construct and improve multiscale models of cellular\nsystems. By addressing these needs, compositional systems biology will foster a\nunified and scalable approach to understanding complex cellular systems.",
    "authors": [
      "Eran Agmon"
    ],
    "publication_date": "2024-08-01T22:17:51Z",
    "arxiv_id": "http://arxiv.org/abs/2408.00942v2",
    "download_url": "http://arxiv.org/abs/2408.00942v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "LLMs Outperform Experts on Challenging Biology Benchmarks",
    "abstract": "This study systematically evaluates 27 frontier Large Language Models on\neight biology benchmarks spanning molecular biology, genetics, cloning,\nvirology, and biosecurity. Models from major AI developers released between\nNovember 2022 and April 2025 were assessed through ten independent runs per\nbenchmark. The findings reveal dramatic improvements in biological\ncapabilities. Top model performance increased more than 4-fold on the\nchallenging text-only subset of the Virology Capabilities Test over the study\nperiod, with OpenAI's o3 now performing twice as well as expert virologists.\nSeveral models now match or exceed expert-level performance on other\nchallenging benchmarks, including the biology subsets of GPQA and WMDP and\nLAB-Bench CloningScenarios. Contrary to expectations, chain-of-thought did not\nsubstantially improve performance over zero-shot evaluation, while extended\nreasoning features in o3-mini and Claude 3.7 Sonnet typically improved\nperformance as predicted by inference scaling. Benchmarks such as PubMedQA and\nthe MMLU and WMDP biology subsets exhibited performance plateaus well below\n100%, suggesting benchmark saturation and errors in the underlying benchmark\ndata. The analysis highlights the need for more sophisticated evaluation\nmethodologies as AI systems continue to advance.",
    "authors": [
      "Lennart Justen"
    ],
    "publication_date": "2025-05-09T15:05:57Z",
    "arxiv_id": "http://arxiv.org/abs/2505.06108v3",
    "download_url": "http://arxiv.org/abs/2505.06108v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrostatic correlations: from Plasma to Biology",
    "abstract": "Electrostatic correlations play an important role in physics, chemistry and\nbiology. In plasmas they lead to thermodynamic instability similar to the\nliquid-gas phase transition of simple molecular fluids. For charged colloidal\nsuspensions the electrostatic correlations are responsible for screening and\ncolloidal charge renormalization. In aqueous solutions containing multivalent\ncounterions they can lead to charge inversion and flocculation. In biological\nsystems the correlations account for the organization of cytoskeleton and the\ncompaction of genetic material. In spite of their ubiquity, the true importance\nof electrostatic correlations has become fully appreciated only quite recently.\nIn this paper, I will review the thermodynamic consequences of electrostatic\ncorrelations in a variety of systems ranging from classical plasmas to\nmolecular biology.",
    "authors": [
      "Yan Levin"
    ],
    "publication_date": "2002-07-02T21:57:09Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0207086v4",
    "download_url": "http://arxiv.org/abs/cond-mat/0207086v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]