[
  {
    "title": "The new classes of the genetic algorithms are defined by nonassociative\n  groupoids",
    "abstract": "The genetic product of the groupoids, originating in the theory of DNA\nrecombination, is introduced. It permits a natural generalization of the\nclassical genetic algorithm. The full characterization of all three-element\ngenetic groupoids gives an approach to construct the new classes of genetic\nalgorithms. In the conclusion, we formulate some open problems in the theory of\nthe genetic groupoids.",
    "authors": [
      "S. Sverchkov"
    ],
    "publication_date": "2012-09-21T15:44:19Z",
    "arxiv_id": "http://arxiv.org/abs/1209.4847v1",
    "download_url": "http://arxiv.org/abs/1209.4847v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Routes for breaching and protecting genetic privacy",
    "abstract": "We are entering the era of ubiquitous genetic information for research,\nclinical care, and personal curiosity. Sharing these datasets is vital for\nrapid progress in understanding the genetic basis of human diseases. However,\none growing concern is the ability to protect the genetic privacy of the data\noriginators. Here, we technically map threats to genetic privacy and discuss\npotential mitigation strategies for privacy-preserving dissemination of genetic\ndata.",
    "authors": [
      "Yaniv Erlich",
      "Arvind Narayanan"
    ],
    "publication_date": "2013-10-11T17:02:54Z",
    "arxiv_id": "http://arxiv.org/abs/1310.3197v1",
    "download_url": "http://arxiv.org/abs/1310.3197v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding and predicting synthetic lethal genetic interactions in\n  Saccharomyces cerevisiae using domain genetic interactions",
    "abstract": "Genetic interactions have been widely used to define functional relationships\nbetween proteins and pathways. In this study, we demonstrated that yeast\nsynthetic lethal genetic interactions can be explained by the genetic\ninteractions between domains of those proteins. The domain genetic interactions\nrarely overlap with the domain physical interactions from iPfam database and\nprovide a complementary view about domain relationships. Moreover, we found\nthat domains in multidomain yeast proteins contribute to their genetic\ninteractions differently. The domain genetic interactions help more precisely\ndefine the function related to the synthetic lethal genetic interactions, and\nthen help understand how domains contribute to different functionalities of\nmultidomain proteins. Using the probabilities of domain genetic interactions,\nwe were able to predict novel yeast synthetic lethal genetic interactions.\nFurthermore, we had also identified novel compensatory pathways from the\npredicted synthetic lethal genetic interactions. Our study significantly\nimproved the understanding of yeast mulitdomain proteins, the synthetic lethal\ngenetic interactions and the functional relationships between proteins and\npathways.",
    "authors": [
      "Bo Li",
      "Weiguo Cao",
      "Jizhong Zhou",
      "Feng Luo"
    ],
    "publication_date": "2011-01-06T18:52:47Z",
    "arxiv_id": "http://arxiv.org/abs/1101.1273v2",
    "download_url": "http://arxiv.org/abs/1101.1273v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic similarity versus genetic ancestry groups as sample descriptors\n  in human genetics",
    "abstract": "A common sample descriptor in human genomics studies is that of 'genetic\nancestry group', with terms such as 'European genetic ancestry' or 'East Asian\ngenetic ancestry' frequently used in publications to describe the genetics of\ngroups of individuals based on the analysis of their genotypes. In this\nPerspective, I argue that these terms are imprecise and potentially misleading\nand that, for most applications, simple statements of genetic similarity\nrepresent a more accurate description.",
    "authors": [
      "Graham Coop"
    ],
    "publication_date": "2022-07-23T20:22:48Z",
    "arxiv_id": "http://arxiv.org/abs/2207.11595v2",
    "download_url": "http://arxiv.org/abs/2207.11595v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Algorithm for Solving Simple Mathematical Equality Problem",
    "abstract": "This paper explains genetic algorithm for novice in this field. Basic\nphilosophy of genetic algorithm and its flowchart are described. Step by step\nnumerical computation of genetic algorithm for solving simple mathematical\nequality problem will be briefly explained",
    "authors": [
      "Denny Hermawanto"
    ],
    "publication_date": "2013-08-16T04:36:03Z",
    "arxiv_id": "http://arxiv.org/abs/1308.4675v2",
    "download_url": "http://arxiv.org/abs/1308.4675v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An investigation into the application of genetic programming to\n  combinatorial game theory",
    "abstract": "Genetic programming is the practice of evolving formulas using crossover and\nmutation of genes representing functional operations. Motivated by genetic\nevolution we develop and solve two combinatorial games, and we demonstrate some\nadvantages and pitfalls of using genetic programming to investigate Grundy\nvalues. We conclude by investigating a combinatorial game whose ruleset and\nstarting positions are inspired by genetic structures.",
    "authors": [
      "Melissa A. Huggan",
      "Craig Tennenhouse"
    ],
    "publication_date": "2021-01-31T16:06:16Z",
    "arxiv_id": "http://arxiv.org/abs/2102.00476v1",
    "download_url": "http://arxiv.org/abs/2102.00476v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spectrum of genetic diversity and networks of clonal organisms",
    "abstract": "Clonal organisms present a particular challenge in population genetics\nbecause, in addition to the possible existence of replicates of the same\ngenotype in a given sample, some of the hypotheses and concepts underlying\nclassical population genetics models are irreconcilable with clonality. The\ngenetic structure and diversity of clonal populations was examined using a\ncombination of new tools to analyze microsatellite data in the marine\nangiosperm Posidonia oceanica. These tools were based on examination of the\nfrequency distribution of the genetic distance among ramets, termed the\nspectrum of genetic diversity (GDS), and of networks built on the basis of\npairwise genetic distances among genets. The properties and topology of\nnetworks based on genetic distances showed a \"small-world\" topology,\ncharacterized by a high degree of connectivity among nodes, and a substantial\namount of substructure, revealing organization in sub-families of closely\nrelated individuals.\n  Keywords: genetic networks; small-world networks; genetic diversity; clonal\norganisms",
    "authors": [
      "Alejandro F. Rozenfeld",
      "Sophie Arnaud-Haond",
      "Emilio Hernandez-Garcia",
      "Victor M. Eguiluz",
      "Manuel A. Matias",
      "Ester Serrao",
      "Carlos M. Duarte"
    ],
    "publication_date": "2006-05-30T17:28:17Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0605050v2",
    "download_url": "http://arxiv.org/abs/q-bio/0605050v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Does your gene need a background check? How genetic background impacts\n  the analysis of mutations, genes, and evolution",
    "abstract": "The premise of genetic analysis is that a causal link exists between\nphenotypic and allelic variation. Yet it has long been documented that mutant\nphenotypes are not a simple result of a single DNA lesion, but rather are due\nto interactions of the focal allele with other genes and the environment.\nAlthough an experimentally rigorous approach, focusing on individual mutations\nand isogenic control strains, has facilitated amazing progress within genetics\nand related fields, a glimpse back suggests that a vast complexity has been\nomitted from our current understanding of allelic effects. Armed with\ntraditional genetic analyses and the foundational knowledge they have provided,\nwe argue that the time and tools are ripe to return to the under-explored\naspects of gene function and embrace the context-dependent nature of genetic\neffects. We assert that a broad understanding of genetic effects and the\nevolutionary dynamics of alleles requires identifying how mutational outcomes\ndepend upon the wild-type genetic background. Furthermore, we discuss how best\nto exploit genetic background effects to broaden genetic research programs.",
    "authors": [
      "Chris H. Chandler",
      "Sudarshan Chari",
      "Ian Dworkin"
    ],
    "publication_date": "2013-01-12T15:59:35Z",
    "arxiv_id": "http://arxiv.org/abs/1301.2694v1",
    "download_url": "http://arxiv.org/abs/1301.2694v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Does Non-Genetic Heterogeneity Facilitate the Development of Genetic\n  Drug Resistance?",
    "abstract": "Non-genetic forms of antimicrobial drug resistance can result from\ncell-to-cell variability that is not encoded in the genetic material. Data from\nrecent studies also suggest that non-genetic mechanisms can facilitate the\ndevelopment of genetic drug resistance. In this Perspective article, we\nspeculate on how the interplay between non-genetic and genetic mechanisms may\naffect microbial adaptation and evolution during drug treatment. We argue that\ncellular heterogeneity arising from fluctuations in gene expression, epigenetic\nmodifications, as well as genetic changes contributes to drug resistance at\ndifferent timescales, and that the interplay between these mechanisms may\ninfluence the evolutionary dynamics of pathogen resistance. Accordingly,\ndeveloping a better understanding of non-genetic mechanisms in drug resistance\nand how they interact with genetic mechanisms will enhance our ability to\ncombat antimicrobial resistance.",
    "authors": [
      "Kevin S. Farquhar",
      "Samira Rasouli Koohi",
      "Daniel A. Charlebois"
    ],
    "publication_date": "2021-02-05T16:31:58Z",
    "arxiv_id": "http://arxiv.org/abs/2102.03276v1",
    "download_url": "http://arxiv.org/abs/2102.03276v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Regression-based Approach to Robust Estimation and Inference for\n  Genetic Covariance",
    "abstract": "Genome-wide association studies (GWAS) have identified thousands of genetic\nvariants associated with complex traits, and some variants are shown to be\nassociated with multiple complex traits. Genetic covariance between two traits\nis defined as the underlying covariance of genetic effects and can be used to\nmeasure the shared genetic architecture. The data used to estimate such a\ngenetic covariance can be from the same group or different groups of\nindividuals, and the traits can be of different types or collected based on\ndifferent study designs. This paper proposes a unified regression-based\napproach to robust estimation and inference for genetic covariance of general\ntraits that may be associated with genetic variants nonlinearly. The asymptotic\nproperties of the proposed estimator are provided and are shown to be robust\nunder certain model mis-specification. Our method under linear working models\nprovides a robust inference for the narrow-sense genetic covariance, even when\nboth linear models are mis-specified. Numerical experiments are performed to\nsupport the theoretical results. Our method is applied to an outbred mice GWAS\ndata set to study the overlapping genetic effects between the behavioral and\nphysiological phenotypes. The real data results reveal interesting genetic\ncovariance among different mice developmental traits.",
    "authors": [
      "Jianqiao Wang",
      "Sai Li",
      "Hongzhe Li"
    ],
    "publication_date": "2021-06-08T05:11:06Z",
    "arxiv_id": "http://arxiv.org/abs/2106.04106v2",
    "download_url": "http://arxiv.org/abs/2106.04106v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "GemTools: A fast and efficient approach to estimating genetic ancestry",
    "abstract": "To uncover the genetic basis of complex disease, individuals are often\nmeasured at a large number of genetic variants (usually SNPs) across the\ngenome. GemTools provides computationally efficient tools for modeling genetic\nancestry based on SNP genotypes. The main algorithm creates an eigenmap based\non genetic similarities, and then clusters subjects based on their map\nposition. This process is continued iteratively until each cluster is\nrelatively homogeneous. For genetic association studies, GemTools matches cases\nand controls based on genetic similarity.",
    "authors": [
      "Lambertus Klei",
      "Brian P. Kent",
      "Nadine Melhem",
      "Bernie Devlin",
      "Kathryn Roeder"
    ],
    "publication_date": "2011-04-06T18:23:22Z",
    "arxiv_id": "http://arxiv.org/abs/1104.1162v1",
    "download_url": "http://arxiv.org/abs/1104.1162v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Misspecification in mixed-model based association analysis",
    "abstract": "Additive genetic variance in natural populations is commonly estimated using\nmixed models, in which the covariance of the genetic effects is modeled by a\ngenetic similarity matrix derived from a dense set of markers. An important but\nusually implicit assumption is that the presence of any non-additive genetic\neffect only increases the residual variance, and does not affect estimates of\nadditive genetic variance. Here we show that this is only true for panels of\nunrelated individuals. In case there is genetic relatedness, the combination of\npopulation structure and epistatic interactions can lead to inflated estimates\nof additive genetic variance.",
    "authors": [
      "Willem Kruijer"
    ],
    "publication_date": "2015-09-08T06:55:03Z",
    "arxiv_id": "http://arxiv.org/abs/1509.02261v1",
    "download_url": "http://arxiv.org/abs/1509.02261v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparison of REML methods for the study of phenome-wide genetic\n  variation",
    "abstract": "It is now well documented that genetic covariance between functionally\nrelated traits leads to an uneven distribution of genetic variation across\nmultivariate trait combinations, and possibly a large part of phenotype-space\nthat is inaccessible to evolution. How the size of this nearly-null genetic\nspace translates to the broader phenome level is unknown. High dimensional\nphenotype data to address these questions are now within reach, however,\nincorporating these data into genetic analyses remains a challenge. Multi-trait\ngenetic analyses, of more than a handful of traits, are slow and often fail to\nconverge when fit with REML. This makes it challenging to estimate the genetic\ncovariance ($\\mathbf{G}$) underlying thousands of traits, let alone study its\nproperties. We present a previously proposed REML algorithm that is feasible\nfor high dimensional genetic studies in the specific setting of a balanced\nnested half-sib design, common of quantitative genetics. We show that it\nsubstantially outperforms other common approaches when the number of traits is\nlarge, and we use it to investigate the bias in estimated eigenvalues of\n$\\mathbf{G}$ and the size of the nearly-null genetic subspace. We show that the\nhigh-dimensional biases observed are qualitatively similar to those\nsubstantiated by asymptotic approximation in a simpler setting of a sample\ncovariance matrix based on i.i.d. vector observation, and that interpreting the\nestimated size of the nearly-null genetic subspace requires considerable\ncaution in high-dimensional studies of genetic variation. Our results provide\nthe foundation for future research characterizing the asymptotic approximation\nof estimated genetic eigenvalues, and a statistical null distribution for\nphenome-wide studies of genetic variation.",
    "authors": [
      "Damian Pavlyshyn",
      "Iain M. Johnstone",
      "Jacqueline L. Sztepanacz"
    ],
    "publication_date": "2022-10-21T03:39:51Z",
    "arxiv_id": "http://arxiv.org/abs/2210.11709v1",
    "download_url": "http://arxiv.org/abs/2210.11709v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Matrix genetics, part 2: the degeneracy of the genetic code and the\n  octave algebra with two quasi-real units (the genetic octave\n  Yin-Yang-algebra)",
    "abstract": "Algebraic properties of the genetic code are analyzed. The investigations of\nthe genetic code on the basis of matrix approaches (\"matrix genetics\") are\ndescribed. The degeneracy of the vertebrate mitochondria genetic code is\nreflected in the black-and-white mosaic of the (8*8)-matrix of 64 triplets, 20\namino acids and stop-signals. This mosaic genetic matrix is connected with the\nmatrix form of presentation of the special 8-dimensional Yin-Yang-algebra and\nof its particular 4-dimensional case. The special algorithm, which is based on\nfeatures of genetic molecules, exists to transform the mosaic genomatrix into\nthe matrices of these algebras. Two new numeric systems are defined by these\n8-dimensional and 4-dimensional algebras: genetic Yin-Yang-octaves and genetic\ntetrions. Their comparison with quaternions by Hamilton is presented. Elements\nof new \"genovector calculation\" and ideas of \"genetic mechanics\" are discussed.\nThese algebras are considered as models of the genetic code and as its possible\npre-code basis. They are related with binary oppositions of the Yin-Yang type\nand they give new opportunities to investigate evolution of the genetic code.\nThe revealed fact of the relation between the genetic code and these genetic\nalgebras is discussed in connection with the idea by Pythagoras: \"All things\nare numbers\". Simultaneously these genetic algebras can be utilized as the\nalgebras of genetic operators in biological organisms. The described results\nare related with the problem of algebraization of bioinformatics. They take\nattention to the question: what is life from the viewpoint of algebra?",
    "authors": [
      "Sergey V. Petoukhov"
    ],
    "publication_date": "2008-03-23T16:35:42Z",
    "arxiv_id": "http://arxiv.org/abs/0803.3330v2",
    "download_url": "http://arxiv.org/abs/0803.3330v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Semiparametric efficient estimation of genetic relatedness with machine\n  learning methods",
    "abstract": "In this paper, we propose semiparametric efficient estimators of genetic\nrelatedness between two traits in a model-free framework. Most existing methods\nrequire specifying certain parametric models involving the traits and genetic\nvariants. However, the bias due to model misspecification may yield misleading\nstatistical results. Moreover, the semiparametric efficient bounds for\nestimators of genetic relatedness are still lacking. In this paper, we develop\nsemiparametric efficient estimators with machine learning methods and construct\nvalid confidence intervals for two important measures of genetic relatedness:\ngenetic covariance and genetic correlation, allowing both continuous and\ndiscrete responses. Based on the derived efficient influence functions of\ngenetic relatedness, we propose a consistent estimator of the genetic\ncovariance as long as one of genetic values is consistently estimated. The data\nof two traits may be collected from the same group or different groups of\nindividuals. Various numerical studies are performed to illustrate our\nintroduced procedures. We also apply proposed procedures to analyze Carworth\nFarms White mice genome-wide association study data.",
    "authors": [
      "Xu Guo",
      "Yiyuan Qian",
      "Hongwei Shi",
      "Weichao Yang",
      "Niwen Zhou"
    ],
    "publication_date": "2023-04-04T14:58:20Z",
    "arxiv_id": "http://arxiv.org/abs/2304.01849v2",
    "download_url": "http://arxiv.org/abs/2304.01849v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Participation bias in the estimation of heritability and genetic\n  correlation",
    "abstract": "It is increasingly recognized that participation bias can pose problems for\ngenetic studies. Recently, to overcome the challenge that genetic information\nof non-participants is unavailable, it is shown that by comparing the IBD\n(identity by descent) shared and not-shared segments among the participants,\none can estimate the genetic component underlying participation. That, however,\ndoes not directly address how to adjust estimates of heritability and genetic\ncorrelation for phenotypes correlated with participation. Here, for phenotypes\nwhose mean differences between population and sample are known, we demonstrate\na way to do so by adopting a statistical framework that separates out the\ngenetic and non-genetic correlations between participation and these\nphenotypes. Crucially, our method avoids making the assumption that the effect\nof the genetic component underlying participation is manifested entirely\nthrough these other phenotypes. Applying the method to 12 UK Biobank\nphenotypes, we found 8 have significant genetic correlations with\nparticipation, including body mass index, educational attainment, and smoking\nstatus. For most of these phenotypes, without adjustments, estimates of\nheritability and the absolute value of genetic correlation would have\nunderestimation biases.",
    "authors": [
      "Shuang Song",
      "Stefania Benonisdottir",
      "Jun S. Liu",
      "Augustine Kong"
    ],
    "publication_date": "2024-05-29T12:58:57Z",
    "arxiv_id": "http://arxiv.org/abs/2405.19058v3",
    "download_url": "http://arxiv.org/abs/2405.19058v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Expectile Neural Networks for Genetic Data Analysis of Complex Diseases",
    "abstract": "The genetic etiologies of common diseases are highly complex and\nheterogeneous. Classic statistical methods, such as linear regression, have\nsuccessfully identified numerous genetic variants associated with complex\ndiseases. Nonetheless, for most complex diseases, the identified variants only\naccount for a small proportion of heritability. Challenges remain to discover\nadditional variants contributing to complex diseases. Expectile regression is a\ngeneralization of linear regression and provides completed information on the\nconditional distribution of a phenotype of interest. While expectile regression\nhas many nice properties and holds great promise for genetic data analyses\n(e.g., investigating genetic variants predisposing to a high-risk population),\nit has been rarely used in genetic research. In this paper, we develop an\nexpectile neural network (ENN) method for genetic data analyses of complex\ndiseases. Similar to expectile regression, ENN provides a comprehensive view of\nrelationships between genetic variants and disease phenotypes and can be used\nto discover genetic variants predisposing to sub-populations (e.g., high-risk\ngroups). We further integrate the idea of neural networks into ENN, making it\ncapable of capturing non-linear and non-additive genetic effects (e.g.,\ngene-gene interactions). Through simulations, we showed that the proposed\nmethod outperformed an existing expectile regression when there exist complex\nrelationships between genetic variants and disease phenotypes. We also applied\nthe proposed method to the genetic data from the Study of Addiction: Genetics\nand Environment(SAGE), investigating the relationships of candidate genes with\nsmoking quantity.",
    "authors": [
      "Jinghang Lin",
      "Xiaoran Tong",
      "Chenxi Li",
      "Qing Lu"
    ],
    "publication_date": "2020-10-26T21:07:40Z",
    "arxiv_id": "http://arxiv.org/abs/2010.13898v1",
    "download_url": "http://arxiv.org/abs/2010.13898v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolution of Genetic Redundancy : The Relevance of Complexity in\n  Genotype-Phenotype Mapping",
    "abstract": "Genetic redundancy is ubiquitous and can be found in any organism. However,\nit has been argued that genetic redundancy reduces total population fitness,\nand therefore, redundancy is unlikely to evolve. In this letter, we study an\nevolutionary model with high-dimensional genotype-phenotype mapping (GPM) to\ninvestigate the relevance of complexity in GPM to the evolution of genetic\nredundancy. By applying the replica method to deal with quenched randomness,\nthe redundancy dependence of the fitness is analytically obtained, which\ndemonstrates that genetic redundancy can indeed evolve, provided that the GPM\nis complex. Our result provides a novel insight into how genetic redundancy\nevolves.",
    "authors": [
      "Nen Saito",
      "Shuji Ishihara",
      "Kunihiko Kaneko"
    ],
    "publication_date": "2013-02-09T14:09:21Z",
    "arxiv_id": "http://arxiv.org/abs/1302.2234v1",
    "download_url": "http://arxiv.org/abs/1302.2234v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Novel Genetic Algorithm using Helper Objectives for the 0-1 Knapsack\n  Problem",
    "abstract": "The 0-1 knapsack problem is a well-known combinatorial optimisation problem.\nApproximation algorithms have been designed for solving it and they return\nprovably good solutions within polynomial time. On the other hand, genetic\nalgorithms are well suited for solving the knapsack problem and they find\nreasonably good solutions quickly. A naturally arising question is whether\ngenetic algorithms are able to find solutions as good as approximation\nalgorithms do. This paper presents a novel multi-objective optimisation genetic\nalgorithm for solving the 0-1 knapsack problem. Experiment results show that\nthe new algorithm outperforms its rivals, the greedy algorithm, mixed strategy\ngenetic algorithm, and greedy algorithm + mixed strategy genetic algorithm.",
    "authors": [
      "Jun He",
      "Feidun He",
      "Hongbin Dong"
    ],
    "publication_date": "2014-04-03T11:46:42Z",
    "arxiv_id": "http://arxiv.org/abs/1404.0868v1",
    "download_url": "http://arxiv.org/abs/1404.0868v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stability of Underdominant Genetic Polymorphisms in Population Networks",
    "abstract": "Heterozygote disadvantage is potentially a potent driver of population\ngenetic divergence. Also referred to as underdominance, this phenomena\ndescribes a situation where a genetic heterozygote has a lower overall fitness\nthan either homozygote. Attention so far has mostly been given to\nunderdominance within a single population and the maintenance of genetic\ndifferences between two populations exchanging migrants. Here we explore the\ndynamics of an underdominant system in a network of multiple discrete, yet\ninterconnected, populations. Stability of genetic differences in response to\nincreases in migration in various topological networks is assessed. The network\ntopology can have a dominant and occasionally non-intuitive influence on the\ngenetic stability of the system.",
    "authors": [
      "Áki J. Láruson",
      "Floyd A. Reed"
    ],
    "publication_date": "2015-09-07T22:00:56Z",
    "arxiv_id": "http://arxiv.org/abs/1509.02205v2",
    "download_url": "http://arxiv.org/abs/1509.02205v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Positional Cartesian Genetic Programming",
    "abstract": "Cartesian Genetic Programming (CGP) has many modifications across a variety\nof implementations, such as recursive connections and node weights. Alternative\ngenetic operators have also been proposed for CGP, but have not been fully\nstudied. In this work, we present a new form of genetic programming based on a\nfloating point representation. In this new form of CGP, called Positional CGP,\nnode positions are evolved. This allows for the evaluation of many different\ngenetic operators while allowing for previous CGP improvements like recurrency.\nUsing nine benchmark problems from three different classes, we evaluate the\noptimal parameters for CGP and PCGP, including novel genetic operators.",
    "authors": [
      "DG Wilson",
      "Julian F. Miller",
      "Sylvain Cussat-Blanc",
      "Hervé Luga"
    ],
    "publication_date": "2018-10-09T16:49:04Z",
    "arxiv_id": "http://arxiv.org/abs/1810.04119v1",
    "download_url": "http://arxiv.org/abs/1810.04119v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "System-Level Genetic Codes Using a Transposable Element-Like Mechanism\n  with Applications to Cancer",
    "abstract": "A system-level genetic code is a hypothetical genetic code that exclusively\nor preferentially codes systems of interacting coadapted parts. System-level\ngenetic codes differ from part-level genetic codes in which each discrete part\nis coded independently. In general, a system-level genetic code requires coding\ndiscrete interacting parts such as organs or proteins in an interdependent way.\nChanging a single symbol or \"gene\" in a system-level genetic code affects two\nor more parts in a coordinated way. System-level genetic codes provide a\nplausible mechanism for evolution by leaps also known as systemic\nmacromutations or hopeful monsters without invoking an intelligent agent,\nvitalistic forces, or new laws of physics. A system-level genetic code may\nexplain the rapid appearance of new forms of life in the fossil record such as\nthe Cambrian Explosion in which most invertebrate phyla appeared. A\nsystem-level genetic code may explain the origin of complex integrative systems\nof tightly coadapted proteins such as the blood coagulation cascade in which\nthe removal or structural modification of any single part breaks the system. It\nis demonstrated that a simple system-level genetic code can, in principle, be\nimplemented using biochemical mechanisms similar or identical to the mechanisms\nused by transposable elements, regulation of gene expression, and the adaptive\nvertebrate immune system. It is further suggested that cancer in the body and\nboth normal and tumor cell lines cultured in vitro are caused by mutations of\nthe system-level genetic code. An explanation why multi-cellular organisms\nretain the ability to revert to uni-cellularity and thus a tendency to develop\ncancer is presented.",
    "authors": [
      "John F. McGowan"
    ],
    "publication_date": "2000-03-29T02:14:05Z",
    "arxiv_id": "http://arxiv.org/abs/nlin/0003059v1",
    "download_url": "http://arxiv.org/abs/nlin/0003059v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic information and quantum gas",
    "abstract": "Possible explanation of the 64/20 redundancy of the triplet genetic code\nbased on the assumption of quantum nature of genetic information is proposed.",
    "authors": [
      "M. V. Altaisky",
      "F. P. Filatov"
    ],
    "publication_date": "2001-06-22T09:46:51Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0106123v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0106123v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolution of the genetic code. Emergence of stop codons",
    "abstract": "What could cause the emergence of non-encoding codons in the course of\nevolution of the genetic code? Hypothesis of evolution of the genetic code from\nGC to the AGUC-alphabet account for existence of stop codons.",
    "authors": [
      "Denis A. Semenov"
    ],
    "publication_date": "2007-10-31T09:29:26Z",
    "arxiv_id": "http://arxiv.org/abs/0710.5825v1",
    "download_url": "http://arxiv.org/abs/0710.5825v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Mathematical Model Accounting for the Organisation in Multiplets of\n  the Genetic Code",
    "abstract": "Requiring stability of genetic code against translation errors, modelised by\nsuitable mathematical operators in the crystal basis model of the genetic code,\nthe main features of the organisation in multiplets of the mitochondrial and of\nthe standard genetic code are explained.",
    "authors": [
      "A. Sciarrino"
    ],
    "publication_date": "2001-02-21T18:35:59Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0102022v1",
    "download_url": "http://arxiv.org/abs/math-ph/0102022v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolution of the genetic code from the GC- to the AGUC-alphabet",
    "abstract": "A hypothesis of the evolution of the genetic code is proposed, the leading\nmechanism of which is the nucleotide spontaneous damage leading to\nAT-enrichment of the genome. The hypothesis accounts for stability of the\ngenetic code towards point mutations, the presence of code dialects, and the\nsymmetry of the genetic code table.",
    "authors": [
      "Denis A. Semenov"
    ],
    "publication_date": "2007-10-02T07:18:04Z",
    "arxiv_id": "http://arxiv.org/abs/0710.0445v1",
    "download_url": "http://arxiv.org/abs/0710.0445v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The degeneracy of the genetic code and Hadamard matrices",
    "abstract": "The matrix form of the presentation of the genetic code is described as the\ncognitive form to analyze structures of the genetic code. A similar matrix form\nis utilized in the theory of signal processing. The Kronecker family of the\ngenetic matrices is investigated, which is based on the genetic matrix [C A; U\nG], where C, A, U, G are the letters of the genetic alphabet. This matrix in\nthe third Kronecker power is the (8*8)-matrix, which contains 64 triplets.\nPeculiarities of the degeneracy of the vertebrate mitochondria genetic code are\nreflected in the symmetrical black-and-white mosaic of this genetic\n(8*8)-matrix. This mosaic matrix is connected algorithmically with Hadamard\nmatrices unexpectedly, which are famous in the theory of signal processing,\nspectral analysis, quantum mechanics and quantum computers. A special\ndecomposition of numeric genetic matrices reveals their close relations with a\nfamily of 8-dimensional hypercomplex numbers (not Cayley's octonions). Some\nhypothesis and thoughts are formulated on the basis of these phenomenological\nfacts.",
    "authors": [
      "Sergey V. Petoukhov"
    ],
    "publication_date": "2008-02-22T19:17:58Z",
    "arxiv_id": "http://arxiv.org/abs/0802.3366v4",
    "download_url": "http://arxiv.org/abs/0802.3366v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Spectral Graph Approach to Discovering Genetic Ancestry",
    "abstract": "Mapping human genetic variation is fundamentally interesting in fields such\nas anthropology and forensic inference. At the same time patterns of genetic\ndiversity confound efforts to determine the genetic basis of complex disease.\nDue to technological advances it is now possible to measure hundreds of\nthousands of genetic variants per individual across the genome. Principal\ncomponent analysis (PCA) is routinely used to summarize the genetic similarity\nbetween subjects. The eigenvectors are interpreted as dimensions of ancestry.\nWe build on this idea using a spectral graph approach. In the process we draw\non connections between multidimensional scaling and spectral kernel methods.\nOur approach, based on a spectral embedding derived from the normalized\nLaplacian of a graph, can produce more meaningful delineation of ancestry than\nby using PCA. The method is stable to outliers and can more easily incorporate\ndifferent similarity measures of genetic data than PCA. We illustrate a new\nalgorithm for genetic clustering and association analysis on a large,\ngenetically heterogeneous sample.",
    "authors": [
      "Ann B. Lee",
      "Diana Luca",
      "Kathryn Roeder"
    ],
    "publication_date": "2009-08-17T18:30:55Z",
    "arxiv_id": "http://arxiv.org/abs/0908.2409v1",
    "download_url": "http://arxiv.org/abs/0908.2409v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic draft, selective interference, and population genetics of rapid\n  adaptation",
    "abstract": "To learn about the past from a sample of genomic sequences, one needs to\nunderstand how evolutionary processes shape genetic diversity. Most population\ngenetic inference is based on frameworks assuming adaptive evolution is rare.\nBut if positive selection operates on many loci simultaneously, as has recently\nbeen suggested for many species including animals such as flies, a different\napproach is necessary. In this review, I discuss recent progress in\ncharacterizing and understanding evolution in rapidly adapting populations\nwhere random associations of mutations with genetic backgrounds of different\nfitness, i.e., genetic draft, dominate over genetic drift. As a result, neutral\ngenetic diversity depends weakly on population size, but strongly on the rate\nof adaptation or more generally the variance in fitness. Coalescent processes\nwith multiple mergers, rather than Kingman's coalescent, are appropriate\ngenealogical models for rapidly adapting populations with important\nimplications for population genetic inference.",
    "authors": [
      "Richard A. Neher"
    ],
    "publication_date": "2013-02-05T18:39:07Z",
    "arxiv_id": "http://arxiv.org/abs/1302.1148v1",
    "download_url": "http://arxiv.org/abs/1302.1148v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Variations of Genetic Algorithms",
    "abstract": "The goal of this project is to develop the Genetic Algorithms (GA) for\nsolving the Schaffer F6 function in fewer than 4000 function evaluations on a\ntotal of 30 runs. Four types of Genetic Algorithms (GA) are presented -\nGenerational GA (GGA), Steady-State (mu+1)-GA (SSGA), Steady-Generational\n(mu,mu)-GA (SGGA), and (mu+mu)-GA.",
    "authors": [
      "Alison Jenkins",
      "Vinika Gupta",
      "Alexis Myrick",
      "Mary Lenoir"
    ],
    "publication_date": "2019-11-01T17:57:03Z",
    "arxiv_id": "http://arxiv.org/abs/1911.00490v1",
    "download_url": "http://arxiv.org/abs/1911.00490v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dismantling a dogma: the inflated significance of neutral genetic\n  diversity in conservation genetics",
    "abstract": "The current rate of species extinction is rapidly approaching unprecedented\nhighs and life on Earth presently faces a sixth mass extinction event driven by\nanthropogenic activity, climate change and ecological collapse. The field of\nconservation genetics aims at preserving species by using their levels of\ngenetic diversity, usually measured as neutral genome-wide diversity, as a\nbarometer for evaluating population health and extinction risk. A fundamental\nassumption is that higher levels of genetic diversity lead to an increase in\nfitness and long-term survival of a species. Here, we argue against the\nperceived importance of neutral genetic diversity for the conservation of wild\npopulations and species. We demonstrate that no simple general relationship\nexists between neutral genetic diversity and the risk of species extinction.\nInstead, a better understanding of the properties of functional genetic\ndiversity, demographic history, and ecological relationships, is necessary for\ndeveloping and implementing effective conservation genetic strategies.",
    "authors": [
      "João C Teixeira",
      "Christian D Huber"
    ],
    "publication_date": "2020-07-06T07:35:29Z",
    "arxiv_id": "http://arxiv.org/abs/2007.02569v1",
    "download_url": "http://arxiv.org/abs/2007.02569v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic heterogeneity analysis using genetic algorithm and network\n  science",
    "abstract": "Through genome-wide association studies (GWAS), disease susceptible genetic\nvariables can be identified by comparing the genetic data of individuals with\nand without a specific disease. However, the discovery of these associations\nposes a significant challenge due to genetic heterogeneity and feature\ninteractions. Genetic variables intertwined with these effects often exhibit\nlower effect-size, and thus can be difficult to be detected using machine\nlearning feature selection methods. To address these challenges, this paper\nintroduces a novel feature selection mechanism for GWAS, named Feature\nCo-selection Network (FCSNet). FCS-Net is designed to extract heterogeneous\nsubsets of genetic variables from a network constructed from multiple\nindependent feature selection runs based on a genetic algorithm (GA), an\nevolutionary learning algorithm. We employ a non-linear machine learning\nalgorithm to detect feature interaction. We introduce the Community Risk Score\n(CRS), a synthetic feature designed to quantify the collective disease\nassociation of each variable subset. Our experiment showcases the effectiveness\nof the utilized GA-based feature selection method in identifying feature\ninteractions through synthetic data analysis. Furthermore, we apply our novel\napproach to a case-control colorectal cancer GWAS dataset. The resulting\nsynthetic features are then used to explain the genetic heterogeneity in an\nadditional case-only GWAS dataset.",
    "authors": [
      "Zhendong Sha",
      "Yuanzhu Chen",
      "Ting Hu"
    ],
    "publication_date": "2023-08-12T01:28:26Z",
    "arxiv_id": "http://arxiv.org/abs/2308.06429v1",
    "download_url": "http://arxiv.org/abs/2308.06429v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic load makes cancer cells more sensitive to common drugs: evidence\n  from Cancer Cell Line Encyclopedia",
    "abstract": "Genetic alterations initiate tumors and enable the evolution of drug\nresistance. The pro-cancer view of mutations is however incomplete, and several\nstudies show that mutational load can reduce tumor fitness. Given its negative\neffect, genetic load should make tumors more sensitive to anticancer drugs.\nHere, we test this hypothesis across all major types of cancer from the Cancer\nCell Line Encyclopedia, which provides genetic and expression data of 496 cell\nlines together with their response to 24 common anticancer drugs. We found that\nthe efficacy of 9 out of 24 drugs showed significant association with genetic\nload in a pan-cancer analysis. The associations for some tissue-drug\ncombinations were remarkably strong, with genetic load explaining up to 83% of\nthe variance in the drug response. Overall, the role of genetic load depended\non both the drug and the tissue type with 10 tissues being particularly\nvulnerable to genetic load. We also identified changes in gene expression\nassociated with increased genetic load, which included cell-cycle checkpoints,\nDNA damage and apoptosis. Our results show that genetic load is an important\ncomponent of tumor fitness and can predict drug sensitivity. Beyond being a\nbiomarker, genetic load might be a new, unexplored vulnerability of cancer.",
    "authors": [
      "Ana B. Pavel",
      "Kirill S. Korolev"
    ],
    "publication_date": "2017-05-16T21:02:48Z",
    "arxiv_id": "http://arxiv.org/abs/1705.05921v1",
    "download_url": "http://arxiv.org/abs/1705.05921v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic evolution of a multi-generational population in the context of\n  interstellar space travels -- Part I: Genetic evolution under the neutral\n  selection hypothesis",
    "abstract": "We updated the agent based Monte Carlo code HERITAGE that simulates human\nevolution within restrictive environments such as interstellar, sub-light speed\nspacecraft in order to include the effects of population genetics. We\nincorporated a simplified -- yet representative -- model of the whole human\ngenome with 46 chromosomes (23 pairs), containing 2110 building blocks that\nsimulate genetic elements (loci). Each individual is endowed with his/her own\ndiploid genome. Each locus can take 10 different allelic (mutated) forms that\ncan be investigated. To mimic gamete production (sperm and eggs) in human\nindividuals, we simulate the meiosis process including crossing-over and\nunilateral conversions of chromosomal sequences. Mutation of the genetic\ninformation from cosmic ray bombardments is also included. In this first paper\nof a series of two, we use the neutral hypothesis: mutations (genetic changes)\nhave only neutral phenotypic effects (physical manifestations), implying no\nnatural selection on variations. We will relax this assumption in the second\npaper. Under such hypothesis, we demonstrate how the genetic patrimony of\nmulti-generational crews can be affected by genetic drift and mutations. It\nappears that centuries-long deep space travels have small but unavoidable\neffects on the genetic composition/diversity of the traveling populations that\nherald substantial genetic differentiation on longer time-scales if the annual\nequivalent dose of cosmic ray radiation is similar to the Earth radioactivity\nbackground at sea level. For larger doses, genomes in the final populations can\ndeviate more strongly with significant genetic differentiation that arises\nwithin centuries.",
    "authors": [
      "F. Marin",
      "C. Beluffi",
      "F. Fischer"
    ],
    "publication_date": "2021-02-02T14:22:40Z",
    "arxiv_id": "http://arxiv.org/abs/2102.01508v1",
    "download_url": "http://arxiv.org/abs/2102.01508v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mendelian randomization with fine-mapped genetic data: choosing from\n  large numbers of correlated instrumental variables",
    "abstract": "Mendelian randomization uses genetic variants to make causal inferences about\nthe effect of a risk factor on an outcome. With fine-mapped genetic data, there\nmay be hundreds of genetic variants in a single gene region any of which could\nbe used to assess this causal relationship. However, using too many genetic\nvariants in the analysis can lead to spurious estimates and inflated Type 1\nerror rates. But if only a few genetic variants are used, then the majority of\nthe data is ignored and estimates are highly sensitive to the particular choice\nof variants. We propose an approach based on summarized data only (genetic\nassociation and correlation estimates) that uses principal components analysis\nto form instruments. This approach has desirable theoretical properties: it\ntakes the totality of data into account and does not suffer from numerical\ninstabilities. It also has good properties in simulation studies: it is not\nparticularly sensitive to varying the genetic variants included in the analysis\nor the genetic correlation matrix, and it does not have greatly inflated Type 1\nerror rates. Overall, the method gives estimates that are not so precise as\nthose from variable selection approaches (such as using a conditional analysis\nor pruning approach to select variants), but are more robust to seemingly\narbitrary choices in the variable selection step. Methods are illustrated by an\nexample using genetic associations with testosterone for 320 genetic variants\nto assess the effect of sex hormone-related pathways on coronary artery disease\nrisk, in which variable selection approaches give inconsistent inferences.",
    "authors": [
      "Stephen Burgess",
      "Verena Zuber",
      "Elsa Valdes-Marquez",
      "Benjamin B Sun",
      "Jemma C Hopewell"
    ],
    "publication_date": "2017-07-07T15:07:06Z",
    "arxiv_id": "http://arxiv.org/abs/1707.02215v1",
    "download_url": "http://arxiv.org/abs/1707.02215v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rare-Event Sampling Analysis Uncovers the Fitness Landscape of the\n  Genetic Code",
    "abstract": "The genetic code refers to a rule that maps 64 codons to 20 amino acids.\nNearly all organisms, with few exceptions, share the same genetic code, the\nstandard genetic code (SGC). While it remains unclear why this universal code\nhas arisen and been maintained during evolution, it may have been preserved\nunder selection pressure. Theoretical studies comparing the SGC and numerically\ncreated hypothetical random genetic codes have suggested that the SGC has been\nsubject to strong selection pressure for being robust against translation\nerrors. However, these prior studies have searched for random genetic codes in\nonly a small subspace of the possible code space due to limitations in\ncomputation time. Thus, how the genetic code has evolved, and the\ncharacteristics of the genetic code fitness landscape, remain unclear. By\napplying multicanonical Monte Carlo, an efficient rare-event sampling method,\nwe efficiently sampled random codes from a much broader random ensemble of\ngenetic codes than in previous studies, estimating that only one out of every\n$10^{20}$ random codes is more robust than the SGC. This estimate is\nsignificantly smaller than the previous estimate, one in a million. We also\ncharacterized the fitness landscape of the genetic code that has four major\nfitness peaks, one of which includes the SGC. Furthermore, genetic algorithm\nanalysis revealed that evolution under such a multi-peaked fitness landscape\ncould be strongly biased toward a narrow peak, in an evolutionary\npath-dependent manner.",
    "authors": [
      "Yuji Omachi",
      "Nen Saito",
      "Chikara Furusawa"
    ],
    "publication_date": "2022-10-18T08:08:45Z",
    "arxiv_id": "http://arxiv.org/abs/2210.09666v1",
    "download_url": "http://arxiv.org/abs/2210.09666v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Alternative Cracking of The Genetic Code",
    "abstract": "We Propose 22 unique Solutions to the Genetic Code. An Alternative Cracking,\nfrom the Perspective of a Mathematician.",
    "authors": [
      "O. Babatunde Okunoye"
    ],
    "publication_date": "2009-01-31T10:40:06Z",
    "arxiv_id": "http://arxiv.org/abs/0902.0056v1",
    "download_url": "http://arxiv.org/abs/0902.0056v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Matrix genetics, part 5: genetic projection operators and direct sums",
    "abstract": "The article is devoted to phenomena of symmetries and algebras in matrix\npresentations of the genetic code. The Kronecker family of the genetic matrices\nis investigated, which is based on the alphabetical matrix [C A; U G], where C,\nA, U, G are the letters of the genetic alphabet. The matrix P=[C A; U G] in the\nthird Kronecker power is the (8*8)-matrix, which contains 64 triplets.\nPeculiarities of the degeneracy of the genetic code are reflected in the\nsymmetrical black-and-white mosaic of this genetic (8*8)-matrix of 64 triplets.\nPhenomena of connections of this mosaic matrix (and many other genetic\nmatrices) with projection operators are revealed. Taking into account an\nimportant role of projection operators in quantum mechanics, theory of digital\ncodes, computer science, logic and in many other fields of applied mathematics,\nwe study algebraic properties and biological meanings of these phenomena. Using\nof notions and formalisms of theory of finite-dimensional vector spaces in\nbioinformatics and theoretical biology is proposed on the bases of the\ndescribed results.",
    "authors": [
      "Sergey V. Petoukhov"
    ],
    "publication_date": "2010-05-18T05:54:43Z",
    "arxiv_id": "http://arxiv.org/abs/1005.5101v1",
    "download_url": "http://arxiv.org/abs/1005.5101v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Phenotypic robustness can increase phenotypic variability after\n  non-genetic perturbations in gene regulatory circuits",
    "abstract": "Non-genetic perturbations, such as environmental change or developmental\nnoise, can induce novel phenotypes. If an induced phenotype confers a fitness\nadvantage, selection may promote its genetic stabilization. Non-genetic\nperturbations can thus initiate evolutionary innovation. Genetic variation that\nis not usually phenotypically visible may play an important role in this\nprocess. Populations under stabilizing selection on a phenotype that is robust\nto mutations can accumulate such variation. After non-genetic perturbations,\nthis variation can become a source of new phenotypes. We here study the\nrelationship between a phenotype's robustness to mutations and a population's\npotential to generate novel phenotypic variation. To this end, we use a\nwell-studied model of transcriptional regulation circuits. Such circuits are\nimportant in many evolutionary innovations. We find that phenotypic robustness\npromotes phenotypic variability in response to non-genetic perturbations, but\nnot in response to mutation. Our work suggests that non-genetic perturbations\nmay initiate innovation more frequently in mutationally robust gene expression\ntraits.",
    "authors": [
      "Carlos Espinosa-Soto",
      "Olivier C. Martin",
      "Andreas Wagner"
    ],
    "publication_date": "2010-10-02T22:35:27Z",
    "arxiv_id": "http://arxiv.org/abs/1010.0370v1",
    "download_url": "http://arxiv.org/abs/1010.0370v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Expansion under climate change: the genetic consequences",
    "abstract": "Range expansion and range shifts are crucial population responses to climate\nchange. Genetic consequences are not well understood but are clearly coupled to\necological dynamics that, in turn, are driven by shifting climate conditions.\nWe model a population with a deterministic reaction-- diffusion model coupled\nto a heterogeneous environment that develops in time due to climate change. We\ndecompose the resulting travelling wave solution into neutral genetic\ncomponents to analyse the spatio-temporal dynamics of its genetic structure.\nOur analysis shows that range expansions and range shifts under slow climate\nchange preserve genetic diversity. This is because slow climate change creates\nrange boundaries that promote spatial mixing of genetic components.\nMathematically , the mixing leads to so-called pushed travelling wave\nsolutions. This mixing phenomenon is not seen in spatially homogeneous\nenvironments, where range expansion reduces genetic diversity through gene\nsurfing arising from pulled travelling wave solutions. However, the\npreservation of diversity is diminished when climate change occurs too quickly.\nUsing diversity indices, we show that fast expansions and range shifts erode\ngenetic diversity more than slow range expansions and range shifts. Our study\nprovides analytical insight into the dynamics of travelling wave solutions in\nheterogeneous environments.",
    "authors": [
      "Jimmy Garnier",
      "Mark Lewis"
    ],
    "publication_date": "2016-09-27T14:39:42Z",
    "arxiv_id": "http://arxiv.org/abs/1609.08611v1",
    "download_url": "http://arxiv.org/abs/1609.08611v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Semi-Supervised Generative Adversarial Network for Prediction of\n  Genetic Disease Outcomes",
    "abstract": "For most diseases, building large databases of labeled genetic data is an\nexpensive and time-demanding task. To address this, we introduce genetic\nGenerative Adversarial Networks (gGAN), a semi-supervised approach based on an\ninnovative GAN architecture to create large synthetic genetic data sets\nstarting with a small amount of labeled data and a large amount of unlabeled\ndata. Our goal is to determine the propensity of a new individual to develop\nthe severe form of the illness from their genetic profile alone. The proposed\nmodel achieved satisfactory results using real genetic data from different\ndatasets and populations, in which the test populations may not have the same\ngenetic profiles. The proposed model is self-aware and capable of determining\nwhether a new genetic profile has enough compatibility with the data on which\nthe network was trained and is thus suitable for prediction. The code and\ndatasets used can be found at https://github.com/caio-davi/gGAN.",
    "authors": [
      "Caio Davi",
      "Ulisses Braga-Neto"
    ],
    "publication_date": "2020-07-02T15:35:14Z",
    "arxiv_id": "http://arxiv.org/abs/2007.01200v1",
    "download_url": "http://arxiv.org/abs/2007.01200v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Principles and Policy Recommendations for Comprehensive Genetic Data\n  Governance",
    "abstract": "Genetic data collection has become ubiquitous, producing genetic information\nabout health, ancestry, and social traits. However, unregulated use, especially\namid evolving scientific understanding, poses serious privacy and\ndiscrimination risks. These risks are intensified by advancing AI, particularly\nmulti-modal systems integrating genetic, clinical, behavioral, and\nenvironmental data. In this work, we organize the uses of genetic data along\nfour distinct \"pillars\", and develop a risk assessment framework that\nidentifies key values any governance system must preserve. In doing so, we draw\non current privacy scholarship concerning contextual integrity, data\nrelationality, and the Belmont principle. We apply the framework to four\nreal-world case studies and identify critical gaps in existing regulatory\nframeworks and specific threats to privacy and personal liberties, particularly\nthrough genetic discrimination. Finally, we offer three policy recommendations\nfor genetic data governance that safeguard individual rights in today's\nunder-regulated ecosystem of large-scale genetic data collection and usage.",
    "authors": [
      "Vivek Ramanan",
      "Ria Vinod",
      "Cole Williams",
      "Sohini Ramachandran",
      "Suresh Venkatasubramanian"
    ],
    "publication_date": "2025-02-13T19:05:10Z",
    "arxiv_id": "http://arxiv.org/abs/2502.09716v2",
    "download_url": "http://arxiv.org/abs/2502.09716v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Matrix genetics, part 4: cyclic changes of the genetic 8-dimensional\n  Yin-Yang-algebras and the algebraic models of physiological cycles",
    "abstract": "The article continues an analysis of the genetic 8-dimensional\nYin-Yang-algebra. This algebra was revealed in a course of matrix researches of\nstructures of the genetic code and it was described in the author's articles\narXiv:0803.3330 and arXiv:0805.4692. The article presents data about many kinds\nof cyclic permutations of elements of the genetic code in the genetic\n(8x8)-matrix [C A; U G](3) of 64 triplets, where C, A, U, G are letters of the\ngenetic alphabet. These cyclic permutations lead to such reorganizations of the\nmatrix form of presentation of the initial genetic Yin-Yang-algebra that arisen\nmatrices serve as matrix forms of presentations of new Yin-Yang-algebras as\nwell. They are connected algorithmically with Hadamard matrices. The discovered\nexistence of a hierarchy of the cyclic changes of types of genetic\nYin-Yang-algebras allows thinking about new algebraic-genetic models of cyclic\nprocesses in inherited biological systems including models of cyclic\nmetamorphoses of animals. These cycles of changes of the genetic 8-dimensional\nalgebras and of their 8-dimensional numeric systems have many analogies with\nfamous facts and doctrines of modern and ancient physiology, medicine, etc.\nThis viewpoint proposes that the famous idea by Pythagoras (about organization\nof natural systems in accordance with harmony of numerical systems) should be\ncombined with the idea of cyclic changes of Yin-Yang-numeric systems in\nconsidered cases. This second idea reminds of the ancient idea of cyclic\nchanges in nature. From such algebraic-genetic viewpoint, the notion of\nbiological time can be considered as a factor of coordinating these\nhierarchical ensembles of cyclic changes of types of the genetic\nmulti-dimensional algebras.",
    "authors": [
      "Sergey V. Petoukhov"
    ],
    "publication_date": "2008-09-16T14:17:33Z",
    "arxiv_id": "http://arxiv.org/abs/0809.2714v1",
    "download_url": "http://arxiv.org/abs/0809.2714v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A number theoretical observation about the degeneracy of the genetic\n  code",
    "abstract": "We discuss the similarity of the degeneration structure of the genetic code\nwith a pure number theoretic -- ``divisors code.'' The most interesting thing\nabout our observation is not that there is a connection between number theory\nand the genetic code, but the simplicity of the rule. We hope that the\nobservation and the naive model presented in this paper will serve for ideas to\nother models of the degeneracy of the genetic code. Maybe, the ideas of this\narticle can also be used in the area of artificial life to syntesize artificial\ngenetic codes.",
    "authors": [
      "Andrei Khrennikov",
      "Marcus Nilsson"
    ],
    "publication_date": "2006-12-13T15:59:36Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0612022v2",
    "download_url": "http://arxiv.org/abs/q-bio/0612022v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolution of the genetic code. Why are there strong and weak letter\n  doublets? The first gene, the first protein. Early (ancient) biosynthesis of\n  protein",
    "abstract": "The idea of the evolution of the genetic code from the CG to the CGUA\nalphabet has been developed further. The assumption of the originally triplet\nstructure of the genetic code has been substantiated. The hypothesis of the\nemergence of stop codons at the early stage of the evolution of the genetic\ncode has been additionally supported. The existence of strong and weak letter\ndoublets of codons and the symmetry of strong doublets in the genetic code\ntable, discovered by Rumer, have been explained. A hypothesis concerning the\nprimary structure of the first gene and the first protein has been proposed.",
    "authors": [
      "Denis A. Semenov"
    ],
    "publication_date": "2008-04-28T09:45:38Z",
    "arxiv_id": "http://arxiv.org/abs/0804.4359v1",
    "download_url": "http://arxiv.org/abs/0804.4359v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolution of the genetic code. From the CG- to the CGUA-alphabet, from\n  RNA double helix to DNA",
    "abstract": "A hypothesis of the evolution of the genetic code is proposed, the leading\nmechanism of which is the nucleotide spontaneous damage leading to\nAT-enrichment of the genome. The hypothesis accounts for stability of the\ngenetic code towards point mutations, the presence of code dialects, emergence\nof stop codons, emergence of the DNA double helix and the symmetry of the\ngenetic code table. The assumption of the originally triplet structure of the\ngenetic code has been substantiated. A hypothesis concerning the primary\nstructure of the first gene and the first protein has been proposed.",
    "authors": [
      "Denis A. Semenov"
    ],
    "publication_date": "2008-05-05T08:57:51Z",
    "arxiv_id": "http://arxiv.org/abs/0805.0484v1",
    "download_url": "http://arxiv.org/abs/0805.0484v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Code and Number Theory",
    "abstract": "Living organisms are the most complex, interesting and significant objects\nregarding all substructures of the universe. Life science is regarded as a\nscience of the 21st century and one can expect great new discoveries in the\nnear futures. This article contains an introductory brief review of genetic\ninformation, its coding and translation of genes to proteins through the\ngenetic code. Some theoretical approaches to the modelling of the genetic code\nare presented. In particular, connection of the genetic code with number theory\nis considered and the role of $p$-adic numbers is underlined.",
    "authors": [
      "Branko Dragovich"
    ],
    "publication_date": "2009-11-20T11:09:03Z",
    "arxiv_id": "http://arxiv.org/abs/0911.4014v1",
    "download_url": "http://arxiv.org/abs/0911.4014v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computational Complexity Analysis of Simple Genetic Programming On Two\n  Problems Modeling Isolated Program Semantics",
    "abstract": "Analyzing the computational complexity of evolutionary algorithms for binary\nsearch spaces has significantly increased their theoretical understanding. With\nthis paper, we start the computational complexity analysis of genetic\nprogramming. We set up several simplified genetic programming algorithms and\nanalyze them on two separable model problems, ORDER and MAJORITY, each of which\ncaptures an important facet of typical genetic programming problems. Both\nanalyses give first rigorous insights on aspects of genetic programming design,\nhighlighting in particular the impact of accepting or rejecting neutral moves\nand the importance of a local mutation operator.",
    "authors": [
      "Greg Durrett",
      "Frank Neumann",
      "Una-May O'Reilly"
    ],
    "publication_date": "2010-07-27T08:18:52Z",
    "arxiv_id": "http://arxiv.org/abs/1007.4636v2",
    "download_url": "http://arxiv.org/abs/1007.4636v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the nature of intraspecific genetic variability: Evidence against the\n  ruling paradigm",
    "abstract": "Empirical evidence is presented which contradicts the established\ninterpretation of the intraspecific genetic variability as the adaptive\npotential of the species: the uniform evolutionary tempo across the life\nkingdom, species discreteness, and absence of correlation between genetic\nvariability and prosperity of extant species testify against the ruling\nparadigm. Consistent interpretation of the nature of intraspecific genetic\nvariability is based on recognizing the limited sensitivity of stabilising\nselection, which allows for accumulation and persistence in the population of a\nconsiderable amount of mutational substitutions, which, to some degree, erase\nthe meaningful genetic information of the species. The proposed interpretation\nalso provides solution to the inbreeding paradox in the invasive species.",
    "authors": [
      "Anastassia M. Makarieva",
      "Victor G. Gorshkov"
    ],
    "publication_date": "2011-01-03T19:00:23Z",
    "arxiv_id": "http://arxiv.org/abs/1101.0579v1",
    "download_url": "http://arxiv.org/abs/1101.0579v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Population Fitness and Genetic Load of Single Nucleotide Polymorphisms\n  Affecting mRNA splicing",
    "abstract": "Deleterious genetic variants can be evaluated as quantitative traits using\ninformation theory-based sequence analysis of recognition sites. To assess the\neffect of such variants, fitness and genetic load of SNPs which alter binding\nsite affinity are derived from changes in individual information and allele\nfrequencies. Human SNPs that alter mRNA splicing are partitioned according to\ntheir genetic load. SNPs with high genetic loads (>0.5) are common in the\ngenome and, in many instances, predicted effects are supported by gene\nexpression studies.",
    "authors": [
      "Peter Rogan",
      "Eliseos Mucaki"
    ],
    "publication_date": "2011-07-04T19:56:43Z",
    "arxiv_id": "http://arxiv.org/abs/1107.0716v1",
    "download_url": "http://arxiv.org/abs/1107.0716v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]