[
  {
    "title": "From quantum groups to genetic mutations",
    "abstract": "In the framework of the crystal basis model of the genetic code, where each codon is assigned to an irreducible representation of $U_{q \\to 0}(sl(2) \\oplus sl(2))$, single base mutation matrices are introduced. The strength of the mutation is assumed to depend on the \"distance\" between the codons. Preliminary general predictions of the model are compared with experimental data, with a satisfactory agreement.",
    "authors": [
      "Antonino Sciarrino"
    ],
    "publication_date": "2003-09-25T13:03:56Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0309056v1",
    "download_url": "https://arxiv.org/abs/math-ph/0309056v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Control of Complex Systems Using Bayesian Networks and Genetic Algorithm",
    "abstract": "A method based on Bayesian neural networks and genetic algorithm is proposed to control the fermentation process. The relationship between input and output variables is modelled using Bayesian neural network that is trained using hybrid Monte Carlo method. A feedback loop based on genetic algorithm is used to change input variables so that the output variables are as close to the desired target as possible without the loss of confidence level on the prediction that the neural network gives. The proposed procedure is found to reduce the distance between the desired target and measured outputs significantly.",
    "authors": [
      "Tshilidzi Marwala"
    ],
    "publication_date": "2007-05-09T07:08:58Z",
    "arxiv_id": "http://arxiv.org/abs/0705.1214v1",
    "download_url": "https://arxiv.org/abs/0705.1214v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic-based optimization in Fog Computing: current trends and research opportunities",
    "abstract": "Fog computing is a new computational paradigm that emerged from the need to reduce network usage and latency in the Internet of Things (IoT). Fog can be considered as a continuum between the cloud layer and IoT users that allows the execution of applications or storage/processing of data in network infrastructure devices. The heterogeneity and wider distribution of fog devices are the key differences between cloud and fog infrastructure. Genetic-based optimization is commonly used in distributed systems; however, the differentiating features of fog computing require new designs, studies, and experimentation. The growing research in the field of genetic-based fog resource optimization and the lack of previous analysis in this field have encouraged us to present a comprehensive, exhaustive, and systematic review of the most recent research works. Resource optimization techniques in fog were examined and analyzed, with special emphasis on genetic-based solutions and their characteristics and design alternatives. We defined a classification of the optimization scope in fog infrastructures and used this optimization taxonomy to classify the 70 papers in this survey. Subsequently, the papers were assessed in terms of genetic optimization design. Finally, the benefits and limitations of each surveyed work are outlined in this paper. Based on these previous analyses of the relevant literature, future research directions were identified. We concluded that more research efforts are needed to address the current challenges in data management, workflow scheduling, and service placement. Additionally, there is still room for improved designs and deployments of parallel and hybrid genetic algorithms that leverage, and adapt to, the heterogeneity and distributed features of fog domains.",
    "authors": [
      "Carlos Guerrero",
      "Isaac Lera",
      "Carlos Juiz"
    ],
    "publication_date": "2021-12-03T15:03:14Z",
    "arxiv_id": "http://arxiv.org/abs/2112.01958v3",
    "download_url": "https://arxiv.org/abs/2112.01958v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predicting the Structure of Alloys using Genetic Algorithms",
    "abstract": "We discuss a novel genetic algorithm that can be used to find global minima on the potential energy surface of disordered ceramics and alloys using a real-space symmetry adapted crossover. Due to a high number of symmetrically equivalent solutions of many alloys a conventional genetic algorithms using reasonable population sizes are unable to locate the global minima for even the smallest systems. We demonstrate the superior performance of the use of symmetry adapted crossover by the comparison of that of a conventional GA for finding global minima of two binary Ising-type alloys that either order or phase separate at low temperature. Comparison of different representations and crossover operations show that the use of real-space crossover outperforms crossover operators working on binary representations by several orders of magnitude.",
    "authors": [
      "Chris E. Mohn",
      "Svein Stølen",
      "Walter Kob"
    ],
    "publication_date": "2011-05-30T10:54:41Z",
    "arxiv_id": "http://arxiv.org/abs/1105.5941v1",
    "download_url": "https://arxiv.org/abs/1105.5941v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Clone size distributions in networks of genetic similarity",
    "abstract": "We build networks of genetic similarity in which the nodes are organisms sampled from biological populations. The procedure is illustrated by constructing networks from genetic data of a marine clonal plant. An important feature in the networks is the presence of clone subgraphs, i.e. sets of organisms with identical genotype forming clones. As a first step to understand the dynamics that has shaped these networks, we point up a relationship between a particular degree distribution and the clone size distribution in the populations. We construct a dynamical model for the population dynamics, focussing on the dynamics of the clones, and solve it for the required distributions. Scale free and exponentially decaying forms are obtained depending on parameter values, the first type being obtained when clonal growth is the dominant process. Average distributions are dominated by the power law behavior presented by the fastest replicating populations.",
    "authors": [
      "E. Hernandez-Garcia",
      "A. F. Rozenfeld",
      "V. M. Eguiluz",
      "S. Arnaud-Haond",
      "C. M. Duarte"
    ],
    "publication_date": "2006-08-09T14:17:24Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0608018v2",
    "download_url": "https://arxiv.org/abs/q-bio/0608018v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First-principles prediction of the information processing capacity of a simple genetic circuit",
    "abstract": "Given the stochastic nature of gene expression, genetically identical cells exposed to the same environmental inputs will produce different outputs. This heterogeneity has been hypothesized to have consequences for how cells are able to survive in changing environments. Recent work has explored the use of information theory as a framework to understand the accuracy with which cells can ascertain the state of their surroundings. Yet the predictive power of these approaches is limited and has not been rigorously tested using precision measurements. To that end, we generate a minimal model for a simple genetic circuit in which all parameter values for the model come from independently published data sets. We then predict the information processing capacity of the genetic circuit for a suite of biophysical parameters such as protein copy number and protein-DNA affinity. We compare these parameter-free predictions with an experimental determination of protein expression distributions and the resulting information processing capacity of E. coli cells. We find that our minimal model captures the scaling of the cell-to-cell variability in the data and the inferred information processing capacity of our simple genetic circuit up to a systematic deviation.",
    "authors": [
      "Manuel Razo-Mejia",
      "Sarah Marzen",
      "Griffin Chure",
      "Rachel Taubman",
      "Muir Morrison",
      "Rob Phillips"
    ],
    "publication_date": "2020-05-07T02:46:27Z",
    "arxiv_id": "http://arxiv.org/abs/2005.03214v1",
    "download_url": "https://arxiv.org/abs/2005.03214v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum-Inspired Genetic Algorithm for Designing Planar Multilayer Photonic Structure",
    "abstract": "Quantum algorithms are emerging tools in the design of functional materials due to their powerful solution space search capability. How to balance the high price of quantum computing resources and the growing computing needs has become an urgent problem to be solved. We propose a novel optimization strategy based on an active learning scheme that combines the improved Quantum Genetic Algorithm (QGA) with machine learning surrogate model regression. Using Random Forests as the surrogate model circumvents the time-consuming physical modeling or experiments, thereby improving the optimization efficiency. QGA, a genetic algorithm embedded with quantum mechanics, combines the advantages of quantum computing and genetic algorithms, enabling faster and more robust convergence to the optimum. Using the design of planar multilayer photonic structures for transparent radiative cooling as a testbed, we show superiority of our algorithm over the classical genetic algorithm (CGA). Additionally, we show the precision advantage of the RF model as a flexible surrogate model, which relaxes the constraints on the type of surrogate model that can be used in other quantum computing optimization algorithms (e.g., quantum annealing needs Ising model as a surrogate).",
    "authors": [
      "Zhihao Xu",
      "Wenjie Shang",
      "Seongmin Kim",
      "Alexandria Bobbitt",
      "Eungkyu Lee",
      "Tengfei Luo"
    ],
    "publication_date": "2024-05-08T03:03:10Z",
    "arxiv_id": "http://arxiv.org/abs/2405.05982v1",
    "download_url": "https://arxiv.org/abs/2405.05982v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Forecasting the SST space-time variability of the Alboran Sea with genetic algorithms",
    "abstract": "We propose a nonlinear ocean forecasting technique based on a combination of genetic algorithms and empirical orthogonal function (EOF) analysis. The method is used to forecast the space-time variability of the sea surface temperature (SST) in the Alboran Sea. The genetic algorithm finds the equations that best describe the behaviour of the different temporal amplitude functions in the EOF decomposition and, therefore, enables global forecasting of the future time-variability.",
    "authors": [
      "Alberto Alvarez",
      "Cristobal Lopez",
      "Margalida Riera",
      "Emilio Hernandez-Garcia",
      "Joaquin Tintore"
    ],
    "publication_date": "1999-11-09T10:59:47Z",
    "arxiv_id": "http://arxiv.org/abs/chao-dyn/9911012v1",
    "download_url": "https://arxiv.org/abs/chao-dyn/9911012v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MOAB: Multi-Modal Outer Arithmetic Block For Fusion Of Histopathological Images And Genetic Data For Brain Tumor Grading",
    "abstract": "Brain tumors are an abnormal growth of cells in the brain. They can be classified into distinct grades based on their growth. Often grading is performed based on a histological image and is one of the most significant predictors of a patients prognosis, the higher the grade, the more aggressive the tumor. Correct diagnosis of a tumor grade remains challenging. Though histopathological grading has been shown to be prognostic, results are subject to interobserver variability, even among experienced pathologists. Recently, the World Health Organization reported that advances in molecular genetics have led to improvements in tumor classification. This paper seeks to integrate histological images and genetic data for improved computer-aided diagnosis. We propose a novel Multi-modal Outer Arithmetic Block (MOAB) based on arithmetic operations to combine latent representations of the different modalities for predicting the tumor grade (Grade \\rom{2}, \\rom{3} and \\rom{4}). Extensive experiments evaluate the effectiveness of our approach. By applying MOAB to The Cancer Genome Atlas (TCGA) glioma dataset, we show that it can improve separation between similar classes (Grade \\rom{2} and \\rom{3}) and outperform prior state-of-the-art grade classification techniques.",
    "authors": [
      "Omnia Alwazzan",
      "Abbas Khan",
      "Ioannis Patras",
      "Gregory Slabaugh"
    ],
    "publication_date": "2024-03-11T00:33:28Z",
    "arxiv_id": "http://arxiv.org/abs/2403.06349v1",
    "download_url": "https://arxiv.org/abs/2403.06349v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MeGA: Merging Multiple Independently Trained Neural Networks Based on Genetic Algorithm",
    "abstract": "In this paper, we introduce a novel method for merging the weights of multiple pre-trained neural networks using a genetic algorithm called MeGA. Traditional techniques, such as weight averaging and ensemble methods, often fail to fully harness the capabilities of pre-trained networks. Our approach leverages a genetic algorithm with tournament selection, crossover, and mutation to optimize weight combinations, creating a more effective fusion. This technique allows the merged model to inherit advantageous features from both parent models, resulting in enhanced accuracy and robustness. Through experiments on the CIFAR-10 dataset, we demonstrate that our genetic algorithm-based weight merging method improves test accuracy compared to individual models and conventional methods. This approach provides a scalable solution for integrating multiple pre-trained networks across various deep learning applications. Github is available at: https://github.com/YUNBLAK/MeGA-Merging-Multiple-Independently-Trained-Neural-Networks-Based-on-Genetic-Algorithm",
    "authors": [
      "Daniel Yun"
    ],
    "publication_date": "2024-06-07T03:31:58Z",
    "arxiv_id": "http://arxiv.org/abs/2406.04607v4",
    "download_url": "https://arxiv.org/abs/2406.04607v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lie Superalgebras and the Multiplet Structure of the Genetic Code I: Codon Representations",
    "abstract": "It has been proposed that the degeneracy of the genetic code,i.e., the phenomenon that different codons (base triplets) of DNA are transcribed into the same amino acid, may be interpreted as the result of a symmetry breaking process. In the initial work of Hornos & Hornos this picture was developed in the framework of simple Lie algebras. Here, we explore the possibility of explaining the degeneracy of the genetic code using basic classical Lie superalgebras, whose representation theory is sufficiently well understood, at least as far as typical representations are concerned. In the present paper, we give the complete list of all typical codon representations (typical 64 -dimensional irreducible representations), whereas in the second part, we shall present the corresponding branching rules and discuss which of them reproduce the multiplet structure of the genetic code.",
    "authors": [
      "F. M. Forger",
      "R. S. Sachse"
    ],
    "publication_date": "1998-08-04T12:48:08Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/9808001v1",
    "download_url": "https://arxiv.org/abs/math-ph/9808001v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "GAz: A Genetic Algorithm for Photometric Redshift Estimation",
    "abstract": "We present a new approach to the problem of estimating the redshift of galaxies from photometric data. The approach uses a genetic algorithm combined with non-linear regression to model the 2SLAQ LRG data set with SDSS DR7 photometry. The genetic algorithm explores the very large space of high order polynomials while only requiring optimisation of a small number of terms. We find a $σ_{\\text{rms}}=0.0408\\pm 0.0006$ for redshifts in the range $0.4<z< 0.7$. These results are competitive with the current state-of-the-art but can be presented simply as a polynomial which does not require the user to run any code. We demonstrate that the method generalises well to other data sets and redshift ranges by testing it on SDSS DR11 and on simulated data. For other datasets or applications the code has been made available at https://github.com/rbrthogan/GAz.",
    "authors": [
      "Robert Hogan",
      "Malcolm Fairbairn",
      "Navin Seeburn"
    ],
    "publication_date": "2014-12-17T14:54:37Z",
    "arxiv_id": "http://arxiv.org/abs/1412.5997v2",
    "download_url": "https://arxiv.org/abs/1412.5997v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum autoencoders via quantum adders with genetic algorithms",
    "abstract": "The quantum autoencoder is a recent paradigm in the field of quantum machine learning, which may enable an enhanced use of resources in quantum technologies. To this end, quantum neural networks with less nodes in the inner than in the outer layers were considered. Here, we propose a useful connection between approximate quantum adders and quantum autoencoders. Specifically, this link allows us to employ optimized approximate quantum adders, obtained with genetic algorithms, for the implementation of quantum autoencoders for a variety of initial states. Furthermore, we can also directly optimize the quantum autoencoders via genetic algorithms. Our approach opens a different path for the design of quantum autoencoders in controllable quantum platforms.",
    "authors": [
      "L. Lamata",
      "U. Alvarez-Rodriguez",
      "J. D. Martín-Guerrero",
      "M. Sanz",
      "E. Solano"
    ],
    "publication_date": "2017-09-21T16:52:00Z",
    "arxiv_id": "http://arxiv.org/abs/1709.07409v2",
    "download_url": "https://arxiv.org/abs/1709.07409v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symbolic Regression via Neural-Guided Genetic Programming Population Seeding",
    "abstract": "Symbolic regression is the process of identifying mathematical expressions that fit observed output from a black-box process. It is a discrete optimization problem generally believed to be NP-hard. Prior approaches to solving the problem include neural-guided search (e.g. using reinforcement learning) and genetic programming. In this work, we introduce a hybrid neural-guided/genetic programming approach to symbolic regression and other combinatorial optimization problems. We propose a neural-guided component used to seed the starting population of a random restart genetic programming component, gradually learning better starting populations. On a number of common benchmark tasks to recover underlying expressions from a dataset, our method recovers 65% more expressions than a recently published top-performing model using the same experimental setup. We demonstrate that running many genetic programming generations without interdependence on the neural-guided component performs better for symbolic regression than alternative formulations where the two are more strongly coupled. Finally, we introduce a new set of 22 symbolic regression benchmark problems with increased difficulty over existing benchmarks. Source code is provided at www.github.com/brendenpetersen/deep-symbolic-optimization.",
    "authors": [
      "T. Nathan Mundhenk",
      "Mikel Landajuela",
      "Ruben Glatt",
      "Claudio P. Santiago",
      "Daniel M. Faissol",
      "Brenden K. Petersen"
    ],
    "publication_date": "2021-10-29T19:26:41Z",
    "arxiv_id": "http://arxiv.org/abs/2111.00053v2",
    "download_url": "https://arxiv.org/abs/2111.00053v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symmetry and Codon Usage Correlations in the Genetic Code",
    "abstract": "The ratios of the codon usage in the quartets and sextets for the vertebrate series exhibit a correlated behaviour which fits naturally in the framework of the crystal basis model of the genetic code. Moreover the observed universal behaviour of these suitably normalized ratios can be easily explained.",
    "authors": [
      "L. Frappat",
      "A. Sciarrino",
      "P. Sorba"
    ],
    "publication_date": "1998-12-22T10:25:51Z",
    "arxiv_id": "http://arxiv.org/abs/physics/9812041v1",
    "download_url": "https://arxiv.org/abs/physics/9812041v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Comparison of Genetic Algorithms and Simulated Annealing in Maximizing the Thermal Conductivity of Discrete Massive Chains",
    "abstract": "Functions of chemical composition are complex and discrete in nature making it impossible to optimize them with gradient methods. Genetic algorithms, which do not use derivative information, are used to maximize the thermal conductivity of one-dimensional classical harmonic oscillators made from a fixed library of randomly generated molecular units. The ability for the genetic algorithm to build structures with components having no physical increment is important in optimizing molecules with a library of unrelated polymer units. The performance of genetic algorithms in this problem is compared with simulated annealing. Hyper-parameters for these routines are selected from a grid search in order to optimize their expected solution strength. The solutions found via the genetic algorithm consistently outperform those of simulated annealing at the cost of longer computer time. Together, these algorithms are able to find thermal conductor candidates that mirror solutions in continuous media.",
    "authors": [
      "Alexander Kerr",
      "Kieran Mullen"
    ],
    "publication_date": "2018-01-12T22:15:33Z",
    "arxiv_id": "http://arxiv.org/abs/1801.09328v1",
    "download_url": "https://arxiv.org/abs/1801.09328v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A new generalization of Parrondo's games to three players and its application in genetic switches",
    "abstract": "Parrondo's paradox indicates a paradoxical situation in which a winning expectation may occur in sequences of losing games. There are many versions of the original Parrondo's games in the literature, but the games are played by two players in all of them. We introduce a new extended version of games played by three players and a three-sided biased dice instead of two players and a biased coin in this work. In the first step, we find the part of the parameters space where the games are played fairly. After adding noise to fair probabilities, we combine two games randomly, periodically, and nonlinearly and obtain the conditions under which the paradox can occur. This generalized model can be applied in all science and engineering fields. It can also be used for genetic switches. Genetic switches are often made by two reactive elements, but the existence of more elements can lead to more existing decisions for cells. Each genetic switch can be considered a game in which the reactive elements compete to increase their molecular concentrations. We present three genetic networks based on a new generalized Parrondo's games model, consisting of two noisy genetic switches. The combination of them can increase network robustness to noise. Each switch can also be used as an initial pattern to construct a synthetic switch to change undesirable cells' fate.",
    "authors": [
      "Atiyeh Fotoohinasab"
    ],
    "publication_date": "2021-01-23T22:37:56Z",
    "arxiv_id": "http://arxiv.org/abs/2101.11401v2",
    "download_url": "https://arxiv.org/abs/2101.11401v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computational Complexity Analysis of Multi-Objective Genetic Programming",
    "abstract": "The computational complexity analysis of genetic programming (GP) has been started recently by analyzing simple (1+1) GP algorithms for the problems ORDER and MAJORITY. In this paper, we study how taking the complexity as an additional criteria influences the runtime behavior. We consider generalizations of ORDER and MAJORITY and present a computational complexity analysis of (1+1) GP using multi-criteria fitness functions that take into account the original objective and the complexity of a syntax tree as a secondary measure. Furthermore, we study the expected time until population-based multi-objective genetic programming algorithms have computed the Pareto front when taking the complexity of a syntax tree as an equally important objective.",
    "authors": [
      "Frank Neumann"
    ],
    "publication_date": "2012-03-22T04:22:36Z",
    "arxiv_id": "http://arxiv.org/abs/1203.4881v1",
    "download_url": "https://arxiv.org/abs/1203.4881v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Solving Poisson Equation by Genetic Algorithms",
    "abstract": "This paper deals with a method for solving Poisson Equation (PE) based on genetic algorithms and grammatical evolution. The method forms generations of solutions expressed in an analytical form. Several examples of PE are tested and in most cases the exact solution is recovered. But, when the solution cannot be expressed in an analytical form, our method produces a satisfactory solution with a good level of accuracy",
    "authors": [
      "Khalid Jebari",
      "Mohammed Madiafi",
      "Abdelaziz El Moujahid"
    ],
    "publication_date": "2014-01-02T20:15:00Z",
    "arxiv_id": "http://arxiv.org/abs/1401.0523v1",
    "download_url": "https://arxiv.org/abs/1401.0523v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dense Visual Odometry Using Genetic Algorithm",
    "abstract": "Our work aims to estimate the camera motion mounted on the head of a mobile robot or a moving object from RGB-D images in a static scene. The problem of motion estimation is transformed into a nonlinear least squares function. Methods for solving such problems are iterative. Various classic methods gave an iterative solution by linearizing this function. We can also use the metaheuristic optimization method to solve this problem and improve results. In this paper, a new algorithm is developed for visual odometry using a sequence of RGB-D images. This algorithm is based on a genetic algorithm. The proposed iterative genetic algorithm searches using particles to estimate the optimal motion and then compares it to the traditional methods. To evaluate our method, we use the root mean square error to compare it with the based energy method and another metaheuristic method. We prove the efficiency of our innovative algorithm on a large set of images.",
    "authors": [
      "Slimane Djema",
      "Zoubir Abdeslem Benselama",
      "Ramdane Hedjar",
      "Krabi Abdallah"
    ],
    "publication_date": "2023-11-10T16:09:01Z",
    "arxiv_id": "http://arxiv.org/abs/2311.06149v1",
    "download_url": "https://arxiv.org/abs/2311.06149v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Indirect Genetic Algorithm for Set Covering Problems",
    "abstract": "This paper presents a new type of genetic algorithm for the set covering problem. It differs from previous evolutionary approaches first because it is an indirect algorithm, i.e. the actual solutions are found by an external decoder function. The genetic algorithm itself provides this decoder with permutations of the solution variables and other parameters. Second, it will be shown that results can be further improved by adding another indirect optimisation layer. The decoder will not directly seek out low cost solutions but instead aims for good exploitable solutions. These are then post optimised by another hill-climbing algorithm. Although seemingly more complicated, we will show that this three-stage approach has advantages in terms of solution quality, speed and adaptability to new types of problems over more direct approaches. Extensive computational results are presented and compared to the latest evolutionary and other heuristic approaches to the same data instances.",
    "authors": [
      "Uwe Aickelin"
    ],
    "publication_date": "2008-03-20T10:58:32Z",
    "arxiv_id": "http://arxiv.org/abs/0803.2965v1",
    "download_url": "https://arxiv.org/abs/0803.2965v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic analysis of differentiation of T-helper lymphocytes",
    "abstract": "In the human immune system, T-helper cells are able to differentiate into two lymphocyte subsets: Th1 and Th2. The intracellular signaling pathways of differentiation form a dynamic regulation network by secreting distinctive types of cytokines, while differentiation is regulated by two major gene loci: T-bet and GATA-3. We developed a system dynamics model to simulate the differentiation and re-differentiation process of T-helper cells, based on gene expression levels of T-bet and GATA-3 during differentiation of these cells. We arrived at three ultimate states of the model and came to the conclusion that cell differentiation potential exists as long as the system dynamics is at an unstable equilibrium point; the T-helper cells will no longer have the potential of differentiation when the model reaches a stable equilibrium point. In addition, the time lag caused by expression of transcription factors can lead to oscillations in the secretion of cytokines during differentiation.",
    "authors": [
      "Qixin Wang",
      "Menghui Li",
      "Li Charlie Xia",
      "Ge Wen",
      "Hualong Zu",
      "Mingyi Gao"
    ],
    "publication_date": "2013-04-23T03:21:21Z",
    "arxiv_id": "http://arxiv.org/abs/1304.6158v1",
    "download_url": "https://arxiv.org/abs/1304.6158v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The genetic code degeneracy and the amino acids chemical composition are connected",
    "abstract": "We show that our recently published Arithmetic Model of the genetic code based on Godel Encoding is robust against symmetry transformations, specially Rumer s one U > G, A > C, and constitutes a link between the degeneracy structure and the chemical composition of the 20 canonical amino acids. As a result, several remarkable atomic patterns involving hydrogen, carbon, nucleon and atom numbers are derived. This study has no obvious practical application(s) but could, we hope, add some new knowledge concerning the physico-mathematical structrure of the genetic code.",
    "authors": [
      "Tidjani Negadi"
    ],
    "publication_date": "2009-03-24T16:50:56Z",
    "arxiv_id": "http://arxiv.org/abs/0903.4131v1",
    "download_url": "https://arxiv.org/abs/0903.4131v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Does genetic diversity help survival?",
    "abstract": "We introduce the following model for the evolution of a population. At every discrete time $j\\geq 0$ exactly one individual is introduced in the population and is assigned a death probability $c_j$ sampled from $C$, a fixed probability distribution. We think of $c_j$ as a genetic marker of this individual. At every time $n\\geq 1$ every individual in the population dies or not independently of each other with its corresponding death probability $c_j$. We show that the population size goes to infinity if and only if $E(1/C)=\\infty$. This is in sharp contrast with the model with constant $c$ and with the model in random environment (same random $c_n$ for all individuals at time $n$). Both of these models are always positive recurrent. Thus, genetic diversity does seem to help survival! We also study the point process associated with our model. We show that the limit point process has an accumulation point near 0 for the $c'$s. For certain $C$ distributions, including the uniform, the limit process properly rescaled is also shown to converge to a non-homogeneous Poisson process.",
    "authors": [
      "Luiz Renato Fontes",
      "Fabio P. Machado",
      "Rinaldo B. Schinazi"
    ],
    "publication_date": "2023-07-19T12:32:09Z",
    "arxiv_id": "http://arxiv.org/abs/2307.09940v1",
    "download_url": "https://arxiv.org/abs/2307.09940v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic clonal dynamics and genetic turnover in exponentially growing populations",
    "abstract": "We consider an exponentially growing population of cells undergoing mutations and ask about the effect of reproductive fluctuations (genetic drift) on its long-term evolution. We combine first step analysis with the stochastic dynamics of a birth-death process to analytically calculate the probability that the parent of a given genotype will go extinct. We compare the results with numerical simulations and show how this turnover of genetic clones can be used to infer the rates underlying the population dynamics. Our work is motivated by growing populations of tumour cells, the epidemic spread of viruses, and bacterial growth.",
    "authors": [
      "Arman Angaji",
      "Christoph Velling",
      "Johannes Berg"
    ],
    "publication_date": "2021-06-27T13:42:33Z",
    "arxiv_id": "http://arxiv.org/abs/2106.14236v2",
    "download_url": "https://arxiv.org/abs/2106.14236v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "To what extent does genealogical ancestry imply genetic ancestry?",
    "abstract": "Recent statistical and computational analyses have shown that a genealogical most recent common ancestor (MRCA) may have lived in the recent past. However, coalescent-based approaches show that genetic most recent common ancestors for a given non-recombining locus are typically much more ancient. It is not immediately clear how these two perspectives interact. This paper investigates relationships between the number of descendant alleles of an ancestor allele and the number of genealogical descendants of the individual who possessed that allele for a simple diploid genetic model extending the genealogical model of Joseph Chang.",
    "authors": [
      "Frederick A. Matsen",
      "Steven N. Evans"
    ],
    "publication_date": "2008-05-06T02:51:05Z",
    "arxiv_id": "http://arxiv.org/abs/0805.0634v2",
    "download_url": "https://arxiv.org/abs/0805.0634v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Image Classification Method using Dynamic Quantum Inspired Genetic Algorithm",
    "abstract": "This study presents a dynamic Quantum-Inspired Genetic Algorithm (D-QIGA) for feature selection, leveraging quantum principles like superposition and rotation gates to enhance exploration and exploitation. D-QIGA introduces adaptive mechanisms and a lengthening chromosome strategy to avoid local optima and improve optimization. Tested on benchmark and real-world problems, it significantly outperforms traditional Genetic Algorithms, achieving over 99.99% classification accuracy compared to GA's 95%.",
    "authors": [
      "Akhilesh Kumar Singh",
      "Kirankumar R. Hiremath"
    ],
    "publication_date": "2025-01-20T13:18:13Z",
    "arxiv_id": "http://arxiv.org/abs/2501.11477v4",
    "download_url": "https://arxiv.org/abs/2501.11477v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Growth-rate-dependent dynamics of a bacterial genetic oscillator",
    "abstract": "Gene networks exhibiting oscillatory dynamics are widespread in biology. The minimal regulatory designs giving rise to oscillations have been implemented synthetically and studied by mathematical modeling. However, most of the available analyses generally neglect the coupling of regulatory circuits with the cellular \"chassis\" in which the circuits are embedded. For example, the intracellular macromolecular composition of fast-growing bacteria changes with growth rate. As a consequence, important parameters of gene expression, such as ribosome concentration or cell volume, are growth-rate dependent, ultimately coupling the dynamics of genetic circuits with cell physiology. This work addresses the effects of growth rate on the dynamics of a paradigmatic example of genetic oscillator, the repressilator. Making use of empirical growth-rate dependences of parameters in bacteria, we show that the repressilator dynamics can switch between oscillations and convergence to a fixed point depending on the cellular state of growth, and thus on the nutrients it is fed. The physical support of the circuit (type of plasmid or gene positions on the chromosome) also plays an important role in determining the oscillation stability and the growth-rate dependence of period and amplitude. This analysis has potential application in the field of synthetic biology, and suggests that the coupling between endogenous genetic oscillators and cell physiology can have substantial consequences for their functionality.",
    "authors": [
      "Matteo Osella",
      "Marco Cosentino Lagomarsino"
    ],
    "publication_date": "2012-10-03T21:29:42Z",
    "arxiv_id": "http://arxiv.org/abs/1210.1240v2",
    "download_url": "https://arxiv.org/abs/1210.1240v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Epigenetic Tapestry: A Review of DNA Methylation and Non-Coding RNA's Interplay with Genetic Threads, Weaving a Network Impacting Gene Expression and Disease Manifestations",
    "abstract": "The emerging field of epigenetics has recently unveiled a dynamic landscape in which gene expression is not determined solely by genetic sequences but also by intricate regulatory mechanisms. This review examines the interactions between these regulatory mechanisms, including DNA methylation and non-coding RNAs (ncRNAs), that orchestrate gene expression fine-tuning for cellular homeostasis and the pathogenesis of a multitude of diseases. We explore long non-coding RNAs (lncRNAs) such as telomeric repeat-containing RNA (TERRA) and Fendrr, highlighting their role in protein regulation to ensure proper gene activation or silencing. Additionally, we explain the therapeutic potential of brain-derived neurotrophic factor (BDNF)-related microRNA 132, which has shown promise in treating chronic illnesses by restoring BDNF levels. Finally, this review covers the role of DNA methyltransferases and ncRNAs in cancer, focusing on how lncRNAs contribute to X chromosome inactivation and interact with chromatin-modifying complexes and DNA methyltransferase inhibitors to reduce cancer cell aggressiveness. By amalgamating the wide array of research in this field, we aim to provide glimpses into the complex entangling of genetics and environment as they control gene expressions.",
    "authors": [
      "Yu-Li He",
      "Youshin Loh"
    ],
    "publication_date": "2025-10-08T09:06:10Z",
    "arxiv_id": "http://arxiv.org/abs/2510.06781v1",
    "download_url": "https://arxiv.org/abs/2510.06781v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Whitehead method and Genetic Algorithms",
    "abstract": "In this paper we discuss a genetic version (GWA) of the Whitehead's algorithm, which is one of the basic algorithms in combinatorial group theory. It turns out that GWA is surprisingly fast and outperforms the standard Whitehead's algorithm in free groups of rank >= 5. Experimenting with GWA we collected an interesting numerical data that clarifies the time-complexity of the Whitehead's Problem in general. These experiments led us to several mathematical conjectures. If confirmed they will shed light on hidden mechanisms of Whitehead Method and geometry of automorphic orbits in free groups.",
    "authors": [
      "Alexei D. Miasnikov",
      "Alexei G. Myasnikov"
    ],
    "publication_date": "2003-04-20T16:24:44Z",
    "arxiv_id": "http://arxiv.org/abs/math/0304283v1",
    "download_url": "https://arxiv.org/abs/math/0304283v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Phase-Only Planar Antenna Array Synthesis with Fuzzy Genetic Algorithms",
    "abstract": "This paper describes a new method for the synthesis of planar antenna arrays using fuzzy genetic algorithms (FGAs) by optimizing phase excitation coefficients to best meet a desired radiation pattern. We present the application of a rigorous optimization technique based on fuzzy genetic algorithms (FGAs), the optimizing algorithm is obtained by adjusting control parameters of a standard version of genetic algorithm (SGAs) using a fuzzy controller (FLC) depending on the best individual fitness and the population diversity measurements (PDM). The presented optimization algorithms were previously checked on specific mathematical test function and show their superior capabilities with respect to the standard version (SGAs). A planar array with rectangular cells using a probe feed is considered. Included example using FGA demonstrates the good agreement between the desired and calculated radiation patterns than those obtained by a SGA.",
    "authors": [
      "Boufeldja Kadri",
      "Miloud Boussahla",
      "Fethi Tarik Bendimerad"
    ],
    "publication_date": "2010-02-05T10:08:22Z",
    "arxiv_id": "http://arxiv.org/abs/1002.1176v1",
    "download_url": "https://arxiv.org/abs/1002.1176v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Accelerating the ANT Colony Optimization By Smart ANTs, Using Genetic Operator",
    "abstract": "This paper research review Ant colony optimization (ACO) and Genetic Algorithm (GA), both are two powerful meta-heuristics. This paper explains some major defects of these two algorithm at first then proposes a new model for ACO in which, artificial ants use a quick genetic operator and accelerate their actions in selecting next state. Experimental results show that proposed hybrid algorithm is effective and its performance including speed and accuracy beats other version.",
    "authors": [
      "Hassan Ismkhan"
    ],
    "publication_date": "2014-11-11T17:42:26Z",
    "arxiv_id": "http://arxiv.org/abs/1411.2897v1",
    "download_url": "https://arxiv.org/abs/1411.2897v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deterministic and Stochastic Simulations of Simple Genetic Circuits",
    "abstract": "We analyze three simple genetic circuits which involve transcriptional regulation and feedback: the autorepressor, the switch and the repressilator, that consist of one, two and three genes, respectively. Such systems are commonly simulated using rate equations, that account for the concentrations of the mRNAs and proteins produced by these genes. Rate equations are suitable when the concentrations of the relevant molecules in a cell are large and fluctuations are negligible. However, when some of the proteins in the circuit appear in low copy numbers, fluctuations become important and the rate equations fail. In this case stochastic methods, such as direct numerical integration of the master equation or Monte Carlo simulations are required. Here we present deterministic and stochastic simulations of the autorepressor, the switch and the repressilator. We show that fluctuations give rise to quantitative and qualitative changes in the dynamics of these systems. In particular, we demonstrate a fluctuations-induced bistability in a variant of the genetic switch and and noisy oscillations obtained in the repressilator circuit.",
    "authors": [
      "Ofer Biham",
      "Nathalie Q. Balaban",
      "Adiel Loinger",
      "Azi Lipshtat",
      "Hagai B. Perets"
    ],
    "publication_date": "2007-03-13T07:01:58Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0703030v1",
    "download_url": "https://arxiv.org/abs/q-bio/0703030v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Guiding Genetic Programming with Graph Neural Networks",
    "abstract": "In evolutionary computation, it is commonly assumed that a search algorithm acquires knowledge about a problem instance by sampling solutions from the search space and evaluating them with a fitness function. This is necessarily inefficient because fitness reveals very little about solutions -- yet they contain more information that can be potentially exploited. To address this observation in genetic programming, we propose EvoNUDGE, which uses a graph neural network to elicit additional knowledge from symbolic regression problems. The network is queried on the problem before an evolutionary run to produce a library of subprograms, which is subsequently used to seed the initial population and bias the actions of search operators. In an extensive experiment on a large number of problem instances, EvoNUDGE is shown to significantly outperform multiple baselines, including the conventional tree-based genetic programming and the purely neural variant of the method.",
    "authors": [
      "Piotr Wyrwiński",
      "Krzysztof Krawiec"
    ],
    "publication_date": "2024-11-03T20:43:31Z",
    "arxiv_id": "http://arxiv.org/abs/2411.05820v1",
    "download_url": "https://arxiv.org/abs/2411.05820v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Novel Lie Algebra of the Genetic Code over the Galois Field of Four DNA Bases",
    "abstract": "By starting from the four DNA bases order in the Boolean lattice, a novel Lie Algebra of the genetic code is proposed. Here, the principal partitions of the genetic code table were obtained as equivalent classes of quotient subspaces of the genetic code vector space over the Galois field of the four DNA bases. The new algebraic structure shows strong connections among algebraic relationships, codon assignment and physicochemical properties of amino acids. Moreover, a distance function defined between codons in the Lie algebra was demonstrated to have a linear behavior respect to physical variables such as the mean of amino acids energy in proteins. It was also noticed that the distance between wild type and mutant codons approach smaller values in mutational variants of four genes, i.e, human phenylalanine hydroxylase, human beta-globin, HIV-1 protease and HIV-1 reverse transcriptase. These results strongly suggest that deterministic rules in genetic code origin must be involved.",
    "authors": [
      "Robersy Sanchez",
      "Ricardo Grau"
    ],
    "publication_date": "2005-01-27T21:15:03Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0501036v2",
    "download_url": "https://arxiv.org/abs/q-bio/0501036v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Novel Genetic Search Scheme Based on Nature -- Inspired Evolutionary Algorithms for Self-Dual Codes",
    "abstract": "In this paper, a genetic algorithm, one of the evolutionary algorithms optimization methods, is used for the first time for the problem of finding extremal binary self-dual codes. We present a comparison of the computational times between a genetic algorithm and a linear search for different size search spaces and show that the genetic algorithm is capable of finding binary self-dual codes significantly faster than the linear search. Moreover, by employing a known matrix construction together with the genetic algorithm, we are able to obtain new binary self-dual codes of lengths 68 and 72 in a significantly short time. In particular, we obtain 11 new extremal binary self-dual codes of length 68 and 17 new binary self-dual codes of length 72.",
    "authors": [
      "Adrian Korban",
      "Serap Sahinkaya",
      "Deniz Ustun"
    ],
    "publication_date": "2020-12-22T18:46:22Z",
    "arxiv_id": "http://arxiv.org/abs/2012.12248v1",
    "download_url": "https://arxiv.org/abs/2012.12248v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysis of Estimation of Distribution Algorithms and Genetic Algorithms on NK Landscapes",
    "abstract": "This study analyzes performance of several genetic and evolutionary algorithms on randomly generated NK fitness landscapes with various values of n and k. A large number of NK problem instances are first generated for each n and k, and the global optimum of each instance is obtained using the branch-and-bound algorithm. Next, the hierarchical Bayesian optimization algorithm (hBOA), the univariate marginal distribution algorithm (UMDA), and the simple genetic algorithm (GA) with uniform and two-point crossover operators are applied to all generated instances. Performance of all algorithms is then analyzed and compared, and the results are discussed.",
    "authors": [
      "Martin Pelikan"
    ],
    "publication_date": "2008-01-21T00:20:50Z",
    "arxiv_id": "http://arxiv.org/abs/0801.3111v1",
    "download_url": "https://arxiv.org/abs/0801.3111v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "grenedalf: population genetic statistics for the next generation of pool sequencing",
    "abstract": "Pool sequencing is an efficient method for capturing genome-wide allele frequencies from multiple individuals, with broad applications such as studying adaptation in Evolve-and-Resequence experiments, monitoring of genetic diversity in wild populations, and genotype-to-phenotype mapping. Here, we present grenedalf, a command line tool written in C++ that implements common population genetic statistics such as $θ$, Tajima's D, and FST for Pool sequencing. It is orders of magnitude faster than current tools, and is focused on providing usability and scalability, while also offering a plethora of input file formats and convenience options.",
    "authors": [
      "Lucas Czech",
      "Jeffrey P. Spence",
      "Moisés Expósito-Alonso"
    ],
    "publication_date": "2023-06-20T15:48:48Z",
    "arxiv_id": "http://arxiv.org/abs/2306.11622v3",
    "download_url": "https://arxiv.org/abs/2306.11622v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Effectiveness of Genetic Operations in Symbolic Regression",
    "abstract": "This paper describes a methodology for analyzing the evolutionary dynamics of genetic programming (GP) using genealogical information, diversity measures and information about the fitness variation from parent to offspring. We introduce a new subtree tracing approach for identifying the origins of genes in the structure of individuals, and we show that only a small fraction of ancestor individuals are responsible for the evolvement of the best solutions in the population.",
    "authors": [
      "Bogdan Burlacu",
      "Michael Affenzeller",
      "Michael Kommenda"
    ],
    "publication_date": "2021-08-24T11:59:52Z",
    "arxiv_id": "http://arxiv.org/abs/2108.10661v1",
    "download_url": "https://arxiv.org/abs/2108.10661v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Astrophysical data mining with GPU. A case study: genetic classification of globular clusters",
    "abstract": "We present a multi-purpose genetic algorithm, designed and implemented with GPGPU / CUDA parallel computing technology. The model was derived from our CPU serial implementation, named GAME (Genetic Algorithm Model Experiment). It was successfully tested and validated on the detection of candidate Globular Clusters in deep, wide-field, single band HST images. The GPU version of GAME will be made available to the community by integrating it into the web application DAMEWARE (DAta Mining Web Application REsource (http://dame.dsf.unina.it/beta_info.html), a public data mining service specialized on massive astrophysical data. Since genetic algorithms are inherently parallel, the GPGPU computing paradigm leads to a speedup of a factor of 200x in the training phase with respect to the CPU based version.",
    "authors": [
      "Stefano Cavuoti",
      "Mauro Garofalo",
      "Massimo Brescia",
      "Maurizio Paolillo",
      "Antonio Pescape'",
      "Giuseppe Longo",
      "Giorgio Ventre"
    ],
    "publication_date": "2013-04-02T11:50:26Z",
    "arxiv_id": "http://arxiv.org/abs/1304.0597v1",
    "download_url": "https://arxiv.org/abs/1304.0597v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Bayes Factor Approach with Informative Prior for Rare Genetic Variant Analysis from Next Generation Sequencing Data",
    "abstract": "The discovery of rare genetic variants through Next Generation Sequencing is a very challenging issue in the field of human genetics. We propose a novel region-based statistical approach based on a Bayes Factor (BF) to assess evidence of association between a set of rare variants (RVs) located on the same genomic region and a disease outcome in the context of case-control design. Marginal likelihoods are computed under the null and alternative hypotheses assuming a binomial distribution for the RV count in the region and a beta or mixture of Dirac and beta prior distribution for the probability of RV. We derive the theoretical null distribution of the BF under our prior setting and show that a Bayesian control of the False Discovery Rate (BFDR) can be obtained for genome-wide inference. Informative priors are introduced using prior evidence of association from a Kolmogorov-Smirnov test statistic. We use our simulation program, sim1000G, to generate RV data similar to the 1,000 genomes sequencing project. Our simulation studies showed that the new BF statistic outperforms standard methods (SKAT, SKAT-O, Burden test) in case-control studies with moderate sample sizes and is equivalent to them under large sample size scenarios. Our real data application to a lung cancer case-control study found enrichment for RVs in known and novel cancer genes. It also suggests that using the BF with informative prior improves the overall gene discovery compared to the BF with non-informative prior.",
    "authors": [
      "Jingxiong Xu",
      "Wei Xu",
      "Laurent Briollais"
    ],
    "publication_date": "2020-02-20T00:34:46Z",
    "arxiv_id": "http://arxiv.org/abs/2002.08505v1",
    "download_url": "https://arxiv.org/abs/2002.08505v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Improving Opioid Use Disorder Risk Modelling through Behavioral and Genetic Feature Integration",
    "abstract": "Opioids are an effective analgesic for acute and chronic pain, but also carry a considerable risk of addiction leading to millions of opioid use disorder (OUD) cases and tens of thousands of premature deaths in the United States yearly. Estimating OUD risk prior to prescription could improve the efficacy of treatment regimens, monitoring programs, and intervention strategies, but risk estimation is typically based on self-reported data or questionnaires. We develop an experimental design and computational methods that combine genetic variants associated with OUD with behavioral features extracted from GPS and Wi-Fi spatiotemporal coordinates to assess OUD risk. Since both OUD mobility and genetic data do not exist for the same cohort, we develop algorithms to (1) generate mobility features from empirical distributions and (2) synthesize mobility and genetic samples assuming an expected level of disease co-occurrence. We show that integrating genetic and mobility modalities improves risk modelling using classification accuracy, area under the precision-recall and receiver operator characteristic curves, and $F_1$ score. Interpreting the fitted models suggests that mobility features have more influence on OUD risk, although the genetic contribution was significant, particularly in linear models. While there exist concerns with respect to privacy, security, bias, and generalizability that must be evaluated in clinical trials before being implemented in practice, our framework provides preliminary evidence that behavioral and genetic features may improve OUD risk estimation to assist with personalized clinical decision-making.",
    "authors": [
      "Sybille Légitime",
      "Kaustubh Prabhu",
      "Devin McConnell",
      "Bing Wang",
      "Dipak K. Dey",
      "Derek Aguiar"
    ],
    "publication_date": "2023-09-19T17:01:28Z",
    "arxiv_id": "http://arxiv.org/abs/2309.10837v2",
    "download_url": "https://arxiv.org/abs/2309.10837v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multi-objective design of quantum circuits using genetic programming",
    "abstract": "Quantum computing is a new way of data processing based on the concept of quantum mechanics. Quantum circuit design is a process of converting a quantum gate to a series of basic gates and is divided into two general categories based on the decomposition and composition. In the second group, using evolutionary algorithms and especially genetic algorithms, multiplication of matrix gates was used to achieve the final characteristic of quantum circuit. Genetic programming is a subfield of evolutionary computing in which computer programs evolve to solve studied problems. In past research that has been done in the field of quantum circuits design, only one cost metrics (usually quantum cost) has been investigated. In this paper for the first time, a multi-objective approach has been provided to design quantum circuits using genetic programming that considers the depth and the cost of nearest neighbor metrics in addition to quantum cost metric. Another innovation of this article is the use of two-step fitness function and taking into account the equivalence of global phase in quantum gates. The results show that the proposed method is able to find a good answer in a short time.",
    "authors": [
      "Moein Sarvaghad-Moghaddam"
    ],
    "publication_date": "2016-04-03T14:33:15Z",
    "arxiv_id": "http://arxiv.org/abs/1604.00642v3",
    "download_url": "https://arxiv.org/abs/1604.00642v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Approaches to biological species delimitation based on genetic and spatial dissimilarity",
    "abstract": "The delimitation of biological species, i.e., deciding which individuals belong to the same species and whether and how many different species are represented in a data set, is key to the conservation of biodiversity. Much existing work uses only genetic data for species delimitation, often employing some kind of cluster analysis. This can be misleading, because geographically distant groups of individuals can be genetically quite different even if they belong to the same species. We investigate the problem of testing whether two potentially separated groups of individuals can belong to a single species or not based on genetic and spatial data. Existing methods such as the partial Mantel test and jackknife-based distance-distance regression are considered. New approaches, i.e., an adaptation of a mixed effects model, a bootstrap approach, and a jackknife version of partial Mantel, are proposed. All these methods address the issue that distance data violate the independence assumption for standard inference regarding correlation and regression; a standard linear regression is also considered. The approaches are compared on simulated meta-populations generated with SLiM and GSpace - two software packages that can simulate spatially-explicit genetic data at an individual level. Simulations show that the new jackknife version of the partial Mantel test provides a good compromise between power and respecting the nominal type I error rate. Mixed-effects models have larger power than jackknife-based methods, but tend to display type I error rates slightly above the significance level. An application on brassy ringlets concludes the paper.",
    "authors": [
      "Gabriele d'Angella",
      "Christian Hennig"
    ],
    "publication_date": "2024-01-22T17:08:59Z",
    "arxiv_id": "http://arxiv.org/abs/2401.12126v5",
    "download_url": "https://arxiv.org/abs/2401.12126v5",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A novel multi-exposure-to-multi-mediator mediation model for imaging genetic study of brain disorders",
    "abstract": "Common psychiatric and brain disorders are highly heritable and affected by a number of genetic risk factors, yet the mechanism by which these genetic factors contribute to the disorders through alterations in brain structure and function remain poorly understood. Contemporary imaging genetic studies integrate genetic and neuroimaging data to investigate how genetic variation contributes to brain disorders via intermediate neuroimaging endophenotypes. However, the large number of potential exposures (genes) and mediators (neuroimaging features) pose new challenges to the traditional mediation analysis. In this paper, we propose a novel multi-exposure-to-multi-mediator mediation model that integrates genetic, neuroimaging and phenotypic data to investigate the \"geneneuroimaging-brain disorder\" mediation pathway. Our method jointly reduces the dimensions of exposures and mediators into low-dimensional aggregators where the mediation effect is maximized. We further introduce sparsity into the loadings to improve the interpretability. To target the bi-convex optimization problem, we implement an efficient alternating direction method of multipliers algorithm with block coordinate updates. We provide theoretical guarantees for the convergence of our algorithm and establish the asymptotic properties of the resulting estimators. Through extensive simulations, we demonstrate that our method outperforms other competing methods in recovering true loadings and true mediation proportions across a wide range of signal strengths, noise levels, and correlation structures. We further illustrate the utility of the method through a mediation analysis that integrates genetic, brain functional connectivity and smoking behavior data from UK Biobank, and identifies critical genes that impact nicotine dependence via changing the functional connectivity in specific brain regions.",
    "authors": [
      "Neng Wang",
      "Eric V. Slud",
      "Tianzhou Ma"
    ],
    "publication_date": "2025-11-25T15:37:30Z",
    "arxiv_id": "http://arxiv.org/abs/2511.20412v1",
    "download_url": "https://arxiv.org/abs/2511.20412v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Multifactorial Optimization Paradigm for Linkage Tree Genetic Algorithm",
    "abstract": "Linkage Tree Genetic Algorithm (LTGA) is an effective Evolutionary Algorithm (EA) to solve complex problems using the linkage information between problem variables. LTGA performs well in various kinds of single-task optimization and yields promising results in comparison with the canonical genetic algorithm. However, LTGA is an unsuitable method for dealing with multi-task optimization problems. On the other hand, Multifactorial Optimization (MFO) can simultaneously solve independent optimization problems, which are encoded in a unified representation to take advantage of the process of knowledge transfer. In this paper, we introduce Multifactorial Linkage Tree Genetic Algorithm (MF-LTGA) by combining the main features of both LTGA and MFO. MF-LTGA is able to tackle multiple optimization tasks at the same time, each task learns the dependency between problem variables from the shared representation. This knowledge serves to determine the high-quality partial solutions for supporting other tasks in exploring the search space. Moreover, MF-LTGA speeds up convergence because of knowledge transfer of relevant problems. We demonstrate the effectiveness of the proposed algorithm on two benchmark problems: Clustered Shortest-Path Tree Problem and Deceptive Trap Function. In comparison to LTGA and existing methods, MF-LTGA outperforms in quality of the solution or in computation time.",
    "authors": [
      "Huynh Thi Thanh Binh",
      "Pham Dinh Thanh",
      "Tran Ba Trung",
      "Le Cong Thanh",
      "Le Minh Hai Phong",
      "Ananthram Swami",
      "Bui Thu Lam"
    ],
    "publication_date": "2020-05-06T19:28:39Z",
    "arxiv_id": "http://arxiv.org/abs/2005.03090v1",
    "download_url": "https://arxiv.org/abs/2005.03090v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Programming Framework for Fingerprint Matching",
    "abstract": "A fingerprint matching is a very difficult problem. Minutiae based matching is the most popular and widely used technique for fingerprint matching. The minutiae points considered in automatic identification systems are based normally on termination and bifurcation points. In this paper we propose a new technique for fingerprint matching using minutiae points and genetic programming. The goal of this paper is extracting the mathematical formula that defines the minutiae points.",
    "authors": [
      "Ismail A. Ismail",
      "Nabawia A. ElRamly",
      "Mohammed A. Abd-ElWahid",
      "Passent M. ElKafrawy",
      "Mohammed M. Nasef"
    ],
    "publication_date": "2009-12-05T13:27:10Z",
    "arxiv_id": "http://arxiv.org/abs/0912.1017v1",
    "download_url": "https://arxiv.org/abs/0912.1017v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic algorithm for robotic telescope scheduling",
    "abstract": "This work was inspired by author experiences with a telescope scheduling. Author long time goal is to develop and further extend software for an autonomous observatory. The software shall provide users with all the facilities they need to take scientific images of the night sky, cooperate with other autonomous observatories, and possibly more. This works shows how genetic algorithm can be used for scheduling of a single observatory, as well as network of observatories.",
    "authors": [
      "Petr Kubanek"
    ],
    "publication_date": "2010-01-31T05:19:58Z",
    "arxiv_id": "http://arxiv.org/abs/1002.0108v1",
    "download_url": "https://arxiv.org/abs/1002.0108v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Are Genetically Robust Regulatory Networks Dynamically Different from Random Ones?",
    "abstract": "We study a genetic regulatory network model developed to demonstrate that genetic robustness can evolve through stabilizing selection for optimal phenotypes. We report preliminary results on whether such selection could result in a reorganization of the state space of the system. For the chosen parameters, the evolution moves the system slightly toward the more ordered part of the phase diagram. We also find that strong memory effects cause the Derrida annealed approximation to give erroneous predictions about the model's phase diagram.",
    "authors": [
      "Volkan Sevim",
      "Per Arne Rikvold"
    ],
    "publication_date": "2007-03-09T17:54:22Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0703022v2",
    "download_url": "https://arxiv.org/abs/q-bio/0703022v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Production System Rules as Protein Complexes from Genetic Regulatory Networks",
    "abstract": "This short paper introduces a new way by which to design production system rules. An indirect encoding scheme is presented which views such rules as protein complexes produced by the temporal behaviour of an artificial genetic regulatory network. This initial study begins by using a simple Boolean regulatory network to produce traditional ternary-encoded rules before moving to a fuzzy variant to produce real-valued rules. Competitive performance is shown with related genetic regulatory networks and rule-based systems on benchmark problems.",
    "authors": [
      "Larry Bull"
    ],
    "publication_date": "2012-01-20T20:30:59Z",
    "arxiv_id": "http://arxiv.org/abs/1201.4737v1",
    "download_url": "https://arxiv.org/abs/1201.4737v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetically Optimized Prediction of Remaining Useful Life",
    "abstract": "The application of remaining useful life (RUL) prediction has taken great importance in terms of energy optimization, cost-effectiveness, and risk mitigation. The existing RUL prediction algorithms mostly constitute deep learning frameworks. In this paper, we implement LSTM and GRU models and compare the obtained results with a proposed genetically trained neural network. The current models solely depend on Adam and SGD for optimization and learning. Although the models have worked well with these optimizers, even little uncertainties in prognostics prediction can result in huge losses. We hope to improve the consistency of the predictions by adding another layer of optimization using Genetic Algorithms. The hyper-parameters - learning rate and batch size are optimized beyond manual capacity. These models and the proposed architecture are tested on the NASA Turbofan Jet Engine dataset. The optimized architecture can predict the given hyper-parameters autonomously and provide superior results.",
    "authors": [
      "Shaashwat Agrawal",
      "Sagnik Sarkar",
      "Gautam Srivastava",
      "Praveen Kumar Reddy Maddikunta",
      "Thippa Reddy Gadekallu"
    ],
    "publication_date": "2021-02-17T16:09:23Z",
    "arxiv_id": "http://arxiv.org/abs/2102.08845v1",
    "download_url": "https://arxiv.org/abs/2102.08845v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Disentangling the effects of traits with shared clustered genetic predictors using multivariable Mendelian randomization",
    "abstract": "When genetic variants in a gene cluster are associated with a disease outcome, the causal pathway from the variants to the outcome can be difficult to disentangle. For example, the chemokine receptor gene cluster contains genetic variants associated with various cytokines. Associations between variants in this cluster and stroke risk may be driven by any of these cytokines. Multivariable Mendelian randomization is an extension of standard univariable Mendelian randomization to estimate the direct effects of related exposures with shared genetic predictors. However, when genetic variants are clustered, a Goldilocks dilemma arises: including too many highly-correlated variants in the analysis can lead to ill-conditioning, but pruning variants too aggressively can lead to imprecise estimates or even lack of identification. We propose multivariable methods that use principal component analysis to reduce many correlated genetic variants into a smaller number of orthogonal components that are used as instrumental variables. We show in simulations that these methods result in more precise estimates that are less sensitive to numerical instability due to both strong correlations and small changes in the input data. We apply the methods to demonstrate the most likely causal risk factor for stroke at the chemokine gene cluster is monocyte chemoattractant protein-1.",
    "authors": [
      "Fatima Batool",
      "Ashish Patel",
      "Dipender Gill",
      "Stephen Burgess"
    ],
    "publication_date": "2021-09-25T13:10:47Z",
    "arxiv_id": "http://arxiv.org/abs/2109.12361v2",
    "download_url": "https://arxiv.org/abs/2109.12361v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Complexity in a Drosophila Model of Diabetes-Associated Misfolded Human Proinsulin",
    "abstract": "Here we use Drosophila melanogaster to create a genetic model of human permanent neonatal diabetes mellitus and present experimental results describing dimensions of this complexity. The approach involves the transgenic expression of a misfolded mutant of human preproinsulin, hINSC96Y, which is a cause of the disease. When expressed in fly imaginal discs, hINSC96Y causes a reduction of adult structures, including the eye, wing and notum. Eye imaginal discs exhibit defects in both the structure and arrangement of ommatidia. In the wing, expression of hINSC96Y leads to ectopic expression of veins and mechano-sensory organs, indicating disruption of wild type signaling processes regulating cell fates. These readily measurable disease phenotypes are sensitive to temperature, gene dose and sex. Mutant (but not wild type) proinsulin expression in the eye imaginal disc induces IRE1-mediated Xbp1 alternative splicing, a signal for endoplasmic reticulum stress response activation, and produces global change in gene expression. Mutant hINS transgene tester strains, when crossed to stocks from the Drosophila Genetic Reference Panel produces F1 adults with a continuous range of disease phenotypes and large broad-sense heritability. Surprisingly, the severity of mutant hINS-induced disease in the eye is not correlated with that in the notum in these crosses, nor with eye reduction phenotypes caused by the expression of two dominant eye mutants acting in two different eye development pathways, Drop (Dr) or Lobe (L) when crossed into the same genetic backgrounds. The tissue specificity of genetic variability for mutant hINS-induced disease thus has its own distinct signature. The genetic dominance of disease-specific phenotypic variability makes this approach amenable to genome-wide association study (GWAS) in a simple F1 screen of natural variation.",
    "authors": [
      "Soo-Young Park",
      "Michael Z. Ludwig",
      "Natalia A. Tamarina",
      "Bin Z. He",
      "Sarah H. Carl",
      "Desiree A. Dickerson",
      "Levi Barse",
      "Bharath Arun",
      "Calvin Williams",
      "Cecelia M. Miles",
      "Louis H. Philipson",
      "Donald F. Steiner",
      "Graeme I. Bell",
      "Martin Kreitman"
    ],
    "publication_date": "2013-05-31T20:55:54Z",
    "arxiv_id": "http://arxiv.org/abs/1306.0025v1",
    "download_url": "https://arxiv.org/abs/1306.0025v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimality of the genetic code with respect to protein stability and amino acid frequencies",
    "abstract": "How robust is the natural genetic code with respect to mistranslation errors? It has long been known that the genetic code is very efficient in limiting the effect of point mutation. A misread codon will commonly code either for the same amino acid or for a similar one in terms of its biochemical properties, so the structure and function of the coded protein remain relatively unaltered. Previous studies have attempted to address this question more quantitatively, namely by statistically estimating the fraction of randomly generated codes that do better than the genetic code regarding its overall robustness. In this paper, we extend these results by investigating the role of amino acid frequencies in the optimality of the genetic code. When measuring the relative fitness of the natural code with respect to a random code, it is indeed natural to assume that a translation error affecting a frequent amino acid is less favorable than that of a rare one, at equal mutation cost. We find that taking the amino acid frequency into account accordingly decreases the fraction of random codes that beat the natural code, making the latter comparatively even more robust. This effect is particularly pronounced when more refined measures of the amino acid substitution cost are used than hydrophobicity. To show this, we devise a new cost function by evaluating with computer experiments the change in folding free energy caused by all possible single-site mutations in a set of known protein structures. With this cost function, we estimate that of the order of one random code out of 100 millions is more fit than the natural code when taking amino acid frequencies into account. The genetic code seems therefore structured so as to minimize the consequences of translation errors on the 3D structure and stability of proteins.",
    "authors": [
      "Dimitri Gilis",
      "Serge Massar",
      "Nicolas Cerf",
      "Marianne Rooman"
    ],
    "publication_date": "2001-02-14T16:38:47Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0102044v1",
    "download_url": "https://arxiv.org/abs/physics/0102044v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ACE of Space: Estimating Genetic Components of High-Dimensional Imaging Data",
    "abstract": "It is of great interest to quantify the contributions of genetic variation to brain structure and function, which are usually measured by high-dimensional imaging data (e.g., magnetic resonance imaging). In addition to the variance, the covariance patterns in the genetic effects of a functional phenotype are of biological importance, and covariance patterns have been linked to psychiatric disorders. The aim of this paper is to develop a scalable method to estimate heritability and the non-stationary covariance components in high-dimensional imaging data from twin studies. Our motivating example is from the Human Connectome Project (HCP). Several major big-data challenges arise from estimating the genetic and environmental covariance functions of functional phenotypes extracted from imaging data, such as cortical thickness with 60,000 vertices. Notably, truncating to positive eigenvalues and their eigenfunctions from unconstrained estimators can result in large bias. This motivated our development of a novel estimator ensuring positive semidefiniteness. Simulation studies demonstrate large improvements over existing approaches, both with respect to heritability estimates and covariance estimation. We applied the proposed method to cortical thickness data from the HCP. Our analysis suggests fine-scale differences in covariance patterns, identifying locations in which genetic control is correlated with large areas of the brain and locations where it is highly localized.",
    "authors": [
      "Benjamin B. Risk",
      "Hongtu Zhu"
    ],
    "publication_date": "2019-05-17T23:44:38Z",
    "arxiv_id": "http://arxiv.org/abs/1905.07502v1",
    "download_url": "https://arxiv.org/abs/1905.07502v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Currency exchange prediction using machine learning, genetic algorithms and technical analysis",
    "abstract": "Technical analysis is used to discover investment opportunities. To test this hypothesis we propose an hybrid system using machine learning techniques together with genetic algorithms. Using technical analysis there are more ways to represent a currency exchange time series than the ones it is possible to test computationally, i.e., it is unfeasible to search the whole input feature space thus a genetic algorithm is an alternative. In this work, an architecture for automatic feature selection is proposed to optimize the cross validated performance estimation of a Naive Bayes model using a genetic algorithm. The proposed architecture improves the return on investment of the unoptimized system from 0,43% to 10,29% in the validation set. The features selected and the model decision boundary are visualized using the algorithm t-Distributed Stochastic Neighbor embedding.",
    "authors": [
      "Gonçalo Abreu",
      "Rui Neves",
      "Nuno Horta"
    ],
    "publication_date": "2018-05-29T03:36:34Z",
    "arxiv_id": "http://arxiv.org/abs/1805.11232v1",
    "download_url": "https://arxiv.org/abs/1805.11232v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dynamic sampling bias and overdispersion induced by skewed offspring distributions",
    "abstract": "Natural populations often show enhanced genetic drift consistent with a strong skew in their offspring number distribution. The skew arises because the variability of family sizes is either inherently strong or amplified by population expansions, leading to so-called `jackpot' events. The resulting allele frequency fluctuations are large and, therefore, challenge standard models of population genetics, which assume sufficiently narrow offspring distributions. While the neutral dynamics backward in time can be readily analyzed using coalescent approaches, we still know little about the effect of broad offspring distributions on the dynamics forward in time, especially with selection. Here, we employ an exact asymptotic analysis combined with a scaling hypothesis to demonstrate that over-dispersed frequency trajectories emerge from the competition of conventional forces, such as selection or mutations, with an emerging time-dependent sampling bias against the minor allele. The sampling bias arises from the characteristic time-dependence of the largest sampled family size within each allelic type. Using this insight, we establish simple scaling relations for allele frequency fluctuations, fixation probabilities, extinction times, and the site frequency spectra that arise when offspring numbers are distributed according to a power law $~n^{-(1+α)}$. To demonstrate that this coarse-grained model captures a wide variety of non-equilibrium dynamics, we validate our results in traveling waves, where the phenomenon of 'gene surfing' can produce any exponent $1<α<2$. We argue that the concept of a dynamic sampling bias is useful generally to develop both intuition and statistical tests for the unusual dynamics of populations with skewed offspring distributions, which can confound commonly used tests for selection or demographic history.",
    "authors": [
      "Takashi Okada",
      "Oskar Hallatschek"
    ],
    "publication_date": "2021-03-10T03:30:38Z",
    "arxiv_id": "http://arxiv.org/abs/2103.05852v3",
    "download_url": "https://arxiv.org/abs/2103.05852v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pre-Sorted Tsetlin Machine (The Genetic K-Medoid Method)",
    "abstract": "This paper proposes a machine learning pre-sort stage to traditional supervised learning using Tsetlin Machines. Initially, K data-points are identified from the dataset using an expedited genetic algorithm to solve the maximum dispersion problem. These are then used as the initial placement to run the K-Medoid clustering algorithm. Finally, an expedited genetic algorithm is used to align K independent Tsetlin Machines by maximising hamming distance. For MNIST level classification problems, results demonstrate up to 10% improvement in accuracy, approx. 383X reduction in training time and approx. 86X reduction in inference time.",
    "authors": [
      "Jordan Morris"
    ],
    "publication_date": "2024-02-07T15:30:23Z",
    "arxiv_id": "http://arxiv.org/abs/2403.09680v2",
    "download_url": "https://arxiv.org/abs/2403.09680v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sizing Optimization of Truss Structures using a Hybridized Genetic Algorithm",
    "abstract": "This paper presents a genetic-based hybrid algorithm that combines the exploration power of Genetic Algorithm (GA) with the exploitation capacity of a phenotypical probabilistic local search algorithm. Though not limited to a certain class of optimization problems, the proposed algorithm has been \"fine-tuned\" to work particularly efficiently on the optimal design of planar and space structures, a class of problems characterized by the large number of design variables and constraints, high degree of non-linearity and multitude of local minima. The proposed algorithm has been applied to the skeletal weight reduction of various planar and spatial trusses and shown to be superior in all of the cases,",
    "authors": [
      "Reza Najian Asl",
      "Mohamad Aslani",
      "Masoud Shariat Panahi"
    ],
    "publication_date": "2013-06-06T16:11:09Z",
    "arxiv_id": "http://arxiv.org/abs/1306.1454v1",
    "download_url": "https://arxiv.org/abs/1306.1454v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Haplotype frequency inference from pooled genetic data with a latent multinomial model",
    "abstract": "In genetic studies, haplotype data provide more refined information than data about separate genetic markers. However, large-scale studies that genotype hundreds to thousands of individuals may only provide results of pooled data, where only the total allele counts of each marker in each pool are reported. Methods for inferring haplotype frequencies from pooled genetic data that scale well with pool size rely on a normal approximation, which we observe to produce unreliable inference when applied to real data. We illustrate cases where the approximation breaks down, due to the normal covariance matrix being near-singular. As an alternative to approximate methods, in this paper we propose exact methods to infer haplotype frequencies from pooled genetic data based on a latent multinomial model, where the observed allele counts are considered integer combinations of latent, unobserved haplotype counts. One of our methods, latent count sampling via Markov bases, achieves approximately linear runtime with respect to pool size. Our exact methods produce more accurate inference over existing approximate methods for synthetic data and for data based on haplotype information from the 1000 Genomes Project. We also demonstrate how our methods can be applied to time-series of pooled genetic data, as a proof of concept of how our methods are relevant to more complex hierarchical settings, such as spatiotemporal models.",
    "authors": [
      "Yong See Foo",
      "Jennifer A. Flegg"
    ],
    "publication_date": "2023-08-31T05:17:26Z",
    "arxiv_id": "http://arxiv.org/abs/2308.16465v1",
    "download_url": "https://arxiv.org/abs/2308.16465v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Narrow genetic base in forest restoration with holm oak (Quercus ilex L.) in Sicily",
    "abstract": "In order to empirically assess the effect of actual seed sampling strategy on genetic diversity of holm oak (Quercus ilex) forestations in Sicily, we have analysed the genetic composition of two seedling lots (nursery stock and plantation) and their known natural seed origin stand by means of six nuclear microsatellite loci. Significant reduction in genetic diversity and significant difference in genetic composition of the seedling lots compared to the seed origin stand were detected. The female and the total effective number of parents were quantified by means of maternity assignment of seedlings and temporal changes in allele frequencies. Extremely low effective maternity numbers were estimated (Nfe $\\approx$ 2-4) and estimates accounting for both seed and pollen donors gave also low values (Ne $\\approx$ 35-50). These values can be explained by an inappropriate forestry seed harvest strategy limited to a small number of spatially close trees.",
    "authors": [
      "Concetta Burgarella",
      "Miguel Navascués",
      "Álvaro Soto",
      "Ángel Lora",
      "Silvio Fici"
    ],
    "publication_date": "2009-04-08T08:17:18Z",
    "arxiv_id": "http://arxiv.org/abs/0904.1279v1",
    "download_url": "https://arxiv.org/abs/0904.1279v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Future of Decoding Non-Standard Nucleotides: Leveraging Nanopore Sequencing for Expanded Genetic Codes",
    "abstract": "Expanding genetic codes from natural standard nucleotides to artificial non-standard nucleotides marks a significant advancement in synthetic biology, with profound implications for biotechnology and medicine. Decoding the biological information encoded in these non-standard nucleotides presents new challenges, as traditional sequencing technologies are unable to recognize or interpret novel base pairings. In this perspective, we explore the potential of nanopore sequencing, which is uniquely suited to decipher both standard and non-standard nucleotides by directly measuring the biophysical properties of nucleic acids. Nanopore technology offers real-time, long-read sequencing without the need for amplification or synthesis, making it particularly advantageous for expanded genetic systems like Artificially Expanded Genetic Information Systems (AEGIS). We discuss how the adaptability of nanopore sequencing and advancements in data processing can unlock the potential of these synthetic genomes and open new frontiers in understanding and utilizing expanded genetic codes.",
    "authors": [
      "Hyunjin Shim"
    ],
    "publication_date": "2024-09-14T05:17:41Z",
    "arxiv_id": "http://arxiv.org/abs/2409.09314v1",
    "download_url": "https://arxiv.org/abs/2409.09314v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multifunctional fiber-based optoacoustic emitter for non-genetic bidirectional neural communication",
    "abstract": "A bidirectional brain interface with both \"write\" and \"read\" functions can be an important tool for fundamental studies and potential clinical treatments for neurological diseases. Here we report a miniaturized multifunctional fiber based optoacoustic emitter (mFOE) that first integrates simultaneous non-genetic optoacoustic stimulation for \"write\" and electrophysiology recording of neural circuits for \"read\". The non-genetic feature addresses the challenges of the viral transfection required by optogenetics in primates and human. The orthogonality between optoacoustic waves and electrical field provides a solution to avoid the interference between electrical stimulation and recording. We first validated the non-genetic stimulation function of the mFOE in rat cultured neurons using calcium imaging. In vivo application of mFOE for successful simultaneous optoacoustic stimulation and electrical recording of brain activities was confirmed in mouse hippocampus in both acute and chronical applications up to 1 month. Minimal brain tissue damage has been confirmed after these applications. The capability of non-genetic neural stimulation and recording enabled by mFOE opens up new possibilities for the investigation of neural circuits and brings new insights into the study of ultrasound neurostimulation.",
    "authors": [
      "Nan Zheng",
      "Ying Jiang",
      "Shan Jiang",
      "Jongwoon Kim",
      "Yueming Li",
      "Ji-Xin Cheng",
      "Xiaoting Jia",
      "Chen Yang"
    ],
    "publication_date": "2023-01-09T20:04:50Z",
    "arxiv_id": "http://arxiv.org/abs/2301.03659v1",
    "download_url": "https://arxiv.org/abs/2301.03659v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A mixture distribution approach for assessing genetic impact from twin study",
    "abstract": "This work was motivated by a twin study with the goal of assessing the genetic control of immune traits. We propose a mixture bivariate distribution to model twin data where the underlying order within a pair is unclear. Though estimation from mixture distribution is usually subject to low convergence rate, the combined likelihood, which is constructed over monozygotic and dizygotic twins combined, reaches root-n consistency and allows effective statistical inference on the genetic impact. The method is applicable to general unordered pairs.",
    "authors": [
      "Zonghui Hu",
      "Pengfei Li",
      "Dean Follmann",
      "Jing Qin"
    ],
    "publication_date": "2025-07-18T02:16:20Z",
    "arxiv_id": "http://arxiv.org/abs/2507.13605v1",
    "download_url": "https://arxiv.org/abs/2507.13605v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding the genetic basis of variation in meiotic recombination: past, present, and future",
    "abstract": "Meiotic recombination is a fundamental feature of sexually reproducing species. It is often required for proper chromosome segregation and plays important role in adaptation and the maintenance of genetic diversity. The molecular mechanisms of recombination are remarkably conserved across eukaryotes, yet meiotic genes and proteins show substantial variation in their sequence and function, even between closely related species. Furthermore, the rate and distribution of recombination shows a huge diversity within and between chromosomes, individuals, sexes, populations, and species. This variation has implications for many molecular and evolutionary processes, yet how and why this diversity has evolved is not well understood. A key step in understanding trait evolution is to determine its genetic basis - that is, the number, effect sizes, and distribution of loci underpinning variation. In this perspective, I discuss past and current knowledge on the genetic basis of variation in recombination rate and distribution, explore its evolutionary implications, and present open questions for future research.",
    "authors": [
      "Susan E. Johnston"
    ],
    "publication_date": "2024-04-18T16:10:06Z",
    "arxiv_id": "http://arxiv.org/abs/2404.12288v2",
    "download_url": "https://arxiv.org/abs/2404.12288v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Feedback Control of Turbulent Shear Flows by Genetic Programming",
    "abstract": "Turbulent shear flows have triggered fundamental research in nonlinear dynamics, like transition scenarios, pattern formation and dynamical modeling. In particular, the control of nonlinear dynamics is subject of research since decades. In this publication, actuated turbulent shear flows serve as test-bed for a nonlinear feedback control strategy which can optimize an arbitrary cost function in an automatic self-learning manner. This is facilitated by genetic programming providing an analytically treatable control law. Unlike control based on PID laws or neural networks, no structure of the control law needs to be specified in advance. The strategy is first applied to low-dimensional dynamical systems featuring aspects of turbulence and for which linear control methods fail. This includes stabilizing an unstable fixed point of a nonlinearly coupled oscillator model and maximizing mixing, i.e.\\ the Lyapunov exponent, for forced Lorenz equations. For the first time, we demonstrate the applicability of genetic programming control to four shear flow experiments with strong nonlinearities and intrinsically noisy measurements. These experiments comprise mixing enhancement in a turbulent shear layer, the reduction of the recirculation zone behind a backward facing step, and the optimized reattachment of separating boundary layers. Genetic programming control has outperformed tested optimized state-of-the-art control and has even found novel actuation mechanisms.",
    "authors": [
      "Thomas Duriez",
      "Vladimir Parezanović",
      "Kai von Krbek",
      "Jean-Paul Bonnet",
      "Laurent Cordier",
      "Bernd R. Noack",
      "Marc Segond",
      "Markus Abel",
      "Nicolas Gautier",
      "Jean-Luc Aider",
      "Cedric Raibaudo",
      "Christophe Cuvier",
      "Michel Stanislas",
      "Antoine Debien",
      "Nicolas Mazellier",
      "Azeddine Kourta",
      "Steven L. Brunton"
    ],
    "publication_date": "2015-05-05T14:45:55Z",
    "arxiv_id": "http://arxiv.org/abs/1505.01022v1",
    "download_url": "https://arxiv.org/abs/1505.01022v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Genetic Algorithm for Navigating Synthesizable Molecular Spaces",
    "abstract": "Inspired by the effectiveness of genetic algorithms and the importance of synthesizability in molecular design, we present SynGA, a simple genetic algorithm that operates directly over synthesis routes. Our method features custom crossover and mutation operators that explicitly constrain it to synthesizable molecular space. By modifying the fitness function, we demonstrate the effectiveness of SynGA on a variety of design tasks, including synthesizable analog search and sample-efficient property optimization, for both 2D and 3D objectives. Furthermore, by coupling SynGA with a machine learning-based filter that focuses the building block set, we boost SynGA to state-of-the-art performance. For property optimization, this manifests as a model-based variant SynGBO, which employs SynGA and block filtering in the inner loop of Bayesian optimization. Since SynGA is lightweight and enforces synthesizability by construction, our hope is that SynGA can not only serve as a strong standalone baseline but also as a versatile module that can be incorporated into larger synthesis-aware workflows in the future.",
    "authors": [
      "Alston Lo",
      "Connor W. Coley",
      "Wojciech Matusik"
    ],
    "publication_date": "2025-09-25T03:33:30Z",
    "arxiv_id": "http://arxiv.org/abs/2509.20719v1",
    "download_url": "https://arxiv.org/abs/2509.20719v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Estimating the Strength of Selective Sweeps from Deep Population Diversity Data",
    "abstract": "Selective sweeps are typically associated with a local reduction of genetic diversity around the adaptive site. However, selective sweeps can also quickly carry neutral mutations to observable population frequencies if they arise early in a sweep and hitchhike with the adaptive allele. We show that the interplay between mutation and exponential amplification through hitchhiking results in a characteristic frequency spectrum of the resulting novel haplotype variation that depends only on the ratio of the mutation rate and the selection coefficient of the sweep. Based on this result, we develop an estimator for the selection coefficient driving a sweep. Since this estimator utilizes the novel variation arising from mutations during a sweep, it does not rely on preexisting variation and can also be applied to loci that lack recombination. Compared with standard approaches that infer selection coefficients from the size of dips in genetic diversity around the adaptive site, our estimator requires much shorter sequences but sampled at high population depth in order to capture low-frequency variants; given such data, it consistently outperforms standard approaches. We investigate analytically and numerically how the accuracy of our estimator is affected by the decay of the sweep pattern over time as a consequence of random genetic drift and discuss potential effects of recombination, soft sweeps, and demography. As an example for its use, we apply our estimator to deep sequencing data from HIV populations.",
    "authors": [
      "Philipp W. Messer",
      "Richard A. Neher"
    ],
    "publication_date": "2012-06-28T17:28:06Z",
    "arxiv_id": "http://arxiv.org/abs/1206.6768v1",
    "download_url": "https://arxiv.org/abs/1206.6768v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quadrupole Magnet Design based on Genetic Multi-Objective Optimization",
    "abstract": "This work suggests to optimize the geometry of a quadrupole magnet by means of a genetic algorithm adapted to solve multi-objective optimization problems. To that end, a non-domination sorting genetic algorithm known as NSGA-III is used. The optimization objectives are chosen such that a high magnetic field quality in the aperture of the magnet is guaranteed, while simultaneously the magnet design remains cost-efficient. The field quality is computed using a magnetostatic finite element model of the quadrupole, the results of which are post-processed and integrated into the optimization algorithm. An extensive analysis of the optimization results is performed, including Pareto front movements and identification of best designs.",
    "authors": [
      "Eric Diehl",
      "Moritz von Tresckow",
      "Lou Scholtissek",
      "Dimitrios Loukrezis",
      "Nicolas Marsic",
      "Wolfgang F. O. Müller",
      "Herbert De Gersem"
    ],
    "publication_date": "2022-11-17T15:12:33Z",
    "arxiv_id": "http://arxiv.org/abs/2211.09580v2",
    "download_url": "https://arxiv.org/abs/2211.09580v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Goodness of Fit for Bayesian Generative Models with Applications in Population Genetics",
    "abstract": "In population genetics and other application fields, models with intractable likelihood are common. Approximate Bayesian Computation (ABC) or more generally Simulation-Based Inference (SBI) methods work by simulating instrumental data sets from the models under study and comparing them with the observed data set, using advanced machine learning tools for tasks such as model selection and parameter inference. The present work focuses on model criticism, and more specifically on Goodness of fit (GoF) tests, for intractable likelihood models. We introduce two new GoF tests: the pre-inference \\gof tests whether the observed dataset is distributed from the prior predictive distribution, while the post-inference GoF tests whether there is a parameter value such that the observed dataset is distributed from the likelihood with that value. The pre-inference test can be used to prune a large set of models using a limited amount of simulations, while the post-inference test is used to assess the fit of a selected model. Both tests are based on the Local Outlier Factor (LOF, Breunig et al., 2000). This indicator was initially defined for outlier and novelty detection. It is able to quantify local density deviations, capturing subtleties that a more traditional k-NN-based approach may miss. We evaluated the performance of our two GoF tests on simulated datasets from three different model settings of varying complexity. We then illustrate the utility of these approaches on a dataset of single nucleotide polymorphism (SNP) markers for the evaluation of complex evolutionary scenarios of modern human populations. Our dual-test GoF approach highlights the flexibility of our method: the pre-inference \\gof test provides insight into model validity from a Bayesian perspective, while the post-inference test provides a more general and traditional view of assessing goodness of fit",
    "authors": [
      "Guillaume Le Mailloux",
      "Paul Bastide",
      "Jean-Michel Marin",
      "Arnaud Estoup"
    ],
    "publication_date": "2025-01-28T17:48:17Z",
    "arxiv_id": "http://arxiv.org/abs/2501.17107v1",
    "download_url": "https://arxiv.org/abs/2501.17107v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Genetic Fuzzy-Enabled Framework on Robotic Manipulation for In-Space Servicing",
    "abstract": "Automation of robotic systems for servicing in cislunar space is becoming extremely important as the number of satellites in orbit increases. Safety is critical in performing satellite maintenance, so the control techniques utilized must be trusted in addition to being highly efficient. In this work, Genetic Fuzzy Trees are combined with the widely used LQR control scheme via Thales' TrUE AI Toolkit to create a trusted and efficient controller for a two-degree-of-freedom planar robotic manipulator that would theoretically be used to perform satellite maintenance. It was found that Genetic Fuzzy-LQR is 18.5% more performant than optimal LQR on average, and that it is incredibly robust to uncertainty.",
    "authors": [
      "Nathan Steffen",
      "Wilhelm Louw",
      "Nicholas Ernest",
      "Timothy Arnett",
      "Kelly Cohen"
    ],
    "publication_date": "2025-04-21T16:57:56Z",
    "arxiv_id": "http://arxiv.org/abs/2504.15226v1",
    "download_url": "https://arxiv.org/abs/2504.15226v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Genetic algorithm to solve the container storage space allocation problem",
    "abstract": "This paper presented a genetic algorithm (GA) to solve the container storage problem in the port. This problem is studied with different container types such as regular, open side, open top, tank, empty and refrigerated containers. The objective of this problem is to determine an optimal containers arrangement, which respects customers delivery deadlines, reduces the rehandle operations of containers and minimizes the stop time of the container ship. In this paper, an adaptation of the genetic algorithm to the container storage problem is detailed and some experimental results are presented and discussed. The proposed approach was compared to a Last In First Out (LIFO) algorithm applied to the same problem and has recorded good results",
    "authors": [
      "I. Ayachi",
      "R. Kammarti",
      "M. Ksouri",
      "P. Borne",
      ":",
      "LAGIS",
      "Ecole Centrale de Lille",
      ":",
      "LACS",
      "Ecole Nationale des Ingenieurs de Tunis"
    ],
    "publication_date": "2013-03-05T14:45:30Z",
    "arxiv_id": "http://arxiv.org/abs/1303.1051v1",
    "download_url": "https://arxiv.org/abs/1303.1051v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The first steps of adaptation of Escherichia coli to the gut are dominated by soft sweeps",
    "abstract": "The accumulation of adaptive mutations is essential for survival in novel environments. However, in clonal populations with a high mutational supply, the power of natural selection is expected to be limited. This is due to clonal interference - the competition of clones carrying different beneficial mutations - which leads to the loss of many small effect mutations and fixation of large effect ones. If interference is abundant, then mechanisms for horizontal transfer of genes, which allow the immediate combination of beneficial alleles in a single background, are expected to evolve. However, the relevance of interference in natural complex environments, such as the gut, is poorly known. To address this issue, we studied the invasion of beneficial mutations responsible for Escherichia coli's adaptation to the mouse gut and demonstrate the pervasiveness of clonal interference. The observed dynamics of change in frequency of beneficial mutations are consistent with soft sweeps, where a similar adaptive mutation arises repeatedly on different haplotypes without reaching fixation. The genetic basis of the adaptive mutations revealed a striking parallelism in independently evolving populations. This was mainly characterized by the insertion of transposable elements in both coding and regulatory regions of a few genes. Interestingly in most populations, we observed a complete phenotypic sweep without loss of genetic variation. The intense clonal interference during adaptation to the gut environment, here demonstrated, may be important for our understanding of the levels of strain diversity of E. coli inhabiting the human gut microbiota and of its recombination rate.",
    "authors": [
      "João Barroso-Batista",
      "Ana Sousa",
      "Marta Lourenço",
      "Marie-Louise Bergman",
      "Jocelyne Demengeot",
      "Karina B. Xavier",
      "Isabel Gordo"
    ],
    "publication_date": "2013-11-11T13:24:52Z",
    "arxiv_id": "http://arxiv.org/abs/1311.2435v1",
    "download_url": "https://arxiv.org/abs/1311.2435v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "GreMuTRRR: A Novel Genetic Algorithm to Solve Distance Geometry Problem for Protein Structures",
    "abstract": "Nuclear Magnetic Resonance (NMR) Spectroscopy is a widely used technique to predict the native structure of proteins. However, NMR machines are only able to report approximate and partial distances between pair of atoms. To build the protein structure one has to solve the Euclidean distance geometry problem given the incomplete interval distance data produced by NMR machines. In this paper, we propose a new genetic algorithm for solving the Euclidean distance geometry problem for protein structure prediction given sparse NMR data. Our genetic algorithm uses a greedy mutation operator to intensify the search, a twin removal technique for diversification in the population and a random restart method to recover stagnation. On a standard set of benchmark dataset, our algorithm significantly outperforms standard genetic algorithms.",
    "authors": [
      "Md. Lisul Islam",
      "Swakkhar Shatabda",
      "M. Sohel Rahman"
    ],
    "publication_date": "2014-11-16T11:26:06Z",
    "arxiv_id": "http://arxiv.org/abs/1411.4246v1",
    "download_url": "https://arxiv.org/abs/1411.4246v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Random Weight Change Algorithm for the Learning of Multilayer Neural Networks",
    "abstract": "A new method to improve the performance of Random weight change (RWC) algorithm based on a simple genetic algorithm, namely, Genetic random weight change (GRWC) is proposed. It is to find the optimal values of global minima via learning. In contrast to Random Weight Change (RWC), GRWC contains an effective optimization procedure which are good at exploring a large and complex space in an intellectual strategies influenced by the GA/RWC synergy. By implementing our simple GA in RWC we achieve an astounding accuracy of finding global minima.",
    "authors": [
      "Mohammad Ibraim Sarker",
      "Yali Nie",
      "Hong Yongki",
      "Hyongsuk Kim"
    ],
    "publication_date": "2019-06-05T09:08:58Z",
    "arxiv_id": "http://arxiv.org/abs/1906.01892v1",
    "download_url": "https://arxiv.org/abs/1906.01892v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the performance of different mutation operators of a subpopulation-based genetic algorithm for multi-robot task allocation problems",
    "abstract": "The performance of different mutation operators is usually evaluated in conjunc-tion with specific parameter settings of genetic algorithms and target problems. Most studies focus on the classical genetic algorithm with different parameters or on solving unconstrained combinatorial optimization problems such as the traveling salesman problems. In this paper, a subpopulation-based genetic al-gorithm that uses only mutation and selection is developed to solve multi-robot task allocation problems. The target problems are constrained combinatorial optimization problems, and are more complex if cooperative tasks are involved as these introduce additional spatial and temporal constraints. The proposed genetic algorithm can obtain better solutions than classical genetic algorithms with tournament selection and partially mapped crossover. The performance of different mutation operators in solving problems without/with cooperative tasks is evaluated. The results imply that inversion mutation performs better than others when solving problems without cooperative tasks, and the swap-inversion combination performs better than others when solving problems with cooperative tasks.",
    "authors": [
      "Chun Liu",
      "Andreas Kroll"
    ],
    "publication_date": "2016-06-02T09:57:52Z",
    "arxiv_id": "http://arxiv.org/abs/1606.00601v1",
    "download_url": "https://arxiv.org/abs/1606.00601v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reinforced Hybrid Genetic Algorithm for the Traveling Salesman Problem",
    "abstract": "In this paper, we propose a new method called the Reinforced Hybrid Genetic Algorithm (RHGA) for solving the famous NP-hard Traveling Salesman Problem (TSP). Specifically, we combine reinforcement learning with the well-known Edge Assembly Crossover genetic algorithm (EAX-GA) and the Lin-Kernighan-Helsgaun (LKH) local search heuristic. In the hybrid algorithm, LKH can help EAX-GA improve the population by its effective local search, and EAX-GA can help LKH escape from local optima by providing high-quality and diverse initial solutions. We restrict that there is only one special individual among the population in EAX-GA that can be improved by LKH. Such a mechanism can prevent the population diversity, efficiency, and algorithm performance from declining due to the redundant calling of LKH upon the population. As a result, our proposed hybrid mechanism can help EAX-GA and LKH boost each other's performance without reducing the convergence rate of the population. The reinforcement learning technique based on Q-learning further promotes the hybrid genetic algorithm. Experimental results on 138 well-known and widely used TSP benchmarks with the number of cities ranging from 1,000 to 85,900 demonstrate the excellent performance of RHGA.",
    "authors": [
      "Jiongzhi Zheng",
      "Jialun Zhong",
      "Menglei Chen",
      "Kun He"
    ],
    "publication_date": "2021-07-09T07:36:12Z",
    "arxiv_id": "http://arxiv.org/abs/2107.06870v3",
    "download_url": "https://arxiv.org/abs/2107.06870v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Footprints of ancient balanced polymorphisms in genetic variation data",
    "abstract": "When long-lived, balancing selection can lead to trans-species polymorphisms that are shared by two or more species identical by descent. In this case, the gene genealogies at the selected sites cluster by allele instead of by species and, because of linkage, nearby neutral sites also have unusual genealogies. Although it is clear that this scenario should lead to discernible footprints in genetic variation data, notably the presence of additional neutral polymorphisms shared between species and the absence of fixed differences, the effects remain poorly characterized. We focus on the case of a single site under long-lived balancing selection and derive approximations for summaries of the data that are sensitive to a trans-species polymorphism: the length of the segment that carries most of the signals, the expected number of shared neutral SNPs within the segment and the patterns of allelic associations among them. Coalescent simulations of ancient balancing selection confirm the accuracy of our approximations. We further show that for humans and chimpanzees, and more generally for pairs of species with low genetic diversity levels, the patterns of genetic variation on which we focus are highly unlikely to be generated by neutral recurrent mutations, so these statistics are specific as well as sensitive. We discuss the implications of our results for the design and interpretation of genome scans for ancient balancing selection in apes and other taxa.",
    "authors": [
      "Ziyue Gao",
      "Molly Przeworski",
      "Guy Sella"
    ],
    "publication_date": "2014-01-29T17:05:45Z",
    "arxiv_id": "http://arxiv.org/abs/1401.7589v1",
    "download_url": "https://arxiv.org/abs/1401.7589v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simple Genetic Operators are Universal Approximators of Probability Distributions (and other Advantages of Expressive Encodings)",
    "abstract": "This paper characterizes the inherent power of evolutionary algorithms. This power depends on the computational properties of the genetic encoding. With some encodings, two parents recombined with a simple crossover operator can sample from an arbitrary distribution of child phenotypes. Such encodings are termed \\emph{expressive encodings} in this paper. Universal function approximators, including popular evolutionary substrates of genetic programming and neural networks, can be used to construct expressive encodings. Remarkably, this approach need not be applied only to domains where the phenotype is a function: Expressivity can be achieved even when optimizing static structures, such as binary vectors. Such simpler settings make it possible to characterize expressive encodings theoretically: Across a variety of test problems, expressive encodings are shown to achieve up to super-exponential convergence speed-ups over the standard direct encoding. The conclusion is that, across evolutionary computation areas as diverse as genetic programming, neuroevolution, genetic algorithms, and theory, expressive encodings can be a key to understanding and realizing the full power of evolution.",
    "authors": [
      "Elliot Meyerson",
      "Xin Qiu",
      "Risto Miikkulainen"
    ],
    "publication_date": "2022-02-19T20:54:37Z",
    "arxiv_id": "http://arxiv.org/abs/2202.09679v4",
    "download_url": "https://arxiv.org/abs/2202.09679v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Does Collective Genetic Regulation exist?",
    "abstract": "Does regulation in the genome use collective behavior, similar to the way the brain or deep neural networks operate? Here I make the case for why having a genomic network capable of a high level of computation would be strongly selected for, and suggest how it might arise from biochemical processes that succeed in regulating in a collective manner, very different than the usual way we think about genetic regulation.",
    "authors": [
      "J. M. Deutsch"
    ],
    "publication_date": "2021-06-29T21:38:45Z",
    "arxiv_id": "http://arxiv.org/abs/2106.15732v1",
    "download_url": "https://arxiv.org/abs/2106.15732v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic-metabolic networks can be modeled as toric varieties",
    "abstract": "The mathematical modelling of genetic-metabolic networks is of out most importance in the field of systems biology. Different formalisms and a huge variety of classical mathematical tools have been used to describe and analyse such networks. Michael A. Savageau defined a formalism to model genetic-metabolic networks called S-Systems, [12], [13], [15]. There is a limit in the number of nodes that can be analysed when these systems are solved using classical numerical methods such as non-linear dynamic analysis and linear optimization algorithms. We propose to use toric algebraic geometry to solve S-systems. In this work we prove that S-systems are toric varieties and that as a consequence Hilbert basis can be used to solve them. This is achieved by applying two theorems, proved here, the theorem about Embedding of S-Systems in toric varieties and the theorem about Toric Resolution on S-Systems. In addition, we define the realization of minimal phenotypic polytopes, phenotypic toric ideals and phenotypic toric varieties as a generalization of the phenotypic polytopes described by M. Savageau, [8], [9], [10]. Also we studied a synthetic oscillatory network of two genes under diverse environmental control modes, we reproduce S. Savageau results and additionally we obtain an invariant sustained oscillatory region. The implications of the results here presented is that, in principle, they will facilitate solving large scale genetic-metabolic networks by means of toric algebraic geometry tools as well as facilitate elucidating their dynamics.",
    "authors": [
      "Marco Polo Castillo-Villalba",
      "Laura Gómez-Romero",
      "Julio Collado-Vides"
    ],
    "publication_date": "2017-08-17T07:41:56Z",
    "arxiv_id": "http://arxiv.org/abs/1708.05384v2",
    "download_url": "https://arxiv.org/abs/1708.05384v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Guiding Deep Molecular Optimization with Genetic Exploration",
    "abstract": "De novo molecular design attempts to search over the chemical space for molecules with the desired property. Recently, deep learning has gained considerable attention as a promising approach to solve the problem. In this paper, we propose genetic expert-guided learning (GEGL), a simple yet novel framework for training a deep neural network (DNN) to generate highly-rewarding molecules. Our main idea is to design a \"genetic expert improvement\" procedure, which generates high-quality targets for imitation learning of the DNN. Extensive experiments show that GEGL significantly improves over state-of-the-art methods. For example, GEGL manages to solve the penalized octanol-water partition coefficient optimization with a score of 31.40, while the best-known score in the literature is 27.22. Besides, for the GuacaMol benchmark with 20 tasks, our method achieves the highest score for 19 tasks, in comparison with state-of-the-art methods, and newly obtains the perfect score for three tasks.",
    "authors": [
      "Sungsoo Ahn",
      "Junsu Kim",
      "Hankook Lee",
      "Jinwoo Shin"
    ],
    "publication_date": "2020-07-04T05:01:26Z",
    "arxiv_id": "http://arxiv.org/abs/2007.04897v3",
    "download_url": "https://arxiv.org/abs/2007.04897v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Algorithm for the 0/1 Multidimensional Knapsack Problem",
    "abstract": "The 0/1 multidimensional knapsack problem is the 0/1 knapsack problem with m constraints which makes it difficult to solve using traditional methods like dynamic programming or branch and bound algorithms. We present a genetic algorithm for the multidimensional knapsack problem with Java and C++ code that is able to solve publicly available instances in a very short computational duration. Our algorithm uses iteratively computed Lagrangian multipliers as constraint weights to augment the greedy algorithm for the multidimensional knapsack problem and uses that information in a greedy crossover in a genetic algorithm. The algorithm uses several other hyperparameters which can be set in the code to control convergence. Our algorithm improves upon the algorithm by Chu and Beasley in that it converges to optimum or near optimum solutions much faster.",
    "authors": [
      "Shalin Shah"
    ],
    "publication_date": "2019-07-20T23:53:41Z",
    "arxiv_id": "http://arxiv.org/abs/1908.08022v2",
    "download_url": "https://arxiv.org/abs/1908.08022v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Logic Guided Genetic Algorithms",
    "abstract": "We present a novel Auxiliary Truth enhanced Genetic Algorithm (GA) that uses logical or mathematical constraints as a means of data augmentation as well as to compute loss (in conjunction with the traditional MSE), with the aim of increasing both data efficiency and accuracy of symbolic regression (SR) algorithms. Our method, logic-guided genetic algorithm (LGGA), takes as input a set of labelled data points and auxiliary truths (ATs) (mathematical facts known a priori about the unknown function the regressor aims to learn) and outputs a specially generated and curated dataset that can be used with any SR method. Three key insights underpin our method: first, SR users often know simple ATs about the function they are trying to learn. Second, whenever an SR system produces a candidate equation inconsistent with these ATs, we can compute a counterexample to prove the inconsistency, and further, this counterexample may be used to augment the dataset and fed back to the SR system in a corrective feedback loop. Third, the value addition of these ATs is that their use in both the loss function and the data augmentation process leads to better rates of convergence, accuracy, and data efficiency. We evaluate LGGA against state-of-the-art SR tools, namely, Eureqa and TuringBot on 16 physics equations from \"The Feynman Lectures on Physics\" book. We find that using these SR tools in conjunction with LGGA results in them solving up to 30.0% more equations, needing only a fraction of the amount of data compared to the same tool without LGGA, i.e., resulting in up to a 61.9% improvement in data efficiency.",
    "authors": [
      "Dhananjay Ashok",
      "Joseph Scott",
      "Sebastian Wetzel",
      "Maysum Panju",
      "Vijay Ganesh"
    ],
    "publication_date": "2020-10-21T21:57:12Z",
    "arxiv_id": "http://arxiv.org/abs/2010.11328v1",
    "download_url": "https://arxiv.org/abs/2010.11328v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simulation of Genetic Algorithm: Traffic Light Efficiency",
    "abstract": "Traffic is a problem in many urban areas worldwide. Traffic flow is dictated by certain devices such as traffic lights. The traffic lights signal when each lane is able to pass through the intersection. Often, static schedules interfere with ideal traffic flow. The purpose of this project was to find a way to make intersections controlled with traffic lights more efficient. This goal was accomplished through the creation of a genetic algorithm, which enhances an input algorithm through genetic principles to produce the fittest algorithm. The program was comprised of two major elements: coding in Java and coding in Simulation of Urban Mobility (SUMO), which is an environment that simulates real traffic. The Java code called upon the SUMO simulation via a command prompt which ran the simulation, received the output, altered the algorithm, and looped. The SUMO component initialized a simulation in which a 1 x 1 street layout was created, each intersection with its own traffic light. Each loop enhanced the input algorithm by altering the scheduling string (dictates the light changes). After the looped simulations were executed, the data was then analyzed. This was accomplished by creating an algorithm based upon regular practice, timed traffic lights, and comparing the output which was comprised of the total time it took for all vehicles to exit the system and the average time it took each individual vehicle to exit the system. These different variables: the time it took the average vehicle to exit the system and total time for all vehicles to exit the system, where then graphed together to provide a visual aid. The genetic algorithm did improve traffic light and traffic flow efficiency in comparison to traditional scheduling methods.",
    "authors": [
      "Eric Lienert"
    ],
    "publication_date": "2015-03-15T20:56:04Z",
    "arxiv_id": "http://arxiv.org/abs/1503.04475v1",
    "download_url": "https://arxiv.org/abs/1503.04475v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Improved Real--Space Genetic Algorithm for Crystal Structure and Polymorph Prediction",
    "abstract": "Existing Genetic Algorithms for crystal structure and polymorph prediction can suffer from stagnation during evolution, with a consequent loss of efficiency and accuracy. An improved Genetic Algorithm (GA) is introduced herein which penalizes similar structures and so enhances structural diversity in the population at each generation. This is shown to improve the quality of results found for the theoretical prediction of simple model crystal structures. In particular, this method is demonstrated to find three new zero--temperature phases of the Dzugutov potential that have not been previously reported.",
    "authors": [
      "N. L. Abraham",
      "M. I. J. Probert"
    ],
    "publication_date": "2008-05-09T20:25:50Z",
    "arxiv_id": "http://arxiv.org/abs/0805.1418v1",
    "download_url": "https://arxiv.org/abs/0805.1418v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Taylor Genetic Programming for Symbolic Regression",
    "abstract": "Genetic programming (GP) is a commonly used approach to solve symbolic regression (SR) problems. Compared with the machine learning or deep learning methods that depend on the pre-defined model and the training dataset for solving SR problems, GP is more focused on finding the solution in a search space. Although GP has good performance on large-scale benchmarks, it randomly transforms individuals to search results without taking advantage of the characteristics of the dataset. So, the search process of GP is usually slow, and the final results could be unstable.To guide GP by these characteristics, we propose a new method for SR, called Taylor genetic programming (TaylorGP) (Code and appendix at https://kgae-cup.github.io/TaylorGP/). TaylorGP leverages a Taylor polynomial to approximate the symbolic equation that fits the dataset. It also utilizes the Taylor polynomial to extract the features of the symbolic equation: low order polynomial discrimination, variable separability, boundary, monotonic, and parity. GP is enhanced by these Taylor polynomial techniques. Experiments are conducted on three kinds of benchmarks: classical SR, machine learning, and physics. The experimental results show that TaylorGP not only has higher accuracy than the nine baseline methods, but also is faster in finding stable results.",
    "authors": [
      "Baihe He",
      "Qiang Lu",
      "Qingyun Yang",
      "Jake Luo",
      "Zhiguang Wang"
    ],
    "publication_date": "2022-04-28T13:43:39Z",
    "arxiv_id": "http://arxiv.org/abs/2205.09751v1",
    "download_url": "https://arxiv.org/abs/2205.09751v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Probabilistic models of genetic variation in structured populations applied to global human studies",
    "abstract": "Modern population genetics studies typically involve genome-wide genotyping of individuals from a diverse network of ancestries. An important, unsolved problem is how to formulate and estimate probabilistic models of observed genotypes that allow for complex population structure. We formulate two general probabilistic models, and we propose computationally efficient algorithms to estimate them. First, we show how principal component analysis (PCA) can be utilized to estimate a general model that includes the well-known Pritchard-Stephens-Donnelly mixed-membership model as a special case. Noting some drawbacks of this approach, we introduce a new \"logistic factor analysis\" (LFA) framework that seeks to directly model the logit transformation of probabilities underlying observed genotypes in terms of latent variables that capture population structure. We demonstrate these advances on data from the human genome diversity panel and 1000 genomes project, where we are able to identify SNPs that are highly differentiated with respect to structure while making minimal modeling assumptions.",
    "authors": [
      "Wei Hao",
      "Minsun Song",
      "John D. Storey"
    ],
    "publication_date": "2013-12-07T00:14:17Z",
    "arxiv_id": "http://arxiv.org/abs/1312.2041v2",
    "download_url": "https://arxiv.org/abs/1312.2041v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Attributes as Textual Genes: Leveraging LLMs as Genetic Algorithm Simulators for Conditional Synthetic Data Generation",
    "abstract": "Large Language Models (LLMs) excel at generating synthetic data, but ensuring its quality and diversity remains challenging. We propose Genetic Prompt, a novel framework that combines genetic algorithms with LLMs to augment synthetic data generation. Our approach treats semantic text attributes as gene sequences and leverages the LLM to simulate crossover and mutation operations. This genetic process enhances data quality and diversity by creating novel attribute combinations, yielding synthetic distributions closer to real-world data. To optimize parent selection, we also integrate an active learning scheme that expands the offspring search space. Our experiments on multiple NLP tasks reveal several key findings: Genetic Prompt not only significantly outperforms state-of-the-art baselines but also shows robust performance across various generator model sizes and scales. Moreover, we demonstrate that fusing our synthetic data with the original training set significantly boosts downstream model performance, particularly for class-imbalanced scenarios. Our findings validate that Genetic Prompt is an effective method for producing high-quality synthetic data for a wide range of NLP applications.",
    "authors": [
      "Guangzeng Han",
      "Weisi Liu",
      "Xiaolei Huang"
    ],
    "publication_date": "2025-09-02T07:35:20Z",
    "arxiv_id": "http://arxiv.org/abs/2509.02040v1",
    "download_url": "https://arxiv.org/abs/2509.02040v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Near-ideal selection for the Standard Genetic Code",
    "abstract": "Evolutionary theorizing resembles building an aircraft while also piloting it; new results change the scaffold for older ideas, requiring revised strategy to remain airborne. A calculated kinetic pathway exists that, under explicit quantitative assumptions, delivers the SGC (Standard Genetic Code). The pathway and evidence for it is summarized below, striving for a clearer, more complete account than was possible during its construction. Beginning with experimental amino acid-RNA interactions, code assignments are fused, codes divide and an early coding crescendo is tested for homogeneous assignments, which are then selected for independent survival in a near-empty biotic world. During escape from the site of origin and diaspora, a near-complete SGC becomes dominant by supporting proficient division. Crescendo, escape and diaspora together comprise a near-ideal least selection for a Standard Genetic Code that specifically served LUCA, likely a free-living anaerobic thermophilic microbe. Selection during diaspora conceivably made persistence across gigayears feasible.",
    "authors": [
      "Michael Yarus"
    ],
    "publication_date": "2024-10-10T10:59:42Z",
    "arxiv_id": "http://arxiv.org/abs/2410.07814v1",
    "download_url": "https://arxiv.org/abs/2410.07814v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fast and robust parametric and functional learning with Hybrid Genetic Optimisation (HyGO)",
    "abstract": "The Hybrid Genetic Optimisation framework (HyGO) is introduced to meet the pressing need for efficient and unified optimisation frameworks that support both parametric and functional learning in complex engineering problems. Evolutionary algorithms are widely employed as derivative-free global optimisation methods but often suffer from slow convergence rates, especially during late-stage learning. HyGO integrates the global exploration capabilities of evolutionary algorithms with accelerated local search for robust solution refinement. The key enabler is a two-stage strategy that balances exploration and exploitation. For parametric problems, HyGO alternates between a genetic algorithm and targeted improvement through a degradation-proof Dowhill Simplex Method (DSM). For function optimisation tasks, HyGO rotates between genetic programming and DSM. Validation is performed on (a) parametric optimisation benchmarks, where HyGO demonstrates faster and more robust convergence than standard genetic algorithms, and (b) function optimisation tasks, including control of a damped Landau oscillator. Practical relevance is showcased through aerodynamic drag reduction of an Ahmed body via Reynolds-Averaged Navier-Stokes simulations, achieving consistently interpretable results and reductions exceeding 20% by controlled jet injection in the back of the body for flow reattachment and separation bubble reduction. Overall, HyGO emerges as a versatile hybrid optimisation framework suitable for a broad spectrum of engineering and scientific problems involving parametric and functional learning.",
    "authors": [
      "Isaac Robledo",
      "Yiqing Li",
      "Guy Y. Cornejo Maceda",
      "Rodrigo Castellanos"
    ],
    "publication_date": "2025-10-10T13:45:32Z",
    "arxiv_id": "http://arxiv.org/abs/2510.09391v1",
    "download_url": "https://arxiv.org/abs/2510.09391v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Effect of Multi-Generational Selection in Geometric Semantic Genetic Programming",
    "abstract": "Among the evolutionary methods, one that is quite prominent is Genetic Programming, and, in recent years, a variant called Geometric Semantic Genetic Programming (GSGP) has shown to be successfully applicable to many real-world problems. Due to a peculiarity in its implementation, GSGP needs to store all the evolutionary history, i.e., all populations from the first one. We exploit this stored information to define a multi-generational selection scheme that is able to use individuals from older populations. We show that a limited ability to use \"old\" generations is actually useful for the search process, thus showing a zero-cost way of improving the performances of GSGP.",
    "authors": [
      "Mauro Castelli",
      "Luca Manzoni",
      "Luca Mariot",
      "Giuliamaria Menara",
      "Gloria Pietropolli"
    ],
    "publication_date": "2022-05-05T12:26:25Z",
    "arxiv_id": "http://arxiv.org/abs/2205.02598v1",
    "download_url": "https://arxiv.org/abs/2205.02598v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Applications of Gaussian Mutation for Self Adaptation in Evolutionary Genetic Algorithms",
    "abstract": "In recent years, optimization problems have become increasingly more prevalent due to the need for more powerful computational methods. With the more recent advent of technology such as artificial intelligence, new metaheuristics are needed that enhance the capabilities of classical algorithms. More recently, researchers have been looking at Charles Darwin's theory of natural selection and evolution as a means of enhancing current approaches using machine learning. In 1960, the first genetic algorithm was developed by John H. Holland and his student. We explore the mathematical intuition of the genetic algorithm in developing systems capable of evolving using Gaussian mutation, as well as its implications in solving optimization problems.",
    "authors": [
      "Okezue Bell"
    ],
    "publication_date": "2022-01-02T04:18:25Z",
    "arxiv_id": "http://arxiv.org/abs/2201.00285v2",
    "download_url": "https://arxiv.org/abs/2201.00285v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genie: A Secure, Transparent Sharing and Services Platform for Genetic and Health Data",
    "abstract": "Artificial Intelligence (AI) incorporating genetic and medical information have been applied in disease risk prediction, unveiling disease mechanism, and advancing therapeutics. However, AI training relies on highly sensitive and private data which significantly limit their applications and robustness evaluation. Moreover, the data access management after sharing across organization heavily relies on legal restriction, and there is no guarantee in preventing data leaking after sharing. Here, we present Genie, a secure AI platform which allows AI models to be trained on medical data securely. The platform combines the security of Intel Software Guarded eXtensions (SGX), transparency of blockchain technology, and verifiability of open algorithms and source codes. Genie shares insights of genetic and medical data without exposing anyone's raw data. All data is instantly encrypted upon upload and contributed to the models that the user chooses. The usage of the model and the value generated from the genetic and health data will be tracked via a blockchain, giving the data transparent and immutable ownership.",
    "authors": [
      "Shifa Zhang",
      "Anne Kim",
      "Dianbo Liu",
      "Sandeep C. Nuckchady",
      "Lauren Huang",
      "Aditya Masurkar",
      "Jingwei Zhang",
      "Lawrence Tseng",
      "Pratheek Karnati",
      "Laura Martinez",
      "Thomas Hardjono",
      "Manolis Kellis",
      "Zhizhuo Zhang"
    ],
    "publication_date": "2018-11-04T20:43:53Z",
    "arxiv_id": "http://arxiv.org/abs/1811.01431v2",
    "download_url": "https://arxiv.org/abs/1811.01431v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]