[
  {
    "title": "The GenoChip: A New Tool for Genetic Anthropology",
    "abstract": "The Genographic Project is an international effort using genetic data to chart human migratory history. The project is non-profit and non-medical, and through its Legacy Fund supports locally led efforts to preserve indigenous and traditional cultures. In its second phase, the project is focusing on markers from across the entire genome to obtain a more complete understanding of human genetic variation. Although many commercial arrays exist for genome-wide SNP genotyping, they were designed for medical genetic studies and contain medically related markers that are not appropriate for global population genetic studies. GenoChip, the Genographic Project's new genotyping array, was designed to resolve these issues and enable higher-resolution research into outstanding questions in genetic anthropology. We developed novel methods to identify AIMs and genomic regions that may be enriched with alleles shared with ancestral hominins. Overall, we collected and ascertained AIMs from over 450 populations. Containing an unprecedented number of Y-chromosomal and mtDNA SNPs and over 130,000 SNPs from the autosomes and X-chromosome, the chip was carefully vetted to avoid inclusion of medically relevant markers. The GenoChip results were successfully validated. To demonstrate its capabilities, we compared the FST distributions of GenoChip SNPs to those of two commercial arrays for three continental populations. While all arrays yielded similarly shaped (inverse J) FST distributions, the GenoChip autosomal and X-chromosomal distributions had the highest mean FST, attesting to its ability to discern subpopulations. The GenoChip is a dedicated genotyping platform for genetic anthropology and promises to be the most powerful tool available for assessing population structure and migration history.",
    "authors": [
      "Eran Elhaik",
      "Elliott Greenspan",
      "Sean Staats",
      "Thomas Krahn",
      "Chris Tyler-Smith",
      "Yali Xue",
      "Sergio Tofanelli",
      "Paolo Francalacci",
      "Francesco Cucca",
      "Luca Pagani",
      "Li Jin",
      "Hui Li",
      "Theodore G. Schurr",
      "Bennett Greenspan",
      "R. Spencer Wells",
      "the Genographic Consortium"
    ],
    "publication_date": "2012-12-17T19:49:23Z",
    "arxiv_id": "http://arxiv.org/abs/1212.4116v1",
    "download_url": "https://arxiv.org/abs/1212.4116v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Compiling Combinatorial Genetic Circuits with Semantic Inference",
    "abstract": "A central strategy of synthetic biology is to understand the basic processes of living creatures through engineering organisms using the same building blocks. Biological machines described in terms of parts can be studied by computer simulation in any of several languages or robotically assembled in vitro. In this paper we present a language, the Genetic Circuit Description Language (GCDL) and a compiler, the Genetic Circuit Compiler (GCC). This language describes genetic circuits at a level of granularity appropriate both for automated assembly in the laboratory and deriving simulation code. The GCDL follows Semantic Web practice and the compiler makes novel use of the logical inference facilities that are therefore available. We present the GCDL and compiler structure as a study of a tool for generating $κ$-language simulations from semantic descriptions of genetic circuits.",
    "authors": [
      "William Waites",
      "Goksel Misirli",
      "Matteo Cavaliere",
      "Vincent Danos",
      "Anil Wipat"
    ],
    "publication_date": "2018-11-05T15:31:17Z",
    "arxiv_id": "http://arxiv.org/abs/1811.01793v2",
    "download_url": "https://arxiv.org/abs/1811.01793v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Unified Theory on Construction and Evolution of the Genetic Code",
    "abstract": "A quantitative theory on the construction and the evolution of the genetic code is proposed. Through introducing the concept of mutational deterioration (MD) and developing a theoretical formalism on MD minimization we have proved: 1, the redundancy distribution of codons in the genetic code obeys MD minimization principle; 2, the hydrophilic-hydrophobic distribution of amino acids on the code table is global MD (GMD) minimal; 3, the standard genetic code can be deduced from the adaptive minimization of GMD; 4, the variants of the standard genetic code can be explained quantitatively by use of GMD formalism and the general trend of the evolution is GMD non-increasing which reflects the selection on the code. We have demonstrated that the redundancy distribution of codons and the hydrophobic-hydrophilic (H-P) distribution of amino acids are robust in the code relative to the mutational parameter, and indicated that the GMD can be looked as a non-fitness function on the adaptive landscape. Finally, an important aspect on the symmetry of the code construction, the Yin-Yang duality is investigated. The Yin-Yang duality among codons affords a sound basis for understanding the H-P structure in the genetic code.",
    "authors": [
      "Liaofu Luo"
    ],
    "publication_date": "2009-08-21T08:02:45Z",
    "arxiv_id": "http://arxiv.org/abs/0908.3067v1",
    "download_url": "https://arxiv.org/abs/0908.3067v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Differentiable Model for Optimizing the Genetic Drivers of Synaptogenesis",
    "abstract": "There is growing consensus among neuroscientists that neural circuits critical for survival are the result of genomic decompression processes. We introduce SynaptoGen, a novel computational framework--member of the Connectome Models family--bringing synthetic biological intelligence closer, facilitating neural biological agent development through precise genetic control of synaptogenesis. SynaptoGen is the first model of its kind offering mechanistic explanation of synaptic multiplicity based on genetic expression and protein interaction probabilities. The framework connects genetic factors through a differentiable function, working as a neural network where synaptic weights equal average numbers of synapses between neurons, multiplied by conductance, derived from genetic profiles. Differentiability enables gradient-based optimization, allowing generation of genetic expression patterns producing pre-wired biological agents for specific tasks. Validation in simulated synaptogenesis scenarios shows agents successfully solving four reinforcement learning benchmarks, consistently surpassing control baselines. Despite gaps in biological realism requiring mitigation, this framework has potential to accelerate synthetic biological intelligence research.",
    "authors": [
      "Tommaso Boccato",
      "Matteo Ferrante",
      "Nicola Toschi"
    ],
    "publication_date": "2024-02-11T16:49:12Z",
    "arxiv_id": "http://arxiv.org/abs/2402.07242v3",
    "download_url": "https://arxiv.org/abs/2402.07242v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic diversity and fitness in small populations of partially asexual, self-incompatible plants",
    "abstract": "How self-incompatibility systems are maintained in plant populations is still a debated issue. Theoretical models predict that self-incompatibility systems break down according to the intensity of inbreeding depression and number of S-alleles. Other studies have explored the function of asexual reproduction in the maintenance of self-incompatibility. However, the population genetics of partially asexual, self-incompatible populations are poorly understood and previous studies have failed to consider all possible effects of asexual reproduction or could only speculate on those effects. In this study, we investigated how partial asexuality may affect genetic diversity at the S-locus and fitness in small self-incompatible populations. A genetic model including an S-locus and a viability locus was developed to perform forward simulations of the evolution of populations of various sizes. Drift combined with partial asexuality produced a decrease in the number of alleles at the S-locus. In addition, an excess of heterozygotes was present in the population, causing an increase in mutation load. This heterozygote excess was enhanced by the self-incompatibility system in small populations. In addition, in highly asexual populations, individuals produced asexually had some fitness advantages over individuals produced sexually, because sexual reproduction produces homozygotes of the deleterious allele, contrary to asexual reproduction. Our results suggest that future research on the function of asexuality for the maintenance of self-incompatibility will need to (1) account for whole-genome fitness (mutation load generated by asexuality, self-incompatibility and drift) and (2) acknowledge that the maintenance of self-incompatibility may not be independent of the maintenance of sex itself.",
    "authors": [
      "Miguel Navascués",
      "Solenn Stoeckel",
      "Stephanie Mariette"
    ],
    "publication_date": "2012-01-31T21:00:56Z",
    "arxiv_id": "http://arxiv.org/abs/1202.0012v1",
    "download_url": "https://arxiv.org/abs/1202.0012v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Speed of Adaptation in Large Asexual Populations",
    "abstract": "In large asexual populations, beneficial mutations have to compete with each other for fixation. Here, I derive explicit analytic expressions for the rate of substitution and the mean beneficial effect of fixed mutations, under the assumptions that the population size N is large, that the mean effect of new beneficial mutations is smaller than the mean effect of new deleterious mutations, and that new beneficial mutations are exponentially distributed. As N increases, the rate of substitution approaches a constant, which is equal to the mean effect of new beneficial mutations. The mean effect of fixed mutations continues to grow logarithmically with N. The speed of adaptation, measured as the change of log fitness over time, also grows logarithmically with N for moderately large N, and it grows double-logarithmically for extremely large N. Moreover, I derive a simple formula that determines whether at given N beneficial mutations are expected to compete with each other or go to fixation independently. Finally, I verify all results with numerical simulations.",
    "authors": [
      "Claus O. Wilke"
    ],
    "publication_date": "2004-02-05T02:04:35Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0402009v3",
    "download_url": "https://arxiv.org/abs/q-bio/0402009v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Representations for Evolutionary Minimization of Network Coding Resources",
    "abstract": "We demonstrate how a genetic algorithm solves the problem of minimizing the resources used for network coding, subject to a throughput constraint, in a multicast scenario. A genetic algorithm avoids the computational complexity that makes the problem NP-hard and, for our experiments, greatly improves on sub-optimal solutions of established methods. We compare two different genotype encodings, which tradeoff search space size with fitness landscape, as well as the associated genetic operators. Our finding favors a smaller encoding despite its fewer intermediate solutions and demonstrates the impact of the modularity enforced by genetic operators on the performance of the algorithm.",
    "authors": [
      "Minkyu Kim",
      "Varun Aggarwal",
      "Una-May O'Reilly",
      "Muriel Medard",
      "Wonsik Kim"
    ],
    "publication_date": "2007-02-07T05:54:00Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0702038v1",
    "download_url": "https://arxiv.org/abs/cs/0702038v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ensemble Genetic Programming",
    "abstract": "Ensemble learning is a powerful paradigm that has been usedin the top state-of-the-art machine learning methods like Random Forestsand XGBoost. Inspired by the success of such methods, we have devel-oped a new Genetic Programming method called Ensemble GP. The evo-lutionary cycle of Ensemble GP follows the same steps as other GeneticProgramming systems, but with differences in the population structure,fitness evaluation and genetic operators. We have tested this method oneight binary classification problems, achieving results significantly betterthan standard GP, with much smaller models. Although other methodslike M3GP and XGBoost were the best overall, Ensemble GP was able toachieve exceptionally good generalization results on a particularly hardproblem where none of the other methods was able to succeed.",
    "authors": [
      "Nuno M. Rodrigues",
      "João E. Batista",
      "Sara Silva"
    ],
    "publication_date": "2020-01-21T14:10:37Z",
    "arxiv_id": "http://arxiv.org/abs/2001.07553v1",
    "download_url": "https://arxiv.org/abs/2001.07553v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Semi-parametric efficient estimation of small genetic effects in large-scale population cohorts",
    "abstract": "Population genetics seeks to quantify DNA variant associations with traits or diseases, as well as interactions among variants and with environmental factors. Computing millions of estimates in large cohorts in which small effect sizes are expected, necessitates minimising model-misspecification bias to control false discoveries. We present TarGene, a unified statistical workflow for the semi-parametric efficient and double robust estimation of genetic effects including k-point interactions among categorical variables in the presence of confounding and weak population dependence. k-point interactions, or Average Interaction Effects (AIEs), are a direct generalisation of the usual average treatment effect (ATE). We estimate AIEs with cross-validated and/or weighted versions of Targeted Minimum Loss-based Estimators (TMLE) and One-Step Estimators (OSE). The effect of dependence among data units on variance estimates is corrected by using sieve plateau variance estimators based on genetic relatedness across the units. We present extensive realistic simulations to demonstrate power, coverage, and control of type I error. Our motivating application is the targeted estimation of genetic effects on trait, including two-point and higher-order gene-gene and gene-environment interactions, in large-scale genomic databases such as UK Biobank and All of Us. All cross-validated and/or weighted TMLE and OSE for the AIE k-point interaction, as well as ATEs, conditional ATEs and functions thereof, are implemented in the general purpose Julia package TMLE.jl. For high-throughput applications in population genomics, we provide the open-source Nextflow pipeline and software TarGene which integrates seamlessly with modern high-performance and cloud computing platforms.",
    "authors": [
      "Olivier Labayle",
      "Breeshey Roskams-Hieter",
      "Joshua Slaughter",
      "Kelsey Tetley-Campbell",
      "Mark J. van der Laan",
      "Chris P. Ponting",
      "Sjoerd Viktor Beentjes",
      "Ava Khamseh"
    ],
    "publication_date": "2025-05-20T17:58:10Z",
    "arxiv_id": "http://arxiv.org/abs/2505.14675v1",
    "download_url": "https://arxiv.org/abs/2505.14675v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic evolution of a multi-generational population in the context of interstellar space travels -- Part II: Phenotypic effects of gene expression",
    "abstract": "In the first paper of this series, we included the effects of population genetics in the agent-based Monte Carlo code HERITAGE under the hypothesis of neutral phenotypic effects. It implied that mutations (genetic changes) had only neutral physical manifestations. We now relax this assumption by including genetic effects of mutation and neo-mutations (from radiations) onto the population's life expectancy, fertility, pregnancy chances and miscarriage rates. When applied to a population aboard a generation ship that travels at sub-light speed towards a distant exoplanet, we demonstrate that natural selection indirectly affects the genetic structure of a population via the contribution of phenotypes, in agreement with past studies in conservation biology. For large starting crews (about 500 individuals), the effect aligns with the neutral hypothesis and the frequency of alleles (for non-sexual chromosomes) is stable over centuries. Results are completely different if the spacecraft shielding, integrated into hull design, fails to efficiently protect the crew from high-energy cosmic rays and showers of secondary particles. We tested different scenarios, in which the level of radiation is either fixed at normal or extreme levels, or changing over time due to, e.g., shield degradation, on-board nuclear incident or the outburst of a supernova situated 50 light-years away.",
    "authors": [
      "Frédéric Marin",
      "Camille Beluffi-Marin",
      "Frédéric Fischer"
    ],
    "publication_date": "2025-02-11T13:57:22Z",
    "arxiv_id": "http://arxiv.org/abs/2502.07559v1",
    "download_url": "https://arxiv.org/abs/2502.07559v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A faster and more accurate algorithm for calculating population genetics statistics requiring sums of Stirling numbers of the first kind",
    "abstract": "Stirling numbers of the first kind are used in the derivation of several population genetics statistics, which in turn are useful for testing evolutionary hypotheses directly from DNA sequences. Here, we explore the cumulative distribution function of these Stirling numbers, which enables a single direct estimate of the sum, using representations in terms of the incomplete beta function. This estimator enables an improved method for calculating an asymptotic estimate for one useful statistic, Fu's $F_s$. By reducing the calculation from a sum of terms involving Stirling numbers to a single estimate, we simultaneously improve accuracy and dramatically increase speed.",
    "authors": [
      "Swaine L. Chen",
      "Nico M. Temme"
    ],
    "publication_date": "2020-03-11T11:44:30Z",
    "arxiv_id": "http://arxiv.org/abs/2003.05228v3",
    "download_url": "https://arxiv.org/abs/2003.05228v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic interactions from first principles",
    "abstract": "We derive a general statistical model of interactions, starting from probabilistic principles and elementary requirements. Prevailing interaction models in biomedical researches diverge both mathematically and practically. In particular, genetic interaction inquiries are formulated without an obvious mathematical unity. Our model reveals theoretical properties unnoticed so far, particularly valuable for genetic interaction mapping, where mechanistic details are mostly unknown, distribution of gene variants differ between populations, and genetic susceptibilities are spuriously propagated by linkage disequilibrium. When applied to data of the largest interaction mapping experiment on Saccharomyces Cerevisiae to date, our results imply less aversion to positive interactions, detection of well-documented hubs and partial remapping of functional regions of the currently known genetic interaction landscape. Assessment of divergent annotations across functional categories further suggests that positive interactions have a more important role on ribosome biogenesis than previously realized. The unity of arguments elaborated here enables the analysis of dissimilar interaction models and experimental data with a common framework.",
    "authors": [
      "Jorge Fernandez-de-Cossio",
      "Jorge Fernandez-de-Cossio-Diaz",
      "Yasser Perera"
    ],
    "publication_date": "2017-05-30T19:48:47Z",
    "arxiv_id": "http://arxiv.org/abs/1705.10841v2",
    "download_url": "https://arxiv.org/abs/1705.10841v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Network Architecture Search",
    "abstract": "We propose a method for learning the neural network architecture that based on Genetic Algorithm (GA). Our approach uses a genetic algorithm integrated with standard Stochastic Gradient Descent(SGD) which allows the sharing of weights across all architecture solutions. The method uses GA to design a sub-graph of Convolution cell which maximizes the accuracy on the validation-set. Through experiments, we demonstrate this methods performance on both CIFAR10 and CIFAR100 dataset with an accuracy of 96% and 80.1%. The code and result of this work available in GitHub:https://github.com/haihabi/GeneticNAS.",
    "authors": [
      "Hai Victor Habi",
      "Gil Rafalovich"
    ],
    "publication_date": "2019-07-05T14:50:00Z",
    "arxiv_id": "http://arxiv.org/abs/1907.02871v1",
    "download_url": "https://arxiv.org/abs/1907.02871v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A construction of the genetic material and of proteins",
    "abstract": "A theoretical construction of the genetic material establishes the unique and ideal character of DNA. A similar conclusion is reached for amino acids and proteins.",
    "authors": [
      "J. -L. Sikorav",
      "A. Braslau",
      "A. Goldar"
    ],
    "publication_date": "2014-04-15T13:44:59Z",
    "arxiv_id": "http://arxiv.org/abs/1404.3908v1",
    "download_url": "https://arxiv.org/abs/1404.3908v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Protein domains as units of genetic transfer",
    "abstract": "Genomes evolve as modules. In prokaryotes (and some eukaryotes), genetic material can be transferred between species and integrated into the genome via homologous or illegitimate recombination. There is little reason to imagine that the units of transfer correspond to entire genes; however, such units have not been rigorously characterized. We examined fragmentary genetic transfers in single-copy gene families from 144 prokaryotic genomes and found that breakpoints are located significantly closer to the boundaries of genomic regions that encode annotated structural domains of proteins than expected by chance, particularly when recombining sequences are more divergent. This correlation results from recombination events themselves and not from differential nucleotide substitution. We report the first systematic study relating genetic recombination to structural features at the protein level.",
    "authors": [
      "Cheong Xin Chan",
      "Robert G. Beiko",
      "Aaron E. Darling",
      "Mark A. Ragan"
    ],
    "publication_date": "2007-09-13T16:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/0709.2030v2",
    "download_url": "https://arxiv.org/abs/0709.2030v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "NK Hybrid Genetic Algorithm for Clustering",
    "abstract": "The NK hybrid genetic algorithm for clustering is proposed in this paper. In order to evaluate the solutions, the hybrid algorithm uses the NK clustering validation criterion 2 (NKCV2). NKCV2 uses information about the disposition of $N$ small groups of objects. Each group is composed of $K+1$ objects of the dataset. Experimental results show that density-based regions can be identified by using NKCV2 with fixed small $K$. In NKCV2, the relationship between decision variables is known, which in turn allows us to apply gray box optimization. Mutation operators, a partition crossover, and a local search strategy are proposed, all using information about the relationship between decision variables. In partition crossover, the evaluation function is decomposed into $q$ independent components; partition crossover then deterministically returns the best among $2^q$ possible offspring with computational complexity $O(N)$. The NK hybrid genetic algorithm allows the detection of clusters with arbitrary shapes and the automatic estimation of the number of clusters. In the experiments, the NK hybrid genetic algorithm produced very good results when compared to another genetic algorithm approach and to state-of-art clustering algorithms.",
    "authors": [
      "Renato Tinós",
      "Liang Zhao",
      "Francisco Chicano",
      "Darrell Whitley"
    ],
    "publication_date": "2024-02-06T08:57:49Z",
    "arxiv_id": "http://arxiv.org/abs/2402.03813v1",
    "download_url": "https://arxiv.org/abs/2402.03813v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Demixing and Evolutionary Forces in the One-Dimensional Stepping Stone Model",
    "abstract": "We review and extend results for mutation, selection, genetic drift, and migration in a one-dimensional continuous population. The population is described by a continuous limit of the stepping stone model, which leads to the stochastic Fisher-Kolmogorov-Petrovsky-Piscounov equation with additional terms describing mutations. Although the stepping stone model was first proposed for population genetics, it is closely related to \"voter models\" of interest in nonequilibrium statistical mechanics. The stepping stone model can also be regarded as an approximation to the dynamics of a thin layer of actively growing pioneers at the frontier of a colony of microorganisms undergoing a range expansion on a Petri dish. We find that the population tends to segregate into monoallelic domains. This segregation slows down genetic drift and selection because these two evolutionary forces can only act at the boundaries between the domains; the effects of mutation, however, are not significantly affected by the segregation. Although fixation in the neutral well-mixed (or \"zero dimensional\") model occurs exponentially in time, it occurs only algebraically fast in the one-dimensional model. If selection is weak, selective sweeps occur exponentially fast in both well-mixed and one-dimensional populations, but the time constants are different. We also find an unusual sublinear increase in the variance of the spatially averaged allele frequency with time. Although we focus on two alleles or variants, q-allele Potts-like models of gene segregation are considered as well. We also investigate the effects of geometry at the frontier by considering growth of circular colonies. Our analytical results are checked with simulations, and could be tested against recent spatial experiments on range expansions off linear inoculations of Escherichia coli and Saccharomyces cerevisiae.",
    "authors": [
      "K. S. Korolev",
      "Mikkel Avlund",
      "Oskar Hallatschek",
      "David R. Nelson"
    ],
    "publication_date": "2009-04-29T14:27:12Z",
    "arxiv_id": "http://arxiv.org/abs/0904.4625v2",
    "download_url": "https://arxiv.org/abs/0904.4625v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Congruent evolution of genetic and environmental robustness in microRNA",
    "abstract": "Genetic robustness, the preservation of an optimal phenotype in the face of mutations, is critical to the understanding of evolution as phenotypically expressed genetic variation is the fuel of natural selection. The origin of genetic robustness, whether it evolves directly by natural selection or it is a correlated byproduct of other phenotypic traits, is, however, unresolved. Examining microRNA (miRNA) genes of several eukaryotic species, Borenstein and Ruppin (Borenstein et al. 2006, PNAS 103: 6593), showed that the structure of miRNA precursor stem-loops exhibits significantly increased mutational robustness in comparison with a sample of random RNA sequences with the same stem-loop structure. The observed robustness was found to be uncorrelated with traditional measures of environmental robustness -- implying that miRNA sequences show evidence of the direct evolution of genetic robustness. These findings are surprising as theoretical results indicate that the direct evolution of robustness requires high mutation rates and/or large effective population sizes only found among RNA viruses, not multicellular eukaryotes. Introducing a novel measure of environmental robustness based on the equilibrium thermodynamic ensemble of secondary structures of the miRNA precursor sequences we demonstrate that the biophysics of RNA folding, induces a high level of correlation between genetic (mutational) and environmental (thermodynamic) robustness, as expected from the theory of plastogenetic congruence introduced by Ancel and Fontana (Ancel et al. 2000, J. Exp. Zool. 288: 242). In light of theoretical considerations we believe that this correlation strongly suggests that genetic robustness observed in miRNA sequences is the byproduct of selection for environmental robustness.",
    "authors": [
      "Gergely J. Szöllősi",
      "Imre Derényi"
    ],
    "publication_date": "2008-10-15T11:12:06Z",
    "arxiv_id": "http://arxiv.org/abs/0810.2658v2",
    "download_url": "https://arxiv.org/abs/0810.2658v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic algorithms and the art of Zen",
    "abstract": "In this paper we present a novel genetic algorithm (GA) solution to a simple yet challenging commercial puzzle game known as the Zen Puzzle Garden (ZPG). We describe the game in detail, before presenting a suitable encoding scheme and fitness function for candidate solutions. We then compare the performance of the genetic algorithm with that of the A* algorithm. Our results show that the GA is competitive with informed search in terms of solution quality, and significantly out-performs it in terms of computational resource requirements. We conclude with a brief discussion of the implications of our findings for game solving and other \"real world\" problems.",
    "authors": [
      "Jack Coldridge",
      "Martyn Amos"
    ],
    "publication_date": "2010-05-24T22:15:57Z",
    "arxiv_id": "http://arxiv.org/abs/1005.4446v1",
    "download_url": "https://arxiv.org/abs/1005.4446v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum-Assisted Genetic Algorithm",
    "abstract": "Genetic algorithms, which mimic evolutionary processes to solve optimization problems, can be enhanced by using powerful semi-local search algorithms as mutation operators. Here, we introduce reverse quantum annealing, a class of quantum evolutions that can be used for performing families of quasi-local or quasi-nonlocal search starting from a classical state, as novel sources of mutations. Reverse annealing enables the development of genetic algorithms that use quantum fluctuation for mutations and classical mechanisms for the crossovers -- we refer to these as Quantum-Assisted Genetic Algorithms (QAGAs). We describe a QAGA and present experimental results using a D-Wave 2000Q quantum annealing processor. On a set of spin-glass inputs, standard (forward) quantum annealing finds good solutions very quickly but struggles to find global optima. In contrast, our QAGA proves effective at finding global optima for these inputs. This successful interplay of non-local classical and quantum fluctuations could provide a promising step toward practical applications of Noisy Intermediate-Scale Quantum (NISQ) devices for heuristic discrete optimization.",
    "authors": [
      "James King",
      "Masoud Mohseni",
      "William Bernoudy",
      "Alexandre Fréchette",
      "Hossein Sadeghi",
      "Sergei V. Isakov",
      "Hartmut Neven",
      "Mohammad H. Amin"
    ],
    "publication_date": "2019-06-24T06:08:07Z",
    "arxiv_id": "http://arxiv.org/abs/1907.00707v1",
    "download_url": "https://arxiv.org/abs/1907.00707v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The naturally designed spherical symmetry in the genetic code",
    "abstract": "In the present work, 16 genetic code doublets and their cognate amino acids in the genetic code are fitted into a polyhedron model. Based on the structural regularity in nucleobases, and by using a series of common-sense topological approaches to rearranging the Hamiltonian-type graph of the codon map, it is identified that the degeneracy of codons and the internal relation of the 20 amino acids within the genetic code are in agreement with the spherical and polyhedral symmetry of a quasi-28-gon, i.e., icosikaioctagon. Hence, a quasi-central, quasi-polyhedral and rotational symmetry within the genetic code is described. Accordingly, the rotational symmetry of the numerical distribution of side-chain carbon atoms of the 20 amino acids and the side-chain skeleton atoms (carbon, nitrogen, oxygen and sulfur) of the 20 amino acids are presented in the framework of this quasi-28-gon model. Two evolutionary axes within the 20 standard amino acids are suggested.",
    "authors": [
      "Chi Ming Yang"
    ],
    "publication_date": "2003-09-25T20:04:20Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0309014v1",
    "download_url": "https://arxiv.org/abs/q-bio/0309014v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An algebraic hypothesis about the primeval genetic code",
    "abstract": "A plausible architecture of an ancient genetic code is derived from an extended base triplet vector space over the Galois field of the extended base alphabet {D, G, A, U, C}, where the letter D represents one or more hypothetical bases with unspecific pairing. We hypothesized that the high degeneration of a primeval genetic code with five bases and the gradual origin and improvements of a primitive DNA repair system could make possible the transition from the ancient to the modern genetic code. Our results suggest that the Watson-Crick base pairing and the non-specific base pairing of the hypothetical ancestral base D used to define the sum and product operations are enough features to determine the coding constraints of the primeval and the modern genetic code, as well as, the transition from the former to the later. Geometrical and algebraic properties of this vector space reveal that the present codon assignment of the standard genetic code could be induced from a primeval codon assignment.Besides, the Fourier spectrum of the extended DNA genome sequences derived from the multiple sequence alignment suggests that the called period-3 property of the present coding DNA sequences could also exist in the ancient coding DNA sequences.",
    "authors": [
      "Robersy Sanchez",
      "Ricardo Grau"
    ],
    "publication_date": "2008-05-08T17:59:26Z",
    "arxiv_id": "http://arxiv.org/abs/0805.1128v3",
    "download_url": "https://arxiv.org/abs/0805.1128v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Testing for Complex Diseases: a Simulation Study Perspective",
    "abstract": "It is widely recognized nowadays that complex diseases are caused by, amongst the others, multiple genetic factors. The recent advent of genome-wide association study (GWA) has triggered a wave of research aimed at discovering genetic factors underlying common complex diseases. While the number of reported susceptible genetic variants is increasing steadily, the application of such findings into diseases prognosis for the general population is still unclear, and there are doubts about whether the size of the contribution by such factors is significant. In this respect, some recent simulation-based studies have shed more light to the prospect of genetic tests. In this report, we discuss several aspects of simulation-based studies: their parameters, their assumptions, and the information they provide.",
    "authors": [
      "Nguyen Xuan Vinh"
    ],
    "publication_date": "2011-09-27T07:36:07Z",
    "arxiv_id": "http://arxiv.org/abs/1109.5796v2",
    "download_url": "https://arxiv.org/abs/1109.5796v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic flow directionality and geographical segregation in a Cymodocea nodosa genetic diversity network",
    "abstract": "We analyse a large data set of genetic markers obtained from populations of Cymodocea nodosa, a marine plant occurring from the East Mediterranean to the Iberian-African coasts in the Atlantic Ocean. We fully develop and test a recently introduced methodology to infer the directionality of gene flow based on the concept of geographical segregation. Using the Jensen-Shannon divergence, we are able to extract a directed network of gene flow describing the evolutionary patterns of Cymodocea nodosa. In particular we recover the genetic segregation that the marine plant underwent during its evolution. The results are confirmed by natural evidence and are consistent with an independent cross analysis.",
    "authors": [
      "Paolo Masucci",
      "Sophie Arnaud-Haond",
      "Víctor M. Eguíluz",
      "Emilio Hernández-García",
      "Ester A. Serrão"
    ],
    "publication_date": "2012-06-24T00:57:27Z",
    "arxiv_id": "http://arxiv.org/abs/1206.5453v3",
    "download_url": "https://arxiv.org/abs/1206.5453v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chloroplast microsatellites: measures of genetic diversity and the effect of homoplasy",
    "abstract": "Chloroplast microsatellites have been widely used in population genetic studies of conifers in recent years. However, their haplotype configurations suggest that they could have high levels of homoplasy, thus limiting the power of these molecular markers. A coalescent-based computer simulation was used to explore the influence of homoplasy on measures of genetic diversity based on chloroplast microsatellites. The conditions of the simulation were defined to fit isolated populations originating from the colonization of one single haplotype into an area left available after a glacial retreat. Simulated data were compared with empirical data available from the literature for a species of Pinus that has expanded north after the Last Glacial Maximum. In the evaluation of genetic diversity, homoplasy was found to have little influence on Nei's unbiased haplotype diversity (H(E)) while Goldstein's genetic distance estimates (D2sh) were much more affected. The effect of the number of chloroplast microsatellite loci for evaluation of genetic diversity is also discussed.",
    "authors": [
      "M. Navascués",
      "B. C. Emerson"
    ],
    "publication_date": "2009-04-07T06:46:24Z",
    "arxiv_id": "http://arxiv.org/abs/0904.1063v1",
    "download_url": "https://arxiv.org/abs/0904.1063v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The future is noisy: on the role of spatial fluctuations in genetic switching",
    "abstract": "A genetic switch may be realised by a certain operator sector on the DNA strand from which either genetic code, to the left or to the right of this operator sector, can be transcribed and the corresponding information processed. This switch is controlled by messenger molecules, i.e., they determine to which side the switch is flipped. Recently, it has been realised that noise plays an elementary role in genetic switching, and the effect of number fluctuations of the messenger molecules have been explored. Here we argue that the assumption of well-stirredness taken in the previous models may not be sufficient to characterise the influence of noise: {\\em spatial} fluctuations play a non-negligible part in cellular genetic switching processes.",
    "authors": [
      "Ralf Metzler"
    ],
    "publication_date": "2001-07-24T13:10:32Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0107499v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0107499v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploration of RNA Editing and Design of Robust Genetic Algorithms",
    "abstract": "This paper presents our computational methodology using Genetic Algorithms (GA) for exploring the nature of RNA editing. These models are constructed using several genetic editing characteristics that are gleaned from the RNA editing system as observed in several organisms. We have expanded the traditional Genetic Algorithm with artificial editing mechanisms as proposed by (Rocha, 1997). The incorporation of editing mechanisms provides a means for artificial agents with genetic descriptions to gain greater phenotypic plasticity, which may be environmentally regulated. Our first implementations of these ideas have shed some light into the evolutionary implications of RNA editing. Based on these understandings, we demonstrate how to select proper RNA editors for designing more robust GAs, and the results will show promising applications to real-world problems. We expect that the framework proposed will both facilitate determining the evolutionary role of RNA editing in biology, and advance the current state of research in Genetic Algorithms.",
    "authors": [
      "C. Huang",
      "L. M. Rocha"
    ],
    "publication_date": "2003-09-09T04:25:26Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0309012v1",
    "download_url": "https://arxiv.org/abs/cs/0309012v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Functional principal variance component testing for a genetic association study of HIV progression",
    "abstract": "HIV-1C is the most prevalent subtype of HIV-1 and accounts for over half of HIV-1 infections worldwide. Host genetic influence of HIV infection has been previously studied in HIV-1B, but little attention has been paid to the more prevalent subtype C. To understand the role of host genetics in HIV-1C disease progression, we perform a study to assess the association between longitudinally collected measures of disease and more than 100,000 genetic markers located on chromosome 6. The most common approach to analyzing longitudinal data in this context is linear mixed effects models, which may be overly simplistic in this case. On the other hand, existing non-parametric methods may suffer from low power due to high degrees of freedom (DF) and may be computationally infeasible at the large scale. We propose a functional principal variance component (FPVC) testing framework which captures the nonlinearity in the CD4 and viral load with potentially low DF and is fast enough to carry out thousands or millions of times. The FPVC testing unfolds in two stages. In the first stage, we summarize the markers of disease progression according to their major patterns of variation via functional principal components analysis (FPCA). In the second stage, we employ a simple working model and variance component testing to examine the association between the summaries of disease progression and a set of single nucleotide polymorphisms. We supplement this analysis with simulation results which indicate that FPVC testing can offer large power gains over the standard linear mixed effects model.",
    "authors": [
      "Denis Agniel",
      "Wen Xie",
      "Myron Essex",
      "Tianxi Cai"
    ],
    "publication_date": "2017-06-10T00:12:58Z",
    "arxiv_id": "http://arxiv.org/abs/1706.03156v1",
    "download_url": "https://arxiv.org/abs/1706.03156v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic influences on translation in yeast",
    "abstract": "Heritable differences in gene expression between individuals are an important source of phenotypic variation. The question of how closely the effects of genetic variation on protein levels mirror those on mRNA levels remains open. Here, we addressed this question by using ribosome profiling to examine how genetic differences between two strains of the yeast S. cerevisiae affect translation. Strain differences in translation were observed for hundreds of genes. Allele specific measurements in the diploid hybrid between the two strains revealed roughly half as many cis-acting effects on translation as were observed for mRNA levels. In both the parents and the hybrid, most effects on translation were of small magnitude, such that the direction of an mRNA difference was typically reflected in a concordant footprint difference. The relative importance of cis and trans acting variation on footprint levels was similar to that for mRNA levels. There was a tendency for translation to cause larger footprint differences than expected given the respective mRNA differences. This is in contrast to translational differences between yeast species that have been reported to more often oppose than reinforce mRNA differences. Finally, we catalogued instances of premature translation termination in the two yeast strains and also found several instances where erroneous reference gene annotations lead to apparent nonsense mutations that in fact reside outside of the translated gene body. Overall, genetic influences on translation subtly modulate gene expression differences, and translation does not create strong discrepancies between genetic influences on mRNA and protein levels.",
    "authors": [
      "Frank W. Albert",
      "Dale Muzzey",
      "Jonathan Weissman",
      "Leonid Kruglyak"
    ],
    "publication_date": "2014-03-13T22:29:15Z",
    "arxiv_id": "http://arxiv.org/abs/1403.3449v2",
    "download_url": "https://arxiv.org/abs/1403.3449v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Informational Rescaling of PCA Maps with Application to Genetic Distance",
    "abstract": "We discuss the inadequacy of covariances/correlations and other measures in L2 as relative distance metrics under some conditions. We propose a computationally simple heuristic to transform a map based on standard principal component analysis (PCA) (when the variables are asymptotically Gaussian) into an entropy-based map where distances are based on mutual information (MI). Rescaling Principal Component based distances using MI allows a representation of relative statistical associations when, as in genetics, it is applied on bit measurements between individuals' genomic mutual information.\n  This entropy rescaled PCA, while preserving order relationships (along a dimension), changes the relative distances to make them linear to information. We show the effect on the entire world population and some subsamples, which leads to significant differences with the results of current research.",
    "authors": [
      "Nassim Nicholas Taleb",
      "Pierre Zalloua",
      "Khaled Elbassioni",
      "Andreas Henschel",
      "Daniel E. Platt"
    ],
    "publication_date": "2023-03-14T12:19:08Z",
    "arxiv_id": "http://arxiv.org/abs/2303.12654v2",
    "download_url": "https://arxiv.org/abs/2303.12654v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysis of a Population Genetics Model with Mutation, Selection, and Pleiotropy",
    "abstract": "We investigate the behavior of a population genetics model introduced by Waxman and Peck incorporating mutation, selection, and pleiotropy. The population is infinite and continuous variation of genotype is allowed. Nonetheless, Waxman and Peck showed that if the degree of pleiotropy is large enough,in this model a nonzero fraction of the population can have identical alleles. This `condensed mode' behavior appears in the limit of infinite times.\n  This paper explores the time-dependence of the distribution of alleles in this model. First, the model is analyzed using a recursion technique which enables the distribution of alleles to be calculated at finite times as well as in Waxman and Peck's infinite-time limit. Second, both Waxman and Peck's original model and a related model in which mutations occur continuously are mapped onto problems in quantum mechanics. In both cases, the long-time analysis for the biological model is equivalent to finding the nature of the eigenstates of the quantum problem. The condensed mode appears if and only if there is no bound state in the quantum problem.\n  We compare the behavior of the discrete- and continuous-time versions of the model. The results for the two cases are qualitatively similar, though there are some quantitative differences. We also discuss our attempts to correlate the statistics of DNA sequence variations with the degree of pleiotropy of various genes.",
    "authors": [
      "S. N. Coppersmith",
      "Robert D. Blank",
      "Leo P. Kadanoff"
    ],
    "publication_date": "1998-09-09T16:09:22Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9809143v1",
    "download_url": "https://arxiv.org/abs/cond-mat/9809143v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nurse Rostering with Genetic Algorithms",
    "abstract": "In recent years genetic algorithms have emerged as a useful tool for the heuristic solution of complex discrete optimisation problems. In particular there has been considerable interest in their use in tackling problems arising in the areas of scheduling and timetabling. However, the classical genetic algorithm paradigm is not well equipped to handle constraints and successful implementations usually require some sort of modification to enable the search to exploit problem specific knowledge in order to overcome this shortcoming. This paper is concerned with the development of a family of genetic algorithms for the solution of a nurse rostering problem at a major UK hospital. The hospital is made up of wards of up to 30 nurses. Each ward has its own group of nurses whose shifts have to be scheduled on a weekly basis. In addition to fulfilling the minimum demand for staff over three daily shifts, nurses' wishes and qualifications have to be taken into account. The schedules must also be seen to be fair, in that unpopular shifts have to be spread evenly amongst all nurses, and other restrictions, such as team nursing and special conditions for senior staff, have to be satisfied. The basis of the family of genetic algorithms is a classical genetic algorithm consisting of n-point crossover, single-bit mutation and a rank-based selection. The solution space consists of all schedules in which each nurse works the required number of shifts, but the remaining constraints, both hard and soft, are relaxed and penalised in the fitness function. The talk will start with a detailed description of the problem and the initial implementation and will go on to highlight the shortcomings of such an approach, in terms of the key element of balancing feasibility, i.e. covering the demand and work regulations, and quality, as measured by the nurses' preferences. A series of experiments involving parameter adaptation, niching, intelligent weights, delta coding, local hill climbing, migration and special selection rules will then be outlined and it will be shown how a series of these enhancements were able to eradicate these difficulties. Results based on several months' real data will be used to measure the impact of each modification, and to show that the final algorithm is able to compete with a tabu search approach currently employed at the hospital. The talk will conclude with some observations as to the overall quality of this approach to this and similar problems.",
    "authors": [
      "Uwe Aickelin"
    ],
    "publication_date": "2010-03-19T11:27:43Z",
    "arxiv_id": "http://arxiv.org/abs/1004.2870v1",
    "download_url": "https://arxiv.org/abs/1004.2870v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic transfer in Staphylococcus: a case study of 13 genomes",
    "abstract": "The widespread presence of antibiotic resistance and virulence among Staphylococcus isolates has been attributed to lateral genetic transfer (LGT) between different strains or species. However, there has been very little study of the extent of LGT in Staphylococcus species using a phylogenetic approach, particularly of the units of such genetic transfer. Here we report the first systematic study of the units of genetic transfer in 13 Staphylococcus genomes, using a rigorous phylogenetic approach. We found clear evidence of LGT in 26.1% of the 1354 homologous gene families examined, and possibly more in another 17.9% of the total families. Within-gene and whole-gene transfer contribute almost equally to the discordance of these gene families against a reference phylogeny. Comparing genetic transfer in single-copy and in multi-copy gene families, we found little functional bias in cases of within-gene (fragmentary) genetic transfer but substantial functional bias in cases of whole-gene (non-fragmentary) genetic transfer, and we observed a higher frequency of LGT in multi-copy gene families. Our results demonstrate that LGT and gene duplication play an important part among the factors that contribute to functional innovation in staphylococcal genomes.",
    "authors": [
      "Cheong Xin Chan",
      "Robert G. Beiko",
      "Mark A. Ragan"
    ],
    "publication_date": "2007-09-13T12:24:53Z",
    "arxiv_id": "http://arxiv.org/abs/0709.2031v2",
    "download_url": "https://arxiv.org/abs/0709.2031v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Transition probabilities for general birth-death processes with applications in ecology, genetics, and evolution",
    "abstract": "A birth-death process is a continuous-time Markov chain that counts the number of particles in a system over time. In the general process with $n$ current particles, a new particle is born with instantaneous rate $λ_n$ and a particle dies with instantaneous rate $μ_n$. Currently no robust and efficient method exists to evaluate the finite-time transition probabilities in a general birth-death process with arbitrary birth and death rates. In this paper, we first revisit the theory of continued fractions to obtain expressions for the Laplace transforms of these transition probabilities and make explicit an important derivation connecting transition probabilities and continued fractions. We then develop an efficient algorithm for computing these probabilities that analyzes the error associated with approximations in the method. We demonstrate that this error-controlled method agrees with known solutions and outperforms previous approaches to computing these probabilities. Finally, we apply our novel method to several important problems in ecology, evolution, and genetics.",
    "authors": [
      "Forrest W. Crawford",
      "Marc A. Suchard"
    ],
    "publication_date": "2011-11-28T22:43:05Z",
    "arxiv_id": "http://arxiv.org/abs/1111.6644v1",
    "download_url": "https://arxiv.org/abs/1111.6644v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dynamics of genetic code evolution: The emergence of universality",
    "abstract": "We study the dynamics of genetic code evolution. The model of Vetsigian et al. [1] and Vetsigian [2] uses the mechanism of horizontal gene transfer to demonstrate convergence of the genetic code to a near universal solution. We reproduce and analyze the algorithm as a dynamical system. All the parameters used in the model are varied to assess their impact on convergence and optimality score. We show that by allowing specific parameters to vary with time, the solution exhibits attractor dynamics. Finally, we study automorphisms of the genetic code arising due to this model. We use this to examine the scaling of the solutions in order to re-examine universality and find that there is a direct link to mutation rate.",
    "authors": [
      "John-Antonio Argyriadis",
      "Yang-Hui He",
      "Vishnu Jejjala",
      "Djordje Minic"
    ],
    "publication_date": "2019-09-23T14:59:09Z",
    "arxiv_id": "http://arxiv.org/abs/1909.10405v2",
    "download_url": "https://arxiv.org/abs/1909.10405v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Demographic inference using genetic data from a single individual: separating population size variation from population structure",
    "abstract": "The rapid development of sequencing technologies represents new opportunities for population genetics research. It is expected that genomic data will increase our ability to reconstruct the history of populations. While this increase in genetic information will likely help biologists and anthropologists to reconstruct the demographic history of populations, it also represents new challenges. Recent work has shown that structured populations generate signals of population size change. As a consequence it is often difficult to determine whether demographic events such as expansions or contractions (bottlenecks) inferred from genetic data are real or due to the fact that populations are structured in nature. Given that few inferential methods allow us to account for that structure, and that genomic data will necessarily increase the precision of parameter estimates, it is important to develop new approaches. In the present study we analyse two demographic models. The first is a model of instantaneous population size change whereas the second is the classical symmetric island model. We (i) re-derive the distribution of coalescence times under the two models for a sample of size two, (ii) use a maximum likelihood approach to estimate the parameters of these models (iii) validate this estimation procedure under a wide array of parameter combinations, (iv) implement and validate a model choice procedure by using a Kolmogorov-Smirnov test. Altogether we show that it is possible to estimate parameters under several models and perform efficient model choice using genetic data from a single diploid individual.",
    "authors": [
      "Olivier Mazet",
      "Willy Rodríguez",
      "Lounès Chikhi"
    ],
    "publication_date": "2014-12-03T09:28:29Z",
    "arxiv_id": "http://arxiv.org/abs/1412.1243v1",
    "download_url": "https://arxiv.org/abs/1412.1243v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How does geographical distance translate into genetic distance?",
    "abstract": "Geographic structure can affect patterns of genetic differentiation and speciation rates. In this article, we investigate the dynamics of genetic distances in a geographically structured metapopulation. We model the metapopulation as a weighted directed graph, with d vertices corresponding to d subpopulations that evolve according to an individual based model. The dynamics of the genetic distances is then controlled by two types of transitions -mutation and migration events. We show that, under a rare mutation - rare migration regime, intra subpopulation diversity can be neglected and our model can be approximated by a population based model. We show that under a large population - large number of loci limit, the genetic distance between two subpopulations converges to a deterministic quantity that can asymptotically be expressed in terms of the hitting time between two random walks in the metapopulation graph. Our result shows that the genetic distance between two subpopulations does not only depend on the direct migration rates between them but on the whole metapopulation structure.",
    "authors": [
      "Verónica Miró Pina",
      "Emmanuel Schertzer"
    ],
    "publication_date": "2017-03-01T15:56:41Z",
    "arxiv_id": "http://arxiv.org/abs/1703.00357v3",
    "download_url": "https://arxiv.org/abs/1703.00357v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cellular and Developmental Basis of Avian Structural Coloration",
    "abstract": "Vivid structural colors in birds are a conspicuous and vital part of their phenotype. They are produced by a rich diversity of integumentary photonic nanostructures in skin and feathers. Unlike pigmentary coloration, whose molecular genetic basis is being elucidated, little is known regarding the pathways underpinning organismal structural coloration. Here, we review available data on the development of avian structural colors. In particular, feather photonic nanostructures are understood to be intracellularly self-assembled by physicochemical forces typically seen in soft colloidal systems. We identify promising avenues for future research that can address current knowledge gaps, which is also highly relevant for the sustainable engineering of advanced bioinspired and biomimetic materials.",
    "authors": [
      "Vinodkumar Saranathan",
      "Cédric Finet"
    ],
    "publication_date": "2020-12-18T16:36:36Z",
    "arxiv_id": "http://arxiv.org/abs/2012.10338v2",
    "download_url": "https://arxiv.org/abs/2012.10338v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Neural Design for Genetic Perturbation Experiments",
    "abstract": "The problem of how to genetically modify cells in order to maximize a certain cellular phenotype has taken center stage in drug development over the last few years (with, for example, genetically edited CAR-T, CAR-NK, and CAR-NKT cells entering cancer clinical trials). Exhausting the search space for all possible genetic edits (perturbations) or combinations thereof is infeasible due to cost and experimental limitations. This work provides a theoretically sound framework for iteratively exploring the space of perturbations in pooled batches in order to maximize a target phenotype under an experimental budget. Inspired by this application domain, we study the problem of batch query bandit optimization and introduce the Optimistic Arm Elimination ($\\mathrm{OAE}$) principle designed to find an almost optimal arm under different functional relationships between the queries (arms) and the outputs (rewards). We analyze the convergence properties of $\\mathrm{OAE}$ by relating it to the Eluder dimension of the algorithm's function class and validate that $\\mathrm{OAE}$ outperforms other strategies in finding optimal actions in experiments on simulated problems, public datasets well-studied in bandit contexts, and in genetic perturbation datasets when the regression model is a deep neural network. OAE also outperforms the benchmark algorithms in 3 of 4 datasets in the GeneDisco experimental planning challenge.",
    "authors": [
      "Aldo Pacchiano",
      "Drausin Wulsin",
      "Robert A. Barton",
      "Luis Voloch"
    ],
    "publication_date": "2022-07-26T10:59:52Z",
    "arxiv_id": "http://arxiv.org/abs/2207.12805v2",
    "download_url": "https://arxiv.org/abs/2207.12805v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Testing Quantum Dynamics in Genetic Information Processing",
    "abstract": "Does quantum dynamics play a role in DNA replication? What type of tests would reveal that? Some statistical checks that distinguish classical and quantum dynamics in DNA replication are proposed.",
    "authors": [
      "Apoorva Patel"
    ],
    "publication_date": "2001-02-06T09:38:22Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0102034v2",
    "download_url": "https://arxiv.org/abs/quant-ph/0102034v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quaternionic representation of the genetic code",
    "abstract": "A heuristic diagram of the evolution of the standard genetic code is presented. It incorporates, in a way that resembles the energy levels of an atom, the physical notion of broken symmetry and it is consistent with original ideas by Crick on the origin and evolution of the code as well as with the chronological order of appearence of the amino acids along the evolution as inferred from work that mixtures known experimental results with theoretical speculations. Suggested by the diagram we propose a Hamilton quaternions based mathematical representation of the code as it stands now-a-days. The central object in the description is a codon function that assigns to each amino acid an integer quaternion in such a way that the observed code degeneration is preserved. We emphasize the advantages of a quaternionic representation of amino acids taking as an example the folding of proteins. With this aim we propose an algorithm to go from the quaternions sequence to the protein three dimensional structure which can be compared with the corresponding experimental one stored at the Protein Data Bank. In our criterion the mathematical representation of the genetic code in terms of quaternions merits to be taken into account because it describes not only most of the known properties of the genetic code but also opens new perspectives that are mainly derived from the close relationship between quaternions and rotations.",
    "authors": [
      "C. Manuel Carlevaro",
      "Ramiro M. Irastorza",
      "Fernando Vericat"
    ],
    "publication_date": "2015-05-18T14:23:18Z",
    "arxiv_id": "http://arxiv.org/abs/1505.04656v2",
    "download_url": "https://arxiv.org/abs/1505.04656v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Kozax: Flexible and Scalable Genetic Programming in JAX",
    "abstract": "Genetic programming is an optimization algorithm inspired by evolution which automatically evolves the structure of interpretable computer programs. The fitness evaluation in genetic programming suffers from high computational requirements, limiting the performance on difficult problems. Consequently, there is no efficient genetic programming framework that is usable for a wide range of tasks. To this end, we developed Kozax, a genetic programming framework that evolves symbolic expressions for arbitrary problems. We implemented Kozax using JAX, a framework for high-performance and scalable machine learning, which allows the fitness evaluation to scale efficiently to large populations or datasets on GPU. Furthermore, Kozax offers constant optimization, custom operator definition and simultaneous evolution of multiple trees. We demonstrate successful applications of Kozax to discover equations of natural laws, recover equations of hidden dynamic variables, evolve a control policy and optimize an objective function. Overall, Kozax provides a general, fast, and scalable library to optimize white-box solutions in the realm of scientific computing.",
    "authors": [
      "Sigur de Vries",
      "Sander W. Keemink",
      "Marcel A. J. van Gerven"
    ],
    "publication_date": "2025-02-05T10:12:17Z",
    "arxiv_id": "http://arxiv.org/abs/2502.03047v2",
    "download_url": "https://arxiv.org/abs/2502.03047v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Causal Inference in Genetic Trio Studies",
    "abstract": "We introduce a method to rigorously draw causal inferences---inferences immune to all possible confounding---from genetic data that include parents and offspring. Causal conclusions are possible with these data because the natural randomness in meiosis can be viewed as a high-dimensional randomized experiment. We make this observation actionable by developing a novel conditional independence test that identifies regions of the genome containing distinct causal variants. The proposed Digital Twin Test compares an observed offspring to carefully constructed synthetic offspring from the same parents in order to determine statistical significance, and it can leverage any black-box multivariate model and additional non-trio genetic data in order to increase power. Crucially, our inferences are based only on a well-established mathematical description of the rearrangement of genetic material during meiosis and make no assumptions about the relationship between the genotypes and phenotypes.",
    "authors": [
      "Stephen Bates",
      "Matteo Sesia",
      "Chiara Sabatti",
      "Emmanuel Candes"
    ],
    "publication_date": "2020-02-22T06:40:05Z",
    "arxiv_id": "http://arxiv.org/abs/2002.09644v1",
    "download_url": "https://arxiv.org/abs/2002.09644v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The use of oscillatory signals in the study of genetic networks",
    "abstract": "The structure of a genetic network is uncovered by studying its response to external stimuli (input signals). We present a theory of propagation of an input signal through a linear stochastic genetic network. It is found that there are important advantages in using oscillatory signals over step or impulse signals, and that the system may enter into a pure fluctuation resonance for a specific input frequency.",
    "authors": [
      "Ovidiu Lipan",
      "Wing H. Wong"
    ],
    "publication_date": "2005-02-23T17:03:46Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0502033v1",
    "download_url": "https://arxiv.org/abs/q-bio/0502033v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mining Frequent Itemsets Using Genetic Algorithm",
    "abstract": "In general frequent itemsets are generated from large data sets by applying association rule mining algorithms like Apriori, Partition, Pincer-Search, Incremental, Border algorithm etc., which take too much computer time to compute all the frequent itemsets. By using Genetic Algorithm (GA) we can improve the scenario. The major advantage of using GA in the discovery of frequent itemsets is that they perform global search and its time complexity is less compared to other algorithms as the genetic algorithm is based on the greedy approach. The main aim of this paper is to find all the frequent itemsets from given data sets using genetic algorithm.",
    "authors": [
      "Soumadip Ghosh",
      "Sushanta Biswas",
      "Debasree Sarkar",
      "Partha Pratim Sarkar"
    ],
    "publication_date": "2010-11-01T14:14:10Z",
    "arxiv_id": "http://arxiv.org/abs/1011.0328v1",
    "download_url": "https://arxiv.org/abs/1011.0328v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Code as a Harmonic System",
    "abstract": "In a certain way, this paper presents the continuation of the previous one which discussed the harmonic structure of the genetic code (Rakocevic, 2004). Several new harmonic structures presented in this paper, through specific unity and coherence, together with the previously presented (Rakocevic, 2004), show that it makes sense to understand genetic code as a set of several different harmonic structures. Thereby, the harmonicity itself represents a specific unity and coherence of physico-chemical properties of amino acid molecules and the number of atoms and/or nucleons in the molecules themselves (in the form of typical balances). A specific Gauss' arithmetical algorithm has the central position among all these structures and it corresponds to the patterns of the number of atoms within the side chains of amino acid molecules in the following sense: G+V = 11; P+I = 21; S+T+L+A+G = 31; D+E+M+C+P = 41; K+R+Q+N+V = 61; F+Y+W+H+I = 71; (L+M+Q+W) + (A+C+N+H) = 81; (S+D+K+F) + (T+E+R+Y) = 91; (F+L+M+S+P) = (T+A+Y+H+I) = (Q+N+K+D+V) = (E+C+W+R+G) = 51. Bearing in mind all these regularities it make sense to talk about genetic code as a harmonic system. On the other hand, such an order provides new evidence supporting the hypothesis established in the previous paper (Rakocevic, 2004) that genetic code has been complete from the very beginning and as such was the condition for the origin and evolution of life.",
    "authors": [
      "Miloje M. Rakocevic"
    ],
    "publication_date": "2006-10-24T13:23:29Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0610044v1",
    "download_url": "https://arxiv.org/abs/q-bio/0610044v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shannon Mutual Information Applied to Genetic Systems",
    "abstract": "Shannon information has, in the past, been applied to quantify the genetic diversity of many natural populations. Here, we apply the Shannon concept to consecutive generations of alleles as they evolve over time. We suppose a genetic system analogous to the discrete noisy channel of Shannon, where the signal emitted by the input (mother population) is a number of alleles that will form the next generation (offspring). The alleles received at a given generation are conditional upon the previous generation. Knowledge of this conditional probability law allows us to track the evolution of the allele entropies and mutual information values from one generation to the next. We apply these laws to numerical computer simulations and to real data (Stryphnodendron adstringens). We find that, due to the genetic sampling process, in the absence of new mutations the mutual information increases between generations toward a maximum value. Lastly, after sufficient generations the system has a level of mutual information equal to the entropy (diversity) that it had at the beginning of the process (mother population). This implies no increase in genetic diversity in the absence of new mutations. Now, obviously, mutations are essential to the evolution of species. In addition, we observe that when a population shows at least a low level of genetic diversity, the highest values of mutual information between the generations occurs when the system is neither too orderly nor too disorderly. We also find that mutual information is a valid measure of allele fixation.",
    "authors": [
      "J. S. Glasenapp",
      "B. R. Frieden",
      "C. D. Cruz"
    ],
    "publication_date": "2015-12-08T04:42:25Z",
    "arxiv_id": "http://arxiv.org/abs/1512.02324v2",
    "download_url": "https://arxiv.org/abs/1512.02324v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Different Environmental Conditions in Genetic Algorithm",
    "abstract": "We propose an extended genetic algorithm (GA) with different local environmental conditions. Genetic entities, or configurations, are put on nodes in a ring structure, and location-dependent environmental conditions are applied for each entity. Our GA is motivated by the geographic aspect of natural evolution: Geographic isolation reduces the diversity in a local group, but at the same time, can enhance intergroup diversity. Mating of genetic entities across different environments can make it possible to search for broad area of the fitness landscape. We validate our extended GA for finding the ground state of three-dimensional spin-glass system and find that the use of different environmental conditions makes it possible to find the lower-energy spin configurations at relatively shorter computation time. Our extension of GA belongs to a meta-optimization method and thus can be applied for a broad research area in which finding of the optimal state in a shorter computation time is the key problem.",
    "authors": [
      "Daekyung Lee",
      "Beom Jun Kim"
    ],
    "publication_date": "2021-03-23T05:05:10Z",
    "arxiv_id": "http://arxiv.org/abs/2103.12313v1",
    "download_url": "https://arxiv.org/abs/2103.12313v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mathematic principles underlying genetic structures",
    "abstract": "Many people are familiar with the physico-chemical properties of gene sequences. In this paper I present a mathematical perspective: how do mathematical principles such as information theory, coding theory, and combinatorics influence the beginnings of life and the formation of the genetic codes we observe today? What constraints on possible life forms are imposed by information-theoretical concepts? Further, I detail how mathematical principles can help us to analyse the genetic sequences we observe in the world today.",
    "authors": [
      "Matthew J. Berryman"
    ],
    "publication_date": "2006-07-22T23:44:37Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0607039v1",
    "download_url": "https://arxiv.org/abs/q-bio/0607039v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Units of genetic transfer in prokaryotes",
    "abstract": "The transfer of genetic materials across species (lateral genetic transfer, LGT) contributes to genomic and physiological innovation in prokaryotes. The extent of LGT in prokaryotes has been examined in a number of studies, but the unit of transfer has not been studied in a rigorous manner. Using a rigorous phylogenetic approach, we analysed the units of LGT within families of single-copy genes obtained from 144 fully sequenced prokaryote genomes. A total of 30.3% of these gene families show evidence of LGT. We found that the transfer of gene fragments has been more frequent than the transfer of entire genes, suggesting the extent of LGT has been underestimated. We found little functional bias between within-gene (fragmentary) and whole-gene (non-fragmentary) genetic transfer, but non-fragmentary transfer has been more frequent into pathogens than into non-pathogens. As gene families that contain probable paralogs were excluded from the current study, our results may still underestimate the extent of LGT; nonetheless this is the most-comprehensive study to date of the unit of LGT among prokaryote genomes.",
    "authors": [
      "Cheong Xin Chan",
      "Robert G. Beiko",
      "Mark A. Ragan"
    ],
    "publication_date": "2007-09-13T15:58:32Z",
    "arxiv_id": "http://arxiv.org/abs/0709.2027v2",
    "download_url": "https://arxiv.org/abs/0709.2027v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Estimating the Heritability of Longitudinal Rate-of-Change: Genetic Insights into PSA Velocity in Prostate Cancer-Free Individuals",
    "abstract": "Serum prostate-specific antigen (PSA) is widely used for prostate cancer screening. While the genetics of PSA levels has been studied to enhance screening accuracy, the genetic basis of PSA velocity, the rate of PSA change over time, remains unclear. The Prostate, Lung, Colorectal, and Ovarian (PLCO) Cancer Screening Trial, a large, randomized study with longitudinal PSA data (15,260 cancer-free males, averaging 5.34 samples per subject) and genome-wide genotype data, provides a unique opportunity to estimate PSA velocity heritability. We developed a mixed model to jointly estimate heritability of PSA levels at age 54 and PSA velocity. To accommodate the large dataset, we implemented two efficient computational approaches: a partitioning and meta-analysis strategy using average information restricted maximum likelihood (AI-REML), and a fast restricted Haseman-Elston (REHE) regression method. Simulations showed that both methods yield unbiased estimates of both heritability metrics, with AI-REML providing smaller variability in the estimation of velocity heritability than REHE. Applying AI-REML to PLCO data, we estimated heritability at 0.32 (s.e. = 0.07) for baseline PSA and 0.45 (s.e. = 0.18) for PSA velocity. These findings reveal a substantial genetic contribution to PSA velocity, supporting future genome-wide studies to identify variants affecting PSA dynamics and improve PSA-based screening.",
    "authors": [
      "Pei Zhang",
      "Xiaoyu Wang",
      "Jianxin Shi",
      "Paul S. Albert"
    ],
    "publication_date": "2025-05-07T19:50:39Z",
    "arxiv_id": "http://arxiv.org/abs/2505.04773v3",
    "download_url": "https://arxiv.org/abs/2505.04773v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Algorithms for multiple objective vehicle routing",
    "abstract": "The talk describes a general approach of a genetic algorithm for multiple objective optimization problems. A particular dominance relation between the individuals of the population is used to define a fitness operator, enabling the genetic algorithm to adress even problems with efficient, but convex-dominated alternatives. The algorithm is implemented in a multilingual computer program, solving vehicle routing problems with time windows under multiple objectives. The graphical user interface of the program shows the progress of the genetic algorithm and the main parameters of the approach can be easily modified. In addition to that, the program provides powerful decision support to the decision maker. The software has proved it's excellence at the finals of the European Academic Software Award EASA, held at the Keble college/ University of Oxford/ Great Britain.",
    "authors": [
      "Martin Josef Geiger"
    ],
    "publication_date": "2008-09-02T12:08:56Z",
    "arxiv_id": "http://arxiv.org/abs/0809.0416v1",
    "download_url": "https://arxiv.org/abs/0809.0416v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The strength of genetic interactions scales weakly with the mutational effects",
    "abstract": "Genetic interactions pervade every aspect of biology, from evolutionary theory where they determine the accessibility of evolutionary paths, to medicine where they contribute to complex genetic diseases. Until very recently, studies on epistatic interactions have been based on a handful of mutations, providing at best anecdotal evidence about the frequency and the typical strength of genetic interactions. In this study we analyze the publicly available Data Repository of Yeast Genetic INteractions (DRYGIN), which contains the growth rates of over five million double gene knockout mutants. We discuss a geometric definition of epistasis which reveals a simple and surprisingly weak scaling law for the characteristic strength of genetic interactions as a function of the effects of the mutations being combined. We then utilize this scaling to quantify the roughness of naturally occurring fitness landscapes. Finally, we show how the observed roughness differs from what is predicted by Fisher's geometric model of epistasis and discuss its consequences on the evolutionary dynamics. Although epistatic interactions between specific genes remain largely unpredictable, the statistical properties of an ensemble of interactions can display conspicuous regularities and be described by simple mathematical laws. By exploiting the amount of data produced by modern high-throughput techniques it is now possible to thoroughly test the predictions of theoretical models of genetic interactions and to build informed computational models of evolution on realistic fitness landscapes.",
    "authors": [
      "Andrea Velenich",
      "Jeff Gore"
    ],
    "publication_date": "2013-03-18T20:01:04Z",
    "arxiv_id": "http://arxiv.org/abs/1303.4401v1",
    "download_url": "https://arxiv.org/abs/1303.4401v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Estimation of the genetic Gaussian network using GWAS summary data",
    "abstract": "Genetic Gaussian network of multiple phenotypes constructed through the genetic correlation matrix is informative for understanding their biological dependencies. However, its interpretation may be challenging because the estimated genetic correlations are biased due to estimation errors and horizontal pleiotropy inherent in GWAS summary statistics. Here we introduce a novel approach called Estimation of Genetic Graph (EGG), which eliminates the estimation error bias and horizontal pleiotropy bias with the same techniques used in multivariable Mendelian randomization. The genetic network estimated by EGG can be interpreted as representing shared common biological contributions between phenotypes, conditional on others, and even as indicating the causal contributions. We use both simulations and real data to demonstrate the superior efficacy of our novel method in comparison with the traditional network estimators. R package EGG is available on https://github.com/harryyiheyang/EGG.",
    "authors": [
      "Yihe Yang",
      "Noah Lorincz-Comi",
      "Xiaofeng Zhu"
    ],
    "publication_date": "2024-01-15T15:25:17Z",
    "arxiv_id": "http://arxiv.org/abs/2401.07767v1",
    "download_url": "https://arxiv.org/abs/2401.07767v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Faster Optimization Through Genetic Drift",
    "abstract": "The compact Genetic Algorithm (cGA), parameterized by its hypothetical population size $K$, offers a low-memory alternative to evolving a large offspring population of solutions. It evolves a probability distribution, biasing it towards promising samples. For the classical benchmark OneMax, the cGA has to two different modes of operation: a conservative one with small step sizes $Θ(1/(\\sqrt{n}\\log n))$, which is slow but prevents genetic drift, and an aggressive one with large step sizes $Θ(1/\\log n)$, in which genetic drift leads to wrong decisions, but those are corrected efficiently. On OneMax, an easy hill-climbing problem, both modes lead to optimization times of $Θ(n\\log n)$ and are thus equally efficient.\n  In this paper we study how both regimes change when we replace OneMax by the harder hill-climbing problem DynamicBinVal. It turns out that the aggressive mode is not affected and still yields quasi-linear runtime $O(n\\cdot polylog (n))$. However, the conservative mode becomes substantially slower, yielding a runtime of $Ω(n^2)$, since genetic drift can only be avoided with smaller step sizes of $O(1/n)$. We complement our theoretical results with simulations.",
    "authors": [
      "Cella Florescu",
      "Marc Kaufmann",
      "Johannes Lengler",
      "Ulysse Schaller"
    ],
    "publication_date": "2024-04-18T12:51:32Z",
    "arxiv_id": "http://arxiv.org/abs/2404.12147v1",
    "download_url": "https://arxiv.org/abs/2404.12147v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MCTS guided Genetic Algorithm for optimization of neural network weights",
    "abstract": "In this research, we investigate the possibility of applying a search strategy to genetic algorithms to explore the entire genetic tree structure. Several methods aid in performing tree searches; however, simpler algorithms such as breadth-first, depth-first, and iterative techniques are computation-heavy and often result in a long execution time. Adversarial techniques are often the preferred mechanism when performing a probabilistic search, yielding optimal results more quickly. The problem we are trying to tackle in this paper is the optimization of neural networks using genetic algorithms. Genetic algorithms (GA) form a tree of possible states and provide a mechanism for rewards via the fitness function. Monte Carlo Tree Search (MCTS) has proven to be an effective tree search strategy given states and rewards; therefore, we will combine these approaches to optimally search for the best result generated with genetic algorithms.",
    "authors": [
      "Akshay Hebbar"
    ],
    "publication_date": "2023-08-07T18:11:51Z",
    "arxiv_id": "http://arxiv.org/abs/2308.04459v1",
    "download_url": "https://arxiv.org/abs/2308.04459v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Self-adaptation of Genetic Operators Through Genetic Programming Techniques",
    "abstract": "Here we propose an evolutionary algorithm that self modifies its operators at the same time that candidate solutions are evolved. This tackles convergence and lack of diversity issues, leading to better solutions. Operators are represented as trees and are evolved using genetic programming (GP) techniques. The proposed approach is tested with real benchmark functions and an analysis of operator evolution is provided.",
    "authors": [
      "Andres Felipe Cruz Salinas",
      "Jonatan Gomez Perdomo"
    ],
    "publication_date": "2017-12-17T07:53:36Z",
    "arxiv_id": "http://arxiv.org/abs/1712.06070v1",
    "download_url": "https://arxiv.org/abs/1712.06070v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Statistical methods for the quantitative genetic analysis of high-throughput phenotyping data",
    "abstract": "The advent of plant phenomics, coupled with the wealth of genotypic data generated by next-generation sequencing technologies, provides exciting new resources for investigations into and improvement of complex traits. However, these new technologies also bring new challenges in quantitative genetics, namely, a need for the development of robust frameworks that can accommodate these high-dimensional data. In this chapter, we describe methods for the statistical analysis of high-throughput phenotyping (HTP) data with the goal of enhancing the prediction accuracy of genomic selection (GS). Following the Introduction in Section 1, Section 2 discusses field-based HTP, including the use of unmanned aerial vehicles and light detection and ranging, as well as how we can achieve increased genetic gain by utilizing image data derived from HTP. Section 3 considers extending commonly used GS models to integrate HTP data as covariates associated with the principal trait response, such as yield. Particular focus is placed on single-trait, multi-trait, and genotype by environment interaction models. One unique aspect of HTP data is that phenomics platforms often produce large-scale data with high spatial and temporal resolution for capturing dynamic growth, development, and stress responses. Section 4 discusses the utility of a random regression model for performing longitudinal GS. The chapter concludes with a discussion of some standing issues.",
    "authors": [
      "Gota Morota",
      "Diego Jarquin",
      "Malachy T. Campbell",
      "Hiroyoshi Iwata"
    ],
    "publication_date": "2019-04-28T16:32:06Z",
    "arxiv_id": "http://arxiv.org/abs/1904.12341v1",
    "download_url": "https://arxiv.org/abs/1904.12341v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information capacity of genetic regulatory elements",
    "abstract": "Changes in a cell's external or internal conditions are usually reflected in the concentrations of the relevant transcription factors. These proteins in turn modulate the expression levels of the genes under their control and sometimes need to perform non-trivial computations that integrate several inputs and affect multiple genes. At the same time, the activities of the regulated genes would fluctuate even if the inputs were held fixed, as a consequence of the intrinsic noise in the system, and such noise must fundamentally limit the reliability of any genetic computation. Here we use information theory to formalize the notion of information transmission in simple genetic regulatory elements in the presence of physically realistic noise sources. The dependence of this \"channel capacity\" on noise parameters, cooperativity and cost of making signaling molecules is explored systematically. We find that, at least in principle, capacities higher than one bit should be achievable and that consequently genetic regulation is not limited the use of binary, or \"on-off\", components.",
    "authors": [
      "Gasper Tkacik",
      "Curtis G Callan",
      "William Bialek"
    ],
    "publication_date": "2007-09-26T16:31:30Z",
    "arxiv_id": "http://arxiv.org/abs/0709.4209v1",
    "download_url": "https://arxiv.org/abs/0709.4209v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Algorithms for Multiple-Choice Problems",
    "abstract": "This thesis investigates the use of problem-specific knowledge to enhance a genetic algorithm approach to multiple-choice optimisation problems.It shows that such information can significantly enhance performance, but that the choice of information and the way it is included are important factors for success.Two multiple-choice problems are considered.The first is constructing a feasible nurse roster that considers as many requests as possible.In the second problem, shops are allocated to locations in a mall subject to constraints and maximising the overall income.Genetic algorithms are chosen for their well-known robustness and ability to solve large and complex discrete optimisation problems.However, a survey of the literature reveals room for further research into generic ways to include constraints into a genetic algorithm framework.Hence, the main theme of this work is to balance feasibility and cost of solutions.In particular, co-operative co-evolution with hierarchical sub-populations, problem structure exploiting repair schemes and indirect genetic algorithms with self-adjusting decoder functions are identified as promising approaches.The research starts by applying standard genetic algorithms to the problems and explaining the failure of such approaches due to epistasis.To overcome this, problem-specific information is added in a variety of ways, some of which are designed to increase the number of feasible solutions found whilst others are intended to improve the quality of such solutions.As well as a theoretical discussion as to the underlying reasons for using each operator,extensive computational experiments are carried out on a variety of data.These show that the indirect approach relies less on problem structure and hence is easier to implement and superior in solution quality.",
    "authors": [
      "Uwe Aickelin"
    ],
    "publication_date": "2010-04-19T10:16:18Z",
    "arxiv_id": "http://arxiv.org/abs/1004.3147v1",
    "download_url": "https://arxiv.org/abs/1004.3147v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "System-Level Genetic Codes: An Explanation for Biological Complexity",
    "abstract": "Complex systems with tightly coadapted parts frequently appear in living systems and are difficult to account for through Darwinian evolution, that is random variation and natural selection, if the constituent parts are independently coded in the genetic code. If the parts are independently coded, multiple simultaneous mutations appear necessary to create or modify these systems. It is generally believed that most proteins are independently coded. The textbook rule is one gene for one enzyme. Thus, biochemical systems with tightly coadapted parts such as the blood clotting cascade pose a difficulty for Darwinian evolution. This problem can be overcome if the current understanding of the genetic code is incomplete and a system-level genetic code in which seemingly independent proteins are encoded in an interdependent, highly correlated manner exists. The methods by which human beings design and fabricate complex systems of tightly coadapted parts are explored for insights into the requirements for a system-level genetic code. Detailed examples of system-level codes for networks of matching parts are presented. The implications of identifying and deciphering the system-level genetic code if it exists for the prevention, treatment, and cure of heart disease, cancer, immune disorders, and for rational drug design are discussed.",
    "authors": [
      "John F. McGowan",
      "Ph. D"
    ],
    "publication_date": "2000-02-26T01:00:47Z",
    "arxiv_id": "http://arxiv.org/abs/nlin/0002051v1",
    "download_url": "https://arxiv.org/abs/nlin/0002051v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interplay of Fidelity and Diversity in the Evolution of the Genetic Code",
    "abstract": "The origin and organizing principles of the genetic code remain fundamental puzzles in life science. The vanishingly low probability of the natural codon-to-amino acid mapping arising by chance has spurred the hypothesis that its structure is a solution optimized for robustness against mutations and translational errors. For the construction of effective molecular machines, the dictionary of encoded amino acids must also be diverse enough in physicochemical features. Here, we examine whether the standard genetic code can be understood as a near-optimal solution balancing these two objectives: minimizing error load and aligning codon assignments with the naturally occurring amino acid composition. Using simulated annealing, we explore this trade-off across a broad range of parameters. We find that the standard genetic code lies near local optima within the multidimensional parameter space. It is a highly effective solution that balances fidelity against resource availability constraints. These results suggest that the present genetic code reflects coevolution under conflicting pressures of fidelity and diversity, offering new insight into its emergence and evolution.",
    "authors": [
      "Yudam Seo",
      "Tsvi Tlusty",
      "Junghyo Jo"
    ],
    "publication_date": "2025-10-13T00:40:14Z",
    "arxiv_id": "http://arxiv.org/abs/2510.10871v1",
    "download_url": "https://arxiv.org/abs/2510.10871v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Influence of Selection Operators on Performances in Cellular Genetic Algorithms",
    "abstract": "In this paper, we study the influence of the selective pressure on the performance of cellular genetic algorithms. Cellular genetic algorithms are genetic algorithms where the population is embedded on a toroidal grid. This structure makes the propagation of the best so far individual slow down, and allows to keep in the population potentially good solutions. We present two selective pressure reducing strategies in order to slow down even more the best solution propagation. We experiment these strategies on a hard optimization problem, the quadratic assignment problem, and we show that there is a value for of the control parameter for both which gives the best performance. This optimal value does not find explanation on only the selective pressure, measured either by take over time and diversity evolution. This study makes us conclude that we need other tools than the sole selective pressure measures to explain the performances of cellular genetic algorithms.",
    "authors": [
      "David Simoncini",
      "Philippe Collard",
      "Sébastien Verel",
      "Manuel Clergue"
    ],
    "publication_date": "2008-04-05T13:27:51Z",
    "arxiv_id": "http://arxiv.org/abs/0804.0852v1",
    "download_url": "https://arxiv.org/abs/0804.0852v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predicting patterns of long-term adaptation and extinction with population genetics",
    "abstract": "Population genetics struggles to model extinction; standard models track the relative rather than absolute fitness of genotypes, while the exceptions describe only the short-term transition from imminent doom to evolutionary rescue. But extinction can result from failure to adapt not only to catastrophes, but also to a backlog of environmental challenges. We model long-term evolution to long series of small challenges, where fitter populations reach higher population sizes. The population's long-term fitness dynamic is well approximated by a simple stochastic Markov chain model. Long-term persistence occurs when the rate of adaptation exceeds the rate of environmental deterioration for some genotypes. Long-term persistence times are consistent with typical fossil species persistence times of several million years. Immediately preceding extinction, fitness declines rapidly, appearing as though a catastrophe disrupted a stably established population, even though gradual evolutionary processes are responsible. New populations go through an establishment phase where, despite being demographically viable, their extinction risk is elevated. Should the population survive long enough, extinction risk later becomes constant over time.",
    "authors": [
      "Jason Bertram",
      "Kevin Gomez",
      "Joanna Masel"
    ],
    "publication_date": "2016-05-27T17:08:30Z",
    "arxiv_id": "http://arxiv.org/abs/1605.08717v2",
    "download_url": "https://arxiv.org/abs/1605.08717v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Algorithm for Constrained Molecular Inverse Design",
    "abstract": "A genetic algorithm is suitable for exploring large search spaces as it finds an approximate solution. Because of this advantage, genetic algorithm is effective in exploring vast and unknown space such as molecular search space. Though the algorithm is suitable for searching vast chemical space, it is difficult to optimize pharmacological properties while maintaining molecular substructure. To solve this issue, we introduce a genetic algorithm featuring a constrained molecular inverse design. The proposed algorithm successfully produces valid molecules for crossover and mutation. Furthermore, it optimizes specific properties while adhering to structural constraints using a two-phase optimization. Experiments prove that our algorithm effectively finds molecules that satisfy specific properties while maintaining structural constraints.",
    "authors": [
      "Yurim Lee",
      "Gydam Choi",
      "Minsung Yoon",
      "Cheongwon Kim"
    ],
    "publication_date": "2021-12-07T05:58:44Z",
    "arxiv_id": "http://arxiv.org/abs/2112.03518v2",
    "download_url": "https://arxiv.org/abs/2112.03518v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Regulation of Cytokine Response in Patients with Acute Community-acquired Pneumonia",
    "abstract": "Background: Community-acquired pneumonia (CAP) is an acute disease condition with a high risk of rapid deteriorations. We analysed the influence of genetics on cytokine regulation to obtain a better understanding of patient's heterogeneity. Methods: For up to N=389 genotyped participants of the PROGRESS study of hospitalised CAP patients, we performed a genome-wide association study of ten cytokines IL-1b, IL-6, IL-8, IL-10, IL-12, MCP-1 (MCAF), MIP-1a (CCL3), VEGF, VCAM-1, and ICAM-1. Consecutive secondary analyses were performed to identify independent hits and corresponding causal variants. Results: 102 SNPs from 14 loci showed genome-wide significant associations with five of the cytokines. The most interesting associations were found at 6p21.1 for VEGF (p=1.58x10E-20), at 17q21.32 (p=1.51x10E-9) and at 10p12.1 (p=2.76x10E-9) for IL-1b, at 10p13 for MIP-1a (CCL3) (p=2.28x10E-9), and at 9q34.12 for IL-10 (p=4.52x10E-8). Functionally plausible genes could be assigned to the majority of loci including genes involved in cytokine secretion, granulocyte function, and cilial kinetics. Conclusions: This is the first context-specific genetic association study of blood cytokine concentrations in CAP patients revealing numerous biologically plausible candidate genes. Two of the loci were also associated with atherosclerosis with probable common or consecutive pathomechanisms.",
    "authors": [
      "Andreas Kühnapfel",
      "Katrin Horn",
      "Ulrike Klotz",
      "Michael Kiehntopf",
      "Maciej Rosolowski",
      "Markus Loeffler",
      "Peter Ahnert",
      "Norbert Suttorp",
      "Martin Witzenrath",
      "Markus Scholz"
    ],
    "publication_date": "2021-10-11T19:32:43Z",
    "arxiv_id": "http://arxiv.org/abs/2110.05574v1",
    "download_url": "https://arxiv.org/abs/2110.05574v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Signature-Informed Selection Detection: A Novel Method for Multi-Locus Temporal Population Genetic Model with Recombination",
    "abstract": "In population genetics, there is often interest in inferring selection coefficients. This task becomes more challenging if multiple linked selected loci are considered simultaneously. For such a situation, we propose a novel generalized Bayesian framework where we compute a scoring rule posterior for the selection coefficients in multi-locus temporal population genetics models. As we consider trajectories of allele frequencies over time as our data, we choose to use a signature kernel scoring rule - a kernel scoring rule defined for high-dimensional time-series data using iterated path integrals of a path (called signatures). We can compute an unbiased estimate of the signature kernel score using model simulations. This enables us to sample asymptotically from the signature kernel scoring rule posterior of the selection coefficients using pseudo-marginal MCMC-type algorithms. Through a simulation study, we were able to show the inferential efficacy of our method compared to existing benchmark methods for two and three selected locus scenarios under the standard Wright-Fisher model with recombination and selection. We also consider a negative frequency-dependent selection model for one and two locus scenarios, and also joint inference of selection coefficients and initial haplotype frequencies under the standard Wright-Fisher model. Finally, we illustrate the application of our inferential method for two real-life dataset. More specifically, we consider a data set on Yeast, as well as data from an Evolve and Resequence (E\\&R) experiment on {\\em Drosophila simulans}.",
    "authors": [
      "Ritabrata Dutta",
      "Yuehao Xu",
      "Sherman Khoo",
      "Francesca Basini",
      "Andreas Futschik"
    ],
    "publication_date": "2025-12-16T12:32:37Z",
    "arxiv_id": "http://arxiv.org/abs/2512.14353v1",
    "download_url": "https://arxiv.org/abs/2512.14353v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information transmission in genetic regulatory networks: a review",
    "abstract": "Genetic regulatory networks enable cells to respond to the changes in internal and external conditions by dynamically coordinating their gene expression profiles. Our ability to make quantitative measurements in these biochemical circuits has deepened our understanding of what kinds of computations genetic regulatory networks can perform and with what reliability. These advances have motivated researchers to look for connections between the architecture and function of genetic regulatory networks. Transmitting information between network's inputs and its outputs has been proposed as one such possible measure of function, relevant in certain biological contexts. Here we summarize recent developments in the application of information theory to gene regulatory networks. We first review basic concepts in information theory necessary to understand recent work. We then discuss the functional complexity of gene regulation which arrises from the molecular nature of the regulatory interactions. We end by reviewing some experiments supporting the view that genetic networks responsible for early development of multicellular organisms might be maximizing transmitted 'positional' information.",
    "authors": [
      "Aleksandra M Walczak",
      "Gašper Tkačik"
    ],
    "publication_date": "2011-01-21T22:30:49Z",
    "arxiv_id": "http://arxiv.org/abs/1101.4240v1",
    "download_url": "https://arxiv.org/abs/1101.4240v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Algorithm for Epidemic Mitigation by Removing Relationships",
    "abstract": "Min-SEIS-Cluster is an optimization problem which aims at minimizing the infection spreading in networks. In this problem, nodes can be susceptible to an infection, exposed to an infection, or infectious. One of the main features of this problem is the fact that nodes have different dynamics when interacting with other nodes from the same community. Thus, the problem is characterized by distinct probabilities of infecting nodes from both the same and from different communities. This paper presents a new genetic algorithm that solves the Min-SEIS-Cluster problem. This genetic algorithm surpassed the current heuristic of this problem significantly, reducing the number of infected nodes during the simulation of the epidemics. The results therefore suggest that our new genetic algorithm is the state-of-the-art heuristic to solve this problem.",
    "authors": [
      "Fernando Concatto",
      "Wellington Zunino",
      "Luigi A. Giancoli",
      "Rafael Santiago",
      "Luís C. Lamb"
    ],
    "publication_date": "2017-07-17T19:15:35Z",
    "arxiv_id": "http://arxiv.org/abs/1707.05377v1",
    "download_url": "https://arxiv.org/abs/1707.05377v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Algorithms for Extension Search in Default Logic",
    "abstract": "A default theory can be characterized by its sets of plausible conclusions, called its extensions. But, due to the theoretical complexity of Default Logic (Sigma_2p-complete), the problem of finding such an extension is very difficult if one wants to deal with non trivial knowledge bases. Based on the principle of natural selection, Genetic Algorithms have been quite successfully applied to combinatorial problems and seem useful for problems with huge search spaces and when no tractable algorithm is available. The purpose of this paper is to show that techniques issued from Genetic Algorithms can be used in order to build an efficient default reasoning system. After providing a formal description of the components required for an extension search based on Genetic Algorithms principles, we exhibit some experimental results.",
    "authors": [
      "P. Nicolas",
      "F. Saubion",
      "I. Stephan"
    ],
    "publication_date": "2000-02-24T16:09:04Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0002015v1",
    "download_url": "https://arxiv.org/abs/cs/0002015v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Informed Trees (GIT*): Path Planning via Reinforced Genetic Programming Heuristics",
    "abstract": "Optimal path planning involves finding a feasible state sequence between a start and a goal that optimizes an objective. This process relies on heuristic functions to guide the search direction. While a robust function can improve search efficiency and solution quality, current methods often overlook available environmental data and simplify the function structure due to the complexity of information relationships. This study introduces Genetic Informed Trees (GIT*), which improves upon Effort Informed Trees (EIT*) by integrating a wider array of environmental data, such as repulsive forces from obstacles and the dynamic importance of vertices, to refine heuristic functions for better guidance. Furthermore, we integrated reinforced genetic programming (RGP), which combines genetic programming with reward system feedback to mutate genotype-generative heuristic functions for GIT*. RGP leverages a multitude of data types, thereby improving computational efficiency and solution quality within a set timeframe. Comparative analyses demonstrate that GIT* surpasses existing single-query, sampling-based planners in problems ranging from R^4 to R^16 and was tested on a real-world mobile manipulation task. A video showcasing our experimental results is available at https://youtu.be/URjXbc_BiYg",
    "authors": [
      "Liding Zhang",
      "Kuanqi Cai",
      "Zhenshan Bing",
      "Chaoqun Wang",
      "Alois Knoll"
    ],
    "publication_date": "2025-08-28T15:02:02Z",
    "arxiv_id": "http://arxiv.org/abs/2508.20871v1",
    "download_url": "https://arxiv.org/abs/2508.20871v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Random-key genetic algorithms: Principles and applications",
    "abstract": "A random-key genetic algorithm is an evolutionary metaheuristic for discrete and global optimization. Each solution is encoded as a vector of N random keys, where a random key is a real number randomly generated in the continuous interval [0, 1). A decoder maps each vector of random keys to a solution of the optimization problem being solved and computes its cost. The benefit of this approach is that all genetic operators and transformations can be maintained within the unitary hypercube, regardless of the problem being addressed. This enhances the productivity and maintainability of the core framework. The algorithm starts with a population of P vectors of random keys. At each iteration, the vectors are partitioned into two sets: a smaller set of high-valued elite solutions and the remaining non-elite solutions. All elite elements are copied, without change, to the next population. A small number of random-key vectors (the mutants) is added to the population of the next iteration. The remaining elements of the population of the next iteration are generated by combining, with the parametrized uniform crossover of Spears and DeJong (1991), pairs of solutions. This chapter reviews random-key genetic algorithms and describes an effective variant called biased random-key genetic algorithms.",
    "authors": [
      "Mariana A. Londe",
      "Luciana S. Pessoa",
      "Carlos E. Andrade",
      "José F. Gonçalves",
      "Mauricio G. C. Resende"
    ],
    "publication_date": "2025-06-02T18:00:07Z",
    "arxiv_id": "http://arxiv.org/abs/2506.02120v2",
    "download_url": "https://arxiv.org/abs/2506.02120v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]