[
  {
    "title": "Comparison Study for Clonal Selection Algorithm and Genetic Algorithm",
    "abstract": "Two metaheuristic algorithms namely Artificial Immune Systems (AIS) and\nGenetic Algorithms are classified as computational systems inspired by\ntheoretical immunology and genetics mechanisms. In this work we examine the\ncomparative performances of two algorithms. A special selection algorithm,\nClonal Selection Algorithm (CLONALG), which is a subset of Artificial Immune\nSystems, and Genetic Algorithms are tested with certain benchmark functions. It\nis shown that depending on type of a function Clonal Selection Algorithm and\nGenetic Algorithm have better performance over each other.",
    "authors": [
      "Ezgi Deniz Ulker",
      "Sadik Ulker"
    ],
    "publication_date": "2012-09-12T20:17:05Z",
    "arxiv_id": "http://arxiv.org/abs/1209.2717v1",
    "download_url": "http://arxiv.org/abs/1209.2717v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Optimization of Keywords Subset in the Classification Analysis\n  of Texts Authorship",
    "abstract": "The genetic selection of keywords set, the text frequencies of which are\nconsidered as attributes in text classification analysis, has been analyzed.\nThe genetic optimization was performed on a set of words, which is the fraction\nof the frequency dictionary with given frequency limits. The frequency\ndictionary was formed on the basis of analyzed text array of texts of English\nfiction. As the fitness function which is minimized by the genetic algorithm,\nthe error of nearest k neighbors classifier was used. The obtained results show\nhigh precision and recall of texts classification by authorship categories on\nthe basis of attributes of keywords set which were selected by the genetic\nalgorithm from the frequency dictionary.",
    "authors": [
      "Bohdan Pavlyshenko"
    ],
    "publication_date": "2012-11-14T20:04:51Z",
    "arxiv_id": "http://arxiv.org/abs/1211.3402v1",
    "download_url": "http://arxiv.org/abs/1211.3402v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Algorithms and its use with back-propagation network",
    "abstract": "Genetic algorithms are considered as one of the most efficient search\ntechniques. Although they do not offer an optimal solution, their ability to\nreach a suitable solution in considerably short time gives them their\nrespectable role in many AI techniques. This work introduces genetic algorithms\nand describes their characteristics. Then a novel method using genetic\nalgorithm in best training set generation and selection for a back-propagation\nnetwork is proposed. This work also offers a new extension to the original\ngenetic algorithms",
    "authors": [
      "Ayman M. Bahaa-Eldin",
      "A. M. A. Wahdan",
      "H. M. K. Mahdi"
    ],
    "publication_date": "2014-01-21T10:01:27Z",
    "arxiv_id": "http://arxiv.org/abs/1401.5246v1",
    "download_url": "http://arxiv.org/abs/1401.5246v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multidimensional Stochastic Process Model and its Applications to\n  Analysis of Longitudinal Data with Genetic Information",
    "abstract": "Stochastic Process Model has many applications in analysis of longitudinal\nbiodemographic data. Such data contain various physiological variables\n(sometimes known as covariates). It also can potentially contain genetic\ninformation available for all or a part of participants. Taking advantage from\nboth genetic and non-genetic information can provide future insights into a\nbroad range of processes describing aging-related changes in the organism. In\nthis paper, we implemented a multi-dimensional Genetic Stochastic Process Model\n(GenSPM) in newly developed software tool, R-package stpm, which allows\nresearchers performing such kind of analysis.",
    "authors": [
      "Ilya Zhbannikov",
      "Konstantin Arbeev",
      "Anatoliy Yashin"
    ],
    "publication_date": "2016-05-28T01:07:48Z",
    "arxiv_id": "http://arxiv.org/abs/1605.08827v1",
    "download_url": "http://arxiv.org/abs/1605.08827v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Advanced Phenotypic Mutations in Cartesian Genetic Programming",
    "abstract": "Cartesian Genetic Programming is often used with a point mutation as the sole\ngenetic operator. In this paper, we propose two phenotypic mutation techniques\nand take a step towards advanced phenotypic mutations in Cartesian Genetic\nProgramming. The functionality of the proposed mutations is inspired by\nbiological evolution which mutates DNA sequences by inserting and deleting\nnucleotides. Experiments with symbolic regression and boolean functions\nproblems show a better search performance when the proposed mutations are in\nuse. The results of our experiments indicate that the use of phenotypic\nmutations could be beneficial for the use of Cartesian Genetic Programming.",
    "authors": [
      "Roman Kalkreuth"
    ],
    "publication_date": "2018-03-16T09:43:47Z",
    "arxiv_id": "http://arxiv.org/abs/1803.06127v1",
    "download_url": "http://arxiv.org/abs/1803.06127v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Environmental Disorder Regulation of Invasion and Genetic Loss",
    "abstract": "Many physical and natural systems, including the population of species,\nevolve in habitats with spatial stochastic variations of the individuals'\nmotility. We study here the effect of those fluctuations on invasion and\ngenetic loss. A Langevin equation for the \\textit{position} and \\textit{border}\nof the invasion front is obtained. A striking result is that small/large\nfluctuations of diffusivity suppress/intensify genetic loss. Our findings\nreveal the potential role of environmental fluctuations as a regulating factor\nfor genetic loss and provide a simple explanation for the regional differences\nin the intensity of genetic drift observed during the final stages of human\nevolution and in tumor mutational landscapes.",
    "authors": [
      "Youness Azimzade",
      "Mahdi Sasar",
      "Víctor M. Pérez García"
    ],
    "publication_date": "2019-08-07T11:28:55Z",
    "arxiv_id": "http://arxiv.org/abs/1908.02532v1",
    "download_url": "http://arxiv.org/abs/1908.02532v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Liquid State Genetic Programming",
    "abstract": "A new Genetic Programming variant called Liquid State Genetic Programming\n(LSGP) is proposed in this paper. LSGP is a hybrid method combining a dynamic\nmemory for storing the inputs (the liquid) and a Genetic Programming technique\nused for the problem solving part. Several numerical experiments with LSGP are\nperformed by using several benchmarking problems. Numerical experiments show\nthat LSGP performs similarly and sometimes even better than standard Genetic\nProgramming for the considered test problems.",
    "authors": [
      "Mihai Oltean"
    ],
    "publication_date": "2023-12-05T17:09:21Z",
    "arxiv_id": "http://arxiv.org/abs/2312.14942v1",
    "download_url": "http://arxiv.org/abs/2312.14942v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An experimental test for genetic constraints in Drosophila melanogaster",
    "abstract": "In addition to natural selection, adaptive evolution requires genetic\nvariation to proceed. Yet the G-matrix may have limited 'genetic degrees of\nfreedom', with certain combinations of trait values unavailable to evolution.\nSuch limitations are often referred to as genetic constraints. Unfortunately,\nclear predictions about when to expect constraints are rarely available.\nTherefore, we developed an experimental system that provides specific\npredictions regarding constraints. Such tests are important as disagreements\npersist regarding the evidence for genetic constraints, possibly due to\ndifferences in methodology, study system or both. Numerous measures of genetic\nconstraints have been suggested, and generally focus on whether some axes of G\nhave eigenvalues=~0, indicating a lack of genetic variance.The mutation\nUltrabithorax1 causes a mild homeotic transformation of segmental identity. We\npredicted that this mutation would induce a genetic constraint due to this\nhomeosis. We measured genetic co-variation for a set of traits in a panel of\nstrains with and without Ubx1. As expected, Ubx1 induced homeotic\ntransformations, and altered patterns of allometry. Yet, no changes in\ncorrelational structure nor in the distribution of eigenvalues of G were\nobserved. We discuss the role of using genetic manipulations to refine\nhypotheses of constraints in natural systems.",
    "authors": [
      "Ian Dworkin",
      "David Tack",
      "Jarrod Hadfield"
    ],
    "publication_date": "2012-09-07T04:05:51Z",
    "arxiv_id": "http://arxiv.org/abs/1209.1445v2",
    "download_url": "http://arxiv.org/abs/1209.1445v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The evolution of genetic architectures underlying quantitative traits",
    "abstract": "In the classic view introduced by R. A. Fisher, a quantitative trait is\nencoded by many loci with small, additive effects. Recent advances in QTL\nmapping have begun to elucidate the genetic architectures underlying vast\nnumbers of phenotypes across diverse taxa, producing observations that\nsometimes contrast with Fisher's blueprint. Despite these considerable\nempirical efforts to map the genetic determinants of traits, it remains poorly\nunderstood how the genetic architecture of a trait should evolve, or how it\ndepends on the selection pressures on the trait. Here we develop a simple,\npopulation-genetic model for the evolution of genetic architectures. Our model\npredicts that traits under moderate selection should be encoded by many loci\nwith highly variable effects, whereas traits under either weak or strong\nselection should be encoded by relatively few loci. We compare these\ntheoretical predictions to qualitative trends in the genetics of human traits,\nand to systematic data on the genetics of gene expression levels in yeast. Our\nanalysis provides an evolutionary explanation for broad empirical patterns in\nthe genetic basis of traits, and it introduces a single framework that unifies\nthe diversity of observed genetic architectures, ranging from Mendelian to\nFisherian.",
    "authors": [
      "Etienne Rajon",
      "Joshua B. Plotkin"
    ],
    "publication_date": "2012-10-31T18:08:22Z",
    "arxiv_id": "http://arxiv.org/abs/1210.8423v2",
    "download_url": "http://arxiv.org/abs/1210.8423v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Causes and Consequences of genetic background effects illuminated by\n  integrative genomic analysis",
    "abstract": "The phenotypic consequences of individual mutations are modulated by the wild\ntype genetic background in which they occur.Although such background dependence\nis widely observed, we do not know whether general patterns across species and\ntraits exist, nor about the mechanisms underlying it. We also lack knowledge on\nhow mutations interact with genetic background to influence gene expression,\nand how this in turn mediates mutant phenotypes. Furthermore, how genetic\nbackground influences patterns of epistasis remains unclear. To investigate the\ngenetic basis and genomic consequences of genetic background dependence of the\nscallopedE3 allele on the Drosophila melanogaster wing, we generated multiple\nnovel genome level datasets from a mapping by introgression experiment and a\ntagged RNA gene expression dataset. In addition we used whole genome\nre-sequencing of the parental lines two commonly used laboratory strains to\npredict polymorphic transcription factor binding sites for SD. We integrated\nthese data with previously published genomic datasets from expression\nmicroarrays and a modifier mutation screen. By searching for genes showing a\ncongruent signal across multiple datasets, we were able to identify a robust\nset of candidate loci contributing to the background dependent effects of\nmutations in sd. We also show that the majority of background-dependent\nmodifiers previously reported are caused by higher-order epistasis, not\nquantitative non-complementation. These findings provide a useful foundation\nfor more detailed investigations of genetic background dependence in this\nsystem, and this approach is likely to prove useful in exploring the genetic\nbasis of other traits as well.",
    "authors": [
      "Christopher H. Chandler",
      "Sudarshan Chari",
      "David Tack",
      "Ian Dworkin"
    ],
    "publication_date": "2013-09-02T21:12:14Z",
    "arxiv_id": "http://arxiv.org/abs/1309.0547v3",
    "download_url": "http://arxiv.org/abs/1309.0547v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring the genetic patterns of complex diseases via the integrative\n  genome-wide approach",
    "abstract": "Motivation: Genome-wide association studies (GWASs), which assay more than a\nmillion single nucleotide polymorphisms (SNPs) in thousands of individuals,\nhave been widely used to identify genetic risk variants for complex diseases.\nHowever, most of the variants that have been identified contribute relatively\nsmall increments of risk and only explain a small portion of the genetic\nvariation in complex diseases. This is the so-called missing heritability\nproblem. Evidence has indicated that many complex diseases are genetically\nrelated, meaning these diseases share common genetic risk variants. Therefore,\nexploring the genetic correlations across multiple related studies could be a\npromising strategy for removing spurious associations and identifying\nunderlying genetic risk variants, and thereby uncovering the mystery of missing\nheritability in complex diseases. Results: We present a general and robust\nmethod to identify genetic patterns from multiple large-scale genomic datasets.\nWe treat the summary statistics as a matrix and demonstrate that genetic\npatterns will form a low-rank matrix plus a sparse component. Hence, we\nformulate the problem as a matrix recovering problem, where we aim to discover\nrisk variants shared by multiple diseases/traits and those for each individual\ndisease/trait. We propose a convex formulation for matrix recovery and an\nefficient algorithm to solve the problem. We demonstrate the advantages of our\nmethod using both synthesized datasets and real datasets. The experimental\nresults show that our method can successfully reconstruct both the shared and\nthe individual genetic patterns from summary statistics and achieve better\nperformance compared with alternative methods under a wide range of scenarios.",
    "authors": [
      "Ben Teng",
      "Can Yang",
      "Jiming Liu",
      "Zhipeng Cai",
      "Xiang Wan"
    ],
    "publication_date": "2015-01-26T13:59:23Z",
    "arxiv_id": "http://arxiv.org/abs/1501.06396v1",
    "download_url": "http://arxiv.org/abs/1501.06396v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Distinguishing correlation from causation using genome-wide association\n  studies",
    "abstract": "Genome-wide association studies (GWAS) have emerged as a rich source of\ngenetic clues into disease biology, and they have revealed strong genetic\ncorrelations among many diseases and traits. Some of these genetic correlations\nmay reflect causal relationships. We developed a method to quantify causal\nrelationships between genetically correlated traits using GWAS summary\nassociation statistics. In particular, our method quantifies what part of the\ngenetic component of trait 1 is also causal for trait 2 using mixed fourth\nmoments $E(\\alpha_1^2\\alpha_1\\alpha_2)$ and $E(\\alpha_2^2\\alpha_1\\alpha_2)$ of\nthe bivariate effect size distribution. If trait 1 is causal for trait 2, then\nSNPs affecting trait 1 (large $\\alpha_1^2$) will have correlated effects on\ntrait 2 (large $\\alpha_1\\alpha_2$), but not vice versa. We validated this\napproach in extensive simulations. Across 52 traits (average $N=331$k), we\nidentified 30 putative genetically causal relationships, many novel, including\nan effect of LDL cholesterol on decreased bone mineral density. More broadly,\nwe demonstrate that it is possible to distinguish between genetic correlation\nand causation using genetic association data.",
    "authors": [
      "Luke J. O'Connor",
      "Alkes L. Price"
    ],
    "publication_date": "2018-11-21T16:01:51Z",
    "arxiv_id": "http://arxiv.org/abs/1811.08803v1",
    "download_url": "http://arxiv.org/abs/1811.08803v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Construction and Functional Analysis of Human Genetic Interaction\n  Networks with Genome-wide Association Data",
    "abstract": "Genetic interaction measures how different genes collectively contribute to a\nphenotype, and can reveal functional compensation and buffering between\npathways under genetic perturbations. Recently, genome-wide screening for\ngenetic interactions has revealed genetic interaction networks that provide\nnovel insights either when analyzed by themselves or when integrated with other\nfunctional genomic datasets. For higher eukaryotes such as human, the above\nreverse-genetics approaches are not straightforward since the phenotypes of\ninterest for higher eukaryotes are difficult to study in a cell based assay. We\npropose a general framework for constructing and analyzing human genetic\ninteraction networks from genome-wide single nucleotide polymorphism (SNP) data\nused for case-control studies on complex diseases. Specifically, the approach\ncontains three major steps: (1) estimating SNP-SNP genetic interactions, (2)\nidentifying linkage disequilibrium (LD) blocks and mapping SNP-SNP interactions\nto block-block interactions, and (3) functional mapping for LD blocks. We\nperformed two sets of functional analyses for each of the six datasets used in\nthe paper, and demonstrated that (i) the constructed genetic interaction\nnetworks are supported by functional evidence from independent biological\ndatabases, and (ii) the network can be used to discover pairs of compensatory\ngene modules (between-pathway models) in their joint association with a disease\nphenotype. The proposed framework should provide novel insights beyond existing\napproaches that either ignore interactions between SNPs or model different\nSNP-SNP pairs with genetic interactions separately. Furthermore, our study\nprovides evidence that some of the core properties of genetic interaction\nnetworks based on reverse genetics in model organisms like yeast are also\npresent in genetic interactions revealed by natural variation in human\npopulations.",
    "authors": [
      "Gang Fang",
      "Wen Wang",
      "Vanja Paunic",
      "Benjamin Oately",
      "Majda Haznadar",
      "Michael Steinbach",
      "Brian Van Ness",
      "Chad L. Myers",
      "Vipin Kumar"
    ],
    "publication_date": "2011-01-17T22:10:09Z",
    "arxiv_id": "http://arxiv.org/abs/1101.3343v1",
    "download_url": "http://arxiv.org/abs/1101.3343v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Improved Neural Modeling of Real-World Systems Using Genetic Algorithm\n  Based Variable Selection",
    "abstract": "Neural network models of real-world systems, such as industrial processes,\nmade from sensor data must often rely on incomplete data. System states may not\nall be known, sensor data may be biased or noisy, and it is not often known\nwhich sensor data may be useful for predictive modelling. Genetic algorithms\nmay be used to help to address this problem by determining the near optimal\nsubset of sensor variables most appropriate to produce good models. This paper\ndescribes the use of genetic search to optimize variable selection to determine\ninputs into the neural network model. We discuss genetic algorithm\nimplementation issues including data representation types and genetic operators\nsuch as crossover and mutation. We present the use of this technique for neural\nnetwork modelling of a typical industrial application, a liquid fed ceramic\nmelter, and detail the results of the genetic search to optimize the neural\nnetwork model for this application.",
    "authors": [
      "Donald A. Sofge",
      "David L. Elliott"
    ],
    "publication_date": "2007-06-07T18:13:59Z",
    "arxiv_id": "http://arxiv.org/abs/0706.1051v1",
    "download_url": "http://arxiv.org/abs/0706.1051v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lower genetic diversity in the limpet Patella caerulea on urban coastal\n  structures compared to natural rocky habitats",
    "abstract": "Human-made structures are increasingly found in marine coastal habitats. The\naim of the present study was to explore whether urban coastal structures can\naffect the genetic variation of hard-bottom species. We conducted a population\ngenetic analysis on the limpet Patella caerulea sampled in both natural and\nartificial habitats along the Adriatic coast. Five microsatellite loci were\nused to test for differences in genetic diversity and structure among samples.\nThree microsatellite loci showed strong Hardy-Weinberg disequilibrium likely\nlinked with the presence of null alleles. Genetic diversity was significantly\nhigher in natural habitat than in artificial habitat. A weak but significant\ndifferentiation over all limpet samples was observed, but not related to the\ntype of habitat. While the exact causes of the differences in genetic diversity\ndeserve further investigation, these results clearly point that the expansion\nof urban structures can lead to genetic diversity loss at regional scales.",
    "authors": [
      "Cecile Fauvelot",
      "Francesca Bertozzi",
      "Federica Costantini",
      "Laura Airoldi",
      "Marco Abbiati"
    ],
    "publication_date": "2009-11-10T07:16:54Z",
    "arxiv_id": "http://arxiv.org/abs/0911.1843v1",
    "download_url": "http://arxiv.org/abs/0911.1843v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic diversity in introduced populations with Allee effect",
    "abstract": "A phenomenon that strongly influences the demography of small introduced\npopulations and thereby potentially their genetic diversity is the Allee\neffect, a reduction in population growth rates at small population sizes. We\ntake a stochastic modeling approach to investigate levels of genetic diversity\nin populations that successfully overcame a strong demographic Allee effect, a\nscenario in which populations smaller than a certain critical size are expected\nto decline. Our results indicate that compared to successful populations\nwithout Allee effect, successful Allee-effect populations tend to 1) derive\nfrom larger founder population sizes and thus have a higher initial amount of\ngenetic variation, 2) spend fewer generations at small population sizes where\ngenetic drift is particularly strong, and 3) spend more time around the\ncritical population size and thus experience more drift there. Altogether, the\nAllee effect can either increase or decrease genetic diversity, depending on\nthe average founder population size. In the case of multiple introduction\nevents, there is an additional increase in diversity because Allee-effect\npopulations tend to derive from a larger number of introduction events than\nother populations. Finally, we show that given genetic data from sufficiently\nmany populations, we can statistically infer the critical population size.",
    "authors": [
      "Meike J. Wittmann",
      "Wilfried Gabriel",
      "Dirk Metzler"
    ],
    "publication_date": "2013-11-18T17:36:02Z",
    "arxiv_id": "http://arxiv.org/abs/1311.4469v2",
    "download_url": "http://arxiv.org/abs/1311.4469v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic drift opposes mutualism during spatial population expansion",
    "abstract": "Mutualistic interactions benefit both partners, promoting coexistence and\ngenetic diversity. Spatial structure can promote cooperation, but spatial\nexpansions may also make it hard for mutualistic partners to stay together,\nsince genetic drift at the expansion front creates regions of low genetic and\nspecies diversity. To explore the antagonism between mutualism and genetic\ndrift, we grew cross-feeding strains of the budding yeast S. cerevisiae on agar\nsurfaces as a model for mutualists undergoing spatial expansions. By supplying\nvarying amounts of the exchanged nutrients, we tuned strength and symmetry of\nthe mutualistic interaction. Strong mutualism suppresses genetic demixing\nduring spatial expansions and thereby maintains diversity, but weak or\nasymmetric mutualism is overwhelmed by genetic drift even when mutualism is\nstill beneficial, slowing growth and reducing diversity. Theoretical modeling\nusing experimentally measured parameters predicts the size of demixed regions\nand how strong mutualism must be to survive a spatial expansion.",
    "authors": [
      "Melanie JI Muller",
      "Beverly I Neugeboren",
      "David R Nelson",
      "Andrew W Murray"
    ],
    "publication_date": "2014-02-24T21:15:27Z",
    "arxiv_id": "http://arxiv.org/abs/1402.5984v1",
    "download_url": "http://arxiv.org/abs/1402.5984v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bayesian Neural Networks for Genetic Association Studies of Complex\n  Disease",
    "abstract": "Discovering causal genetic variants from large genetic association studies\nposes many difficult challenges. Assessing which genetic markers are involved\nin determining trait status is a computationally demanding task, especially in\nthe presence of gene-gene interactions. A non-parametric Bayesian approach in\nthe form of a Bayesian neural network is proposed for use in analyzing genetic\nassociation studies. Demonstrations on synthetic and real data reveal they are\nable to efficiently and accurately determine which variants are involved in\ndetermining case-control status. Using graphics processing units (GPUs) the\ntime needed to build these models is decreased by several orders of magnitude.\nIn comparison with commonly used approaches for detecting genetic interactions,\nBayesian neural networks perform very well across a broad spectrum of possible\ngenetic relationships while having the computational efficiency needed to\nhandle large datasets.",
    "authors": [
      "Andrew L. Beam",
      "Alison Motsinger-Reif",
      "Jon Doyle"
    ],
    "publication_date": "2014-04-15T17:11:53Z",
    "arxiv_id": "http://arxiv.org/abs/1404.3989v2",
    "download_url": "http://arxiv.org/abs/1404.3989v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A nonparametric HMM for genetic imputation and coalescent inference",
    "abstract": "Genetic sequence data are well described by hidden Markov models (HMMs) in\nwhich latent states correspond to clusters of similar mutation patterns. Theory\nfrom statistical genetics suggests that these HMMs are nonhomogeneous (their\ntransition probabilities vary along the chromosome) and have large support for\nself transitions. We develop a new nonparametric model of genetic sequence\ndata, based on the hierarchical Dirichlet process, which supports these self\ntransitions and nonhomogeneity. Our model provides a parameterization of the\ngenetic process that is more parsimonious than other more general nonparametric\nmodels which have previously been applied to population genetics. We provide\ntruncation-free MCMC inference for our model using a new auxiliary sampling\nscheme for Bayesian nonparametric HMMs. In a series of experiments on male X\nchromosome data from the Thousand Genomes Project and also on data simulated\nfrom a population bottleneck we show the benefits of our model over the popular\nfinite model fastPHASE, which can itself be seen as a parametric truncation of\nour model. We find that the number of HMM states found by our model is\ncorrelated with the time to the most recent common ancestor in population\nbottlenecks. This work demonstrates the flexibility of Bayesian nonparametrics\napplied to large and complex genetic data.",
    "authors": [
      "Lloyd T. Elliott",
      "Yee Whye Teh"
    ],
    "publication_date": "2016-11-02T10:48:04Z",
    "arxiv_id": "http://arxiv.org/abs/1611.00544v1",
    "download_url": "http://arxiv.org/abs/1611.00544v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Privacy-Preserving Genetic Relatedness Test",
    "abstract": "An increasing number of individuals are turning to Direct-To-Consumer (DTC)\ngenetic testing to learn about their predisposition to diseases, traits, and/or\nancestry. DTC companies like 23andme and Ancestry.com have started to offer\npopular and affordable ancestry and genealogy tests, with services allowing\nusers to find unknown relatives and long-distant cousins. Naturally, access and\npossible dissemination of genetic data prompts serious privacy concerns, thus\nmotivating the need to design efficient primitives supporting private genetic\ntests. In this paper, we present an effective protocol for privacy-preserving\ngenetic relatedness test (PPGRT), enabling a cloud server to run relatedness\ntests on input an encrypted genetic database and a test facility's encrypted\ngenetic sample. We reduce the test to a data matching problem and perform it,\nprivately, using searchable encryption. Finally, a performance evaluation of\nhamming distance based PP-GRT attests to the practicality of our proposals.",
    "authors": [
      "Emiliano De Cristofaro",
      "Kaitai Liang",
      "Yuruo Zhang"
    ],
    "publication_date": "2016-11-09T16:37:28Z",
    "arxiv_id": "http://arxiv.org/abs/1611.03006v2",
    "download_url": "http://arxiv.org/abs/1611.03006v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A simulations approach for meta-analysis of genetic association studies\n  based on additive genetic model",
    "abstract": "Genetic association studies are becoming an important component of medical\nresearch. To cite one instance, pharmacogenomics which is gaining prominence as\na useful tool for personalized medicine is heavily reliant on results from\ngenetic association studies. Meta-analysis of genetic association studies is\nbeing increasingly used to assess phenotypic differences between genotype\ngroups. When the underlying genetic model is assumed to be dominant or\nrecessive, assessing the phenotype differences based on summary statistics,\nreported for individual studies in a meta-analysis, is a valid strategy.\nHowever, when the genetic model is additive, a similar strategy based on\nsummary statistics will lead to biased results. This fact about the additive\nmodel is one of the things that we establish in this paper, using simulations.\nThe main goal of this paper is to present an alternate strategy for the\nadditive model based on simulating data for the individual studies. We show\nthat the alternate strategy is far superior to the strategy based on summary\nstatistics.",
    "authors": [
      "Majnu John",
      "Todd Lencz",
      "Anil K Malhotra",
      "Christoph U Correll",
      "Jian-Ping Zhang"
    ],
    "publication_date": "2016-12-29T16:33:46Z",
    "arxiv_id": "http://arxiv.org/abs/1612.09195v1",
    "download_url": "http://arxiv.org/abs/1612.09195v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Network organization of coopetitive genetic influences on cortical\n  morphologies",
    "abstract": "Brain can be represented as a network, where regions are the nodes and\nrelations between the regions are edges. Within a network, co-existence of\ncooperative and competitive relationships between different nodes is called\ncoopetition. Inter-regional genetic influences on morphological phenotypes\n(cortical thickness, surface area) of cortex display such coopetitive\nrelationships. Here, we have represented these genetic influences as a network\nand shown that cooperative and competitive genetic influences on cortical\nmorphological phenotypes follow distinct organization principles. Utilizing the\ntheory of structural balance, we have shown that the pattern of collective\nregulation of cortical morphological phenotypes by cooperative and competitive\ngenetic influences are overall bilaterally symmetric and such patterns of\ncollective genetic regulation are similar to the principal modes of population\nvariation of cortical morphological phenotypes. Finally, we have observed that\nthe maximally and minimally imbalanced regions corresponding to the collective\ngenetic regulation partially overlap with the cortical structural network hubs.",
    "authors": [
      "Subhadip Paul",
      "Satyam Mukherjee",
      "Sagnik Bhattacharyya"
    ],
    "publication_date": "2018-02-09T17:38:57Z",
    "arxiv_id": "http://arxiv.org/abs/1802.03397v1",
    "download_url": "http://arxiv.org/abs/1802.03397v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Kernel-Based Neural Network for High-dimensional Genetic Risk\n  Prediction Analysis",
    "abstract": "Risk prediction capitalizing on emerging human genome findings holds great\npromise for new prediction and prevention strategies. While the large amounts\nof genetic data generated from high-throughput technologies offer us a unique\nopportunity to study a deep catalog of genetic variants for risk prediction,\nthe high-dimensionality of genetic data and complex relationships between\ngenetic variants and disease outcomes bring tremendous challenges to risk\nprediction analysis. To address these rising challenges, we propose a\nkernel-based neural network (KNN) method. KNN inherits features from both\nlinear mixed models (LMM) and classical neural networks and is designed for\nhigh-dimensional risk prediction analysis. To deal with datasets with millions\nof variants, KNN summarizes genetic data into kernel matrices and use the\nkernel matrices as inputs. Based on the kernel matrices, KNN builds a\nsingle-layer feedforward neural network, which makes it feasible to consider\ncomplex relationships between genetic variants and disease outcomes. The\nparameter estimation in KNN is based on MINQUE and we show, that under certain\nconditions, the average prediction error of KNN can be smaller than that of\nLMM. Simulation studies also confirm the results.",
    "authors": [
      "Xiaoxi Shen",
      "Xiaoran Tong",
      "Qing Lu"
    ],
    "publication_date": "2021-01-28T03:58:38Z",
    "arxiv_id": "http://arxiv.org/abs/2101.11807v1",
    "download_url": "http://arxiv.org/abs/2101.11807v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Human genetic admixture through the lens of population genomics",
    "abstract": "Over the last fifty years, geneticists have made great strides in\nunderstanding how our species' evolutionary history gave rise to current\npatterns of human genetic diversity classically summarized by Lewontin in his\n1972 paper, 'The Apportionment of Human Diversity'. One evolutionary process\nthat requires special attention in both population genetics and statistical\ngenetics is admixture: gene flow between two or more previously separated\nsource populations to form a new admixed population. The admixture process\nintroduces unique patterns of genetic variation within and between populations,\nwhich in turn influences the inference of demographic histories, identification\ngenetic targets of selection, and prediction of phenotypes. In this review, we\nhighlight recent studies and methodological advances that have leveraged\ngenomic signatures of admixture to gain insights into human history, natural\nselection, and complex trait architecture. We also outline some challenges for\nadmixture population genetics, including limitations of applying methods\ndesigned for single-ancestry populations to the study of admixed populations.",
    "authors": [
      "Shyamalika Gopalan",
      "Samuel Patillo Smith",
      "Katharine Korunes",
      "Iman Hamid",
      "Sohini Ramachandran",
      "Amy Goldberg"
    ],
    "publication_date": "2021-09-24T20:56:46Z",
    "arxiv_id": "http://arxiv.org/abs/2109.12190v2",
    "download_url": "http://arxiv.org/abs/2109.12190v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Systematic Testing of Genetic Algorithms: A Metamorphic Testing based\n  Approach",
    "abstract": "Genetic Algorithms are a popular set of optimization algorithms often used to\naid software testing. However, no work has been done to apply systematic\nsoftware testing techniques to genetic algorithms because of the stochasticity\nand the lack of known outputs for genetic algorithms. Statistical metamorphic\ntesting is a useful technique for testing programs when the output is unknown\nor when the program has random elements. In this paper, we identify 17\nmetamorphic relations for testing a genetic algorithm and show, through\nmutation testing, that these relations are more effective at finding defects\nthan traditional unit tests based on known outputs. We examined the failure\nrates of the system-level relations when initialized with various fitness\nfunctions. We found three relations failed excessively and we then modified\nthese relations so that they failed less often. We also identified some\nmetamorphic relations for genetic algorithms that are generalizable across\ndifferent types of evolutionary algorithms and showed that our relations had\nsimilar mutation scores between two implementations. This is the first time\nstatistical metamorphic testing has been applied for testing genetic\nalgorithms.",
    "authors": [
      "Janette Rounds",
      "Upulee Kanewala"
    ],
    "publication_date": "2018-08-02T22:01:14Z",
    "arxiv_id": "http://arxiv.org/abs/1808.01033v1",
    "download_url": "http://arxiv.org/abs/1808.01033v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Code Building Genetic Programming",
    "abstract": "In recent years the field of genetic programming has made significant\nadvances towards automatic programming. Research and development of\ncontemporary program synthesis methods, such as PushGP and Grammar Guided\nGenetic Programming, can produce programs that solve problems typically\nassigned in introductory academic settings. These problems focus on a narrow,\npredetermined set of simple data structures, basic control flow patterns, and\nprimitive, non-overlapping data types (without, for example, inheritance or\ncomposite types). Few, if any, genetic programming methods for program\nsynthesis have convincingly demonstrated the capability of synthesizing\nprograms that use arbitrary data types, data structures, and specifications\nthat are drawn from existing codebases. In this paper, we introduce Code\nBuilding Genetic Programming (CBGP) as a framework within which this can be\ndone, by leveraging programming language features such as reflection and\nfirst-class specifications. CBGP produces a computational graph that can be\nexecuted or translated into source code of a host language. To demonstrate the\nnovel capabilities of CBGP, we present results on new benchmarks that use\nnon-primitive, polymorphic data types as well as some standard program\nsynthesis benchmarks.",
    "authors": [
      "Edward Pantridge",
      "Lee Spector"
    ],
    "publication_date": "2020-08-09T04:33:04Z",
    "arxiv_id": "http://arxiv.org/abs/2008.03649v1",
    "download_url": "http://arxiv.org/abs/2008.03649v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Choose Your Programming Copilot: A Comparison of the Program Synthesis\n  Performance of GitHub Copilot and Genetic Programming",
    "abstract": "GitHub Copilot, an extension for the Visual Studio Code development\nenvironment powered by the large-scale language model Codex, makes automatic\nprogram synthesis available for software developers. This model has been\nextensively studied in the field of deep learning, however, a comparison to\ngenetic programming, which is also known for its performance in automatic\nprogram synthesis, has not yet been carried out. In this paper, we evaluate\nGitHub Copilot on standard program synthesis benchmark problems and compare the\nachieved results with those from the genetic programming literature. In\naddition, we discuss the performance of both approaches. We find that the\nperformance of the two approaches on the benchmark problems is quite similar,\nhowever, in comparison to GitHub Copilot, the program synthesis approaches\nbased on genetic programming are not yet mature enough to support programmers\nin practical software development. Genetic programming usually needs a huge\namount of expensive hand-labeled training cases and takes too much time to\ngenerate solutions. Furthermore, source code generated by genetic programming\napproaches is often bloated and difficult to understand. For future work on\nprogram synthesis with genetic programming, we suggest researchers to focus on\nimproving the execution time, readability, and usability.",
    "authors": [
      "Dominik Sobania",
      "Martin Briesch",
      "Franz Rothlauf"
    ],
    "publication_date": "2021-11-15T16:30:12Z",
    "arxiv_id": "http://arxiv.org/abs/2111.07875v1",
    "download_url": "http://arxiv.org/abs/2111.07875v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A molecular generative model with genetic algorithm and tree search for\n  cancer samples",
    "abstract": "Personalized medicine is expected to maximize the intended drug effects and\nminimize side effects by treating patients based on their genetic profiles.\nThus, it is important to generate drugs based on the genetic profiles of\ndiseases, especially in anticancer drug discovery. However, this is challenging\nbecause the vast chemical space and variations in cancer properties require a\nhuge time resource to search for proper molecules. Therefore, an efficient and\nfast search method considering genetic profiles is required for de novo\nmolecular design of anticancer drugs. Here, we propose a faster molecular\ngenerative model with genetic algorithm and tree search for cancer samples\n(FasterGTS). FasterGTS is constructed with a genetic algorithm and a Monte\nCarlo tree search with three deep neural networks: supervised learning,\nself-trained, and value networks, and it generates anticancer molecules based\non the genetic profiles of a cancer sample. When compared to other methods,\nFasterGTS generated cancer sample-specific molecules with general chemical\nproperties required for cancer drugs within the limited numbers of samplings.\nWe expect that FasterGTS contributes to the anticancer drug generation.",
    "authors": [
      "Sejin Park",
      "Hyunju Lee"
    ],
    "publication_date": "2021-12-16T15:22:28Z",
    "arxiv_id": "http://arxiv.org/abs/2112.08959v1",
    "download_url": "http://arxiv.org/abs/2112.08959v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Statistical Inference for Genetic Relatedness Based on High-Dimensional\n  Logistic Regression",
    "abstract": "This paper studies the problem of statistical inference for genetic\nrelatedness between binary traits based on individual-level genome-wide\nassociation data. Specifically, under the high-dimensional logistic regression\nmodels, we define parameters characterizing the cross-trait genetic\ncorrelation, the genetic covariance and the trait-specific genetic variance. A\nnovel weighted debiasing method is developed for the logistic Lasso estimator\nand computationally efficient debiased estimators are proposed. The rates of\nconvergence for these estimators are studied and their asymptotic normality is\nestablished under mild conditions. Moreover, we construct confidence intervals\nand statistical tests for these parameters, and provide theoretical\njustifications for the methods, including the coverage probability and expected\nlength of the confidence intervals, as well as the size and power of the\nproposed tests. Numerical studies are conducted under both model generated data\nand simulated genetic data to show the superiority of the proposed methods. By\nanalyzing a real data set on autoimmune diseases, we demonstrate its ability to\nobtain novel insights about the shared genetic architecture between ten\npediatric autoimmune diseases.",
    "authors": [
      "Rong Ma",
      "Zijian Guo",
      "T. Tony Cai",
      "Hongzhe Li"
    ],
    "publication_date": "2022-02-21T06:08:39Z",
    "arxiv_id": "http://arxiv.org/abs/2202.10007v2",
    "download_url": "http://arxiv.org/abs/2202.10007v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Discovering Attention-Based Genetic Algorithms via Meta-Black-Box\n  Optimization",
    "abstract": "Genetic algorithms constitute a family of black-box optimization algorithms,\nwhich take inspiration from the principles of biological evolution. While they\nprovide a general-purpose tool for optimization, their particular\ninstantiations can be heuristic and motivated by loose biological intuition. In\nthis work we explore a fundamentally different approach: Given a sufficiently\nflexible parametrization of the genetic operators, we discover entirely new\ngenetic algorithms in a data-driven fashion. More specifically, we parametrize\nselection and mutation rate adaptation as cross- and self-attention modules and\nuse Meta-Black-Box-Optimization to evolve their parameters on a set of diverse\noptimization tasks. The resulting Learned Genetic Algorithm outperforms\nstate-of-the-art adaptive baseline genetic algorithms and generalizes far\nbeyond its meta-training settings. The learned algorithm can be applied to\npreviously unseen optimization problems, search dimensions & evaluation\nbudgets. We conduct extensive analysis of the discovered operators and provide\nablation experiments, which highlight the benefits of flexible module\nparametrization and the ability to transfer (`plug-in') the learned operators\nto conventional genetic algorithms.",
    "authors": [
      "Robert Tjarko Lange",
      "Tom Schaul",
      "Yutian Chen",
      "Chris Lu",
      "Tom Zahavy",
      "Valentin Dalibard",
      "Sebastian Flennerhag"
    ],
    "publication_date": "2023-04-08T12:14:15Z",
    "arxiv_id": "http://arxiv.org/abs/2304.03995v1",
    "download_url": "http://arxiv.org/abs/2304.03995v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Artificial Life Simulation Library Based on Genetic Algorithm,\n  3-Character Genetic Code and Biological Hierarchy",
    "abstract": "Genetic algorithm (GA) is inspired by biological evolution of genetic\norganisms by optimizing the genotypic combinations encoded within each\nindividual with the help of evolutionary operators, suggesting that GA may be a\nsuitable model for studying real-life evolutionary processes. This paper\ndescribes the design of a Python library for artificial life simulation,\nDigital Organism Simulation Environment (DOSE), based on GA and biological\nhierarchy starting from genetic sequence to population. A 3-character\ninstruction set that does not take any operand is introduced as genetic code\nfor digital organism. This mimics the 3-nucleotide codon structure in naturally\noccurring DNA. In addition, the context of a 3-dimensional world composing of\necological cells is introduced to simulate a physical ecosystem. Using DOSE, an\nexperiment to examine the changes in genetic sequences with respect to mutation\nrates is presented.",
    "authors": [
      "Maurice HT Ling"
    ],
    "publication_date": "2023-02-19T03:37:03Z",
    "arxiv_id": "http://arxiv.org/abs/2304.13520v1",
    "download_url": "http://arxiv.org/abs/2304.13520v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A genome-scale deep learning model to predict gene expression changes of\n  genetic perturbations from multiplex biological networks",
    "abstract": "Systematic characterization of biological effects to genetic perturbation is\nessential to the application of molecular biology and biomedicine. However, the\nexperimental exhaustion of genetic perturbations on the genome-wide scale is\nchallenging. Here, we show that TranscriptionNet, a deep learning model that\nintegrates multiple biological networks to systematically predict\ntranscriptional profiles to three types of genetic perturbations based on\ntranscriptional profiles induced by genetic perturbations in the L1000 project:\nRNA interference (RNAi), clustered regularly interspaced short palindromic\nrepeat (CRISPR) and overexpression (OE). TranscriptionNet performs better than\nexisting approaches in predicting inducible gene expression changes for all\nthree types of genetic perturbations. TranscriptionNet can predict\ntranscriptional profiles for all genes in existing biological networks and\nincreases perturbational gene expression changes for each type of genetic\nperturbation from a few thousand to 26,945 genes. TranscriptionNet demonstrates\nstrong generalization ability when comparing predicted and true gene expression\nchanges on different external tasks. Overall, TranscriptionNet can systemically\npredict transcriptional consequences induced by perturbing genes on a\ngenome-wide scale and thus holds promise to systemically detect gene function\nand enhance drug development and target discovery.",
    "authors": [
      "Lingmin Zhan",
      "Yuanyuan Zhang",
      "Yingdong Wang",
      "Aoyi Wang",
      "Caiping Cheng",
      "Jinzhong Zhao",
      "Wuxia Zhang",
      "Peng Lia",
      "Jianxin Chen"
    ],
    "publication_date": "2024-03-05T07:31:46Z",
    "arxiv_id": "http://arxiv.org/abs/2403.02724v1",
    "download_url": "http://arxiv.org/abs/2403.02724v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Retrospective score tests versus prospective score tests for genetic\n  association with case-control data",
    "abstract": "Since the seminal work by Prentice and Pyke (1979), the prospective logistic\nlikelihood has become the standard method of analysis for retrospectively\ncollected case-control data, in particular for testing the association between\na single genetic marker and a disease outcome in genetic case-control studies.\nWhen studying multiple genetic markers with relatively small effects,\nespecially those with rare variants, various aggregated approaches based on the\nsame prospective likelihood have been developed to integrate subtle association\nevidence among all considered markers. In this paper we show that using the\nscore statistic derived from a prospective likelihood is not optimal in the\nanalysis of retrospectively sampled genetic data. We develop the locally most\npowerful genetic aggregation test derived through the retrospective likelihood\nunder a random effect model assumption. In contrast to the fact that the\ndisease prevalence information cannot be used to improve the efficiency for the\nestimation of odds ratio parameters in logistic regression models, we show that\nit can be utilized to enhance the testing power in genetic association studies.\nExtensive simulations demonstrate the advantages of the proposed method over\nthe existing ones. One real genome-wide association study is analyzed for\nillustration.",
    "authors": [
      "Yukun Liu",
      "Pengfei Li",
      "Lei Song",
      "Kai Yu",
      "Jing Qin"
    ],
    "publication_date": "2025-07-26T09:43:22Z",
    "arxiv_id": "http://arxiv.org/abs/2507.19893v1",
    "download_url": "http://arxiv.org/abs/2507.19893v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A U-Statistic-based random forest approach for genetic interaction study",
    "abstract": "Variations in complex traits are influenced by multiple genetic variants,\nenvironmental risk factors, and their interactions. Though substantial progress\nhas been made in identifying single genetic variants associated with complex\ntraits, detecting the gene-gene and gene-environment interactions remains a\ngreat challenge. When a large number of genetic variants and environmental risk\nfactors are involved, searching for interactions is limited to pair-wise\ninteractions due to the exponentially increased feature space and computational\nintensity. Alternatively, recursive partitioning approaches, such as random\nforests, have gained popularity in high-dimensional genetic association\nstudies. In this article, we propose a U-Statistic-based random forest\napproach, referred to as Forest U-Test, for genetic association studies with\nquantitative traits. Through simulation studies, we showed that the Forest\nU-Test outperformed existing methods. The proposed method was also applied to\nstudy Cannabis Dependence CD, using three independent datasets from the Study\nof Addiction: Genetics and Environment. A significant joint association was\ndetected with an empirical p-value less than 0.001. The finding was also\nreplicated in two independent datasets with p-values of 5.93e-19 and 4.70e-17,\nrespectively.",
    "authors": [
      "Ming Li",
      "Ruo-Sin Peng",
      "Changshuai Wei",
      "Qing Lu"
    ],
    "publication_date": "2025-08-19T06:22:20Z",
    "arxiv_id": "http://arxiv.org/abs/2508.14924v1",
    "download_url": "http://arxiv.org/abs/2508.14924v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comprehensively stratifying MCIs into distinct risk subtypes based on\n  brain imaging genetics fusion learning",
    "abstract": "Mild cognitive impairment (MCI) is the prodromal stage of Alzheimer's disease\n(AD) and thus enrolling MCI subjects to undergo clinical trials is worthwhile.\nHowever, MCI groups usually show significant diversity and heterogeneity in the\npathology and symptom, which pose great challenge to accurately select\nappropriate subjects. This study aimed to stratify MCI subjects into distinct\nsubgroups with substantial difference in the risk of transitioning to AD by\nfusing multimodal brain imaging genetic data. The integrated imaging genetics\nmethod comprised three modules, i.e., the whole-genome-oriented risk genetic\ninformation extraction module (RGE), the genetic-to-brain mapping module\n(RG2PG), and the genetic-guided pseudo-brain fusion module (CMPF). We used data\nfrom AD Neuroimaging Initiative (ADNI) and identified two MCI subtypes, called\nlow-risk MCI (lsMCI) and high-risk MCI (hsMCI). We also validated that the two\nsubgroups showed distinct patterns of in terms of multiple biomarkers including\ngenetics, demographics, fluid biomarkers, brain imaging features, clinical\nsymptoms and cognitive functioning at baseline, as well as their longitudinal\ndevelopmental trajectories. Furthermore, we also identified potential\nbiomarkers that may implicate the risk of MCIs, providing critical insights for\npatient stratification at early stage.",
    "authors": [
      "Muheng Shang",
      "Jin Zhang",
      "Junwei Han",
      "Lei Du"
    ],
    "publication_date": "2025-08-25T14:18:43Z",
    "arxiv_id": "http://arxiv.org/abs/2508.18058v1",
    "download_url": "http://arxiv.org/abs/2508.18058v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unifying Theories of Molecular, Community and Network Evolution",
    "abstract": "The origin of diversification and coexistence of genes and species have been\ntraditionally studied in isolated biological levels. Ecological and\nevolutionary views have focused on the mechanisms that enable or constrain\nspecies coexistence, genetic variation and the genetics of speciation, but a\nunified theory linking those approaches is still missing. Here we introduce\nevolutionary graphs in the context of neutral theories of molecular evolution\nand biodiversity to provide a framework that simultaneously addresses\nspeciation rate and joint genetic and species diversities. To illuminate this\nquestion we also study two models of evolution on graphs with fitness\ndifferences, which provide insights on how genetic and ecological dynamics\ndrive the speed of diversification. Neutral evolution generates the highest\nspeed of speciation, species richness (i.e. five times and twice as many\nspecies as compared to genetic and ecological graphs, respectively) and\ngenetic--species diversity (i.e., twice as many as genetic and ecological\ngraphs, respectively). Thus the speed of speciation, the genetic--species\ndiversity and coexistence can differ dramatically depending on whether genetic\nfactors versus ecological factors drive the evolution of the system. By linking\nmolecular, sexual and trophic behavior at ecological and evolutionary scales,\ninteracting graphs can illuminate the origin and evolution of diversity and\norganismal coexistence.",
    "authors": [
      "Carlos J. Melian",
      "David Alonso",
      "Diego P. Vazquez",
      "James Regetz"
    ],
    "publication_date": "2008-07-16T22:34:56Z",
    "arxiv_id": "http://arxiv.org/abs/0807.2665v1",
    "download_url": "http://arxiv.org/abs/0807.2665v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The genetic code, 8-dimensional hypercomplex numbers and dyadic shifts",
    "abstract": "Matrix forms of the representation of the multi-level system of\nmolecular-genetic alphabets have revealed algebraic properties of this system.\nFamilies of genetic (4*4)- and (8*8)-matrices show unexpected connections of\nthe genetic system with Walsh functions and Hadamard matrices, which are known\nin theory of noise-immunity coding, digital communication and digital\nholography. Dyadic-shift decompositions of such genetic matrices lead to sets\nof sparse matrices. Each of these sets is closed in relation to multiplication\nand defines relevant algebra of hypercomplex numbers. It is shown that genetic\nHadamard matrices are identical to matrix representations of Hamilton\nquaternions and its complexification in the case of unit coordinates. The\ndiversity of known dialects of the genetic code is analyzed from the viewpoint\nof the genetic algebras. An algebraic analogy with Punnett squares for\ninherited traits is shown. Our results are used in analyzing genetic phenomena.\nThe statement about existence of the geno-logic code in DNA and epigenetics on\nthe base of the spectral logic of systems of Boolean functions is put forward.\nOur results show promising ways to develop algebraic-logical biology, in\nparticular, in connection with the logic holography on Walsh functions.",
    "authors": [
      "Sergey V. Petoukhov"
    ],
    "publication_date": "2011-02-17T14:57:30Z",
    "arxiv_id": "http://arxiv.org/abs/1102.3596v11",
    "download_url": "http://arxiv.org/abs/1102.3596v11",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Robust Methods for Disease-Genotype Association in Genetic Association\n  Studies: Calculate P-values Using Exact Conditional Enumeration instead of\n  Asymptotic Approximations",
    "abstract": "In genetic association studies, detecting disease-genotype associations is a\nprimary goal. For most diseases, the underlying genetic model is unknown, and\nwe study seven robust test statistics for monotone association. For a given\ntest statistic, there are many ways to calculate a p-value, but in genetic\nassociation studies, calculations have predominantly been based on asymptotic\napproximations or on simulated permutations. We show that when the number of\npermutations tends to infinity, the permutation p-value approaches the exact\nconditional enumeration p-value, and further that calculating the latter\np-value is much more efficient than performing simulated permutations. We then\nanswer two research questions. (i) Which of the test statistics under study are\nthe most powerful for monotone genetic models? (ii) Based on test size, power,\nand computational considerations, should asymptotic approximations or exact\nconditional enumeration be used for calculating p-values? We have studied\ncase-control sample sizes with 500-5000 cases and 500-15000 controls, and\nsignificance levels from 5e-8 to 0.05, thus our results are applicable to\ngenetic association studies with only one genetic marker under study,\nintermediate follow-up studies, and genome wide association studies. We find\nthat if all monotone genetic models are of interest, the best performance is\nachieved for a test statistics based on the maximum over a range of\nCochrane-Armitage trend tests with different scores and for a constrained\nlikelihood ratio test. For significance levels below 0.05, asymptotic\napproximations may give a test size up to 20 times the nominal level, and\nshould therefore be used with caution. Further, calculating p-values based on\nexact conditional enumeration is a powerful, valid and computationally feasible\napproach, and we advocate its use in genetic association studies.",
    "authors": [
      "Mette Langaas",
      "Øyvind Bakke"
    ],
    "publication_date": "2013-07-29T10:58:54Z",
    "arxiv_id": "http://arxiv.org/abs/1307.7536v1",
    "download_url": "http://arxiv.org/abs/1307.7536v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Detection boundary and Higher Criticism approach for rare and weak\n  genetic effects",
    "abstract": "Genome-wide association studies (GWAS) have identified many genetic factors\nunderlying complex human traits. However, these factors have explained only a\nsmall fraction of these traits' genetic heritability. It is argued that many\nmore genetic factors remain undiscovered. These genetic factors likely are\nweakly associated at the population level and sparsely distributed across the\ngenome. In this paper, we adapt the recent innovations on Tukey's Higher\nCriticism (Tukey [The Higher Criticism (1976) Princeton Univ.]; Donoho and Jin\n[Ann. Statist. 32 (2004) 962-994]) to SNP-set analysis of GWAS, and develop a\nnew theoretical framework in large-scale inference to assess the joint\nsignificance of such rare and weak effects for a quantitative trait. In the\ncore of our theory is the so-called detection boundary, a curve in the\ntwo-dimensional phase space that quantifies the rarity and strength of genetic\neffects. Above the detection boundary, the overall effects of genetic factors\nare strong enough for reliable detection. Below the detection boundary, the\ngenetic factors are simply too rare and too weak for reliable detection. We\nshow that the HC-type methods are optimal in that they reliably yield detection\nonce the parameters of the genetic effects fall above the detection boundary\nand that many commonly used SNP-set methods are suboptimal. The superior\nperformance of the HC-type approach is demonstrated through simulations and the\nanalysis of a GWAS data set of Crohn's disease.",
    "authors": [
      "Zheyang Wu",
      "Yiming Sun",
      "Shiquan He",
      "Judy Cho",
      "Hongyu Zhao",
      "Jiashun Jin"
    ],
    "publication_date": "2014-07-31T12:37:42Z",
    "arxiv_id": "http://arxiv.org/abs/1407.8382v1",
    "download_url": "http://arxiv.org/abs/1407.8382v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A weighted U statistic for association analysis considering genetic\n  heterogeneity",
    "abstract": "Converging evidence suggests that common complex diseases with the same or\nsimilar clinical manifestations could have different underlying genetic\netiologies. While current research interests have shifted toward uncovering\nrare variants and structural variations predisposing to human diseases, the\nimpact of heterogeneity in genetic studies of complex diseases has been largely\noverlooked. Most of the existing statistical methods assume the disease under\ninvestigation has a homogeneous genetic effect and could, therefore, have low\npower if the disease undergoes heterogeneous pathophysiological and etiological\nprocesses. In this paper, we propose a heterogeneity weighted U (HWU) method\nfor association analyses considering genetic heterogeneity. HWU can be applied\nto various types of phenotypes (e.g., binary and continuous) and is\ncomputationally effcient for high- dimensional genetic data. Through\nsimulations, we showed the advantage of HWU when the underlying genetic\netiology of a disease was heterogeneous, as well as the robustness of HWU\nagainst different model assumptions (e.g., phenotype distributions). Using HWU,\nwe conducted a genome-wide analysis of nicotine dependence from the Study of\nAddiction: Genetics and Environments (SAGE) dataset. The genome-wide analysis\nof nearly one million genetic markers took 7 hours, identifying heterogeneous\neffects of two new genes (i.e., CYP3A5 and IKBKB) on nicotine dependence.",
    "authors": [
      "Changshuai Wei",
      "Robert C. Elston",
      "Qing Lu"
    ],
    "publication_date": "2015-04-30T17:54:31Z",
    "arxiv_id": "http://arxiv.org/abs/1504.08319v2",
    "download_url": "http://arxiv.org/abs/1504.08319v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Understanding Genetic Drift to a Smart-Restart Parameter-less\n  Compact Genetic Algorithm",
    "abstract": "One of the key difficulties in using estimation-of-distribution algorithms is\nchoosing the population size(s) appropriately: Too small values lead to genetic\ndrift, which can cause enormous difficulties. In the regime with no genetic\ndrift, however, often the runtime is roughly proportional to the population\nsize, which renders large population sizes inefficient.\n  Based on a recent quantitative analysis which population sizes lead to\ngenetic drift, we propose a parameter-less version of the compact genetic\nalgorithm that automatically finds a suitable population size without spending\ntoo much time in situations unfavorable due to genetic drift.\n  We prove a mathematical runtime guarantee for this algorithm and conduct an\nextensive experimental analysis on four classic benchmark problems both without\nand with additive centered Gaussian posterior noise. The former shows that\nunder a natural assumption, our algorithm has a performance very similar to the\none obtainable from the best problem-specific population size. The latter\nconfirms that missing the right population size in the original cGA can be\ndetrimental and that previous theory-based suggestions for the population size\ncan be far away from the right values; it also shows that our algorithm as well\nas a previously proposed parameter-less variant of the cGA based on parallel\nruns avoid such pitfalls. Comparing the two parameter-less approaches, ours\nprofits from its ability to abort runs which are likely to be stuck in a\ngenetic drift situation.",
    "authors": [
      "Benjamin Doerr",
      "Weijie Zheng"
    ],
    "publication_date": "2020-04-15T15:12:01Z",
    "arxiv_id": "http://arxiv.org/abs/2004.07141v3",
    "download_url": "http://arxiv.org/abs/2004.07141v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Implications of self-identified race, ethnicity, and genetic ancestry on\n  genetic association studies in biobanks within health systems",
    "abstract": "Precision medicine aims to create biomedical solutions tailored to specific\nfactors that affect disease risk and treatment responses within the population.\nThe success of the genomics era and recent widespread availability of\nelectronic health records (EHR) has ushered in a new wave of genomic biobanks\nconnected to EHR databases (EHR-linked biobanks). This perspective aims to\ndiscuss how race, ethnicity, and genetic ancestry are currently utilized to\nstudy common disease variation through genetic association studies. Although\ngenetic ancestry plays a significant role in shaping the genetic landscape\nunderlying disease risk in humans, the overall risk of a disease is caused by a\ncomplex combination of environmental, sociocultural, and genetic factors. When\nusing EHR-linked biobanks to interrogate underlying disease etiology, it is\nalso important to be aware of how the biases associated with commonly used\ndescent-associated concepts such as race and ethnicity can propagate to\ndownstream analyses. We intend for this resource to support researchers who\nperform or analyze genetic association studies in the EHR-linked biobank\nsetting such as those involved in consortium-wide biobanking efforts. We\nprovide background on how race, ethnicity, and genetic ancestry play a role in\ncurrent association studies, highlight considerations where there is no\nconsensus about best practices, and provide transparency about the current\nshortcomings.",
    "authors": [
      "Ruth Johnson",
      "Bogdan Pasaniuc"
    ],
    "publication_date": "2024-02-24T03:08:08Z",
    "arxiv_id": "http://arxiv.org/abs/2402.15696v1",
    "download_url": "http://arxiv.org/abs/2402.15696v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "k-mer-based approaches to bridging pangenomics and population genetics",
    "abstract": "Many commonly studied species now have more than one chromosome-scale genome\nassembly, revealing a large amount of genetic diversity previously missed by\napproaches that map short reads to a single reference. However, many species\nstill lack multiple reference genomes and correctly aligning references to\nbuild pangenomes is challenging, limiting our ability to study this missing\ngenomic variation in population genetics. Here, we argue that $k$-mers are a\ncrucial stepping stone to bridging the reference-focused paradigms of\npopulation genetics with the reference-free paradigms of pangenomics. We review\ncurrent literature on the uses of $k$-mers for performing three core components\nof most population genetics analyses: identifying, measuring, and explaining\npatterns of genetic variation. We also demonstrate how different $k$-mer-based\nmeasures of genetic variation behave in population genetic simulations\naccording to the choice of $k$, depth of sequencing coverage, and degree of\ndata compression. Overall, we find that $k$-mer-based measures of genetic\ndiversity scale consistently with pairwise nucleotide diversity ($\\pi$) up to\nvalues of about $\\pi = 0.025$ ($R^2 = 0.97$) for neutrally evolving\npopulations. For populations with even more variation, using shorter $k$-mers\nwill maintain the scalability up to at least $\\pi = 0.1$. Furthermore, in our\nsimulated populations, $k$-mer dissimilarity values can be reliably\napproximated from counting bloom filters, highlighting a potential avenue to\ndecreasing the memory burden of $k$-mer based genomic dissimilarity analyses.\nFor future studies, there is a great opportunity to further develop methods to\nidentifying selected loci using $k$-mers.",
    "authors": [
      "Miles D. Roberts",
      "Olivia Davis",
      "Emily B. Josephs",
      "Robert J. Williamson"
    ],
    "publication_date": "2024-09-18T03:50:13Z",
    "arxiv_id": "http://arxiv.org/abs/2409.11683v1",
    "download_url": "http://arxiv.org/abs/2409.11683v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A General Framework of Brain Region Detection And Genetic Variants\n  Selection in Imaging Genetics",
    "abstract": "Imaging genetics is a growing field that employs structural or functional\nneuroimaging techniques to study individuals with genetic risk variants\npotentially linked to specific illnesses. This area presents considerable\nchallenges to statisticians due to the heterogeneous information and different\ndata forms it involves. In addition, both imaging and genetic data are\ntypically high-dimensional, creating a \"big data squared\" problem. Moreover,\nbrain imaging data contains extensive spatial information. Simply vectorizing\ntensor images and treating voxels as independent features can lead to\ncomputational issues and disregard spatial structure. This paper presents a\nnovel statistical method for imaging genetics modeling while addressing all\nthese challenges. We explore a Canonical Correlation Analysis based linear\nmodel for the joint modeling of brain imaging, genetic information, and\nclinical phenotype, enabling the simultaneous detection of significant brain\nregions and selection of important genetic variants associated with the\nphenotype outcome. Scalable algorithms are developed to tackle the \"big data\nsquared\" issue. We apply the proposed method to explore the reaction speed, an\nindicator of cognitive functions, and its associations with brain MRI and\ngenetic factors using the UK Biobank database. Our study reveals a notable\nconnection between the caudate nucleus region of brain and specific significant\nSNPs, along with their respective regulated genes, and the reaction speed.",
    "authors": [
      "Siqiang Su",
      "Zhenghao Li",
      "Long Feng",
      "Ting Li"
    ],
    "publication_date": "2024-12-27T16:54:11Z",
    "arxiv_id": "http://arxiv.org/abs/2412.19735v2",
    "download_url": "http://arxiv.org/abs/2412.19735v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Imaging Genetics Analysis of Alzheimer's Disease",
    "abstract": "Alzheimer's disease (AD) is a progressive neurodegenerative disorder\ncharacterized by cognitive decline, structural brain changes, and genetic\npredispositions. This study leverages machine-learning and statistical\ntechniques to investigate the mechanistic relationships between cognitive\nfunction, genetic markers, and neuroimaging biomarkers in AD progression. Using\ndata from the Alzheimer's Disease Neuroimaging Initiative (ADNI), we perform\nboth low-dimensional and high-dimensional analyses to identify key predictors\nof disease states, including cognitively normal (CN), mild cognitive impairment\n(MCI), and AD. Our low-dimensional approach utilizes multiple linear and\nordinal logistic regression to examine the influence of cognitive scores,\ncerebrospinal fluid (CSF) biomarkers, and demographic factors on disease\nclassification. The results highlight significant associations between\nMini-Mental State Examination (MMSE), Clinical Dementia Rating Sum of Boxes\n(CDRSB), and phosphorylated tau levels in predicting cognitive decline. The\nhigh-dimensional analysis employs Sure Independence Screening (SIS) and LASSO\nregression to reduce dimensionality and identify genetic markers correlated\nwith cognitive impairment and white matter integrity. Genes such as CLIC1,\nNAB2, and TGFBR1 emerge as significant predictors across multiple analyses,\nlinking genetic expression to neurodegeneration. Additionally, imaging genetic\nanalysis reveals shared genetic influences across brain hemispheres and the\ncorpus callosum, suggesting distinct genetic contributions to white matter\ndegradation. These findings enhance our understanding of AD pathology by\nintegrating cognitive, genetic, and imaging data. Future research should\nexplore longitudinal analyses and potential gene-environment interactions to\nfurther elucidate the biological mechanisms underlying AD progression.",
    "authors": [
      "Riddhik Basu",
      "Arkaprava Roy"
    ],
    "publication_date": "2025-10-26T15:44:52Z",
    "arxiv_id": "http://arxiv.org/abs/2510.22723v2",
    "download_url": "http://arxiv.org/abs/2510.22723v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Wigner-Eckart Theorem in the crystal and the organisation of the genetic\n  code",
    "abstract": "Modelising the translation errors by suitable mathematical operators in the\ncrystal basis model of the genetic code and requiring that codons prone to be\nmisread encode the same amino-acid, the main features of the organisation in\nmultiplets of the genetic code are described.",
    "authors": [
      "A. Sciarrino"
    ],
    "publication_date": "2001-11-05T10:39:22Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0111006v1",
    "download_url": "http://arxiv.org/abs/math-ph/0111006v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Results of Evolution Supervised by Genetic Algorithms",
    "abstract": "A series of results of evolution supervised by genetic algorithms with\ninterest to agricultural and horticultural fields are reviewed. New obtained\noriginal results from the use of genetic algorithms on structure-activity\nrelationships are reported.",
    "authors": [
      "Lorentz Jäntschi",
      "Sorana D. Bolboac{\\ba}",
      "Mugur C. Bălan",
      "Radu E. Sestraş"
    ],
    "publication_date": "2010-09-05T13:17:01Z",
    "arxiv_id": "http://arxiv.org/abs/1009.0915v1",
    "download_url": "http://arxiv.org/abs/1009.0915v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite State Machine Synthesis for Evolutionary Hardware",
    "abstract": "This article considers application of genetic algorithms for finite machine\nsynthesis. The resulting genetic finite state machines synthesis algorithm\nallows for creation of machines with less number of states and within shorter\ntime. This makes it possible to use hardware-oriented genetic finite machines\nsynthesis algorithm in autonomous systems on reconfigurable platforms.",
    "authors": [
      "Andrey Bereza",
      "Maksim Lyashov",
      "Luis Blanco"
    ],
    "publication_date": "2013-07-26T11:11:47Z",
    "arxiv_id": "http://arxiv.org/abs/1307.6995v2",
    "download_url": "http://arxiv.org/abs/1307.6995v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Recombination as a Chemical Reaction Network",
    "abstract": "The process of genetic recombination can be seen as a chemical reaction\nnetwork with mass-action kinetics. We review the known results on existence,\nuniqueness, and global stability of an equilibrium in every compatibility class\nand for all rate constants, from both the population genetics and the reaction\nnetworks point of view.",
    "authors": [
      "Stefan Müller",
      "Josef Hofbauer"
    ],
    "publication_date": "2015-03-03T22:55:09Z",
    "arxiv_id": "http://arxiv.org/abs/1503.01155v1",
    "download_url": "http://arxiv.org/abs/1503.01155v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic algorithm formulation and tuning with use of test functions",
    "abstract": "This work discusses single-objective constrained genetic algorithm with\nfloating-point, integer, binary and permutation representation. Floating-point\ngenetic algorithm tuning with use of test functions is done and leads to a\nparameterization with comparatively outstanding performance.",
    "authors": [
      "Tomasz Tarkowski"
    ],
    "publication_date": "2022-10-06T21:24:43Z",
    "arxiv_id": "http://arxiv.org/abs/2210.03217v1",
    "download_url": "http://arxiv.org/abs/2210.03217v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]