[
  {
    "title": "Evaluating The Impact Of Species Specialisation On Ecological Network\n  Robustness Using Analytic Methods",
    "abstract": "Ecological networks describe the interactions between different species,\ninforming us of how they rely on one another for food, pollination and\nsurvival. If a species in an ecosystem is under threat of extinction, it can\naffect other species in the system and possibly result in their secondary\nextinction as well. Understanding how (primary) extinctions cause secondary\nextinctions on ecological networks has been considered previously using\ncomputational methods. However, these methods do not provide an explanation for\nthe properties which make ecological networks robust, and can be\ncomputationally expensive. We develop a new analytic model for predicting\nsecondary extinctions which requires no non-deterministic computational\nsimulation. Our model can predict secondary extinctions when primary\nextinctions occur at random or due to some targeting based on the number of\nlinks per species or risk of extinction, and can be applied to an ecological\nnetwork of any number of layers. Using our model, we consider how false\npositives and negatives in network data affect predictions for network\nrobustness. We have also extended the model to predict scenarios in which\nsecondary extinctions occur once species lose a certain percentage of\ninteraction strength, and to model the loss of interactions as opposed to just\nspecies extinction. From our model, it is possible to derive new analytic\nresults such as how ecological networks are most robust when secondary species\ndegree variance is minimised. Additionally, we show that both specialisation\nand generalisation in distribution of interaction strength can be advantageous\nfor network robustness, depending upon the extinction scenario being\nconsidered.",
    "authors": [
      "Chris Jones",
      "Damaris Zurell",
      "Karoline Wiesner"
    ],
    "publication_date": "2023-06-27T12:38:35Z",
    "arxiv_id": "http://arxiv.org/abs/2306.15428v2",
    "download_url": "http://arxiv.org/abs/2306.15428v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysis of Elephant Movement in Sub-Saharan Africa: Ecological,\n  Climatic, and Conservation Perspectives",
    "abstract": "The interaction between elephants and their environment has profound\nimplications for both ecology and conservation strategies. This study presents\nan analytical approach to decipher the intricate patterns of elephant movement\nin Sub-Saharan Africa, concentrating on key ecological drivers such as seasonal\nvariations and rainfall patterns. Despite the complexities surrounding these\ninfluential factors, our analysis provides a holistic view of elephant\nmigratory behavior in the context of the dynamic African landscape. Our\ncomprehensive approach enables us to predict the potential impact of these\necological determinants on elephant migration, a critical step in establishing\ninformed conservation strategies. This projection is particularly crucial given\nthe impacts of global climate change on seasonal and rainfall patterns, which\ncould substantially influence elephant movements in the future. The findings of\nour work aim to not only advance the understanding of movement ecology but also\nfoster a sustainable coexistence of humans and elephants in Sub-Saharan Africa.\nBy predicting potential elephant routes, our work can inform strategies to\nminimize human-elephant conflict, effectively manage land use, and enhance\nanti-poaching efforts. This research underscores the importance of integrating\nmovement ecology and climatic variables for effective wildlife management and\nconservation planning.",
    "authors": [
      "Matthew Hines",
      "Gregory Glatzer",
      "Shreya Ghosh",
      "Prasenjit Mitra"
    ],
    "publication_date": "2023-07-21T03:23:17Z",
    "arxiv_id": "http://arxiv.org/abs/2307.11325v1",
    "download_url": "http://arxiv.org/abs/2307.11325v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Les Houches Lectures on Community Ecology: From Niche Theory to\n  Statistical Mechanics",
    "abstract": "Ecosystems are among the most interesting and well-studied examples of\nself-organized complex systems. Community ecology, the study of how species\ninteract with each other and the environment, has a rich tradition. Over the\nlast few years, there has been a growing theoretical and experimental interest\nin these problems from the physics and quantitative biology communities. Here,\nwe give an overview of community ecology, highlighting the deep connections\nbetween ecology and statistical physics. We start by introducing the two\nclasses of mathematical models that have served as the workhorses of community\necology: Consumer Resource Models (CRM) and the generalized Lotka-Volterra\nmodels (GLV). We place a special emphasis on graphical methods and general\nprinciples. We then review recent works showing a deep and surprising\nconnection between ecological dynamics and constrained optimization. We then\nshift our focus by analyzing these same models in \"high-dimensions\" (i.e. in\nthe limit where the number of species and resources in the ecosystem becomes\nlarge) and discuss how such complex ecosystems can be analyzed using methods\nfrom the statistical physics of disordered systems such as the cavity method\nand Random Matrix Theory.",
    "authors": [
      "Wenping Cui",
      "Robert Marsland III",
      "Pankaj Mehta"
    ],
    "publication_date": "2024-03-08T18:13:06Z",
    "arxiv_id": "http://arxiv.org/abs/2403.05497v1",
    "download_url": "http://arxiv.org/abs/2403.05497v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Urban traffic resilience control -- An ecological resilience perspective",
    "abstract": "Urban traffic resilience has gained increased attention, with most studies\nadopting an engineering perspective that assumes a single optimal equilibrium\nand prioritizes local recovery. On the other hand, systems may possess multiple\nmetastable states, and ecological resilience is the ability to switch between\nthese states according to perturbations. Control strategies from these two\nresilience perspectives yield distinct outcomes. In fact, ecological resilience\noriented control has rarely been viewed in urban traffic, despite the fact that\ntraffic system is a complex system in highly uncertain environment with\npossible multiple metastable states. This absence highlights the necessity for\nurban traffic ecological resilience definition. To bridge this gap, we defines\nurban traffic ecological resilience as the ability to absorb uncertain\nperturbations by shifting to alternative states. The goal is to generate a\nsystem with greater adaptability, without necessarily returning to the original\nequilibrium. Our control framework comprises three aspects: portraying the\nrecoverable scopes; designing alternative steady states; and controlling system\nto shift to alternative steady states for adapting large disturbances. Among\nthem, the recoverable scopes are portrayed by attraction region; the\nalternative steady states are set close to the optimal state and outside the\nattraction region of the original equilibrium; the controller needs to ensure\nthe local stability of the alternative steady states, without changing the\ntrajectories inside the attraction region of the original equilibrium.\nComparisons with classical engineering resilience oriented urban traffic\nresilience control schemes show that, proposed ecological resilience oriented\ncontrol schemes can generate greater resilience. These results will contribute\nto the fundamental theory of future resilient intelligent transportation\nsystem.",
    "authors": [
      "Shengling Gao",
      "Zhikun She",
      "Quanyi Liang",
      "Nan Zheng",
      "Daqing Li"
    ],
    "publication_date": "2024-04-17T05:48:58Z",
    "arxiv_id": "http://arxiv.org/abs/2404.11082v1",
    "download_url": "http://arxiv.org/abs/2404.11082v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continual Evolution in Nonreciprocal Ecological Models",
    "abstract": "Feedbacks between evolution and ecology are ubiquitous, with ecological\ninteractions determining which mutants are successful, and these mutants in\nturn modifying community structure. We study the evolutionary dynamics of\nseveral ecological models with overlapping niches, including consumer resource\nand Lotka-Volterra models. Evolution is assumed slow and extinctions are\npermanent, with ecological dynamics reaching a stable fixed point between\nintroductions of invaders or mutants. When new strains are slowly added to the\ncommunity, the ecosystem converges, after an initial evolutionary transient, to\na diverse eco-evolutionary steady state. In this \"Red Queen\" phase of continual\nevolution, the biodiversity continues to turn over without the invasion\nprobability of new variants getting any smaller. For resource-mediated\ninteractions, the Red Queen phase obtains for any amount of asymmetry in the\ninteractions between strains, and is robust to \"general fitness\" differences in\nthe intrinsic growth rates of strains. Via a dynamical mean field theory\nframework valid for high-dimensional phenotype space, we analytically\ncharacterize the Red Queen eco-evolutionary steady state in a particular limit\nof model parameters. Scaling arguments enable a more general understanding of\nthe steady state and evolutionary transients toward it. This work therefore\nestablishes simple models of continual evolution in an ecological context\nwithout host-pathogen arms races, and points to the generality of Red Queen\nevolution. However, we also find other eco-evolutionary phases in simple\nmodels: For generalized Lotka-Volterra models with weakly asymmetric\ninteractions an \"oligarch\" phase emerges in which the evolutionary dynamics\ncontinually slow down and a substantial fraction of the community's abundance\ncondenses into a handful of slowly turning-over strains.",
    "authors": [
      "Aditya Mahadevan",
      "Daniel S. Fisher"
    ],
    "publication_date": "2024-11-26T06:32:33Z",
    "arxiv_id": "http://arxiv.org/abs/2411.17148v1",
    "download_url": "http://arxiv.org/abs/2411.17148v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Framework for FAIR and CLEAR Ecological Data and Knowledge: Semantic\n  Units for Synthesis and Causal Modelling",
    "abstract": "Ecological research increasingly relies on integrating heterogeneous datasets\nand knowledge to explain and predict complex phenomena. Yet, differences in\ndata types, terminology, and documentation often hinder interoperability,\nreuse, and causal understanding. We present the Semantic Units Framework, a\nnovel, domain-agnostic semantic modelling approach applied here to ecological\ndata and knowledge in compliance with the FAIR (Findable, Accessible,\nInteroperable, Reusable) and CLEAR (Cognitively interoperable, semantically\nLinked, contextually Explorable, easily Accessible, human-Readable and\n-interpretable) Principles. The framework models data and knowledge as modular,\nlogic-aware semantic units: single propositions (statement units) or coherent\ngroups of propositions (compound units). Statement units can model\nmeasurements, observations, or universal relationships, including causal ones,\nand link to methods and evidence. Compound units group related statement units\ninto reusable, semantically coherent knowledge objects. Implemented using RDF,\nOWL, and knowledge graphs, semantic units can be serialized as FAIR Digital\nObjects with persistent identifiers, provenance, and semantic interoperability.\nWe show how universal statement units build ecological causal networks, which\ncan be composed into causal maps and perspective-specific subnetworks. These\nsupport causal reasoning, confounder detection (back-door), effect\nidentification with unobserved confounders (front-door), application of\ndo-calculus, and alignment with Bayesian networks, structural equation models,\nand structural causal models. By linking fine-grained empirical data to\nhigh-level causal reasoning, the Semantic Units Framework provides a foundation\nfor ecological knowledge synthesis, evidence annotation, cross-domain\nintegration, reproducible workflows, and AI-ready ecological research.",
    "authors": [
      "Lars Vogt",
      "Birgitta König-Ries",
      "Tim Alamenciak",
      "Joshua I. Brian",
      "Carlos Alberto Arnillas",
      "Lotte Korell",
      "Robert Frühstückl",
      "Tina Heger"
    ],
    "publication_date": "2025-08-12T14:19:08Z",
    "arxiv_id": "http://arxiv.org/abs/2508.08959v1",
    "download_url": "http://arxiv.org/abs/2508.08959v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Disturbance Ecology from nearby Supernovae",
    "abstract": "Monte Carlo simulations of Galactic Supernovae are carried out to study the\nrate of nearby events, which may have a direct effect on Earth's ecology though\nionizing radiation and cosmic ray bombardment. A nearby supernova may have left\na radioactive imprint (60Fe) in recent galactic history.",
    "authors": [
      "D. H. Hartmann",
      "K. Kretschmer",
      "R. Diehl"
    ],
    "publication_date": "2002-05-08T03:39:00Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0205110v1",
    "download_url": "http://arxiv.org/abs/astro-ph/0205110v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Limit Cycle Bifurcations in a Quartic Ecological Model",
    "abstract": "In this paper we complete the global qualitative analysis of a quartic\necological model. In particular, studying global bifurcations of singular\npoints and limit cycles, we prove that the corresponding dynamical system has\nat most two limit cycles.",
    "authors": [
      "Henk W. Broer",
      "Valery A. Gaiko"
    ],
    "publication_date": "2009-02-16T15:42:20Z",
    "arxiv_id": "http://arxiv.org/abs/0902.2433v1",
    "download_url": "http://arxiv.org/abs/0902.2433v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Review of: Mixed Effects Models and Extensions in Ecology with R",
    "abstract": "This is a review of the book \"Mixed Effects Models and Extensions in Ecology\nwith R\" by Zuur, Ieno, Walker, Saveliev and Smith (2009, Springer). I was asked\nto review this book for The American Statistician in 2010. After I wrote the\nreview, the invitation was revoked. This is the review.",
    "authors": [
      "J. Andrew Royle"
    ],
    "publication_date": "2013-05-30T03:54:24Z",
    "arxiv_id": "http://arxiv.org/abs/1305.6995v1",
    "download_url": "http://arxiv.org/abs/1305.6995v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Animal behavior facilitates eco-evolutionary dynamics",
    "abstract": "The mechanisms underlying eco-evolutionary dynamics (the feedback between\necological and evolutionary processes) are often unknown. Here, we propose that\nclassical theory from behavioral ecology can provide a greater understanding of\nthe mechanisms underlying eco-evolutionary dynamics, and thus improve\npredictions about the outcomes of these dynamics.",
    "authors": [
      "Kiyoko M. Gotanda",
      "Damien R. Farine",
      "Claudius F. Kratochwil",
      "Kate L. Laskowski",
      "Pierre-Olivier Montiglio"
    ],
    "publication_date": "2019-12-19T19:13:23Z",
    "arxiv_id": "http://arxiv.org/abs/1912.09505v1",
    "download_url": "http://arxiv.org/abs/1912.09505v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolutionary ecology in-silico: Does mathematical modelling help in\n  understanding the \"generic\" trends?",
    "abstract": "Motivated by the results of recent laboratory experiments (Yoshida et al.\nNature, 424, 303-306 (2003)) as well as many earlier field observations that\nevolutionary changes can take place in ecosystems over relatively short\necological time scales, several ``unified'' mathematical models of evolutionary\necology have been developed over the last few years with the aim of describing\nthe statistical properties of data related to the evolution of ecosystems.\nMoreover, because of the availability of sufficiently fast computers, it has\nbecome possible to carry out detailed computer simulations of these models. For\nthe sake of completeness and to put these recent developments in the proper\nperspective, we begin with a brief summary of some older models of ecological\nphenomena and evolutionary processes. However, the main aim of this article is\nto review critically these ``unified'' models, particularly those published in\nthe physics literature, in simple language that makes the new theories\naccessible to wider audience.",
    "authors": [
      "Debashish Chowdhury",
      "Dietrich Stauffer"
    ],
    "publication_date": "2005-04-16T11:18:35Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0504020v1",
    "download_url": "http://arxiv.org/abs/q-bio/0504020v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Toward an Ecological Theory of Concepts",
    "abstract": "Psychology has had difficulty accounting for the creative, context-sensitive\nmanner in which concepts are used. We believe this stems from the view of\nconcepts as identifiers rather than bridges between mind and world that\nparticipate in the generation of meaning. This paper summarizes the history and\ncurrent status of concepts research, and provides a non-technical summary of\nwork toward an ecological approach to concepts. We outline the rationale for\napplying generalizations of formalisms originally developed for use in quantum\nmechanics to the modeling of concepts, showing how it is because of the role of\ncontext that deep structural similarities exist between the two. A concept is\ndefined not just in terms of exemplary states and their features or properties,\nbut also by the relational structures of these properties, and their\nsusceptibility to change under different contexts. The approach implies a view\nof mind in which the union of perception and environment drives\nconceptualization, forging a web of conceptual relations or 'ecology of mind'.",
    "authors": [
      "Liane Gabora",
      "Eleanor Rosch",
      "Diederik Aerts"
    ],
    "publication_date": "2008-03-18T03:58:30Z",
    "arxiv_id": "http://arxiv.org/abs/0803.2567v1",
    "download_url": "http://arxiv.org/abs/0803.2567v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ecological analysis of world trade",
    "abstract": "Ecological systems have a high level of complexity combined with stability\nand rich biodiversity. Recently, the analysis of their properties and evolution\nhas been pushed forward on a basis of concept of mutualistic networks that\nprovides a detailed understanding of their features being linked to a high\nnestedness of these networks. It was shown that the nestedness architecture of\nmutualistic networks of plants and their pollinators minimizes competition and\nincreases biodiversity. Here, using the United Nations COMTRADE database for\nyears 1962 - 2009, we show that a similar ecological analysis gives a valuable\ndescription of the world trade. In fact the countries and trade products are\nanalogous to plants and pollinators, and the whole trade network is\ncharacterized by a low nestedness temperature which is typical for the\necological networks. This approach provides new mutualistic features of the\nworld trade highlighting new significance of countries and trade products for\nthe world trade.",
    "authors": [
      "Leonardo Ermann",
      "Dima L. Shepelyansky"
    ],
    "publication_date": "2012-01-17T18:26:23Z",
    "arxiv_id": "http://arxiv.org/abs/1201.3584v1",
    "download_url": "http://arxiv.org/abs/1201.3584v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simultaneous analysis of a sequence of paired ecological tables: A\n  comparison of several methods",
    "abstract": "A pair of ecological tables is made of one table containing environmental\nvariables (in columns) and another table containing species data (in columns).\nThe rows of these two tables are identical and correspond to the sites where\nenvironmental variables and species data have been measured. Such data are used\nto analyze the relationships between species and their environment. If sampling\nis repeated over time for both tables, one obtains a sequence of pairs of\necological tables. Analyzing this type of data is a way to assess changes in\nspecies-environment relationships, which can be important for conservation\nEcology or for global change studies. We present a new data analysis method\nadapted to the study of this type of data, and we compare it with two other\nmethods on the same data set. All three methods are implemented in the ade4\npackage for the R environment.",
    "authors": [
      "Jean Thioulouse"
    ],
    "publication_date": "2012-02-24T15:04:28Z",
    "arxiv_id": "http://arxiv.org/abs/1202.5473v1",
    "download_url": "http://arxiv.org/abs/1202.5473v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effects of Mixing Interaction Types on Ecological Community Stability",
    "abstract": "In the last years, a remarkable theoretical effort has been made in order to\nunderstand stability and complexity in ecological communities. The non-random\nstructures of real ecological interaction networks has been recognized as one\nkey ingredient contributing to the coexistence between high complexity and\nstability in real ecosystems. However most of the theoretical studies have\nconsidered communities with only one interaction type (either antagonistic,\ncompetitive, or mutualistic). Recently it has been proposed a theoretical\nanalysis on multiple interaction types in ecological systems, concluding that:\na) Mixture of antagonistic and mutualistic interactions stabilize the system\nwith respect to the less realistic case of only one interaction type; b)\nComplexity, measured in terms of the number of interactions and the number of\nspecies, increases stability in systems with different types of interactions.\nBy introducing new theoretical investigations and analyzing 21 empirical data\nsets representing mutualistic plant-pollinator networks, we show that that\nconclusions are incorrect. We will prove that the positive complexity-stability\neffect observed in systems with different kind of interactions is a mere\nconsequence of a rescaling of the interaction strengths, and thus unrelated to\nthe mixing of interaction types.",
    "authors": [
      "Samir Suweis",
      "Jacopo Grilli",
      "Amos Maritan"
    ],
    "publication_date": "2013-01-08T15:48:50Z",
    "arxiv_id": "http://arxiv.org/abs/1301.1569v1",
    "download_url": "http://arxiv.org/abs/1301.1569v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MODULAR: Software for the Autonomous Computation of Modularity in Large\n  Network Sets",
    "abstract": "Ecological systems can be seen as networks of interactions between\nindividual, species, or habitat patches. A key feature of many ecological\nnetworks is their organization into modules, which are subsets of elements that\nare more connected to each other than to the other elements in the network. We\nintroduce MODULAR to perform rapid and autonomous calculation of modularity in\nsets of networks. MODULAR reads a set of files with matrices or edge lists that\nrepresent unipartite or bipartite networks, and identify modules using two\ndifferent modularity metrics that have been previously used in studies of\necological networks. To find the network partition that maximizes modularity,\nthe software offers five optimization methods to the user. We also included two\nof the most common null models that are used in studies of ecological networks\nto verify how the modularity found by the maximization of each metric differs\nfrom a theoretical benchmark.",
    "authors": [
      "Flavia Maria Darcie Marquitti",
      "Paulo Roberto Guimaraes Jr.",
      "Mathias Mistretta Pires",
      "Luiz Fernando Bittencourt"
    ],
    "publication_date": "2013-04-09T14:37:44Z",
    "arxiv_id": "http://arxiv.org/abs/1304.2917v1",
    "download_url": "http://arxiv.org/abs/1304.2917v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Robustness and Directed Structures in Ecological Flow Networks",
    "abstract": "Robustness of ecological flow networks under random failure of arcs is\nconsidered with respect to two different functionalities: coherence and\ncirculation. In our previous work, we showed that each functionality is\nassociated with a natural path notion: lateral path for the former and directed\npath for the latter. Robustness of a network is measured in terms of the size\nof the giant laterally connected arc component and that of the giant strongly\nconnected arc component, respectively. We study how realistic structures of\necological flow networks affect the robustness with respect to each\nfunctionality. To quantify the impact of realistic network structures, two null\nmodels are considered for a given real ecological flow network: one is random\nnetworks with the same degree distribution and the other is those with the same\naverage degree. Robustness of the null models is calculated by theoretically\nsolving the size of giant components for the configuration model. We show that\nrealistic network structures have positive effect on robustness for coherence,\nwhereas they have negative effect on robustness for circulation.",
    "authors": [
      "Taichi Haruna"
    ],
    "publication_date": "2013-06-26T05:00:52Z",
    "arxiv_id": "http://arxiv.org/abs/1306.6129v1",
    "download_url": "http://arxiv.org/abs/1306.6129v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A process-independent explanation for the general form of Taylor's Law",
    "abstract": "Taylors Law (TL) describes the scaling relationship between the mean and\nvariance of populations as a power-law. TL is widely observed in ecological\nsystems across space and time with exponents varying largely between 1 and 2.\nMany ecological explanations have been proposed for TL but it is also commonly\nobserved outside ecology. We propose that TL arises from the constraining\ninfluence of two primary variables: the number of individuals and the number of\ncensuses or sites. We show that most possible configurations of individuals\namong censuses or sites produce the power-law form of TL with exponents between\n1 and 2. This feasible set approach suggests that TL is a statistical pattern\ndriven by two constraints, providing an a priori explanation for this\nubiquitous pattern. However, the exact form of any specific mean-variance\nrelationship cannot be predicted in this way, i.e., this approach does a poor\njob of predicting variation in the exponent, suggesting that TL may still\ncontain ecological information.",
    "authors": [
      "Xiao Xiao",
      "Kenneth J. Locey",
      "Ethan P. White"
    ],
    "publication_date": "2014-10-27T15:56:26Z",
    "arxiv_id": "http://arxiv.org/abs/1410.7283v2",
    "download_url": "http://arxiv.org/abs/1410.7283v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A framework for analyzing ecological trait-based models in\n  multi-dimensional niche spaces",
    "abstract": "We develop an theoretical approach for predicting biodiversity in\nmulti-dimensional niche spaces, arising due to ecological drivers such as\ncompetitive exclusion. The novelty of our approach relies on the fact that\necological niches are described by sequences of strings, which allows us to\ndescribe multiple traits. We define the mathematical framework for analyzing\npattern forming instabilities in these models, showing surprisingly that the\nanalytic linear theory predicts the asymptotically long time population\ndistributions of niches in the model. We propose a test for identifying\necological drivers in biodiversity distributions, based on representing\necosystem data by means of a certain transform introduced in the theory.",
    "authors": [
      "Tommaso Biancalani",
      "Lee DeVille",
      "Nigel Goldenfeld"
    ],
    "publication_date": "2014-12-08T14:51:26Z",
    "arxiv_id": "http://arxiv.org/abs/1412.2592v2",
    "download_url": "http://arxiv.org/abs/1412.2592v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The basis function approach for modeling autocorrelation in ecological\n  data",
    "abstract": "Analyzing ecological data often requires modeling the autocorrelation created\nby spatial and temporal processes. Many of the statistical methods used to\naccount for autocorrelation can be viewed as regression models that include\nbasis functions. Understanding the concept of basis functions enables\necologists to modify commonly used ecological models to account for\nautocorrelation, which can improve inference and predictive accuracy.\nUnderstanding the properties of basis functions is essential for evaluating the\nfit of spatial or time-series models, detecting a hidden form of\nmulticollinearity, and analyzing large data sets. We present important concepts\nand properties related to basis functions and illustrate several tools and\ntechniques ecologists can use when modeling autocorrelation in ecological data.",
    "authors": [
      "Trevor J. Hefley",
      "Kristin M. Broms",
      "Brian M. Brost",
      "Frances E. Buderman",
      "Shannon L. Kay",
      "Henry R. Scharf",
      "John R. Tipton",
      "Perry J. Williams",
      "Mevin B. Hooten"
    ],
    "publication_date": "2016-06-17T20:04:46Z",
    "arxiv_id": "http://arxiv.org/abs/1606.05658v1",
    "download_url": "http://arxiv.org/abs/1606.05658v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Determinants of Structural Stability in Complex Ecological and\n  Biological Networks: the Google Matrix Approach Determinants of stability in\n  biological and ecological networks: the Google matrix approach",
    "abstract": "Mays celebrated theoretical work of the 70s contradicted the established\nparadigm by demonstrating that complexity leads to instability in biological\nsystems. Here Mays random-matrix modelling approach is generalized to realistic\nlarge-scale webs of species interactions, be they structured by networks of\ncompetition, mutualism or both. Simple relationships are found to govern these\notherwise intractable models, and control the parameter ranges for which\nbiological systems are stable and feasible. Our analysis of model and real\nempirical networks is only achievable upon introducing a simplifying\nGoogle-matrix reduction scheme, which in the process, yields a practical\necological eigenvalue stability index. These results provide an understanding\non how network topology, especially connectance, influences species stable\ncoexistence. Constraints controlling feasibility (positive equilibrium\npopulations) in these systems, are found more restrictive than those\ncontrolling stability, helping explain the enigma of why many classes of\nfeasible ecological models are nearly always stable.",
    "authors": [
      "Lewi Stone"
    ],
    "publication_date": "2016-07-07T06:12:06Z",
    "arxiv_id": "http://arxiv.org/abs/1607.01879v2",
    "download_url": "http://arxiv.org/abs/1607.01879v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic competitive exclusion leads to a cascade of species\n  extinctions",
    "abstract": "Community ecology has traditionally relied on the competitive exclusion\nprinciple, a piece of common wisdom in conceptual frameworks developed to\ndescribe species assemblages. Key concepts in community ecology, such as\nlimiting similarity and niche partitioning, are based on competitive exclusion.\nHowever, this classical paradigm in ecology relies on implications derived from\nsimple, deterministic models. Here we show how the predictions of a symmetric,\ndeterministic model about the way extinctions proceed can be utterly different\nfrom the results derived from the same model when ecological drift (demographic\nstochasticity) is explicitly considered. Using analytical approximations to the\nsteady-state conditional probabilities for assemblages with two and three\nspecies, we demonstrate that stochastic competitive exclusion leads to a\ncascade of extinctions, whereas the symmetric, deterministic model predicts a\nmultiple collapse of species. To test the robustness of our results, we have\nstudied the effect of environmental stochasticity and relaxed the species\nsymmetry assumption. Our conclusions highlight the crucial role of\nstochasticity when deriving reliable theoretical predictions for species\ncommunity assembly.",
    "authors": [
      "Jose A. Capitan",
      "Sara Cuenda",
      "David Alonso"
    ],
    "publication_date": "2016-08-11T20:00:06Z",
    "arxiv_id": "http://arxiv.org/abs/1608.03594v1",
    "download_url": "http://arxiv.org/abs/1608.03594v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bridging Ecology and Cloud: Transposing Ecological Prespective to Enable\n  Better Cloud Autoscaling",
    "abstract": "Elastic autoscaling is the fundamental mechanism that enables the cloud-based\nservices to continually evolve themselves - through changing the related\nsoftware configurations and hardware resource provisions - under time-varying\nworkloads. However, given the increasingly complex dynamic, uncertainty and\ntrade-offs related to the runtime QoS and cost/energy of services, cloud\nautoscaling system is becoming one of the most complex artifacts constructed by\nhuman and thus its effectiveness is difficult to be preserved. In this article,\nwe present novel ideas for facilitating cloud autoscaling. Our hypothesis that\ncloud ecosystem, represented by a collection of cloud-based services, bears\nmany similarities with the natural ecosystem. As such, we in- tend to\ninvestigate how ecological view can be adopted to better explain how the\ncloud-based services evolve, and to explore what are the key factors that drive\nstable and sustainable cloud-based services in the cloud. To achieve this goal,\nwe aim to transpose ecological principles, theories and models into cloud\nautoscaling analogues and spontaneously improve long-term stability and\nsustainability of cloud ecosystem.",
    "authors": [
      "Tao Chen",
      "Rami Bahsoon"
    ],
    "publication_date": "2016-08-21T12:17:42Z",
    "arxiv_id": "http://arxiv.org/abs/1608.05926v1",
    "download_url": "http://arxiv.org/abs/1608.05926v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cohort aggregation modelling for complex forest stands: Spruce-aspen\n  mixtures in British Columbia",
    "abstract": "Mixed-species growth models are needed as a synthesis of ecological knowledge\nand for guiding forest management. Individual-tree models have been commonly\nused, but the difficulties of reliably scaling from the individual to the stand\nlevel are often underestimated. Emergent properties and statistical issues\nlimit their effectiveness. A more holistic modelling of aggregates at the whole\nstand level is a potentially attractive alternative. This work explores\nmethodology for developing biologically consistent dynamic mixture models where\nthe state is described by aggregate stand-level variables for species or\nage/size cohorts. The methods are demonstrated and tested with a two-cohort\nmodel for spruce-aspen mixtures named SAM. The models combine single-species\nsubmodels and submodels for resource partitioning among the cohorts. The\npartitioning allows for differences in competitive strength among species and\nsize classes, and for complementarity effects. Height growth reduction in\nsuppressed cohorts is also modelled. SAM fits well the available data, and\nexhibits behaviors consistent with current ecological knowledge. The general\nframework can be applied to any number of cohorts, and should be useful as a\nbasis for modelling other mixed-species or uneven-aged stands.",
    "authors": [
      "Oscar García"
    ],
    "publication_date": "2016-10-24T04:43:40Z",
    "arxiv_id": "http://arxiv.org/abs/1610.07278v2",
    "download_url": "http://arxiv.org/abs/1610.07278v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reinterpreting Maximum Entropy in Ecology: a null hypothesis constrained\n  by ecological mechanism",
    "abstract": "Simplified mechanistic models in ecology have been criticized for the fact\nthat a good fit to data does not imply the mechanism is true: pattern does not\nequal process. In parallel, the maximum entropy principle (MaxEnt) has been\napplied in ecology to make predictions constrained by just a handful of state\nvariables, like total abundance or species richness. But an outstanding\nquestion remains: what principle tells us which state variables to constrain?\nHere we attempt to solve both problems simultaneously, by translating a given\nset of mechanisms into the state variables to be used in MaxEnt, and then using\nthis MaxEnt theory as a null model against which to compare mechanistic\npredictions. In particular, we identify the sufficient statistics needed to\nparametrize a given mechanistic model from data and use them as MaxEnt\nconstraints. Our approach isolates exactly what mechanism is telling us over\nand above the state variables alone.",
    "authors": [
      "James P. O'Dwyer",
      "Andrew Rominger",
      "Xiao Xiao"
    ],
    "publication_date": "2017-02-27T21:37:46Z",
    "arxiv_id": "http://arxiv.org/abs/1702.08543v4",
    "download_url": "http://arxiv.org/abs/1702.08543v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Real-time Monitoring and Forecasting of Ecological Processes",
    "abstract": "The paper introduces a real-time monitoring and forecasting system for\necological phenomena. The process yields a collection of ecological parameters\nviewed as distributed time series, which are measured by means of wireless\nnetwork of sensors. The acquired data are preliminary processed and modeled by\nusing complex algorithms in view of prediction. There are three graphical user\ninterfaces implemented within the monitoring and forecasting system: eko-View\nand eko-Greenhouse (which directly interacts with the process) and eko-Forecast\n(which estimates the future evolution of some ecological parameters). The\nmonitoring system was effectively integrated in an industrial application\ndealing with automatic irrigation of a small greenhouse. The forecasting\nsimulation results with real data and a comparative assessment of predictor\nperformances are presented in the end.",
    "authors": [
      "Janetta Culita",
      "Alexandru Dumitrascu",
      "Dan Stefanoiu"
    ],
    "publication_date": "2017-03-21T11:56:17Z",
    "arxiv_id": "http://arxiv.org/abs/1703.07162v1",
    "download_url": "http://arxiv.org/abs/1703.07162v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Population invasion with bistable dynamics and adaptive evolution: the\n  evolutionary rescue",
    "abstract": "We consider the system of reaction-diffusion equations proposed in [8] as a\npopulation dynamics model. The first equation stands for the population density\nand models the ecological effects, namely dispersion and growth with a Allee\neffect (bistable nonlinearity). The second one stands for the Allee threshold,\nseen as a trait mean, and accounts for evolutionary effects. Precisely, the\nAllee threshold is submitted to three main effects: dispersion (mirroring\necology), asymmetrical gene flow and selection. The strength of the latter\ndepends on the population density and is thus coupling ecology and evolution.\nOur main result is to mathematically prove evolutionary rescue: any small\ninitial population, that would become extinct in the sole ecological context,\nwill persist and spread thanks to evolutionary factors.",
    "authors": [
      "Matthieu Alfaro",
      "Arnaud Ducrot"
    ],
    "publication_date": "2018-01-22T10:18:18Z",
    "arxiv_id": "http://arxiv.org/abs/1801.07024v1",
    "download_url": "http://arxiv.org/abs/1801.07024v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Growth tradeoffs produce complex microbial communities on a single\n  limiting resource",
    "abstract": "The relationship between the dynamics of a community and its constituent\npairwise interactions is a fundamental problem in ecology. Higher-order\necological effects beyond pairwise interactions may be key to complex\necosystems, but mechanisms to produce these effects remain poorly understood.\nHere we show that higher-order effects can arise from variation in multiple\nmicrobial growth traits, such as lag times and growth rates, on a single\nlimiting resource with no other interactions. These effects produce a range of\necological phenomena: an unlimited number of strains can exhibit multistability\nand neutral coexistence, potentially with a single keystone strain; strains\nthat coexist in pairs do not coexist all together; and the champion of all\npairwise competitions may not dominate in a mixed community. Since variation in\nmultiple growth traits is ubiquitous in microbial populations due to pleiotropy\nand non-genetic variation, our results indicate these higher-order effects may\nalso be widespread, especially in laboratory ecology and evolution experiments.",
    "authors": [
      "Michael Manhart",
      "Eugene I. Shakhnovich"
    ],
    "publication_date": "2018-02-15T21:51:32Z",
    "arxiv_id": "http://arxiv.org/abs/1802.05774v2",
    "download_url": "http://arxiv.org/abs/1802.05774v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ecological Data Analysis Based on Machine Learning Algorithms",
    "abstract": "Classification is an important supervised machine learning method, which is\nnecessary and challenging issue for ecological research. It offers a way to\nclassify a dataset into subsets that share common patterns. Notably, there are\nmany classification algorithms to choose from, each making certain assumptions\nabout the data and about how classification should be formed. In this paper, we\napplied eight machine learning classification algorithms such as Decision\nTrees, Random Forest, Artificial Neural Network, Support Vector Machine, Linear\nDiscriminant Analysis, k-nearest neighbors, Logistic Regression and Naive Bayes\non ecological data. The goal of this study is to compare different machine\nlearning classification algorithms in ecological dataset. In this analysis we\nhave checked the accuracy test among the algorithms. In our study we conclude\nthat Linear Discriminant Analysis and k-nearest neighbors are the best methods\namong all other methods",
    "authors": [
      "Md. Siraj-Ud-Doula",
      "Md. Ashad Alam"
    ],
    "publication_date": "2018-12-21T14:18:56Z",
    "arxiv_id": "http://arxiv.org/abs/1812.09138v1",
    "download_url": "http://arxiv.org/abs/1812.09138v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Resilience as pathway diversity: Linking systems, individual and\n  temporal perspectives on resilience",
    "abstract": "Approaches to understanding resilience from psychology and sociology\nemphasise individuals' agency but obscure systemic factors. Approaches to\nunderstanding resilience stemming from ecology emphasise system dynamics such\nas feedbacks but obscure individuals. Approaches from both psychology and\necology examine the actions or attractors available in the present, but neglect\nhow actions taken now can affect the configuration of the social-ecological\nsystem in the future. Here, we propose an extension to resilience theory, which\nwe label 'pathway diversity', that links existing individual, systems and\ntemporal theories of resilience. In our theory of pathway diversity, resilience\nis greater if more actions are currently available and can be maintained or\nenhanced into the future. Using a toy model of an agricultural\nsocial-ecological system, we show how pathway diversity could deliver a\ncontext-sensitive method of assessing resilience and guiding planning. Using a\ntoy state-and-transition model of a poverty trap, we show how pathway diversity\nis generally consistent with existing definitions of resilience and can\nilluminate long-standing questions about normative and descriptive resilience.\nOur results show that pathway diversity advances both theoretical understanding\nand practical tools for building resilience.",
    "authors": [
      "Steven J. Lade",
      "Brian H. Walker",
      "L. Jamila Haider"
    ],
    "publication_date": "2019-11-06T10:37:40Z",
    "arxiv_id": "http://arxiv.org/abs/1911.02294v1",
    "download_url": "http://arxiv.org/abs/1911.02294v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gene drive dynamics in natural populations: The importance of\n  density-dependence, space and sex",
    "abstract": "The spread of synthetic gene drives is often discussed in the context of\npanmictic populations connected by gene flow and described with simple\ndeterministic models. Under such assumptions, an entire species could be\naltered by releasing a single individual carrying an invasive gene drive, such\nas a standard homing drive. While this remains a theoretical possibility, gene\ndrive spread in natural populations is more complex and merits a more realistic\nassessment. The fate of any gene drive released in a population would be\ninextricably linked to the ecology of the population. Given the uncertainty\noften involved in ecological assessment of natural populations, understanding\nthe sensitivity of gene drive spread to important ecological factors is\ncritical. Here we review how different forms of density-dependence, spatial\nheterogeneity and mating behaviors can impact the spread of self-sustaining\ngene drives. We highlight specific aspects of gene drive dynamics and the\ntarget populations that need further research.",
    "authors": [
      "Sumit Dhole",
      "Alun L Lloyd",
      "Fred Gould"
    ],
    "publication_date": "2020-05-04T20:44:43Z",
    "arxiv_id": "http://arxiv.org/abs/2005.01838v1",
    "download_url": "http://arxiv.org/abs/2005.01838v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fluctuation spectra of large random dynamical systems reveal hidden\n  structure in ecological networks",
    "abstract": "Understanding the relationship between complexity and stability in large\ndynamical systems -- such as ecosystems -- remains a key open question in\ncomplexity theory which has inspired a rich body of work developed over more\nthan fifty years. The vast majority of this theory addresses asymptotic linear\nstability around equilibrium points, but the idea of `stability' in fact has\nother uses in the empirical ecological literature. The important notion of\n`temporal stability' describes the character of fluctuations in population\ndynamics, driven by intrinsic or extrinsic noise. Here we apply tools from\nrandom matrix theory to the problem of temporal stability, deriving analytical\npredictions for the fluctuation spectra of complex ecological networks. We show\nthat different network structures leave distinct signatures in the spectrum of\nfluctuations, and demonstrate the application of our theory to the analysis\necological timeseries data of plankton abundances.",
    "authors": [
      "Yvonne Krumbeck",
      "Qian Yang",
      "George W. A. Constable",
      "Tim Rogers"
    ],
    "publication_date": "2020-11-10T15:09:57Z",
    "arxiv_id": "http://arxiv.org/abs/2011.05140v2",
    "download_url": "http://arxiv.org/abs/2011.05140v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Synchronization within synchronization: transients and intermittency in\n  ecological networks",
    "abstract": "Transients are fundamental to ecological systems with significant\nimplications to management, conservation, and biological control. We uncover a\ntype of transient synchronization behavior in spatial ecological networks whose\nlocal dynamics are of the chaotic, predator-prey type. In the parameter regime\nwhere there is phase synchronization among all the patches, complete\nsynchronization (i.e., synchronization in both phase and amplitude) can arise\nin certain pairs of patches as determined by the network symmetry - henceforth\nthe phenomenon of \"synchronization within synchronization.\" Distinct patterns\nof complete synchronization coexist but, due to intrinsic instability or noise,\neach pattern is a transient and there is random, intermittent switching among\nthe patterns in the course of time evolution. The probability distribution of\nthe transient time is found to follow an algebraic scaling law with a divergent\naverage transient lifetime. Based on symmetry considerations, we develop a\nstability analysis to understand these phenomena. The general principle of\nsymmetry can also be exploited to explain previously discovered,\ncounterintuitive synchronization behaviors in ecological networks.",
    "authors": [
      "Huawei Fan",
      "Ling-Wei Kong",
      "Xingang Wang",
      "Alan Hastings",
      "Ying-Cheng Lai"
    ],
    "publication_date": "2020-11-20T19:13:08Z",
    "arxiv_id": "http://arxiv.org/abs/2011.10597v1",
    "download_url": "http://arxiv.org/abs/2011.10597v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inference and model determination for Temperature-Driven non-linear\n  Ecological Models",
    "abstract": "This paper is concerned with a contemporary Bayesian approach to the effect\nof temperature on developmental rates. We develop statistical methods using\nrecent computational tools to model four commonly used ecological non-linear\nmathematical curves that describe arthropods' developmental rates. Such models\naddress the effect of temperature fluctuations on the developmental rate of\narthropods. In addition to the widely used Gaussian distributional assumption,\nwe also explore Inverse Gamma--based alternatives, which naturally accommodate\nadaptive variance fluctuation with temperature. Moreover, to overcome the\nassociated parameter indeterminacy in the case of no development, we suggest\nthe Zero Inflated Inverse Gamma model. The ecological models are compared\ngraphically via posterior predictive plots and quantitatively via Marginal\nlikelihood estimates and Information criteria values. Inference is performed\nusing the Stan software and we investigate the statistical and computational\nefficiency of its Hamiltonian Monte Carlo and Variational Inference methods. We\nexplore model uncertainty and use Bayesian Model Averaging framework for robust\nestimation of the key ecological parameters",
    "authors": [
      "Marios Kondakis",
      "Nikolaos Demiris",
      "Ioannis Ntzoufras",
      "Nikos E. Papanikolaou"
    ],
    "publication_date": "2021-04-30T15:11:58Z",
    "arxiv_id": "http://arxiv.org/abs/2104.15043v1",
    "download_url": "http://arxiv.org/abs/2104.15043v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Communication Layer for Integrated Sensors and Robotic ecology\n  Solutions to Ambient Intelligence",
    "abstract": "This paper presents a communication framework built to simplify the\nconstruction of robotic ecologies, i.e., networks of heterogeneous\ncomputational nodes interfaced with sensors, actuators, and mobile robots.\nBuilding integrated ambient intelligence (AmI) solutions out of such a wide\nrange of heterogeneous devices is a key requirement for a range of application\ndomains, such as home automation, logistic, security and Ambient Assisted\nLiving (AAL). This goal is challenging since these ecologies need to adapt to\nchanging environments and especially when they include tiny embedded devices\nwith limited computational resources. We discuss a number of requirements\ncharacterizing this type of systems and illustrate how they have been addressed\nin the design of the new communication framework. The most distinguishing\naspect of our frameworks is the transparency with which the same communication\nfeatures are offered across heterogeneous programming languages and operating\nsystems under a consistent API. Finally, we illustrate how the framework has\nbeen used to bind together and to support the operations of all the components\nof adaptive robotic ecologies in two real-world test-beds.",
    "authors": [
      "Giuseppe Amato",
      "Stefano Chessa",
      "Mauro Dragone",
      "Claudio Gennaro",
      "Claudio Vairo"
    ],
    "publication_date": "2021-06-09T14:24:18Z",
    "arxiv_id": "http://arxiv.org/abs/2106.05100v1",
    "download_url": "http://arxiv.org/abs/2106.05100v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling cooperation and competition in biological communities",
    "abstract": "The far-reaching consequences of ecological interactions in the dynamics of\nbiological communities remain an intriguing subject. For decades, competition\nhas been a cornerstone in ecological processes, but mounting evidence shows\nthat cooperation does also contribute to the structure of biological\ncommunities. Here, we propose a simple deterministic model for the study of the\neffects of facilitation and competition in the dynamics of such systems. The\nsimultaneous inclusion of both effects produces rich dynamics and captures the\ncontext-dependence observed in the formation of ecological communities. The\napproach reproduces relevant aspects of primary and secondary plant succession,\nthe effect invasive species, and the survival of rare species. The model also\ntakes into account the role of the ecological priority effect and stress the\ncrucial role of facilitation in conservation efforts and species coexistence.",
    "authors": [
      "F. Meloni",
      "G. Nakamura",
      "B. Grammaticos",
      "A. S. Martinez",
      "M. Badoual"
    ],
    "publication_date": "2021-07-16T14:54:09Z",
    "arxiv_id": "http://arxiv.org/abs/2107.07938v1",
    "download_url": "http://arxiv.org/abs/2107.07938v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prevalence of mutualism in a simple model of microbial co-evolution",
    "abstract": "Evolutionary transitions among ecological interactions are widely known,\nalthough their detailed dynamics remain absent for most population models.\nAdaptive dynamics has been used to illustrate how the parameters of population\nmodels might shift through evolution, but within an ecological regime. Here we\nuse adaptive dynamics combined with a generalised logistic model of population\ndynamics to show that transitions of ecological interactions might appear as a\nconsequence of evolution. To this purpose we introduce a two-microbial toy\nmodel in which population parameters are determined by a bookkeeping of\nresources taken from (and excreted to) the environment, as well as from the\nbyproducts of the other species. Despite its simplicity, this model exhibits\nall kinds of potential ecological transitions, some of which resemble those\nfound in nature. Overall, the model shows a clear trend toward the emergence of\nmutualism.",
    "authors": [
      "Luciano Stucchi",
      "Javier Galeano",
      "Juan Manuel Pastor",
      "José María Iriondo",
      "José A. Cuesta"
    ],
    "publication_date": "2022-09-20T20:00:34Z",
    "arxiv_id": "http://arxiv.org/abs/2209.09971v2",
    "download_url": "http://arxiv.org/abs/2209.09971v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Disentangling the structure of ecological bipartite networks from\n  observation processes",
    "abstract": "The structure of a bipartite interaction network can be described by\nproviding a clustering for each of the two types of nodes. Such clusterings are\noutputted by fitting a Latent Block Model (LBM) on an observed network that\ncomes from a sampling of species interactions in the field. However, the\nsampling is limited and possibly uneven. This may jeopardize the fit of the LBM\nand then the description of the structure of the network by detecting\nstructures which result from the sampling and not from actual underlying\necological phenomena. If the observed interaction network consists of a\nweighted bipartite network where the number of observed interactions between\ntwo species is available, the sampling efforts for all species can be estimated\nand used to correct the LBM fit. We propose to combine an observation model\nthat accounts for sampling and an LBM for describing the structure of\nunderlying possible ecological interactions. We develop an original inference\nprocedure for this model, the efficiency of which is demonstrated on simulation\nstudies. The pratical interest in ecology of our model is highlighted on a\nlarge dataset of plant-pollinator network.",
    "authors": [
      "Emre Anakok",
      "Pierre Barbillon",
      "Colin Fontaine",
      "Elisa Thebault"
    ],
    "publication_date": "2022-11-29T16:46:08Z",
    "arxiv_id": "http://arxiv.org/abs/2211.16364v3",
    "download_url": "http://arxiv.org/abs/2211.16364v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data as an economic good, data as a commons, and data governance",
    "abstract": "This paper provides a systematic and critical review of the economics\nliterature on data as an economic good and draws lessons for data governance.\nWe conclude that focusing on data as an economic good in governance efforts is\nhardwired to only result in more data production and cannot deliver other\nsocietal goals contrary to what is often claimed in the literature and policy.\nData governance is often a red herring which distracts from other digital\nproblems. The governance of digital society cannot rely exclusively on\ndata-centric economic models. We review the literatures and the underlying\nempirical and political claims concerning data commons. While commons thinking\nis useful to frame digital problems in terms of ecologies, it has important\nlimitations. We propose a political-ecological approach to governing the\ndigital society, defined by ecological thinking about governance problems and\nthe awareness of the political nature of framing the problems and mapping their\necological makeup.",
    "authors": [
      "Nadezhda Purtova",
      "Gijs van Maanen"
    ],
    "publication_date": "2022-12-20T13:40:57Z",
    "arxiv_id": "http://arxiv.org/abs/2212.10244v2",
    "download_url": "http://arxiv.org/abs/2212.10244v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reinforcement Learning for Control of Evolutionary and Ecological\n  Processes",
    "abstract": "As Evolutionary Dynamics moves from the realm of theory into application,\nalgorithms are needed to move beyond simple models. Yet few such methods exist\nin the literature. Ecological and physiological factors are known to be central\nto evolution in realistic contexts, but accounting for them generally renders\nproblems intractable to existing methods. We introduce a formulation of\nevolutionary games which accounts for ecology and physiology by modeling both\nas computations and use this to analyze the problem of directed evolution via\nmethods from Reinforcement Learning. This combination enables us to develop\nfirst-of-their-kind results on the algorithmic problem of learning to control\nan evolving population of cells. We prove a complexity bound on\neco-evolutionary control in situations with limited prior knowledge of cellular\nphysiology or ecology, give the first results on the most general version of\nthe mathematical problem of directed evolution, and establish a new link\nbetween AI and biology.",
    "authors": [
      "Bryce Allen Bagley",
      "Navin Khoshnan",
      "Claudia K Petritsch"
    ],
    "publication_date": "2023-05-05T07:45:28Z",
    "arxiv_id": "http://arxiv.org/abs/2305.03340v3",
    "download_url": "http://arxiv.org/abs/2305.03340v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deep-learning-powered data analysis in plankton ecology",
    "abstract": "The implementation of deep learning algorithms has brought new perspectives\nto plankton ecology. Emerging as an alternative approach to established\nmethods, deep learning offers objective schemes to investigate plankton\norganisms in diverse environments. We provide an overview of\ndeep-learning-based methods including detection and classification of phyto-\nand zooplankton images, foraging and swimming behaviour analysis, and finally\necological modelling. Deep learning has the potential to speed up the analysis\nand reduce the human experimental bias, thus enabling data acquisition at\nrelevant temporal and spatial scales with improved reproducibility. We also\ndiscuss shortcomings and show how deep learning architectures have evolved to\nmitigate imprecise readouts. Finally, we suggest opportunities where deep\nlearning is particularly likely to catalyze plankton research. The examples are\naccompanied by detailed tutorials and code samples that allow readers to apply\nthe methods described in this review to their own data.",
    "authors": [
      "Harshith Bachimanchi",
      "Matthew I. M. Pinder",
      "Chloé Robert",
      "Pierre De Wit",
      "Jonathan Havenhand",
      "Alexandra Kinnby",
      "Daniel Midtvedt",
      "Erik Selander",
      "Giovanni Volpe"
    ],
    "publication_date": "2023-09-15T16:04:11Z",
    "arxiv_id": "http://arxiv.org/abs/2309.08500v1",
    "download_url": "http://arxiv.org/abs/2309.08500v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Novel community data in ecology -- properties and prospects",
    "abstract": "New technologies for acquiring biological information such as eDNA, acoustic\nor optical sensors, make it possible to generate spatial community observations\nat unprecedented scales. The potential of these novel community data to\nstandardize community observations at high spatial, temporal, and taxonomic\nresolution and at large spatial scale ('many rows and many columns') has been\nwidely discussed, but so far, there has been little integration of these data\nwith ecological models and theory. Here, we review these developments and\nhighlight emerging solutions, focusing on statistical methods for analyzing\nnovel community data, in particular joint species distribution models; the new\necological questions that can be answered with these data; and the potential\nimplications of these developments for policy and conservation.",
    "authors": [
      "Florian Hartig",
      "Nerea Abrego",
      "Alex Bush",
      "Jonathan M. Chase",
      "Gurutzeta Guillera-Arroita",
      "Mathew A. Leibold",
      "Otso Ovaskainen",
      "Loïc Pellissier",
      "Maximilian Pichler",
      "Giovanni Poggiato",
      "Laura Pollock",
      "Sara Si-Moussi",
      "Wilfried Thuiller",
      "Duarte S. Viana",
      "David I. Warton",
      "Damaris Zurell",
      "Douglas W. Yu"
    ],
    "publication_date": "2024-01-19T18:04:01Z",
    "arxiv_id": "http://arxiv.org/abs/2401.10860v1",
    "download_url": "http://arxiv.org/abs/2401.10860v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bipartite Graph Variational Auto-Encoder with Fair Latent Representation\n  to Account for Sampling Bias in Ecological Networks",
    "abstract": "We propose a method to represent bipartite networks using graph embeddings\ntailored to tackle the challenges of studying ecological networks, such as the\nones linking plants and pollinators, where many covariates need to be accounted\nfor, in particular to control for sampling bias. We adapt the variational graph\nauto-encoder approach to the bipartite case, which enables us to generate\nembeddings in a latent space where the two sets of nodes are positioned based\non their probability of connection. We translate the fairness framework\ncommonly considered in sociology in order to address sampling bias in ecology.\nBy incorporating the Hilbert-Schmidt independence criterion (HSIC) as an\nadditional penalty term in the loss we optimize, we ensure that the structure\nof the latent space is independent of continuous variables, which are related\nto the sampling process. Finally, we show how our approach can change our\nunderstanding of ecological networks when applied to the Spipoll data set, a\ncitizen science monitoring program of plant-pollinator interactions to which\nmany observers contribute, making it prone to sampling bias.",
    "authors": [
      "Emre Anakok",
      "Pierre Barbillon",
      "Colin Fontaine",
      "Elisa Thebault"
    ],
    "publication_date": "2024-03-04T13:12:02Z",
    "arxiv_id": "http://arxiv.org/abs/2403.02011v2",
    "download_url": "http://arxiv.org/abs/2403.02011v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Potential of Domain Adaptation in Machine Learning in Ecology and\n  Hydrology to Improve Model Extrapolability",
    "abstract": "Due to the heterogeneity of the global distribution of ecological and\nhydrological ground-truth observations, machine learning models can have\nlimited adaptability when applied to unknown locations, which is referred to as\nweak extrapolability. Domain adaptation techniques have been widely used in\nmachine learning domains such as image classification, which can improve the\nmodel generalization ability by adjusting the difference or inconsistency of\nthe domain distribution between the training and test sets. However, this\napproach has rarely been used explicitly in machine learning models in ecology\nand hydrology at the global scale, although these models have often been\nquestioned due to geographic extrapolability issues. This paper briefly\ndescribes the shortcomings of current machine learning models of ecology and\nhydrology in terms of the global representativeness of the distribution of\nobservations and the resulting limitations of the lack of extrapolability and\nsuggests that future related modelling efforts should consider the use of\ndomain adaptation techniques to improve extrapolability.",
    "authors": [
      "Haiyang Shi"
    ],
    "publication_date": "2024-03-17T20:23:06Z",
    "arxiv_id": "http://arxiv.org/abs/2403.11331v1",
    "download_url": "http://arxiv.org/abs/2403.11331v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The study of periphery uniqueness and balance in ecological networks",
    "abstract": "The study of ecological networks is crucial for modern conservation biology,\naddressing habitat fragmentation and biodiversity loss, especially in complex\nregions. These networks, including corridors, sources, and nodes, are key for\nspecies movement and ecosystem functioning. The Periphery Analysis Model (PAM)\nis introduced as a new approach to study the periphery of these networks,\nfocusing on peripheral nodes' role in environmental change response and network\nresilience. PAM, drawing from graph theory, complex network analysis, and\nlandscape ecology, uses the Periphery Uniqueness Index (PuI) and the Periphery\nBalance Index (PbI) to measure peripheral nodes' attributes and balance. It\nalso offers derived indices for a detailed understanding of the periphery's\ninfluence. By revealing the periphery's defining characteristics, PAM enhances\nknowledge of ecological networks' structural features, providing insights for\nbiodiversity, connectivity, and ecosystem health. The research encourages\nintegrating PAM into conservation strategies to inform policy for ecosystem\npreservation amid environmental challenges.",
    "authors": [
      "Shipeng Xu"
    ],
    "publication_date": "2024-04-06T15:30:42Z",
    "arxiv_id": "http://arxiv.org/abs/2404.04660v1",
    "download_url": "http://arxiv.org/abs/2404.04660v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Interdisciplinary Perspective of the Built-Environment Microbiome",
    "abstract": "The built environment provides an excellent setting for interdisciplinary\nresearch on the dynamics of microbial communities. The system is simplified\ncompared to many natural settings, and to some extent the entire environment\ncan be manipulated, from architectural design, to materials use, air flow,\nhuman traffic, and capacity to disrupt microbial communities through cleaning.\nHere we provide an overview of the ecology of the microbiome in the built\nenvironment. We address niche space and refugia, population and community\n(metagenomic) dynamics, spatial ecology within a building, including the major\nmicrobial transmission mechanisms, as well as evolution. We also address the\nlandscape ecology connecting microbiomes between physically separated\nbuildings. At each stage we pay particular attention to the actual and\npotential interface between disciplines, such as ecology, epidemiology,\nmaterials science, and human social behavior. We end by identifying some\nopportunities for future interdisciplinary research on the microbiome of the\nbuilt environment.",
    "authors": [
      "John S. McAlister",
      "Michael J. Blum",
      "Yana Bromberg",
      "Nina H. Fefferman",
      "Qiang He",
      "Eric Lofgren",
      "Debra L. Miller",
      "Courtney Schreiner",
      "K. Selcuk Candan",
      "Heather Szabo-Rogers",
      "J. Michael Reed"
    ],
    "publication_date": "2024-05-04T07:31:55Z",
    "arxiv_id": "http://arxiv.org/abs/2405.02593v1",
    "download_url": "http://arxiv.org/abs/2405.02593v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling of New Energy Vehicles' Impact on Urban Ecology Focusing on\n  Behavior",
    "abstract": "The surging demand for new energy vehicles is driven by the imperative to\nconserve energy, reduce emissions, and enhance the ecological ambiance. By\nconducting behavioral analysis and mining usage patterns of new energy\nvehicles, particular patterns can be identified. For instance, overloading the\nbattery, operating with low battery power, and driving at excessive speeds can\nall detrimentally affect the battery's performance. To assess the impact of\nsuch driving behavior on the urban ecology, an environmental computational\nmodeling method has been proposed to simulate the interaction between new\nenergy vehicles and the environment. To extend the time series data of the\nvehicle's entire life cycle and the ecological environment within the model\nsequence data, the LSTM model with Bayesian optimizer is utilized for\nsimulation. The analysis revealed the detrimental effects of poor driving\nbehavior on the environment.",
    "authors": [
      "Run-Xuan Tang"
    ],
    "publication_date": "2024-06-06T14:03:52Z",
    "arxiv_id": "http://arxiv.org/abs/2406.06602v1",
    "download_url": "http://arxiv.org/abs/2406.06602v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhancing Ecological Monitoring with Multi-Objective Optimization: A\n  Novel Dataset and Methodology for Segmentation Algorithms",
    "abstract": "We introduce a unique semantic segmentation dataset of 6,096 high-resolution\naerial images capturing indigenous and invasive grass species in Bega Valley,\nNew South Wales, Australia, designed to address the underrepresented domain of\necological data in the computer vision community. This dataset presents a\nchallenging task due to the overlap and distribution of grass species, which is\ncritical for advancing models in ecological and agronomical applications. Our\nstudy features a homotopy-based multi-objective fine-tuning approach that\nbalances segmentation accuracy and contextual consistency, applicable to\nvarious models. By integrating DiceCELoss for pixel-wise classification and a\nsmoothness loss for spatial coherence, this method evolves during training to\nenhance robustness against noisy data. Performance baselines are established\nthrough a case study on the Segment Anything Model (SAM), demonstrating its\neffectiveness. Our annotation methodology, emphasizing pen size, zoom control,\nand memory management, ensures high-quality dataset creation. The dataset and\ncode will be made publicly available, aiming to drive research in computer\nvision, machine learning, and ecological studies, advancing environmental\nmonitoring and sustainable development.",
    "authors": [
      "Sophia J. Abraham",
      "Jin Huang",
      "Brandon RichardWebster",
      "Michael Milford",
      "Jonathan D. Hauenstein",
      "Walter Scheirer"
    ],
    "publication_date": "2024-07-25T18:27:27Z",
    "arxiv_id": "http://arxiv.org/abs/2408.06356v1",
    "download_url": "http://arxiv.org/abs/2408.06356v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "\"Benefit Game: Alien Seaweed Swarms\" -- Real-time Gamification of\n  Digital Seaweed Ecology",
    "abstract": "\"Benefit Game: Alien Seaweed Swarms\" combines artificial life art and\ninteractive game with installation to explore the impact of human activity on\nfragile seaweed ecosystems. The project aims to promote ecological\nconsciousness by creating a balance in digital seaweed ecologies. Inspired by\nthe real species \"Laminaria saccharina\", the author employs Procedural Content\nGeneration via Machine Learning technology to generate variations of virtual\nseaweeds and symbiotic fungi. The audience can explore the consequences of\nhuman activities through gameplay and observe the ecosystem's feedback on the\nbenefits and risks of seaweed aquaculture. This Benefit Game offers dynamic and\nreal-time responsive artificial seaweed ecosystems for an interactive\nexperience that enhances ecological consciousness.",
    "authors": [
      "Dan-Lu Fei",
      "Zi-Wei Wu",
      "Kang Zhang"
    ],
    "publication_date": "2024-08-30T10:36:11Z",
    "arxiv_id": "http://arxiv.org/abs/2408.17186v1",
    "download_url": "http://arxiv.org/abs/2408.17186v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Recovering complex ecological dynamics from time series using\n  state-space universal dynamic equations",
    "abstract": "Ecological systems often exhibit complex nonlinear dynamics like\noscillations, chaos, and regime shifts. Universal dynamic equations have shown\npromise in modeling complex dynamics by combining known functional forms with\nneural networks that represent unknown relationships. However, these methods do\nnot yet accommodate the forms of uncertainty common to ecological datasets. To\naddress this limitation, we developed state-space universal dynamic equations\nby combining universal differential equations with a state-space modeling\nframework, accounting for uncertainty. We tested this framework on two\nsimulated and two empirical case studies and found that this method can recover\nnonlinear biological interactions that produce complex behaviors, including\nchaos and regime shifts. Their forecasting performance is context-dependent,\nwith the best performance being achieved on chaotic and oscillating time\nseries. This new approach leveraging both ecological theory and data-driven\nmachine learning offers a promising new way to make accurate and useful\npredictions of ecosystem change.",
    "authors": [
      "Jack H. Buckner",
      "Zechariah D. Meunier",
      "Jorge Arroyo-Esquivel",
      "Nathan Fitzpatrick",
      "Ariel Greiner",
      "Lisa C. McManus",
      "James R. Watson"
    ],
    "publication_date": "2024-10-11T20:14:33Z",
    "arxiv_id": "http://arxiv.org/abs/2410.09233v1",
    "download_url": "http://arxiv.org/abs/2410.09233v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]