[
  {
    "title": "A Unified Model of Codon Reassignment in Alternative Genetic Codes",
    "abstract": "Many modified genetic codes are found in specific genomes in which one or more codons have been reassigned to a different amino acid from that in the canonical code. We present a model that unifies four possible mechanisms for reassignment, based on the observation that reassignment involves a gain and a loss. The loss could be the deletion or loss of function of a tRNA or release factor. The gain could be the gain of a new type of tRNA for the reassigned codon, or the gain of function of an existing tRNA due to a mutation or a base modification. In the codon disappearance mechanism, the codon disappears from the genome during the period of reassignment. In the other mechanisms, the codon does not disappear. In the ambiguous intermediate mechanism, the gain precedes the loss; in the unassigned codon mechanism, the loss precedes the gain; and in the compensatory change mechanism, the loss and gain spread through the population simultaneously. We present simulations of the gain-loss model and demonstrate that all four mechanisms are possible. The frequencies of the different mechanisms are influenced by selection strengths, number of codons undergoing reassignment, directional mutation pressure and the possibility of selection for reduced genome size.",
    "authors": [
      "Supratim Sengupta",
      "Paul G. Higgs"
    ],
    "publication_date": "2004-10-19T22:12:54Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0410022v3",
    "download_url": "https://arxiv.org/abs/q-bio/0410022v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The genetic architecture of adaptations to high altitude in Ethiopia",
    "abstract": "Although hypoxia is a major stress on physiological processes, several human populations have survived for millennia at high altitudes, suggesting that they have adapted to hypoxic conditions. This hypothesis was recently corroborated by studies of Tibetan highlanders, which showed that polymorphisms in candidate genes show signatures of natural selection as well as well-replicated association signals for variation in hemoglobin levels. We extended genomic analysis to two Ethiopian ethnic groups: Amhara and Oromo. For each ethnic group, we sampled low and high altitude residents, thus allowing genetic and phenotypic comparisons across altitudes and across ethnic groups. Genome-wide SNP genotype data were collected in these samples by using Illumina arrays. We find that variants associated with hemoglobin variation among Tibetans or other variants at the same loci do not influence the trait in Ethiopians. However, in the Amhara, SNP rs10803083 is associated with hemoglobin levels at genome-wide levels of significance. No significant genotype association was observed for oxygen saturation levels in either ethnic group. Approaches based on allele frequency divergence did not detect outliers in candidate hypoxia genes, but the most differentiated variants between high- and lowlanders have a clear role in pathogen defense. Interestingly, a significant excess of allele frequency divergence was consistently detected for genes involved in cell cycle control, DNA damage and repair, thus pointing to new pathways for high altitude adaptations. Finally, a comparison of CpG methylation levels between high- and lowlanders found several significant signals at individual genes in the Oromo.",
    "authors": [
      "Gorka Alkorta-Aranburu",
      "Cynthia M. Beall",
      "David B. Witonsky",
      "Amha Gebremedhin",
      "Jonathan K. Pritchard",
      "Anna Di Rienzo"
    ],
    "publication_date": "2012-11-13T17:15:58Z",
    "arxiv_id": "http://arxiv.org/abs/1211.3053v1",
    "download_url": "https://arxiv.org/abs/1211.3053v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Population genetics models of local ancestry",
    "abstract": "Migrations have played an important role in shaping the genetic diversity of human populations. Understanding genomic data thus requires careful modeling of historical gene flow. Here we consider the effect of relatively recent population structure and gene flow, and interpret genomes of individuals that have ancestry from multiple source populations as mosaics of segments originating from each population. We propose general and tractable models for describing the evolution of these patterns of local ancestry and their impact on genetic diversity. We focus on the length distribution of continuous ancestry tracts, and the variance in total ancestry proportions among individuals. The proposed models offer improved agreement with Wright-Fisher simulation data when compared to state-of-the art models, and can be used to infer various demographic parameters in gene flow models. Considering HapMap African-American (ASW) data, we find that a model with two distinct phases of `European' gene flow significantly improves the modeling of both tract lengths and ancestry variances.",
    "authors": [
      "Simon Gravel"
    ],
    "publication_date": "2012-02-22T02:58:18Z",
    "arxiv_id": "http://arxiv.org/abs/1202.4811v2",
    "download_url": "https://arxiv.org/abs/1202.4811v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Matrix genetics, part 3: the evolution of the genetic code from the viewpoint of the genetic octave Yin-Yang-algebra",
    "abstract": "The set of known dialects of the genetic code (GC) is analyzed from the viewpoint of the genetic octave Yin-Yang-algebra. This algebra was described in the previous author's publications. The algebra was discovered on the basis of structural features of the GC in the matrix form of its presentation (\"matrix genetics\"). The octave Yin-Yang-algebra is considered as the pre-code or as the model of the GC. From the viewpoint of this algebraic model, for example, the sets of 20 amino acids and of 64 triplets consist of sub-sets of \"male\", \"female\" and \"androgynous\" molecules, etc. This algebra permits to reveal hidden peculiarities of the structure and evolution of the GC and to propose the conception of \"sexual\" relationships among genetic molecules. The first results of the analysis of the GC systems from such algebraic viewpoint say about the close connection between evolution of the GC and this algebra. They include 8 evolutionary rules of the dialects of the GC. The evolution of the GC is appeared as the struggle between male and female beginnings. The hypothesis about new biophysical factor of \"sexual\" interactions among genetic molecules is put forward. The matrix forms of presentation of elements of the genetic octave Yin-Yang-algebra are connected with Hadamard matrices by means of the simple U-algorithm. Hadamard matrices play a significant role in the theory of quantum computers, in particular. It gives new opportunities for possible understanding the GC systems as quantum computer systems. Revealed algebraic properties of the GC permit to put forward the problem of algebraization of bioinformatics on the basis of the algebras of the GC. Our investigation is connected with the question: what is life from the viewpoint of algebra? The algebraic version of the origin of the GC is discussed.",
    "authors": [
      "Sergey V. Petoukhov"
    ],
    "publication_date": "2008-05-30T08:25:22Z",
    "arxiv_id": "http://arxiv.org/abs/0805.4692v1",
    "download_url": "https://arxiv.org/abs/0805.4692v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "OPENMENDEL: A Cooperative Programming Project for Statistical Genetics",
    "abstract": "Statistical methods for genomewide association studies (GWAS) continue to improve. However, the increasing volume and variety of genetic and genomic data make computational speed and ease of data manipulation mandatory in future software. In our view, a collaborative effort of statistical geneticists is required to develop open source software targeted to genetic epidemiology. Our attempt to meet this need is called the OPENMENDELproject (https://openmendel.github.io). It aims to (1) enable interactive and reproducible analyses with informative intermediate results, (2) scale to big data analytics, (3) embrace parallel and distributed computing, (4) adapt to rapid hardware evolution, (5) allow cloud computing, (6) allow integration of varied genetic data types, and (7) foster easy communication between clinicians, geneticists, statisticians, and computer scientists. This article reviews and makes recommendations to the genetic epidemiology community in the context of the OPENMENDEL project.",
    "authors": [
      "Hua Zhou",
      "Janet S. Sinsheimer",
      "Christopher A. German",
      "Sarah S. Ji",
      "Douglas M. Bates",
      "Benjamin B. Chu",
      "Kevin L. Keys",
      "Juhyun Kim",
      "Seyoon Ko",
      "Gordon D. Mosher",
      "Jeanette C. Papp",
      "Eric M. Sobel",
      "Jing Zhai",
      "Jin J. Zhou",
      "Kenneth Lange"
    ],
    "publication_date": "2019-02-14T02:09:32Z",
    "arxiv_id": "http://arxiv.org/abs/1902.05189v1",
    "download_url": "https://arxiv.org/abs/1902.05189v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic variant selection: learning across traits and sites",
    "abstract": "We consider resequencing studies of associated loci and the problem of prioritizing sequence variants for functional follow-up. Working within the multivariate linear regression framework helps us to account for correlation across variants, and adopting a Bayesian approach naturally leads to posterior probabilities that incorporate all information about the variants' function. We describe two novel prior distributions that facilitate learning the role of each variant by borrowing evidence across phenotypes and across mutations in the same gene. We illustrate their potential advantages with simulations and re-analyzing a dataset of sequencing variants.",
    "authors": [
      "Laurel Stell",
      "Chiara Sabatti"
    ],
    "publication_date": "2015-04-03T22:02:37Z",
    "arxiv_id": "http://arxiv.org/abs/1504.00946v4",
    "download_url": "https://arxiv.org/abs/1504.00946v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Using Genetic Distance to Infer the Accuracy of Genomic Prediction",
    "abstract": "The prediction of phenotypic traits using high-density genomic data has many applications such as the selection of plants and animals of commercial interest; and it is expected to play an increasing role in medical diagnostics. Statistical models used for this task are usually tested using cross-validation, which implicitly assumes that new individuals (whose phenotypes we would like to predict) originate from the same population the genomic prediction model is trained on. In this paper we propose an approach based on clustering and resampling to investigate the effect of increasing genetic distance between training and target populations when predicting quantitative traits. This is important for plant and animal genetics, where genomic selection programs rely on the precision of predictions in future rounds of breeding. Therefore, estimating how quickly predictive accuracy decays is important in deciding which training population to use and how often the model has to be recalibrated. We find that the correlation between true and predicted values decays approximately linearly with respect to either $\\F$ or mean kinship between the training and the target populations. We illustrate this relationship using simulations and a collection of data sets from mice, wheat and human genetics.",
    "authors": [
      "Marco Scutari",
      "Ian Mackay",
      "David Balding"
    ],
    "publication_date": "2015-09-01T17:43:17Z",
    "arxiv_id": "http://arxiv.org/abs/1509.00415v4",
    "download_url": "https://arxiv.org/abs/1509.00415v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An accurate model for genetic hitch-hiking",
    "abstract": "We suggest a simple deterministic approximation for the growth of the favoured-allele frequency during a selective sweep. Using this approximation we introduce an accurate model for genetic hitch-hiking. Only when Ns < 10 (N is the population size and s denotes the selection coefficient), are discrepancies between our approximation and direct numerical simulations of a Moran model noticeable. Our model describes the gene genealogies of a contiguous segment of neutral loci close to the selected one, and it does not assume that the selective sweep happens instantaneously. This enables us to compute SNP distributions on the neutral segment without bias.",
    "authors": [
      "A. Eriksson",
      "P. Fernstrom",
      "B. Mehlig",
      "S. Sagitov"
    ],
    "publication_date": "2007-05-16T12:37:39Z",
    "arxiv_id": "http://arxiv.org/abs/0705.2286v1",
    "download_url": "https://arxiv.org/abs/0705.2286v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multiple-line inference of selection on quantitative traits",
    "abstract": "Trait differences between species may be attributable to natural selection. However, quantifying the strength of evidence for selection acting on a particular trait is a difficult task. Here we develop a population-genetic test for selection acting on a quantitative trait which is based on multiple-line crosses. We show that using multiple lines increases both the power and the scope of selection inference. First, a test based on three or more lines detects selection with strongly increased statistical significance, and we show explicitly how the sensitivity of the test depends on the number of lines. Second, a multiple-line test allows to distinguish different lineage-specific selection scenarios. Our analytical results are complemented by extensive numerical simulations. We then apply the multiple-line test to QTL data on floral character traits in plant species of the Mimulus genus and on photoperiodic traits in different maize strains, where we find a signatures of lineage-specific selection not seen in a two-line test.",
    "authors": [
      "Nico Riedel",
      "Bhavin S. Khatri",
      "Michael Lässig",
      "Johannes Berg"
    ],
    "publication_date": "2014-05-07T14:10:29Z",
    "arxiv_id": "http://arxiv.org/abs/1405.1610v2",
    "download_url": "https://arxiv.org/abs/1405.1610v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effect of Genetic Variation in a Drosophila Model of Diabetes-Associated Misfolded Human Proinsulin",
    "abstract": "The identification and validation of gene-gene interactions is a major challenge in human studies. Here, we explore an approach for studying epistasis in humans using a Drosophila melanogaster model of neonatal diabetes mellitus. Expression of mutant preproinsulin, hINSC96Y, in the eye imaginal disc mimics the human disease activating conserved cell stress response pathways leading to cell death and reduction in eye area. Dominant-acting variants in wild-derived inbred lines from the Drosophila Genetics Reference Panel produce a continuous, highly heritable, distribution of eye degeneration phenotypes. A genome-wide association study (GWAS) in 154 sequenced lines identified 29 candidate SNPs in 16 loci with P < 10-5 including one SNP in an intron of the gene sulfateless (sfl) which exceeded a conservative genome-wide significance threshold of P = 0.05 level (-log10 P > 7.62). RNAi knock-downs of sfl enhanced the eye degeneration phenotype in a mutant-hINS-dependent manner. sfl encodes a protein required for sulfation of the glycosaminoglycan, heparan sulfate. Two additional genes in the heparan sulfate (HS) biosynthetic pathway (tout velu, ttv and brother of tout velu, botv) also modified the eye phenotype, suggesting a link between HS-modified proteins and cellular responses to misfolded proteins. Finally, intronic variants marking the QTL were associated with decreased sfl expression, a result consistent with that predicted by RNAi studies. The ability to create a model of human genetic disease in the fly, map a QTL by GWAS to a specific gene (and noncoding variant), validate its contribution to disease with available genetic resources, and experimentally link the variant to a molecular mechanism, demonstrate the many advantages Drosophila holds in determining the genetic underpinnings of human disease.",
    "authors": [
      "Bin Z. He",
      "Michael Z. Ludwig",
      "Desiree A. Dickerson",
      "Levi Barse",
      "Bharath Arun",
      "Soo Young Park",
      "Natalia A. Tamarina",
      "Scott B. Selleck",
      "Patricia Wittkopp",
      "Graeme I. Bell",
      "Martin Kreitman"
    ],
    "publication_date": "2013-05-23T05:54:09Z",
    "arxiv_id": "http://arxiv.org/abs/1305.5319v2",
    "download_url": "https://arxiv.org/abs/1305.5319v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multilevel Modeling with Structured Penalties for Classification from Imaging Genetics data",
    "abstract": "In this paper, we propose a framework for automatic classification of patients from multimodal genetic and brain imaging data by optimally combining them. Additive models with unadapted penalties (such as the classical group lasso penalty or $L_1$-multiple kernel learning) treat all modalities in the same manner and can result in undesirable elimination of specific modalities when their contributions are unbalanced. To overcome this limitation, we introduce a multilevel model that combines imaging and genetics and that considers joint effects between these two modalities for diagnosis prediction. Furthermore, we propose a framework allowing to combine several penalties taking into account the structure of the different types of data, such as a group lasso penalty over the genetic modality and a $L_2$-penalty on imaging modalities. Finally , we propose a fast optimization algorithm, based on a proximal gradient method. The model has been evaluated on genetic (single nucleotide polymorphisms-SNP) and imaging (anatomical MRI measures) data from the ADNI database, and compared to additive models. It exhibits good performances in AD diagnosis; and at the same time, reveals relationships between genes, brain regions and the disease status.",
    "authors": [
      "Pascal Lu",
      "Olivier Colliot"
    ],
    "publication_date": "2017-10-10T14:39:18Z",
    "arxiv_id": "http://arxiv.org/abs/1710.03627v1",
    "download_url": "https://arxiv.org/abs/1710.03627v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predictive Modeling of Anatomy with Genetic and Clinical Data",
    "abstract": "We present a semi-parametric generative model for predicting anatomy of a patient in subsequent scans following a single baseline image. Such predictive modeling promises to facilitate novel analyses in both voxel-level studies and longitudinal biomarker evaluation. We capture anatomical change through a combination of population-wide regression and a non-parametric model of the subject's health based on individual genetic and clinical indicators. In contrast to classical correlation and longitudinal analysis, we focus on predicting new observations from a single subject observation. We demonstrate prediction of follow-up anatomical scans in the ADNI cohort, and illustrate a novel analysis approach that compares a patient's scans to the predicted subject-specific healthy anatomical trajectory. The code is available at https://github.com/adalca/voxelorb.",
    "authors": [
      "Adrian V. Dalca",
      "Ramesh Sridharan",
      "Mert R. Sabuncu",
      "Polina Golland"
    ],
    "publication_date": "2020-10-09T18:30:15Z",
    "arxiv_id": "http://arxiv.org/abs/2010.04757v1",
    "download_url": "https://arxiv.org/abs/2010.04757v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The maintenance of sex in bacteria is ensured by its potential to reload genes",
    "abstract": "Why sex is maintained in nature is a fundamental question in biology. Natural genetic transformation (NGT) is a sexual process by which bacteria actively take up exogenous DNA and use it to replace homologous chromosomal sequences. As it has been demonstrated, the role of NGT in repairing deleterious mutations under constant selection is insufficient for its survival, and the lack of other viable explanations have left no alternative except that DNA uptake provides nucleotides for food. Here we develop a novel simulation approach for the long-term dynamics of genome organization (involving the loss and acquisition of genes) in a bacterial species consisting of a large number of spatially distinct populations subject to independently fluctuating ecological conditions. Our results show that in the presence of weak inter-population migration NGT is able to subsist as a mechanism to reload locally lost, intermittently selected genes from the collective gene pool of the species through DNA uptake from migrants. Reloading genes and combining them with those in locally adapted genomes allow individual cells to re-adapt faster to environmental changes. The machinery of transformation survives under a wide range of model parameters readily encompassing real-world biological conditions. These findings imply that the primary role of NGT is not to serve the cell with food, but to provide homologous sequences for restoring genes that have disappeared from or become degraded in the local population.",
    "authors": [
      "Gergely J. Szollosi",
      "Imre Derenyi",
      "Tibor Vellai"
    ],
    "publication_date": "2006-09-28T12:36:26Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0609052v2",
    "download_url": "https://arxiv.org/abs/q-bio/0609052v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Many, One: Genetic Control of Prolificacy during Maize Domestication",
    "abstract": "A reduction in number and an increase in size of inflorescences is a common aspect of plant domestication. When maize was domesticated from teosinte, the number and arrangement of ears changed dramatically. Teosinte has long lateral branches that bear multiple small ears at their nodes and tassels at their tips. Maize has much shorter lateral branches that are tipped by a single large ear with no additional ears at the branch nodes. To investigate the genetic basis of this difference in prolificacy (the number of ears on a plant), we performed a genome-wide QTL scan. A large effect QTL for prolificacy (prol1.1) was detected on the short arm of chromosome one in a location that has previously been shown to influence multiple domestication traits. We fine-mapped prol1.1 to a 2.7 kb interval or causative region upstream of the grassy tillers1 gene, which encodes a homeodomain leucine zipper transcription factor. Tissue in situ hybridizations reveal that the maize allele of prol1.1 is associated with up-regulation of gt1 expression in the nodal plexus. Given that maize does not initiate secondary ear buds, the expression of gt1 in the nodal plexus in maize may suppress their initiation. Population genetic analyses indicate positive selection on the maize allele of prol1.1, causing a partial sweep that fixed the maize allele throughout most of domesticated maize. This work shows how a subtle cis-regulatory change in tissue specific gene expression altered plant architecture in a way that improved the harvestability of maize.",
    "authors": [
      "David M. Wills",
      "Clinton Whipple",
      "Shohei Takuno",
      "Lisa E. Kursel",
      "Laura M. Shannon",
      "Jeffrey Ross-Ibarra",
      "John F. Doebley"
    ],
    "publication_date": "2013-03-04T22:35:20Z",
    "arxiv_id": "http://arxiv.org/abs/1303.0882v1",
    "download_url": "https://arxiv.org/abs/1303.0882v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bayesian Test for Colocalisation Between Pairs of Genetic Association Studies Using Summary Statistics",
    "abstract": "Genetic association studies, in particular the genome-wide association study design, have provided a wealth of novel insights into the aetiology of a wide range of human diseases and traits. The next challenge consists of understanding the molecular basis of these associations. The integration of multiple association datasets, including gene expression datasets, can contribute to this goal. We have developed a novel statistical methodology to assess whether two association signals are consistent with a shared causal variant. An application is the integration of disease scans with expression quantitative trait locus (eQTL) studies, but any pair of GWAS datasets can be integrated in this framework. We demonstrate the value of the approach by reanalysing a gene expression dataset in 966 liver samples with a published meta-analysis of lipid traits including >100, 000 individuals of European ancestry. Combining all lipid biomarkers, our reanalysis supported 29 out of 38 reported colocalisation results with eQTLs and identified 14 new colocalisation results, highlighting the value of a formal statistical test. In two cases of reported eQTL-lipid pairs (IFT172, TBKBP1) for which our analysis suggests that the eQTL pattern is not consistent with the lipid association, we identify alternative colocalisation results with GCKR and KPNB1, indicating that these genes are more likely to be causal in these genomic intervals. A key feature of the method is the ability to derive the output statistics from single SNP summary statistics, hence making it possible to perform systematic meta-analysis type comparisons across multiple GWAS datasets (http://coloc.cs.ucl.ac.uk/coloc/). Our methodology provides information about candidate causal genes in associated intervals and has direct implications for the understanding of complex diseases and the design of drugs to target disease pathways.",
    "authors": [
      "Claudia Giambartolomei",
      "Damjan Vukcevic",
      "Eric E. Schadt",
      "Lude Franke",
      "Aroon D. Hingorani",
      "Chris Wallace",
      "Vincent Plagnol"
    ],
    "publication_date": "2013-05-17T09:22:02Z",
    "arxiv_id": "http://arxiv.org/abs/1305.4022v3",
    "download_url": "https://arxiv.org/abs/1305.4022v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Conditions for the Trivers-Willard hypothesis to be valid: A minimal population-genetic model",
    "abstract": "The very insightful Trivers-Willard hypothesis, proposed in the early 1970s, states that females in good physiological conditions are more likely to produce male offspring, when the variance of reproductive success amongst males is high. A number of studies, aimed at its experimental verification, have found adequate supportive evidence in its favour. Theoretical investigations, however, have been few, perhaps because formulating a population-genetic model for describing the Trivers-Willard hypothesis turns out to be surprisingly complex. The present study describes a minimal population genetic model to explore one specific scenario, viz. how is the preference for a male offspring by females in good condition altered when 'g', the proportion of such females in the population changes from a low to a high value. As expected, when the proportion of such females is low, i.e., for low values of 'g', the Trivers-Willard (TW) strategy goes to fixation against the equal investment strategy. This holds true up to gmax, a critical value of 'g', above which the two strategies coexist, but the proportion of the TW strategy steadily decreases as 'g' increases to unity. Similarly, when the effect of well-endowed males attaining disproportionately high number of matings is more pronounced, the TW strategy is more likely to go to fixation. Interestingly, the success of the TW strategy has a complex dependence on the variance in the physiological condition of females. If the difference in the two types of conditions is not large, TW strategy is favoured, and its success is more likely as the difference increases. However, beyond a critical value of the difference, the TW strategy is found to be less and less likely to succeed as the difference becomes larger. Possible reasons for these effects are discussed.",
    "authors": [
      "N. V. Joshi"
    ],
    "publication_date": "2007-08-15T06:00:45Z",
    "arxiv_id": "http://arxiv.org/abs/0708.1991v1",
    "download_url": "https://arxiv.org/abs/0708.1991v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A scaling law of multilevel evolution: how the balance between within- and among-collective evolution is determined",
    "abstract": "Numerous living systems are hierarchically organised, whereby replicating components are grouped into reproducing collectives -- e.g., organelles are grouped into cells, and cells are grouped into multicellular organisms. In such systems, evolution can operate at two levels: evolution among collectives, which tends to promote selfless cooperation among components within collectives (called altruism), and evolution within collectives, which tends to promote cheating among components within collectives. The balance between within- and among-collective evolution thus exerts profound impacts on the fitness of these systems. Here, we investigate how this balance depends on the size of a collective (denoted by $N$) and the mutation rate of components ($m$) through mathematical analyses and computer simulations of multiple population genetics models. We first confirm a previous result that increasing $N$ or $m$ accelerates within-collective evolution relative to among-collective evolution, thus promoting the evolution of cheating. Moreover, we show that when within- and among-collective evolution exactly balance each other out, the following scaling relation generally holds: $Nm^α$ is a constant, where scaling exponent $α$ depends on multiple parameters, such as the strength of selection and whether altruism is a binary or quantitative trait. This relation indicates that although $N$ and $m$ have quantitatively distinct impacts on the balance between within- and among-collective evolution, their impacts become identical if $m$ is scaled with a proper exponent. Our results thus provide a novel insight into conditions under which cheating or altruism evolves in hierarchically-organised replicating systems.",
    "authors": [
      "Nobuto Takeuchi",
      "Namiko Mitarai",
      "Kunihiko Kaneko"
    ],
    "publication_date": "2020-05-09T11:55:44Z",
    "arxiv_id": "http://arxiv.org/abs/2005.04421v4",
    "download_url": "https://arxiv.org/abs/2005.04421v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Experimental evolution of diverse Escherichia coli metabolic mutants identifies genetic loci for convergent adaptation of growth rate",
    "abstract": "Cell growth is determined by substrate availability and the cell's metabolic capacity to assimilate substrates into building blocks. Metabolic genes that determine growth rate may interact synergistically or antagonistically, and can accelerate or slow growth, depending on the genetic background and environmental conditions. We evolved a diverse set of Escherichia coli single-gene deletion mutants with a spectrum of growth rates and identified mutations that generally increase growth rate. Despite the metabolic differences between parent strains, mutations that enhanced growth largely mapped to the core transcription machinery, including the $β$ and $β'$ subunits of RNA polymerase (RNAP) and the transcription elongation factor, NusA. The structural segments of RNAP that determine enhanced growth have been previously implicated in antibiotic resistance and in the control of transcription elongation and pausing. We further developed a computational framework to characterize how the transcriptional changes that occur upon acquisition of these mutations affect growth rate across strains. Our experimental and computational results provide evidence for cases in which RNAP mutations shift the competitive balance between active transcription and gene silencing. This study demonstrates that mutations in specific regions of RNAP are a convergent adaptive solution that can enhance the growth rate of cells from distinct metabolic states.",
    "authors": [
      "Thomas P. Wytock",
      "Aretha Fiebig",
      "Jonathan W. Willett",
      "Julien Herrou",
      "Aleksandra Fergin",
      "Adilson E. Motter",
      "Sean Crosson"
    ],
    "publication_date": "2018-12-13T19:00:02Z",
    "arxiv_id": "http://arxiv.org/abs/1812.05623v1",
    "download_url": "https://arxiv.org/abs/1812.05623v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The equilibrium allele frequency distribution for a population with reproductive skew",
    "abstract": "We study the population genetics of two neutral alleles under reversible mutation in the Λ-processes, a population model that features a skewed offspring distribution. We describe the shape of the equilibrium allele frequency distribution as a function of the model parameters. We show that the mutation rates can be uniquely identified from the equilibrium distribution, but that the form of the offspring distribution itself cannot be uniquely identified. We also introduce an infinite-sites version of the Λ-process, and we use it to study how reproductive skew influences standing genetic diversity in a population. We derive asymptotic formulae for the expected number of segregating sizes as a function of sample size. We find that the Wright-Fisher model minimizes the equilibrium genetic diversity, for a given mutation rate and variance effective population size, compared to all other Λ-processes.",
    "authors": [
      "Ricky Der",
      "Joshua B. Plotkin"
    ],
    "publication_date": "2013-06-20T03:29:40Z",
    "arxiv_id": "http://arxiv.org/abs/1306.4747v1",
    "download_url": "https://arxiv.org/abs/1306.4747v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Beyond the exome: what's next in diagnostic testing for Mendelian conditions",
    "abstract": "Despite advances in clinical genetic testing, including the introduction of exome sequencing (ES), more than 50% of individuals with a suspected Mendelian condition lack a precise molecular diagnosis. Clinical evaluation is increasingly undertaken by specialists outside of clinical genetics, often occurring in a tiered fashion and typically ending after ES. The current diagnostic rate reflects multiple factors, including technical limitations, incomplete understanding of variant pathogenicity, missing genotype-phenotype associations, complex gene-environment interactions, and reporting differences between clinical labs. Maintaining a clear understanding of the rapidly evolving landscape of diagnostic tests beyond ES, and their limitations, presents a challenge for non-genetics professionals. Newer tests, such as short-read genome or RNA sequencing, can be challenging to order and emerging technologies, such as optical genome mapping and long-read DNA or RNA sequencing, are not available clinically. Furthermore, there is no clear guidance on the next best steps after inconclusive evaluation. Here, we review why a clinical genetic evaluation may be negative, discuss questions to be asked in this setting, and provide a framework for further investigation, including the advantages and disadvantages of new approaches that are nascent in the clinical sphere. We present a guide for the next best steps after inconclusive molecular testing based upon phenotype and prior evaluation, including when to consider referral to a consortium such as GREGoR, which is focused on elucidating the underlying cause of rare unsolved genetic disorders.",
    "authors": [
      "Monica H. Wojcik",
      "Chloe M. Reuter",
      "Shruti Marwaha",
      "Medhat Mahmoud",
      "Michael H. Duyzend",
      "Hayk Barseghyan",
      "Bo Yuan",
      "Philip M. Boone",
      "Emily E. Groopman",
      "Emmanuèle C. Délot",
      "Deepti Jain",
      "Alba Sanchis-Juan",
      "Genomics Research to Elucidate the Genetics of Rare Diseases",
      "Consortium",
      "Lea M. Starita",
      "Michael Talkowski",
      "Stephen B. Montgomery",
      "Michael J. Bamshad",
      "Jessica X. Chong",
      "Matthew T. Wheeler",
      "Seth I. Berger",
      "Anne O'Donnell-Luria",
      "Fritz J. Sedlazeck",
      "Danny E. Miller"
    ],
    "publication_date": "2023-01-18T08:14:31Z",
    "arxiv_id": "http://arxiv.org/abs/2301.07363v1",
    "download_url": "https://arxiv.org/abs/2301.07363v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Quantitative Test of Population Genetics Using Spatio-Genetic Patterns in Bacterial Colonies",
    "abstract": "It is widely accepted that population genetics theory is the cornerstone of evolutionary analyses. Empirical tests of the theory, however, are challenging because of the complex relationships between space, dispersal, and evolution. Critically, we lack quantitative validation of the spatial models of population genetics. Here we combine analytics, on and off-lattice simulations, and experiments with bacteria to perform quantitative tests of the theory. We study two bacterial species, the gut microbe Escherichia coli and the opportunistic pathogen Pseudomonas aeruginosa, and show that spatio-genetic patterns in colony biofilms of both species are accurately described by an extension of the one-dimensional stepping-stone model. We use one empirical measure, genetic diversity at the colony periphery, to parameterize our models and show that we can then accurately predict another key variable: the degree of short-range cell migration along an edge. Moreover, the model allows us to estimate other key parameters including effective population size (density) at the expansion frontier. While our experimental system is a simplification of natural microbial community, we argue it is a proof of principle that the spatial models of population genetics can quantitatively capture organismal evolution.",
    "authors": [
      "Kirill S. Korolev",
      "Joao B. Xavier",
      "David R. Nelson",
      "Kevin R. Foster"
    ],
    "publication_date": "2011-10-24T23:28:41Z",
    "arxiv_id": "http://arxiv.org/abs/1110.5376v1",
    "download_url": "https://arxiv.org/abs/1110.5376v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "GREGoR: Accelerating Genomics for Rare Diseases",
    "abstract": "Rare diseases are collectively common, affecting approximately one in twenty individuals worldwide. In recent years, rapid progress has been made in rare disease diagnostics due to advances in DNA sequencing, development of new computational and experimental approaches to prioritize genes and genetic variants, and increased global exchange of clinical and genetic data. However, more than half of individuals suspected to have a rare disease lack a genetic diagnosis. The Genomics Research to Elucidate the Genetics of Rare Diseases (GREGoR) Consortium was initiated to study thousands of challenging rare disease cases and families and apply, standardize, and evaluate emerging genomics technologies and analytics to accelerate their adoption in clinical practice. Further, all data generated, currently representing ~7500 individuals from ~3000 families, is rapidly made available to researchers worldwide via the Genomic Data Science Analysis, Visualization, and Informatics Lab-space (AnVIL) to catalyze global efforts to develop approaches for genetic diagnoses in rare diseases (https://gregorconsortium.org/data). The majority of these families have undergone prior clinical genetic testing but remained unsolved, with most being exome-negative. Here, we describe the collaborative research framework, datasets, and discoveries comprising GREGoR that will provide foundational resources and substrates for the future of rare disease genomics.",
    "authors": [
      "Moez Dawood",
      "Ben Heavner",
      "Marsha M. Wheeler",
      "Rachel A. Ungar",
      "Jonathan LoTempio",
      "Laurens Wiel",
      "Seth Berger",
      "Jonathan A. Bernstein",
      "Jessica X. Chong",
      "Emmanuèle C. Délot",
      "Evan E. Eichler",
      "Richard A. Gibbs",
      "James R. Lupski",
      "Ali Shojaie",
      "Michael E. Talkowski",
      "Alex H. Wagner",
      "Chia-Lin Wei",
      "Christopher Wellington",
      "Matthew T. Wheeler",
      "GREGoR Partner Members",
      "Claudia M. B. Carvalho",
      "Casey A. Gifford",
      "Susanne May",
      "Danny E. Miller",
      "Heidi L. Rehm",
      "Fritz J. Sedlazeck",
      "Eric Vilain",
      "Anne O'Donnell-Luria",
      "Jennifer E. Posey",
      "Lisa H. Chadwick",
      "Michael J. Bamshad",
      "Stephen B. Montgomery",
      "Genomics Research to Elucidate the Genetics of Rare Diseases",
      "Consortium"
    ],
    "publication_date": "2024-12-18T21:11:13Z",
    "arxiv_id": "http://arxiv.org/abs/2412.14338v1",
    "download_url": "https://arxiv.org/abs/2412.14338v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graph Learning for Inverse Landscape Genetics",
    "abstract": "The problem of inferring unknown graph edges from numerical data at a graph's nodes appears in many forms across machine learning. We study a version of this problem that arises in the field of \\emph{landscape genetics}, where genetic similarity between organisms living in a heterogeneous landscape is explained by a weighted graph that encodes the ease of dispersal through that landscape. Our main contribution is an efficient algorithm for \\emph{inverse landscape genetics}, which is the task of inferring this graph from measurements of genetic similarity at different locations (graph nodes). Inverse landscape genetics is important in discovering impediments to species dispersal that threaten biodiversity and long-term species survival. In particular, it is widely used to study the effects of climate change and human development. Drawing on influential work that models organism dispersal using graph \\emph{effective resistances} (McRae 2006), we reduce the inverse landscape genetics problem to that of inferring graph edges from noisy measurements of these resistances, which can be obtained from genetic similarity data. Building on the NeurIPS 2018 work of Hoskins et al. 2018 on learning edges in social networks, we develop an efficient first-order optimization method for solving this problem. Despite its non-convex nature, experiments on synthetic and real genetic data establish that our method provides fast and reliable convergence, significantly outperforming existing heuristics used in the field. By providing researchers with a powerful, general purpose algorithmic tool, we hope our work will have a positive impact on accelerating work on landscape genetics.",
    "authors": [
      "Prathamesh Dharangutte",
      "Christopher Musco"
    ],
    "publication_date": "2020-06-22T15:26:30Z",
    "arxiv_id": "http://arxiv.org/abs/2006.12334v3",
    "download_url": "https://arxiv.org/abs/2006.12334v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Quantitative Genetics of Human Disease: 1 Foundations",
    "abstract": "In this the first of an anticipated four paper series, fundamental results of quantitative genetics are presented from a first principles approach. While none of these results are in any sense new, they are presented in extended detail to precisely distinguish between definition and assumption, with a further emphasis on distinguishing quantities from their usual approximations. Terminology frequently encountered in the field of human genetic disease studies will be defined in terms of their quantitive genetics form. Methods for estimation of both quantitative genetics and the related human genetics quantities will be demonstrated. While practitioners in the field of human quantitative disease studies may find this work pedantic in detail, the principle target audience for this work is trainees reasonably familiar with population genetics theory, but with less experience in its application to human disease studies. We introduce much of this formalism because in later papers in this series, we demonstrate that common areas of confusion in human disease studies can be resolved be appealing directly to these formal definitions. The second paper in this series will discuss polygenic risk scores. The third paper will concern the question of \"missing\" heritability and the role interactions may play. The fourth paper will discuss sexually dimorphic disease and the potential role of the X chromosome.",
    "authors": [
      "David J. Cutler",
      "Kiana Jodeiry",
      "Andrew J. Bass",
      "Michael P. Epstein"
    ],
    "publication_date": "2023-08-29T19:42:18Z",
    "arxiv_id": "http://arxiv.org/abs/2308.15597v1",
    "download_url": "https://arxiv.org/abs/2308.15597v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integrated analysis of variants and pathways in genome-wide association studies using polygenic models of disease",
    "abstract": "Many common diseases are highly polygenic, modulated by a large number genetic factors with small effects on susceptibility to disease. These small effects are difficult to map reliably in genetic association studies. To address this problem, researchers have developed methods that aggregate information over sets of related genes, such as biological pathways, to identify gene sets that are enriched for genetic variants associated with disease. However, these methods fail to answer a key question: which genes and genetic variants are associated with disease risk? We develop a method based on sparse multiple regression that simultaneously identifies enriched pathways, and prioritizes the variants within these pathways, to locate additional variants associated with disease susceptibility. A central feature of our approach is an estimate of the strength of enrichment, which yields a coherent way to prioritize variants in enriched pathways. We illustrate the benefits of our approach in a genome-wide association study of Crohn's disease with ~440,000 genetic variants genotyped for ~4700 study subjects. We obtain strong support for enrichment of IL-12, IL-23 and other cytokine signaling pathways. Furthermore, prioritizing variants in these enriched pathways yields support for additional disease-association variants, all of which have been independently reported in other case-control studies for Crohn's disease.",
    "authors": [
      "Peter Carbonetto",
      "Matthew Stephens"
    ],
    "publication_date": "2012-08-21T23:03:03Z",
    "arxiv_id": "http://arxiv.org/abs/1208.4400v1",
    "download_url": "https://arxiv.org/abs/1208.4400v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Population genetics of translational robustness",
    "abstract": "Recent work has shown that expression level is the main predictor of a gene&#8217;s evolutionary rate, and that more highly expressed genes evolve slower. A possible explanation for this observation is selection for proteins which fold properly despite mistranslation, in short selection for translational robustness. Translational robustness leads to the somewhat paradoxical prediction that highly expressed genes are extremely tolerant to missense substitutions but nevertheless evolve very slowly. Here, we study a simple theoretical model of translational robustness that allows us to gain analytic insight into how this paradoxical behavior arises.",
    "authors": [
      "Claus O. Wilke",
      "D. Allan Drummond"
    ],
    "publication_date": "2005-09-24T00:29:35Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0509031v2",
    "download_url": "https://arxiv.org/abs/q-bio/0509031v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stability and response of polygenic traits to stabilizing selection and mutation",
    "abstract": "When polygenic traits are under stabilizing selection, many different combinations of alleles allow close adaptation to the optimum. If alleles have equal effects, all combinations that result in the same deviation from the optimum are equivalent. Furthermore, the genetic variance that is maintained by mutation-selection balance is $2 μ/S$ per locus, where $μ$ is the mutation rate and $S$ the strength of stabilizing selection. In reality, alleles vary in their effects, making the fitness landscape asymmetric, and complicating analysis of the equilibria. We show that that the resulting genetic variance depends on the fraction of alleles near fixation, which contribute by $2 μ/S$, and on the total mutational effects of alleles that are at intermediate frequency. The interplay between stabilizing selection and mutation leads to a sharp transition: alleles with effects smaller than a threshold value of $2\\sqrt{μ/ S}$ remain polymorphic, whereas those with larger effects are fixed. The genetic load in equilibrium is less than for traits of equal effects, and the fitness equilibria are more similar. We find that if the optimum is displaced, alleles with effects close to the threshold value sweep first, and their rate of increase is bounded by $\\sqrt{μS}$. Long term response leads in general to well-adapted traits, unlike the case of equal effects that often end up at a sub-optimal fitness peak. However, the particular peaks to which the populations converge are extremely sensitive to the initial states, and to the speed of the shift of the optimum trait value.",
    "authors": [
      "Harold P. de Vladar",
      "Nick Barton"
    ],
    "publication_date": "2014-04-03T17:13:29Z",
    "arxiv_id": "http://arxiv.org/abs/1404.1017v1",
    "download_url": "https://arxiv.org/abs/1404.1017v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The language of race, ethnicity, and ancestry in human genetic research",
    "abstract": "The language commonly used in human genetics can inadvertently pose problems for multiple reasons. Terms like \"ancestry\", \"ethnicity\", and other ways of grouping people can have complex, often poorly understood, or multiple meanings within the various fields of genetics, between different domains of biological sciences and medicine, and between scientists and the general public. Furthermore, some categories in frequently used datasets carry scientifically misleading, outmoded or even racist perspectives derived from the history of science. Here, we discuss examples of problematic lexicon in genetics, and how commonly used statistical practices to control for the non-genetic environment may exacerbate difficulties in our terminology, and therefore understanding. Our intention is to stimulate a much-needed discussion about the language of genetics, to begin a process to clarify existing terminology, and in some cases adopt a new lexicon that both serves scientific insight, and cuts us loose from various aspects of a pernicious past.",
    "authors": [
      "Ewan Birney",
      "Michael Inouye",
      "Jennifer Raff",
      "Adam Rutherford",
      "Aylwyn Scally"
    ],
    "publication_date": "2021-06-18T10:24:15Z",
    "arxiv_id": "http://arxiv.org/abs/2106.10041v1",
    "download_url": "https://arxiv.org/abs/2106.10041v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Population genetics: an introduction for physicists",
    "abstract": "Population genetics lies at the heart of evolutionary theory. This topic forms part of many biological science curricula but is rarely taught to physics students. Since physicists are becoming increasingly interested in biological evolution, we aim to provide a brief introduction to population genetics, written for physicists. We start with two background chapters: chapter 1 provides a brief historical introduction to the topic, while chapter 2 provides some essential biological background. We begin our main content with chapter 3 which discusses the key concepts behind Darwinian natural selection and Mendelian inheritance. Chapter 4 covers the basics of how variation is maintained in populations, while chapter 5 discusses mutation and selection. In chapter 6 we discuss stochastic effects in population genetics using the Wright-Fisher model as our example, and finally we offer concluding thoughts and references to excellent textbooks in chapter 7.",
    "authors": [
      "Andrea Iglesias-Ramas",
      "Samuele Pio Lipani",
      "Rosalind J. Allen"
    ],
    "publication_date": "2024-08-05T17:25:57Z",
    "arxiv_id": "http://arxiv.org/abs/2408.02650v3",
    "download_url": "https://arxiv.org/abs/2408.02650v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Population Genetics and Evolution",
    "abstract": "These lecture notes introduce key concepts of mathematical population genetics within the most elementary setting and describe a few recent applications to microbial evolution experiments. Pointers to the literature for further reading are provided, and some of the derivations are left as exercises for the reader.",
    "authors": [
      "Joachim Krug"
    ],
    "publication_date": "2018-03-22T17:20:37Z",
    "arxiv_id": "http://arxiv.org/abs/1803.08474v1",
    "download_url": "https://arxiv.org/abs/1803.08474v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Regression Analysis of Human Brain Connectivity Using an Efficient Estimator of Genetic Covariance",
    "abstract": "Non-invasive measurements of the human brain using magnetic resonance imaging (MRI) have significantly improved our understanding the brain's network organization by enabling measurement of anatomical connections between brain regions (structural connectivity) and their coactivation (functional connectivity). Heritability analyses have established that genetics account for considerable intersubject variability in structural and functional connectivity. However, characterizing how genetics shape the relationship between structural and functional connectomes remains challenging, since this association is obscured by unique environmental exposures in observed data. To address this, we develop a regression analysis framework that enables characterization of the relationship between latent genetic contributions to structural and functional connectivity. Implementing the proposed framework requires estimating genetic covariance matrices in multivariate random effects models, which is computationally intractable for high-dimensional connectome data using existing methods. We introduce a constrained method-of-moments estimator that is several orders of magnitude faster than existing methods without sacrificing estimation accuracy. For the genetic regression analysis, we develop regularized estimation approaches, including ridge, lasso, and tensor regression. Applying our method to Human Connectome Project data, we find that functional connectivity is moderately predictable from structure at the genetic level (max R^2 = 0.34), though it is not directly predictable in the observed data (max R^2 = 0.03). This stark contrast suggests that unique environmental factors mask strong genetically-encoded structure-function relationships.",
    "authors": [
      "Keshav Motwani",
      "Ali Shojaie",
      "Ariel Rokem",
      "Eardi Lila"
    ],
    "publication_date": "2025-12-09T16:06:38Z",
    "arxiv_id": "http://arxiv.org/abs/2512.08756v1",
    "download_url": "https://arxiv.org/abs/2512.08756v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic InfoMax: Exploring Mutual Information Maximization in High-Dimensional Imaging Genetics Studies",
    "abstract": "Genome-wide association studies (GWAS) are used to identify relationships between genetic variations and specific traits. When applied to high-dimensional medical imaging data, a key step is to extract lower-dimensional, yet informative representations of the data as traits. Representation learning for imaging genetics is largely under-explored due to the unique challenges posed by GWAS in comparison to typical visual representation learning. In this study, we tackle this problem from the mutual information (MI) perspective by identifying key limitations of existing methods. We introduce a trans-modal learning framework Genetic InfoMax (GIM), including a regularized MI estimator and a novel genetics-informed transformer to address the specific challenges of GWAS. We evaluate GIM on human brain 3D MRI data and establish standardized evaluation protocols to compare it to existing approaches. Our results demonstrate the effectiveness of GIM and a significantly improved performance on GWAS.",
    "authors": [
      "Yaochen Xie",
      "Ziqian Xie",
      "Sheikh Muhammad Saiful Islam",
      "Degui Zhi",
      "Shuiwang Ji"
    ],
    "publication_date": "2023-09-26T03:59:21Z",
    "arxiv_id": "http://arxiv.org/abs/2309.15132v1",
    "download_url": "https://arxiv.org/abs/2309.15132v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fluctuations of fitness distributions and the rate of Muller's ratchet",
    "abstract": "The accumulation of deleterious mutations is driven by rare fluctuations which lead to the loss of all mutation free individuals, a process known as Muller's ratchet. Even though Muller's ratchet is a paradigmatic process in population genetics, a quantitative understanding of its rate is still lacking. The difficulty lies in the nontrivial nature of fluctuations in the fitness distribution which control the rate of extinction of the fittest genotype. We address this problem using the simple but classic model of mutation selection balance with deleterious mutations all having the same effect on fitness. We show analytically how fluctuations among the fittest individuals propagate to individuals of lower fitness and have a dramatically amplified effects on the bulk of the population at a later time. If a reduction in the size of the fittest class reduces the mean fitness only after a delay, selection opposing this reduction is also delayed. This delayed restoring force speeds up Muller's ratchet. We show how the delayed response can be accounted for using a path integral formulation of the stochastic dynamics and provide an expression for the rate of the ratchet that is accurate across a broad range of parameters.",
    "authors": [
      "Richard A. Neher",
      "Boris I. Shraiman"
    ],
    "publication_date": "2012-06-28T18:03:21Z",
    "arxiv_id": "http://arxiv.org/abs/1206.6782v1",
    "download_url": "https://arxiv.org/abs/1206.6782v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Population Genetics with Fluctuating Population Sizes",
    "abstract": "Standard neutral population genetics theory with a strictly fixed population size has important limitations. An alternative model that allows independently fluctuating population sizes and reproduces the standard neutral evolution is reviewed. We then study a situation such that the competing species are neutral at the equilibrium population size but population size fluctuations nevertheless favor fixation of one species over the other. In this case, a separation of timescales emerges naturally and allows adiabatic elimination of a fast population size variable to deduce the fluctuations-induced selection dynamics near the equilibrium population size. The results highlight the incompleteness of the standard population genetics with a strictly fixed population size.",
    "authors": [
      "Thiparat Chotibut",
      "David R. Nelson"
    ],
    "publication_date": "2016-08-29T18:19:55Z",
    "arxiv_id": "http://arxiv.org/abs/1608.08166v1",
    "download_url": "https://arxiv.org/abs/1608.08166v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The infinitesimal model with dominance",
    "abstract": "The classical infinitesimal model is a simple and robust model for the inheritance of quantitative traits. In this model, a quantitative trait is expressed as the sum of a genetic and a non-genetic (environmental) component and the genetic component of offspring traits within a family follows a normal distribution around the average of the parents' trait values, and has a variance that is independent of the trait values of the parents. In previous work, Barton et al.(2017), we showed that when trait values are determined by the sum of a large number of Mendelian factors, each of small effect, one can justify the infinitesimal model as limit of Mendelian inheritance.\n  In this paper, we show that the robustness of the infinitesimal model extends to include dominance. We define the model in terms of classical quantities of quantitative genetics, before justifying it as a limit of Mendelian inheritance as the number, M, of underlying loci tends to infinity. As in the additive case, the multivariate normal distribution of trait values across the pedigree can be expressed in terms of variance components in an ancestral population and probabilities of identity by descent determined by the pedigree. In this setting, it is natural to decompose trait values, not just into the additive and dominance components, but into a component that is shared by all individuals within the family and an independent `residual' for each offspring, which captures the randomness of Mendelian inheritance. We show that, even if we condition on parental trait values, both the shared component and the residuals within each family will be asymptotically normally distributed as the number of loci tends to infinity, with an error of order 1/\\sqrt{M}.\n  We illustrate our results with some numerical examples.",
    "authors": [
      "N. H. Barton",
      "A. M. Etheridge",
      "A. Véber"
    ],
    "publication_date": "2022-10-31T22:00:44Z",
    "arxiv_id": "http://arxiv.org/abs/2211.03515v3",
    "download_url": "https://arxiv.org/abs/2211.03515v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bayesian tensor factorization for predicting clinical outcomes using integrated human genetics evidence",
    "abstract": "The approval success rate of drug candidates is very low with the majority of failure due to safety and efficacy. Increasingly available high dimensional information on targets, drug molecules and indications provides an opportunity for ML methods to integrate multiple data modalities and better predict clinically promising drug targets. Notably, drug targets with human genetics evidence are shown to have better odds to succeed. However, a recent tensor factorization-based approach found that additional information on targets and indications might not necessarily improve the predictive accuracy. Here we revisit this approach by integrating different types of human genetics evidence collated from publicly available sources to support each target-indication pair. We use Bayesian tensor factorization to show that models incorporating all available human genetics evidence (rare disease, gene burden, common disease) modestly improves the clinical outcome prediction over models using single line of genetics evidence. We provide additional insight into the relative predictive power of different types of human genetics evidence for predicting the success of clinical outcomes.",
    "authors": [
      "Onuralp Soylemez"
    ],
    "publication_date": "2022-07-25T21:26:21Z",
    "arxiv_id": "http://arxiv.org/abs/2207.12538v1",
    "download_url": "https://arxiv.org/abs/2207.12538v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sensitivity of inferences in forensic genetics to assumptions about founding genes",
    "abstract": "Many forensic genetics problems can be handled using structured systems of discrete variables, for which Bayesian networks offer an appealing practical modeling framework, and allow inferences to be computed by probability propagation methods. However, when standard assumptions are violated--for example, when allele frequencies are unknown, there is identity by descent or the population is heterogeneous--dependence is generated among founding genes, that makes exact calculation of conditional probabilities by propagation methods less straightforward. Here we illustrate different methodologies for assessing sensitivity to assumptions about founders in forensic genetics problems. These include constrained steepest descent, linear fractional programming and representing dependence by structure. We illustrate these methods on several forensic genetics examples involving criminal identification, simple and complex disputed paternity and DNA mixtures.",
    "authors": [
      "Peter J. Green",
      "Julia Mortera"
    ],
    "publication_date": "2009-08-20T06:58:36Z",
    "arxiv_id": "http://arxiv.org/abs/0908.2862v1",
    "download_url": "https://arxiv.org/abs/0908.2862v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Multi-task Deep Feature Selection Method for Brain Imaging Genetics",
    "abstract": "Using brain imaging quantitative traits (QTs) to identify the genetic risk factors is an important research topic in imaging genetics. Many efforts have been made via building linear models, e.g. linear regression (LR), to extract the association between imaging QTs and genetic factors such as single nucleotide polymorphisms (SNPs). However, to the best of our knowledge, these linear models could not fully uncover the complicated relationship due to the loci's elusive and diverse impacts on imaging QTs. Though deep learning models can extract the nonlinear relationship, they could not select relevant genetic factors. In this paper, we proposed a novel multi-task deep feature selection (MTDFS) method for brain imaging genetics. MTDFS first adds a multi-task one-to-one layer and imposes a hybrid sparsity-inducing penalty to select relevant SNPs making significant contributions to abnormal imaging QTs. It then builds a multi-task deep neural network to model the complicated associations between imaging QTs and SNPs. MTDFS can not only extract the nonlinear relationship but also arms the deep neural network with the feature selection capability. We compared MTDFS to both LR and single-task DFS (DFS) methods on the real neuroimaging genetic data. The experimental results showed that MTDFS performed better than both LR and DFS in terms of the QT-SNP relationship identification and feature selection. In a word, MTDFS is powerful for identifying risk loci and could be a great supplement to the method library for brain imaging genetics.",
    "authors": [
      "Chenglin Yu",
      "Dingnan Cui",
      "Muheng Shang",
      "Shu Zhang",
      "Lei Guo",
      "Junwei Han",
      "Lei Du",
      "Alzheimer's Disease Neuroimaging Initiative"
    ],
    "publication_date": "2021-07-01T11:59:23Z",
    "arxiv_id": "http://arxiv.org/abs/2107.00388v1",
    "download_url": "https://arxiv.org/abs/2107.00388v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spatial population genetics with fluid flow",
    "abstract": "The growth and evolution of microbial populations is often subjected to advection by fluid flows in spatially extended environments, with immediate consequences for questions of spatial population genetics in marine ecology, planktonic diversity and origin of life scenarios. Here, we review recent progress made in understanding this rich problem in the simplified setting of two competing genetic microbial strains subjected to fluid flows. As a pedagogical example we focus on antagonsim, i.e., two killer microorganism strains, each secreting toxins that impede the growth of their competitors (competitive exclusion), in the presence of stationary fluid flows. By solving two coupled reaction-diffusion equations that include advection by simple steady cellular flows composed of characteristic flow motifs in two dimensions (2d), we show how local flow shear and compressibility effects can interact with selective advantage to have a dramatic influence on genetic competition and fixation in spatially distributed populations. We analyze several 1d and 2d flow geometries including sources, sinks, vortices and saddles, and show how simple analytical models of the dynamics of the genetic interface can be used to shed light on the nucleation, coexistence and flow-driven instabilities of genetic drops. By exploiting an analogy with phase separation with nonconserved order parameters, we uncover how these genetic drops harness fluid flows for novel evolutionary strategies, even in the presence of number fluctuations, as confirmed by agent-based simulations as well.",
    "authors": [
      "Roberto Benzi",
      "David R. Nelson",
      "Suraj Shankar",
      "Federico Toschi",
      "Xiaojue Zhu"
    ],
    "publication_date": "2021-12-16T18:03:56Z",
    "arxiv_id": "http://arxiv.org/abs/2112.09079v2",
    "download_url": "https://arxiv.org/abs/2112.09079v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Category Theory for Genetics",
    "abstract": "We introduce a categorical language in which it is possible to talk about DNA sequencing, alignment methods, CRISPR, homologous recombination, haplotypes, and genetic linkage. This language takes the form of a class of limit-sketches whose categories of models can model different concepts of Biology depending on what their categories of values are. We discuss examples of models in the category of sets and in the category of modules over the Boolean semi-ring $\\{0,1\\}$. We identify a subclass of models in sets that models the genetic material of living beings and another subclass of models in modules that models haplotypes. We show how the two classes are related via a universal property.",
    "authors": [
      "Rémy Tuyéras"
    ],
    "publication_date": "2017-08-17T13:21:28Z",
    "arxiv_id": "http://arxiv.org/abs/1708.05255v4",
    "download_url": "https://arxiv.org/abs/1708.05255v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Open Problems in Human Trait Genetics",
    "abstract": "Genetic studies of human traits have revolutionized our understanding of the variation between individuals, and opened the door for numerous breakthroughs in biology, medicine and other scientific fields. And yet, the ultimate promise of this area of research is still not fully realized. In this review, we highlight the major open problems that need to be solved to improve our understanding of the genetic variation underlying human traits, and by discussing these challenges provide a primer to the field. Our focus is on concrete analytical problems, both conceptual and technical in nature. We cover general issues in genetic studies such as population structure, epistasis and gene-environment interactions, data-related issues such as ethnic diversity and rare genetic variants, and specific challenges related to heritability estimates, genetic association studies and polygenic risk scores. We emphasize the interconnectedness of these open problems and suggest promising avenues to address them.",
    "authors": [
      "Nadav Brandes",
      "Omer Weissbrod",
      "Michal Linial"
    ],
    "publication_date": "2021-08-15T07:56:49Z",
    "arxiv_id": "http://arxiv.org/abs/2108.06684v1",
    "download_url": "https://arxiv.org/abs/2108.06684v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Category theory for genetics I: mutations and sequence alignments",
    "abstract": "The present article is the first of a series whose goal is to define a logical formalism in which it is possible to reason about genetics. In this paper, we introduce the main concepts of our language whose domain of discourse consists of a class of limit-sketches and their associated models. While our program will aim to show that different phenomena of genetics can be modeled by changing the category in which the models take their values, in this paper, we study models in the category of sets to capture mutation mechanisms such as insertions, deletions, substitutions, duplications and inversions. We show how the proposed formalism can be used for constructing multiple sequence alignments with an emphasis on mutation mechanisms.",
    "authors": [
      "Rémy Tuyéras"
    ],
    "publication_date": "2018-05-18T00:50:48Z",
    "arxiv_id": "http://arxiv.org/abs/1805.07002v5",
    "download_url": "https://arxiv.org/abs/1805.07002v5",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonparametric independence tests in high-dimensional settings, with applications to the genetics of complex disease",
    "abstract": "[PhD thesis of FCP.] Nowadays, genetics studies large amounts of very diverse variables. Mathematical statistics has evolved in parallel to its applications, with much recent interest high-dimensional settings. In the genetics of human common disease, a number of relevant problems can be formulated as tests of independence. We show how defining adequate premetric structures on the support spaces of the genetic data allows for novel approaches to such testing. This yields a solid theoretical framework, which reflects the underlying biology, and allows for computationally-efficient implementations. For each problem, we provide mathematical results, simulations and the application to real data.",
    "authors": [
      "Fernando Castro-Prado"
    ],
    "publication_date": "2024-07-29T01:00:53Z",
    "arxiv_id": "http://arxiv.org/abs/2407.19624v1",
    "download_url": "https://arxiv.org/abs/2407.19624v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The discernible and hidden effects of clonality on the genotypic and genetic states of populations: improving our estimation of clonal rates",
    "abstract": "Partial clonality is widespread across the tree of life, but most population genetics models are designed for exclusively clonal or sexual organisms. This gap hampers our understanding of the influence of clonality on evolutionary trajectories and the interpretation of population genetics data. We performed forward simulations of diploid populations at increasing rates of clonality (c), analysed their relationships with genotypic (clonal richness, R, and distribution of clonal sizes, Pareto β) and genetic (FIS and linkage disequilibrium) indices, and tested predictions of c from population genetics data through supervised machine learning. Two complementary behaviours emerged from the probability distributions of genotypic and genetic indices with increasing c. While the impact of c on R and Pareto βwas easily described by simple mathematical equations, its effects on genetic indices were noticeable only at the highest levels (c>0.95). Consequently, genotypic indices allowed reliable estimates of c, while genetic descriptors led to poorer performances when c<0.95. These results provide clear baseline expectations for genotypic and genetic diversity and dynamics under partial clonality. Worryingly, however, the use of realistic sample sizes to acquire empirical data systematically led to gross underestimates (often of one to two orders of magnitude) of c, suggesting that many interpretations hitherto proposed in the literature, mostly based on genotypic richness, should be reappraised. We propose future avenues to derive realistic confidence intervals for c and show that, although still approximate, a supervised learning method would greatly improve the estimation of c from population genetics data.",
    "authors": [
      "Solenn Stoeckel",
      "Barbara Porro",
      "Sophie Arnaud-Haond"
    ],
    "publication_date": "2019-02-25T15:29:57Z",
    "arxiv_id": "http://arxiv.org/abs/1902.09365v4",
    "download_url": "https://arxiv.org/abs/1902.09365v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Neuroimaging Feature Extraction using a Neural Network Classifier for Imaging Genetics",
    "abstract": "A major issue in the association of genes to neuroimaging phenotypes is the high dimension of both genetic data and neuroimaging data. In this article, we tackle the latter problem with an eye toward developing solutions that are relevant for disease prediction. Supported by a vast literature on the predictive power of neural networks, our proposed solution uses neural networks to extract from neuroimaging data features that are relevant for predicting Alzheimer's Disease (AD) for subsequent relation to genetics. Our neuroimaging-genetic pipeline is comprised of image processing, neuroimaging feature extraction and genetic association steps. We propose a neural network classifier for extracting neuroimaging features that are related with disease and a multivariate Bayesian group sparse regression model for genetic association. We compare the predictive power of these features to expert selected features and take a closer look at the SNPs identified with the new neuroimaging features.",
    "authors": [
      "Cédric Beaulac",
      "Sidi Wu",
      "Erin Gibson",
      "Michelle F. Miranda",
      "Jiguo Cao",
      "Leno Rocha",
      "Mirza Faisal Beg",
      "Farouk S. Nathoo"
    ],
    "publication_date": "2022-07-08T19:03:00Z",
    "arxiv_id": "http://arxiv.org/abs/2207.10794v1",
    "download_url": "https://arxiv.org/abs/2207.10794v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Genetic Framework Model For Self-Adaptive Software",
    "abstract": "Lots of bio-inspired research works have been conducted in self-adaptive software. They have focused on the external behavior of biological entities without their genetic material that causes this behavior and constitutes the challenge this work dealt with. This paper propose a framework integrating both the external behavior and the genetics material. This framework is limited to predicted events. the non-predicted events are still a challenge.",
    "authors": [
      "Enas Nafar",
      "Said Ghoul"
    ],
    "publication_date": "2019-04-29T09:46:42Z",
    "arxiv_id": "http://arxiv.org/abs/1904.12540v1",
    "download_url": "https://arxiv.org/abs/1904.12540v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Statistical physics methods provide the exact solution to a long-standing problem of genetics",
    "abstract": "Analytic and computational methods developed within statistical physics have found applications in numerous disciplines. In this letter, we use such methods to solve a long-standing problem in statistical genetics. The problem, posed by Haldane and Waddington [J.B.S. Haldane and C.H. Waddington, Genetics 16, 357-374 (1931)], concerns so-called recombinant inbred lines (RILs) produced by repeated inbreeding. Haldane and Waddington derived the probabilities of RILs when considering 2 and 3 genes but the case of 4 or more genes has remained elusive. Our solution uses two probabilistic frameworks relatively unknown outside of physics: Glauber's formula and self-consistent equations of the Schwinger-Dyson type. Surprisingly, this combination of statistical formalisms unveils the exact probabilities of RILs for any number of genes. Extensions of the framework may have applications in population genetics and beyond.",
    "authors": [
      "Areejit Samal",
      "Olivier C. Martin"
    ],
    "publication_date": "2014-07-11T17:04:58Z",
    "arxiv_id": "http://arxiv.org/abs/1407.3219v3",
    "download_url": "https://arxiv.org/abs/1407.3219v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bernoulli factories and duality in Wright-Fisher and Allen-Cahn models of population genetics",
    "abstract": "Mathematical models of genetic evolution often come in pairs, connected by a so-called duality relation. The most seminal example are the Wright-Fisher diffusion and the Kingman coalescent, where the former describes the stochastic evolution of neutral allele frequencies in a large population forwards in time, and the latter describes the genetic ancestry of randomly sampled individuals from the population backwards in time. As well as providing a richer description than either model in isolation, duality often yields equations satisfied by quantities of interest. We employ the so-called Bernoulli factory - a celebrated tool in simulation-based computing - to derive duality relations for broad classes of genetics models. As concrete examples, we present Wright-Fisher diffusions with general drift functions, and Allen-Cahn equations with general, nonlinear forcing terms. The drift and forcing functions can be interpreted as the action of frequency-dependent selection. To our knowledge, this work is the first time a connection has been drawn between Bernoulli factories and duality in models of population genetics.",
    "authors": [
      "Jere Koskela",
      "Krzysztof Łatuszyński",
      "Dario Spanò"
    ],
    "publication_date": "2023-06-06T09:37:17Z",
    "arxiv_id": "http://arxiv.org/abs/2306.03539v3",
    "download_url": "https://arxiv.org/abs/2306.03539v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universality and predictability in molecular quantitative genetics",
    "abstract": "Molecular traits, such as gene expression levels or protein binding affinities, are increasingly accessible to quantitative measurement by modern high-throughput techniques. Such traits measure molecular functions and, from an evolutionary point of view, are important as targets of natural selection. We review recent developments in evolutionary theory and experiments that are expected to become building blocks of a quantitative genetics of molecular traits. We focus on universal evolutionary characteristics: these are largely independent of a trait's genetic basis, which is often at least partially unknown. We show that universal measurements can be used to infer selection on a quantitative trait, which determines its evolutionary mode of conservation or adaptation. Furthermore, universality is closely linked to predictability of trait evolution across lineages. We argue that universal trait statistics extends over a range of cellular scales and opens new avenues of quantitative evolutionary systems biology.",
    "authors": [
      "Armita Nourmohammad",
      "Torsten Held",
      "Michael Lässig"
    ],
    "publication_date": "2013-09-12T21:30:16Z",
    "arxiv_id": "http://arxiv.org/abs/1309.3312v2",
    "download_url": "https://arxiv.org/abs/1309.3312v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Directional genetic differentiation and asymmetric migration",
    "abstract": "Understanding the population structure and patterns of gene flow within species is of fundamental importance to the study of evolution. In the fields of population and evolutionary genetics, measures of genetic differentiation are commonly used to gather this information. One potential caveat is that these measures assume gene flow to be symmetric. However, asymmetric gene flow is common in nature, especially in systems driven by physical processes such as wind or water currents. Since information about levels of asymmetric gene flow among populations is essential for the correct interpretation of the distribution of contemporary genetic diversity within species, this should not be overlooked. To obtain information on asymmetric migration patterns from genetic data, complex models based on maximum likelihood or Bayesian approaches generally need to be employed, often at great computational cost. Here, a new simpler and more efficient approach for understanding gene flow patterns is presented. This approach allows the estimation of directional components of genetic divergence between pairs of populations at low computational effort, using any of the classical or modern measures of genetic differentiation. These directional measures of genetic differentiation can further be used to calculate directional relative migration and to detect asymmetries in gene flow patterns. This can be done in a user-friendly web application called divMigrate-online introduced in this paper. Using simulated data sets with known gene flow regimes, we demonstrate that the method is capable of resolving complex migration patterns under a range of study designs.",
    "authors": [
      "Lisa Sundqvist",
      "Kevin Keenan",
      "Martin Zackrisson",
      "Paulo Prodöhl",
      "David Kleinhans"
    ],
    "publication_date": "2013-03-30T15:30:17Z",
    "arxiv_id": "http://arxiv.org/abs/1304.0118v3",
    "download_url": "https://arxiv.org/abs/1304.0118v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Natural Selection as an Inhibitor of Genetic Diversity: Multiplicative Weights Updates Algorithm and a Conjecture of Haploid Genetics",
    "abstract": "In a recent series of papers a surprisingly strong connection was discovered between standard models of evolution in mathematical biology and Multiplicative Weights Updates Algorithm, a ubiquitous model of online learning and optimization. These papers establish that mathematical models of biological evolution are tantamount to applying discrete Multiplicative Weights Updates Algorithm, a close variant of MWUA, on coordination games. This connection allows for introducing insights from the study of game theoretic dynamics into the field of mathematical biology. Using these results as a stepping stone, we show that mathematical models of haploid evolution imply the extinction of genetic diversity in the long term limit, a widely believed conjecture in genetics. In game theoretic terms we show that in the case of coordination games, under minimal genericity assumptions, discrete MWUA converges to pure Nash equilibria for all but a zero measure of initial conditions. This result holds despite the fact that mixed Nash equilibria can be exponentially (or even uncountably) many, completely dominating in number the set of pure Nash equilibria. Thus, in haploid organisms the long term preservation of genetic diversity needs to be safeguarded by other evolutionary mechanisms such as mutations and speciation.",
    "authors": [
      "Ruta Mehta",
      "Ioannis Panageas",
      "Georgios Piliouras"
    ],
    "publication_date": "2014-08-26T21:36:02Z",
    "arxiv_id": "http://arxiv.org/abs/1408.6270v3",
    "download_url": "https://arxiv.org/abs/1408.6270v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information Theory and Population Genetics",
    "abstract": "The key findings of classical population genetics are derived using a framework based on information theory using the entropies of the allele frequency distribution as a basis. The common results for drift, mutation, selection, and gene flow will be rewritten both in terms of information theoretic measurements and used to draw the classic conclusions for balance conditions and common features of one locus dynamics. Linkage disequilibrium will also be discussed including the relationship between mutual information and r^2 and a simple model of hitchhiking.",
    "authors": [
      "Reginald D. Smith"
    ],
    "publication_date": "2011-03-21T15:45:40Z",
    "arxiv_id": "http://arxiv.org/abs/1103.5625v2",
    "download_url": "https://arxiv.org/abs/1103.5625v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deep Visual-Genetic Biometrics for Taxonomic Classification of Rare Species",
    "abstract": "Visual as well as genetic biometrics are routinely employed to identify species and individuals in biological applications. However, no attempts have been made in this domain to computationally enhance visual classification of rare classes with little image data via genetics. In this paper, we thus propose aligned visual-genetic inference spaces with the aim to implicitly encode cross-domain associations for improved performance. We demonstrate for the first time that such alignment can be achieved via deep embedding models and that the approach is directly applicable to boosting long-tailed recognition (LTR) particularly for rare species. We experimentally demonstrate the efficacy of the concept via application to microscopic imagery of 30k+ planktic foraminifer shells across 32 species when used together with independent genetic data samples. Most importantly for practitioners, we show that visual-genetic alignment can significantly benefit visual-only recognition of the rarest species. Technically, we pre-train a visual ResNet50 deep learning model using triplet loss formulations to create an initial embedding space. We re-structure this space based on genetic anchors embedded via a Sequence Graph Transform (SGT) and linked to visual data by cross-domain cosine alignment. We show that an LTR approach improves the state-of-the-art across all benchmarks and that adding our visual-genetic alignment improves per-class and particularly rare tail class benchmarks significantly further. We conclude that visual-genetic alignment can be a highly effective tool for complementing visual biological data containing rare classes. The concept proposed may serve as an important future tool for integrating genetics and imageomics towards a more complete scientific representation of taxonomic spaces and life itself. Code, weights, and data splits are published for full reproducibility.",
    "authors": [
      "Tayfun Karaderi",
      "Tilo Burghardt",
      "Raphael Morard",
      "Daniela Schmidt"
    ],
    "publication_date": "2023-05-11T10:04:27Z",
    "arxiv_id": "http://arxiv.org/abs/2305.06695v3",
    "download_url": "https://arxiv.org/abs/2305.06695v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spatial Population Genetics: It's About Time",
    "abstract": "Many questions that we have about the history and dynamics of organisms have a geographical component: How many are there, and where do they live? How do they move and interbreed across the landscape? How were they moving a thousand years ago, and where were the ancestors of a particular individual alive today? Answers to these questions can have profound consequences for our understanding of history, ecology, and the evolutionary process. In this review, we discuss how geographic aspects of the distribution, movement, and reproduction of organisms are reflected in their pedigree across space and time. Because the structure of the pedigree is what determines patterns of relatedness in modern genetic variation, our aim is to thus provide intuition for how these processes leave an imprint in genetic data. We also highlight some current methods and gaps in the statistical toolbox of spatial population genetics.",
    "authors": [
      "Gideon S. Bradburd",
      "Peter L. Ralph"
    ],
    "publication_date": "2019-04-22T13:09:20Z",
    "arxiv_id": "http://arxiv.org/abs/1904.09847v2",
    "download_url": "https://arxiv.org/abs/1904.09847v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Statistical Analysis in Genetic Studies of Mental Illnesses",
    "abstract": "Identifying the risk factors for mental illnesses is of significant public health importance. Diagnosis, stigma associated with mental illnesses, comorbidity, and complex etiologies, among others, make it very challenging to study mental disorders. Genetic studies of mental illnesses date back at least a century ago, beginning with descriptive studies based on Mendelian laws of inheritance. A variety of study designs including twin studies, family studies, linkage analysis, and more recently, genomewide association studies have been employed to study the genetics of mental illnesses, or complex diseases in general. In this paper, I will present the challenges and methods from a statistical perspective and focus on genetic association studies.",
    "authors": [
      "Heping Zhang"
    ],
    "publication_date": "2011-08-16T07:13:00Z",
    "arxiv_id": "http://arxiv.org/abs/1108.3168v1",
    "download_url": "https://arxiv.org/abs/1108.3168v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Population genetic models of dormancy",
    "abstract": "In the present article, we investigate the effects of dormancy on an abstract population genetic level. We first provide a short review of seed bank models in population genetics, and the role of dormancy for the interplay of evolutionary forces in general, before we discuss two recent paradigmatic models, referring to spontaneous resp. simultaneous switching of individuals between the active and the dormant state. We show that both mechanisms give rise to non-trivial mathematical objects, namely the (continuous) seed bank diffusion and the seed bank diffusion with jumps, as well as their dual processes, the seed bank coalescent and the seed bank coalescent with simultaneous switching.",
    "authors": [
      "Jochen Blath",
      "Noemi Kurt"
    ],
    "publication_date": "2020-12-01T20:10:44Z",
    "arxiv_id": "http://arxiv.org/abs/2012.00810v1",
    "download_url": "https://arxiv.org/abs/2012.00810v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Mathematics of Fraternal Birth Order Effect and the Genetics of Homosexuality",
    "abstract": "Mathematicians have always been attracted to the field of genetics. I am especially interested in the mathematical aspects of research on homosexuality. Certain studies show that male homosexuality may have a genetic component that is correlated with female fertility. Other studies show the existence of the fraternal birth order effect, that is the correlation of homosexuality with the number of older brothers.\n  This paper is devoted to the mathematical aspects of how these two phenomena are interconnected. In particular, I show that the fraternal birth order effect produces a correlation between homosexuality and maternal fecundity. Vice versa, I show that the correlation between homosexuality and female fecundity implies the increase of the probability of the younger brothers being homosexual.",
    "authors": [
      "Tanya Khovanova"
    ],
    "publication_date": "2017-11-01T19:59:50Z",
    "arxiv_id": "http://arxiv.org/abs/1711.09692v1",
    "download_url": "https://arxiv.org/abs/1711.09692v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Algorithm: Reviews, Implementations, and Applications",
    "abstract": "Nowadays genetic algorithm (GA) is greatly used in engineering pedagogy as an adaptive technique to learn and solve complex problems and issues. It is a meta-heuristic approach that is used to solve hybrid computation challenges. GA utilizes selection, crossover, and mutation operators to effectively manage the searching system strategy. This algorithm is derived from natural selection and genetics concepts. GA is an intelligent use of random search supported with historical data to contribute the search in an area of the improved outcome within a coverage framework. Such algorithms are widely used for maintaining high-quality reactions to optimize issues and problems investigation. These techniques are recognized to be somewhat of a statistical investigation process to search for a suitable solution or prevent an accurate strategy for challenges in optimization or searches. These techniques have been produced from natural selection or genetics principles. For random testing, historical information is provided with intelligent enslavement to continue moving the search out from the area of improved features for processing of the outcomes. It is a category of heuristics of evolutionary history using behavioral science-influenced methods like an annuity, gene, preference, or combination (sometimes refers to as hybridization). This method seemed to be a valuable tool to find solutions for problems optimization. In this paper, the author has explored the GAs, its role in engineering pedagogies, and the emerging areas where it is using, and its implementation.",
    "authors": [
      "Tanweer Alam",
      "Shamimul Qamar",
      "Amit Dixit",
      "Mohamed Benaida"
    ],
    "publication_date": "2020-06-05T14:34:33Z",
    "arxiv_id": "http://arxiv.org/abs/2007.12673v1",
    "download_url": "https://arxiv.org/abs/2007.12673v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ridge-penalized adaptive Mantel test and its application in imaging genetics",
    "abstract": "We propose a ridge-penalized adaptive Mantel test (AdaMant) for evaluating the association of two high-dimensional sets of features. By introducing a ridge penalty, AdaMant tests the association across many metrics simultaneously. We demonstrate how ridge penalization bridges Euclidean and Mahalanobis distances and their corresponding linear models from the perspective of association measurement and testing. This result is not only theoretically interesting but also has important implications in penalized hypothesis testing, especially in high dimensional settings such as imaging genetics. Applying the proposed method to an imaging genetic study of visual working memory in health adults, we identified interesting associations of brain connectivity (measured by EEG coherence) with selected genetic features.",
    "authors": [
      "Dustin Pluta",
      "Tong Shen",
      "Gui Xue",
      "Chuansheng Chen",
      "Hernando Ombao",
      "Zhaoxia Yu"
    ],
    "publication_date": "2021-03-03T03:42:34Z",
    "arxiv_id": "http://arxiv.org/abs/2103.02156v2",
    "download_url": "https://arxiv.org/abs/2103.02156v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Genetic Code revisited: Inner-to-outer map, 2D-Gray map, and World-map Genetic Representations",
    "abstract": "How to represent the genetic code? Despite the fact that it is extensively known, the DNA mapping into proteins remains as one of the relevant discoveries of genetics. However, modern genomic signal processing usually requires converting symbolic-DNA strings into complex-valued signals in order to take full advantage of a broad variety of digital processing techniques. The genetic code is revisited in this paper, addressing alternative representations for it, which can be worthy for genomic signal processing. Three original representations are discussed. The inner-to-outer map builds on the unbalanced role of nucleotides of a 'codon' and it seems to be suitable for handling information-theory-based matter. The two-dimensional-Gray map representation is offered as a mathematically structured map that can help interpreting spectrograms or scalograms. Finally, the world-map representation for the genetic code is investigated, which can particularly be valuable for educational purposes -besides furnishing plenty of room for application of distance-based algorithms.",
    "authors": [
      "H. M. de Oliveira",
      "N. S. Santos-Magalhaes"
    ],
    "publication_date": "2015-03-05T18:31:43Z",
    "arxiv_id": "http://arxiv.org/abs/1503.02570v1",
    "download_url": "https://arxiv.org/abs/1503.02570v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The evolution of moment generating functions for the Wright Fisher model of population genetics",
    "abstract": "We derive and apply a partial differential equation for the moment generating function of the Wright-Fisher model of population genetics.",
    "authors": [
      "Tat Dat Tran",
      "Julian Hofrichter",
      "Juergen Jost"
    ],
    "publication_date": "2014-01-21T08:44:34Z",
    "arxiv_id": "http://arxiv.org/abs/1401.5219v1",
    "download_url": "https://arxiv.org/abs/1401.5219v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Neurogenetics of the Human Adenosine Receptor Genes: Genetic Structures and Involvement in Brain Diseases",
    "abstract": "Adenosine receptors are G-protein-coupled receptors involved in a wide range of physiological and pathological phenomena in most mammalian systems. All four receptors are widely expressed in the central nervous system, where they modulate neurotransmitter release and neuronal plasticity. A large number of gene association studies have shown that common genetic variants of the adenosine receptors (encoded by the ADORA1, ADORA2A, ADORA2B and ADORA3 genes) have a neuroprotective or neurodegenerative role in neurologic/psychiatric diseases. New genetic studies of rare variants and few novel associations with depression or epilepsy subtypes have recently been reported. Here, we review the literature on the genetics of adenosine receptors in neurologic and/or psychiatric diseases in humans, and discuss perspectives for further genetic research. We also provide an update on the genetic structures of the four human adenosine receptor genes and their regulation - a topic that has not been extensively addressed. Our review emphasizes the importance of (i) better characterizing the genetics of adenosine receptor genes and (ii) understanding how these genes are regulated.",
    "authors": [
      "Vincent Huin",
      "Claire-Marie Dhaenens",
      "Mégane Homa",
      "Kévin Carvalho",
      "Luc Buée",
      "Bernard Sablonnière"
    ],
    "publication_date": "2020-01-31T14:04:41Z",
    "arxiv_id": "http://arxiv.org/abs/2002.02936v1",
    "download_url": "https://arxiv.org/abs/2002.02936v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of Big Data with Application to Imaging Genetics",
    "abstract": "Big data applications, such as medical imaging and genetics, typically generate datasets that consist of few observations n on many more variables p, a scenario that we denote as p>>n. Traditional data processing methods are often insufficient for extracting information out of big data. This calls for the development of new algorithms that can deal with the size, complexity, and the special structure of such datasets. In this paper, we consider the problem of classifying p>>n data and propose a classification method based on linear discriminant analysis (LDA). Traditional LDA depends on the covariance estimate of the data, but when p>>n the sample covariance estimate is singular. The proposed method estimates the covariance by using a sparse version of noisy principal component analysis (nPCA). The use of sparsity in this setting aims at automatically selecting variables that are relevant for classification. In experiments, the new method is compared to state-of-the art methods for big data problems using both simulated datasets and imaging genetics datasets.",
    "authors": [
      "Magnus O. Ulfarsson",
      "Frosti Palsson",
      "Jakob Sigurdsson",
      "Johannes R. Sveinsson"
    ],
    "publication_date": "2016-05-16T20:16:29Z",
    "arxiv_id": "http://arxiv.org/abs/1605.04932v1",
    "download_url": "https://arxiv.org/abs/1605.04932v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic prediction of quantitative traits: a machine learner's guide focused on height",
    "abstract": "Machine learning and deep learning have been celebrating many successes in the application to biological problems, especially in the domain of protein folding. Another equally complex and important question has received relatively little attention by the machine learning community, namely the one of prediction of complex traits from genetics. Tackling this problem requires in-depth knowledge of the related genetics literature and awareness of various subtleties associated with genetic data. In this guide, we provide an overview for the machine learning community on current state of the art models and associated subtleties which need to be taken into consideration when developing new models for phenotype prediction. We use height as an example of a continuous-valued phenotype and provide an introduction to benchmark datasets, confounders, feature selection, and common metrics.",
    "authors": [
      "Lucie Bourguignon",
      "Caroline Weis",
      "Catherine R. Jutzeler",
      "Michael Adamer"
    ],
    "publication_date": "2023-10-06T05:43:50Z",
    "arxiv_id": "http://arxiv.org/abs/2310.04028v1",
    "download_url": "https://arxiv.org/abs/2310.04028v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Brain tumour genetic network signatures of survival",
    "abstract": "Tumour heterogeneity is increasingly recognized as a major obstacle to therapeutic success across neuro-oncology. Gliomas are characterised by distinct combinations of genetic and epigenetic alterations, resulting in complex interactions across multiple molecular pathways. Predicting disease evolution and prescribing individually optimal treatment requires statistical models complex enough to capture the intricate (epi)genetic structure underpinning oncogenesis. Here, we formalize this task as the inference of distinct patterns of connectivity within hierarchical latent representations of genetic networks. Evaluating multi-institutional clinical, genetic, and outcome data from 4023 glioma patients over 14 years, across 12 countries, we employ Bayesian generative stochastic block modelling to reveal a hierarchical network structure of tumour genetics spanning molecularly confirmed glioblastoma, IDH- wildtype; oligodendroglioma, IDH-mutant and 1p/19q codeleted; and astrocytoma, IDH- mutant. Our findings illuminate the complex dependence between features across the genetic landscape of brain tumours, and show that generative network models reveal distinct signatures of survival with better prognostic fidelity than current gold standard diagnostic categories.",
    "authors": [
      "James K Ruffle",
      "Samia Mohinta",
      "Guilherme Pombo",
      "Robert Gray",
      "Valeriya Kopanitsa",
      "Faith Lee",
      "Sebastian Brandner",
      "Harpreet Hyare",
      "Parashkev Nachev"
    ],
    "publication_date": "2023-01-15T15:04:38Z",
    "arxiv_id": "http://arxiv.org/abs/2301.06111v2",
    "download_url": "https://arxiv.org/abs/2301.06111v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bayesian Computation and Model Selection in Population Genetics",
    "abstract": "Until recently, the use of Bayesian inference in population genetics was limited to a few cases because for many realistic population genetic models the likelihood function cannot be calculated analytically . The situation changed with the advent of likelihood-free inference algorithms, often subsumed under the term Approximate Bayesian Computation (ABC). A key innovation was the use of a post-sampling regression adjustment, allowing larger tolerance values and as such shifting computation time to realistic orders of magnitude (see Beaumont et al., 2002). Here we propose a reformulation of the regression adjustment in terms of a General Linear Model (GLM). This allows the integration into the framework of Bayesian statistics and the use of its methods, including model selection via Bayes factors. We then apply the proposed methodology to the question of population subdivision among western chimpanzees Pan troglodytes verus.",
    "authors": [
      "Christoph Leuenberger Daniel Wegmann Laurent Excoffier"
    ],
    "publication_date": "2009-01-15T11:15:27Z",
    "arxiv_id": "http://arxiv.org/abs/0901.2231v1",
    "download_url": "https://arxiv.org/abs/0901.2231v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tackling the dimensions in imaging genetics with CLUB-PLS",
    "abstract": "A major challenge in imaging genetics and similar fields is to link high-dimensional data in one domain, e.g., genetic data, to high dimensional data in a second domain, e.g., brain imaging data. The standard approach in the area are mass univariate analyses across genetic factors and imaging phenotypes. That entails executing one genome-wide association study (GWAS) for each pre-defined imaging measure. Although this approach has been tremendously successful, one shortcoming is that phenotypes must be pre-defined. Consequently, effects that are not confined to pre-selected regions of interest or that reflect larger brain-wide patterns can easily be missed. In this work we introduce a Partial Least Squares (PLS)-based framework, which we term Cluster-Bootstrap PLS (CLUB-PLS), that can work with large input dimensions in both domains as well as with large sample sizes. One key factor of the framework is to use cluster bootstrap to provide robust statistics for single input features in both domains. We applied CLUB-PLS to investigating the genetic basis of surface area and cortical thickness in a sample of 33,000 subjects from the UK Biobank. We found 107 genome-wide significant locus-phenotype pairs that are linked to 386 different genes. We found that a vast majority of these loci could be technically validated at a high rate: using classic GWAS or Genome-Wide Inferred Statistics (GWIS) we found that 85 locus-phenotype pairs exceeded the genome-wide suggestive (P<1e-05) threshold.",
    "authors": [
      "Andre Altmann",
      "Ana C Lawry Aguila",
      "Neda Jahanshad",
      "Paul M Thompson",
      "Marco Lorenzi"
    ],
    "publication_date": "2023-09-13T23:27:45Z",
    "arxiv_id": "http://arxiv.org/abs/2309.07352v2",
    "download_url": "https://arxiv.org/abs/2309.07352v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Multivariate Regression Approach to Association Analysis of Quantitative Trait Network",
    "abstract": "Many complex disease syndromes such as asthma consist of a large number of highly related, rather than independent, clinical phenotypes, raising a new technical challenge in identifying genetic variations associated simultaneously with correlated traits. In this study, we propose a new statistical framework called graph-guided fused lasso (GFlasso) to address this issue in a principled way. Our approach explicitly represents the dependency structure among the quantitative traits as a network, and leverages this trait network to encode structured regularizations in a multivariate regression model over the genotypes and traits, so that the genetic markers that jointly influence subgroups of highly correlated traits can be detected with high sensitivity and specificity. While most of the traditional methods examined each phenotype independently and combined the results afterwards, our approach analyzes all of the traits jointly in a single statistical method, and borrow information across correlated phenotypes to discover the genetic markers that perturbe a subset of correlated triats jointly rather than a single trait. Using simulated datasets based on the HapMap consortium data and an asthma dataset, we compare the performance of our method with the single-marker analysis, and other sparse regression methods such as the ridge regression and the lasso that do not use any structural information in the traits. Our results show that there is a significant advantage in detecting the true causal SNPs when we incorporate the correlation pattern in traits using our proposed methods.",
    "authors": [
      "Seyoung Kim",
      "Kyung-Ah Sohn",
      "Eric P. Xing"
    ],
    "publication_date": "2008-11-13T03:44:48Z",
    "arxiv_id": "http://arxiv.org/abs/0811.2026v1",
    "download_url": "https://arxiv.org/abs/0811.2026v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetics-Driven Personalized Disease Progression Model",
    "abstract": "Modeling disease progression through multiple stages is critical for clinical decision-making for chronic diseases, e.g., cancer, diabetes, chronic kidney diseases, and so on. Existing approaches often model the disease progression as a uniform trajectory pattern at the population level. However, chronic diseases are highly heterogeneous and often have multiple progression patterns depending on a patient's individual genetics and environmental effects due to lifestyles. We propose a personalized disease progression model to jointly learn the heterogeneous progression patterns and groups of genetic profiles. In particular, an end-to-end pipeline is designed to simultaneously infer the characteristics of patients from genetic markers using a variational autoencoder and how it drives the disease progressions using an RNN-based state-space model based on clinical observations. Our proposed model shows improvement on real-world and synthetic clinical data.",
    "authors": [
      "Haoyu Yang",
      "Sanjoy Dey",
      "Pablo Meyer"
    ],
    "publication_date": "2025-02-24T21:45:14Z",
    "arxiv_id": "http://arxiv.org/abs/2503.00028v1",
    "download_url": "https://arxiv.org/abs/2503.00028v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Equilibrium in Wright-Fisher models of population genetics",
    "abstract": "For multivariant Wright-Fisher models in population genetics, we introduce equilibrium states, expressed by fluctuations of probability ratio, in contrast to the traditionally used fluctuations, expressed by the difference between the current value of the random process and its equilibrium value. Then the drift component of the dynamic process of gene frequencies, primarily expressed as a ratio of two quadratic forms, is transformed into a cubic parabola with a certain normalization factor.",
    "authors": [
      "D. Koroliouk",
      "V. S. Koroliuk"
    ],
    "publication_date": "2020-06-28T10:29:52Z",
    "arxiv_id": "http://arxiv.org/abs/2007.13482v2",
    "download_url": "https://arxiv.org/abs/2007.13482v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A spatial-correlated multitask linear mixed-effects model for imaging genetics",
    "abstract": "Imaging genetics aims to uncover the hidden relationship between imaging quantitative traits (QTs) and genetic markers (e.g. single nucleotide polymorphism (SNP)), and brings valuable insights into the pathogenesis of complex diseases, such as cancers and cognitive disorders (e.g. the Alzheimer's Disease). However, most linear models in imaging genetics didn't explicitly model the inner relationship among QTs, which might miss some potential efficiency gains from information borrowing across brain regions. In this work, we developed a novel Bayesian regression framework for identifying significant associations between QTs and genetic markers while explicitly modeling spatial dependency between QTs, with the main contributions as follows. Firstly, we developed a spatial-correlated multitask linear mixed-effects model (LMM) to account for dependencies between QTs. We incorporated a population-level mixed effects term into the model, taking full advantage of the dependent structure of brain imaging-derived QTs. Secondly, we implemented the model in the Bayesian framework and derived a Markov chain Monte Carlo (MCMC) algorithm to achieve the model inference. Further, we incorporated the MCMC samples with the Cauchy combination test (CCT) to examine the association between SNPs and QTs, which avoided computationally intractable multi-test issues. The simulation studies indicated improved power of our proposed model compared to classic models where inner dependencies of QTs were not modeled. We also applied the new spatial model to an imaging dataset obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database.",
    "authors": [
      "Zhibin Pu",
      "Shufei Ge"
    ],
    "publication_date": "2024-07-05T14:18:07Z",
    "arxiv_id": "http://arxiv.org/abs/2407.04530v3",
    "download_url": "https://arxiv.org/abs/2407.04530v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Diffusion approximations in population genetics and the rate of Muller's ratchet",
    "abstract": "Diffusion theory is a central tool of modern population genetics, yielding simple expressions for fixation probabilities and other quantities that are not easily derived from the underlying Wright-Fisher model. Unfortunately, the textbook derivation of diffusion equations as scaling limits requires evolutionary parameters (selection coefficients, mutation rates) to scale like the inverse population size -- a severe restriction that does not always reflect biological reality. Here we note that the Wright-Fisher model can be approximated by diffusion equations under more general conditions, including in regimes where selection and/or mutation are strong compared to genetic drift. As an illustration, we use a diffusion approximation of the Wright-Fisher model to improve estimates for the expected time to fixation of a strongly deleterious allele, i.e. the rate of Muller's ratchet.",
    "authors": [
      "Camila Bräutigam",
      "Matteo Smerlak"
    ],
    "publication_date": "2021-11-26T07:50:00Z",
    "arxiv_id": "http://arxiv.org/abs/2111.13344v1",
    "download_url": "https://arxiv.org/abs/2111.13344v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Random Forests on Distance Matrices for Imaging Genetics Studies",
    "abstract": "We propose a non-parametric regression methodology, Random Forests on Distance Matrices (RFDM), for detecting genetic variants associated to quantitative phenotypes representing the human brain's structure or function, and obtained using neuroimaging techniques. RFDM, which is an extension of decision forests, requires a distance matrix as response that encodes all pair-wise phenotypic distances in the random sample. We discuss ways to learn such distances directly from the data using manifold learning techniques, and how to define such distances when the phenotypes are non-vectorial objects such as brain connectivity networks. We also describe an extension of RFDM to detect espistatic effects while keeping the computational complexity low. Extensive simulation results and an application to an imaging genetics study of Alzheimer's Disease are presented and discussed.",
    "authors": [
      "Aaron Sim",
      "Dimosthenis Tsagkrasoulis",
      "Giovanni Montana"
    ],
    "publication_date": "2013-09-24T13:58:16Z",
    "arxiv_id": "http://arxiv.org/abs/1309.6158v1",
    "download_url": "https://arxiv.org/abs/1309.6158v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lotka-Volterra population model of genetic evolution",
    "abstract": "A deterministic model of an age-structured population with genetics analogous to the discrete time Penna model of genetic evolution is constructed on the basis of the Lotka-Volterra scheme. It is shown that if, as in the Penna model, genetic information is represented by the fraction of defective genes in the population, the population numbers for each specific individual's age are represented by exactly the same functions of age in both models. This gives us a new possibility to consider multi-species evolution without using detailed microscopic Penna model.\n  We discuss a particular case of the predator-prey system representing an ecosystem consisting of a limited amount of energy resources consumed by the age-structured species living in this ecosystem. Then, the increase in number of the individuals in the population under consideration depends on the available energy resources, the shape of the distribution function of defective genes in the population and the fertility age. We show that these parameters determine the trend toward equilibrium of the whole ecosystem.",
    "authors": [
      "Miroslaw R. Dudek"
    ],
    "publication_date": "2007-01-20T15:54:21Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0701031v2",
    "download_url": "https://arxiv.org/abs/q-bio/0701031v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]