[
  {
    "title": "Diverse communities behave like typical random ecosystems",
    "abstract": "In 1972, Robert May triggered a worldwide research program studying\necological communities using random matrix theory. Yet, it remains unclear if\nand when we can treat real communities as random ecosystems. Here, we draw on\nrecent progress in random matrix theory and statistical physics to extend May's\napproach to generalized consumer-resource models. We show that in diverse\necosystems adding even modest amounts of noise to consumer preferences results\nin a transition to \"typicality\" where macroscopic ecological properties of\ncommunities are indistinguishable from those of random ecosystems, even when\nresource preferences have prominent designed structures. We test these ideas\nusing numerical simulations on a wide variety of ecological models. Our work\noffers an explanation for the success of random consumer-resource models in\nreproducing experimentally observed ecological patterns in microbial\ncommunities and highlights the difficulty of scaling up bottom-up approaches in\nsynthetic ecology to diverse communities.",
    "authors": [
      "Wenping Cui",
      "Robert Marsland III",
      "Pankaj Mehta"
    ],
    "publication_date": "2019-04-01T23:55:30Z",
    "arxiv_id": "http://arxiv.org/abs/1904.02610v4",
    "download_url": "http://arxiv.org/abs/1904.02610v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time Series Vector Autoregression Prediction of the Ecological Footprint\n  based on Energy Parameters",
    "abstract": "Sustainability became the most important component of world development, as\ncountries worldwide fight the battle against the climate change. To understand\nthe effects of climate change, the ecological footprint, along with the\nbiocapacity should be observed. The big part of the ecological footprint, the\ncarbon footprint, is most directly associated with the energy, and specifically\nfuel sources. This paper develops a time series vector autoregression\nprediction model of the ecological footprint based on energy parameters. The\nobjective of the paper is to forecast the EF based solely on energy parameters\nand determine the relationship between the energy and the EF. The dataset\nincluded global yearly observations of the variables for the period 1971-2014.\nPredictions were generated for every variable that was used in the model for\nthe period 2015-2024. The results indicate that the ecological footprint of\nconsumption will continue increasing, as well as the primary energy consumption\nfrom different sources. However, the energy consumption from coal sources is\npredicted to have a declining trend.",
    "authors": [
      "Radmila Janković",
      "Ivan Mihajlović",
      "Alessia Amelio"
    ],
    "publication_date": "2019-10-25T15:30:40Z",
    "arxiv_id": "http://arxiv.org/abs/1910.11800v1",
    "download_url": "http://arxiv.org/abs/1910.11800v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Information content of high-order associations of the human gut\n  microbiota network",
    "abstract": "The human gastrointestinal tract is an environment that hosts an ecosystem of\nmicroorganisms essential to human health. Vital biological processes emerge\nfrom fundamental inter- and intra-species molecular interactions that influence\nthe assembly and composition of the gut microbiota ecology. Here we quantify\nthe complexity of the ecological relationships within the human infant gut\nmicrobiota ecosystem as a function of the information contained in the\nnonlinear associations of a sequence of increasingly-specified maximum entropy\nrepresentations of the system. Our paradigm frames the ecological state, in\nterms of the presence or absence of individual microbial ecological units that\nare identified by amplicon sequence variants (ASV) in the gut microenvironment,\nas a function of both the ecological states of its neighboring units and, in a\ndeparture from standard graphical model representations, the associations among\nthe units within its neighborhood. We characterize the order of the system\nbased on the relative quantity of statistical information encoded by high-order\nstatistical associations of the infant gut microbiota.",
    "authors": [
      "Weston D. Viles",
      "Juliette C. Madan",
      "Hongzhe Li",
      "Jason C. Moore",
      "Margaret R. Karagas",
      "Anne G. Hoen"
    ],
    "publication_date": "2020-05-16T21:15:15Z",
    "arxiv_id": "http://arxiv.org/abs/2005.08107v2",
    "download_url": "http://arxiv.org/abs/2005.08107v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stability of Ecological Systems: A Theoretical Review",
    "abstract": "The stability of ecological systems is a fundamental concept in ecology,\nwhich offers profound insights into species coexistence, biodiversity, and\ncommunity persistence. In this article, we provide a systematic and\ncomprehensive review on the theoretical frameworks for analyzing the stability\nof ecological systems. Notably, we survey various stability notions, including\nlinear stability, sign stability, diagonal stability, D-stability, total\nstability, sector stability, structural stability, and higher-order stability.\nFor each of these stability notions, we examine necessary or sufficient\nconditions for achieving such stability and demonstrate the intricate interplay\nof these conditions on the network structures of ecological systems. Finally,\nwe explore the future prospects of these stability notions.",
    "authors": [
      "Can Chen",
      "Xu-Wen Wang",
      "Yang-Yu Liu"
    ],
    "publication_date": "2023-12-12T21:10:22Z",
    "arxiv_id": "http://arxiv.org/abs/2312.07737v2",
    "download_url": "http://arxiv.org/abs/2312.07737v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Complexity of Stability Analysis in Higher-order Ecological Networks\n  through Tensor Decompositions",
    "abstract": "Complex ecological networks are often characterized by intricate interactions\nthat extend beyond pairwise relationships. Understanding the stability of\nhigher-order ecological networks is salient for species coexistence,\nbiodiversity, and community persistence. In this article, we present complexity\nanalyses for determining the linear stability of higher-order ecological\nnetworks through tensor decompositions. We are interested in the higher-order\ngeneralized Lotka-Volterra model, which captures high-order interactions using\ntensors of varying orders. To efficiently compute Jacobian matrices and thus\ndetermine stability in large ecological networks, we exploit various tensor\ndecompositions, including higher-order singular value decomposition, Canonical\nPolyadic decomposition, and tensor train decomposition, accompanied by in-depth\ncomputational and memory complexity analyses. We demonstrate the effectiveness\nof our framework with numerical examples.",
    "authors": [
      "Anqi Dong",
      "Can Chen"
    ],
    "publication_date": "2024-01-04T01:50:00Z",
    "arxiv_id": "http://arxiv.org/abs/2401.02023v2",
    "download_url": "http://arxiv.org/abs/2401.02023v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tracking sustainability: co-evolution of economic and ecological\n  activities in the industrialization of the United Kingdom and China",
    "abstract": "The co-evolution of economic and ecological activities represents one of the\nfundamental challenges in the realm of sustainable development. This study on\nthe word trends in mainstream newspapers from the UK and China reveals that\nboth early-industrialised countries and latecomers follow three modes of\neconomic and ecological co-evolution. First, both economic and ecological words\ndemonstrate an S-shaped growth trajectory, and the mode underscores the\nimportance of information propagation, whilst also highlighting the crucial\nrole of self-organisation in the accept society. Second, the co-occurrence of\nthese two type words exhibits a Z-shaped relationship: for two-thirds of the\nobserved period, they display synergistic interactions, while the remaining\ntime shows trade-offs. Lastly, the words related to ecological degradation\nfollow M-shaped trajectories in parallel with economic growth, suggesting\nperiodic disruptions and reconstructions in their interrelationships. Our\nfindings contribute to a more nuanced understanding of the co-evolutionary\nmechanisms that govern collective behaviours in human society.",
    "authors": [
      "Xiaoyu Hou",
      "Tianyi Zhou",
      "Xianyuan Chang",
      "Feng Mao",
      "Zhaoping Wu",
      "Ying Ge",
      "Kang Hao Cheong",
      "Jie Chang",
      "Yong Min"
    ],
    "publication_date": "2024-01-05T08:05:57Z",
    "arxiv_id": "http://arxiv.org/abs/2401.02696v1",
    "download_url": "http://arxiv.org/abs/2401.02696v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A symmetry-based approach to species-rich ecological communities",
    "abstract": "Disordered systems theory provides powerful tools to analyze the generic\nbehaviors of highdimensional systems, such as species-rich ecological\ncommunities or neural networks. By assuming randomness in their interactions,\nuniversality ensures that many microscopic details are irrelevant to\nsystem-wide dynamics; but the choice of a random ensemble still limits the\ngenerality of results. We show here, in the context of ecological dynamics,\nthat these analytical tools do not require a specific choice of ensemble, and\nthat solutions can be found based only on a fundamental rotational symmetry in\nthe interactions, encoding the idea that traits can be recombined into new\nspecies without altering global features. Dynamical outcomes then depend on the\nspectrum of the interaction matrix as a free parameter, allowing us to bridge\nbetween results found in different models of interactions, and extend beyond\nthem to previously unidentified behaviors. The distinctive feature of\necological models is the possibility of species extinctions, which leads to an\nincreased universality of dynamics as the fraction of extinct species\nincreases. We expect that these findings can inform new developments in\ntheoretical ecology as well as for other families of complex systems.",
    "authors": [
      "Juan Giral Martínez"
    ],
    "publication_date": "2024-07-18T12:12:39Z",
    "arxiv_id": "http://arxiv.org/abs/2407.13444v2",
    "download_url": "http://arxiv.org/abs/2407.13444v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Learning to learn ecosystems from limited data -- a meta-learning\n  approach",
    "abstract": "A fundamental challenge in developing data-driven approaches to ecological\nsystems for tasks such as state estimation and prediction is the paucity of the\nobservational or measurement data. For example, modern machine-learning\ntechniques such as deep learning or reservoir computing typically require a\nlarge quantity of data. Leveraging synthetic data from paradigmatic nonlinear\nbut non-ecological dynamical systems, we develop a meta-learning framework with\ntime-delayed feedforward neural networks to predict the long-term behaviors of\necological systems as characterized by their attractors. We show that the\nframework is capable of accurately reconstructing the ``dynamical climate'' of\nthe ecological system with limited data. Three benchmark population models in\necology, namely the Hastings-Powell model, a three-species food chain, and the\nLotka-Volterra system, are used to demonstrate the performance of the\nmeta-learning based prediction framework. In all cases, enhanced accuracy and\nrobustness are achieved using five to seven times less training data as\ncompared with the corresponding machine-learning method trained solely from the\necosystem data. A number of issues affecting the prediction performance are\naddressed.",
    "authors": [
      "Zheng-Meng Zhai",
      "Bryan Glaz",
      "Mulugeta Haile",
      "Ying-Cheng Lai"
    ],
    "publication_date": "2024-10-02T16:23:34Z",
    "arxiv_id": "http://arxiv.org/abs/2410.07368v1",
    "download_url": "http://arxiv.org/abs/2410.07368v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "EcoWikiRS: Learning Ecological Representation of Satellite Images from\n  Weak Supervision with Species Observations and Wikipedia",
    "abstract": "The presence of species provides key insights into the ecological properties\nof a location such as land cover, climatic conditions or even soil properties.\nWe propose a method to predict such ecological properties directly from remote\nsensing (RS) images by aligning them with species habitat descriptions. We\nintroduce the EcoWikiRS dataset, consisting of high-resolution aerial images,\nthe corresponding geolocated species observations, and, for each species, the\ntextual descriptions of their habitat from Wikipedia. EcoWikiRS offers a\nscalable way of supervision for RS vision language models (RS-VLMs) for\necology. This is a setting with weak and noisy supervision, where, for\ninstance, some text may describe properties that are specific only to part of\nthe species' niche or is irrelevant to a specific image. We tackle this by\nproposing WINCEL, a weighted version of the InfoNCE loss. We evaluate our model\non the task of ecosystem zero-shot classification by following the habitat\ndefinitions from the European Nature Information System (EUNIS). Our results\nshow that our approach helps in understanding RS images in a more ecologically\nmeaningful manner. The code and the dataset are available at\nhttps://github.com/eceo-epfl/EcoWikiRS.",
    "authors": [
      "Valerie Zermatten",
      "Javiera Castillo-Navarro",
      "Pallavi Jain",
      "Devis Tuia",
      "Diego Marcos"
    ],
    "publication_date": "2025-04-28T12:42:18Z",
    "arxiv_id": "http://arxiv.org/abs/2504.19742v1",
    "download_url": "http://arxiv.org/abs/2504.19742v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Scaling the human niche",
    "abstract": "The human niche represents the intersection of biological, ecological,\ncultural, and technological processes that have co-evolved to shape human\nadaptation and societal complexity. This paper explores the human niche through\nthe lens of macroecological scaling theory, seeking to define and quantify the\ndimensions along which human ecological strategies have diversified. By\nleveraging concepts from classic niche theory, niche construction, and complex\nadaptive systems, I develop a framework for understanding human ecology as both\npredictable within mammalian scaling relationships and uniquely divergent due\nto social, cognitive, and technological factors. Key dimensions of the human\nniche-metabolism, cognition, sociality, and computation-are examined through\nscaling laws that structure human interactions with the environment and each\nother. The paper demonstrates how human niche expansion over evolutionary time\nhas been characterized by increasing metabolic consumption, information\nprocessing capacity, and the formation of larger, more interconnected social\nnetworks. This cumulative trajectory has led to the unprecedented scale of\ncontemporary human societies, with implications for sustainability, economic\ndevelopment, and future niche expansion, including into space. The study\nunderscores the need for an integrative, quantitative approach to human ecology\nthat situates human adaptability within broader ecological and evolutionary\nconstraints.",
    "authors": [
      "Marcus J. Hamilton"
    ],
    "publication_date": "2025-06-26T00:16:44Z",
    "arxiv_id": "http://arxiv.org/abs/2506.20902v1",
    "download_url": "http://arxiv.org/abs/2506.20902v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Plant-Centric Metaverse: A Biocentric-Creation Framework for Ecological\n  Art and Digital Symbiosis",
    "abstract": "Digital ecological art represents an emergent frontier where biological media\nconverge with virtual environments. This study examines the paradigm shift from\nanthropocentric to plant-centered artistic narratives within the metaverse,\ncontextualizing how digital platforms transform ecological expression. However,\ncurrent frameworks fail to systematically guide artists in leveraging plant\nagency for digital symbiosis that transcends human-centered creation. We\npropose the Biocentric-Creation Transformation Ideology (BCTI) framework and\nvalidate it through multimodal case studies spanning bio-art, NFTs, and VR\necosystems (2013-2023). Our analysis reveals: (1) Metaverse ecosystems enable\nunprecedented plant-algorithm co-creation, with biological artworks increasing\nby 133% in premier archives (2020 vs 2013); (2) Digital symbiosis manifests\nthrough blockchain DAOs where plants govern human-plant collaborations; (3)\nAlgorithmic photosynthesis in VR environments reshapes ecological aesthetics\nthrough real-time biodata translation. The BCTI framework advances ecological\nart theory by systematizing the transition from representation to\nplant-centered agency, offering artists a blueprint for post-anthropocene\ncreation. This redefines environmental consciousness in virtual realms while\nestablishing new protocols for cross-species digital collaboration.",
    "authors": [
      "Ze Gao",
      "Mengyao Guo",
      "Zheng Wang",
      "Xiaolin Zhang",
      "Sihuang Man"
    ],
    "publication_date": "2025-08-06T12:37:12Z",
    "arxiv_id": "http://arxiv.org/abs/2508.04391v1",
    "download_url": "http://arxiv.org/abs/2508.04391v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bridging Farm Economics and Landscape Ecology for Global Sustainability\n  through Hierarchical and Bayesian Optimization",
    "abstract": "Agricultural landscapes face the dual challenge of sustaining food production\nwhile reversing biodiversity loss. Agri-environmental policies often fall short\nof delivering ecological functions such as landscape connectivity, in part due\nto a persistent disconnect between farm-level economic decisions and\nlandscape-scale spatial planning. We introduce a novel hierarchical\noptimization framework that bridges this gap. First, an Ecological\nIntensification (EI) model determines the economically optimal allocation of\nland to margin and habitat interventions at the individual farm level. These\nfarm-specific intervention levels are then passed to an Ecological Connectivity\n(EC) model, which spatially arranges them across the landscape to maximize\nconnectivity while preserving farm-level profitability. Finally, we introduce a\nBayesian Optimization (BO) approach that translates these spatial outcomes into\nsimple, cost effective, and scalable policy instruments, such as subsidies and\neco-premiums, using non-spatial, farm-level policy parameters. Applying the\nframework to a Canadian agricultural landscape, we demonstrate how it enhances\nconnectivity under real-world economic constraints. Our approach provides a\nglobally relevant tool for aligning farm incentives with biodiversity goals,\nadvancing the development of agri-environmental policies that are economically\nviable and ecologically effective.",
    "authors": [
      "Kevin Bradley Dsouza",
      "Graham Alexander Watt",
      "Yuri Leonenko",
      "Juan Moreno-Cruz"
    ],
    "publication_date": "2025-08-08T15:16:15Z",
    "arxiv_id": "http://arxiv.org/abs/2508.06386v1",
    "download_url": "http://arxiv.org/abs/2508.06386v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Scarce Data, Noisy Inferences, and Overfitting: The Hidden Flaws in\n  Ecological Dynamics Modelling",
    "abstract": "Metagenomic data has significantly advanced microbiome research by employing\necological models, particularly in personalised medicine. The generalised\nLotka-Volterra (gLV) model is commonly used to understand microbial\ninteractions and predict ecosystem dynamics. However, gLV models often fail to\ncapture complex interactions, especially when data is limited or noisy. This\nstudy critically assesses the effectiveness of gLV and similar models using\nBayesian inference and a model reduction method based on information theory. We\nfound that ecological data often leads to non-interpretability and overfitting\ndue to limited information, noisy data, and parameter sloppiness. Our results\nhighlight the need for simpler models that align with the available data and\npropose a distribution-based approach to better capture ecosystem diversity,\nstability, and competition. These findings challenge current bottom-up\necological modelling practices and aim to shift the focus toward a Statistical\nMechanics view of ecology based on distributions of parameters.",
    "authors": [
      "Mario Castro",
      "Rafael Vida",
      "Javier Galeano",
      "José A. Cuesta"
    ],
    "publication_date": "2025-10-04T07:44:40Z",
    "arxiv_id": "http://arxiv.org/abs/2510.03718v1",
    "download_url": "http://arxiv.org/abs/2510.03718v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Star Cluster Ecology I: A Cluster Core with Encounters between Single\n  Stars",
    "abstract": "Star clusters with a high central density contain an ecological network of\nevolving binaries, affected by interactions with passing stars, while in turn\naffecting the energy budget of the cluster as a whole by giving off binding\nenergy. This is the first paper in a series aimed at providing the tools for\nincreasingly realistic simulations of these ecological networks.",
    "authors": [
      "Simon F. Portegies Zwart",
      "Piet Hut",
      "Frank Verbunt"
    ],
    "publication_date": "1997-01-09T08:28:37Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/9701042v1",
    "download_url": "http://arxiv.org/abs/astro-ph/9701042v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Integrability and Chaotic behaviour of an ecological model",
    "abstract": "A three species food chain model is studied analytically as well as\nnumerically. Integrability of the model is studied using Painleve analysis\nwhile chaotic behaviour is studied using numerical techniques, such as\ncalculation of Lyapunov exponents, plotting the bifurcation diagram and phase\nplots. We correct and critically comment on the wrong results reported recently\non this ecological model, in a paper by Rai ([1995] ``Modelling ecological\nsystems'', Int. J. Bifurcation and Chaos 5, 537-543).",
    "authors": [
      "M. P. Joy"
    ],
    "publication_date": "1996-12-02T14:16:29Z",
    "arxiv_id": "http://arxiv.org/abs/chao-dyn/9612003v1",
    "download_url": "http://arxiv.org/abs/chao-dyn/9612003v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Synchronization, Persistence and Seasonality in some Spatially\n  Inhomogeneous Models in Epidemics and Ecology",
    "abstract": "Recent studies in ecology and epidemiology indicate that it is important to\ninclude spatial heterogeneity, synchronization and seasonality in the\ntheoretical models. In this work, spatial heterogeneity is introduced via\ncoupled map lattices (CML) and partial differential equations. Stability and\npersistence of some realistic CML are discussed. Chaos control, synchronization\nand persistence are studied for some CML. Some applications in population\nbiology and ecology are given. A simple method for finding the sufficient\nconditions for the existence of periodic solutions for differential equations\nwith periodic coefficients is given. This will simplify the study of\nseasonality.",
    "authors": [
      "E. Ahmed",
      "A. S. Hegazi",
      "A. S. Elgazzar",
      "H. M. Yehia"
    ],
    "publication_date": "2001-07-31T12:09:16Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0107629v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0107629v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Models of Evolution in Genetics, Ecology and Linguistics",
    "abstract": "We give a overview of stochastic models of evolution that have found\napplications in genetics, ecology and linguistics for an audience of\nnonspecialists, especially statistical physicists. In particular, we focus\nmostly on neutral models in which no intrinsic advantage is ascribed to a\nparticular type of the variable unit, for example a gene, appearing in the\ntheory. In many cases these models are exactly solvable and furthermore go some\nway to describing observed features of genetic, ecological and linguistic\nsystems.",
    "authors": [
      "R. A. Blythe",
      "A. J. McKane"
    ],
    "publication_date": "2007-03-19T09:17:18Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0703478v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0703478v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An axiomatic theory for interaction between species in ecology: Gause's\n  exclusion conjecture",
    "abstract": "I introduce an axiomatic representation, called ecoset, to consider\ninteractions between species in ecological systems. For interspecific\ncompetition, the exclusion conjecture (Gause) is put in a symbolic way and used\nas a basic operational tool to consider more complex cases like two species\nwith two superposed resources (niche differentiation) and apparent competitors.\nCompetition between tortoises and invaders in Galapagos islands is considered\nas a specific example. Our theory gives us an operative language to consider\nelementary process in ecology and open a route to more complex systems.",
    "authors": [
      "J. C. Flores"
    ],
    "publication_date": "2006-11-20T19:10:22Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0611065v1",
    "download_url": "http://arxiv.org/abs/q-bio/0611065v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Time Invariance Principle, Ecological (Non)Chaos, and A Fundamental\n  Pitfall of Discrete Modeling",
    "abstract": "This paper is to show that most discrete models used for population dynamics\nin ecology are inherently pathological that their predications cannot be\nindependently verified by experiments because they violate a fundamental\nprinciple of physics. The result is used to tackle an on-going controversy\nregarding ecological chaos. Another implication of the result is that all\ncontinuous dynamical systems must be modeled by differential equations. As a\nresult it suggests that researches based on discrete modeling must be closely\nscrutinized and the teaching of calculus and differential equations must be\nemphasized for students of biology.",
    "authors": [
      "Bo Deng"
    ],
    "publication_date": "2007-02-23T16:36:48Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0702048v3",
    "download_url": "http://arxiv.org/abs/q-bio/0702048v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A useful correspondence between fluid convection and ecosystem operation",
    "abstract": "Both ecological systems and convective fluid systems are examples of open\nsystems which operate far-from-equilibrium. This article demonstrates that\nthere is a correspondence between a resource-consumer chemostat ecosystem and\nthe Rayleigh-Benard (RB) convective fluid system. The Lorenz dynamics of the RB\nsystem can be translated into an ecosystem dynamics. Not only is there a\ncorrespondence between the dynamical equations, also the physical\ninterpretations show interesting analogies. By using this fluid-ecosystem\nanalogy, we are able to derive the correct value of the size of convection\nrolls by competitive fitness arguments borrowed from ecology. We finally\nconjecture that the Lorenz dynamics can be extended to describe more complex\nconvection patterns that resemble ecological predation.",
    "authors": [
      "S. Bruers",
      "F. Meysman"
    ],
    "publication_date": "2007-08-01T08:42:12Z",
    "arxiv_id": "http://arxiv.org/abs/0708.0091v1",
    "download_url": "http://arxiv.org/abs/0708.0091v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Niche Modeling: Ecological Metaphors for Sustainable Software in Science",
    "abstract": "This position paper is aimed at providing some history and provocations for\nthe use of an ecological metaphor to describe software development\nenvironments. We do not claim that the ecological metaphor is the best or only\nway of looking at software - rather we want to ask if it can indeed be a\nproductive and thought provoking one.",
    "authors": [
      "Nicholas Weber",
      "Andrea Thomer",
      "Michael Twidale"
    ],
    "publication_date": "2013-09-07T02:56:56Z",
    "arxiv_id": "http://arxiv.org/abs/1309.1810v1",
    "download_url": "http://arxiv.org/abs/1309.1810v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modelling ecological communities as if they were DNA",
    "abstract": "Ecologists are interested in understanding and predicting how ecological\ncommunities change through time. While it might seem natural to measure this\nthrough changes in species' abundances, computational limitations mean\ntransitions between community types are often modelled instead. We present an\napproach inspired by DNA substitution models that attempts to estimate historic\ninteractions between species, and thus estimate turnover rates in ecological\ncommunities. Although our simulations show that the method has some\nlimitations, our application to butterfly community data shows the method can\ndetect signal in real data. Open source C++ code implementing the method is\navailable at http://www.github.com/willpearse/lotto.",
    "authors": [
      "William D. Pearse",
      "Andy Purvis",
      "David B. Roy",
      "Alexandros Stamatakis"
    ],
    "publication_date": "2014-03-29T20:48:19Z",
    "arxiv_id": "http://arxiv.org/abs/1403.7668v1",
    "download_url": "http://arxiv.org/abs/1403.7668v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Malware \"Ecology\" Viewed as Ecological Succession: Historical Trends and\n  Future Prospects",
    "abstract": "The development and evolution of malware including computer viruses, worms,\nand trojan horses, is shown to be closely analogous to the process of community\nsuccession long recognized in ecology. In particular, both changes in the\noverall environment by external disturbances, as well as, feedback effects from\nmalware competition and antivirus coevolution have driven community succession\nand the development of different types of malware with varying modes of\ntransmission and adaptability.",
    "authors": [
      "Reginald D. Smith"
    ],
    "publication_date": "2014-09-24T17:04:05Z",
    "arxiv_id": "http://arxiv.org/abs/1410.8082v1",
    "download_url": "http://arxiv.org/abs/1410.8082v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ecological metrics of diversity in understanding social media",
    "abstract": "Topical discussion networks (TDNs) are networks centered around a discourse\nconcerning a particular concept, whether in real life or online. This paper\nanalogises the population of such networks to populations encountered in\nmathematical ecology, and seeks to evaluate whether three metrics of diversity\nused in ecology - Shannon's $H'$, Simpson's $\\lambda$ and $E_{var}$ proposed by\nSmith and Wilson - give valuable information about the composition and\ndiversity of TDNs. It concludes that each metric has its particular use, and\nthe choice of metric is best understood in the context of the particular\nresearch question.",
    "authors": [
      "Chris von Csefalvay"
    ],
    "publication_date": "2015-01-29T21:45:40Z",
    "arxiv_id": "http://arxiv.org/abs/1501.07621v1",
    "download_url": "http://arxiv.org/abs/1501.07621v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic structures generating reaction-diffusion models: the\n  activator-substrate system",
    "abstract": "We shall construct a class of nonlinear reaction-diffusion equations starting\nfrom an infinitesimal algebraic skeleton. Our aim is to explore the possibility\nof an algebraic foundation of integrability properties and of stability of\nequilibrium states associated with nonlinear models describing patterns\nformation.",
    "authors": [
      "Marcella Palese"
    ],
    "publication_date": "2015-02-12T14:54:47Z",
    "arxiv_id": "http://arxiv.org/abs/1502.03688v3",
    "download_url": "http://arxiv.org/abs/1502.03688v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fine-grained simulations of the microenvironment of vascularized tumours",
    "abstract": "One of many important features of the tumour microenvironment is that it is a\nplace of active Darwinian selection where different tumour clones become\nadapted to the variety of ecological niches that make up the microenvironment.\nThese evolutionary processes turn the microenvironment into a powerful source\nof tumour heterogeneity and contribute to the development of drug resistance in\ncancer. Here, we describe a computational tool to study the ecology of the\nmicroenvironment and report results about the ecology of the tumour\nmicroenvironment and its evolutionary dynamics.",
    "authors": [
      "Thierry Fredrich",
      "Heiko Rieger",
      "Roberto Chignola",
      "Edoardo Milotti"
    ],
    "publication_date": "2019-06-06T06:51:19Z",
    "arxiv_id": "http://arxiv.org/abs/1906.02441v1",
    "download_url": "http://arxiv.org/abs/1906.02441v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nine tips for ecologists using machine learning",
    "abstract": "Due to their high predictive performance and flexibility, machine learning\nmodels are an appropriate and efficient tool for ecologists. However,\nimplementing a machine learning model is not yet a trivial task and may seem\nintimidating to ecologists with no previous experience in this area. Here we\nprovide a series of tips to help ecologists in implementing machine learning\nmodels. We focus on classification problems as many ecological studies aim to\nassign data into predefined classes such as ecological states or biological\nentities. Each of the nine tips identifies a common error, trap or challenge in\ndeveloping machine learning models and provides recommendations to facilitate\ntheir use in ecological studies.",
    "authors": [
      "Marine Desprez",
      "Vincent Miele",
      "Olivier Gimenez"
    ],
    "publication_date": "2023-05-17T15:41:08Z",
    "arxiv_id": "http://arxiv.org/abs/2305.10472v2",
    "download_url": "http://arxiv.org/abs/2305.10472v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Action Research in Astronomy and Ecology: The observatory of the night\n  environment in Grenoble",
    "abstract": "We present an example of low-carbon research activity carried out by\nastrophysicists and focused on ecology and environmental protection, with\ndirect impacts on territories and society. This project serves as an\nillustration of action research for an astrophysics lab in the context of the\ncurrent ecological crisis.",
    "authors": [
      "Julien Milli",
      "Merlin Boribon",
      "Fabien Malbet",
      "Philippe Deverchere",
      "Benjamin Drillat",
      "Baptiste Falque",
      "Francois Colas"
    ],
    "publication_date": "2024-10-09T07:45:22Z",
    "arxiv_id": "http://arxiv.org/abs/2410.07280v2",
    "download_url": "http://arxiv.org/abs/2410.07280v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rethinking Competition as a Non-Beneficial Mechanism in Economic Systems",
    "abstract": "Persistent economic competition is often justified as a mechanism of\ninnovation, efficiency, and welfare maximization. Yet empirical evidence across\ndisciplines reveals that competition systematically generates fragility,\ninequality, and ecological degradation, emergent outcomes not of isolated\nfailures but of underlying systemic dynamics. This work reconceptualizes\neconomic ecosystems as real complex adaptive systems, structurally isomorphic\nwith biological and social ecosystems. Integrating complexity science,\nevolutionary biology, ecology, and economic and business theory, we classify\neconomic interactions according to their systemic effects and propose a\ntheoretical model of ecosystemic equilibrium based on the predominance of\nbeneficial versus non-beneficial relationships. Recognizing economies as\necologically embedded and structurally interdependent systems provides a novel\nframework for analyzing systemic resilience, reframing competition as a\nnon-beneficial mechanism.",
    "authors": [
      "Marcelo S. Tedesco",
      "Gonzalo Marquez"
    ],
    "publication_date": "2025-06-13T02:05:19Z",
    "arxiv_id": "http://arxiv.org/abs/2506.11405v1",
    "download_url": "http://arxiv.org/abs/2506.11405v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Lotka-Volterra Predator-Prey Model with Disturbance",
    "abstract": "The forces which drive growth, development, survival and change within an\necological system involving a predator and prey specie are not easily addressed\nin the field. To better understand the dynamics in the system, ecologists have\nturned to mathematical models. The predator-prey dynamics of rat and cat\npopulation in a given ecology is studied. The mathematical model proposed by\nAlfred J. Lotka and Vito Volterra called the Lotka-Volterra model for studying\npredator-prey dynamics is utilized. Assumptions were made to suit the given\necology. These assumptions lead to the modification of the Lotka-Volterra\nequations. The equilibrium and stability properties of the modified model is\nestablished. Results were simulated using MATLAB.",
    "authors": [
      "Arhonefe Joseph Ogethakpo",
      "Sunday Amaju Ojobor"
    ],
    "publication_date": "2025-09-25T14:38:18Z",
    "arxiv_id": "http://arxiv.org/abs/2510.09628v1",
    "download_url": "http://arxiv.org/abs/2510.09628v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Early warning signs in social-ecological networks",
    "abstract": "Social ecological systems are often difficult to investigate and manage\nbecause of their inherent complexity1. Small variations in external drivers can\nlead to abrupt changes associated with instabilities and bifurcations in the\nunderlying dynamics2-4. Anticipating critical transitions and divergence from\nthe present state of the system is particularly crucial to the prevention or\nmitigation of the effects of unwanted and irreversible changes5-10. Recent\nresearch in ecology has focused on leading indicators of regime shift in\necosystems characterized by one state variable5,7,11,12. The case of systems\nwith several mutually interacting components, however, has remained poorly\ninvestigated13, while the connection between network stability and research on\nindicators for loss of resilience has been elusive14. Here we develop a\ntheoretical framework to analyze early warning signs of instability and regime\nshift in social ecological networks. We provide analytical expressions for a\nset of precursors of instability in social ecological systems with additive\nnoise for a variety of network structures. In particular, we show that the\ncovariance matrix of the dynamics can effectively anticipate the emergence of\ninstability. We also compare signals of early warning based on the dynamics of\nsuitably selected nodes, to indicators based on the integrated behavior of the\nwhole network. We find that the performances of these indicators are affected\nby the network structure and the type of interaction among nodes. These results\nprovide new advances in multidimensional early warning analysis and offer a\nframework to evaluate the resilience of social ecological networks.",
    "authors": [
      "Samir Suweis",
      "Paolo D'Odorico"
    ],
    "publication_date": "2014-03-07T09:22:07Z",
    "arxiv_id": "http://arxiv.org/abs/1403.2292v1",
    "download_url": "http://arxiv.org/abs/1403.2292v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparing process-based and constraint-based approaches for modeling\n  macroecological patterns",
    "abstract": "Ecological patterns arise from the interplay of many different processes, and\nyet the emergence of consistent phenomena across a diverse range of ecological\nsystems suggests that many patterns may in part be determined by statistical or\nnumerical constraints. Differentiating the extent to which patterns in a given\nsystem are determined statistically, and where it requires explicit ecological\nprocesses, has been difficult. We tackled this challenge by directly comparing\nmodels from a constraint-based theory, the Maximum Entropy Theory of Ecology\n(METE) and models from a process-based theory, the size-structured neutral\ntheory (SSNT). Models from both theories were capable of characterizing the\ndistribution of individuals among species and the distribution of body size\namong individuals across 76 forest communities. However, the SSNT models\nconsistently yielded higher overall likelihood, as well as more realistic\ncharacterizations of the relationship between species abundance and average\nbody size of conspecific individuals. This suggests that the details of the\nbiological processes contain additional information for understanding community\nstructure that are not fully captured by the METE constraints in these systems.\nOur approach provides a first step towards differentiating between process- and\nconstraint-based models of ecological systems and a general methodology for\ncomparing ecological models that make predictions for multiple patterns.",
    "authors": [
      "Xiao Xiao",
      "James P. O'Dwyer",
      "Ethan P. White"
    ],
    "publication_date": "2015-02-10T03:22:39Z",
    "arxiv_id": "http://arxiv.org/abs/1502.02767v4",
    "download_url": "http://arxiv.org/abs/1502.02767v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The ecological and evolutionary energetics of hunter-gatherer\n  residential mobility",
    "abstract": "Residential mobility is deeply entangled with all aspects of hunter-gatherer\nlife ways, and is therefore an issue of central importance in hunter-gatherer\nstudies. Hunter-gatherers vary widely in annual rates of residential mobility,\nand understanding the sources of this variation has long been of interest to\nanthropologists and archaeologists. Since mobility is, to a large extent,\ndriven by the need for a continuous supply of food, a natural framework for\naddressing this question is provided by the metabolic theory of ecology. This\nprovides a powerful framework for formulating formal testable hypotheses\nconcerning evolutionary and ecological constraints on the scale and variation\nof hunter-gatherer residential mobility. We evaluate these predictions using\nextant data and show strong support for the hypotheses. We show that the\noverall scale of hunter-gatherer residential mobility is predicted by average\nhuman body size, and the limited capacity of mobile hunter-gatherers to store\nenergy internally. We then show that the majority of variation in residential\nmobility observed across cultures is predicted by energy availability in local\necosystems. Our results demonstrate that large-scale evolutionary and\necological processes, common to all plants and animals, constrain\nhunter-gatherers in predictable ways as they move through territories to\neffectively exploit resources over the course of a year. Moreover, our results\nextend the scope of the metabolic theory of ecology by showing how it\nsuccessfully predicts variation in the behavioral ecology of populations within\na species.",
    "authors": [
      "Marcus J. Hamilton",
      "Jose Lobo",
      "Eric Rupley",
      "Hyejin Youn",
      "Geoffrey B. West"
    ],
    "publication_date": "2016-02-01T18:32:49Z",
    "arxiv_id": "http://arxiv.org/abs/1602.00631v1",
    "download_url": "http://arxiv.org/abs/1602.00631v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High temporal variability in the occurrence of consumer-resource\n  interactions in ecological networks",
    "abstract": "Ecological networks are theoretical abstractions that represent ecological\ncommunities. These networks are usually defined as static entities, in which\nthe occurrence of a particular interaction between species is considered fixed\ndespite the intrinsic dynamics of ecological systems. However, empirical\nanalysis of the temporal variation of trophic interactions is constrained by\nthe lack of data with high spatial, temporal, and taxonomic resolution. Here,\nwe evaluate the spatiotemporal variability of multiple consumer-resource\ninteractions of large marine networks. The tropic interactions of all of the\nanalyzed networks had low temporal persistence, which was well described by a\ncommon exponential decay in the rank-frequency relationship of\nconsumer-resource interactions. This common pattern of low temporal persistence\nwas evident despite the dissimilarities of environmental conditions among\nsites. Between-site rank correlations of frequency of occurrence of\ninteractions ranged from 0.59 to 0.73. After removing the interactions with\n<50% frequency, the between-site correlations decreased to values between 0.60\nand 0.28, indicating that low-frequency interactions accounted for the apparent\nsimilarities between sites. Our results showed that the communities studied\nwere characterized by few persistent interactions and a large number of\ntransient trophic interactions. We suggest that consumer-resource temporal\nasynchrony in addition to varying local environmental conditions and\nopportunistic foraging could be among the mechanisms generating the observed\nrank-frequency relationship of trophic interactions. Therefore, our results\nquestion the analysis of ecological communities as static and persistent\nnatural entities and stress the need for strengthening the analysis of temporal\nvariability in ecological networks and long-term studies.",
    "authors": [
      "Daniela N. Lopez",
      "Patricio A. Camus",
      "Nelson Valdivia",
      "Sergio A. Estay"
    ],
    "publication_date": "2016-04-08T19:20:42Z",
    "arxiv_id": "http://arxiv.org/abs/1604.02454v1",
    "download_url": "http://arxiv.org/abs/1604.02454v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Using Ecological Propensity Score to Adjust for Missing Confounders in\n  Small Area Studies",
    "abstract": "Small area ecological studies are commonly used in epidemiology to assess the\nimpact of area level risk factors on health outcomes when data are only\navailable in an aggregated form. However the resulting estimates are often\nbiased due to unmeasured confounders, which typically are not available from\nthe standard administrative registries used for these studies. Extra\ninformation on confounders can be provided through external datasets such as\nsurveys or cohorts, where the data are available at the individual level rather\nthan at the area level; however such data typically lack the geographical\ncoverage of administrative registries. We develop a framework of analysis which\ncombines ecological and individual level data from different sources to provide\nan adjusted estimate of area level risk factors which is less biased. Our\nmethod (i) summarises all available individual level confounders into an area\nlevel scalar variable, which we call ecological propensity score (EPS), (ii)\nimplements a hierarchical structured approach to predict the values of EPS\nwhenever they are missing, (iii) includes the estimated and predicted EPS into\nthe ecological regression linking the risk factors to the health outcome.\nThrough a simulation study we show that integrating individual level data into\nsmall area analyses via EPS is a promising method to reduce the bias intrinsic\nin ecological studies due to unmeasured confounders; we also apply the method\nto a real case study to evaluate the effect of air pollution on coronary heart\ndisease hospital admissions in Greater London.",
    "authors": [
      "Yingbo Wang",
      "Sylvia Richardson",
      "Anna Hansell",
      "Marta Blangiardo"
    ],
    "publication_date": "2016-05-03T09:40:24Z",
    "arxiv_id": "http://arxiv.org/abs/1605.00814v2",
    "download_url": "http://arxiv.org/abs/1605.00814v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MI-Sim: A MATLAB Package for the Numerical Analysis of Microbial\n  Ecological Interactions",
    "abstract": "Food-webs and other classes of ecological network motifs, are a means of\ndescribing feeding relationships between consumers and producers in an\necosystem. They have application across scales where they differ only in the\nunderlying characteristics of the organisms and substrates describing the\nsystem. Mathematical modelling, using mechanistic approaches to describe the\ndynamic behaviour and properties of the system through sets of ordinary\ndifferential equations, has been used extensively in ecology. Models allow\nsimulation of the dynamics of the various motifs and their numerical analysis\nprovides a greater understanding of the interplay between the system components\nand their intrinsic properties. We have developed the MI-Sim software for use\nwith MATLAB to allow a rigorous and rapid numerical analysis of several common\necological motifs. MI-Sim contains a series of the most commonly used motifs\nsuch as cooperation, competition and predation. It does not require detailed\nknowledge of mathematical analytical techniques and is offered as a single\ngraphical user interface containing all input and output options. The tools\navailable in the current version of MI-Sim include model simulation, steady-\nstate existence and stability analysis, and basin of attraction analysis. The\nsoftware includes seven ecological interaction motifs and seven growth function\nmodels. Unlike other system analysis tools, MI-Sim is designed as a simple and\nuser-friendly tool specific to ecological population type models, allowing for\nrapid assessment of their dynamical and behavioural properties.",
    "authors": [
      "M. J. Wade",
      "J. Oakley",
      "S. Harbisher",
      "N. G. Parker",
      "J. Dolfing"
    ],
    "publication_date": "2016-10-12T16:57:20Z",
    "arxiv_id": "http://arxiv.org/abs/1610.03786v1",
    "download_url": "http://arxiv.org/abs/1610.03786v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A comparative study of ecological networks using spectral projections of\n  normalized graph Laplacian",
    "abstract": "Ecological networks originating as a result of three different ecological\nprocesses are examined and cross-compared to assess if the underlying\necological processes in these systems produce considerable difference in the\nstructure of the networks. Absence of any significant difference in the\nstructure of the networks may indicate towards the possibility of a universal\nstructural pattern in these ecological networks. The underlying graphs of the\nnetworks derived by the ecological processes, namely host-parasite interaction,\nplant pollination and seed dispersion are all bipartite graphs and thus several\nalgebraic structural measures fail to distinguish between the structure of\nthese networks. In this work we use weighted spectral distribution (WSD) of\nnormalized graph Laplacian, which have been effectively used earlier to\ndiscriminate graphs with different topologies, to investigate the possibility\nof existence of structural dissimilarity in these networks. Graph spectrum is\noften considered a signature of the graph and WSD of the graph Laplacian is\nshown to be related to the distribution of some small subgraphs in a graph and\nhence represent the global structure of a network.We use random projections of\nWSD to $\\mathbb{R}^{2}$ and $\\mathbb{R}^{3}$ and establish that the structure\nof plant pollinator networks is significantly different as compared to\nhost-parasite and seed dispersal networks. The structures of host parasite\nnetworks and seed dispersal networks are found to be identical. Furthermore, we\nuse some algebraic structural measures in order to quantify the differences as\nwell as similarities observed in the structure of the three kinds of networks.\nWe thus infer that our work suggests an absence of a universal structural\npattern in these three different kinds of networks.",
    "authors": [
      "Shashankaditya Upadhyay",
      "Sudeepto Bhattacharya"
    ],
    "publication_date": "2018-11-05T05:49:03Z",
    "arxiv_id": "http://arxiv.org/abs/1811.01935v1",
    "download_url": "http://arxiv.org/abs/1811.01935v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Prosumer Economy -- Being Like a Forest",
    "abstract": "Planetary life support systems are collapsing due to climate change and the\nbiodiversity crisis. The root cause is the existing consumer economy, coupled\nwith profit maximisation based on ecological and social externalities. Trends\ncan be reversed, civilisation may be saved by transforming the profit\nmaximising consumer economy into an ecologically and socially just economy,\nwhich we call the prosumer economy. Prosumer economy is a macro scale circular\neconomy with minimum negative or positive ecological and social impact, an\necosystem of producers and prosumers, who have synergistic and circular\nrelationships with deepened circular supply chains, networks, where leakage of\nwealth out of the system is minimised. In a prosumer economy there is no waste,\nno lasting negative impacts on the ecology and no social exploitation. The\nprosumer economy is like a lake or a forest, an economic ecosystem that is\nproductive and supportive of the planet. We are already planting this forest\nthrough Good4Trust.org, started in Turkey. Good4Trust is a community platform\nbringing together ecologically and socially just producers and prosumers.\nProsumers come together around a basic ethical tenet the golden rule and share\non the platform their good deeds. The relationship are already deepening and\ncircularity is forming to create a prosumer economy. The platforms software to\nstructure the economy is open source, and is available to be licenced to start\nGood4Trust anywhere on the planet. Complexity theory tells us that if enough\nagents in a given system adopt simple rules which they all follow, the system\nmay shift. The shift from a consumer economy to a prosumer economy has already\nstarted, the future is either ecologically and socially just or bust.",
    "authors": [
      "Uygar Ozesmi"
    ],
    "publication_date": "2019-03-16T12:56:19Z",
    "arxiv_id": "http://arxiv.org/abs/1903.07615v1",
    "download_url": "http://arxiv.org/abs/1903.07615v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A minimal model for microbial biodiversity can reproduce experimentally\n  observed ecological patterns",
    "abstract": "Surveys of microbial biodiversity such as the Earth Microbiome Project (EMP)\nand the Human Microbiome Project (HMP) have revealed robust ecological patterns\nacross different environments. A major goal in ecology is to leverage these\npatterns to identify the ecological processes shaping microbial ecosystems. One\npromising approach is to use minimal models that can relate mechanistic\nassumptions at the microbe scale to community-level patterns. Here, we\ndemonstrate the utility of this approach by showing that the Microbial Consumer\nResource Model (MiCRM) -- a minimal model for microbial communities with\nresource competition, metabolic crossfeeding and stochastic colonization -- can\nqualitatively reproduce patterns found in survey data including compositional\ngradients, dissimilarity/overlap correlations, richness/harshness correlations,\nand nestedness of community composition. By using the MiCRM to generate\nsynthetic data with different environmental and taxonomical structure, we show\nthat large scale patterns in the EMP can be reproduced by considering the\nenergetic cost of surviving in harsh environments and HMP patterns may reflect\nthe importance of environmental filtering in shaping competition. We also show\nthat recently discovered dissimilarity-overlap correlations in the HMP likely\narise from communities that share similar environments rather than reflecting\nuniversal dynamics. We identify ecologically meaningful changes in parameters\nthat alter or destroy each one of these patterns, suggesting new mechanistic\nhypotheses for further investigation. These findings highlight the promise of\nminimal models for microbial ecology.",
    "authors": [
      "Robert Marsland III",
      "Wenping Cui",
      "Pankaj Mehta"
    ],
    "publication_date": "2019-04-29T19:18:43Z",
    "arxiv_id": "http://arxiv.org/abs/1904.12914v3",
    "download_url": "http://arxiv.org/abs/1904.12914v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Complexity-Stability Debate, Chemical Organization Theory, and the\n  Identi cation of Non-Classical Structures in Ecology",
    "abstract": "We present a novel approach to represent ecological systems using reaction\nnetworks, and show how a particular framework called Chemical Organization\nTheory (COT) sheds new light on the longstanding complexity-stability debate.\nNamely, COT provides a novel conceptual landscape plenty of analytic tools to\nexplore the interplay between structure and stability of ecological systems.\nGiven a large set of species and their interactions, COT identifies, in a\ncomputationally feasible way, each and every sub-collection of species that is\nclosed and self-maintaining. These sub-collections, called organizations,\ncorrespond to the groups of species that can survive together (co-exist) in the\nlong-term. Thus, the set of organizations contains all the stable regimes that\ncan possibly happen in the dynamics of the ecological system. From here, we\npropose to conceive the notion of stability from the properties of the\norganizations, and thus apply the vast knowledge on the stability of reaction\nnetworks to the Complexity-Stability debate. As an example of the potential of\nCOT to introduce new mathematical tools, we show that the set of organizations\ncan be equipped with suitable joint and meet operators, and that for certain\necological systems the organizational structure is a non-boolean lattice,\nproviding in this way an unexpected connection between logico-algebraic\nstructures, popular in the foundations of quantum theory, and ecology.",
    "authors": [
      "Tomas Veloz"
    ],
    "publication_date": "2019-11-18T23:45:20Z",
    "arxiv_id": "http://arxiv.org/abs/1911.08006v1",
    "download_url": "http://arxiv.org/abs/1911.08006v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Uncovering ecological state dynamics with hidden Markov models",
    "abstract": "Ecological systems can often be characterised by changes among a finite set\nof underlying states pertaining to individuals, populations, communities, or\nentire ecosystems through time. Owing to the inherent difficulty of empirical\nfield studies, ecological state dynamics operating at any level of this\nhierarchy can often be unobservable or \"hidden\". Ecologists must therefore\noften contend with incomplete or indirect observations that are somehow related\nto these underlying processes. By formally disentangling state and observation\nprocesses based on simple yet powerful mathematical properties that can be used\nto describe many ecological phenomena, hidden Markov models (HMMs) can\nfacilitate inferences about complex system state dynamics that might otherwise\nbe intractable. However, while HMMs are routinely applied in other disciplines,\nthey have only recently begun to gain traction within the broader ecological\ncommunity. We provide a gentle introduction to HMMs, establish some common\nterminology, and review the immense scope of HMMs for applied ecological\nresearch. We also provide a supplemental tutorial on some of the more technical\naspects of HMM implementation and interpretation. By illustrating how\npractitioners can use a simple conceptual template to customise HMMs for their\nspecific systems of interest, revealing methodological links between existing\napplications, and highlighting some practical considerations and limitations of\nthese approaches, our goal is to help establish HMMs as a fundamental\ninferential tool for ecologists.",
    "authors": [
      "Brett T. McClintock",
      "Roland Langrock",
      "Olivier Gimenez",
      "Emmanuelle Cam",
      "David L. Borchers",
      "Richard Glennie",
      "Toby A. Patterson"
    ],
    "publication_date": "2020-02-24T19:26:48Z",
    "arxiv_id": "http://arxiv.org/abs/2002.10497v2",
    "download_url": "http://arxiv.org/abs/2002.10497v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Model selection for ecological community data using tree shrinkage\n  priors",
    "abstract": "Researchers and managers model ecological communities to infer the biotic and\nabiotic variables that shape species' ranges, habitat use, and co-occurrence\nwhich, in turn, are used to support management decisions and test ecological\ntheories. Recently, species distribution models were developed for and applied\nto data from ecological communities. Model development and selection for\necological community data is difficult because a high level of complexity is\ndesired and achieved by including numerous parameters, which can degrade\npredictive accuracy and be challenging to interpret and communicate. Like other\nstatistical models, multi-species distribution models can be overparameterized.\nRegularization is a technique that optimizes predictive accuracy by shrinking\nor eliminating model parameters. For Bayesian models, the prior distribution\nautomatically regularizes parameters. We propose a tree shrinkage prior for\nBayesian multi-species distributions models that performs regularization and\nreduces the number of regression coefficients associated with predictor\nvariables. Using this prior, the number of regression coefficients in\nmulti-species distributions models is reduced by estimation of unique\nregression coefficients for a smaller number of guilds rather than a larger\nnumber of species. We demonstrated our tree shrinkage prior using examples of\npresence-absence data for six species of aquatic vegetation and relative\nabundance data for 15 species of fish. Our results show that the tree shrinkage\nprior can increase the predictive accuracy of multi-species distribution models\nand enable researchers to infer the number and species composition of guilds\nfrom ecological community data.",
    "authors": [
      "Trevor Hefley"
    ],
    "publication_date": "2020-05-28T21:26:14Z",
    "arxiv_id": "http://arxiv.org/abs/2005.14303v1",
    "download_url": "http://arxiv.org/abs/2005.14303v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Trade-off between deep learning for species identification and inference\n  about predator-prey co-occurrence: Reproducible R workflow integrating models\n  in computer vision and ecological statistics",
    "abstract": "Deep learning is used in computer vision problems with important applications\nin several scientific fields. In ecology for example, there is a growing\ninterest in deep learning for automatizing repetitive analyses on large amounts\nof images, such as animal species identification.\n  However, there are challenging issues toward the wide adoption of deep\nlearning by the community of ecologists. First, there is a programming barrier\nas most algorithms are written in Python while most ecologists are versed in R.\nSecond, recent applications of deep learning in ecology have focused on\ncomputational aspects and simple tasks without addressing the underlying\necological questions or carrying out the statistical data analysis to answer\nthese questions.\n  Here, we showcase a reproducible R workflow integrating both deep learning\nand statistical models using predator-prey relationships as a case study. We\nillustrate deep learning for the identification of animal species on images\ncollected with camera traps, and quantify spatial co-occurrence using\nmultispecies occupancy models.\n  Despite average model classification performances, ecological inference was\nsimilar whether we analysed the ground truth dataset or the classified dataset.\nThis result calls for further work on the trade-offs between time and resources\nallocated to train models with deep learning and our ability to properly\naddress key ecological questions with biodiversity monitoring. We hope that our\nreproducible workflow will be useful to ecologists and applied statisticians.\n  All material (source of the Rmarkdown notebook and auxiliary files) is\navailable from\nhttps://github.com/oliviergimenez/computo-deeplearning-occupany-lynx.",
    "authors": [
      "Olivier Gimenez",
      "Maëlis Kervellec",
      "Jean-Baptiste Fanjul",
      "Anna Chaine",
      "Lucile Marescot",
      "Yoann Bollet",
      "Christophe Duchamp"
    ],
    "publication_date": "2021-08-25T22:56:04Z",
    "arxiv_id": "http://arxiv.org/abs/2108.11509v1",
    "download_url": "http://arxiv.org/abs/2108.11509v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simplicial structures in ecological networks",
    "abstract": "An ecological network is a formal representation of a specific type of\ninteraction in a corresponding ecosystem. Such networks have traditionally been\nmodelled as encoding exclusively pairwise interactions among the fundamental\nunits of ecosystems and have been represented and analysed using\ngraph-theoretic methods. However, many real-world ecosystems may entertain\nnon-binary, polyadic relations between their units, which cannot be captured by\nthe pairwise interaction methods, but require higher-order interaction\nframework, and consequently the corresponding ecological networks cannot be\nmodelled using graph-theoretic framework. This work gives a structural\ndefinition of ecological network suitable for modelling all orders of\ninteractions between the fundamental units of the corresponding ecological\nsystem, including and going beyond the pairwise interaction framework. Carbon\nmediation between units of some select ecosystems are studied by modelling the\ncorresponding ecological networks as simplicial complexes following the\ndefinition. The concept of graph centrality measure has been extended to\nsimplicial centrality, and some important centrality measures of these networks\nat various structural levels of the complexes have been calculated. The\ncentrality measures reveal valuable structural information including\ninformation about those vertices that are more likely to participate in\nhigher-order interactions, as well as inform whether there is a difference in\nthe ranks of vertices for these higher-order networks based on graph centrality\nand simplicial centrality measures.",
    "authors": [
      "Udit Raj",
      "Shashankaditya Upadhyay",
      "Moumita Karmakar",
      "Sudeepto Bhattacharya"
    ],
    "publication_date": "2022-03-25T14:31:53Z",
    "arxiv_id": "http://arxiv.org/abs/2203.13677v1",
    "download_url": "http://arxiv.org/abs/2203.13677v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Covariations in ecological scaling laws fostered by community dynamics",
    "abstract": "Scaling laws in ecology, intended both as functional relationships among\necologically-relevant quantities and the probability distributions that\ncharacterize their occurrence, have long attracted the interest of empiricists\nand theoreticians. Empirical evidence exists of power laws associated with the\nnumber of species inhabiting an ecosystem, their abundances and traits.\nAlthough their functional form appears to be ubiquitous, empirical scaling\nexponents vary with ecosystem type and resource supply rate. The idea that\necological scaling laws are linked had been entertained before, but the full\nextent of macroecological pattern covariations, the role of the constraints\nimposed by finite resource supply and a comprehensive empirical verification\nare still unexplored. Here, we propose a theoretical scaling framework that\npredicts the linkages of several macroecological patterns related to species'\nabundances and body sizes. We show that such framework is consistent with the\nstationary state statistics of a broad class of resource-limited community\ndynamics models, regardless of parametrization and model assumptions. We verify\npredicted theoretical covariations by contrasting empirical data and provide\ntestable hypotheses for yet unexplored patterns. We thus place the observed\nvariability of ecological scaling exponents into a coherent statistical\nframework where patterns in ecology embed constrained fluctuations.",
    "authors": [
      "Silvia Zaoli",
      "Andrea Giometto",
      "Amos Maritan",
      "Andrea Rinaldo"
    ],
    "publication_date": "2017-07-24T23:26:58Z",
    "arxiv_id": "http://arxiv.org/abs/1707.07771v2",
    "download_url": "http://arxiv.org/abs/1707.07771v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unifying deterministic and stochastic ecological dynamics via a\n  landscape-flux approach",
    "abstract": "We develop a landscape-flux framework to investigate observed frequency\ndistributions of vegetation and the stability of these ecological systems under\nfluctuations. The frequency distributions can characterize the\npopulation-potential landscape related to the stability of ecological states.\nWe illustrate the practical utility of this approach by analyzing a\nforest-savanna model. Savanna, and Forest states coexist under certain\nconditions, consistent with past theoretical work and empirical observations.\nHowever, a new Grassland state, unseen in the corresponding deterministic\nmodel, emerges as an alternative quasi-stable state under fluctuations,\nproviding a novel theoretical basis for the appearance of widespread grasslands\nin some empirical analyses. The ecological dynamics are determined by both the\npopulation-potential landscape gradient and the steady-state probability flux.\nThe flux quantifies the net input/output to the ecological system and therefore\nthe degree of nonequilibriumness. Landscape and flux together determine the\ntransitions between stable states characterized by dominant paths and switching\nrates. The intrinsic potential landscape admits a Lyapunov function, which\nprovides a quantitative measure of global stability. We find that the average\nflux, entropy production rate, and free energy have significant changes near\nbifurcations under both finite and zero fluctuation. These may provide both\ndynamical and thermodynamic origins of the bifurcations. We identified the\nvariances in observed frequency time traces, fluctuations and time\nirreversibility as kinematic measures for bifurcations. This new framework\nopens the way to characterize ecological systems globally, to uncover how they\nchange among states, and to quantify the emergence of new quasi-stable states\nunder stochastic fluctuations.",
    "authors": [
      "Li Xu",
      "Denis Patterson",
      "Ann Carla Staver",
      "Simon Asher Levin",
      "Jin Wang"
    ],
    "publication_date": "2021-03-15T08:09:31Z",
    "arxiv_id": "http://arxiv.org/abs/2103.08198v2",
    "download_url": "http://arxiv.org/abs/2103.08198v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effect of delay on the emergent stability patterns in Generalized\n  Lotka-Volterra ecological dynamics",
    "abstract": "Understanding the conditions of feasibility and stability in ecological\nsystems is a major challenge in theoretical ecology. The seminal work of May in\n1972 and recent developments based on the theory of random matrices have shown\nthe existence of emergent universal patterns of both stability and feasibility\nin ecological dynamics. However, only a few studies have investigated the role\nof delay coupled with population dynamics in the emergence of feasible and\nstable states. In this work, we study the effects of delay on Generalized\nLoka-Volterra population dynamics of several interacting species in closed\necological environments. First, we investigate the relation between feasibility\nand stability of the modeled ecological community in the absence of delay and\nfind a simple analytical relation when intra-species interactions are dominant.\nWe then show how, by increasing the time delay, there is a transition in the\nstability phases of the population dynamics: from an equilibrium state to a\nstable non-point attractor phase. We calculate analytically the critical delay\nof that transition and show that it is in excellent agreement with numerical\nsimulations. Finally, we introduce a measure of stability that holds for out of\nequilibrium dynamics and we show that in the oscillatory regime induced by the\ndelay stability increases for increasing ecosystem diversity.",
    "authors": [
      "Meghdad Saeedian",
      "Emanuele Pigani",
      "Amos Maritan",
      "Samir Suweis",
      "Sandro Azaele"
    ],
    "publication_date": "2021-10-22T16:56:53Z",
    "arxiv_id": "http://arxiv.org/abs/2110.11914v1",
    "download_url": "http://arxiv.org/abs/2110.11914v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Eco-evolution from deep time to contemporary dynamics: the role of\n  timescales and rate modulators",
    "abstract": "Eco-evolutionary dynamics, or eco-evolution for short, are thought to involve\nrapid demography (ecology) and equally rapid phenotypic changes (evolution)\nleading to novel, emergent system behaviours. This focus on contemporary\ndynamics is likely due to accumulating evidence for rapid evolution, from\nclassical laboratory microcosms and natural populations, including the iconic\nTrinidadian guppies. We argue that this view is too narrow, preventing the\nsuccessful integration of ecology and evolution. While maintaining that\neco-evolution involves emergence, we highlight that this may also be true for\nslow ecology and evolution which unfold over thousands or millions of years,\nsuch as the feedbacks between riverine geomorphology and plant evolution. We\nthereby integrate geomorphology and biome-level feedbacks into eco-evolution,\nsignificantly extending its scope. Most importantly, we emphasize that\neco-evolutionary systems need not be frozen in state-space: We identify\nmodulators of ecological and evolutionary rates, like temperature or\nsensitivity to mutation, which can synchronize or desynchronize ecology and\nevolution. We speculate that global change may increase the occurrence of\neco-evolution and emergent system behaviours which represents substantial\nchallenges for prediction. Our perspective represents an attempt to integrate\necology and evolution across disciplines, from gene-regulatory networks to\ngeomorphology and across timescales, from contemporary dynamics to deep time.",
    "authors": [
      "Emanuel A. Fronhofer",
      "Dov Corenblit",
      "Jhelam N. Deshpande",
      "Lynn Govaert",
      "Philippe Huneman",
      "Frédérique Viard",
      "Philippe Jarne",
      "Sara Puijalon"
    ],
    "publication_date": "2022-10-21T15:33:52Z",
    "arxiv_id": "http://arxiv.org/abs/2210.12041v1",
    "download_url": "http://arxiv.org/abs/2210.12041v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ecologically mapped neuronal identity: Towards standardizing activity\n  across heterogeneous experiments",
    "abstract": "The brain's diversity of neurons enables a rich behavioral repertoire and\nflexible adaptation to new situations. Assuming that the ecological pressure\nhas optimized this neuronal variety, we propose exploiting na\\\"ive behavior to\nmap the neuronal identity. Here we investigate the feasibility of identifying\nneurons \"ecologically\" using their activation for natural behavioral and\nenvironmental parameters. Such a neuronal ECO-marker might give a finer\ngranularity than possible with genetic or molecular markers, thereby\nfacilitating the comparison of the functional characteristics of individual\nneurons across animals. In contrast to a potential mapping using artificial\nstimuli and trained behavior which have an unlimited parameter space, an\necological mapping is experimentally feasible since it is bounded by the\necology. Home-cage environment is an excellent basis for this ECO-mapping\ncovering an extensive behavioral repertoire and since home-cage behavior is\nsimilar across laboratories. We review the possibility of adding area-specific\nenvironmental enrichment and automatized behavioral tasks to identify neurons\nin specific brain areas. In this work, we focus on the visual cortex, motor\ncortex, prefrontal cortex, and hippocampus. Fundamental to achieving this\nidentification is to take advantage of state-of-the-art behavioral tracking,\nsensory stimulation protocols, and the plethora of creative behavioral\nsolutions for rodents. We find that motor areas might be easiest to address,\nfollowed by prefrontal, hippocampal, and visual areas. The possibility of\nacquiring a near-complete ecological identification with minimal animal\nhandling, minimal constraints on the main experiment, and data compatibility\nacross laboratories might outweigh the necessity of implanting electrodes or\nimaging devices.",
    "authors": [
      "Kevin Luxem",
      "David Eriksson"
    ],
    "publication_date": "2023-04-28T06:29:30Z",
    "arxiv_id": "http://arxiv.org/abs/2304.14648v1",
    "download_url": "http://arxiv.org/abs/2304.14648v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]