[
  {
    "title": "Elucidation of time-dependent systems biology cell response patterns with time course network enrichment",
    "abstract": "Advances in OMICS technologies emerged both massive expression data sets and huge networks modelling the molecular interplay of genes, RNAs, proteins and metabolites. Network enrichment methods combine these two data types to extract subnetwork responses from case/control setups. However, no methods exist to integrate time series data with networks, thus preventing the identification of time-dependent systems biology responses. We close this gap with Time Course Network Enrichment (TiCoNE). It combines a new kind of human-augmented clustering with a novel approach to network enrichment. It finds temporal expression prototypes that are mapped to a network and investigated for enriched prototype pairs interacting more often than expected by chance. Such patterns of temporal subnetwork co-enrichment can be compared between different conditions. With TiCoNE, we identified the first distinguishing temporal systems biology profiles in time series gene expression data of human lung cells after infection with Influenza and Rhino virus. TiCoNE is available online (https://ticone.compbio.sdu.dk) and as Cytoscape app in the Cytoscape App Store (http://apps.cytoscape.org/).",
    "authors": [
      "Christian Wiwie",
      "Alexander Rauch",
      "Anders Haakonsson",
      "Inigo Barrio-Hernandez",
      "Blagoy Blagoev",
      "Susanne Mandrup",
      "Richard Röttger",
      "Jan Baumbach"
    ],
    "publication_date": "2017-10-27T11:09:12Z",
    "arxiv_id": "http://arxiv.org/abs/1710.10262v1",
    "download_url": "https://arxiv.org/abs/1710.10262v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Computational Approach for the Characterization of Airborne Pathogen Transmission in Turbulent Molecular Communication Channels",
    "abstract": "Airborne pathogen transmission mechanisms play a key role in the spread of infectious diseases such as COVID-19. In this work, we propose a computational fluid dynamics (CFD) approach to model and statistically characterize airborne pathogen transmission via pathogen-laden particles in turbulent channels from a molecular communication viewpoint. To this end, turbulent flows induced by coughing and the turbulent dispersion of droplets and aerosols are modeled by using the Reynolds-averaged Navier-Stokes equations coupled with the realizable $k-ε$ model and the discrete random walk model, respectively. Via simulations realized by a CFD simulator, statistical data for the number of received particles are obtained. These data are post-processed to obtain the statistical characterization of the turbulent effect in the reception and to derive the probability of infection. Our results reveal that the turbulence has an irregular effect on the probability of infection, which shows itself by the multi-modal distribution as a weighted sum of normal and Weibull distributions. Furthermore, it is shown that the turbulent MC channel is characterized via multi-modal, i.e., sum of weighted normal distributions, or stable distributions, depending on the air velocity.",
    "authors": [
      "Fatih Gulec",
      "Falko Dressler",
      "Andrew W. Eckford"
    ],
    "publication_date": "2023-05-02T13:40:13Z",
    "arxiv_id": "http://arxiv.org/abs/2305.01412v1",
    "download_url": "https://arxiv.org/abs/2305.01412v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Estimating Some General Molecular Descriptors of Saturated Hydrocarbons",
    "abstract": "Three general molecular descriptors, namely the general sum-connectivity index, general Platt index and ordinary generalized geometric-arithmetic index, are studied here. Best possible bounds for the aforementioned descriptors of arbitrary saturated hydrocarbons are derived. These bounds are expressed in terms of number of carbon atoms and number of carbon-carbon bonds of the considered hydrocarbons.",
    "authors": [
      "Akbar Ali",
      "Zhibin Du",
      "Kiran Shehzadi"
    ],
    "publication_date": "2018-12-28T17:05:54Z",
    "arxiv_id": "http://arxiv.org/abs/1812.11115v1",
    "download_url": "https://arxiv.org/abs/1812.11115v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "How can we improve problem-solving in undergraduate biology? Applying lessons from 30 years of physics education research",
    "abstract": "If students are to successfully grapple with authentic, complex biological problems as scientists and citizens, they need practice solving such problems during their undergraduate years. Physics education researchers have investigated student problem solving for the last three decades. Although physics and biology problems differ in structure and content, the instructional purposes align closely: explaining patterns and processes in the natural world and making predictions about physical and biological systems. In this paper, we discuss how research-supported approaches developed by physics education researchers can be adopted by biologists to enhance student problem-solving skills. First, we compare the problems that biology students are typically asked to solve with authentic, complex problems. We then describe the development of research-validated physics curricula emphasizing process skills in problem solving. We show that solving authentic, complex biology problems requires many of the same skills that practicing physicists and biologists use in representing problems, seeking relationships, making predictions, and verifying or checking solutions. We assert that acquiring these skills can help biology students become competent problem solvers. Finally, we propose how biology scholars can apply lessons from physics education in their classrooms and inspire new studies in biology education research.\n  (To appear in Cell Biology Education - Life Sciences Education)",
    "authors": [
      "Anne-Marie Hoskinson",
      "Marcos D. Caballero",
      "Jennifer K. Knight"
    ],
    "publication_date": "2012-09-04T19:25:04Z",
    "arxiv_id": "http://arxiv.org/abs/1209.0745v3",
    "download_url": "https://arxiv.org/abs/1209.0745v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Network Control Through Boolean Canalization",
    "abstract": "Boolean networks are an important class of computational models for molecular interaction networks. Boolean canalization, a type of hierarchical clustering of the inputs of a Boolean function, has been extensively studied in the context of network modeling where each layer of canalization adds a degree of stability in the dynamics of the network. Recently, dynamic network control approaches have been used for the design of new therapeutic interventions and for other applications such as stem cell reprogramming. This work studies the role of canalization in the control of Boolean molecular networks. It provides a method for identifying the potential edges to control in the wiring diagram of a network for avoiding undesirable state transitions. The method is based on identifying appropriate input-output combinations on undesirable transitions that can be modified using the edges in the wiring diagram of the network. Moreover, a method for estimating the number of changed transitions in the state space of the system as a result of an edge deletion in the wiring diagram is presented. The control methods of this paper were applied to a mutated cell-cycle model and to a p53-mdm2 model to identify potential control targets.",
    "authors": [
      "David Murrugarra",
      "Elena S. Dimitrova"
    ],
    "publication_date": "2015-08-12T18:49:12Z",
    "arxiv_id": "http://arxiv.org/abs/1508.03026v2",
    "download_url": "https://arxiv.org/abs/1508.03026v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structural biology in the clouds: The WeNMR-EOSC Ecosystem",
    "abstract": "Structural biology aims at characterizing the structural and dynamic properties of biological macromolecules at atomic details. Gaining insight into three dimensional structures of biomolecules and their interactions is critical for understanding the vast majority of cellular processes, with direct applications in health and food sciences. Since 2010, the WeNMR project (www.wenmr.eu) has implemented numerous web-based services to facilitate the use of advanced computational tools by researchers in the field, using the high throughput computing infrastructure provided by EGI. These services have been further developed in subsequent initiatives under H2020 projects and are now operating as Thematic Services in the European Open Science Cloud (EOSC) portal (www.eosc-portal.eu), sending >12 millions of jobs and using around 4000 CPU-years per year. Here we review 10 years of successful e-infrastructure solutions serving a large worldwide community of over 23,000 users to date, providing them with user-friendly, web-based solutions that run complex workflows in structural biology. The current set of active WeNMR portals are described, together with the complex backend machinery that allows distributed computing resources to be harvested efficiently.",
    "authors": [
      "Rodrigo Vargas Honorato",
      "Panagiotis I. Koukos",
      "Brian Jiménez-García",
      "Andrei Tsaregorodtsev",
      "Marco Verlato",
      "Andrea Giachetti",
      "Antonio Rosato",
      "Alexandre M. J. J. Bonvin"
    ],
    "publication_date": "2021-07-02T13:04:31Z",
    "arxiv_id": "http://arxiv.org/abs/2107.01056v1",
    "download_url": "https://arxiv.org/abs/2107.01056v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Increasing certainty in systems biology models using Bayesian multimodel inference",
    "abstract": "Mathematical models are indispensable to the system biology toolkit for studying the structure and behavior of intracellular signaling networks. A common approach to modeling is to develop a system of equations that encode the known biology using approximations and simplifying assumptions. As a result, the same signaling pathway can be represented by multiple models, each with its set of underlying assumptions, which opens up challenges for model selection and decreases certainty in model predictions. Here, we use Bayesian multimodel inference to develop a framework to increase certainty in systems biology models. Using models of the extracellular regulated kinase (ERK) pathway, we first show that multimodel inference increases predictive certainty and yields predictors that are robust to changes in the set of available models. We then show that predictions made with multimodel inference are robust to data uncertainties introduced by decreasing the measurement duration and reducing the sample size. Finally, we use multimodel inference to identify a new model to explain experimentally measured sub-cellular location-specific ERK activity dynamics. In summary, our framework highlights multimodel inference as a disciplined approach to increasing the certainty of intracellular signaling activity predictions.",
    "authors": [
      "Nathaniel Linden-Santangeli",
      "Jin Zhang",
      "Boris Kramer",
      "Padmini Rangamani"
    ],
    "publication_date": "2024-06-17T03:30:20Z",
    "arxiv_id": "http://arxiv.org/abs/2406.11178v1",
    "download_url": "https://arxiv.org/abs/2406.11178v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computation of electromagnetic properties of molecular ensembles",
    "abstract": "We establish a link between quantum mechanical molecular simulations and the transfer matrix of a molecule. The transfer matrix (T-matrix) of an object provides a complete description of its electromagnetic response. Once the T-matrices of the individual components of an ensemble are known, the electromagnetic response of the ensemble can be efficiently computed. This holds for arbitrary arrangements of large number of molecules, as well as for periodic arrays. We provide T-matrix based formulas for computing traditional chiro-optical properties like Circular Dichroism and Oriented Circular Dichroism, and also for quantifying electromagnetic duality and electromagnetic chirality, two properties that are fundamentally related to chiral interactions, and also technologically relevant. The formulas are valid for light-matter interactions of arbitrary high multipolar orders. We exemplify our approach by first computing the T-matrix of a cross-like arrangement of four copies of a chiral molecule from the time-dependent Hartree-Fock theory simulation data of the individual molecule, and then computing the aforementioned electromagnetic properties of both the cross and the individual molecule. The link that we establish is a necessary step towards obtaining T-matrix based constitutive relations of general bulk molecular materials from quantum mechanical simulations of their molecular constituents.",
    "authors": [
      "Ivan Fernandez-Corbaton",
      "Carsten Rockstuhl",
      "Wim Klopper"
    ],
    "publication_date": "2018-04-22T08:41:16Z",
    "arxiv_id": "http://arxiv.org/abs/1804.08085v1",
    "download_url": "https://arxiv.org/abs/1804.08085v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A self-organized model for cell-differentiation based on variations of molecular decay rates",
    "abstract": "Systemic properties of living cells are the result of molecular dynamics governed by so-called genetic regulatory networks (GRN). These networks capture all possible features of cells and are responsible for the immense levels of adaptation characteristic to living systems. At any point in time only small subsets of these networks are active. Any active subset of the GRN leads to the expression of particular sets of molecules (expression modes). The subsets of active networks change over time, leading to the observed complex dynamics of expression patterns. Understanding of this dynamics becomes increasingly important in systems biology and medicine. While the importance of transcription rates and catalytic interactions has been widely recognized in modeling genetic regulatory systems, the understanding of the role of degradation of biochemical agents (mRNA, protein) in regulatory dynamics remains limited. Recent experimental data suggests that there exists a functional relation between mRNA and protein decay rates and expression modes. In this paper we propose a model for the dynamics of successions of sequences of active subnetworks of the GRN. The model is able to reproduce key characteristics of molecular dynamics, including homeostasis, multi-stability, periodic dynamics, alternating activity, differentiability, and self-organized critical dynamics. Moreover the model allows to naturally understand the mechanism behind the relation between decay rates and expression modes. The model explains recent experimental observations that decay-rates (or turnovers) vary between differentiated tissue-classes at a general systemic level and highlights the role of intracellular decay rate control mechanisms in cell differentiation.",
    "authors": [
      "Rudolf Hanel",
      "Manfred Pöchacker",
      "Manuel Schölling",
      "Stefan Thurner"
    ],
    "publication_date": "2012-02-03T13:18:19Z",
    "arxiv_id": "http://arxiv.org/abs/1202.0694v1",
    "download_url": "https://arxiv.org/abs/1202.0694v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Biology-Instructions: A Dataset and Benchmark for Multi-Omics Sequence Understanding Capability of Large Language Models",
    "abstract": "Large language models (LLMs) have shown remarkable capabilities in general domains, but their application to multi-omics biology remains underexplored. To address this gap, we introduce Biology-Instructions, the first large-scale instruction-tuning dataset for multi-omics biological sequences, including DNA, RNA, proteins, and multi-molecules. This dataset bridges LLMs and complex biological sequence-related tasks, enhancing their versatility and reasoning while maintaining conversational fluency. We also highlight significant limitations of current state-of-the-art LLMs on multi-omics tasks without specialized training. To overcome this, we propose ChatMultiOmics, a strong baseline with a novel three-stage training pipeline, demonstrating superior biological understanding through Biology-Instructions. Both resources are publicly available, paving the way for better integration of LLMs in multi-omics analysis. The Biology-Instructions is publicly available at: https://github.com/hhnqqq/Biology-Instructions.",
    "authors": [
      "Haonan He",
      "Yuchen Ren",
      "Yining Tang",
      "Ziyang Xu",
      "Junxian Li",
      "Minghao Yang",
      "Di Zhang",
      "Dong Yuan",
      "Tao Chen",
      "Shufei Zhang",
      "Yuqiang Li",
      "Nanqing Dong",
      "Wanli Ouyang",
      "Dongzhan Zhou",
      "Peng Ye"
    ],
    "publication_date": "2024-12-26T12:12:23Z",
    "arxiv_id": "http://arxiv.org/abs/2412.19191v2",
    "download_url": "https://arxiv.org/abs/2412.19191v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Approximate L-State Solution of the Rotating Trigonometric Pöschl-Teller Potential",
    "abstract": "The trigonometric Pöschl-Teller (PT) potential describes the diatomic molecular vibration. We have obtained the approximate solutions of the radial Schrödinger equation (SE) for the rotating trigonometric PT potential using the Nikiforov-Uvarov (NU) method. The energy eigenvalues and their corresponding eigenfunctions are calculated for arbitrary -states in closed form. In the low screening region, when the screening parameter the potential reduces to Kratzer potential. Further, some numerical results are presented for several diatomic molecules.",
    "authors": [
      "Majid Hamzavi",
      "Sameer M. Ikhdair"
    ],
    "publication_date": "2012-05-04T12:51:51Z",
    "arxiv_id": "http://arxiv.org/abs/1205.0941v2",
    "download_url": "https://arxiv.org/abs/1205.0941v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Large Language Models in Plant Biology",
    "abstract": "Large Language Models (LLMs), such as ChatGPT, have taken the world by storm and have passed certain forms of the Turing test. However, LLMs are not limited to human language and analyze sequential data, such as DNA, protein, and gene expression. The resulting foundation models can be repurposed to identify the complex patterns within the data, resulting in powerful, multi-purpose prediction tools able to explain cellular systems. This review outlines the different types of LLMs and showcases their recent uses in biology. Since LLMs have not yet been embraced by the plant community, we also cover how these models can be deployed for the plant kingdom.",
    "authors": [
      "Hilbert Yuen In Lam",
      "Xing Er Ong",
      "Marek Mutwil"
    ],
    "publication_date": "2024-01-05T12:59:20Z",
    "arxiv_id": "http://arxiv.org/abs/2401.02789v1",
    "download_url": "https://arxiv.org/abs/2401.02789v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Molecular Communication Perspective on Airborne Pathogen Transmission and Reception via Droplets Generated by Coughing and Sneezing",
    "abstract": "Infectious diseases spread via pathogens such as viruses and bacteria. Airborne pathogen transmission via droplets is an important mode for infectious diseases. In this paper, the spreading mechanism of infectious diseases by airborne pathogen transmission between two humans is modeled with a molecular communication perspective. An end-to-end system model which considers the pathogen-laden cough/sneeze droplets as the input and the infection state of the human as the output is proposed. This model uses the gravity, initial velocity and buoyancy for the propagation of droplets and a receiver model which considers the central part of the human face as the reception interface is proposed. Furthermore, the probability of infection for an uninfected human is derived by modeling the number of propagating droplets as a random process. The numerical results reveal that exposure time and sex of the human affect the probability of infection. In addition, the social distance for a horizontal cough should be at least 1.7 m and the safe coughing angle of a coughing human to infect less people should be less than -25$^\\circ$.",
    "authors": [
      "Fatih Gulec",
      "Baris Atakan"
    ],
    "publication_date": "2020-07-15T10:23:26Z",
    "arxiv_id": "http://arxiv.org/abs/2007.07598v1",
    "download_url": "https://arxiv.org/abs/2007.07598v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Traffic accident increase attributed to Daylight Saving Time doubled after Energy Policy Act",
    "abstract": "On January 30, 2020 Current Biology released the report \"A Chronobiological Evaluation of the Acute Effects of Daylight Saving Time on Traffic Accident Risk\" doi: https://doi.org/10.1016/j.cub.2019.12.045 by Fritz, et al., where it was argued that fatal traffic accident risk increases by 6% in the US due to Daylight Saving Time spring transition. This manuscript is a 1000 word correspondence showing that the bulk of this reported risk comes from the transition dates mandated by the Energy Policy Act in 2007.",
    "authors": [
      "José María Martín-Olalla"
    ],
    "publication_date": "2020-04-09T05:36:39Z",
    "arxiv_id": "http://arxiv.org/abs/2004.04156v1",
    "download_url": "https://arxiv.org/abs/2004.04156v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Quantum (MolQ) Communication Channel in the Gut-Brain Axis Synapse",
    "abstract": "The gut-brain axis is the communication link between the gut and the brain. Although it is known that the gut-brain axis plays a pivotal role in homeostasis, its overall mechanism is still not known. However, for neural synapses, classical molecular communication is described by the formation of ligand-receptor complexes, which leads to the opening of ion channels. Moreover, there are some conditions that need to be fulfilled before the opening of the ion channel. In this study, we consider the gut-brain axis, where neurotransmitters diffuse through the synaptic cleft, considering molecular communication. On the vagus nerve (VN) membrane, i.e., the post-synaptic membrane of the synapse, it undergoes a quantum communication (QC), which initiates the opening of the ion channel, thus initiating the communication signal from the gut to the brain. It evolves a new paradigm of communication approach, Molecular Quantum (MolQ) communication. Based on the QC model, we theoretically analyze the output states, and QC is simulated considering the incoming neurotransmitter's concentration and validated by analyzing the entropy and the mutual information of the input, i.e., neurotransmitter's concentration, and output, i.e., ion channel opening.",
    "authors": [
      "Bitop Maitra",
      "Ozgur B. Akan"
    ],
    "publication_date": "2024-06-24T14:00:18Z",
    "arxiv_id": "http://arxiv.org/abs/2407.07106v2",
    "download_url": "https://arxiv.org/abs/2407.07106v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanobiological regulation of bone remodeling -- Theoretical development of a coupled systems biology-micromechanical approach",
    "abstract": "Bone remodeling involves the coordinated removal of bone by osteoclasts and addition of bone by osteoblasts, a process that is modulated by the prevailing mechanical environment. In this paper a fully coupled model of bone remodeling is developed, based on coupling a bone cell population model with a micromechanical homogenization scheme of bone stiffness. While the former model considers biochemical regulatory mechanisms between bone cells such as the RANK-RANKL-OPG pathway and action of TGF-β, the latter model allows for accurate upscaling of the mechanical properties of bone. Importantly, we consider bone remodeling as being controlled proportionally to the microscopic strain energy density, on the observation scale where the sensing of the mechanical loading takes place, estimated by means of continuum micromechanics-based strain concentration. This approach allows to address two fundamental questions of bone biology: (i) How do biochemical changes influence bone remodeling and so affect the composition and mechanical properties of bone? and (ii) What mechanisms are responsible for mechanoregulation of bone remodeling? Numerical studies highlight the conceptual advantage of this new approach compared to conventional phenomenological models. It is demonstrated that the proposed model is able to simulate changes of the bone constituent volume fractions that are in qualitative agreement with experimental observations for osteoporotic and disuse syndromes.",
    "authors": [
      "Stefan Scheiner",
      "Peter Pivonka",
      "Christian Hellmich",
      "David W. Smith"
    ],
    "publication_date": "2012-01-12T07:08:24Z",
    "arxiv_id": "http://arxiv.org/abs/1201.2488v2",
    "download_url": "https://arxiv.org/abs/1201.2488v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The whack-a-mole governance challenge for AI-enabled synthetic biology: literature review and emerging frameworks",
    "abstract": "AI-enabled synthetic biology has tremendous potential but also significantly increases biorisks and brings about a new set of dual use concerns. The picture is complicated given the vast innovations envisioned to emerge by combining emerging technologies, as AI-enabled synthetic biology potentially scales up bioengineering into industrial biomanufacturing. However, the literature review indicates that goals such as maintaining a reasonable scope for innovation, or more ambitiously to foster a huge bioeconomy don't necessarily contrast with biosafety, but need to go hand in hand. This paper presents a literature review of the issues and describes emerging frameworks for policy and practice that transverse the options of command-and control, stewardship, bottom-up, and laissez-faire governance. How to achieve early warning systems that enable prevention and mitigation of future AI-enabled biohazards from the lab, from deliberate misuse, or from the public realm, will constantly need to evolve, and adaptive, interactive approaches should emerge. Although biorisk is subject to an established governance regime, and scientists generally adhere to biosafety protocols, even experimental, but legitimate use by scientists could lead to unexpected developments. Recent advances in chatbots enabled by generative AI have revived fears that advanced biological insight can more easily get into the hands of malignant individuals or organizations. Given these sets of issues, society needs to rethink how AI-enabled synthetic biology should be governed. The suggested way to visualize the challenge at hand is whack-a-mole governance, although the emerging solutions are perhaps not so different either.",
    "authors": [
      "Trond Arne Undheim"
    ],
    "publication_date": "2024-02-01T03:53:13Z",
    "arxiv_id": "http://arxiv.org/abs/2402.00312v1",
    "download_url": "https://arxiv.org/abs/2402.00312v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fault-tolerant quantum algorithms for quantum molecular systems: A survey",
    "abstract": "Solving quantum molecular systems presents a significant challenge for classical computation. The advent of early fault-tolerant quantum computing (EFTQC) devices offers a promising avenue to address these challenges, leveraging advanced quantum algorithms with reduced hardware requirements. This review surveys the latest developments in EFTQC and fully fault-tolerant quantum computing (FFTQC) algorithms for quantum molecular systems, covering encoding schemes, advanced Hamiltonian simulation techniques, and ground-state energy estimation methods. We highlight recent progress in overcoming practical barriers, such as reducing circuit depth and minimizing the use of ancillary qubits. Special attention is given to the potential quantum advantages achievable through these algorithms, as well as the limitations imposed by dequantization and classical simulation techniques. The review concludes with a discussion of future directions, emphasizing the need for optimized algorithms and experimental validation to bridge the gap between theoretical developments and practical implementation in EFTQC and FFTQC for quantum molecular systems.",
    "authors": [
      "Yukun Zhang",
      "Xiaoming Zhang",
      "Jinzhao Sun",
      "Heng Lin",
      "Yifei Huang",
      "Dingshun Lv",
      "Xiao Yuan"
    ],
    "publication_date": "2025-02-04T09:12:00Z",
    "arxiv_id": "http://arxiv.org/abs/2502.02139v1",
    "download_url": "https://arxiv.org/abs/2502.02139v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Static Laboratory-Frame Polarization of a Trapped Molecular Ion for CP-Violation Searches",
    "abstract": "Today's most sensitive experiments for detecting CP-violating permanent electric dipole moments (EDM) rely on molecular spectroscopy. The high sensitivity arises from large internal electric fields that interact with the constituents of the molecule. For molecular ions it has long been assumed that experiments with static polarization from dc electric fields are infeasible, as the ion's charge would either shift it to a field free region or eject it from the trap. This constraint appears to make single ion quantum-logic clocks, among the most precise measurement devices available, incompatible with EDM measurements. Here, we demonstrate that, under typical trapping conditions, heavy molecular ions with small $Ω/Λ$-doubling can be polarized by a static electric field while remaining confined in the Paul trap. This effect arises from a cancellation between the electrostatic force and the trap's ponderomotive force, resulting in an equilibrium position where the ion experiences a dc electric field component. Dynamic decoupling allows to implement co-magnetometry schemes in a single molecule and provides long interrogation times. This will allow the operation of a quantum-logic molecular radio-frequency clock in static electric fields, providing sensitivity to EDMs. Working with only a few ions and non-destructive detection techniques opens the door to the use of highly sensitive, rare, and radioactive molecular species as well as quantum-enhanced metrology schemes to achieve unprecedented levels of accuracy and precision.",
    "authors": [
      "Fabian Wolf"
    ],
    "publication_date": "2025-11-18T17:40:36Z",
    "arxiv_id": "http://arxiv.org/abs/2511.14701v2",
    "download_url": "https://arxiv.org/abs/2511.14701v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Normal Inverse Gaussian Approximation for Arrival Time Difference in Flow-Induced Molecular Communications",
    "abstract": "In this paper, we consider molecular communications in one-dimensional flow-induced diffusion channels with a perfectly absorbing receiver. In such channels, the random propagation delay until the molecules are absorbed follows an inverse Gaussian (IG) distribution and is referred to as first hitting time. Knowing the distribution for the difference of the first hitting times of two molecules is very important if the information is encoded by a limited set of molecules and the receiver exploits their arrival time and/or order. Hence, we propose a moment matching approximation by a normal inverse Gaussian (NIG) distribution and we derive an expression for the asymptotic tail probability. Numerical evaluations showed that the NIG approximation matches very well with the exact solution obtained by numerical convolution of the IG density functions. Moreover, the asymptotic tail probability outperforms state-of-the-art tail approximations.",
    "authors": [
      "Werner Haselmayr",
      "Dmitry Efrosinin",
      "Weisi Guo"
    ],
    "publication_date": "2018-09-26T13:45:42Z",
    "arxiv_id": "http://arxiv.org/abs/1809.09995v1",
    "download_url": "https://arxiv.org/abs/1809.09995v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Using Dimensional Analysis to Assess Scalability and Accuracy in Molecular Communication",
    "abstract": "In this paper, we apply dimensional analysis to study a diffusive molecular communication system that uses diffusing enzymes in the propagation environment to mitigate intersymbol interference. The enzymes bind to information molecules and then degrade them so that they cannot interfere with the detection of future transmissions at the receiver. We determine when it is accurate to assume that the concentration of information molecules throughout the receiver is constant and equal to that expected at the center of the receiver. We show that a lower bound on the expected number of molecules observed at the receiver can be arbitrarily scaled over the environmental parameters, and generalize how the accuracy of the lower bound is qualitatively impacted by those parameters.",
    "authors": [
      "Adam Noel",
      "Karen C. Cheung",
      "Robert Schober"
    ],
    "publication_date": "2013-05-08T12:36:01Z",
    "arxiv_id": "http://arxiv.org/abs/1305.1796v1",
    "download_url": "https://arxiv.org/abs/1305.1796v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "EPGAT: Gene Essentiality Prediction With Graph Attention Networks",
    "abstract": "The identification of essential genes/proteins is a critical step towards a better understanding of human biology and pathology. Computational approaches helped to mitigate experimental constraints by exploring machine learning (ML) methods and the correlation of essentiality with biological information, especially protein-protein interaction (PPI) networks, to predict essential genes. Nonetheless, their performance is still limited, as network-based centralities are not exclusive proxies of essentiality, and traditional ML methods are unable to learn from non-Euclidean domains such as graphs. Given these limitations, we proposed EPGAT, an approach for essentiality prediction based on Graph Attention Networks (GATs), which are attention-based Graph Neural Networks (GNNs) that operate on graph-structured data. Our model directly learns patterns of gene essentiality from PPI networks, integrating additional evidence from multiomics data encoded as node attributes. We benchmarked EPGAT for four organisms, including humans, accurately predicting gene essentiality with AUC score ranging from 0.78 to 0.97. Our model significantly outperformed network-based and shallow ML-based methods and achieved a very competitive performance against the state-of-the-art node2vec embedding method. Notably, EPGAT was the most robust approach in scenarios with limited and imbalanced training data. Thus, the proposed approach offers a powerful and effective way to identify essential genes and proteins.",
    "authors": [
      "João Schapke",
      "Anderson Tavares",
      "Mariana Recamonde-Mendoza"
    ],
    "publication_date": "2020-07-19T13:47:15Z",
    "arxiv_id": "http://arxiv.org/abs/2007.09671v1",
    "download_url": "https://arxiv.org/abs/2007.09671v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Modeling in Systems Biology",
    "abstract": "Many cellular behaviors are regulated by gene regulation networks, kinetics of which is one of the main subjects in the study of systems biology. Because of the low number molecules in these reacting systems, stochastic effects are significant. In recent years, stochasticity in modeling the kinetics of gene regulation networks have been drawing the attention of many researchers. This paper is a self contained review trying to provide an overview of stochastic modeling. I will introduce the derivation of the main equations in modeling the biochemical systems with intrinsic noise (chemical master equation, Fokker-Plan equation, reaction rate equation, chemical Langevin equation), and will discuss the relations between these formulations. The mathematical formulations for systems with fluctuations in kinetic parameters are also discussed. Finally, I will introduce the exact stochastic simulation algorithm and the approximate explicit tau-leaping method for making numerical simulations.",
    "authors": [
      "Jinzhi Lei"
    ],
    "publication_date": "2011-04-23T01:41:18Z",
    "arxiv_id": "http://arxiv.org/abs/1104.4524v1",
    "download_url": "https://arxiv.org/abs/1104.4524v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Mechanics of Chitin-Protein Interface",
    "abstract": "Chitin and protein are two main building blocks for many natural biomaterials. The interaction between chitin and protein critically determines the properties of the composite biological materials. As living organisms usually encounter complex ambient conditions like water, pH and ions are critical factors towards the structural integrity of biomaterials. It is therefore essential to study the chitin-protein interface under different environmental conditions. Here, an atomistic model consisting of a chitin substrate and a protein filament is constructed, which is regarded as a representative of the chitin-protein interface existing in many chitin-based biomaterials. Based on this model, the mechanical properties of chitin-protein interface under different moisture and pH values are investigated through molecular dynamics simulations. The results reveal a weakening effect of water towards the chitin-protein interface, as well as acidity, i.e. the protonated protein forms a stronger adhesion to chitin than that in the alkaline environment. In addition, the effect from side-chain of protein is studied and it is found that certain kinds of amino acid can form hydrophobic connections to chitin surface, which means that these peptides partly dodge the weakening effect of water. Our observation indicates that terminuses and side-chains in protein are of importance in forming interfacial hydrogen bonds. From our full atomistic models, we can observe some molecular mechanisms about how protein interacts with chitin in different conditions, which may spotlight the engineering on biomaterials with similar interfaces.",
    "authors": [
      "Zechuan Yu",
      "Denvid Lau"
    ],
    "publication_date": "2016-07-13T03:32:46Z",
    "arxiv_id": "http://arxiv.org/abs/1607.04146v2",
    "download_url": "https://arxiv.org/abs/1607.04146v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The rheology of ultra-high molecular weight poly(ethylene oxide) dispersed in a low molecular weight carrier",
    "abstract": "Gel spinning is the industrial method of choice for combining hydrophilic ultra-high molecular weight (UHMW) polymer resins with a hydrophobic support polymer to produce composite filaments for cytapheresis. Cytapheresis is a medical technique for removal of leukocytes from blood. Gel spinning is used to avoid high melt viscosity and thermal sensitivity of UHMW resins and the high melt temperature of the substrate resin but requires the recovery of toxic solvents. The UHMW resin is used because it forms a stable gel phase in the presence of water; a lower molecular weight resin (LMW) simply dissolves. UHMW and LMW resins were both poly(ethylene oxide) (PEO) and the substrate was polyarylsulfone (PAS). The literature indicated PEO undergoes non-oxidative thermal degradation above 200 °C and PAS is processed up to 350 °C. Dynamic oscillatory shear rheometry was used to study 0, 25, 40, 50, 60, and 75 wt. % UHMW PEO in LMW PEO to take advantage of the sensitivity of viscosity to changes in molecular weight and material configuration, indicating degradation. Samples were exposed to 220 °C, 230 °C, 240 °C, 250 °C, 275 °C, and 300 °C temperatures for 5 min to explore conditions that could result in sample degradation. The viscosity decreased less with increasing UHMW PEO content for samples exposed to the same temperature and the viscosity decreased more with increasing exposure temperature for samples with the same UHMW PEO content. Parameters were regressed from observed data to predict the change in molecular weight via empiricisms relating the viscosity to molecular weight, shear rate, temperature, and time.",
    "authors": [
      "Craig D. Mansfield",
      "Tianran Chen",
      "Mubashir Q. Ansari",
      "Donald G. Baird"
    ],
    "publication_date": "2024-01-16T20:32:09Z",
    "arxiv_id": "http://arxiv.org/abs/2401.08816v1",
    "download_url": "https://arxiv.org/abs/2401.08816v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Circuit design in biology and machine learning. I. Random networks and dimensional reduction",
    "abstract": "A biological circuit is a neural or biochemical cascade, taking inputs and producing outputs. How have biological circuits learned to solve environmental challenges over the history of life? The answer certainly follows Dobzhansky's famous quote that ``nothing in biology makes sense except in the light of evolution.'' But that quote leaves out the mechanistic basis by which natural selection's trial-and-error learning happens, which is exactly what we have to understand. How does the learning process that designs biological circuits actually work? How much insight can we gain about the form and function of biological circuits by studying the processes that have made those circuits? Because life's circuits must often solve the same problems as those faced by machine learning, such as environmental tracking, homeostatic control, dimensional reduction, or classification, we can begin by considering how machine learning designs computational circuits to solve problems. We can then ask: How much insight do those computational circuits provide about the design of biological circuits? How much does biology differ from computers in the particular circuit designs that it uses to solve problems? This article steps through two classic machine learning models to set the foundation for analyzing broad questions about the design of biological circuits. One insight is the surprising power of randomly connected networks. Another is the central role of internal models of the environment embedded within biological circuits, illustrated by a model of dimensional reduction and trend prediction. Overall, many challenges in biology have machine learning analogs, suggesting hypotheses about how biology's circuits are designed.",
    "authors": [
      "Steven A. Frank"
    ],
    "publication_date": "2024-08-18T22:11:24Z",
    "arxiv_id": "http://arxiv.org/abs/2408.09604v2",
    "download_url": "https://arxiv.org/abs/2408.09604v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Linguistic laws in biology",
    "abstract": "Linguistic laws, the common statistical patterns of human language, have been investigated by quantitative linguists for nearly a century. Recently, biologists from a range of disciplines have started to explore the prevalence of these laws beyond language, finding patterns consistent with linguistic laws across multiple levels of biological organisation, from molecular (genomes, genes, and proteins) to organismal (animal behaviour) to ecological (populations and ecosystems). We propose a new conceptual framework for the study of linguistic laws in biology, comprising and integrating distinct levels of analysis, from description to prediction to theory building. Adopting this framework will provide critical new insights into the fundamental rules of organisation underpinning natural systems, unifying linguistic laws and core theory in biology.",
    "authors": [
      "Stuart Semple",
      "Ramon Ferrer-i-Cancho",
      "Morgan L. Gustison"
    ],
    "publication_date": "2023-10-11T11:08:20Z",
    "arxiv_id": "http://arxiv.org/abs/2310.07387v1",
    "download_url": "https://arxiv.org/abs/2310.07387v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A biology journal that can teach physicists a lesson in peer review",
    "abstract": "This is a Commentary in $Physics~Today$ on the novel review process developed by the biology journal $eLife$, with the suggestion that it be adopted by physics journals.",
    "authors": [
      "Raymond E. Goldstein"
    ],
    "publication_date": "2016-12-01T13:37:04Z",
    "arxiv_id": "http://arxiv.org/abs/1612.00241v1",
    "download_url": "https://arxiv.org/abs/1612.00241v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Variational calculations on the hydrogen molecular ion",
    "abstract": "We present high-precision non-relativistic variational calculations of bound vibrational-rotational state energies for the $H_2^+$ and $D_2^+$ molecular ions in each of the lowest electronic states of $Σ_g$, $Σ_u$, and $Π_u$ symmetry. The calculations are carried out including coupling between $Σ$ and $Π$ states but without using the Born-Oppenheimer or any adiabatic approximation. Convergence studies are presented which indicate that the resulting energies for low-lying levels are accurate to about $10^{-13}$. Our procedure accounts naturally for the lambda-doubling of the $Π_u$ state.",
    "authors": [
      "J. M. Taylor",
      "Zong-Chao Yan",
      "A. Dalgarno",
      "J. F. Babb"
    ],
    "publication_date": "1998-11-21T21:35:41Z",
    "arxiv_id": "http://arxiv.org/abs/physics/9811043v2",
    "download_url": "https://arxiv.org/abs/physics/9811043v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Control-theoretic Model for Bidirectional Molecular Communication Systems",
    "abstract": "Molecular communication (MC) enables cooperation of spatially dispersed molecular robots through the feedback control mediated by diffusing signal molecules. However, conventional analysis frameworks for the MC channels mostly consider the dynamics of unidirectional communication, lacking the effect of feedback interactions. In this paper, we propose a general control-theoretic modeling framework for bidirectional MC systems capable of capturing the dynamics of feedback control via MC in a systematic manner. The proposed framework considers not only the dynamics of molecular diffusion but also the boundary dynamics at the molecular robots that captures the lag due to the molecular transmission/reception process affecting the performance of the entire feedback system. Thus, methods in control theory can be applied to systematically analyze various dynamical properties of the feedback system. We perform a frequency response analysis based on the proposed framework to show a general design guideline for MC channels to transfer signal with desired control bandwidth. Finally, these results are demonstrated by showing the step-by-step design procedure of a specific MC channel satisfying a given specification.",
    "authors": [
      "Taishi Kotsuka",
      "Yutaka Hori"
    ],
    "publication_date": "2022-10-26T17:32:15Z",
    "arxiv_id": "http://arxiv.org/abs/2210.14879v3",
    "download_url": "https://arxiv.org/abs/2210.14879v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "12mm line survey of the dense molecular gas towards the W28 field TeV gamma-ray sources",
    "abstract": "We present 12mm Mopra observations of dense molecular gas towards the W28 supernova remnant (SNR) field. The focus is on the dense molecular gas towards the TeV gamma-ray sources detected by the H.E.S.S. telescopes, which likely trace the cosmic-rays from W28 and possibly other sources in the region. Using the NH3 inversion transitions we reveal several dense cores inside the molecular clouds, the majority of which coincide with high-mass star formation and HII regions, including the energetic ultra-compact HII region G5.89-0.39. A key exception to this is the cloud north east of W28, which is well-known to be disrupted as evidenced by clusters of 1720MHz OH masers and broad CO line emission. Here we detect broad NH3, up to the (9,9) transition, with linewidths up to 16 km/s. This broad NH3 emission spatially matches well with the TeV source HESS J1801-233 and CO emission, and its velocity dispersion distribution suggests external disruption from the W28 SNR direction. Other lines are detected, such as HC3N and HC5N, H2O masers, and many radio recombination lines, all of which are primarily found towards the southern high-mass star formation regions. These observations provide a new view onto the internal structures and dynamics of the dense molecular gas towards the W28 SNR field, and in tandem with future higher resolution TeV gamma-ray observations will offer the chance to probe the transport of cosmic-rays into molecular clouds.",
    "authors": [
      "B. Nicholas",
      "G. Rowell",
      "M. G. Burton",
      "A. Walsh",
      "Y. Fukui",
      "A. Kawamura",
      "S. Longmore",
      "E. Keto"
    ],
    "publication_date": "2010-09-24T01:06:01Z",
    "arxiv_id": "http://arxiv.org/abs/1009.4745v1",
    "download_url": "https://arxiv.org/abs/1009.4745v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The necessity and power of random, under-sampled experiments in biology",
    "abstract": "A vast array of transformative technologies developed over the past decade has enabled measurement and perturbation at ever increasing scale, yet our understanding of many systems remains limited by experimental capacity. Overcoming this limitation is not simply a matter of reducing costs with existing approaches; for complex biological systems it will likely never be possible to comprehensively measure and perturb every combination of variables of interest. There is, however, a growing body of work - much of it foundational and precedent setting - that extracts a surprising amount of information from highly under sampled data. For a wide array of biological questions, especially the study of genetic interactions, approaches like these will be crucial to obtain a comprehensive understanding. Yet, there is no coherent framework that unifies these methods, provides a rigorous mathematical foundation to understand their limitations and capabilities, allows us to understand through a common lens their surprising successes, and suggests how we might crystalize the key concepts to transform experimental biology. Here, we review prior work on this topic - both the biology and the mathematical foundations of randomization and low dimensional inference - and propose a general framework to make data collection in a wide array of studies vastly more efficient using random experiments and composite experiments.",
    "authors": [
      "Brian Cleary",
      "Aviv Regev"
    ],
    "publication_date": "2020-12-23T20:38:33Z",
    "arxiv_id": "http://arxiv.org/abs/2012.12961v1",
    "download_url": "https://arxiv.org/abs/2012.12961v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Incorporating expression data in metabolic modeling: a case study of lactate dehydrogenase",
    "abstract": "Integrating biological information from different sources to understand cellular processes is an important problem in systems biology. We use data from mRNA expression arrays and chemical kinetics to formulate a metabolic model relevant to K562 erythroleukemia cells. MAP kinase pathway activation alters the expression of metabolic enzymes in K562 cells. Our array data show changes in expression of lactate dehydrogenase (LDH) isoforms after treatment with phorbol 12-myristate 13-acetate (PMA), which activates MAP kinase signaling. We model the change in lactate production which occurs when the MAP kinase pathway is activated, using a non-equilibrium, chemical-kinetic model of homolactic fermentation. In particular, we examine the role of LDH isoforms, which catalyze the conversion of pyruvate to lactate. Changes in the isoform ratio are not the primary determinant of the production of lactate. Rather, the total concentration of LDH controls the lactate concentration.",
    "authors": [
      "Joshua Downer",
      "Joel R. Sevinsky",
      "Natalie G. Ahn",
      "Katheryn A. Resing",
      "M. D. Betterton"
    ],
    "publication_date": "2005-11-12T20:30:13Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0511013v1",
    "download_url": "https://arxiv.org/abs/q-bio/0511013v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Reactive Molecular Dynamics Model for Uranium/Hydrogen Containing Systems",
    "abstract": "Uranium-based materials are valuable assets in the energy, medical, and military industries. However, understanding their sensitivity to hydrogen embrittlement is particularly challenging due to the toxicity of uranium and computationally expensive nature of the quantum-based methods generally required to study such processes. In this regard, we have developed a Chebyshev Interaction Model for Efficient Simulation (ChIMES) model that can be employed to compute energies and forces of U and UH3 bulk structures with vacancies and hydrogen interstitials with similar accuracy to Density Functional Theory (DFT) while yielding linear scaling and orders of magnitude improvement in computational efficiency. We show that that the bulk structural parameters, uranium and hydrogen vacancy formation energies, and diffusion barriers predicted by the ChIMES potential are in strong agreement with the reference DFT data. We then use ChIMES to conduct molecular dynamics simulations of the temperature-dependent diffusion of a hydrogen interstitial and determine the corresponding diffusion activation energy. Our model has particular significance in studies of actinides and other high-Z materials, where there is a strong need for computationally efficient methods to bridge length and time scales between experiments and quantum theory.",
    "authors": [
      "A. Soshnikov",
      "R. K. Lindsey",
      "A. Kulkarni",
      "N. Goldman"
    ],
    "publication_date": "2023-10-23T17:26:41Z",
    "arxiv_id": "http://arxiv.org/abs/2310.15122v1",
    "download_url": "https://arxiv.org/abs/2310.15122v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magnetic dipolar ordering and relaxation in the high-spin molecular cluster compound Mn6",
    "abstract": "Few examples of magnetic systems displaying a transition to pure dipolar magnetic order are known to date, and single-molecule magnets can provide an interesting example. The molecular cluster spins and thus their dipolar interaction energy can be quite high, leading to reasonably accessible ordering temperatures, provided the crystal field anisotropy is sufficiently small. This condition can be met for molecular clusters of sufficiently high symmetry, as for the Mn6 compound studied here. Magnetic specific heat and susceptibility experiments show a transition to ferromagnetic dipolar order at T_{c} = 0.16 K. Classical Monte-Carlo calculations indeed predict ferromagnetic ordering and account for the correct value of T_{c}. In high magnetic fields we detected the contribution of the ^{55}Mn nuclei to the specific heat, and the characteristic timescale of nuclear relaxation. This was compared with results obtained directly from pulse-NMR experiments. The data are in good mutual agreement and can be well described by the theory for magnetic relaxation in highly polarized paramagnetic crystals and for dynamic nuclear polarization, which we extensively review. The experiments provide an interesting comparison with the recently investigated nuclear spin dynamics in the anisotropic single molecule magnet Mn12-ac.",
    "authors": [
      "A. Morello",
      "F. L. Mettes",
      "O. N. Bakharev",
      "H. B. Brom",
      "L. J. de Jongh",
      "F. Luis",
      "J. F. Fernandez",
      "G. Aromi"
    ],
    "publication_date": "2005-09-10T00:06:46Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0509261v2",
    "download_url": "https://arxiv.org/abs/cond-mat/0509261v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Static to Dynamic: Exploring Temporal Networks in Systems Biology",
    "abstract": "Network science has become an essential interdisciplinary tool for understanding complex biological systems. However, because these systems undergo continuous, often stimulus-driven changes in both structure and function, traditional static network approaches frequently fall short in capturing their dynamic nature. Dynamic network analysis (DNA) addresses this limitation and offers a powerful framework to investigate these evolving relationships. This work focuses on temporal networks, a central paradigm within DNA, as an effective approach for modelling time-resolved changes in biological systems. While DNA has gained traction in domains like social and communication sciences, its integration in biology has been more gradual, hindered by data limitations and the need for domain-specific adaptations. Aimed at supporting researchers, particularly those new to the field, the review offers an integrative overview of the diverse and multidisciplinary landscape of DNA, with a focus on temporal networks in systems biology. I begin by clarifying foundational terminology and concepts, then present a multi-scale perspective spanning microscale (nodes and edges), mesoscale (motifs and communities), and macroscale (global topology) analyses. Finally, I explore analytical strategies and computational tools suited to various research objectives, including methods for detecting structural shifts, assessing network similarity, tracking module evolution, and predictive modelling of future network states.",
    "authors": [
      "Abir Khazaal",
      "Fatemeh Vafaee"
    ],
    "publication_date": "2025-05-15T23:06:13Z",
    "arxiv_id": "http://arxiv.org/abs/2505.10741v1",
    "download_url": "https://arxiv.org/abs/2505.10741v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Photoionization of Molecular Endohedrals",
    "abstract": "We calculate the photoionization cross-section of a molecular endohedral. We limit ourselves to two-atomic molecules. The consideration is much more complex than for atomic endohedrals because the system even for almost spherical fullerenes has only cylindrical instead of spherical symmetry. On the other hand, molecular endohedral is more interesting since the interelectron interaction in molecules is relatively stronger than in similar atoms. We present here results of calculations of molecular hydrogen stuffed inside almost spherical fullerene. For comparison, we perform calculations also for atomic endohedral with Helium inside fullerene. The results are obtained both in the single-electron Hartree-Fock approximation and with account of multi-electron correlations in the frame of so-called random phase approximation with exchange. The presence of the fullerenes shell results in prominent oscillations in the endohedrals photoionization cross section. The role of interelectron correlations becomes clear by comparing HF and RPAE results for molecular and atomic endohedral on the one side with that for corresponding isolated molecule and atom on the other.",
    "authors": [
      "M. Ya. Amusia",
      "L. V. Chernysheva",
      "S. K. Semenov"
    ],
    "publication_date": "2019-05-23T16:00:39Z",
    "arxiv_id": "http://arxiv.org/abs/1905.09739v1",
    "download_url": "https://arxiv.org/abs/1905.09739v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimization identification of superdiffusion processes in biology: an algorithm for processing observational data and a self-similar solution of the kinetic equation",
    "abstract": "This work is an attempt to transfer to biology the methods developed in physics for formulating and solving the kinetic equations in which the kernel of the integral operator in spatial coordinates is slowly decreasing with increasing distance and belongs to the class of Levy distributions. An algorithm is proposed for the reconstruction of the step-length probability density function (PDF) on a moderate number of trajectories of biological objects (migrants) and for the derivation of the Green's function of the corresponding integro-differential kinetic equation for the density of migrants in the entire space-time range, including the construction of an approximate self-similar solution. A wide class of time-dependent superdiffusion processes with a model power-law step-length PDF is considered, which corresponds to \"Levy walks with rests\" for given values of the migrant's constant velocity and the average time T of the migrant's stay between runs. The algorithm is tested within the framework of a synthetic diagnostics, consisting in the generation of artificial experimental data for trajectories of migrants and the subsequent reconstruction of the parameters of the step-length PDF and T. For different volumes of synthetic data, to obtain a general idea of the distributions under study (non-parametric case) and to evaluate the accuracy of recovering the parameters of the PDF (in the case of a parametric representation), the method of balanced identification is used. The approximate self-similar solution for the parameters of step-length PDF and T is shown to provide reasonable accuracy of the space-time evolution of migrant's density.",
    "authors": [
      "A. B. Kukushkin",
      "A. A. Kulichenko",
      "A. V. Sokolov"
    ],
    "publication_date": "2020-07-12T18:43:00Z",
    "arxiv_id": "http://arxiv.org/abs/2007.06064v1",
    "download_url": "https://arxiv.org/abs/2007.06064v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Learning of signaling networks: molecular mechanisms",
    "abstract": "Molecular processes of neuronal learning have been well-described. However, learning mechanisms of non-neuronal cells have not been fully understood at the molecular level. Here, we discuss molecular mechanisms of cellular learning, including conformational memory of intrinsically disordered proteins and prions, signaling cascades, protein translocation, RNAs (microRNA and lncRNA), and chromatin memory. We hypothesize that these processes constitute the learning of signaling networks and correspond to a generalized Hebbian learning process of single, non-neuronal cells, and discuss how cellular learning may open novel directions in drug design and inspire new artificial intelligence methods.",
    "authors": [
      "Péter Csermely",
      "Nina Kunsic",
      "Péter Mendik",
      "Márk Kerestély",
      "Teodóra Faragó",
      "Dániel V. Veres",
      "Péter Tompa"
    ],
    "publication_date": "2020-01-31T07:15:43Z",
    "arxiv_id": "http://arxiv.org/abs/2001.11679v2",
    "download_url": "https://arxiv.org/abs/2001.11679v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Systems Biology: Identifiability analysis and parameter identification via systems-biology informed neural networks",
    "abstract": "The dynamics of systems biological processes are usually modeled by a system of ordinary differential equations (ODEs) with many unknown parameters that need to be inferred from noisy and sparse measurements. Here, we introduce systems-biology informed neural networks for parameter estimation by incorporating the system of ODEs into the neural networks. To complete the workflow of system identification, we also describe structural and practical identifiability analysis to analyze the identifiability of parameters. We use the ultridian endocrine model for glucose-insulin interaction as the example to demonstrate all these methods and their implementation.",
    "authors": [
      "Mitchell Daneker",
      "Zhen Zhang",
      "George Em Karniadakis",
      "Lu Lu"
    ],
    "publication_date": "2022-02-03T17:40:03Z",
    "arxiv_id": "http://arxiv.org/abs/2202.01723v1",
    "download_url": "https://arxiv.org/abs/2202.01723v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generalising the Central Dogma as a cross-hierarchical principle of biology",
    "abstract": "The Central Dogma of molecular biology, as originally proposed by Crick, asserts that information passed into protein cannot flow back out. This principle has been interpreted as underpinning modern understandings of heredity and evolution, implying the unidirectionality of information flow from nucleic acids to proteins. Here, we propose a generalisation of the Central Dogma as a division of labour between the transmission and expression of information: the transmitter (nucleic acids) perpetuates information across generations, whereas the expressor (protein) enacts this information to facilitate the transmitter's function without itself perpetuating information. We argue that this generalisation offers two benefits. First, it provides a unifying perspective for comparing the Central Dogma to analogous divisions of labour observed at vastly different biological scales, including multicellular organisms, eukaryotic cells, organelles, and bacteria. Second, it offers a theoretical framework to explain the Central Dogma as an outcome of evolution. Specifically, we review a mathematical model suggesting that the Central Dogma originates through spontaneous symmetry breaking driven by evolutionary conflicts between different levels of selection. By reframing the Central Dogma as an informational relationship between components of a system, this generalisation underscores its broader relevance across the biological hierarchy and sheds light on its evolutionary origin.",
    "authors": [
      "Nobuto Takeuchi",
      "Kunihiko Kaneko"
    ],
    "publication_date": "2025-08-06T05:03:31Z",
    "arxiv_id": "http://arxiv.org/abs/2508.04085v1",
    "download_url": "https://arxiv.org/abs/2508.04085v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Field Biology Guide for the Curious Physicist",
    "abstract": "Fieldwork is an essential component not just for organismal biology but also for the expanding umbrella of disciplines that have turned their attention toward the physics of living systems. Observing organisms in nature is a critical component of discovery; however, conducting field research can be a barrier for scientists who do not have experience working with organisms under challenging field conditions. Here, we propose 7 critical steps for organizing and executing interdisciplinary, curiosity-driven field research. Our steps are drawn from insights gained from the in Situ Jungle Biomechanics Lab (JBL), a field research course that helps early-career scientists from both physical and life sciences gain experience in both organizing and conducting interdisciplinary field research in the Amazon Rainforest. We emphasize a curiosity-driven approach towards the scientific inquiry of living systems, one we believe is crucial for discovery while working with wild organisms under highly unpredictable field conditions. We further provide guidance on teamwork when conducting fieldwork, including creating an inclusive environment and advocating for codes of conduct and team structures that aid in conflict resolution. Finally, we outline what we call the in situ approach to fieldwork, one that requires engagements with the environment, scientific community, and local peoples where field sites exist.",
    "authors": [
      "S. David Stupski",
      "Laura Casas Ferrer",
      "Jacob S. Harrison",
      "Justina Jackson",
      "Carolina Paucarhuanca Mansilla",
      "Loribeth Maricielo Bolo Livano",
      "Avaneesh Narla",
      "Chew Chai",
      "Elizabeth Clark",
      "Nami Ha",
      "Jaime Quispe Nina",
      "Ethan Wold",
      "Johana Reyes-Quinteros",
      "Geoffrey Gallice",
      "Saad Bhamla"
    ],
    "publication_date": "2024-11-05T20:22:11Z",
    "arxiv_id": "http://arxiv.org/abs/2411.03498v2",
    "download_url": "https://arxiv.org/abs/2411.03498v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "JAK/STAT signalling - an executable model assembled from molecule-centred modules demonstrating a module-oriented database concept for systems- and synthetic biology",
    "abstract": "We describe a molecule-oriented modelling approach based on a collection of Petri net models organized in the form of modules into a prototype database accessible through a web interface. The JAK/STAT signalling pathway with the extensive cross-talk of its components is selected as case study. Each Petri net module represents the reactions of an individual protein with its specific interaction partners. These Petri net modules are graphically displayed, can be executed individually, and allow the automatic composition into coherent models containing an arbitrary number of molecular species chosen ad hoc by the user. Each module contains metadata for documentation purposes and can be extended to a wiki-like minireview. The database can manage multiple versions of each module. It supports the curation, documentation, version control, and update of individual modules and the subsequent automatic composition of complex models, without requiring mathematical skills. Modules can be (semi-) automatically recombined according to user defined scenarios e.g. gene expression patterns in given cell types, under certain physiological conditions, or states of disease. Adding a localisation component to the module database would allow to simulate models with spatial resolution in the form of coloured Petri nets. As synthetic biology application we propose the fully automated generation of synthetic or synthetically rewired network models by composition of metadata-guided automatically modified modules representing altered protein binding sites. Petri nets composed from modules can be executed as ODE system, stochastic, hybrid, or merely qualitative models and exported in SMBL format.",
    "authors": [
      "Mary Ann Blätke",
      "Anna Dittrich",
      "Christian Rohr",
      "Monika Heiner",
      "Fred Schaper",
      "Wolfgang Marwan"
    ],
    "publication_date": "2012-06-05T15:21:49Z",
    "arxiv_id": "http://arxiv.org/abs/1206.0959v1",
    "download_url": "https://arxiv.org/abs/1206.0959v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermal quantum time-correlation functions from classical-like dynamics",
    "abstract": "Thermal quantum time-correlation functions are of fundamental importance in quantum dynamics, allowing experimentally-measurable properties such as reaction rates, diffusion constants and vibrational spectra to be computed from first principles. Since the exact quantum solution scales exponentially with system size, there has been considerable effort in formulating reliable linear-scaling methods involving exact quantum statistics and approximate quantum dynamics modelled with classical-like trajectories. Here we review recent progress in the field with the development of methods including Centroid Molecular Dynamics (CMD), Ring Polymer Molecular Dynamics (RPMD) and Thermostatted RPMD (TRPMD). We show how these methods have recently been obtained from `Matsubara dynamics', a form of semiclassical dynamics which conserves the quantum Boltzmann distribution. We also rederive t->0+ quantum transition-state theory (QTST) in the Matsubara dynamics formalism showing that Matsubara-TST, like RPMD-TST, is equivalent to QTST. We end by surveying areas for future progress.",
    "authors": [
      "Timothy J. H. Hele"
    ],
    "publication_date": "2017-01-11T15:32:40Z",
    "arxiv_id": "http://arxiv.org/abs/1701.03016v1",
    "download_url": "https://arxiv.org/abs/1701.03016v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deep Learning in Computational Biology: Advancements, Challenges, and Future Outlook",
    "abstract": "Deep learning has become a powerful tool in computational biology, revolutionising the analysis and interpretation of biological data over time. In our article review, we delve into various aspects of deep learning in computational biology. Specifically, we examine its history, advantages, and challenges. Our focus is on two primary applications: DNA sequence classification and prediction, as well as protein structure prediction from sequence data. Additionally, we provide insights into the outlook for this field. To fully harness the potential of deep learning in computational biology, it is crucial to address the challenges that come with it. These challenges include the requirement for large, labelled datasets and the interpretability of deep learning models. The use of deep learning in the analysis of DNA sequences has brought about a significant transformation in the detection of genomic variants and the analysis of gene expression. This has greatly contributed to the advancement of personalised medicine and drug discovery. Convolutional neural networks (CNNs) have been shown to be highly accurate in predicting genetic variations and gene expression levels. Deep learning techniques are used for analysing epigenetic data, including DNA methylation and histone modifications. This provides valuable insights into metabolic conditions and gene regulation. The field of protein structure prediction has been significantly impacted by deep learning, which has enabled accurate determination of the three-dimensional shape of proteins and prediction of their interactions. The future of deep learning in computational biology looks promising. With the development of advanced deep learning models and interpretation techniques, there is potential to overcome current challenges and further our understanding of biological systems.",
    "authors": [
      "Suresh Kumar",
      "Dhanyashri Guruparan",
      "Pavithren Aaron",
      "Philemon Telajan",
      "Kavinesh Mahadevan",
      "Dinesh Davagandhi",
      "Ong Xin Yue"
    ],
    "publication_date": "2023-10-02T07:53:05Z",
    "arxiv_id": "http://arxiv.org/abs/2310.03086v1",
    "download_url": "https://arxiv.org/abs/2310.03086v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ODEbase: A Repository of ODE Systems for Systems Biology",
    "abstract": "Recently, symbolic computation and computer algebra systems have been successfully applied in systems biology, especially in chemical reaction network theory. One advantage of symbolic computation is its potential for qualitative answers to biological questions. Qualitative methods analyze dynamical input systems as formal objects, in contrast to investigating only part of the state space, as is the case with numerical simulation. However, symbolic computation tools and libraries have a different set of requirements for their input data than their numerical counterparts. A common format used in mathematical modeling of biological processes is SBML. We illustrate that the use of SBML data in symbolic computation requires significant pre-processing, incorporating external biological and mathematical expertise. ODEbase provides high quality symbolic computation input data derived from established existing biomodels, covering in particular the BioModels database.",
    "authors": [
      "Christoph Lüders",
      "Thomas Sturm",
      "Ovidiu Radulescu"
    ],
    "publication_date": "2022-01-22T07:22:01Z",
    "arxiv_id": "http://arxiv.org/abs/2201.08980v1",
    "download_url": "https://arxiv.org/abs/2201.08980v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PEtab -- interoperable specification of parameter estimation problems in systems biology",
    "abstract": "Reproducibility and reusability of the results of data-based modeling studies are essential. Yet, there has been -- so far -- no broadly supported format for the specification of parameter estimation problems in systems biology. Here, we introduce PEtab, a format which facilitates the specification of parameter estimation problems using Systems Biology Markup Language (SBML) models and a set of tab-separated value files describing the observation model and experimental data as well as parameters to be estimated. We already implemented PEtab support into eight well-established model simulation and parameter estimation toolboxes with hundreds of users in total. We provide a Python library for validation and modification of a PEtab problem and currently 20 example parameter estimation problems based on recent studies. Specifications of PEtab, the PEtab Python library, as well as links to examples, and all supporting software tools are available at https://github.com/PEtab-dev/PEtab, a snapshot is available at https://doi.org/10.5281/zenodo.3732958. All original content is available under permissive licenses.",
    "authors": [
      "Leonard Schmiester",
      "Yannik Schälte",
      "Frank T. Bergmann",
      "Tacio Camba",
      "Erika Dudkin",
      "Janine Egert",
      "Fabian Fröhlich",
      "Lara Fuhrmann",
      "Adrian L. Hauber",
      "Svenja Kemmer",
      "Polina Lakrisenko",
      "Carolin Loos",
      "Simon Merkt",
      "Wolfgang Müller",
      "Dilan Pathirana",
      "Elba Raimúndez",
      "Lukas Refisch",
      "Marcus Rosenblatt",
      "Paul L. Stapor",
      "Philipp Städter",
      "Dantong Wang",
      "Franz-Georg Wieland",
      "Julio R. Banga",
      "Jens Timmer",
      "Alejandro F. Villaverde",
      "Sven Sahle",
      "Clemens Kreutz",
      "Jan Hasenauer",
      "Daniel Weindl"
    ],
    "publication_date": "2020-04-02T17:25:43Z",
    "arxiv_id": "http://arxiv.org/abs/2004.01154v4",
    "download_url": "https://arxiv.org/abs/2004.01154v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysing control-theoretic properties of nonlinear synthetic biology circuits",
    "abstract": "Synthetic biology is a recent area of biological engineering, whose aim is to provide cells with novel functionalities. A number of important results regarding the development of control circuits in synthetic biology have been achieved during the last decade. A differential geometry approach can be used for the analysis of said systems, which are often nonlinear. Here we demonstrate the application of such tools to analyse the structural identifiability, observability, accessibility, and controllability of several biomolecular systems. We focus on a set of synthetic circuits of current interest, which can perform several tasks, both in open loop and closed loop settings. We analyse their properties with our own methods and tools; further, we describe a new open-source implementation of the techniques.",
    "authors": [
      "Antón Pardo",
      "Sandra Díaz Seoane",
      "Dorin A. Ionescu",
      "Antonis Papachristodoulou",
      "Alejandro F. Villaverde"
    ],
    "publication_date": "2024-11-08T09:55:47Z",
    "arxiv_id": "http://arxiv.org/abs/2411.05450v1",
    "download_url": "https://arxiv.org/abs/2411.05450v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SBtab - Conventions for structured data tables in Systems Biology",
    "abstract": "Data tables in the form of spreadsheets or delimited text files are the most utilised data format in Systems Biology. However, they are often not sufficiently structured and lack clear naming conventions that would be required for modelling. We propose the SBtab format as an attempt to establish an easy-to-use table format that is both flexible and clearly structured. It comprises defined table types for different kinds of data; syntax rules for usage of names, shortnames, and database identifiers used for annotation; and standardised formulae for reaction stoichiometries. Predefined table types can be used to define biochemical network models and the biochemical constants therein. The user can also define own table types, adjusting SBtab to other types of data. Software code, tools, and further information can be found at www.sbtab.net.",
    "authors": [
      "Wolfram Liebermeister",
      "Timo Lubitz",
      "Jens Hahn"
    ],
    "publication_date": "2015-02-05T08:53:46Z",
    "arxiv_id": "http://arxiv.org/abs/1502.01463v2",
    "download_url": "https://arxiv.org/abs/1502.01463v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Effects of Subsurface Chemistry in the Grain Mantles on the Deuterium Chemistry in Molecular Clouds",
    "abstract": "The deuterium enrichment in molecules in dark molecular cloud cores and starforming regions is usually attributed to gas-phase chemistry. Here we examine the effects of surface and mantle chemical reactions on the deuteration of species. We use a simple kinetic chemistry model that includes gas, surface and mantle pore phase reactions of deuterated species. The mantle is assumed to be partially reactive due to pores with sufficient surface area for chemical reactions, that are continuously transformed by cosmic-rays. Calculation results show that surface reactions generally enhance the deuteration for at least several molecules. However, once they are buried and become mantle molecules, they lose their deuteration over a timescale of 10 million years due to processes in the mantle. If deuterated species in young star-forming regions come from grain mantles, a cautious conclusion is that the freeze-out of molecules, perhaps, should not occur more than 10 Myr before the mantle evaporates to the gas phase.",
    "authors": [
      "Juris Kalvans",
      "Ivar Shmeld"
    ],
    "publication_date": "2018-03-15T13:21:53Z",
    "arxiv_id": "http://arxiv.org/abs/1803.05731v1",
    "download_url": "https://arxiv.org/abs/1803.05731v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Machine Learning for Integrating Data in Biology and Medicine: Principles, Practice, and Opportunities",
    "abstract": "New technologies have enabled the investigation of biology and human health at an unprecedented scale and in multiple dimensions. These dimensions include a myriad of properties describing genome, epigenome, transcriptome, microbiome, phenotype, and lifestyle. No single data type, however, can capture the complexity of all the factors relevant to understanding a phenomenon such as a disease. Integrative methods that combine data from multiple technologies have thus emerged as critical statistical and computational approaches. The key challenge in developing such approaches is the identification of effective models to provide a comprehensive and relevant systems view. An ideal method can answer a biological or medical question, identifying important features and predicting outcomes, by harnessing heterogeneous data across several dimensions of biological variation. In this Review, we describe the principles of data integration and discuss current methods and available implementations. We provide examples of successful data integration in biology and medicine. Finally, we discuss current challenges in biomedical integrative methods and our perspective on the future development of the field.",
    "authors": [
      "Marinka Zitnik",
      "Francis Nguyen",
      "Bo Wang",
      "Jure Leskovec",
      "Anna Goldenberg",
      "Michael M. Hoffman"
    ],
    "publication_date": "2018-06-30T04:31:59Z",
    "arxiv_id": "http://arxiv.org/abs/1807.00123v2",
    "download_url": "https://arxiv.org/abs/1807.00123v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multi-Modal Representation Learning for Molecular Property Prediction: Sequence, Graph, Geometry",
    "abstract": "Molecular property prediction refers to the task of labeling molecules with some biochemical properties, playing a pivotal role in the drug discovery and design process. Recently, with the advancement of machine learning, deep learning-based molecular property prediction has emerged as a solution to the resource-intensive nature of traditional methods, garnering significant attention. Among them, molecular representation learning is the key factor for molecular property prediction performance. And there are lots of sequence-based, graph-based, and geometry-based methods that have been proposed. However, the majority of existing studies focus solely on one modality for learning molecular representations, failing to comprehensively capture molecular characteristics and information. In this paper, a novel multi-modal representation learning model, which integrates the sequence, graph, and geometry characteristics, is proposed for molecular property prediction, called SGGRL. Specifically, we design a fusion layer to fusion the representation of different modalities. Furthermore, to ensure consistency across modalities, SGGRL is trained to maximize the similarity of representations for the same molecule while minimizing similarity for different molecules. To verify the effectiveness of SGGRL, seven molecular datasets, and several baselines are used for evaluation and comparison. The experimental results demonstrate that SGGRL consistently outperforms the baselines in most cases. This further underscores the capability of SGGRL to comprehensively capture molecular information. Overall, the proposed SGGRL model showcases its potential to revolutionize molecular property prediction by leveraging multi-modal representation learning to extract diverse and comprehensive molecular insights. Our code is released at https://github.com/Vencent-Won/SGGRL.",
    "authors": [
      "Zeyu Wang",
      "Tianyi Jiang",
      "Jinhuan Wang",
      "Qi Xuan"
    ],
    "publication_date": "2024-01-07T02:18:00Z",
    "arxiv_id": "http://arxiv.org/abs/2401.03369v2",
    "download_url": "https://arxiv.org/abs/2401.03369v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Photostop: Production of zero-velocity molecules by photodissociation in a molecular beam",
    "abstract": "We have demonstrated a new, accessible and economical technique, dubbed photostop, for producing high densities of trappable molecules. Direct measurements are presented of NO molecules produced with a narrow velocity distribution centered at zero in the laboratory frame. NO2, initially cooled in a pulsed molecular beam, is photodissociated such that the recoil velocity of the NO photofragments cancels out the velocity of the beam. NO(X^2Pi_3/2, v=0, J=1.5) molecules are observed up to 10 mircoseconds after the dissociation event in the probe volume at an estimated density of 1E7 cm-3 per quantum state and at a translational temperature of 1.6 K. Through the choice of suitable precursors, photostop has the potential to extend the list atoms and molecules that can be slowed or trapped. It should be possible to accumulate density in a trap through consecutive loading of multiple pulses.",
    "authors": [
      "Alexandre Trottier",
      "David Carty",
      "Eckart Wrede"
    ],
    "publication_date": "2010-02-19T10:09:06Z",
    "arxiv_id": "http://arxiv.org/abs/1002.3698v1",
    "download_url": "https://arxiv.org/abs/1002.3698v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Physical principles underpinning molecular-level protein evolution",
    "abstract": "Since protein mutations are the main driving force of evolution at the molecular level, a proper analysis of them (and the factors controlling them) will enable us to find a response to several crucial queries in evolutionary biology. Among them, we highlight the following: At the molecular level, what factors determine whether protein evolution is repeatable? Aiming at finding an answer to this and several other significant questions behind protein evolvability and the factors that control it (including, but not limited to, the proteins' robustness, the evolutionary pathways, the number of ancestors, the epistasis, the post-translational modifications, and the location and order of mutations) we distinguish two evolutionary models in our analysis: convergent and divergent, based on whether or not a target sequence needs to be reached after n-mutational steps beginning with a wild-type protein sequence (from an unknown ancestor). Preliminary results suggest (regardless of whether the evolution is convergent or divergent) a tight relationship between the thermodynamic hypothesis (or Anfinsen's dogma) and protein evolution at the molecular level. This conjecture will allow us to uncover how fundamental physical principles guide protein evolution, and to gain a deeper grasp of mutationally driven evolutionary processes and the factors that influence them. Breaking down complex evolutionary problems into manageable pieces (without compromising the vision of the problem as a whole) could lead to effective solutions to critical evolutionary biology challenges, paving the way for further progress in this field.",
    "authors": [
      "J. A. Vila"
    ],
    "publication_date": "2024-12-19T21:49:46Z",
    "arxiv_id": "http://arxiv.org/abs/2412.16245v1",
    "download_url": "https://arxiv.org/abs/2412.16245v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Verifying thermodynamic equilibrium of molecular manifolds: Kennard-Stepanov spectroscopy of a molecular gas",
    "abstract": "The degree of thermalization of electronically excited state manifolds of an absorber can be tested via optical spectroscopy. In the thermalized-manifold case, the ratio of absorption and emission is expected to follow a universal Boltzmann-type frequency scaling, known as the Kennard-Stepanov relation. Here, we investigate absorption and emission spectral profiles of rubidium, cesium, and potassium molecular dimers in a high-pressure argon buffer-gas environment and study the effect of collisionally induced redistribution. We find that, despite the use of nonlinear excitation techniques, the ratio of absorption and emission well follows the Kennard-Stepanov scaling for a variety of molecular transitions. We conclude that the upper electronic state rovibrational manifold of the molecular gas is well in thermodynamic equilibrium. Further, we demonstrate an accurate, calibration-free determination of the gas temperature from the measured spectroscopic data.",
    "authors": [
      "Stavros Christopoulos",
      "Dominik Möller",
      "Roberto Cota",
      "Benedikt Gerwers",
      "Martin Weitz"
    ],
    "publication_date": "2017-03-20T10:03:37Z",
    "arxiv_id": "http://arxiv.org/abs/1703.06650v1",
    "download_url": "https://arxiv.org/abs/1703.06650v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Formulation of the Ring Polymer Molecular Dynamics",
    "abstract": "The exact formulation of the path integral centroid dynamics is extended to include composites of the position and momentum operators. We present the generalized centroid dynamics (GCD), which provides a basis to calculate Kubo-transformed correlation functions by means of classical averages. We define various types of approximate GCD, one of which is equivalent to the ring polymer molecular dynamics (RPMD). The RPMD and another approximate GCD are tested in one-dimensional harmonic system, and it is shown that the RPMD works better in the short time region.",
    "authors": [
      "Atsushi Horikoshi"
    ],
    "publication_date": "2014-01-04T08:09:01Z",
    "arxiv_id": "http://arxiv.org/abs/1401.0790v1",
    "download_url": "https://arxiv.org/abs/1401.0790v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Artificial Intelligence Advances for De Novo Molecular Structure Modeling in Cryo-EM",
    "abstract": "Cryo-electron microscopy (cryo-EM) has become a major experimental technique to determine the structures of large protein complexes and molecular assemblies, as evidenced by the 2017 Nobel Prize. Although cryo-EM has been drastically improved to generate high-resolution three-dimensional (3D) maps that contain detailed structural information about macromolecules, the computational methods for using the data to automatically build structure models are lagging far behind. The traditional cryo-EM model building approach is template-based homology modeling. Manual de novo modeling is very time-consuming when no template model is found in the database. In recent years, de novo cryo-EM modeling using machine learning (ML) and deep learning (DL) has ranked among the top-performing methods in macromolecular structure modeling. Deep-learning-based de novo cryo-EM modeling is an important application of artificial intelligence, with impressive results and great potential for the next generation of molecular biomedicine. Accordingly, we systematically review the representative ML/DL-based de novo cryo-EM modeling methods. And their significances are discussed from both practical and methodological viewpoints. We also briefly describe the background of cryo-EM data processing workflow. Overall, this review provides an introductory guide to modern research on artificial intelligence (AI) for de novo molecular structure modeling and future directions in this emerging field.",
    "authors": [
      "Dong Si",
      "Andrew Nakamura",
      "Runbang Tang",
      "Haowen Guan",
      "Jie Hou",
      "Ammaar Firozi",
      "Renzhi Cao",
      "Kyle Hippe",
      "Minglei Zhao"
    ],
    "publication_date": "2021-02-11T17:06:20Z",
    "arxiv_id": "http://arxiv.org/abs/2102.06125v2",
    "download_url": "https://arxiv.org/abs/2102.06125v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A practical guide to pseudo-marginal methods for computational inference in systems biology",
    "abstract": "For many stochastic models of interest in systems biology, such as those describing biochemical reaction networks, exact quantification of parameter uncertainty through statistical inference is intractable. Likelihood-free computational inference techniques enable parameter inference when the likelihood function for the model is intractable but the generation of many sample paths is feasible through stochastic simulation of the forward problem. The most common likelihood-free method in systems biology is approximate Bayesian computation that accepts parameters that result in low discrepancy between stochastic simulations and measured data. However, it can be difficult to assess how the accuracy of the resulting inferences are affected by the choice of acceptance threshold and discrepancy function. The pseudo-marginal approach is an alternative likelihood-free inference method that utilises a Monte Carlo estimate of the likelihood function. This approach has several advantages, particularly in the context of noisy, partially observed, time-course data typical in biochemical reaction network studies. Specifically, the pseudo-marginal approach facilitates exact inference and uncertainty quantification, and may be efficiently combined with particle filters for low variance, high-accuracy likelihood estimation. In this review, we provide a practical introduction to the pseudo-marginal approach using inference for biochemical reaction networks as a series of case studies. Implementations of key algorithms and examples are provided using the Julia programming language; a high performance, open source programming language for scientific computing.",
    "authors": [
      "David J. Warne",
      "Ruth E. Baker",
      "Matthew J. Simpson"
    ],
    "publication_date": "2019-12-28T05:16:22Z",
    "arxiv_id": "http://arxiv.org/abs/1912.12404v1",
    "download_url": "https://arxiv.org/abs/1912.12404v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Higher Order Derivative-Based Receiver Pre-processing for Molecular Communications",
    "abstract": "While molecular communication via diffusion experiences significant inter-symbol interference (ISI), recent work suggests that ISI can be mitigated via time differentiation pre-processing which achieves pulse narrowing. Herein, the approach is generalized to higher order differentiation. The fundamental trade-off between ISI mitigation and noise amplification is characterized, showing the existence of an optimal derivative order that minimizes the bit error rate (BER). Theoretical analyses of the BER and a signal-to-interference-plus-noise ratio are provided, the derivative order optimization problem is posed and solved for threshold-based detectors. For more complex detectors which exploit a window memory, it is shown that derivative pre-processing can strongly reduce the size of the needed window. Extensive numerical results confirm the accuracy of theoretical derivations, the gains in performance via derivative pre-processing over other methods and the impact of the optimal derivative order. Derivative pre-processing offers a low complexity/high-performance method for reducing ISI at the expense of increased transmission power to reduce noise amplification.",
    "authors": [
      "Mustafa Can Gursoy",
      "Urbashi Mitra"
    ],
    "publication_date": "2021-08-17T18:08:45Z",
    "arxiv_id": "http://arxiv.org/abs/2108.07830v1",
    "download_url": "https://arxiv.org/abs/2108.07830v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Convex Optimization of Distributed Cooperative Detection in Multi-Receiver Molecular Communication",
    "abstract": "In this paper, the error performance achieved by cooperative detection among K distributed receivers in a diffusion-based molecular communication (MC) system is analyzed and optimized. In this system, the receivers first make local hard decisions on the transmitted symbol and then report these decisions to a fusion center (FC). The FC combines the local hard decisions to make a global decision using an N-out-of-K fusion rule. Two reporting scenarios, namely, perfect reporting and noisy reporting, are considered. Closed-form expressions are derived for the expected global error probability of the system for both reporting scenarios. New approximated expressions are also derived for the expected error probability. Convex constraints are then found to make the approximated expressions jointly convex with respect to the decision thresholds at the receivers and the FC. Based on such constraints, suboptimal convex optimization problems are formulated and solved to determine the optimal decision thresholds which minimize the expected error probability of the system. Numerical and simulation results reveal that the system error performance is greatly improved by combining the detection information of distributed receivers. They also reveal that the solutions to the formulated suboptimal convex optimization problems achieve near-optimal global error performance.",
    "authors": [
      "Yuting Fang",
      "Adam Noel",
      "Nan Yang",
      "Andrew W. Eckford",
      "Rodney A. Kennedy"
    ],
    "publication_date": "2016-11-17T06:59:41Z",
    "arxiv_id": "http://arxiv.org/abs/1611.05590v3",
    "download_url": "https://arxiv.org/abs/1611.05590v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient and Robust Continual Graph Learning for Graph Classification in Biology",
    "abstract": "Graph classification is essential for understanding complex biological systems, where molecular structures and interactions are naturally represented as graphs. Traditional graph neural networks (GNNs) perform well on static tasks but struggle in dynamic settings due to catastrophic forgetting. We present Perturbed and Sparsified Continual Graph Learning (PSCGL), a robust and efficient continual graph learning framework for graph data classification, specifically targeting biological datasets. We introduce a perturbed sampling strategy to identify critical data points that contribute to model learning and a motif-based graph sparsification technique to reduce storage needs while maintaining performance. Additionally, our PSCGL framework inherently defends against graph backdoor attacks, which is crucial for applications in sensitive biological contexts. Extensive experiments on biological datasets demonstrate that PSCGL not only retains knowledge across tasks but also enhances the efficiency and robustness of graph classification models in biology.",
    "authors": [
      "Ding Zhang",
      "Jane Downer",
      "Can Chen",
      "Ren Wang"
    ],
    "publication_date": "2024-11-18T15:47:37Z",
    "arxiv_id": "http://arxiv.org/abs/2411.11668v1",
    "download_url": "https://arxiv.org/abs/2411.11668v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chem2Bio2RDF: A Linked Open Data Portal for Chemical Biology",
    "abstract": "The Chem2Bio2RDF portal is a Linked Open Data (LOD) portal for systems chemical biology aiming for facilitating drug discovery. It converts around 25 different datasets on genes, compounds, drugs, pathways, side effects, diseases, and MEDLINE/PubMed documents into RDF triples and links them to other LOD bubbles, such as Bio2RDF, LODD and DBPedia. The portal is based on D2R server and provides a SPARQL endpoint, but adds on few unique features like RDF faceted browser, user-friendly SPARQL query generator, MEDLINE/PubMed cross validation service, and Cytoscape visualization plugin. Three use cases demonstrate the functionality and usability of this portal.",
    "authors": [
      "Bin Chen",
      "David J Wild",
      "Qian Zhu",
      "Ying Ding",
      "Xiao Dong",
      "Madhuvanthi Sankaranarayanan",
      "Huijun Wang",
      "Yuyin Sun"
    ],
    "publication_date": "2010-12-21T18:29:54Z",
    "arxiv_id": "http://arxiv.org/abs/1012.4759v1",
    "download_url": "https://arxiv.org/abs/1012.4759v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The art of molecular computing: whence and whither",
    "abstract": "An astonishingly diverse biomolecular circuitry orchestrates the functioning machinery underlying every living cell. These biomolecules and their circuits have been engineered not only for various industrial applications but also to perform other atypical functions that they were not evolved for - including computation. Various kinds of computational challenges, such as solving NP-complete problems with many variables, logical computation, neural network operations, and cryptography, have all been attempted through this unconventional computing paradigm. In this review, we highlight key experiments across three different eras of molecular computation, beginning with molecular solutions, transitioning to logic circuits and ultimately, more complex molecular networks. We also discuss a variety of applications of molecular computation, from solving NP-hard problems to self-assembled nanostructures for delivering molecules, and provide a glimpse into the exciting potential that molecular computing holds for the future.",
    "authors": [
      "Sahana Gangadharan",
      "Karthik Raman"
    ],
    "publication_date": "2021-02-12T17:15:18Z",
    "arxiv_id": "http://arxiv.org/abs/2102.06629v1",
    "download_url": "https://arxiv.org/abs/2102.06629v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Physics of Transport and Traffic Phenomena in Biology: from molecular motors and cells to organisms",
    "abstract": "Traffic-like collective movements are observed at almost all levels of biological systems. Molecular motor proteins like, for example, kinesin and dynein, which are the vehicles of almost all intra-cellular transport in eukayotic cells, sometimes encounter traffic jam that manifests as a disease of the organism. Similarly, traffic jam of collagenase MMP-1, which moves on the collagen fibrils of the extracellular matrix of vertebrates, has also been observed in recent experiments. Traffic-like movements of social insects like ants and termites on trails are, perhaps, more familiar in our everyday life. Experimental, theoretical and computational investigations in the last few years have led to a deeper understanding of the generic or common physical principles involved in these phenomena. In particular, some of the methods of non-equilibrium statistical mechanics, pioneered almost a hundred years ago by Einstein, Langevin and others, turned out to be powerful theoretical tools for quantitaive analysis of models of these traffic-like collective phenomena as these systems are intrinsically far from equilibrium. In this review we critically examine the current status of our understanding, expose the limitations of the existing methods, mention open challenging questions and speculate on the possible future directions of research in this interdisciplinary area where physics meets not only chemistry and biology but also (nano-)technology.",
    "authors": [
      "Debashish Chowdhury",
      "Andreas Schadschneider",
      "Katsuhiro Nishinari"
    ],
    "publication_date": "2005-09-03T13:36:42Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0509025v2",
    "download_url": "https://arxiv.org/abs/physics/0509025v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimal enumeration of state space of finitely buffered stochastic molecular networks and exact computation of steady state landscape probability",
    "abstract": "Stochasticity plays important roles in molecular networks when molecular concentrations are in the range of $0.1 μ$M to $10 n$M (about 100 to 10 copies in a cell). The chemical master equation provides a fundamental framework for studying these networks, and the time-varying landscape probability distribution over the full microstates provide a full characterization of the network dynamics. A complete characterization of the space of the microstates is a prerequisite for obtaining the full landscape probability distribution of a network. However, there are neither closed-form solutions nor algorithms fully describing all microstates for a given molecular network.\n  We have developed an algorithm that can exhaustively enumerate the microstates of a molecular network of small copy numbers under the finite buffer condition that the net gain in newly synthesized molecules is smaller than a predefined limit. We also describe a simple method for computing the exact mean or steady state landscape probability distribution over microstates. We show how the full landscape probability for the gene networks of the self-regulating gene and the toggle-switch in the steady state can be fully characterized. We also give an example using the MAPK cascade network.\n  Our algorithm works for networks of small copy numbers buffered with a finite copy number of net molecules that can be synthesized, regardless of the reaction stoichiometry, and is optimal in both storage and time complexity. The buffer size is limited by the available memory or disk storage. Our algorithm is applicable to a class of biological networks when the copy numbers of molecules are small and the network is closed, or the network is open but the net gain in newly synthesized molecules does not exceed a predefined buffer capacity.",
    "authors": [
      "Youfang Cao",
      "Jie Liang"
    ],
    "publication_date": "2013-03-12T23:33:26Z",
    "arxiv_id": "http://arxiv.org/abs/1303.3057v1",
    "download_url": "https://arxiv.org/abs/1303.3057v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inelastic effects in molecular junction transport: Scattering and self-consistent calculations for the Seebeck coefficient",
    "abstract": "The influence of molecular vibration on the Seebeck coefficient is studied within a simple model. Results of a scattering theory approach are compared to those of a full self-consistent non-equilibrium Green's function scheme. We show, for a reasonable choice of parameters, that inelastic effects have non-negligible influence on the resulting Seebeck coefficient for the junction. We note that the scattering theory approach may fail both quantitatively and qualitatively. Results of calculation with reasonable parameters are in good agreement with recent measurements [P. Reddy et al., Science 315, 1568 (2007)]",
    "authors": [
      "Michael Galperin",
      "Abraham Nitzan",
      "Mark A. Ratner"
    ],
    "publication_date": "2007-09-22T22:53:11Z",
    "arxiv_id": "http://arxiv.org/abs/0709.3610v1",
    "download_url": "https://arxiv.org/abs/0709.3610v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Editorial: Special Issue on the Atomic and Molecular Processes in the Ultracold Regime, the Chemical Regime, and Astrophysics",
    "abstract": "This editorial introduces the J. Phys. B: Atomic, Molecular and Optical Physics Special Issue \"Atomic and Molecular Processes in the Ultracold Regime, the Chemical Regime and Astrophysics\" dedicated to Professor Alexander Dalgarno (1928-2015). After a brief biographical review, short summaries of the contributed papers and their relations to some of Prof. Dalgarno's work are given.",
    "authors": [
      "J. F. Babb",
      "R. Côté",
      "H. R. Sadeghpour",
      "P. C. Stancil"
    ],
    "publication_date": "2017-08-02T21:58:31Z",
    "arxiv_id": "http://arxiv.org/abs/1708.00943v1",
    "download_url": "https://arxiv.org/abs/1708.00943v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the use of the group SO(4,2) in atomic and molecular physics",
    "abstract": "In this paper the dynamical noninvariance group SO(4,2) for a hydrogen-like atom is derived through two different approaches. The first one is by an established traditional ascent process starting from the symmetry group SO(3). This approach is presented in a mathematically oriented original way with a special emphasis on maximally superintegrable systems, N-dimensional extension and little groups. The second approach is by a new symmetry descent process starting from the noninvariance dynamical group Sp(8,R) for a four-dimensional harmonic oscillator. It is based on the little known concept of a Lie algebra under constraints and corresponds in some sense to a symmetry breaking mechanism. This paper ends with a brief discussion of the interest of SO(4,2) for a new group-theoretical approach to the periodic table of chemical elements. In this connection, a general ongoing programme based on the use of a complete set of commuting operators is briefly described. It is believed that the present paper could be useful not only to the atomic and molecular community but also to people working in theoretical and mathematical physics.",
    "authors": [
      "Maurice Robert Kibler"
    ],
    "publication_date": "2004-09-29T12:21:49Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0409209v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0409209v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Expressions for forces and torques in molecular simulations using rigid bodies",
    "abstract": "Expressions for intermolecular forces and torques, derived from pair potentials between rigid non-spherical units, are presented. The aim is to give compact and clear expressions, which are easily generalised, and which minimise the risk of error in writing molecular dynamics simulation programs. It is anticipated that these expressions will be useful in the simulation of liquid crystalline systems, and in coarse-grained modelling of macromolecules.",
    "authors": [
      "Michael P. Allen",
      "Guido Germano"
    ],
    "publication_date": "2006-08-17T10:53:56Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0608387v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0608387v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and evolutionary biology through optimal control",
    "abstract": "We consider a particular instance of the lift of controlled systems recently proposed in the theory of irreversible thermodynamics and show that it leads to a variational principle for an optimal control in the sense of Pontryagin. Then we focus on two important applications: in thermodynamics and in evolutionary biology. In the thermodynamic context, we show that this principle provides a dynamical implementation of the Second Law, which stabilizes the equilibrium manifold of a system. In the evolutionary context, we discuss several interesting features: it provides a robust scheme for the coevolution of the population and its fitness landscape; it has a clear informational interpretation; it recovers Price equation naturally; and finally, it extends standard evolutionary dynamics to include phenomena such as the emergence of cooperation and the coexistence of qualitatively different phases of evolution, which we speculate can be associated with Darwinism and punctuated equilibria.",
    "authors": [
      "Alessandro Bravetti",
      "Pablo Padilla"
    ],
    "publication_date": "2018-04-10T02:03:13Z",
    "arxiv_id": "http://arxiv.org/abs/1804.03309v1",
    "download_url": "https://arxiv.org/abs/1804.03309v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Size effects on dislocation starvation in Cu nanopillars : A molecular dynamics simulations study",
    "abstract": "Size plays an important role on the deformation mechanism of nanopillars. With decreasing size, many FCC nanopillars exhibit dislocation starvation state which is responsible for their high strength. However, many details about the dislocation starvation mechanism like how often it occurs, and how much is its contribution to the total plastic strain, are still elusive. Similarly, the size below which the dislocation starvation occurs in the nanopillars is not clearly established. In this context, the atomistic simulations have been performed on the compressive deformation of $<$110$>$ Cu nanopillars with size (d) ranging from 5 to 21.5 nm. The molecular dynamics (MD) simulation results indicate that the nanopillars deform by the slip of extended dislocations and exhibit dislocation starvation mainly at small sizes ( $<$ 20 nm). The frequency of the occurrence of dislocation starvation is highest in small size nanowires and it decreases with increasing size. Above the nanopillar size of 20 nm, no dislocation starvation has been observed. Further, we define the dislocation starvation strain and based on this, it has been shown that, the contribution of dislocation starvation state to the total plastic strain decreases from 70\\% in small size nanopillars to below 5\\% in large size pillars. The present results suggest that the dislocation starvation is a dominant phenomena in small size nanopillars.",
    "authors": [
      "G. Sainath",
      "Vani Shankar",
      "A. Nagesha"
    ],
    "publication_date": "2023-10-03T08:24:19Z",
    "arxiv_id": "http://arxiv.org/abs/2310.01873v1",
    "download_url": "https://arxiv.org/abs/2310.01873v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modelling 1D Partially Absorbing Boundaries for Brownian Molecular Communication Channels",
    "abstract": "Molecular Communication (MC) architectures suffer from molecular build-up in the channel if they do not have appropriate reuptake mechanisms. The molecular build-up either leads to intersymbol interference (ISI) or reduces the transmission rate. To measure the molecular build-up, we derive analytic expressions for the incidence rate and absorption rate for one-dimensional MC channels where molecular dispersion obeys the Brownian Motion. We verify each of our key results with Monte Carlo simulations. Our results contribute to the development of more complicated models and analytic expressions to measure the molecular build-up and the impact of ISI in MC.",
    "authors": [
      "Caglar Koca",
      "Ozgur B. Akan"
    ],
    "publication_date": "2024-02-24T19:45:05Z",
    "arxiv_id": "http://arxiv.org/abs/2402.15888v1",
    "download_url": "https://arxiv.org/abs/2402.15888v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Explicit tracking of uncertainty increases the power of quantitative rule-of-thumb reasoning in cell biology",
    "abstract": "\"Back-of-the-envelope\" or \"rule-of-thumb\" calculations involving rough estimates of quantities play a central scientific role in developing intuition about the structure and behaviour of physical systems, for example in so-called `Fermi problems' in the physical sciences. Such calculations can be used to powerfully and quantitatively reason about biological systems, particularly at the interface between physics and biology. However, substantial uncertainties are often associated with values in cell biology, and performing calculations without taking this uncertainty into account may limit the extent to which results can be interpreted for a given problem. We present a means to facilitate such calculations where uncertainties are explicitly tracked through the line of reasoning, and introduce a `probabilistic calculator' called Caladis, a web tool freely available at www.caladis.org, designed to perform this tracking. This approach allows users to perform more statistically robust calculations in cell biology despite having uncertain values, and to identify which quantities need to be measured more precisely in order to make confident statements, facilitating efficient experimental design. We illustrate the use of our tool for tracking uncertainty in several example biological calculations, showing that the results yield powerful and interpretable statistics on the quantities of interest. We also demonstrate that the outcomes of calculations may differ from point estimates when uncertainty is accurately tracked. An integral link between Caladis and the Bionumbers repository of biological quantities further facilitates the straightforward location, selection, and use of a wealth of experimental data in cell biological calculations.",
    "authors": [
      "Iain G. Johnston",
      "Benjamin C. Rickett",
      "Nick S. Jones"
    ],
    "publication_date": "2014-12-04T09:29:48Z",
    "arxiv_id": "http://arxiv.org/abs/1412.1597v1",
    "download_url": "https://arxiv.org/abs/1412.1597v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Criterion of positivity for semilinear problems with applications in biology",
    "abstract": "The goal of this article is to provide an useful criterion of positivity and well-posedness for a wide range of infinite dimensional semilinear abstract Cauchy problems. This criterion is based on some weak assumptions on the non-linear part of the semilinear problem and on the existence of a strongly continuous semigroup generated by the differential operator. To illustrate a large variety of applications, we exhibit the feasibility of this criterion through three examples in mathematical biology: epidemiology, predator-prey interactions and oncology.",
    "authors": [
      "Michel Duprez",
      "Antoine Perasso"
    ],
    "publication_date": "2017-01-19T06:52:13Z",
    "arxiv_id": "http://arxiv.org/abs/1701.05314v1",
    "download_url": "https://arxiv.org/abs/1701.05314v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Guided assembly of cellular network models from knowledge in literature",
    "abstract": "Computational modeling is crucial for understanding and analyzing complex systems. In biology, model creation is a human dependent task that requires reading hundreds of papers and conducting wet lab experiments, which would take days or months. To overcome this hurdle, we propose a novel automated method, that utilizes the knowledge published in literature to suggest model extensions by selecting most relevant and useful information in few seconds. In particular, our novel approach organizes the events extracted from the literature as a collaboration graph with additional metric that relies on the event occurrence frequency in literature. Additionally, we show that common graph centrality metrics vary in the assessment of the extracted events. We have demonstrated the reliability of the proposed method using three different selected models, namely, T cell differentiation, T cell large granular lymphocyte, and pancreatic cancer cell. Our proposed method was able to find high percent of the desired new events with an average recall of 82%.",
    "authors": [
      "Yasmine Ahmed",
      "Natasa Miskov-Zivanov"
    ],
    "publication_date": "2021-10-09T06:14:33Z",
    "arxiv_id": "http://arxiv.org/abs/2110.04468v2",
    "download_url": "https://arxiv.org/abs/2110.04468v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Mathematical Framework for Agent Based Models of Complex Biological Networks",
    "abstract": "Agent-based modeling and simulation is a useful method to study biological phenomena in a wide range of fields, from molecular biology to ecology. Since there is currently no agreed-upon standard way to specify such models it is not always easy to use published models. Also, since model descriptions are not usually given in mathematical terms, it is difficult to bring mathematical analysis tools to bear, so that models are typically studied through simulation. In order to address this issue, Grimm et al. proposed a protocol for model specification, the so-called ODD protocol, which provides a standard way to describe models. This paper proposes an addition to the ODD protocol which allows the description of an agent-based model as a dynamical system, which provides access to computational and theoretical tools for its analysis. The mathematical framework is that of algebraic models, that is, time-discrete dynamical systems with algebraic structure. It is shown by way of several examples how this mathematical specification can help with model analysis.",
    "authors": [
      "Franziska Hinkelmann",
      "David Murrugarra",
      "Abdul Salam Jarrah",
      "Reinhard Laubenbacher"
    ],
    "publication_date": "2010-06-02T14:39:31Z",
    "arxiv_id": "http://arxiv.org/abs/1006.0408v5",
    "download_url": "https://arxiv.org/abs/1006.0408v5",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Key challenges facing data-driven multicellular systems biology",
    "abstract": "Increasingly sophisticated experiments, coupled with large-scale computational models, have the potential to systematically test biological hypotheses to drive our understanding of multicellular systems. In this short review, we explore key challenges that must be overcome to achieve robust, repeatable data-driven multicellular systems biology. If these challenges can be solved, we can grow beyond the current state of isolated tools and datasets to a community-driven ecosystem of interoperable data, software utilities, and computational modeling platforms. Progress is within our grasp, but it will take community (and financial) commitment.",
    "authors": [
      "Paul Macklin"
    ],
    "publication_date": "2018-06-12T19:40:29Z",
    "arxiv_id": "http://arxiv.org/abs/1806.04736v2",
    "download_url": "https://arxiv.org/abs/1806.04736v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MolecularWebXR: Multiuser discussions about chemistry and biology in immersive and inclusive VR",
    "abstract": "MolecularWebXR is our new website for education, science communication and scientific peer discussion in chemistry and biology built on WebXR. It democratizes multi-user, inclusive virtual reality (VR) experiences that are deeply immersive for users wearing high-end headsets, yet allow participation by users with consumer devices such as smartphones, possibly inserted into cardboard goggles for immersivity, or even computers or tablets. With no installs as it is all web-served, MolecularWebXR enables multiple users to simultaneously explore, communicate and discuss chemistry and biology concepts in immersive 3D environments, manipulating objects with their bare hands, either present in the same real space or scattered throughout the globe thanks to built-in audio features. A series of preset rooms cover educational material on chemistry and structural biology, and an empty room can be populated with material prepared ad hoc using moleculARweb's VMD-based PDB2AR tool. We verified ease of use and versatility by users aged 12-80 in entirely virtual sessions or mixed real-virtual sessions at science outreach events, student instruction, scientific collaborations, and conference lectures. MolecularWebXR is available for free use without registration at https://molecularwebxr.org, and a blog post version of this preprint with embedded videos is available at https://go.epfl.ch/molecularwebxr-blog-post.",
    "authors": [
      "Fabio J. Cortes Rodriguez",
      "Gianfranco Frattini",
      "Fernando Teixeira Pinto Meireles",
      "Danae A. Terrien",
      "Sergio Cruz-Leon",
      "Matteo Dal Peraro",
      "Eva Schier",
      "Diego M. Moreno",
      "Luciano A. Abriata"
    ],
    "publication_date": "2023-11-01T09:22:08Z",
    "arxiv_id": "http://arxiv.org/abs/2311.00385v1",
    "download_url": "https://arxiv.org/abs/2311.00385v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Toward AI-Driven Digital Organism: Multiscale Foundation Models for Predicting, Simulating and Programming Biology at All Levels",
    "abstract": "We present an approach of using AI to model and simulate biology and life. Why is it important? Because at the core of medicine, pharmacy, public health, longevity, agriculture and food security, environmental protection, and clean energy, it is biology at work. Biology in the physical world is too complex to manipulate and always expensive and risky to tamper with. In this perspective, we layout an engineering viable approach to address this challenge by constructing an AI-Driven Digital Organism (AIDO), a system of integrated multiscale foundation models, in a modular, connectable, and holistic fashion to reflect biological scales, connectedness, and complexities. An AIDO opens up a safe, affordable and high-throughput alternative platform for predicting, simulating and programming biology at all levels from molecules to cells to individuals. We envision that an AIDO is poised to trigger a new wave of better-guided wet-lab experimentation and better-informed first-principle reasoning, which can eventually help us better decode and improve life.",
    "authors": [
      "Le Song",
      "Eran Segal",
      "Eric Xing"
    ],
    "publication_date": "2024-12-09T20:59:59Z",
    "arxiv_id": "http://arxiv.org/abs/2412.06993v1",
    "download_url": "https://arxiv.org/abs/2412.06993v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Infinite graphs in systematic biology, with an application to the species problem",
    "abstract": "We argue that C. Darwin and more recently W. Hennig worked at times under the simplifying assumption of an eternal biosphere. So motivated, we explicitly consider the consequences which follow mathematically from this assumption, and the infinite graphs it leads to. This assumption admits certain clusters of organisms which have some ideal theoretical properties of species, shining some light onto the species problem. We prove a dualization of a law of T.A. Knight and C. Darwin, and sketch a decomposition result involving the internodons of D. Kornet, J. Metz and H. Schellinx. A further goal of this paper is to respond to B. Sturmfels' question, \"Can biology lead to new theorems?\"",
    "authors": [
      "Samuel Alexander"
    ],
    "publication_date": "2012-01-13T15:41:58Z",
    "arxiv_id": "http://arxiv.org/abs/1201.2869v7",
    "download_url": "https://arxiv.org/abs/1201.2869v7",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rare-Earth Molecular Crystals with Ultra-narrow Optical Linewidths for Photonic Quantum Technologies",
    "abstract": "Rare-earth ions are promising solid state systems to build light-matter interfaces at the quantum level. This relies on their potential to show narrow optical homogeneous linewidths or, equivalently, long-lived optical quantum states. In this letter, we report on europium molecular crystals that exhibit linewidths in the 10s of kHz range, orders of magnitude narrower than other molecular centers. We harness this property to demonstrate efficient optical spin initialization, coherent storage of light using an atomic frequency comb, and optical control of ion-ion interactions towards implementation of quantum gates. These results illustrate the utility of rare-earth molecular crystals as a new platform for photonic quantum technologies that combines highly coherent emitters with the unmatched versatility in composition, structure, and integration capability of molecular materials.",
    "authors": [
      "Diana Serrano",
      "Kuppusamy Senthil Kumar",
      "Benoît Heinrich",
      "Olaf Fuhr",
      "David Hunger",
      "Mario Ruben",
      "Philippe Goldner"
    ],
    "publication_date": "2021-05-14T22:19:59Z",
    "arxiv_id": "http://arxiv.org/abs/2105.07081v1",
    "download_url": "https://arxiv.org/abs/2105.07081v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Vertical Channel Model of Molecular Communication based on Alcohol Molecules",
    "abstract": "The study of Molecular Communication(MC) is more and more prevalence, and channel model of MC plays an important role in the MC System. Since different propagation environment and modulation techniques produce different channel model, most of the research about MC are in horizontal direction,but in nature the communications between nano machines are in short range and some of the information transportation are in the vertical direction, such as transpiration of plants, biological pump in ocean, and blood transportation from heart to brain. Therefore, this paper we propose a vertical channel model which nano-machines communicate with each other in the vertical direction based on pure diffusion. We first propose a vertical molecular communication model, we mainly considered the gravity as the factor, though the channel model is also affected by other main factors, such as the flow of the medium, the distance between the transmitter and the receiver, the delay or sensitivity of the transmitter and the receiver. Secondly, we set up a test-bed for this vertical channel model, in order to verify the difference between the theory result and the experiment data. At last, we use the data we get from the experiment and the non-linear least squares method to get the parameters to make our channel model more accurate.",
    "authors": [
      "Pengfei Lu",
      "Yang You",
      "Bo Liu",
      "Zhenqiang Wu"
    ],
    "publication_date": "2016-03-11T06:06:22Z",
    "arxiv_id": "http://arxiv.org/abs/1603.03530v1",
    "download_url": "https://arxiv.org/abs/1603.03530v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Searches for New Particles Including Dark Matter with Atomic, Molecular and Optical Systems",
    "abstract": "New particles can manifest their effects in many settings, ranging from effects on sub-atomic to galactic length scales. The nature of these effects depends on the specific particles and their non-gravitational interactions. In this chapter, we give a brief overview of how atomic, molecular and optical systems can be used to search for new particles. To illustrate the basic principles behind these methods, we focus on the simplest class of particles, namely new spinless bosons.",
    "authors": [
      "Yevgeny V. Stadnik",
      "Victor V. Flambaum"
    ],
    "publication_date": "2018-06-08T12:26:50Z",
    "arxiv_id": "http://arxiv.org/abs/1806.03115v1",
    "download_url": "https://arxiv.org/abs/1806.03115v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Optimal Likelihood Free Method for Biological Model Selection",
    "abstract": "Systems biology seeks to create math models of biological systems to reduce inherent biological complexity and provide predictions for applications such as therapeutic development. However, it remains a challenge to determine which math model is correct and how to arrive optimally at the answer. We present an algorithm for automated biological model selection using mathematical models of systems biology and likelihood free inference methods. Our algorithm shows improved performance in arriving at correct models without a priori information over conventional heuristics used in experimental biology and random search. This method shows promise to accelerate biological basic science and drug discovery.",
    "authors": [
      "Vincent D. Zaballa",
      "Elliot E. Hui"
    ],
    "publication_date": "2022-08-03T21:05:20Z",
    "arxiv_id": "http://arxiv.org/abs/2208.02344v1",
    "download_url": "https://arxiv.org/abs/2208.02344v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The molecular pathology of genioglossus in obstructive sleep apnea",
    "abstract": "Obstructive sleep apnea (OSA) is a sleep respiratory disease characterized by sleep snoring accompanied by apnea and daytime sleeplessness. It is a complex disease, with the multifactorial etiology, and the pathology is incompletely understood. Genioglossus (GG), the largest dilator of upper airway, whose fatigue is strongly correlated to onset of OSA. This brief review was to investigate the pathogenesis of OSA targeting on GG from different risk factors as gender, obesity, and aging, and the molecular mechanism of GG injury in OSA pathogenesis. We hope to find the targeted molecular mechanism on GG in OSA treatment.",
    "authors": [
      "Menghan Zhang",
      "Yuehua Liu"
    ],
    "publication_date": "2023-11-02T15:33:26Z",
    "arxiv_id": "http://arxiv.org/abs/2311.01320v1",
    "download_url": "https://arxiv.org/abs/2311.01320v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Incorporating molecular data in fungal systematics: a guide for aspiring researchers",
    "abstract": "The last twenty years have witnessed molecular data emerge as a primary research instrument in most branches of mycology. Fungal systematics, taxonomy, and ecology have all seen tremendous progress and have undergone rapid, far-reaching changes as disciplines in the wake of continual improvement in DNA sequencing technology. A taxonomic study that draws from molecular data involves a long series of steps, ranging from taxon sampling through the various laboratory procedures and data analysis to the publication process. All steps are important and influence the results and the way they are perceived by the scientific community. The present paper provides a reflective overview of all major steps in such a project with the purpose to assist research students about to begin their first study using DNA-based methods. We also take the opportunity to discuss the role of taxonomy in biology and the life sciences in general in the light of molecular data. While the best way to learn molecular methods is to work side by side with someone experienced, we hope that the present paper will serve to lower the learning threshold for the reader.",
    "authors": [
      "Kevin D. Hyde",
      "Dhanushka Udayanga",
      "Dimuthu S. Manamgoda",
      "Leho Tedersoo",
      "Ellen Larsson",
      "Kessy Abarenkov",
      "Yann J. K. Bertrand",
      "Bengt Oxelman",
      "Martin Hartmann",
      "Håvard Kauserud",
      "Martin Ryberg",
      "Erik Kristiansson",
      "Henrik R. Nilsson"
    ],
    "publication_date": "2013-02-13T21:17:09Z",
    "arxiv_id": "http://arxiv.org/abs/1302.3244v1",
    "download_url": "https://arxiv.org/abs/1302.3244v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A classical reactive potential for molecular clusters of sulphuric acid and water",
    "abstract": "We present a two-state empirical valence bond (EVB) potential describing interactions between sulphuric acid and water molecules and designed to model proton transfer between them within a classical dynamical framework. The potential has been developed in order to study the properties of molecular clusters of these species, which are thought to be relevant to atmospheric aerosol nucleation. The particle swarm optimisation method has been used to fit the parameters of the EVB model to density functional theory (DFT) calculations. Features of the parametrised model and DFT data are compared and found to be in satisfactory agreement. In particular, it is found that a single sulphuric acid molecule will donate a proton when clustered with four water molecules at 300 K and that this threshold is temperature dependent.",
    "authors": [
      "Jake L. Stinson",
      "Shawn M. Kathmann",
      "Ian J. Ford"
    ],
    "publication_date": "2016-01-11T11:21:24Z",
    "arxiv_id": "http://arxiv.org/abs/1601.02401v1",
    "download_url": "https://arxiv.org/abs/1601.02401v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Transverse wavevector dependent and frequency dependent dielectric function, magnetic permittivity and generalized conductivity of interaction site fluids. MD calculations for the TIP4P water",
    "abstract": "It is shown that the dielectric properties of interaction site models of polar fluids can be investigated in computer experiment using not only the charge fluctuations but also correlations corresponding to a current of moving charges. This current can be associated with a generalized dynamical polarization or separated into electric and magnetic components. The first approach deals with the dielectric permittivity related to a generalized conductivity, whereas the second one leads to the functions describing polarization and magnetization fluctuations separately. The last way is only the source to calculate the magnetic susceptibility for a system of interaction sites. The transverse wavevector- and frequency-dependent dielectric functions and magnetic susceptibility are evaluated for the TIP4P water model in a very wide scale of wavelengths and frequencies using molecular dynamics simulations. We demonstrate that the transverse part of the dielectric functions may differ drastically from their longitudinal component. A relationship between the two approaches is discussed and the limiting transition to the static dielectric constant in the infinite-wavelength regime is analyzed. The propagation of transverse electromagnetic waves in the TIP4P water is also considered.",
    "authors": [
      "Igor P. Omelyan"
    ],
    "publication_date": "1999-01-26T19:30:52Z",
    "arxiv_id": "http://arxiv.org/abs/physics/9901048v1",
    "download_url": "https://arxiv.org/abs/physics/9901048v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Diffractive molecular orbital tomography",
    "abstract": "High harmonic generation in the interaction of femtosecond lasers with atoms and molecules opens the path to molecular orbital tomography and to probe the electronic dynamics with attosecond-Ångström resolutions. Molecular orbital tomography requires both the amplitude and phase of the high harmonics. Yet the measurement of phases requires sophisticated techniques and represents formidable challenges at present. Here we report a novel scheme, called diffractive molecular orbital tomography, to retrieve the molecular orbital solely from the amplitude of high harmonics without measuring any phase information. We have applied this method to image the molecular orbitals of N$_2$, CO$_2$ and C$_2$H$_2$. The retrieved orbital is further improved by taking account the correction of Coulomb potential. The diffractive molecular orbital tomography scheme, removing the roadblock of phase measurement, significantly simplifies the molecular orbital tomography procedure and paves an efficient and robust way to the imaging of more complex molecules.",
    "authors": [
      "Chunyang Zhai",
      "Xiaosong Zhu",
      "Pengfei Lan",
      "Feng Wang",
      "Lixin He",
      "Wenjing Shi",
      "Yang Li",
      "Min Li",
      "Qingbin Zhang",
      "Peixiang Lu"
    ],
    "publication_date": "2017-03-02T12:17:34Z",
    "arxiv_id": "http://arxiv.org/abs/1703.00750v1",
    "download_url": "https://arxiv.org/abs/1703.00750v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Temporal pattern recognition through analog molecular computation",
    "abstract": "Living cells communicate information about physiological conditions by producing signaling molecules in a specific timed manner. Different conditions can result in the same total amount of a signaling molecule, differing only in the pattern of the molecular concentration over time. Such temporally coded information can be completely invisible to even state-of-the-art molecular sensors with high chemical specificity that respond only to the total amount of the signaling molecule. Here, we demonstrate design principles for circuits with temporal specificity, that is, molecular circuits that respond to specific temporal patterns in a molecular concentration. We consider pulsatile patterns in a molecular concentration characterized by three fundamental temporal features - time period, duty fraction and number of pulses. We develop circuits that respond to each one of these features while being insensitive to the others. We demonstrate our design principles using abstract Chemical Reaction Networks and with explicit simulations of DNA strand displacement reactions. In this way, our work develops building blocks for temporal pattern recognition through molecular computation.",
    "authors": [
      "Jackson O'Brien",
      "Arvind Murugan"
    ],
    "publication_date": "2018-10-05T20:45:57Z",
    "arxiv_id": "http://arxiv.org/abs/1810.02883v1",
    "download_url": "https://arxiv.org/abs/1810.02883v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Collective States in Molecular Monolayers on 2D Materials",
    "abstract": "Collective excited states form in organic two-dimensional layers through the Coulomb coupling of the molecular transition dipole moments. They manifest as characteristic strong and narrow peaks in the excitation and emission spectra that are shifted to lower energies compared to the monomer transition. We study experimentally and theoretically how robust the collective states are against homogeneous and inhomogeneous broadening as well as spatial disorder that occur in real molecular monolayers. Using a microscopic model for a two-dimensional dipole lattice in real space we calculate the properties of collective states and their extinction spectra. We find that the collective states persist even for 1-10% random variation in the molecular position and in the transition frequency, with similar peak position and integrated intensity as for the perfectly ordered system. We measure the optical response of a monolayer of the perylene-derivative MePTCDI on two-dimensional materials. On the wide band-gap insulator hexagonal boron nitride it shows strong emission from the collective state with a line width that is dominated by the inhomogeneous broadening of the molecular state. When using the semimetal graphene as a substrate, however, the luminescence is completely quenched. By combining optical absorption, luminescence, and multi-wavelength Raman scattering we verify that the MePTCDI molecules form very similar collective monolayer states on hexagonal boron nitride and graphene substrates, but on graphene the line width is dominated by non-radiative excitation transfer from the molecules to the substrate. Our study highlights the transition from the localized molecular state of the monomer to a delocalized collective state in the two-dimensional molecular lattice that is entirely based on Coulomb coupling between optically active excitations of the electrons or molecular vibrations.",
    "authors": [
      "Sabrina Juergensen",
      "Moritz Kessens",
      "Charlotte Berrezueta-Palacios",
      "Nikolai Severin",
      "Sumaya Ifland",
      "Jürgen P. Rabe",
      "Niclas S. Mueller",
      "Stephanie Reich"
    ],
    "publication_date": "2023-06-18T19:47:03Z",
    "arxiv_id": "http://arxiv.org/abs/2306.10630v2",
    "download_url": "https://arxiv.org/abs/2306.10630v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Knife edge skimming for improved separation of molecular species by the deflector",
    "abstract": "A knife edge for shaping a molecular beam is described to improve the spatial separation of the species in a molecular beam by the electrostatic deflector. The spatial separation of different molecular species from each other as well as from atomic seed gas is improved. The column density of the selected molecular-beam part in the interaction zone, which corresponds to higher signal rates, was enhanced by a factor of 1.5, limited by the virtual source size of the molecular beam.",
    "authors": [
      "Sebastian Trippel",
      "Melby Johny",
      "Thomas Kierspel",
      "Jolijn Onvlee",
      "Helen Bieker",
      "Hong Ye",
      "Terry Mullins",
      "Lars Gumprecht",
      "Karol Długołęcki",
      "Jochen Küpper"
    ],
    "publication_date": "2018-02-12T14:13:39Z",
    "arxiv_id": "http://arxiv.org/abs/1802.04053v2",
    "download_url": "https://arxiv.org/abs/1802.04053v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "BioT5: Enriching Cross-modal Integration in Biology with Chemical Knowledge and Natural Language Associations",
    "abstract": "Recent advancements in biological research leverage the integration of molecules, proteins, and natural language to enhance drug discovery. However, current models exhibit several limitations, such as the generation of invalid molecular SMILES, underutilization of contextual information, and equal treatment of structured and unstructured knowledge. To address these issues, we propose $\\mathbf{BioT5}$, a comprehensive pre-training framework that enriches cross-modal integration in biology with chemical knowledge and natural language associations. $\\mathbf{BioT5}$ utilizes SELFIES for $100%$ robust molecular representations and extracts knowledge from the surrounding context of bio-entities in unstructured biological literature. Furthermore, $\\mathbf{BioT5}$ distinguishes between structured and unstructured knowledge, leading to more effective utilization of information. After fine-tuning, BioT5 shows superior performance across a wide range of tasks, demonstrating its strong capability of capturing underlying relations and properties of bio-entities. Our code is available at $\\href{https://github.com/QizhiPei/BioT5}{Github}$.",
    "authors": [
      "Qizhi Pei",
      "Wei Zhang",
      "Jinhua Zhu",
      "Kehan Wu",
      "Kaiyuan Gao",
      "Lijun Wu",
      "Yingce Xia",
      "Rui Yan"
    ],
    "publication_date": "2023-10-11T07:57:08Z",
    "arxiv_id": "http://arxiv.org/abs/2310.07276v3",
    "download_url": "https://arxiv.org/abs/2310.07276v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Identification of control targets in Boolean molecular network models via computational algebra",
    "abstract": "Motivation: Many problems in biomedicine and other areas of the life sciences can be characterized as control problems, with the goal of finding strategies to change a disease or otherwise undesirable state of a biological system into another, more desirable, state through an intervention, such as a drug or other therapeutic treatment. The identification of such strategies is typically based on a mathematical model of the process to be altered through targeted control inputs. This paper focuses on processes at the molecular level that determine the state of an individual cell, involving signaling or gene regulation. The mathematical model type considered is that of Boolean networks. The potential control targets can be represented by a set of nodes and edges that can be manipulated to produce a desired effect on the system. Experimentally, node manipulation requires technology to completely repress or fully activate a particular gene product while edge manipulations only require a drug that inactivates the interaction between two gene products. Results: This paper presents a method for the identification of potential intervention targets in Boolean molecular network models using algebraic techniques. The approach exploits an algebraic representation of Boolean networks to encode the control candidates in the network wiring diagram as the solutions of a system of polynomials equations, and then uses computational algebra techniques to find such controllers. The control methods in this paper are validated through the identification of combinatorial interventions in the signaling pathways of previously reported control targets in two well studied systems, a p53-mdm2 network and a blood T cell lymphocyte granular leukemia survival signaling network.",
    "authors": [
      "David Murrugarra",
      "Alan Veliz-Cuba",
      "Boris Aguilar",
      "Reinhard Laubenbacher"
    ],
    "publication_date": "2015-08-21T15:46:34Z",
    "arxiv_id": "http://arxiv.org/abs/1508.05317v4",
    "download_url": "https://arxiv.org/abs/1508.05317v4",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]