[
  {
    "title": "Cell biology: Networks, regulation, pathways",
    "abstract": "This review was written for the Encyclopedia of Complexity and System Science\n(Springer-Verlag, Berlin, 2008), and is intended as a guide to the growing\nliterature which approaches the phenomena of cell biology from a more\ntheoretical point of view. We begin with the building blocks of cellular\nnetworks, and proceed toward the different classes of models being explored,\nfinally discussing the \"design principles\" which have been suggested for these\nsystems. Although largely a dispassionate review, we do draw attention to areas\nwhere there seems to be general consensus on ideas that have not been tested\nvery thoroughly and, more optimistically, to areas where we feel promising\nideas deserve to be more fully explored.",
    "authors": [
      "Gasper Tkacik",
      "William Bialek"
    ],
    "publication_date": "2007-12-28T18:45:14Z",
    "arxiv_id": "http://arxiv.org/abs/0712.4385v1",
    "download_url": "http://arxiv.org/abs/0712.4385v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Drug-therapy networks and the predictions of novel drug targets",
    "abstract": "Recently, a number of drug-therapy, disease, drug, and drug-target networks\nhave been introduced. Here we suggest novel methods for network-based\nprediction of novel drug targets and for improvement of drug efficiency by\nanalysing the effects of drugs on the robustness of cellular networks.",
    "authors": [
      "Zoltan Spiro",
      "Istvan A. Kovacs",
      "Peter Csermely"
    ],
    "publication_date": "2008-07-30T13:28:27Z",
    "arxiv_id": "http://arxiv.org/abs/0807.4860v1",
    "download_url": "http://arxiv.org/abs/0807.4860v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Water Buckyball Terahertz Vibrations in Physics, Chemistry, Biology, and\n  Cosmology",
    "abstract": "Pentagonal dodecahedral buckyball-like water clusters and arrays thereof are\nshown from first-principles electronic-structure calculations to possess unique\nterahertz vibrational modes in the 1-6 THz range, corresponding to\noxygen-oxygen-oxygen bending and twisting surface distortions of the clusters.\nIn their excited electronic states these water clusters constitute a form of\nRydberg matter. Applications to Physics, Chemistry, Biology, and Cosmology are\ndescribed.",
    "authors": [
      "Keith Johnson"
    ],
    "publication_date": "2009-02-12T05:37:02Z",
    "arxiv_id": "http://arxiv.org/abs/0902.2035v1",
    "download_url": "http://arxiv.org/abs/0902.2035v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Boundedness of trajectories for weakly reversible, single linkage class\n  reaction systems",
    "abstract": "This paper is concerned with the dynamical properties of deterministically\nmodeled chemical reaction systems with mass-action kinetics. Such models are\nubiquitously found in chemistry, population biology, and the burgeoning field\nof systems biology. A basic question, whose answer remains largely unknown, is\nthe following: for which network structures do trajectories of mass-action\nsystems remain bounded in time? In this paper, we conjecture that the result\nholds when the reaction network is weakly reversible, and prove this conjecture\nin the case when the reaction network consists of a single linkage class, or\nconnected component.",
    "authors": [
      "David F. Anderson"
    ],
    "publication_date": "2011-04-26T18:47:54Z",
    "arxiv_id": "http://arxiv.org/abs/1104.4992v2",
    "download_url": "http://arxiv.org/abs/1104.4992v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extracting Biological Pathway Models From NLP Event Representations",
    "abstract": "This paper describes an an open-source software system for the automatic\nconversion of NLP event representations to system biology structured data\ninterchange formats such as SBML and BioPAX. It is part of a larger effort to\nmake results of the NLP community available for system biology pathway\nmodelers.",
    "authors": [
      "Michael Spranger",
      "Sucheendra K. Palaniappan",
      "Samik Ghosh"
    ],
    "publication_date": "2016-08-12T11:58:00Z",
    "arxiv_id": "http://arxiv.org/abs/1608.03764v1",
    "download_url": "http://arxiv.org/abs/1608.03764v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Transkingdom Networks: A Systems Biology Approach to Identify Causal\n  Members of Host-Microbiota Interactions",
    "abstract": "Improvements in sequencing technologies and reduced experimental costs have\nresulted in a vast number of studies generating high-throughput data. Although\nthe number of methods to analyze these \"omics\" data has also increased,\ncomputational complexity and lack of documentation hinder researchers from\nanalyzing their high-throughput data to its true potential. In this chapter we\ndetail our data-driven, transkingdom network (TransNet) analysis protocol to\nintegrate and interrogate multi-omics data. This systems biology approach has\nallowed us to successfully identify important causal relationships between\ndifferent taxonomic kingdoms (e.g. mammals and microbes) using diverse types of\ndata.",
    "authors": [
      "Richard R. Rodrigues",
      "Natalia Shulzhenko",
      "Andrey Morgun"
    ],
    "publication_date": "2017-09-17T17:57:30Z",
    "arxiv_id": "http://arxiv.org/abs/1709.05701v1",
    "download_url": "http://arxiv.org/abs/1709.05701v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "RKappa: Software for Analyzing Rule-Based Models",
    "abstract": "RKappa is a framework for the development, simulation and analysis of\nrule-base models within the mature statistically empowered R environment. It is\ndesigned for model editing, parameter identification, simulation, sensitivity\nanalysis and visualisation. The framework is optimised for high-performance\ncomputing platforms and facilitates analysis of large-scale systems biology\nmodels where knowledge of exact mechanisms is limited and parameter values are\nuncertain. The RKappa software is an open source (GLP3 license) package for R,\nwhich is freely available online ( https://github.com/lptolik/R4Kappa ).",
    "authors": [
      "Anatoly Sorokin",
      "Oksana Sorokina",
      "J. Douglas Armstrong"
    ],
    "publication_date": "2018-09-21T17:15:53Z",
    "arxiv_id": "http://arxiv.org/abs/1809.08214v1",
    "download_url": "http://arxiv.org/abs/1809.08214v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inter-residue, inter-protein and inter-family coevolution: bridging the\n  scales",
    "abstract": "Interacting proteins coevolve at multiple but interconnected scales, from the\nresidue-residue over the protein-protein up to the family-family level. The\nrecent accumulation of enormous amounts of sequence data allows for the\ndevelopment of novel, data-driven computational approaches. Notably, these\napproaches can bridge scales within a single statistical framework. While being\ncurrently applied mostly to isolated problems on single scales, their immense\npotential for an evolutionary informed, structural systems biology is steadily\nemerging.",
    "authors": [
      "Hendrik Szurmant",
      "Martin Weigt"
    ],
    "publication_date": "2019-06-24T12:28:28Z",
    "arxiv_id": "http://arxiv.org/abs/1906.09881v1",
    "download_url": "http://arxiv.org/abs/1906.09881v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New Approaches in Synthetic Biology: Abiotic Organelles and Artificial\n  Cells Powered and Controlled by Light",
    "abstract": "One of the major goals of nanobionics and bottom-up synthetic biology is the\ndevelopment of artificial cell organelles for the creation of cell-like\nstructures operating similar to biological systems with a minimalistic set of\nbuilding blocks. In the present contribution, versatile strategies to develop\nartificial reaction centers for novel photoautotrophic processes and to provide\nfully biocompatible synthetic enzyme counterparts for stepwise sustrate\nphoto-conversion in abiotic organelles are summarized. This unique approach has\nthe potential to create artificial cell-like systems that can be readily\nmanipulated by light providing both energy input and fundamental regulatory\nfunctions.",
    "authors": [
      "Günther Knör"
    ],
    "publication_date": "2019-11-15T15:07:27Z",
    "arxiv_id": "http://arxiv.org/abs/1911.06684v1",
    "download_url": "http://arxiv.org/abs/1911.06684v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Differential Network Analysis: A Statistical Perspective",
    "abstract": "Networks effectively capture interactions among components of complex\nsystems, and have thus become a mainstay in many scientific disciplines.\nGrowing evidence, especially from biology, suggest that networks undergo\nchanges over time, and in response to external stimuli. In biology and\nmedicine, these changes have been found to be predictive of complex diseases.\nThey have also been used to gain insight into mechanisms of disease initiation\nand progression. Primarily motivated by biological applications, this article\nprovides a review of recent statistical machine learning methods for inferring\nnetworks and identifying changes in their structures.",
    "authors": [
      "Ali Shojaie"
    ],
    "publication_date": "2020-03-09T16:19:28Z",
    "arxiv_id": "http://arxiv.org/abs/2003.04235v1",
    "download_url": "http://arxiv.org/abs/2003.04235v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Omicron to Its BA.5 Subvariant: A New Twist in Coronavirus\n  Contagiousness Evolution",
    "abstract": "In 2022 new subvariants of Coronavirus appeared in South Africa, and spread\nrapidly to other parts of the world. The effects of selective evolution on\nincreasing the already high contagiousness of CoV19 up to Omicron were\npreviously discussed with high accuracy using concepts new to molecular biology\n(from mathematics and physics) that have been developed over the last few\ndecades. Here we discuss the new subvariants, and find novel features\nsuccessfully combining both improved flexibility and improved stability.",
    "authors": [
      "J. C. Phillips"
    ],
    "publication_date": "2022-08-09T15:27:36Z",
    "arxiv_id": "http://arxiv.org/abs/2208.04956v1",
    "download_url": "http://arxiv.org/abs/2208.04956v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding nature's choice of genetic languages",
    "abstract": "All living organisms use the same genetic languages in their molecular\nbiology machinery. They can be understood as the optimal solutions to the\nreplication tasks involving DNA and proteins. These solutions perfectly fit the\npattern predicted by Grover's algorithm, which is more efficient than the best\nBoolean search algorithm (i.e. binary tree search) that predicts a different\npattern. The challenge is to demonstrate how Grover's algorithm would be\nexecuted in vivo by the living organisms.",
    "authors": [
      "Apoorva D. Patel"
    ],
    "publication_date": "2025-05-10T17:55:33Z",
    "arxiv_id": "http://arxiv.org/abs/2505.06718v1",
    "download_url": "http://arxiv.org/abs/2505.06718v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Adapting Modeling and Simulation Credibility Standards to Computational\n  Systems Biology",
    "abstract": "Computational models are increasingly used in high-impact decision making in\nscience, engineering, and medicine. The National Aeronautics and Space\nAdministration (NASA) uses computational models to perform complex experiments\nthat are otherwise prohibitively expensive or require a microgravity\nenvironment. Similarly, the Food and Drug Administration (FDA) and European\nMedicines Agency (EMA) have began accepting models and simulations as form of\nevidence for pharmaceutical and medical device approval. It is crucial that\ncomputational models meet a standard of credibility when using them in\nhigh-stakes decision making. For this reason, institutes including NASA, the\nFDA, and the EMA have developed standards to promote and assess the credibility\nof computational models and simulations. However, due to the breadth of models\nthese institutes assess, these credibility standards are mostly qualitative and\navoid making specific recommendations. On the other hand, modeling and\nsimulation in systems biology is a narrow domain and several standards are\nalready in place. As systems biology models increase in complexity and\ninfluence, the development of a credibility assessment system is crucial. Here\nwe review existing standards in systems biology, credibility standards in other\nscience, engineering, and medical fields, and propose the development of a\ncredibility standard for systems biology models.",
    "authors": [
      "Lillian T. Tatka",
      "Lucian P. Smith",
      "Joseph L. Hellerstein",
      "Herbert M. Sauro"
    ],
    "publication_date": "2023-01-15T02:55:10Z",
    "arxiv_id": "http://arxiv.org/abs/2301.06007v1",
    "download_url": "http://arxiv.org/abs/2301.06007v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Renewal processes and fluctuation analysis of molecular motor stepping",
    "abstract": "We model the dynamics of a processive or rotary molecular motor using a\nrenewal processes, in line with the work initiated by Svoboda, Mitra and Block.\nWe apply a functional technique to compute different types of multiple-time\ncorrelation functions of the renewal process, which have applications to\nbead-assay experiments performed both with processive molecular motors, such as\nmyosin V and kinesin, and rotary motors, such as F1-ATPase.",
    "authors": [
      "Jaime E. Santos",
      "Thomas Franosch",
      "Andrea Parmeggiani",
      "Erwin Frey"
    ],
    "publication_date": "2005-05-29T20:02:39Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0505704v2",
    "download_url": "http://arxiv.org/abs/cond-mat/0505704v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Theory of Hydrophobic Effects: ``She is too mean to have her\n  name repeated.''",
    "abstract": "This paper reviews the molecular theory of hydrophobic effects relevant to\nbiomolecular structure and assembly in aqueous solution. Recent progress has\nresulted in simple, validated molecular statistical thermodynamic theories and\nclarification of confusing theories of decades ago. Current work is resolving\neffects of wider variations of thermodynamic state, e.g. pressure denaturation\nof soluble proteins, and more exotic questions such as effects of surface\nchemistry in treating stability of macromolecular structures in aqueous\nsolution",
    "authors": [
      "Lawrence R. Pratt"
    ],
    "publication_date": "2001-10-07T20:54:35Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0110021v1",
    "download_url": "http://arxiv.org/abs/physics/0110021v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Motion of rotatory molecular motor and chemical reaction rate",
    "abstract": "We examine the dependence of the physical quantities of the rotatory\nmolecular motor, such as the rotation velocity and the proton translocation\nrate, on the chemical reaction rate using the model based only on diffusion\nprocess. A peculiar behavior of proton translocation is found and the energy\ntransduction efficiency of the motor protein is enhanced by this behavior. We\ngive a natural explanation that this behavior is universal when certain\ninequalities between chemical reaction rates hold. That may give a clue to\nexamine whether the motion of the molecular motor is dominated by diffusion\nprocess or not.",
    "authors": [
      "Hiroshi Miki",
      "Masatoshi Sato",
      "Mahito Kohmoto"
    ],
    "publication_date": "2003-06-09T02:31:03Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0306065v2",
    "download_url": "http://arxiv.org/abs/physics/0306065v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Signal Propagation in Nonlinear Stochastic Gene Regulatory Networks",
    "abstract": "The structure of a stochastic nonlinear gene regulatory network is uncovered\nby studying its response to input signal generators. Four applications are\nstudied in detail: a nonlinear connection of two linear systems, the design of\na logic pulse, a molecular amplifier and the interference of three signal\ngenerators in E2F1 regulatory element. The gene interactions are presented\nusing molecular diagrams that have a precise mathematical structure and retain\nthe biological meaning of the processes.",
    "authors": [
      "Sever Achimescu",
      "Ovidiu Lipan"
    ],
    "publication_date": "2005-10-29T19:12:41Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0510055v1",
    "download_url": "http://arxiv.org/abs/q-bio/0510055v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Coherence in an Oscillatory Gene Circuit Model",
    "abstract": "We show that noise-induced oscillations in a gene circuit model display\nstochastic coherence, that is, a maximum in the regularity of the oscillations\nas a function of noise amplitude. The effect is manifest as a system-size\neffect in a purely stochastic molecular reaction description of the circuit\ndynamics. We compare the molecular reaction model behavior with that predicted\nby a rate equation version of the same system. In addition, we show that\ncommonly used reduced models that ignore fast operator reactions do not capture\nthe full stochastic behavior of the gene circuit. Stochastic coherence occurs\nunder conditions that may be physiologically relevant.",
    "authors": [
      "Robert C. Hilborn",
      "Jessie D. Erwin"
    ],
    "publication_date": "2009-08-03T20:18:43Z",
    "arxiv_id": "http://arxiv.org/abs/0908.0339v1",
    "download_url": "http://arxiv.org/abs/0908.0339v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Direct signature of light-induced conical intersections in diatomics",
    "abstract": "Nonadiabatic effects are ubiquitous in physics, chemistry and biology. They\nare strongly amplified by conical intersections (CIs) which are degeneracies\nbetween electronic states of triatomic or larger molecules. A few years ago it\nhas been revealed that CIs in molecular systems can be formed by laser light\neven in diatomics. Due to the prevailing strong nonadiabatic couplings, the\nexistence of such laser-induced conical intersections (LICIs) may considerably\nchange the dynamical behavior of molecular systems. By analyzing the\nphotodissociation process of the D2+ molecule carefully, we found a robust\neffect in the angular distribution of the photofragments which serves as a\ndirect signature of the LICI providing undoubted evidence for its existence.",
    "authors": [
      "Gábor J. Halász",
      "Ágnes Vibók",
      "Lorenz S. Cederbaum"
    ],
    "publication_date": "2014-11-24T18:50:04Z",
    "arxiv_id": "http://arxiv.org/abs/1411.6569v1",
    "download_url": "http://arxiv.org/abs/1411.6569v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficiency, Robustness and Stochasticity of Gene Regulatory Networks in\n  Systems Biology: lambda Switch as a Working Example",
    "abstract": "Phage lambda is one of the most studied biological models in modern molecular\nbiology. Over the past 50 years quantitative experimental knowledge on this\nbiological model has been accumulated at all levels: physics, chemistry,\ngenomics, proteomics, functions, and more. All its components have been known\nto a great detail. The theoretical task has been to integrate its components to\nmake the organism working quantitatively in a harmonic manner. This would test\nour biological understanding and would lay a solid fundamental for further\nexplorations and applications, an obvious goal of systems biology. One of the\noutstanding challenges in doing so has been the so-called stability puzzle of\nlambda switch: the biologically observed robustness and its difficult\nmathematical reconstruction based on known experimental values. In this chapter\nwe review the recent theoretical and experimental efforts on tackling this\nproblem. An emphasis is put on the minimum quantitative modeling where a\nsuccessful numerical agreement between experiments and modeling has been\nachieved. A novel method tentatively named stochastic dynamical structure\nanalysis emerged from such study is also discussed within a broad modeling\nperspective.",
    "authors": [
      "X. Zhu",
      "L. Yin",
      "L. Hood",
      "D. Galas",
      "P. Ao"
    ],
    "publication_date": "2005-12-02T17:14:59Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0512007v2",
    "download_url": "http://arxiv.org/abs/q-bio/0512007v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dealing with complexity of biological systems: from data to models",
    "abstract": "Four chapters of the synthesis represent four major areas of my research\ninterests: 1) data analysis in molecular biology, 2) mathematical modeling of\nbiological networks, 3) genome evolution, and 4) cancer systems biology. The\nfirst chapter is devoted to my work in developing non-linear methods of\ndimension reduction (methods of elastic maps and principal trees) which extends\nthe classical method of principal components. Also I present application of\nmatrix factorization techniques to analysis of cancer data. The second chapter\nis devoted to the complexity of mathematical models in molecular biology. I\ndescribe the basic ideas of asymptotology of chemical reaction networks aiming\nat dissecting and simplifying complex chemical kinetics models. Two\napplications of this approach are presented: to modeling NFkB and apoptosis\npathways, and to modeling mechanisms of miRNA action on protein translation.\nThe third chapter briefly describes my investigations of the genome structure\nin different organisms (from microbes to human cancer genomes). Unsupervised\ndata analysis approaches are used to investigate the patterns in genomic\nsequences shaped by genome evolution and influenced by the basic properties of\nthe environment. The fourth chapter summarizes my experience in studying cancer\nby computational methods (through combining integrative data analysis and\nmathematical modeling approaches). In particular, I describe the on-going\nresearch projects such as mathematical modeling of cell fate decisions and\nsynthetic lethal interactions in DNA repair network. The synthesis is concluded\nby listing major challenges in computational systems biology, connected to the\ntopics of this text, i.e. dealing with complexity of biological systems.",
    "authors": [
      "Andrei Zinovyev"
    ],
    "publication_date": "2014-04-06T21:46:30Z",
    "arxiv_id": "http://arxiv.org/abs/1404.1626v1",
    "download_url": "http://arxiv.org/abs/1404.1626v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Information Biology: from information interpretation of quantum\n  mechanics to applications in molecular biology and cognitive psychology",
    "abstract": "We discuss foundational issues of quantum information biology (QIB) -- one of\nthe most successful applications of the quantum formalism outside of physics.\nQIB provides a multi-scale model of information processing in bio-systems: from\nproteins and cells to cognitive and social systems. This theory has to be\nsharply distinguished from \"traditional quantum biophysics\". The latter is\nabout quantum bio-physical processes, e.g., in cells or brains. QIB models the\ndynamics of information states of bio-systems. It is based on the quantum-like\nparadigm: complex bio-systems process information in accordance with the laws\nof quantum information and probability. This paradigm is supported by plenty of\nstatistical bio-data collected at all scales, from molecular biology and\ngenetics/epigenetics to cognitive psychology and behavioral economics. We argue\nthat the information interpretation of quantum mechanics (its various forms\nwere elaborated by Zeilinger and Brukner, Fuchs and Mermin, and D' Ariano) is\nthe most natural interpretation of QIB. We also point out that QBIsm (Quantum\nBayesianism) can serve to find a proper interpretation of bio-quantum\nprobabilities. Biologically QIB is based on two principles: a) adaptivity; b)\nopenness (bio-systems are fundamentally open). These principles are\nmathematically represented in the framework of a novel formalism -- quantum\nadaptive dynamics which, in particular, contains the standard theory of open\nquantum systems as a special case of adaptivity (to environment).",
    "authors": [
      "Masanari Asano",
      "Irina Basieva",
      "Andrei Khrennikov",
      "Masanori Ohya",
      "Yoshiharu Tanaka",
      "Ichiro Yamato"
    ],
    "publication_date": "2015-03-09T15:16:06Z",
    "arxiv_id": "http://arxiv.org/abs/1503.02515v1",
    "download_url": "http://arxiv.org/abs/1503.02515v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Survey of Molecular Communication in Cell Biology: Establishing a New\n  Hierarchy for Interdisciplinary Applications",
    "abstract": "Molecular communication (MC) engineering is inspired by the use of chemical\nsignals as information carriers in cell biology. The biological nature of\nchemical signaling makes MC a promising methodology for interdisciplinary\napplications requiring communication between cells and other microscale\ndevices. However, since the life sciences and communications engineering fields\nhave distinct approaches to formulating and solving research problems, the\nmismatch between them can hinder the translation of research results and impede\nthe development and implementation of interdisciplinary solutions. To bridge\nthis gap, this survey proposes a novel communication hierarchy for MC signaling\nin cell biology and maps phenomena, contributions, and problems to the\nhierarchy. The hierarchy includes: 1) the Physical Signal Propagation level; 2)\nthe Physical and Chemical Signal Interaction level; 3) the Signal-Data\nInterface level; 4) the Local Data Abstraction level; and 5) the Application\nlevel. To further demonstrate the proposed hierarchy, it is applied to case\nstudies on quorum sensing, neuronal signaling, and communication via DNA.\nFinally, several open problems are identified for each level and the\nintegration of multiple levels. The proposed hierarchy provides language for\ncommunication engineers to study and interface with biological systems, and\nalso helps biologists to understand how communications engineering concepts can\nbe exploited to interpret, control, and manipulate signaling in cell biology.",
    "authors": [
      "Dadi Bi",
      "Apostolos Almpanis",
      "Adam Noel",
      "Yansha Deng",
      "Robert Schober"
    ],
    "publication_date": "2020-08-31T20:44:29Z",
    "arxiv_id": "http://arxiv.org/abs/2009.00090v1",
    "download_url": "http://arxiv.org/abs/2009.00090v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bayesian Parameter Estimation for Dynamical Models in Systems Biology",
    "abstract": "Dynamical systems modeling, particularly via systems of ordinary differential\nequations, has been used to effectively capture the temporal behavior of\ndifferent biochemical components in signal transduction networks. Despite the\nrecent advances in experimental measurements, including sensor development and\n'-omics' studies that have helped populate protein-protein interaction networks\nin great detail, modeling in systems biology lacks systematic methods to\nestimate kinetic parameters and quantify associated uncertainties. This is\nbecause of multiple reasons, including sparse and noisy experimental\nmeasurements, lack of detailed molecular mechanisms underlying the reactions,\nand missing biochemical interactions. Additionally, the inherent nonlinearities\nwith respect to the states and parameters associated with the system of\ndifferential equations further compound the challenges of parameter estimation.\nIn this study, we propose a comprehensive framework for Bayesian parameter\nestimation and complete quantification of the effects of uncertainties in the\ndata and models. We apply these methods to a series of signaling models of\nincreasing mathematical complexity. Systematic analysis of these dynamical\nsystems showed that parameter estimation depends on data sparsity, noise level,\nand model structure, including the existence of multiple steady states. These\nresults highlight how focused uncertainty quantification can enrich systems\nbiology modeling and enable additional quantitative analyses for parameter\nestimation.",
    "authors": [
      "Nathaniel J. Linden",
      "Boris Kramer",
      "Padmini Rangamani"
    ],
    "publication_date": "2022-04-11T21:24:10Z",
    "arxiv_id": "http://arxiv.org/abs/2204.05415v3",
    "download_url": "http://arxiv.org/abs/2204.05415v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Impact of Genomic Variation on Function (IGVF) Consortium",
    "abstract": "Our genomes influence nearly every aspect of human biology from molecular and\ncellular functions to phenotypes in health and disease. Human genetics studies\nhave now associated hundreds of thousands of differences in our DNA sequence\n(\"genomic variation\") with disease risk and other phenotypes, many of which\ncould reveal novel mechanisms of human biology and uncover the basis of genetic\npredispositions to diseases, thereby guiding the development of new diagnostics\nand therapeutics. Yet, understanding how genomic variation alters genome\nfunction to influence phenotype has proven challenging. To unlock these\ninsights, we need a systematic and comprehensive catalog of genome function and\nthe molecular and cellular effects of genomic variants. Toward this goal, the\nImpact of Genomic Variation on Function (IGVF) Consortium will combine\napproaches in single-cell mapping, genomic perturbations, and predictive\nmodeling to investigate the relationships among genomic variation, genome\nfunction, and phenotypes. Through systematic comparisons and benchmarking of\nexperimental and computational methods, we aim to create maps across hundreds\nof cell types and states describing how coding variants alter protein activity,\nhow noncoding variants change the regulation of gene expression, and how both\ncoding and noncoding variants may connect through gene regulatory and protein\ninteraction networks. These experimental data, computational predictions, and\naccompanying standards and pipelines will be integrated into an open resource\nthat will catalyze community efforts to explore genome function and the impact\nof genetic variation on human biology and disease across populations.",
    "authors": [
      "IGVF Consortium"
    ],
    "publication_date": "2023-07-24T20:51:25Z",
    "arxiv_id": "http://arxiv.org/abs/2307.13708v1",
    "download_url": "http://arxiv.org/abs/2307.13708v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "CRN++: Molecular Programming Language",
    "abstract": "Synthetic biology is a rapidly emerging research area, with expected\nwide-ranging impact in biology, nanofabrication, and medicine. A key technical\nchallenge lies in embedding computation in molecular contexts where electronic\nmicro-controllers cannot be inserted. This necessitates effective\nrepresentation of computation using molecular components. While previous work\nestablished the Turing-completeness of chemical reactions, defining\nrepresentations that are faithful, efficient, and practical remains\nchallenging. This paper introduces CRN++, a new language for programming\ndeterministic (mass-action) chemical kinetics to perform computation. We\npresent its syntax and semantics, and build a compiler translating CRN++\nprograms into chemical reactions, thereby laying the foundation of a\ncomprehensive framework for molecular programming. Our language addresses the\nkey challenge of embedding familiar imperative constructs into a set of\nchemical reactions happening simultaneously and manipulating real-valued\nconcentrations. Although some deviation from ideal output value cannot be\navoided, we develop methods to minimize the error, and implement error analysis\ntools. We demonstrate the feasibility of using CRN++ on a suite of well-known\nalgorithms for discrete and real-valued computation. CRN++ can be easily\nextended to support new commands or chemical reaction implementations, and thus\nprovides a foundation for developing more robust and practical molecular\nprograms.",
    "authors": [
      "Marko Vasic",
      "David Soloveichik",
      "Sarfraz Khurshid"
    ],
    "publication_date": "2018-09-19T23:48:58Z",
    "arxiv_id": "http://arxiv.org/abs/1809.07430v3",
    "download_url": "http://arxiv.org/abs/1809.07430v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nearest Neighbor CCP-Based Molecular Sequence Analysis",
    "abstract": "Molecular sequence analysis is crucial for comprehending several biological\nprocesses, including protein-protein interactions, functional annotation, and\ndisease classification. The large number of sequences and the inherently\ncomplicated nature of protein structures make it challenging to analyze such\ndata. Finding patterns and enhancing subsequent research requires the use of\ndimensionality reduction and feature selection approaches. Recently, a method\ncalled Correlated Clustering and Projection (CCP) has been proposed as an\neffective method for biological sequencing data. The CCP technique is still\ncostly to compute even though it is effective for sequence visualization.\nFurthermore, its utility for classifying molecular sequences is still\nuncertain. To solve these two problems, we present a Nearest Neighbor\nCorrelated Clustering and Projection (CCP-NN)-based technique for efficiently\npreprocessing molecular sequence data. To group related molecular sequences and\nproduce representative supersequences, CCP makes use of sequence-to-sequence\ncorrelations. As opposed to conventional methods, CCP doesn't rely on matrix\ndiagonalization, therefore it can be applied to a range of machine-learning\nproblems. We estimate the density map and compute the correlation using a\nnearest-neighbor search technique. We performed molecular sequence\nclassification using CCP and CCP-NN representations to assess the efficacy of\nour proposed approach. Our findings show that CCP-NN considerably improves\nclassification task accuracy as well as significantly outperforms CCP in terms\nof computational runtime.",
    "authors": [
      "Sarwan Ali",
      "Prakash Chourasia",
      "Bipin Koirala",
      "Murray Patterson"
    ],
    "publication_date": "2024-09-07T22:06:00Z",
    "arxiv_id": "http://arxiv.org/abs/2409.04922v2",
    "download_url": "http://arxiv.org/abs/2409.04922v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Higher order molecular organisation as a source of biological function",
    "abstract": "Molecular interactions have widely been modelled as networks. The local\nwiring patterns around molecules in molecular networks are linked with their\nbiological functions. However, networks model only pairwise interactions\nbetween molecules and cannot explicitly and directly capture the higher order\nmolecular organisation, such as protein complexes and pathways. Hence, we ask\nif hypergraphs (hypernetworks), that directly capture entire complexes and\npathways along with protein-protein interactions (PPIs), carry additional\nfunctional information beyond what can be uncovered from networks of pairwise\nmolecular interactions. The mathematical formalism of a hypergraph has long\nbeen known, but not often used in studying molecular networks due to the lack\nof sophisticated algorithms for mining the underlying biological information\nhidden in the wiring patterns of molecular systems modelled as hypernetworks.\n  We propose a new, multi-scale, protein interaction hypernetwork model that\nutilizes hypergraphs to capture different scales of protein organization,\nincluding PPIs, protein complexes and pathways. In analogy to graphlets, we\nintroduce hypergraphlets, small, connected, non-isomorphic, induced\nsub-hypergraphs of a hypergraph, to quantify the local wiring patterns of these\nmulti-scale molecular hypergraphs and to mine them for new biological\ninformation. We apply them to model the multi-scale protein networks of baker\nyeast and human and show that the higher order molecular organisation captured\nby these hypergraphs is strongly related to the underlying biology.\nImportantly, we demonstrate that our new models and data mining tools reveal\ndifferent, but complementary biological information compared to classical PPI\nnetworks. We apply our hypergraphlets to successfully predict biological\nfunctions of uncharacterised proteins.",
    "authors": [
      "Thomas Gaudelet",
      "Noel Malod-Dognin",
      "Natasa Przulj"
    ],
    "publication_date": "2018-04-13T15:49:53Z",
    "arxiv_id": "http://arxiv.org/abs/1804.05003v2",
    "download_url": "http://arxiv.org/abs/1804.05003v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "One Hub-One Process: A Tool Based View on Regulatory Network Topology",
    "abstract": "The relationship between the regulatory design and the functionality of\nmolecular networks is a key issue in biology. Modules and motifs have been\nassociated to various cellular processes, thereby providing anecdotal evidence\nfor performance based localization on molecular networks. To quantify\nstructure-function relationship we investigate similarities of proteins which\nare close in the regulatory network of the yeast Saccharomyces Cerevisiae. We\nfind that the topology of the regulatory network show weak remnants of its\nhistory of network reorganizations, but strong features of co-regulated\nproteins associated to similar tasks. This suggests that local topological\nfeatures of regulatory networks, including broad degree distributions, emerge\nas an implicit result of matching a number of needed processes to a finite\ntoolbox of proteins.",
    "authors": [
      "Jacob Bock Axelsen",
      "Sebastian Bernhardsson",
      "Kim Sneppen"
    ],
    "publication_date": "2007-11-14T14:16:39Z",
    "arxiv_id": "http://arxiv.org/abs/0711.2208v2",
    "download_url": "http://arxiv.org/abs/0711.2208v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling Stochasticity and Variability in Gene Regulatory Networks",
    "abstract": "Modeling stochasticity in gene regulatory networks is an important and\ncomplex problem in molecular systems biology. To elucidate intrinsic noise,\nseveral modeling strategies such as the Gillespie algorithm have been used\nsuccessfully. This paper contributes an approach as an alternative to these\nclassical settings. Within the discrete paradigm, where genes, proteins, and\nother molecular components of gene regulatory networks are modeled as discrete\nvariables and are assigned as logical rules describing their regulation through\ninteractions with other components. Stochasticity is modeled at the biological\nfunction level under the assumption that even if the expression levels of the\ninput nodes of an update rule guarantee activation or degradation there is a\nprobability that the process will not occur due to stochastic effects. This\napproach allows a finer analysis of discrete models and provides a natural\nsetup for cell population simulations to study cell-to-cell variability. We\napplied our methods to two of the most studied regulatory networks, the outcome\nof lambda phage infection of bacteria and the p53-mdm2 complex.",
    "authors": [
      "David Murrugarra",
      "Alan Veliz-Cuba",
      "Boris Aguilar",
      "Seda Arat",
      "Reinhard Laubenbacher"
    ],
    "publication_date": "2012-01-26T16:52:10Z",
    "arxiv_id": "http://arxiv.org/abs/1201.5578v3",
    "download_url": "http://arxiv.org/abs/1201.5578v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formation of stationary electronic states in finite homogeneous\n  molecular chains",
    "abstract": "Evolution of an arbitrary initial distribution of a quantummechanical\nparticle in a uniform molecular chain is simulated by a system of coupled\nquantumclassical dynamical equations with dissipation. Stability of a uniform\ndistribution of the particle over the chain is studied. An asymptotical\nexpression is obtained for the time in which a localized state is formed. The\nvalidity of the expression is checked by direct computational experiments. It\nis shown that the time of soliton and multisoliton type states formation\ndepends strongly on the initial phase of the particle's wave function. It is\nshown that in multisoliton states objects with a fractional electron charge\nwhich can be observed experimentally are realized. The results obtained are\napplied to synthetic uniform polynucleotide molecular chains.",
    "authors": [
      "V. D. Lakhno",
      "A. N. Korshunova"
    ],
    "publication_date": "2013-05-23T12:46:56Z",
    "arxiv_id": "http://arxiv.org/abs/1305.5732v1",
    "download_url": "http://arxiv.org/abs/1305.5732v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Detection of regulator genes and eQTLs in gene networks",
    "abstract": "Genetic differences between individuals associated to quantitative phenotypic\ntraits, including disease states, are usually found in non-coding genomic\nregions. These genetic variants are often also associated to differences in\nexpression levels of nearby genes (they are \"expression quantitative trait\nloci\" or eQTLs for short) and presumably play a gene regulatory role, affecting\nthe status of molecular networks of interacting genes, proteins and\nmetabolites. Computational systems biology approaches to reconstruct causal\ngene networks from large-scale omics data have therefore become essential to\nunderstand the structure of networks controlled by eQTLs together with other\nregulatory genes, and to generate detailed hypotheses about the molecular\nmechanisms that lead from genotype to phenotype. Here we review the main\nanalytical methods and softwares to identify eQTLs and their associated genes,\nto reconstruct co-expression networks and modules, to reconstruct causal\nBayesian gene and module networks, and to validate predicted networks in\nsilico.",
    "authors": [
      "Lingfei Wang",
      "Tom Michoel"
    ],
    "publication_date": "2015-12-17T13:31:26Z",
    "arxiv_id": "http://arxiv.org/abs/1512.05574v2",
    "download_url": "http://arxiv.org/abs/1512.05574v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Review of Mathematical Models for Muscular Dystrophy: A Systems\n  Biology Approach",
    "abstract": "Muscular dystrophy (MD) describes generalized progressive muscular weakness\ndue to the wasting of muscle fibers. The progression of the disease is affected\nby known immunological and mechanical factors, and possibly other unknown\nmechanisms. These dynamics have begun to be elucidated in the last two decades.\nThis article reviews mathematical models of MD that characterize molecular and\ncellular components implicated in MD progression. A biological background for\nthese processes is also presented. Molecular effectors that contribute to MD\ninclude mitochondrial bioenergetics and genetic factors; both drive cellular\nmetabolism, communication and signaling. These molecular events leave cells\nvulnerable to mechanical stress which can activate an immunological cascade\nthat weakens cells and surrounding tissues. This review article lays the\nfoundation for a systems biology approach to study MD progression.",
    "authors": [
      "Amanda N. Cameron",
      "Matthew T. Houston",
      "Juan B. Gutierrez"
    ],
    "publication_date": "2016-10-11T20:34:45Z",
    "arxiv_id": "http://arxiv.org/abs/1610.03521v2",
    "download_url": "http://arxiv.org/abs/1610.03521v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mean Field Analysis of Algorithms for Scale-free Networks in Molecular\n  Biology",
    "abstract": "The sampling of scale-free networks in Molecular Biology is usually achieved\nby growing networks from a seed using recursive algorithms with elementary\nmoves which include the addition and deletion of nodes and bonds. These\nalgorithms include the Barabasi-Albert algorithm. Later algorithms, such as the\nDuplication-Divergence algorithm, the Sol\\'e algorithm and the iSite algorithm,\nwere inspired by biological processes underlying the evolution of protein\nnetworks, and the networks they produce differ essentially from networks grown\nby the Barabasi-Albert algorithm. In this paper the mean field analysis of\nthese algorithms is reconsidered, and extended to variant and modified\nimplementations of the algorithms. The degree sequences of scale-free networks\ndecay according to a powerlaw distribution, namely $P(k) \\sim k^{-\\gamma}$,\nwhere $\\gamma$ is a scaling exponent. We derive mean field expressions for\n$\\gamma$, and test these by numerical simulations. Generally, good agreement is\nobtained. We also found that some algorithms do not produce scale-free networks\n(for example some variant Barabasi-Albert and Sol\\'e networks).",
    "authors": [
      "S Konini",
      "EJ Janse van Rensburg"
    ],
    "publication_date": "2017-02-01T13:15:01Z",
    "arxiv_id": "http://arxiv.org/abs/1702.00239v2",
    "download_url": "http://arxiv.org/abs/1702.00239v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Context in Synthetic Biology: Memory Effects of Environments with\n  Mono-molecular Reactions",
    "abstract": "Synthetic biology aims at designing modular genetic circuits that can be\nassembled according to the desired function. When embedded in a cell, a circuit\nmodule becomes a small subnetwork within a larger environmental network, and\nits dynamics is therefore affected by potentially unknown interactions with the\nenvironment. It is well-known that the presence of the environment not only\ncauses extrinsic noise but also memory effects, which means that the dynamics\nof the subnetwork is affected by its past states via a memory function that is\ncharacteristic of the environment. We study several generic scenarios for the\ncoupling between a small module and a larger environment, with the environment\nconsisting of a chain of mono-molecular reactions. By mapping the dynamics of\nthis coupled system onto random walks, we are able to give exact analytical\nexpressions for the arising memory functions. Hence, our results give insights\ninto the possible types of memory functions and thereby help to better predict\nsubnetwork dynamics.",
    "authors": [
      "Johannes Falk",
      "Leo Bronstein",
      "Maleen Hanst",
      "Barbara Drossel",
      "Heinz Koeppl"
    ],
    "publication_date": "2018-09-25T15:39:23Z",
    "arxiv_id": "http://arxiv.org/abs/1809.09555v2",
    "download_url": "http://arxiv.org/abs/1809.09555v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Statistical Perspective on the Challenges in Molecular Microbial\n  Biology",
    "abstract": "High throughput sequencing (HTS)-based technology enables identifying and\nquantifying non-culturable microbial organisms in all environments. Microbial\nsequences have enhanced our understanding of the human microbiome, the soil and\nplant environment, and the marine environment. All molecular microbial data\npose statistical challenges due to contamination sequences from reagents, batch\neffects, unequal sampling, and undetected taxa. Technical biases and\nheteroscedasticity have the strongest effects, but different strains across\nsubjects and environments also make direct differential abundance testing\nunwieldy. We provide an introduction to a few statistical tools that can\novercome some of these difficulties and demonstrate those tools on an example.\nWe show how standard statistical methods, such as simple hierarchical mixture\nand topic models, can facilitate inferences on latent microbial communities. We\nalso review some nonparametric Bayesian approaches that combine visualization\nand uncertainty quantification. The intersection of molecular microbial biology\nand statistics is an exciting new venue. Finally, we list some of the important\nopen problems that would benefit from more careful statistical method\ndevelopment.",
    "authors": [
      "Pratheepa Jeganathan",
      "Susan P. Holmes"
    ],
    "publication_date": "2021-03-06T21:14:23Z",
    "arxiv_id": "http://arxiv.org/abs/2103.04198v1",
    "download_url": "http://arxiv.org/abs/2103.04198v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Recurrent neural chemical reaction networks that approximate arbitrary\n  dynamics",
    "abstract": "Many important phenomena in biochemistry and biology exploit dynamical\nfeatures such as multi-stability, oscillations, and chaos. Construction of\nnovel chemical systems with such rich dynamics is a challenging problem central\nto the fields of synthetic biology and molecular nanotechnology. In this paper,\nwe address this problem by putting forward a molecular version of a recurrent\nartificial neural network, which we call recurrent neural chemical reaction\nnetwork (RNCRN). The RNCRN uses a modular architecture - a network of chemical\nneurons - to approximate arbitrary dynamics. We first prove that with\nsufficiently many chemical neurons and suitably fast reactions, the RNCRN can\nbe systematically trained to achieve any dynamics. RNCRNs with relatively small\nnumber of chemical neurons and a moderate range of reaction rates are then\ntrained to display a variety of biologically-important dynamical features. We\nalso demonstrate that such RNCRNs are experimentally implementable with\nDNA-strand-displacement technologies.",
    "authors": [
      "Alexander Dack",
      "Benjamin Qureshi",
      "Thomas E. Ouldridge",
      "Tomislav Plesa"
    ],
    "publication_date": "2024-06-05T17:00:16Z",
    "arxiv_id": "http://arxiv.org/abs/2406.03456v2",
    "download_url": "http://arxiv.org/abs/2406.03456v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PharMolixFM: All-Atom Foundation Models for Molecular Modeling and\n  Generation",
    "abstract": "Structural biology relies on accurate three-dimensional biomolecular\nstructures to advance our understanding of biological functions, disease\nmechanisms, and therapeutics. While recent advances in deep learning have\nenabled the development of all-atom foundation models for molecular modeling\nand generation, existing approaches face challenges in generalization due to\nthe multi-modal nature of atomic data and the lack of comprehensive analysis of\ntraining and sampling strategies. To address these limitations, we propose\nPharMolixFM, a unified framework for constructing all-atom foundation models\nbased on multi-modal generative techniques. Our framework includes three\nvariants using state-of-the-art multi-modal generative models. By formulating\nmolecular tasks as a generalized denoising process with task-specific priors,\nPharMolixFM achieves robust performance across various structural biology\napplications. Experimental results demonstrate that PharMolixFM-Diff achieves\ncompetitive prediction accuracy in protein-small-molecule docking (83.9% vs.\n90.2% RMSD < 2{\\AA}, given pocket) with significantly improved inference speed.\nMoreover, we explore the empirical inference scaling law by introducing more\nsampling repeats or steps. Our code and model are available at\nhttps://github.com/PharMolix/OpenBioMed.",
    "authors": [
      "Yizhen Luo",
      "Jiashuo Wang",
      "Siqi Fan",
      "Zaiqing Nie"
    ],
    "publication_date": "2025-03-12T12:53:43Z",
    "arxiv_id": "http://arxiv.org/abs/2503.21788v3",
    "download_url": "http://arxiv.org/abs/2503.21788v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dynamics in Soft-Matter and Biology Studied by Coherent Scattering\n  Probes",
    "abstract": "Neutrons and x-rays are coherent probes, and their coherent properties are\nused in scattering experiments. Only coherent scattering probes can elucidate\ncollective molecular motions. While phonons in crystals were studied for half a\ncentury now, the study of collective molecular motions in soft-matter and\nbiology is a rather new but upcoming field. Collective dynamics often determine\nmaterial properties and interactions, and are crucial to establish\ndynamics-function relations. We review properties of neutrons and x-rays and\nderive the origin of coherent and incoherent scattering. Taking molecular\nmotions in membranes and proteins as example, the difference between coherent\nand incoherent dynamics is discussed, and how local and collective motions can\nbe accessed in x-ray and neutron scattering experiments. Matching of coherent\nproperties of the scattering probe may become important in soft-matter and\nbiology because of (1) the missing long ranged order and (2) the large length\nscales involved. It is likely to be important in systems, where fluctuating\nnanoscale domains strongly determine material properties. Inelastic scattering\ncan provide very local structural information in disordered systems. Inelastic\nneutron scattering experiments point to a coexistence of short-lived nanoscale\ngel and fluid domains in phospholipid bilayers in the range of the gel-fluid\nphase transition, which may be responsible for critical behavior and determine\nelastic properties.",
    "authors": [
      "Maikel C. Rheinstadter"
    ],
    "publication_date": "2009-05-11T15:25:19Z",
    "arxiv_id": "http://arxiv.org/abs/0905.1636v2",
    "download_url": "http://arxiv.org/abs/0905.1636v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Distributions in Gene Regulatory Dynamics",
    "abstract": "We show how one may analytically compute the stationary density of the\ndistribution of molecular constituents in populations of cells in the presence\nof noise arising from either bursting transcription or translation, or noise in\ndegradation rates arising from low numbers of molecules. We have compared our\nresults with an analysis of the same model systems (either inducible or\nrepressible operons) in the absence of any stochastic effects, and shown the\ncorrespondence between behaviour in the deterministic system and the stochastic\nanalogs. We have identified key dimensionless parameters that control the\nappearance of one or two steady states in the deterministic case, or unimodal\nand bimodal densities in the stochastic systems, and detailed the analytic\nrequirements for the occurrence of different behaviours. This approach\nprovides, in some situations, an alternative to computationally intensive\nstochastic simulations. Our results indicate that, within the context of the\nsimple models we have examined, bursting and degradation noise cannot be\ndistinguished analytically when present alone.",
    "authors": [
      "Michael C. Mackey",
      "Marta Tyran-Kamińska",
      "Romain Yvinec"
    ],
    "publication_date": "2010-09-29T09:07:44Z",
    "arxiv_id": "http://arxiv.org/abs/1009.5810v1",
    "download_url": "http://arxiv.org/abs/1009.5810v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relationships among the nucleotide content of human genome sequence,\n  gene structure, and gene expression features (PhD synopsis)",
    "abstract": "The Dissertation is focused on the studies of associations between functional\nelements in human genome and their nucleotide structure. The asymmetry in\nnucleotide content (skew, bias) was chosen as the main feature for nucleotide\nstructure. A significant difference in nucleotide content asymmetry was found\nfor human exons vs. introns. Specifically, exon sequences display bias for\npurines (i.e., excess of A and G over C and T), while introns exhibit\nketo-amino skew (i.e. excess of G and T over A and C). The extents of these\nbiases depend upon gene expression patterns. The highest intronic keto-amino\nskew is found in the introns of housekeeping genes. In the case of introns,\nwhose sequences are under weak repair system, the AT->GC and CG->TA\nsubstitutions are preferentially accumulated. A comparative analysis of gene\nsequences encoding cytochrome P450 2E1 of Homo sapiens and representative\nmammals was done. The cladistic tree on the basis of coding sequences\nsimilarity of the gene Cyp2e1 was constructed. A new programming tools of NCBI\ndatabase sequence mining and analysis was developed, resulting in construction\nof a own database.",
    "authors": [
      "Diana Duplij"
    ],
    "publication_date": "2010-12-30T15:56:24Z",
    "arxiv_id": "http://arxiv.org/abs/1101.0100v1",
    "download_url": "http://arxiv.org/abs/1101.0100v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SANTA: quantifying the functional content of molecular networks",
    "abstract": "Linking networks of molecular interactions to cellular functions and\nphenotypes is a key goal in systems biology. Here, we adapt concepts of spatial\nstatistics to assess the functional content of molecular networks. Based on the\nguilt-by-association principle, our approach (called SANTA) quantifies the\nstrength of association between a gene set and a network, and functionally\nannotates molecular networks like other enrichment methods annotate lists of\ngenes. As a general association measure, SANTA can (i) functionally annotate\nexperimentally derived networks using a collection of curated gene sets, and\n(ii) annotate experimentally derived gene sets using a collection of curated\nnetworks, as well as (iii) prioritize genes for follow-up analyses. We\nexemplify the efficacy of SANTA in several case studies using the \\emph{S.\ncerevisiae} genetic interaction network and genome-wide RNAi screens in cancer\ncell lines. Our theory, simulations and applications show that SANTA provides a\nprincipled statistical way to quantify the association between molecular\nnetworks and cellular functions and phenotypes. SANTA is available from\nhttp://bioconductor.org/packages/release/bioc/html/SANTA.html.",
    "authors": [
      "Alex J. Cornish",
      "Florian Markowetz"
    ],
    "publication_date": "2014-07-17T12:59:42Z",
    "arxiv_id": "http://arxiv.org/abs/1407.4658v1",
    "download_url": "http://arxiv.org/abs/1407.4658v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Target-aware Molecular Graph Generation",
    "abstract": "Generating molecules with desired biological activities has attracted growing\nattention in drug discovery. Previous molecular generation models are designed\nas chemocentric methods that hardly consider the drug-target interaction,\nlimiting their practical applications. In this paper, we aim to generate\nmolecular drugs in a target-aware manner that bridges biological activity and\nmolecular design. To solve this problem, we compile a benchmark dataset from\nseveral publicly available datasets and build baselines in a unified framework.\nBuilding on the recent advantages of flow-based molecular generation models, we\npropose SiamFlow, which forces the flow to fit the distribution of target\nsequence embeddings in latent space. Specifically, we employ an alignment loss\nand a uniform loss to bring target sequence embeddings and drug graph\nembeddings into agreements while avoiding collapse. Furthermore, we formulate\nthe alignment into a one-to-many problem by learning spaces of target sequence\nembeddings. Experiments quantitatively show that our proposed method learns\nmeaningful representations in the latent space toward the target-aware\nmolecular graph generation and provides an alternative approach to bridge\nbiology and chemistry in drug discovery.",
    "authors": [
      "Cheng Tan",
      "Zhangyang Gao",
      "Stan Z. Li"
    ],
    "publication_date": "2022-02-10T04:31:14Z",
    "arxiv_id": "http://arxiv.org/abs/2202.04829v2",
    "download_url": "http://arxiv.org/abs/2202.04829v2",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tokenization for Molecular Foundation Models",
    "abstract": "Text-based foundation models have become an important part of scientific\ndiscovery, with molecular foundation models accelerating advancements in\nmaterial science and molecular design.However, existing models are constrained\nby closed-vocabulary tokenizers that capture only a fraction of molecular\nspace. In this work, we systematically evaluate 34 tokenizers, including 19\nchemistry-specific ones, and reveal significant gaps in their coverage of the\nSMILES molecular representation. To assess the impact of tokenizer choice, we\nintroduce n-gram language models as a low-cost proxy and validate their\neffectiveness by pretraining and finetuning 18 RoBERTa-style encoders for\nmolecular property prediction. To overcome the limitations of existing\ntokenizers, we propose two new tokenizers -- Smirk and Smirk-GPE -- with full\ncoverage of the OpenSMILES specification. The proposed tokenizers\nsystematically integrate nuclear, electronic, and geometric degrees of freedom;\nfacilitating applications in pharmacology, agriculture, biology, and energy\nstorage. Our results highlight the need for open-vocabulary modeling and\nchemically diverse benchmarks in cheminformatics.",
    "authors": [
      "Alexius Wadell",
      "Anoushka Bhutani",
      "Venkatasubramanian Viswanathan"
    ],
    "publication_date": "2024-09-19T02:36:04Z",
    "arxiv_id": "http://arxiv.org/abs/2409.15370v3",
    "download_url": "http://arxiv.org/abs/2409.15370v3",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Equilibrium Chemical Engines",
    "abstract": "An equilibrium reversible cycle with a certain engine to transduce the energy\nof any chemical reaction into mechanical energy is proposed. The efficiency for\nchemical energy transduction is also defined so as to be compared with Carnot\nefficiency. Relevance to the study of protein motors is discussed. KEYWORDS:\nChemical thermodynamics, Engine, Efficiency, Molecular machine.",
    "authors": [
      "Tatsuo Shibata",
      "Shin-ichi Sasa"
    ],
    "publication_date": "1997-10-30T08:51:03Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9710328v1",
    "download_url": "http://arxiv.org/abs/cond-mat/9710328v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the stability of Murray's testosterone model",
    "abstract": "We prove the global asymptotic stability of a well-known delayed\nnegative-feedback model of testosterone dynamics, which has been proposed as a\nmodel of oscillatory behavior. We establish stability (and hence the\nimpossibility of oscillations) even in the presence of delays of arbitrary\nlength.",
    "authors": [
      "G. A. Enciso",
      "E. D. Sontag"
    ],
    "publication_date": "2004-03-19T05:47:12Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0403027v1",
    "download_url": "http://arxiv.org/abs/q-bio/0403027v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inference of ecological interaction networks",
    "abstract": "The inference of the interactions between organisms in an ecosystem from\nobservational data is an important problem in ecology. This paper presents a\nmathematical inference method, originally developed for the inference of\nbiochemical networks in molecular biology, adapted for the inference of\nnetworks of ecological interactions. The method is applied to a network of\ninvertebrate families (taxa) in a rice field.",
    "authors": [
      "Paola Vera-Licona",
      "Reinhard Laubenbacher"
    ],
    "publication_date": "2008-05-09T18:41:21Z",
    "arxiv_id": "http://arxiv.org/abs/0805.1395v1",
    "download_url": "http://arxiv.org/abs/0805.1395v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the relationship of steady states of continuous and discrete models",
    "abstract": "In this paper we provide theoretical results that relate steady states of\ncontinuous and discrete models arising from biology.",
    "authors": [
      "Alan Veliz-Cuba",
      "Joseph Arthur",
      "Laura Hochstetler",
      "Victoria Klomps",
      "Erikka Korpi"
    ],
    "publication_date": "2011-09-23T20:42:58Z",
    "arxiv_id": "http://arxiv.org/abs/1109.5197v1",
    "download_url": "http://arxiv.org/abs/1109.5197v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A novice looks at emotional cognition",
    "abstract": "Modeling emotional-cognition is in a nascent stage and therefore wide-open\nfor new ideas and discussions. In this paper the author looks at the modeling\nproblem by bringing in ideas from axiomatic mathematics, information theory,\ncomputer science, molecular biology, non-linear dynamical systems and quantum\ncomputing and explains how ideas from these disciplines may have applications\nin modeling emotional-cognition.",
    "authors": [
      "Rajendra K. Bera"
    ],
    "publication_date": "2013-04-21T08:08:38Z",
    "arxiv_id": "http://arxiv.org/abs/1304.5705v1",
    "download_url": "http://arxiv.org/abs/1304.5705v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Superimposed Codes and Threshold Group Testing",
    "abstract": "We will discuss superimposed codes and non-adaptive group testing designs\narising from the potentialities of compressed genotyping models in molecular\nbiology. The given paper was motivated by the 30th anniversary of\nD'yachkov-Rykov recurrent upper bound on the rate of superimposed codes\npublished in 1982. We were also inspired by recent results obtained for\nnon-adaptive threshold group testing which develop the theory of superimposed\ncodes",
    "authors": [
      "A. D'yachkov",
      "V. Rykov",
      "C. Deppe",
      "V. Lebedev"
    ],
    "publication_date": "2014-01-29T12:27:36Z",
    "arxiv_id": "http://arxiv.org/abs/1401.7485v1",
    "download_url": "http://arxiv.org/abs/1401.7485v1",
    "field_of_study": "biology",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]