[
  {
    "title": "A theory of tensor products for module categories for a vertex operator algebra, IV",
    "abstract": "This is the fourth part of a series of papers developing a tensor product theory of modules for a vertex operator algebra. In this paper, We establish the associativity of $P(z)$-tensor products for nonzero complex numbers $z$ constructed in Part III of the present series under suitable conditions. The associativity isomorphisms constructed in this paper are analogous to associativity isomorphisms for vector space tensor products in the sense that it relates the tensor products of three elements in three modules taken in different ways. The main new feature is that they are controlled by the decompositions of certain spheres with four punctures into spheres with three punctures using a sewing operation. We also show that under certain conditions, the existence of the associativity isomorphisms is equivalent to the associativity (or (nonmeromorphic) operator product expansion in the language of physicists) for the intertwining operators (or chiral vertex operators). Thus the associativity of tensor products provides a means to establish the (nonmeromorphic) operator product expansion.",
    "authors": [
      "Yi-Zhi Huang"
    ],
    "publication_date": "1995-05-17T17:23:59Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9505019v1",
    "download_url": "https://arxiv.org/abs/q-alg/9505019v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal enveloping algebra of a pair of compatible Lie brackets",
    "abstract": "Applying the Poincare-Birkhoff-Witt property and the Groebner-Shirshov bases technique, we find the linear basis of the associative universal enveloping algebra in the sense of V. Ginzburg and M. Kapranov of a pair of compatible Lie brackets. We state that the growth rate of this universal enveloping over $n$-dimensional compatible Lie algebra equals $n+1$.",
    "authors": [
      "Vsevolod Gubarev"
    ],
    "publication_date": "2021-10-13T06:15:00Z",
    "arxiv_id": "http://arxiv.org/abs/2110.06518v3",
    "download_url": "https://arxiv.org/abs/2110.06518v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deformation of Algebra Factorisations",
    "abstract": "A general deformation theory of algebras which factorise into two subalgebras is studied. It is shown that the classification of deformations is related to the cohomology of a certain double complex reminiscent of the Gerstenhaber-Schack complex of a bialgebra.",
    "authors": [
      "Tomasz Brzezinski"
    ],
    "publication_date": "1999-05-27T14:33:52Z",
    "arxiv_id": "http://arxiv.org/abs/math/9905178v2",
    "download_url": "https://arxiv.org/abs/math/9905178v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The commutator algebra of a nilpotent matrix and an application to the theory of commutative Artinian algebras",
    "abstract": "We show a number of properties of the commutator algebra of a nilpotent matrix over a field. In particular we determine the simple modules of the commutator algebra. Then the results are applied to prove that certain Artinian complete intersections have the strong Lefscehtz property.",
    "authors": [
      "Tadahito Harima",
      "Junzo Watanabe"
    ],
    "publication_date": "2012-06-28T06:37:56Z",
    "arxiv_id": "http://arxiv.org/abs/1206.6574v1",
    "download_url": "https://arxiv.org/abs/1206.6574v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A $p$-DG deformed Webster algebra of type $A_1$",
    "abstract": "We define a $p$-DG structure on a deformation of Webster algebra of type $A_1$ and its splitter bimodules.",
    "authors": [
      "Yasuyoshi Yonezawa"
    ],
    "publication_date": "2019-10-10T22:35:33Z",
    "arxiv_id": "http://arxiv.org/abs/1910.04897v3",
    "download_url": "https://arxiv.org/abs/1910.04897v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Drinfeld double of deformed quantum algebras",
    "abstract": "We provide a deformation, $\\mathfrak{f}_β$, of Lusztig algebra $\\mathbf{f}$. Various quantum algebras in literatures, including half parts of two-parameter quantum algebras, quantum superalgebras, and multi-parameter quantum algebras/superalgebras, are all specializations of $\\mathfrak{f}_β$. Moreover, $\\mathfrak{f}_β$ is isomorphic to Lusztig algebra $\\mathbf{f}$ up to a twist. As a consequence, half parts of those quantum algebras are isomorphic to Lusztig algebra $\\mathbf{f}$ over a big enough ground field up to certain twists. We further construct the entire algebra $\\mathbf U_{β,ξ}$ by Drinfeld double construction. As special cases, above quantum algebras all admit a Drinfeld double construction under certain assumptions.",
    "authors": [
      "Zhaobing Fan",
      "Junjing Xing"
    ],
    "publication_date": "2019-11-04T02:34:06Z",
    "arxiv_id": "http://arxiv.org/abs/1911.01011v1",
    "download_url": "https://arxiv.org/abs/1911.01011v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraicity of normal analytic compactifications of C^2 with one irreducible curve at infinity",
    "abstract": "We present an effective criterion to determine if a normal analytic compactification of C^2 with one irreducible curve at infinity is algebraic or not. As a by product we establish a correspondence between normal algebraic compactifications of C^2 with one irreducible curve at infinity and algebraic curves contained in C^2 with one place at infinity. Using our criterion we construct pairs of homeomorphic normal analytic surfaces with minimally elliptic singularities such that one of the surfaces is algebraic and the other is not. Our main technical tool is the sequence of \"key forms\" - a 'global' variant of the sequence of \"key polynomials\" introduced by MacLane to study valuations in the 'local' setting - which also extends the notion of \"approximate roots\" of polynomials considered by Abhyankar and Moh.",
    "authors": [
      "Pinaki Mondal"
    ],
    "publication_date": "2015-10-04T23:36:44Z",
    "arxiv_id": "http://arxiv.org/abs/1510.00998v2",
    "download_url": "https://arxiv.org/abs/1510.00998v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Z-algebras and representations of quantum affine algebras",
    "abstract": "Generalizing our earlier work, we introduce the homogeneous quantum $Z$-algebras for all quantum affine algebras $\\alg$ of type one. With the new algebras we unite previously scattered realizations of quantum affine algebras in various cases. As a result we find a realization of $U_q(F_4^{(1)})$.",
    "authors": [
      "Naihuan Jing"
    ],
    "publication_date": "1998-06-08T16:30:25Z",
    "arxiv_id": "http://arxiv.org/abs/math/9806043v1",
    "download_url": "https://arxiv.org/abs/math/9806043v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Using max-algebra linear models in the representation of queueing systems",
    "abstract": "The application of the max-algebra to describe queueing systems by both linear scalar and vector equations is discussed. It is shown that these equations may be handled using ordinary algebraic manipulations. Examples of solving the equations representing the $G/G/1$ queue and queues in tandem are also presented.",
    "authors": [
      "Nikolai K. Krivulin"
    ],
    "publication_date": "2012-10-22T19:52:00Z",
    "arxiv_id": "http://arxiv.org/abs/1210.6019v1",
    "download_url": "https://arxiv.org/abs/1210.6019v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modular invariant Frobenius algebras from ribbon Hopf algebra automorphisms",
    "abstract": "For any finite-dimensional factorizable ribbon Hopf algebra H and any ribbon automorphism omega of H, we establish the existence of the following structure: an H-bimodule F_omega and a bimodule morphism Z_omega from Lyubashenko's Hopf algebra object K for the bimodule category to F_omega. This morphism is invariant under the natural action of the mapping class group of the one-punctured torus on the space of bimodule morphisms from K to F_omega. We further show that the bimodule F_omega can be endowed with a natural structure of a commutative symmetric Frobenius algebra in the monoidal category of H-bimodules, and that it is a special Frobenius algebra iff H is semisimple.\n  The bimodules K and F_omega can both be characterized as coends of suitable bifunctors. The morphism Z_omega is obtained by applying a monodromy operation to the coproduct of F_omega; a similar construction for the product of F_omega exists as well.\n  Our results are motivated by the quest to understand the bulk state space and the bulk partition function in two-dimensional conformal field theories with chiral algebras that are not necessarily semisimple.",
    "authors": [
      "Jurgen Fuchs",
      "Christoph Schweigert",
      "Carl Stigner"
    ],
    "publication_date": "2011-06-01T15:43:40Z",
    "arxiv_id": "http://arxiv.org/abs/1106.0210v3",
    "download_url": "https://arxiv.org/abs/1106.0210v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-associative algebras",
    "abstract": "A non-associative algebra over a field $\\mathbb{K}$ is a $\\mathbb{K}$-vector space $A$ equipped with a bilinear operation \\[ {A\\times A\\to A\\colon\\; (x,y)\\mapsto x\\cdot y=xy}. \\] The collection of all non-associative algebras over $\\mathbb{K}$, together with the product-preserving linear maps between them, forms a variety of algebras: the category $\\mathsf{Alg}_\\mathbb{K}$. The multiplication need not satisfy any additional properties, such as associativity or the existence of a unit. Familiar categories such as the varieties of associative algebras, Lie algebras, etc. may be found as subvarieties of $\\mathsf{Alg}_\\mathbb{K}$ by imposing equations, here $x(yz)=(xy)z$ (associativity) or $xy =- yx$ and $x(yz)+z(xy)+ y(zx)=0$ (anti-commutativity and the Jacobi identity), respectively.\n  The aim of these lectures is to explain some basic notions of categorical algebra from the point of view of non-associative algebras, and vice versa. As a rule, the presence of the vector space structure makes things easier to understand here than in other, less richly structured categories.\n  We explore concepts like normal subobjects and quotients, coproducts and protomodularity. On the other hand, we discuss the role of (non-associative) polynomials, homogeneous equations, and how additional equations lead to reflective subcategories.",
    "authors": [
      "Tim Van der Linden"
    ],
    "publication_date": "2020-04-14T09:56:42Z",
    "arxiv_id": "http://arxiv.org/abs/2004.06392v2",
    "download_url": "https://arxiv.org/abs/2004.06392v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tubular Cluster Algebras II: Exponential growth",
    "abstract": "Among the mutation finite cluster algebras the tubular ones are a particularly interesting class. We show that all tubular (simply laced) cluster algebras are of exponential growth by two different methods: first by studying the automorphism group of the corresponding cluster category and second by giving explicit sequences of mutations.",
    "authors": [
      "Michael Barot",
      "Christof Geiss",
      "Gustavo Jasso"
    ],
    "publication_date": "2012-02-22T04:27:31Z",
    "arxiv_id": "http://arxiv.org/abs/1202.4816v3",
    "download_url": "https://arxiv.org/abs/1202.4816v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On quantum toroidal algebra of type $A_1$",
    "abstract": "In this paper we introduce a new quantum algebra which specializes to the $2$-toroidal Lie algebra of type $A_1$.\n  We prove that this quantum toroidal algebra has a natural triangular decomposition, a (topological) Hopf algebra structure and a vertex operator realization.",
    "authors": [
      "Fulin Chen",
      "Naihuan Jing",
      "Fei Kong",
      "Shaobin Tan"
    ],
    "publication_date": "2020-06-25T17:02:11Z",
    "arxiv_id": "http://arxiv.org/abs/2006.14558v1",
    "download_url": "https://arxiv.org/abs/2006.14558v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Version of the Goldman-Millson Theorem for Filtered L-infinity Algebras",
    "abstract": "In this paper we consider $L_{\\infty}$-algebras equipped with complete descending filtrations. We prove that, under some mild conditions, an $L_{\\infty}$ quasi-isomorphism $U: L \\to \\tilde{L}$ induces a weak equivalence between the Deligne-Getzler-Hinich (DGH) $\\infty$-groupoids corresponding to $L$ and $\\tilde{L}$, respectively. This paper may be considered as a modest addition to foundational paper arXiv:math/0404003 by Ezra Getzler.",
    "authors": [
      "Vasily A. Dolgushev",
      "Christopher L. Rogers"
    ],
    "publication_date": "2014-07-24T20:51:47Z",
    "arxiv_id": "http://arxiv.org/abs/1407.6735v2",
    "download_url": "https://arxiv.org/abs/1407.6735v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representations of shifted quantum affine algebras",
    "abstract": "We develop the representation theory of shifted quantum affine algebras $\\mathcal{U}_q^μ(\\hat{\\mathfrak{g}})$ and of their truncations which appeared in the study of quantized K-theoretic Coulomb branches of 3d $N = 4$ SUSY quiver gauge theories. Our approach is based on novel techniques, which are new in the cases of shifted Yangians or ordinary quantum affine algebras as well : realization in terms of asymptotical subalgebras of the quantum affine algebra $\\mathcal{U}_q(\\hat{\\mathfrak{g}})$, induction and restriction functors to the category $\\mathcal{O}$ of representations of the Borel subalgebra $\\mathcal{U}_q(\\hat{\\mathfrak{b}})$ of $\\mathcal{U}_q(\\hat{\\mathfrak{g}})$, relations between truncations and Baxter polynomiality in quantum integrable models, parametrization of simple modules via Langlands dual interpolation. We first introduce the category $\\mathcal{O}_μ$ of representations of $\\mathcal{U}_q^μ(\\hat{\\mathfrak{g}})$ and we classify its simple objects. Then we establish the existence of fusion products and we get a ring structure on the sum of the Grothendieck groups $K_0(\\mathcal{O}_μ)$. We classify simple finite-dimensional representations of $\\mathcal{U}_q^μ(\\hat{\\mathfrak{g}})$ and we obtain a cluster algebra structure on the Grothendieck ring of finite-dimensional representations. We prove a truncation has only a finite number of simple representations and we introduce a related partial ordering on simple modules. Eventually, we state a conjecture on the parametrization of simple modules of a non simply-laced truncation in terms of the Langlands dual Lie algebra. We have several evidences, including a general result for simple finite-dimensional representations.",
    "authors": [
      "David Hernandez"
    ],
    "publication_date": "2020-10-14T12:17:58Z",
    "arxiv_id": "http://arxiv.org/abs/2010.06996v3",
    "download_url": "https://arxiv.org/abs/2010.06996v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Algebraic characterization of the affine three space in arbitrary characteristic",
    "abstract": "We give an algebraic characterization of the affine $3$-space over an algebraically closed field of arbitrary characteristic. We use this characterization to reformulate the following question. Let $$A=k[X, Y, Z, T]/(XY+Z^{p^e}+T+T^{sp})$$ where $p^e\\nmid sp$, $sp\\nmid p^e$, $e, s\\geq 1$ and $k$ is an algebraically closed field of positive characteristic $p$. Is $A= k^{[3]}$? We prove some results on ML and ML$^*$ invariants and use them to prove a special case of the strong cancellation of $k^{[2]}$.",
    "authors": [
      "P. M. S. Sai Krishna"
    ],
    "publication_date": "2023-08-10T08:39:19Z",
    "arxiv_id": "http://arxiv.org/abs/2308.05424v4",
    "download_url": "https://arxiv.org/abs/2308.05424v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Some Generalizations of Batalin-Vilkovisky Algebras",
    "abstract": "We define the concept of higher order differential operators on a general noncommutative, nonassociative superalgebra A, and show that a vertex operator superalgebra has plenty of them, namely modes of vertex operators. A linear operator Δis a differential operator of order at most r if an inductively defined (r+1)-form Φ_Δ^{r+1} is identically zero. When A is supercommutative and associative and Δis an odd, square zero, second order differential operator on A, Φ_Δ^2 defines a \"Batalin-Vilkovisky algebra\" structure on A. We generalize this notion to any superalgebra with an odd, square zero, second order differential operator, and show that all properties of the classical BV bracket but one continue to hold \"on the nose\". We also point out connections to Leibniz algebras and the noncommutative homology theory of Loday. Taking the generalization process one step further, we remove all conditions on Δto examine the changes in the basic properties of the bracket. We see that a topological chiral algebra with a mild restriction yields a classical BV algebra in the cohomology. Finally, we investigate the quantum BV master equation and relate it to deformations of differential graded algebras.",
    "authors": [
      "Füsun Akman"
    ],
    "publication_date": "1995-06-29T20:45:09Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9506027v3",
    "download_url": "https://arxiv.org/abs/q-alg/9506027v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Refinement of Ado's Theorem in Low Dimensions and Application in Affine Geometr",
    "abstract": "In this paper, we construct a faithful representation with the lowest dimension for every complex Lie algebra in dimension $\\leq 4$. In particular, in our construction, in the case that the faithful representation has the same dimension of the Lie algebra, it can induce an étale affine representation with base zero which has a natural and simple form and gives a compatible left-symmetric algebra on the Lie algebra. Such affine representations do not contain any nontrivial one-parameter subgroups of translation.",
    "authors": [
      "Yi-Fang Kang",
      "Cheng-Ming Bai"
    ],
    "publication_date": "2007-11-24T13:45:39Z",
    "arxiv_id": "http://arxiv.org/abs/0711.3836v1",
    "download_url": "https://arxiv.org/abs/0711.3836v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-dimensional Hopf algebras over the Hopf algebra $H_{b:1}$ of Kashina",
    "abstract": "Let $H$ be the 16-dimensional nontrivial (namely, noncommutative and noncocommutative) semisimple Hopf algebra $H_{b:1}$ appeared in Kashina's work \\cite{K00}. We obtain all simple Yetter-Drinfeld modules over $H$ and then determine all finite-dimensional Nichols algebras satisfying $\\mathcal{B}(V)\\cong \\bigotimes_{i\\in I}\\mathcal{B}(V_i)$, where $V=\\bigoplus_{i\\in I}V_i$, each $V_i$ is a simple object in $_H^H\\mathcal{YD}$. Finally, we describe all liftings of those $\\mathcal{B}(V)$ over $H$.",
    "authors": [
      "Yiwei Zheng",
      "Yun Gao",
      "Naihong Hu"
    ],
    "publication_date": "2019-11-13T14:50:20Z",
    "arxiv_id": "http://arxiv.org/abs/1911.05516v1",
    "download_url": "https://arxiv.org/abs/1911.05516v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hopf algebras of dimension pq, II",
    "abstract": "Let H be a Hopf algebra of dimension pq over an algebraically closed field of characteristic zero, where p, q are odd primes with p < q < 4p+12. We prove that H is semisimple and thus isomorphic to a group algebra, or the dual of a group algebra.",
    "authors": [
      "Siu-Hung Ng"
    ],
    "publication_date": "2007-04-18T21:16:43Z",
    "arxiv_id": "http://arxiv.org/abs/0704.2428v1",
    "download_url": "https://arxiv.org/abs/0704.2428v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A q-Brauer algebra",
    "abstract": "We define a new $q$-deformation of Brauer's centralizer algebra which contains Hecke algebras of type $A$ as unital subalgebras. We determine its generic structure as well as the structure of certain semisimple quotients. This is expected to have applications for constructions of subfactors of type II$_1$ factors and for module categories of fusion categories of type $A$ corresponding to certain symmetric spaces.",
    "authors": [
      "Hans Wenzl"
    ],
    "publication_date": "2011-02-18T19:33:14Z",
    "arxiv_id": "http://arxiv.org/abs/1102.3892v2",
    "download_url": "https://arxiv.org/abs/1102.3892v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On finite representations of conformal algebras",
    "abstract": "We prove a finite torsion-free associative conformal algebra to have a finite faithful conformal representation. As a corollary, it is shown that one may join a conformal unit to such an algebra. Some examples are stated to demonstrate that a conformal unit can not be joined to any torsion-free associative conformal algebra. In particular, there exist associative conformal algebras of linear growth and even locally finite ones that have no finite faithful representation. We also consider the problem of existence of a finite faithful representation for a torsion-free finite Lie conformal algebra (the analogue of Ado's Theorem). It turns out that the conformal analogue of the Poincare-Birkhoff-Witt Theorem would imply the Ado Theorem for finite Lie conformal algebras. We prove that every torsion-free finite solvable Lie conformal algebra has a finite faithful representation.",
    "authors": [
      "Pavel Kolesnikov"
    ],
    "publication_date": "2010-05-20T19:46:40Z",
    "arxiv_id": "http://arxiv.org/abs/1005.3805v1",
    "download_url": "https://arxiv.org/abs/1005.3805v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "X=M for symmetric powers",
    "abstract": "The X=M conjecture of Hatayama et al. asserts the equality between the one-dimensional configuration sum X expressed as the generating function of crystal paths with energy statistics and the fermionic formula M for all affine Kac--Moody algebra. In this paper we prove the X=M conjecture for tensor products of Kirillov--Reshetikhin crystals B^{1,s} associated to symmetric powers for all nonexceptional affine algebras.",
    "authors": [
      "Anne Schilling",
      "Mark Shimozono"
    ],
    "publication_date": "2004-12-19T04:52:19Z",
    "arxiv_id": "http://arxiv.org/abs/math/0412376v2",
    "download_url": "https://arxiv.org/abs/math/0412376v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simple finite-dimensional double algebras",
    "abstract": "A double algebra is a linear space $V$ equipped with linear map $V\\otimes V\\to V\\otimes V$. Additional conditions on this map lead to the notions of Lie and associative double algebras. We prove that simple finite-dimensional Lie double algebras do not exist over an arbitrary field, and all simple finite-dimensional associative double algebras over an algebraically closed field are trivial.\n  Over an arbitrary field, every simple finite-dimensional associative double algebra is commutative. A double algebra structure on a finite-dimensional space $V$ is naturally described by a linear operator $R$ on the algebra $\\End V$ of linear transformations of~$V$. Double Lie algebras correspond in this sense to skew-symmetric Rota---Baxter operators, double associative algebra structures---to (left) averaging operators.",
    "authors": [
      "M. E. Goncharov",
      "P. S. Kolesnikov"
    ],
    "publication_date": "2016-11-07T11:16:43Z",
    "arxiv_id": "http://arxiv.org/abs/1611.01992v1",
    "download_url": "https://arxiv.org/abs/1611.01992v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Koszul algebras and Gröbner bases of quadrics",
    "abstract": "We present results, both old and new, concerning Koszul and G-quadratic properties of algebras associated with points, curves, cubics and spaces of quadrics of low codimension.",
    "authors": [
      "Aldo Conca"
    ],
    "publication_date": "2009-03-13T14:31:17Z",
    "arxiv_id": "http://arxiv.org/abs/0903.2397v1",
    "download_url": "https://arxiv.org/abs/0903.2397v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The monoidal center and the character algebra",
    "abstract": "For a pivotal finite tensor category $\\mathcal{C}$ over an algebraically closed field $k$, we define the algebra $\\mathsf{CF}(\\mathcal{C})$ of class functions and the internal character $\\mathsf{ch}(X) \\in \\mathsf{CF}(\\mathcal{C})$ for an object $X \\in \\mathcal{C}$ by using an adjunction between $\\mathcal{C}$ and its monoidal center $\\mathcal{Z}(\\mathcal{C})$. We also develop the integral theory in a unimodular finite tensor category by using the same adjunction. By utilizing these tools, we extend some results in the character theory of finite-dimensional Hopf algebras to this category-theoretical setting. Our main result is that the map $\\mathsf{ch}: \\mathsf{Gr}_k(\\mathcal{C}) \\to \\mathsf{CF}(\\mathcal{C})$ given by taking the internal character is a well-defined injective algebra map, where $\\mathsf{Gr}_k(\\mathcal{C})$ is the scalar extension of the Grothendieck ring of $\\mathcal{C}$ to $k$. Moreover, under the assumption that $\\mathcal{C}$ is unimodular, the map $\\mathsf{ch}$ is an isomorphism if and only if $\\mathcal{C}$ is semisimple.\n  As an application, we show that the algebra $\\mathsf{Gr}_{k}(\\mathcal{C})$ is semisimple if $\\mathcal{C}$ is a non-degenerate pivotal fusion category. If, moreover, $\\mathsf{Gr}_k(\\mathcal{C})$ is commutative, then the character table of $\\mathcal{C}$ is defined based on the integral theory. It turns out that the character table is obtained from the $S$-matrix if $\\mathcal{C}$ is a modular tensor category. Generalizing corresponding results in the finite group theory, we prove the orthogonality relations and the integrality.",
    "authors": [
      "Kenichi Shimizu"
    ],
    "publication_date": "2015-04-06T00:43:59Z",
    "arxiv_id": "http://arxiv.org/abs/1504.01178v3",
    "download_url": "https://arxiv.org/abs/1504.01178v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multilinear forms and graded algebras",
    "abstract": "In this paper we investigate the class of the connected graded algebras which are finitely generated in degree 1, which are finitely presented with relations of degrees greater or equal to 2 and which are of finite global dimension D and Gorenstein. For D greater or equal to 4 we add the condition that these algebras are homogeneous and Koszul. It is shown that each such algebra is completely characterized by a multilinear form satisfying a twisted cyclicity condition and some other nondegeneracy conditions depending on the global dimension D. This multilinear form plays the role of a volume form and canonically identifies in the quadratic case to a nontrivial Hochschild cycle of maximal degree. Several examples including the Yang-Mills algebra and the extended 4-dimensional Sklyanin algebra are analyzed in this context. Actions of quantum groups are also investigated.",
    "authors": [
      "Michel Dubois-Violette"
    ],
    "publication_date": "2006-04-12T14:58:47Z",
    "arxiv_id": "http://arxiv.org/abs/math/0604279v4",
    "download_url": "https://arxiv.org/abs/math/0604279v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First steps in brave new commutative algebra",
    "abstract": "This is an expository account of completion and local cohomology in brave new commutative algebra, especially as it applies to completion theorems and their duals in equivariant topology. The first part is fairly direct, but the second considers Morita theory and Gorenstein ring spectra. This draws on work of the author with Benson, Dwyer, Iyengar and May, amongst others.",
    "authors": [
      "J. P. C. Greenlees"
    ],
    "publication_date": "2006-09-15T17:18:40Z",
    "arxiv_id": "http://arxiv.org/abs/math/0609453v1",
    "download_url": "https://arxiv.org/abs/math/0609453v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integrals, quantum Galois extensions and the affineness criterion for quantum Yetter-Drinfel'd modules",
    "abstract": "We introduce and study a general concept of integral of a threetuple (H, A, C), where H is a Hopf algebra acting on a coalgebra C and coacting on an algebra A. In particular, quantum integrals associated to Yetter-Drinfel'd modules are defined. Let A be an H-bicomodule algebra, $^H {\\cal YD}_A$ be the category of (generalized) Yetter-Drinfel'd modules and $B$ the subalgebra of coinvariants of the Verma structure of $A$. We introduce the concept of quantum Galois extensions and we prove the affineness criterion in a quantum version.",
    "authors": [
      "C. Menini",
      "G. Militaru"
    ],
    "publication_date": "2001-06-10T08:04:32Z",
    "arxiv_id": "http://arxiv.org/abs/math/0106067v1",
    "download_url": "https://arxiv.org/abs/math/0106067v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Almost complete intersection binomial edge ideals and their Rees algebras",
    "abstract": "Let $G$ be a simple graph on $n$ vertices and $J_G$ denote the binomial edge ideal of $G$ in the polynomial ring $S = \\mathbb{K}[x_1, \\ldots, x_n, y_1, \\ldots, y_n].$ In this article, we compute the second graded Betti numbers of $J_G$, and we obtain a minimal presentation of it when $G$ is a tree or a unicyclic graph. We classify all graphs whose binomial edge ideals are almost complete intersection, prove that they are generated by a $d$-sequence and that the Rees algebra of their binomial edge ideal is Cohen-Macaulay. We also obtain an explicit description of the defining ideal of the Rees algebra of those binomial edge ideals.",
    "authors": [
      "A. V. Jayanthan",
      "Arvind Kumar",
      "Rajib Sarkar"
    ],
    "publication_date": "2019-04-09T07:29:17Z",
    "arxiv_id": "http://arxiv.org/abs/1904.04499v2",
    "download_url": "https://arxiv.org/abs/1904.04499v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On pseudo-invereses of matrices and their characteristic polynomials in supertropical algebra",
    "abstract": "The only invertible matrices in tropical algebra are diagonal matrices, permutation matrices and their products. However, the pseudo-inverse $A^\\nabla$, defined as $\\frac{adj(A)}{det(A)}$, with $det(A)$ being the tropical permanent (also called the tropical determinant) of a matrix $A$, inherits some classical algebraic properties and has some surprising new ones. Defining $B$ and $B'$ to be tropically similar if $B' =A^\\nabla BA$, we examine the characteristic (max-)polynomials of tropically similar matrices as well as those of pseudo-inverses. Other miscellaneous results include a new proof of the identity for $det(AB)$ and a connection to stabilization of the powers of definite matrices.",
    "authors": [
      "Adi Niv"
    ],
    "publication_date": "2013-06-25T07:07:35Z",
    "arxiv_id": "http://arxiv.org/abs/1306.5861v3",
    "download_url": "https://arxiv.org/abs/1306.5861v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On some classification of finite-dimensional Hopf algebras over the Hopf algebra $H_{b:1}^*$ of Kashina",
    "abstract": "Let $H$ be the dual of $16$-dimensional nontrivial semisimple Hopf algebra $H_{b:1}$ in the classification work of Kashina \\cite{K00}. We completely determine all finite-dimensional Nichols algebras satisfying $\\mathcal{B}(N)\\cong \\bigotimes_{i\\in I}\\mathcal{B}(N_i)$, where $N=\\bigoplus_{i\\in I}N_i$, each $N_i$ is a simple object in $_H^H\\mathcal{YD}$. Under this assumption, we classify all those Hopf algebras of finite-dimensional growth from the semisimple Hopf algebra $H$ via the relevant Nichols algebras $\\mathcal B(N)$.",
    "authors": [
      "Yiwei Zheng",
      "Yun Gao",
      "Naihong Hu",
      "Yuxing Shi"
    ],
    "publication_date": "2022-09-26T07:28:27Z",
    "arxiv_id": "http://arxiv.org/abs/2209.12470v1",
    "download_url": "https://arxiv.org/abs/2209.12470v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Covering AlgebrasI: Extended Affine Lie Algebras",
    "abstract": "Covering Algebras of extended affine Lie algebras(EALA's) relative to finite order automorphisms are studied. Conditions are given for when the resulting algebra is again an EALA. This paper deals with affinizations of EALA's relative to finite order automorphisms and these algebras are generalizations of the affine Kac-Moody Lie algebras.",
    "authors": [
      "Bruce Allison",
      "Stephen Berman",
      "Arturo Pianzola"
    ],
    "publication_date": "2001-03-22T19:27:17Z",
    "arxiv_id": "http://arxiv.org/abs/math/0103133v1",
    "download_url": "https://arxiv.org/abs/math/0103133v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multi derivation Maurer-Cartan algebras and sh-Lie-Rinehart algebras",
    "abstract": "We extend the classical characterization of a finite-dimensional Lie algebra g in terms of its Maurer-Cartan algebra-the familiar differential graded algebra of alternating forms on g with values in the ground field, endowed with the standard Lie algebra cohomology operator-to sh Lie-Rinehart algebras. To this end, we first develop a characterization of sh Lie-Rinehart algebras in terms of differential graded cocommutative coalgebras and Lie algebra twisting cochains that extends the nowadays standard characterization of an ordinary sh Lie algebra (equivalently: Linfty algebra) in terms of its associated generalized Cartan-Chevalley-Eilenberg coalgebra. Our approach avoids any higher brackets but reproduces these brackets in a conceptual manner. The new technical tool we develop is a notion of filtered multi derivation chain algebra, somewhat more general than the standard notion of a multicomplex endowed with a compatible algebra structure. The crucial observation, just as for ordinary Lie-Rinehart algebras, is this: For a general sh Lie-Rinehart algebra,the generalized Cartan-Chevalley-Eilenberg operator on the corresponding graded algebra involves two operators, one coming from the sh Lie algebra structure and the other from the generalized action on the corresponding algebra; the sum of the operators is defined on the algebra while the operators are individually defined only on a larger ambient algebra. We illustrate the structure with quasi Lie-Rinehart algebras.",
    "authors": [
      "Johannes Huebschmann"
    ],
    "publication_date": "2013-03-19T17:02:35Z",
    "arxiv_id": "http://arxiv.org/abs/1303.4665v1",
    "download_url": "https://arxiv.org/abs/1303.4665v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Trivial Extensions of Gentle Algebras and Brauer Graph Algebras",
    "abstract": "We show that two well-studied classes of tame algebras coincide: namely, the class of symmetric special biserial algebras coincides with the class of Brauer graph algebras. We then explore the connection between gentle algebras and symmetric special biserial algebras by explicitly determining the trivial extension of a gentle algebra by its minimal injective co-generator. This is a symmetric special biserial algebra and hence a Brauer graph algebra of which we explicitly give the Brauer graph. We further show that a Brauer graph algebra gives rise, via admissible cuts, to many gentle algebras and that the trivial extension of a gentle algebra obtained via an admissible cut is the original Brauer graph algebra.\n  As a consequence we prove that the trivial extension of a Jacobian algebra of an ideal triangulation of a Riemann surface with marked points in the boundary is isomorphic to the Brauer graph algebra with Brauer graph given by the arcs of the triangulation.",
    "authors": [
      "Sibylle Schroll"
    ],
    "publication_date": "2014-05-25T19:25:08Z",
    "arxiv_id": "http://arxiv.org/abs/1405.6419v3",
    "download_url": "https://arxiv.org/abs/1405.6419v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum $\\frak {gl}_\\infty$, infinite $q$-Schur algebras and their representations",
    "abstract": "In this paper, we investigate the structure and representations of the quantum group ${\\mathbf{U}(\\infty)}=\\mathbf U_\\upsilon(\\frak{gl}_\\infty)$. We will present a realization for $\\mathbf{U}(\\infty)$, following Beilinson--Lusztig--MacPherson (BLM) \\cite{BLM}, and show that the natural algebra homomorphism $ζ_r$ from $\\mathbf{U}(\\infty)$ to the infinite $q$-Schur algebra ${\\boldsymbol{\\mathcal S}}(\\infty,r)$ is not surjective for any $r\\geq 1$. We will give a BLM type realization for the image $\\mathbf{U}(\\infty,r):=ζ_r(\\mathbf{U}(\\infty))$ and discuss its presentation in terms of generators and relations. We further construct a certain completion algebra $\\hat{\\boldsymbol{\\mathcal K}}^\\dagger(\\infty)$ so that $ζ_r$ can be extended to an algebra epimorphism $\\tildeζ_r:\\hat{\\boldsymbol{\\mathcal K}}^\\dagger(\\infty)\\to{\\boldsymbol{\\mathcal S}}(\\infty,r)$. Finally we will investigate the representation theory of ${\\bf U}(\\infty)$, especially the polynomial representations of ${\\bf U}(\\infty)$.",
    "authors": [
      "Jie Du",
      "Qiang Fu"
    ],
    "publication_date": "2007-08-19T05:24:47Z",
    "arxiv_id": "http://arxiv.org/abs/0708.2525v2",
    "download_url": "https://arxiv.org/abs/0708.2525v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On twisting of finite-dimensional Hopf algebras",
    "abstract": "In this paper we study the properties of Drinfeld's twisting for finite-dimensional Hopf algebras. We determine how the integral of the dual to a unimodular Hopf algebra $H$ changes under twisting of $H$. We show that the classes of cosemisimple unimodular, cosemisimple involutive, cosemisimple quasitriangular finite-dimensional Hopf algebras are stable under twisting. We also prove the cosemisimplicity of a coalgebra obtained by twisting of a cosemisimple unimodular Hopf algebra by two different twists on two sides (such twists are closely related to biGalois extensions), and describe the representation theory of its dual. Next, we define the notion of a non-degenerate twist for a Hopf algebra $H$, and set up a bijection between such twists for $H$ and $H^*$. This bijection is based on Miyashita-Ulbrich actions of Hopf algebras on simple algebras. It generalizes to the non-commutative case the procedure of inverting a non-degenerate skew-symmetric bilinear form on a vector space. Finally, we apply these results to classification of twists in group algebras and of cosemisimple triangular finite-dimensional Hopf algebras in positive characteristic, generalizing the previously known classification in characteristic zero.",
    "authors": [
      "Eli Aljadeff",
      "Pavel Etingof",
      "Shlomo Gelaki",
      "Dmitri Nikshych"
    ],
    "publication_date": "2001-07-23T21:11:21Z",
    "arxiv_id": "http://arxiv.org/abs/math/0107167v2",
    "download_url": "https://arxiv.org/abs/math/0107167v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Alternative algebras with the hyperbolic property",
    "abstract": "We investigate the structure of an alternative finite dimensional $\\Q$-algebra $\\mathfrak{A}$ subject to the condition that for a $\\Z$-order $Γ\\subset \\mathfrak{A}$, and thus for every $\\Z$-order of $\\mathfrak{A}$, the loop of units of $\\U (Γ)$ does not contain a free abelian subgroup of rank two. In particular, we prove that the radical of such an algebra associates with the whole algebra. We also classify $RA$-loops $L$ for which $\\mathbb{Z}L$ has this property. The classification for group rings is still an open problem.",
    "authors": [
      "S. O. Juriaans",
      "C. Polcino Milies",
      "A. C. Souza Filho"
    ],
    "publication_date": "2008-10-24T22:52:36Z",
    "arxiv_id": "http://arxiv.org/abs/0810.4544v6",
    "download_url": "https://arxiv.org/abs/0810.4544v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards constructing one-particle representations of the deformed Poincaré algebra",
    "abstract": "We give a method for obtaining states of massive particle representations of the two-parameter deformation of the Poincaré algebra proposed in q-alg/9601010, q-alg/9505030 and q-alg/9501026. We discuss four procedures to generate eigenstates of a complete set of commuting operators starting from the rest state. One result of this work is the fact that upon deforming to the quantum Poincaré algebra the rest state is split into an infinite number of states. Another result is that the energy spectrum of these states is discrete. Some curious residual degeneracy remains: there are states constructed by applying different operators to the rest state which nevertheless are indistinguishable by eigenvalues of all the observables in the algebra.",
    "authors": [
      "I. Yakushin"
    ],
    "publication_date": "1997-03-05T17:20:51Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9703008v2",
    "download_url": "https://arxiv.org/abs/q-alg/9703008v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Boolean Algebras",
    "abstract": "We introduce quantum Boolean algebras which are the analogue of the Weyl algebras for Boolean affine spaces. We study quantum Boolean algebras from the logical and set theoretical viewpoints.",
    "authors": [
      "Rafael Diaz"
    ],
    "publication_date": "2010-11-23T20:45:49Z",
    "arxiv_id": "http://arxiv.org/abs/1011.5215v4",
    "download_url": "https://arxiv.org/abs/1011.5215v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deformation Theory of Infinity Algebras",
    "abstract": "This work explores the deformation theory of algebraic structures in a very general setting. These structures include commutative, associative algebras, Lie algebras, and the infinity versions of these structures, the strongly homotopy associative and Lie algebras. In all these cases the algebra structure is determined by an element of a certain graded Lie algebra which plays the role of a differential on this algebra. We work out the deformation theory in terms of the Lie algebra of coderivations of an appropriate coalgebra structure and construct a universal infinitesimal deformation as well as a miniversal formal deformation. By working at this level of generality, the main ideas involved in deformation theory stand out more clearly.",
    "authors": [
      "Alice Fialowski",
      "Michael Penkava"
    ],
    "publication_date": "2001-01-11T10:57:09Z",
    "arxiv_id": "http://arxiv.org/abs/math/0101097v1",
    "download_url": "https://arxiv.org/abs/math/0101097v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite vertex algebras and nilpotence",
    "abstract": "I show that simple finite vertex algebras are commutative, and that the Lie conformal algebra structure underlying a reduced (i.e., without nilpotent elements) finite vertex algebra is nilpotent.",
    "authors": [
      "Alessandro D'Andrea"
    ],
    "publication_date": "2007-07-27T18:32:23Z",
    "arxiv_id": "http://arxiv.org/abs/0707.4160v1",
    "download_url": "https://arxiv.org/abs/0707.4160v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Center of the quantum affine vertex algebra in type A",
    "abstract": "We consider the quantum vertex algebra associated with the double Yangian in type A as defined by Etingof and Kazhdan. We show that its center is a commutative associative algebra and construct algebraically independent families of topological generators of the center at the critical level.",
    "authors": [
      "Naihuan Jing",
      "Slaven Kožić",
      "Alexander Molev",
      "Fan Yang"
    ],
    "publication_date": "2016-03-01T11:24:24Z",
    "arxiv_id": "http://arxiv.org/abs/1603.00237v2",
    "download_url": "https://arxiv.org/abs/1603.00237v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shuffle algebras for quivers and wheel conditions",
    "abstract": "We show that the shuffle algebra associated to a doubled quiver (determined by 3-variable wheel conditions) is generated by elements of minimal degree. Together with results of Varagnolo-Vasserot and Yu Zhao, this implies that the aforementioned shuffle algebra is isomorphic to the localized K-theoretic Hall algebra associated to the quiver by Schiffmann-Vasserot. With small modifications, our theorems also hold under certain specializations of the equivariant parameters, which will allow us in Neguţ-Sala-Schiffmann to give a generators-and-relations description of the Hall algebra of any curve over a finite field (which is a shuffle algebra due to Kapranov-Schiffmann-Vasserot). When the quiver has no edge loops or multiple edges, we show that the shuffle algebra, localized K-theoretic Hall algebra, and the positive half of the corresponding quantum loop group are all isomorphic; we also obtain the non-degeneracy of the Hopf pairing on the latter quantum loop group.",
    "authors": [
      "Andrei Neguţ"
    ],
    "publication_date": "2021-08-19T16:40:21Z",
    "arxiv_id": "http://arxiv.org/abs/2108.08779v5",
    "download_url": "https://arxiv.org/abs/2108.08779v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cancellation properties of graded and nonunital rings. Graded clean and graded exchange Leavitt path algebras",
    "abstract": "Various authors have been generalizing some unital ring properties to nonunital rings. We consider properties related to cancellation of modules (being unit-regular, having stable range one, being directly finite, exchange, or clean) and their \"local\" versions. We explore their relationships and extend the defined concepts to graded rings. With graded clean and graded exchange rings suitably defined, we study how these properties behave under the formation of graded matrix rings. We exhibit properties of a graph $E$ which are equivalent to the unital Leavitt path algebra $L_K(E)$ being graded clean. We also exhibit some graph properties which are necessary and some which are sufficient for $L_K(E)$ to be graded exchange.",
    "authors": [
      "Lia Vas"
    ],
    "publication_date": "2021-06-22T19:45:57Z",
    "arxiv_id": "http://arxiv.org/abs/2106.12031v2",
    "download_url": "https://arxiv.org/abs/2106.12031v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite dimensional Hopf algebras over the dual group algebra of the symmetric group in three letters",
    "abstract": "We classify finite-dimensional Hopf algebras whose coradical is isomorphic to the algebra of functions on S_3. We describe a new infinite family of Hopf algebras of dimension 72.",
    "authors": [
      "N. Andruskiewitsch",
      "C. Vay"
    ],
    "publication_date": "2010-10-28T13:08:40Z",
    "arxiv_id": "http://arxiv.org/abs/1010.5953v2",
    "download_url": "https://arxiv.org/abs/1010.5953v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An isomorphism between the fusion algebras of $V_L^+$ and type $D^{(1)}$ level 2",
    "abstract": "The fusion algebra of the vertex operator algebra $V_L^+$ for a rank 1 even lattice $L$ is explicitly shown to be isomorphic to the fusion algebra of the Kac-Moody algebra of type $D^{(1)}$ at level 2 in almost all cases.",
    "authors": [
      "Michael Cuntz",
      "Christopher Goff"
    ],
    "publication_date": "2008-09-30T12:39:30Z",
    "arxiv_id": "http://arxiv.org/abs/0809.5186v2",
    "download_url": "https://arxiv.org/abs/0809.5186v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hopf actions of some quantum groups on path algebras",
    "abstract": "Our first collection of results parametrize (filtered) actions of a quantum Borel $U_q(\\mathfrak{b}) \\subset U_q(\\mathfrak{sl}_2)$ on the path algebra of an arbitrary (finite) quiver. When $q$ is a root of unity, we give necessary and sufficient conditions for these actions to factor through corresponding finite-dimensional quotients, generalized Taft algebras $T(r,n)$ and small quantum groups $U_q(\\mathfrak{sl}_2)$.\n  In the second part of the paper, we shift to the language of tensor categories. Here we consider a quiver path algebra equipped with an action of a Hopf algebra $H$ to be a tensor algebra in the tensor category of representations $H$. Such a tensor algebra is generated by an algebra and bimodule in this tensor category. Our second collection of results describe the corresponding bimodule categories via an equivalence with categories of representations of certain explicitly described quivers with relations.",
    "authors": [
      "Ryan Kinser",
      "Amrei Oswald"
    ],
    "publication_date": "2020-10-28T19:37:11Z",
    "arxiv_id": "http://arxiv.org/abs/2010.15197v1",
    "download_url": "https://arxiv.org/abs/2010.15197v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Geometric Classification of the Holomorphic Vertex Operator Algebras of Central Charge 24",
    "abstract": "We associate with a generalised deep hole of the Leech lattice vertex operator algebra a generalised hole diagram. We show that this Dynkin diagram determines the generalised deep hole up to conjugacy and that there are exactly 70 such diagrams. In an earlier work we proved a bijection between the generalised deep holes and the strongly rational, holomorphic vertex operator algebras of central charge 24 with non-trivial weight-1 space. Hence, we obtain a new, geometric classification of these vertex operator algebras, generalising the classification of the Niemeier lattices by their hole diagrams.",
    "authors": [
      "Sven Möller",
      "Nils R. Scheithauer"
    ],
    "publication_date": "2021-12-23T00:53:08Z",
    "arxiv_id": "http://arxiv.org/abs/2112.12291v2",
    "download_url": "https://arxiv.org/abs/2112.12291v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Hopf algebras over the unique $12$-dimensional Hopf algebra without the dual Chevalley property",
    "abstract": "Let $\\mathds{k}$ be an algebraically closed field of characteristic zero. We determine all finite-dimensional Hopf algebras over $\\mathds{k}$ whose Hopf coradical is isomorphic to the unique $12$-dimensional Hopf algebra $\\mathcal{C}$ without the dual Chevalley property, such that the diagrams are strictly graded and the corresponding infinitesimal braidings are indecomposable objects in ${}_{\\mathcal{C}}^{\\mathcal{C}}\\mathcal{YD}$. In particular, we obtain new Nichols algebras of dimension $18$ and $36$ and two families of new Hopf algebras of dimension $216$.",
    "authors": [
      "Rongchuan Xiong"
    ],
    "publication_date": "2017-12-03T19:53:17Z",
    "arxiv_id": "http://arxiv.org/abs/1712.00826v2",
    "download_url": "https://arxiv.org/abs/1712.00826v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gerstenhaber-Schack and Hochschild cohomologies of Hopf algebras",
    "abstract": "We show that the Gerstenhaber-Schack cohomology of a Hopf algebra determines its Hochschild cohomology, and in particular its Gerstenhaber-Schack cohomological dimension bounds its Hochschild cohomological dimension, with equality of the dimensions when the Hopf algebra is cosemisimple of Kac type. Together with some general considerations on free Yetter-Drinfeld modules over adjoint Hopf subalgebras and the monoidal invariance of Gerstenhaber-Schack cohomology, this is used to show that both Gerstenhaber-Schack and Hochschild cohomological dimensions of the coordinate algebra of the quantum permutation group are 3.",
    "authors": [
      "Julien Bichon"
    ],
    "publication_date": "2014-11-07T15:04:47Z",
    "arxiv_id": "http://arxiv.org/abs/1411.1942v3",
    "download_url": "https://arxiv.org/abs/1411.1942v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A generalized Kac-Moody algebra of rank 14",
    "abstract": "We construct a vertex algebra of central charge 26 from a lattice orbifold vertex operator algebra of central charge 12. The BRST-cohomology group of this vertex algebra is a new generalized Kac-Moody algebra of rank 14. We determine its root space multiplicities and a set of simple roots.",
    "authors": [
      "Gerald Hoehn",
      "Nils R. Scheithauer"
    ],
    "publication_date": "2010-09-27T04:14:24Z",
    "arxiv_id": "http://arxiv.org/abs/1009.5153v2",
    "download_url": "https://arxiv.org/abs/1009.5153v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "When is there a unique socle-vector associated to a given $h$-vector?",
    "abstract": "First, we construct a bijection between the set of $h$-vectors and the set of socle-vectors of artinian algebras. As a corollary, we find the minimum codimension that an artinian algebra with a given socle-vector can have. Then, we study the main problem in the paper: determining when there is a unique socle-vector for a given $h$-vector. We solve the problem completely if the codimension is at most 3.",
    "authors": [
      "Fabrizio Zanello"
    ],
    "publication_date": "2004-11-10T15:12:52Z",
    "arxiv_id": "http://arxiv.org/abs/math/0411229v2",
    "download_url": "https://arxiv.org/abs/math/0411229v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal enveloping algebras and universal derivations of Poisson algebras",
    "abstract": "Let $k$ be an arbitrary field of characteristic $0$. It is shown that for any $n\\geq 1$ the universal enveloping algebras of the Poisson symplectic algebra $P_n(k)$ and the Weyl algebra $A_n(k)$ are isomorphic and the canonical isomorphism between them easily leads to the Moyal product.\n  A basis of the universal enveloping algebra $P^e$ of a free Poisson algebra $P=k\\{x_1,...,x_n\\}$ is constructed and proved that the left dependency of a finite number of elements of $P^e$ over $P^e$ is algorithmically recognizable. We prove that if two elements of a free Poisson algebra do not generate a free two generated subalgebra then they commute. The Fox derivatives on free Poisson algebras are defined and it is proved that an analogue of the Jacobian Conjecture for two generated free Poisson algebras is equivalent to the two-dimensional classical Jacobian Conjecture. A new proof of the tameness of automorphisms of two generated free Poisson algebras is also given.",
    "authors": [
      "Ualbai Umirbaev"
    ],
    "publication_date": "2011-02-02T05:58:39Z",
    "arxiv_id": "http://arxiv.org/abs/1102.0366v1",
    "download_url": "https://arxiv.org/abs/1102.0366v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Vertex operator algebras associated to type B affine Lie algebras on admissible half-integer levels",
    "abstract": "Let L(n-l+1/2,0) be the vertex operator algebra associated to an affine Lie algebra of type B_l^(1) at level n-l+1/2, for a positive integer n. We classify irreducible L(n-l+1/2,0)-modules and show that every L(n-l+1/2,0)-module is completely reducible. In the special case n=1, we study a category of weak L(-l+3/2,0)-modules which are in the category $\\cal{O}$ as modules for the associated affine Lie algebra. We classify irreducible objects in that category and prove semisimplicity of that category.",
    "authors": [
      "Ozren Perse"
    ],
    "publication_date": "2005-12-06T16:04:18Z",
    "arxiv_id": "http://arxiv.org/abs/math/0512129v2",
    "download_url": "https://arxiv.org/abs/math/0512129v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New quantum toroidal algebras from 5D $\\mathcal{N}=1$ instantons on orbifolds",
    "abstract": "Quantum toroidal algebras are obtained from quantum affine algebras by a further affinization, and, like the latter, can be used to construct integrable systems. These algebras also describe the symmetries of instanton partition functions for 5D $\\mathcal{N}=1$ supersymmetric quiver gauge theories. We consider here the gauge theories defined on an orbifold $S^1\\times\\mathbb{C}^2/\\mathbb{Z}_p$ where the action of $\\mathbb{Z}_p$ is determined by two integer parameters $(ν_1,ν_2)$. The corresponding quantum toroidal algebra is introduced as a deformation of the quantum toroidal algebra of $\\mathfrak{gl}(p)$. We show that it has the structure of a Hopf algebra, and present two representations, called vertical and horizontal, obtained by deforming respectively the Fock representation and Saito's vertex representations of the quantum toroidal algebra of $\\mathfrak{gl}(p)$. We construct the vertex operator intertwining between these two types of representations. This object is identified with a $(ν_1,ν_2)$-deformation of the refined topological vertex, allowing us to reconstruct the Nekrasov partition function and the $qq$-characters of the quiver gauge theories.",
    "authors": [
      "Jean-Emile Bourgine",
      "Saebyeok Jeong"
    ],
    "publication_date": "2019-06-04T17:57:27Z",
    "arxiv_id": "http://arxiv.org/abs/1906.01625v3",
    "download_url": "https://arxiv.org/abs/1906.01625v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Central extensions and conformal derivations of a class of Lie conformal algebras",
    "abstract": "A quadratic Lie conformal algebra corresponds to a Hamiltonian pair in \\cite{GD}, which plays fundamental roles in completely integrable systems. Moreover, it also corresponds to certain compatible pairs of a Lie algebra and a Novikov algebra which was called Gel'fand-Dorfman bialgebra by Xu in \\cite{X1}. In this paper, central extensions and conformal derivations of quadratic Lie conformal algebras are studied in terms of Gel'fand-Dorfman bialgebras. It is shown that central extensions and conformal derivations of a quadratic Lie conformal algebra are related with some bilinear forms and some operators of the corresponding Gel'fand-Dorfman bialgebra respectively.",
    "authors": [
      "Yanyong Hong"
    ],
    "publication_date": "2015-02-10T03:49:34Z",
    "arxiv_id": "http://arxiv.org/abs/1502.02770v5",
    "download_url": "https://arxiv.org/abs/1502.02770v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Zhedanov's Algebra AW(3) and the Double Affine Hecke Algebra in the Rank One Case. II. The Spherical Subalgebra",
    "abstract": "This paper builds on the previous paper arXiv:math/0612730 by the author, where a relationship between Zhedanov's algebra AW(3) and the double affine Hecke algebra (DAHA) corresponding to the Askey-Wilson polynomials was established. It is shown here that the spherical subalgebra of this DAHA is isomorphic to AW(3) with an additional relation that the Casimir operator equals an explicit constant. A similar result with q-shifted parameters holds for the antispherical subalgebra. Some theorems on centralizers and centers for the algebras under consideration will finally be proved as corollaries of the characterization of the spherical and antispherical subalgebra.",
    "authors": [
      "Tom H. Koornwinder"
    ],
    "publication_date": "2007-11-14T23:58:24Z",
    "arxiv_id": "http://arxiv.org/abs/0711.2320v3",
    "download_url": "https://arxiv.org/abs/0711.2320v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the universal enveloping algebra of a Lie-Rinehart algebra",
    "abstract": "We review the extent to which the universal enveloping algebra of a Lie-Rinehart algebra resembles a Hopf algebra, and refer to this structure as a Rinehart bialgebra. We then prove a Cartier-Milnor-Moore type theorem for such Rinehart bialgebras.",
    "authors": [
      "I. Moerdijk",
      "J. Mrcun"
    ],
    "publication_date": "2008-01-25T12:17:23Z",
    "arxiv_id": "http://arxiv.org/abs/0801.3929v2",
    "download_url": "https://arxiv.org/abs/0801.3929v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chevalley bases for elliptic extended affine Lie algebras of type $A_1$",
    "abstract": "We investigate Chevalley bases for extended affine Lie algebras of type $A_1$.The concept of integral structures for extended affine Lie algebras of rank greater than one has been successfully explored in recent years. However, for the rank one it has turned out that the situation becomes more delicate. In this work, we consider $A_1$-type extended affine Lie algebras of {nullity} $2$, known as elliptic extended affine Lie algebras. These Lie algebras are build using the Tits-Kantor-Koecher (TKK) construction by applying some specific Jordan algebras: the plus algebra of a quantum torus, the Hermitian Jordan algebra of the ring of Laurent polynomials equipped with an involution, and the Jordan algebra associated with a semilattice. By examining these ingredient we determine appropriate bases for null spaces of the corresponding elliptic extended affine Lie algebra leading to the establishment of Chevalley bases for these Lie algebras.",
    "authors": [
      "Saeid Azam"
    ],
    "publication_date": "2025-07-14T09:07:21Z",
    "arxiv_id": "http://arxiv.org/abs/2507.10081v1",
    "download_url": "https://arxiv.org/abs/2507.10081v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Monoidal Morita invariants for finite group algebras",
    "abstract": "Two Hopf algebras are called monoidally Morita equivalent if module categories over them are equivalent as linear monoidal categories. We introduce monoidal Morita invariants for finite-dimensional Hopf algebras based on certain braid group representations arising from the Drinfeld double construction. As an application, we show, for any integer $n$, the number of elements of order $n$ is a monoidal Morita invariant for finite group algebras. We also describe relations between our construction and invariants of closed 3-manifolds due to Reshetikhin and Turaev.",
    "authors": [
      "Kenichi Shimizu"
    ],
    "publication_date": "2009-05-08T07:49:31Z",
    "arxiv_id": "http://arxiv.org/abs/0905.1185v2",
    "download_url": "https://arxiv.org/abs/0905.1185v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generalized parafermions of orthogonal type",
    "abstract": "There is an embedding of affine vertex algebras $V^k(\\mathfrak{gl}_n) \\hookrightarrow V^k(\\mathfrak{sl}_{n+1})$, and the coset $\\mathcal{C}^k(n) = \\text{Com}(V^k(\\mathfrak{gl}_n), V^k(\\mathfrak{sl}_{n+1}))$ is a natural generalization of the parafermion algebra of $\\mathfrak{sl}_2$. It was called the algebra of generalized parafermions by the third author and was shown to arise as a one-parameter quotient of the universal two-parameter $\\mathcal{W}_{\\infty}$-algebra of type $\\mathcal{W}(2,3,\\dots)$. In this paper, we consider an analogous structure of orthogonal type, namely $\\mathcal{D}^k(n) = \\text{Com}(V^k(\\mathfrak{so}_{2n}), V^k(\\mathfrak{so}_{2n+1}))^{\\mathbb{Z}_2}$. We realize this algebra as a one-parameter quotient of the two-parameter even spin $\\mathcal{W}_{\\infty}$-algebra of type $\\mathcal{W}(2,4,\\dots)$, and we classify all coincidences between its simple quotient $\\mathcal{D}_k(n)$ and the algebras $\\mathcal{W}_{\\ell}(\\mathfrak{so}_{2m+1})$ and $\\mathcal{W}_{\\ell}(\\mathfrak{so}_{2m})^{\\mathbb{Z}_2}$. As a corollary, we show that for the admissible levels $k = -(2n-2) + \\frac{1}{2} (2 n + 2 m -1)$ for $\\widehat{\\mathfrak{so}}_{2n}$ the simple affine algebra $L_k(\\mathfrak{so}_{2n})$ embeds in $L_k(\\mathfrak{so}_{2n+1})$, and the coset is strongly rational. As a consequence, the category of ordinary modules of $L_k(\\mathfrak{so}_{2n+1})$ at such a level is a braided fusion category.",
    "authors": [
      "Thomas Creutzig",
      "Vladimir Kovalchuk",
      "Andrew R. Linshaw"
    ],
    "publication_date": "2020-10-05T19:49:07Z",
    "arxiv_id": "http://arxiv.org/abs/2010.02303v2",
    "download_url": "https://arxiv.org/abs/2010.02303v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generalised Taft algebras and pairs in involution",
    "abstract": "A class of finite-dimensional Hopf algebras which generalise the notion of Taft algebras is studied. We give necessary and sufficient conditions for these Hopf algebras to omit a pair in involution, that is, to not have a group-like and a character implementing the square of the antipode. As a consequence we prove the existence of an infinite set of examples of finite-dimensional Hopf algebras without such pairs. This has implications for the theory of anti-Yetter-Drinfeld modules as well as biduality of representations of Hopf algebras.\n  This article has been accepted for publication in Communications in Algebra, published by Taylor & Francis.",
    "authors": [
      "Sebastian Halbig"
    ],
    "publication_date": "2019-08-28T14:37:29Z",
    "arxiv_id": "http://arxiv.org/abs/1908.10750v3",
    "download_url": "https://arxiv.org/abs/1908.10750v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Integro-Differential Algebras",
    "abstract": "The concept of integro-differential algebra has been introduced recently in the study of boundary problems of differential equations. We generalize this concept to that of integro-differential algebra with a weight, in analogy to the differential Rota-Baxter algebra. We construct free commutative integro-differential algebras with weight generated by a base differential algebra. This in particular gives an explicit construction of the integro-differential algebra on one generator. Properties of these free objects are studied.",
    "authors": [
      "Li Guo",
      "Georg Regensburger",
      "Markus Rosenkranz"
    ],
    "publication_date": "2012-12-03T00:47:03Z",
    "arxiv_id": "http://arxiv.org/abs/1212.0266v1",
    "download_url": "https://arxiv.org/abs/1212.0266v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lifting preprojective algebras to orders and categorifying partial flag varieties",
    "abstract": "We describe a categorification of the cluster algebra structure of multi-homogeneous coordinate rings of partial flag varieties of arbitrary Dynkin type using Cohen-Macaulay modules over orders. This completes the categorification of Geiss-Leclerc-Schröer by adding the missing coefficients. To achieve this, for an order $A$ and an idempotent $e \\in A$, we introduce a subcategory $\\operatorname{CM}\\nolimits_e A$ of $\\operatorname{CM}\\nolimits A$ and study its properties. In particular, under some mild assumptions, we construct an equivalence of exact categories $(\\operatorname{CM}\\nolimits_e A)/[Ae] \\cong \\operatorname{Sub}\\nolimits Q$ for an injective $B$-module $Q$ where $B := A/(e)$. These results generalize work by Jensen-King-Su concerning the cluster algebra structure of the Grassmannian $\\operatorname{Gr}\\nolimits_m(\\mathbb{C}^n)$.",
    "authors": [
      "Laurent Demonet",
      "Osamu Iyama"
    ],
    "publication_date": "2015-03-09T02:46:01Z",
    "arxiv_id": "http://arxiv.org/abs/1503.02362v3",
    "download_url": "https://arxiv.org/abs/1503.02362v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Duals of pointed Hopf algebras",
    "abstract": "This paper studies the duals of some finite dimensional pointed Hopf algebras, with abelian group of grouplikes, over an algebraically closed field of characteristic 0, which are either Radford biproducts or else nontrivial liftings of a biproduct.",
    "authors": [
      "M. Beattie"
    ],
    "publication_date": "2002-02-10T23:31:13Z",
    "arxiv_id": "http://arxiv.org/abs/math/0202091v4",
    "download_url": "https://arxiv.org/abs/math/0202091v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Techniques for classifying Hopf algebras and applications to dimension p^3",
    "abstract": "The classification of all Hopf algebras of a given finite dimension over an algebraically closed field of characteristic 0 is a difficult problem. If the dimension is a prime, then the Hopf algebra is a group algebra. If the dimension is the square of a prime then the Hopf algebra is a group algebra or a Taft Hopf algebra. The classification is also complete for dimension 2p or 2p^2, p a prime. Partial results for some other cases are available. For example, for dimension p^3 the classification of the semisimple Hopf algebras was done by Masuoka, and the pointed Hopf algebras were classified by Andruskiewitsch and Schneider, Caenepeel and Dascalescu, and Stefan and van Oystaeyen independently. Many classification results for the nonsemisimple, nonpointed, non-copointed case have been proved by the second author but the classification in general for dimension p^3 is still incomplete, up to now even for dimension 27.\n  In this paper we outline some results and techniques which have been useful in approaching this problem and add a few new ones. We give some further results on Hopf algebras of dimension p^3 and finish the classification for dimension 27.",
    "authors": [
      "Margaret Beattie",
      "Gaston Andres Garcia"
    ],
    "publication_date": "2011-08-30T19:02:39Z",
    "arxiv_id": "http://arxiv.org/abs/1108.6037v1",
    "download_url": "https://arxiv.org/abs/1108.6037v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lattice structure of modular vertex algebras",
    "abstract": "In this paper we study the integral form of the lattice vertex algebra $V_L$. We show that divided powers of general vertex operators preserve the integral lattice spanned by Schur functions indexed by partition-valued functions. We also show that the Garland operators, counterparts of divided powers of Heisenberg elements in affine Lie algebras, also preserve the integral form. These construe analogs of the Kostant $\\mathbb Z$-forms for the enveloping algebras of simple Lie algebras and the algebraic affine Lie groups in the situation of the lattice vertex algebras.",
    "authors": [
      "Haihua Huang",
      "Naihuan Jing"
    ],
    "publication_date": "2021-04-12T06:25:51Z",
    "arxiv_id": "http://arxiv.org/abs/2104.05223v4",
    "download_url": "https://arxiv.org/abs/2104.05223v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Semisimple weak Hopf algebras",
    "abstract": "We develop the theory of semisimple weak Hopf algebras and obtain analogues of a number of classical results for ordinary semisimple Hopf algebras. We prove a criterion for semisimplicity and analyze the square of the antipode S^2 of a semisimple weak Hopf algebra A. We explain how the Frobenius-Perron dimensions of irreducible A-modules and eigenvalues of S^2 can be computed using the inclusion matrix associated to A. A trace formula of Larson and Radford is extended to a relation between the global and Frobenius-Perron dimensions of A. Finally, an analogue of the Class Equation of Kac and Zhu is established and properties of $A$-module algebras and their dimensions are studied.",
    "authors": [
      "Dmitri Nikshych"
    ],
    "publication_date": "2003-04-07T20:45:45Z",
    "arxiv_id": "http://arxiv.org/abs/math/0304098v3",
    "download_url": "https://arxiv.org/abs/math/0304098v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bicrossproduct approach to the Connes-Moscovici Hopf algebra",
    "abstract": "We give a rigorous proof that the (codimension one) Connes-Moscovici Hopf algebra H_CM is isomorphic to a bicrossproduct Hopf algebra linked to a group factorisation of the group of positively-oriented diffeomorphisms of the real line. We construct a second bicrossproduct U_CM equipped with a nondegenerate dual pairing with H_CM. We give a natural quotient Hopf algebra of H_CM and Hopf subalgebra of U_CM which again are in duality. All these Hopf algebras arise as deformations of commutative or cocommutative Hopf algebras that we describe in each case. Finally we develop the noncommutative differential geometry of the quotient of H_CM by studying covariant first order differential calculi of small dimension over this algebra.",
    "authors": [
      "Tom Hadfield",
      "Shahn Majid"
    ],
    "publication_date": "2006-01-24T12:41:55Z",
    "arxiv_id": "http://arxiv.org/abs/math/0601581v2",
    "download_url": "https://arxiv.org/abs/math/0601581v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Dynkin diagram cohomology of finite Coxeter groups",
    "abstract": "Let D be a connected graph. The Dynkin complex CD(A) of a D-algebra A was introduced by the second author in [TL2] to control the deformations of quasi-Coxeter algebra structures on A. In the present paper, we study the cohomology of this complex when A is the group algebra of a Coxeter group W and D is the Dynkin diagram of W. We compute this cohomology when W is finite and prove in particular the rigidity of quasi-Coxeter algebra structures on kW. For an arbitrary W, we compute the top cohomology group and obtain a number of additional partial results when W is affine. Our computations are carried out by filtering CD(A) by the number of vertices of subgraphs of D. The corresponding graded complex turns out to be dual to the sum of the Coxeter complexes of all standard, irreducible parabolic subgroups of W.",
    "authors": [
      "R. Rouquier",
      "V. Toledano-Laredo"
    ],
    "publication_date": "2008-04-07T02:19:24Z",
    "arxiv_id": "http://arxiv.org/abs/0804.0947v2",
    "download_url": "https://arxiv.org/abs/0804.0947v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On generators and relations for higher level Zhu algebras and applications",
    "abstract": "We give some general results about the generators and relations for the higher level Zhu algebras for a vertex operator algebra. In particular, for any element $u$ in a vertex operator algebra $V$, such that $u$ has weight greater than or equal to $-n$ for $n \\in \\mathbb{N}$, we prove a recursion relation in the $n$th level Zhu algebra $A_n(V)$ and give a closed formula for this relation. We use this and other properties of $A_n(V)$ to reduce the modes of $u$ that appear in the generators for $A_n(V)$ as long as $u \\in V$ has certain properties (properties that apply, for instance, to the conformal vector for any vertex operator algebra or if $u$ generates a Heisenberg vertex subalgebra), and we then prove further relations in $A_n(V)$ involving such an element $u$. We present general techniques that can be applied once a set of reasonable generators is determined for $A_n(V)$ to aid in determining the relations of those generators, such as using the relations of those generators in the lower level Zhu algebras and the zero mode actions on $V$-modules induced from those lower level Zhu algebras. We prove that the condition that $(L(-1) + L(0))v$ acts as zero in $A_n(V)$ for $n \\in \\mathbb{Z}_+$ and for all $v$ in $V$ is a necessary added condition in the definition of the Zhu algebra at level higher than zero. We discuss how these results on generators and relations apply to the level $n$ Zhu algebras for the Heisenberg vertex operator algebra and the Virasoro vertex operator algebras at any level $n \\in \\mathbb{N}$.",
    "authors": [
      "Darlayne Addabbo",
      "Katrina Barron"
    ],
    "publication_date": "2021-10-14T19:04:14Z",
    "arxiv_id": "http://arxiv.org/abs/2110.07671v2",
    "download_url": "https://arxiv.org/abs/2110.07671v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Embeddings of vertex operator algebras associated to orthogonal affine Lie algebras",
    "abstract": "Let $L_{D_{\\ell}}(-\\ell +{3/2},0)$ (resp. $L_{B_{\\ell}}(-\\ell +{3/2},0)$) be the simple vertex operator algebra associated to affine Lie algebra of type $D_{\\ell}^{(1)}$ (resp. $B_{\\ell}^{(1)}$) with the lowest admissible half-integer level $-\\ell + {3/2}$. We show that $L_{D_{\\ell}}(-\\ell +{3/2},0)$ is a vertex subalgebra of $L_{B_{\\ell}}(-\\ell +{3/2},0)$ with the same conformal vector. For $\\ell =4$, $L_{D_{4}}(-{5/2},0)$ is a vertex subalgebra of three copies of $L_{B_{4}}(-{5/2},0)$ contained in $L_{F_{4}}(-{5/2},0)$, and all five of these vertex operator algebras have the same conformal vector.",
    "authors": [
      "Ozren Perse"
    ],
    "publication_date": "2008-10-10T21:38:44Z",
    "arxiv_id": "http://arxiv.org/abs/0810.1971v2",
    "download_url": "https://arxiv.org/abs/0810.1971v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Operator algebras in rigid C*-tensor categories",
    "abstract": "In this article, we define operator algebras internal to a rigid C*-tensor category $\\mathcal{C}$. A C*/W*-algebra object in $\\mathcal{C}$ is an algebra object $\\mathbf{A}$ in $\\operatorname{ind}$-$\\mathcal{C}$ whose category of free modules ${\\sf FreeMod}_{\\mathcal{C}}(\\mathbf{A})$ is a $\\mathcal{C}$-module C*/W*-category respectively. When $\\mathcal{C}={\\sf Hilb_{f.d.}}$, the category of finite dimensional Hilbert spaces, we recover the usual notions of operator algebras.\n  We generalize basic representation theoretic results, such as the Gelfand-Naimark and von Neumann bicommutant theorems, along with the GNS construction. We define the notion of completely positive maps between C*-algebra objects in $\\mathcal{C}$ and prove the analog of the Stinespring dilation theorem.\n  As an application, we discuss approximation and rigidity properties, including amenability, the Haagerup property, and property (T) for a connected W*-algebra $\\mathbf{M}$ in $\\mathcal{C}$. Our definitions simultaneously unify the definitions of analytic properties for discrete quantum groups and rigid C*-tensor categories.",
    "authors": [
      "Corey Jones",
      "David Penneys"
    ],
    "publication_date": "2016-11-14T21:08:12Z",
    "arxiv_id": "http://arxiv.org/abs/1611.04620v2",
    "download_url": "https://arxiv.org/abs/1611.04620v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cocycle deformations and Galois objects for semisimple Hopf algebras of dimension $p^3$ and $pq^2$",
    "abstract": "Let $p$ and $q$ be distinct prime numbers. We study the Galois objects and cocycle deformations of the noncommutative, noncocommutative, semisimple Hopf algebras of odd dimension $p^3$ and of dimension $pq^2$. We obtain that the $p+1$ non-isomorphic self-dual semisimple Hopf algebras of dimension $p^3$ classified by Masuoka have no non-trivial cocycle deformations, extending his previous results for the 8-dimensional Kac-Paljutkin Hopf algebra. This is done as a consequence of the classification of categorical Morita equivalence classes among semisimple Hopf algebras of odd dimension $p^3$, established by the third-named author in an appendix.",
    "authors": [
      "Adriana Mejía Castaño",
      "Susan Montgomery",
      "Sonia Natale",
      "Maria D. Vega",
      "Chelsea Walton"
    ],
    "publication_date": "2016-10-12T18:14:01Z",
    "arxiv_id": "http://arxiv.org/abs/1610.03810v2",
    "download_url": "https://arxiv.org/abs/1610.03810v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebra Structures on Hom(C,L)",
    "abstract": "We consider the space of linear maps from a coassociative coalgebra C into a Lie algebra L. Unless C has a cocommutative coproduct, the usual symmetry properties of the induced bracket on Hom(C,L) fail to hold. We define the concept of twisted domain (TD) algebras in order to recover the symmetries and also construct a modified Chevalley-Eilenberg complex in order to define the cohomology of such algebras.",
    "authors": [
      "G. Barnich",
      "R. Fulp",
      "T. Lada",
      "J. Stasheff"
    ],
    "publication_date": "1999-06-23T15:48:46Z",
    "arxiv_id": "http://arxiv.org/abs/math/9906157v1",
    "download_url": "https://arxiv.org/abs/math/9906157v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On coquasitriangular pointed Majid algebras",
    "abstract": "We study coquasitriangular pointed Majid algebras via the quiver approaches. The class of Hopf quivers whose path coalgebras admit coquasitriangular Majid algebras is classified. The quiver setting for general coquasitriangular pointed Majid algebras is also provided. Through this, some examples and classification results are obtained.",
    "authors": [
      "Hua-Lin Huang",
      "Gongxiang Liu"
    ],
    "publication_date": "2010-02-02T15:59:58Z",
    "arxiv_id": "http://arxiv.org/abs/1002.0518v1",
    "download_url": "https://arxiv.org/abs/1002.0518v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A short construction of the Zhu algebra",
    "abstract": "We investigate associative quotients of vertex algebras. We also give a short construction of the Zhu algebra, and a proof of its associativity using elliptic functions.",
    "authors": [
      "Jethro van Ekeren",
      "Reimundo Heluani"
    ],
    "publication_date": "2018-03-30T18:18:19Z",
    "arxiv_id": "http://arxiv.org/abs/1804.00020v1",
    "download_url": "https://arxiv.org/abs/1804.00020v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Hopf algebras of dimension 4p",
    "abstract": "In this paper, we prove that a non-semisimple Hopf algebra H of dimension 4p with p an odd prime over an algebraically closed field of characteristic zero is pointed provided H contains more than two group-like elements. In particular, we prove that non-semisimple Hopf algebras of dimensions 20, 28 and 44 are pointed or their duals are pointed, and this completes the classification of Hopf algebras in these dimensions.",
    "authors": [
      "Yi-Lin Cheng",
      "Siu-Hung Ng"
    ],
    "publication_date": "2010-05-07T17:59:57Z",
    "arxiv_id": "http://arxiv.org/abs/1005.1267v2",
    "download_url": "https://arxiv.org/abs/1005.1267v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Noncommutative differential geometry on crossed product algebras",
    "abstract": "We provide a differential structure on arbitrary cleft extensions $B:=A^{\\mathrm{co}H}\\subseteq A$ for an $H$-comodule algebra $A$. This is achieved by constructing a covariant calculus on the corresponding crossed product algebra $B\\#_σH$ from the data of a bicovariant calculus on the structure Hopf algebra $H$ and a calculus on the base algebra $B$, which is compatible with the $2$-cocycle and measure of the crossed product. The result is a quantum principal bundle with canonical strong connection and we describe the induced bimodule covariant derivatives on associated bundles of the crossed product. It is proven that connections of the quantum principal bundle are in bijection with connection $1$-forms. All results specialize to trivial extensions and smash product algebras $B\\#H$ and we give a characterization of the smash product calculus in terms of the differentials of the cleaving map $j\\colon H\\to A$ and the inclusion $B\\hookrightarrow A$. The construction is exemplified for pointed Hopf algebras. In particular, the case of Radford Hopf algebras $H_{(r,n,q)}$ is spelled out in detail.",
    "authors": [
      "Andrea Sciandra",
      "Thomas Weber"
    ],
    "publication_date": "2023-08-28T15:46:31Z",
    "arxiv_id": "http://arxiv.org/abs/2308.14662v2",
    "download_url": "https://arxiv.org/abs/2308.14662v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On quiver-theoretic description for quasitriangularity of Hopf algebras",
    "abstract": "This paper is devoted to the study of the quasitriangularity of Hopf algebras via Hopf quiver approaches. We give a combinatorial description of the Hopf quivers whose path coalgebras give rise to coquasitriangular Hopf algebras. With a help of the quiver setting, we study general coquasitriangular pointed Hopf algebras and obtain a complete classification of the finite-dimensional ones over an algebraically closed field of characteristic 0.",
    "authors": [
      "Hua-Lin Huang",
      "Gongxiang Liu"
    ],
    "publication_date": "2009-10-11T14:35:43Z",
    "arxiv_id": "http://arxiv.org/abs/0910.2009v1",
    "download_url": "https://arxiv.org/abs/0910.2009v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-dimensional Nichols algebras over dual Radford algebras",
    "abstract": "For $n,m\\in \\mathbb{N}$, let $H_{n,m}$ be the dual of the Radford algebra of dimension $n^{2}m$. We present new finite-dimensional Nichols algebras arising from the study of simple Yetter-Drinfeld modules over $H_{n,m}$. Along the way, we describe the simple objects in ${}^{H_{n,m}}_{H_{n,m}}\\mathcal{YD}$ and their projective envelopes. Then, we determine those simple modules that give rise to finite-dimensional Nichols algebras for the case $n=2$. There are 18 possible cases. We present by generators and relations the corresponding Nichols algebras on five of these eighteen cases. As an application, we characterize finite-dimensional Nichols algebras over indecomposable modules for $n=2=m$ and $n=2$, $m=3$, which recovers some results of the second and third author in the former case, and of Xiong in the latter.",
    "authors": [
      "Dirceu Bagio",
      "Gastón A. García",
      "João M. J. Giraldi",
      "Oscar Márquez"
    ],
    "publication_date": "2019-10-11T20:57:25Z",
    "arxiv_id": "http://arxiv.org/abs/1910.05408v2",
    "download_url": "https://arxiv.org/abs/1910.05408v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hopf Algebras of Dimension $pq$",
    "abstract": "Let $H$ be a non-semisimple Hopf algebra with antipode $S$ of dimension $pq$ over an algebraically closed field of characteristic 0 where $p \\le q$ are odd primes. We prove that $\\Tr(S^{2p})=p^2d$ where $d \\equiv pq \\pmod{4}$. As a consequence, if $p,q$ are twin primes, then any Hopf algebra of dimension $pq$ is semisimple.",
    "authors": [
      "Siu-Hung Ng"
    ],
    "publication_date": "2003-04-12T02:16:15Z",
    "arxiv_id": "http://arxiv.org/abs/math/0304156v2",
    "download_url": "https://arxiv.org/abs/math/0304156v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Free modified Rota-Baxter algebras and Hopf algebras",
    "abstract": "The notion of a modified Rota-Baxter algebra comes from the combination of those of a Rota-Baxter algebra and a modified Yang-Baxter equation. In this paper, we first construct free modified Rota-Baxter algebras. We then equip a free modified Rota-Baxter algebra with a bialgebra structure by a cocycle construction. Under the assumption that the generating algebra is a connected bialgebra, we further equip the free modified Rota-Baxter algebra with a Hopf algebra structure.",
    "authors": [
      "Xigou Zhang",
      "Xing Gao",
      "Li Guo"
    ],
    "publication_date": "2019-01-09T18:44:21Z",
    "arxiv_id": "http://arxiv.org/abs/1901.02869v1",
    "download_url": "https://arxiv.org/abs/1901.02869v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The double algebraic view of finite quantum groupoids",
    "abstract": "This is an introduction to double algebras which is the structure modelled by the properties of the convolution product in Hopf algebras, weak Hopf algebras and in Hopf algebroids. We show that Hopf algebroids with a Frobenius integral can be characterized as the double algebras in which the two multiplications satisfy distributivity. We discuss questions of duality, antipode, Maschke theorem and examples.",
    "authors": [
      "Kornel Szlachanyi"
    ],
    "publication_date": "2004-02-10T03:19:45Z",
    "arxiv_id": "http://arxiv.org/abs/math/0402151v2",
    "download_url": "https://arxiv.org/abs/math/0402151v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic Quantum Mechanics and Pregeometry",
    "abstract": "We discuss the relation between the q-number approach to quantum mechanics suggested by Dirac and the notion of \"pregeometry\" introduced by Wheeler. By associating the q-numbers with the elements of an algebra and regarding the primitive idempotents as \"generalized points\" we suggest an approach that may make it possible to dispense with an a priori given space manifold. In this approach the algebra itself would carry the symmetries of translation, rotation, etc. Our suggestion is illustrated in a preliminary way by using a particular generalized Clifford Algebra proposed originally by Weyl, which approaches the ordinary Heisenberg algebra in a suitable limit. We thus obtain a certain insight into how quantum mechanics may be regarded as a purely algebraic theory, provided that we further introduce a new set of \"neighbourhood operators\", which remove an important kind of arbitrariness that has thus far been present in the attempt to treat quantum mechanics solely in terms of a Heisenberg algebra.",
    "authors": [
      "D. J. Bohm",
      "P. G. Davies",
      "B. J. Hiley"
    ],
    "publication_date": "2006-11-30T22:23:55Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0612002v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0612002v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Baxter Algebras and Differential Algebras",
    "abstract": "A Baxter algebra is a commutative algebra $A$ that carries a generalized integral operator. In the first part of this paper we review past work of Baxter, Miller, Rota and Cartier in this area and explain more recent work on explicit constructions of free Baxter algebras that extended the constructions of Rota and Cartier. In the second part of the paper we will use these explicit constructions to relate Baxter algebras to Hopf algebras and give applications of Baxter algebras to the umbral calculus in combinatorics.",
    "authors": [
      "Li Guo"
    ],
    "publication_date": "2004-07-10T18:06:18Z",
    "arxiv_id": "http://arxiv.org/abs/math/0407180v1",
    "download_url": "https://arxiv.org/abs/math/0407180v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A theory of tensor products for module categories for a vertex operator algebra, III",
    "abstract": "This is the third part in a series of papers developing a tensor product theory for modules for a vertex operator algebra. The goal of this theory is to construct a ``vertex tensor category'' structure on the category of modules for a suitable vertex operator algebra. The notion of vertex tensor category is essentially a ``complex analogue'' of the notion of symmetric tensor category, and in fact a vertex tensor category produces a braided tensor category in a natural way. In this paper, we focus on a particular element $P(z)$ of a certain moduli space of three-punctured Riemann spheres; in general, every element of this moduli space will give rise to a notion of tensor product, and one must consider all these notions in order to construct a vertex tensor category. Here we present the fundamental properties of the $P(z)$-tensor product of two modules for a vertex operator algebra. We give two constructions of a $P(z)$-tensor product, using the results, established in Parts I and II of this series, for a certain other element of the moduli space. The definitions and results in Part I (hep-th/9309076, which has been replaced by a new version with a greatly expanded introduction and updated references) and Part II (hep-th/9309159) are recalled.",
    "authors": [
      "Yi-Zhi Huang",
      "James Lepowsky"
    ],
    "publication_date": "1995-05-17T17:11:34Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9505018v2",
    "download_url": "https://arxiv.org/abs/q-alg/9505018v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Poincare-Birkhoff-Witt deformations of smash product algebras from Hopf actions on Koszul algebras",
    "abstract": "Let H be a Hopf algebra and let B be a Koszul H-module algebra. We provide necessary and sufficient conditions for a filtered algebra to be a Poincare-Birkhoff-Witt (PBW) deformation of the smash product algebra B#H. Many examples of these deformations are given.",
    "authors": [
      "Chelsea Walton",
      "Sarah Witherspoon"
    ],
    "publication_date": "2013-08-27T23:20:38Z",
    "arxiv_id": "http://arxiv.org/abs/1308.6011v4",
    "download_url": "https://arxiv.org/abs/1308.6011v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twisted algebras and Rota-Baxter type operators",
    "abstract": "We define the concept of weak pseudotwistor for an algebra $(A, μ)$ in a monoidal category $\\mathcal{C}$, as a morphism $T:A\\otimes A\\rightarrow A\\otimes A$ in $\\mathcal{C}$, satisfying some axioms ensuring that $(A, μ\\circ T)$ is also an algebra in $\\mathcal{C}$. This concept generalizes the previous proposal called pseudotwistor and covers a number of exemples of twisted algebras that cannot be covered by pseudotwistors, mainly examples provided by Rota-Baxter operators and some of their relatives (such as Leroux's TD-operators and Reynolds operators). By using weak pseudotwistors, we introduce an equivalence relation (called \"twist equivalence\") for algebras in a given monoidal category.",
    "authors": [
      "Florin Panaite",
      "Freddy Van Oystaeyen"
    ],
    "publication_date": "2015-02-18T18:14:36Z",
    "arxiv_id": "http://arxiv.org/abs/1502.05327v3",
    "download_url": "https://arxiv.org/abs/1502.05327v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generalized Hilbert-Kunz function of the Rees algebra of the face ring of a simplicial complex",
    "abstract": "Let $R$ be the face ring of a simplicial complex of dimension $d-1$ and ${\\mathcal R}(\\mathfrak{n})$ be the Rees algebra of the maximal homogeneous ideal $\\mathfrak{n}$ of $R.$ We show that the generalized Hilbert-Kunz function $HK(s)=\\ell({\\mathcal R}(\\mathfrak n)/(\\mathfrak n, \\mathfrak n t)^{[s]})$ is given by a polynomial for all large $s.$ We calculate it in many examples and also provide a Macaulay2 code for computing $HK(s).$",
    "authors": [
      "Arindam Banerjee",
      "Kriti Goel",
      "J. K. Verma"
    ],
    "publication_date": "2020-03-03T10:48:00Z",
    "arxiv_id": "http://arxiv.org/abs/2003.01438v2",
    "download_url": "https://arxiv.org/abs/2003.01438v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On irreducible characters of the Iwahori-Hecke algebra in type $A$",
    "abstract": "We use vertex operators to compute irreducible characters of the Iwahori-Hecke algebra of type $A$. Two general formulas are given for the irreducible characters in terms of those of the symmetric groups or the Iwahori-Hecke algebras in lower degrees. Explicit formulas are derived for the irreducible characters labeled by hooks and two-row partitions. Using duality, we also formulate a determinant type Murnaghan-Nakayama formula and give another proof of Ram's combinatorial Murnaghan-Nakayama formula. As applications, we study super-characters of the Iwahori-Hecke algebra as well as the bitrace of the regular representation and provide a simple proof of the Halverson-Luduc-Ram formula.",
    "authors": [
      "Naihuan Jing",
      "Ning Liu"
    ],
    "publication_date": "2021-04-13T10:06:13Z",
    "arxiv_id": "http://arxiv.org/abs/2104.06067v1",
    "download_url": "https://arxiv.org/abs/2104.06067v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ascending Chain Conditions in Free Baxter Algebras",
    "abstract": "In this paper we study ascending chain conditions in a free Baxter algebra by making use of explicit constructions of free Baxter algebras that were obtained recently. We investigate ascending chain conditions both for ideals and for Baxter ideals. The free Baxter algebras under consideration include free Baxter algebras on sets and free Baxter algebras on algebras. We also consider complete free Baxter algebras.",
    "authors": [
      "Li Guo"
    ],
    "publication_date": "2004-04-24T02:10:30Z",
    "arxiv_id": "http://arxiv.org/abs/math/0404441v1",
    "download_url": "https://arxiv.org/abs/math/0404441v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Duality and products in algebraic (co)homology theories",
    "abstract": "The origin and interplay of products and dualities in algebraic (co)homology theories is ascribed to a $\\times_A$-Hopf algebra structure on the relevant universal enveloping algebra. This provides a unified treatment for example of results by Van den Bergh about Hochschild (co)homology and by Huebschmann about Lie-Rinehart (co)homology.",
    "authors": [
      "Niels Kowalzig",
      "Ulrich Kraehmer"
    ],
    "publication_date": "2008-12-22T23:34:55Z",
    "arxiv_id": "http://arxiv.org/abs/0812.4312v2",
    "download_url": "https://arxiv.org/abs/0812.4312v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Baxter Algebras, Stirling Numbers and Partitions",
    "abstract": "Recent developments of Baxter algebras have lead to applications to combinatorics, number theory and mathematical physics. We relate Baxter algebras to Stirling numbers of the first kind and the second kind, partitions and multinomial coefficients. This allows us to apply congruences from number theory to obtain congruences in Baxter algebras.",
    "authors": [
      "Li Guo"
    ],
    "publication_date": "2004-02-22T13:15:01Z",
    "arxiv_id": "http://arxiv.org/abs/math/0402348v1",
    "download_url": "https://arxiv.org/abs/math/0402348v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gorenstein Semigroup Algebras of Weighted Trees",
    "abstract": "We classify exactly when the toric algebras $\\C[S_{\\tree}(\\br)]$ are Gorenstein. These algebras arise as toric deformations of algebras of invariants of the Cox-Nagata ring of the blow-up of $n-1$ points on $\\mathbb{P}^{n-3}$, or equivalently algebras of the ring of global sections for the Plücker embedding of weight varieties of the Grassmanian $Gr_2(\\C^n)$, and algebras of global sections for embeddings of moduli of weighted points on $\\mathbb{P}^1$. As a corollary, we find exactly when these families of rings are Gorenstein as well.",
    "authors": [
      "Christopher Manon"
    ],
    "publication_date": "2008-10-08T04:48:25Z",
    "arxiv_id": "http://arxiv.org/abs/0810.1353v3",
    "download_url": "https://arxiv.org/abs/0810.1353v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pointed Hopf algebras over the sporadic simple groups",
    "abstract": "We show that every finite-dimensional complex pointed Hopf algebra with group of group-likes isomorphic to a sporadic group is a group algebra, except for the Fischer group Fi22, the Baby Monster and the Monster. For these three groups, we give a short list of irreducible Yetter-Drinfeld modules whose Nichols algebra is not known to be finite-dimensional.",
    "authors": [
      "N. Andruskiewitsch",
      "F. Fantino",
      "M. Graña",
      "L. Vendramin"
    ],
    "publication_date": "2010-01-07T17:12:26Z",
    "arxiv_id": "http://arxiv.org/abs/1001.1108v2",
    "download_url": "https://arxiv.org/abs/1001.1108v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Proof of the Gorenstein Interval Conjecture in low socle degree",
    "abstract": "Roughly ten years ago, the following \"Gorenstein Interval Conjecture\" (GIC) was proposed: Whenever $(1,h_1,\\dots,h_i,\\dots,h_{e-i},\\dots,h_{e-1},1)$ and $(1,h_1,\\dots,h_i+α,\\dots,h_{e-i}+α,\\dots,h_{e-1},1)$ are both Gorenstein Hilbert functions for some $α\\geq 2$, then $(1,h_1,\\dots,h_i+β,\\dots,h_{e-i}+β,\\dots,h_{e-1},1)$ is also Gorenstein, for all $β=1,2,\\dots,α-1$. Since an explicit characterization of which Hilbert functions are Gorenstein is widely believed to be hopeless, the GIC, if true, would at least provide the existence of a strong, and very natural, structural property for such basic functions in commutative algebra. Before now, very little progress was made on the GIC.\n  The main goal of this note is to prove the case $e\\le 5$, in arbitrary codimension. Our arguments will be in part constructive, and will combine several different tools of commutative algebra and classical algebraic geometry.",
    "authors": [
      "Sung Gi Park",
      "Richard P. Stanley",
      "Fabrizio Zanello"
    ],
    "publication_date": "2018-04-23T21:27:25Z",
    "arxiv_id": "http://arxiv.org/abs/1804.08745v2",
    "download_url": "https://arxiv.org/abs/1804.08745v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]