[
  {
    "title": "Proof nets for the Displacement calculus",
    "abstract": "We present a proof net calculus for the Displacement calculus and show its\ncorrectness. This is the first proof net calculus which models the Displacement\ncalculus directly and not by some sort of translation into another formalism.\nThe proof net calculus opens up new possibilities for parsing and proof search\nwith the Displacement calculus.",
    "authors": [
      "Richard Moot"
    ],
    "publication_date": "2016-06-06T12:55:57Z",
    "arxiv_id": "http://arxiv.org/abs/1606.01720v1",
    "download_url": "http://arxiv.org/abs/1606.01720v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Hidden Structural Rules of the Discontinuous Lambek Calculus",
    "abstract": "The sequent calculus sL for the Lambek calculus L (lambek 58) has no\nstructural rules. Interestingly, sL is equivalent to a multimodal calculus mL,\nwhich consists of the nonassociative Lambek calculus with the structural rule\nof associativity. This paper proves that the sequent calculus or hypersequent\ncalculus hD of the discontinuous Lambek calculus (Morrill and Valent\\'in),\nwhich like sL has no structural rules, is also equivalent to an omega-sorted\nmultimodal calculus mD. More concretely, we present a faithful embedding\ntranslation between mD and hD in such a way that it can be said that hD absorbs\nthe structural rules of mD.",
    "authors": [
      "Oriol Valentín"
    ],
    "publication_date": "2013-01-21T11:02:29Z",
    "arxiv_id": "http://arxiv.org/abs/1301.4816v2",
    "download_url": "http://arxiv.org/abs/1301.4816v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Some Syntactic Properties of the Modalized Heyting Calculus",
    "abstract": "We show that the modalized Heyting calculus~\\cite{esa06} admits a normal\naxiomatization. Then we prove that in this calculus the inference rule\n$\\square\\alpha/\\alpha$ is admissible (Proposition 5.6), but the rule\n$\\square\\alpha\\rightarrow\\alpha/\\alpha$ is not (Proposition 6.1). Finally, we\nshow that this calculus and intuitionistic propositional calculus are\nassertorically equipollent, which leads to a variant of limited separation\nproperty for the modalized Heyting calculus.",
    "authors": [
      "Alexei Muravitsky"
    ],
    "publication_date": "2016-12-15T21:12:37Z",
    "arxiv_id": "http://arxiv.org/abs/1612.05273v2",
    "download_url": "http://arxiv.org/abs/1612.05273v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A non-anyonic qudit ZW-calculus",
    "abstract": "ZW-calculus is a useful graphical language for pure qubit quantum computing.\nIt is via the translation of the completeness of ZW-calculus that the first\nproof of completeness of ZX-calculus was obtained. A d-level generalisation of\nqubit ZW-calculus (anyonic qudit ZW-calculus) has been given in [Hadzihasanovic\n2017] which is universal for pure qudit quantum computing. However, the\ninterpretation of the W spider in this type of ZW-calculus has so-called\nq-binomial coefficients involved, thus makes computation quite complicated. In\nthis paper, we give a new type of qudit ZW-calculus which has generators and\nrewriting rules similar to that of the qubit ZW-calculus. Especially, the Z\nspider is exactly the same as that of the qudit ZX-calculus as given in [Wang\n2021], and the new W spider has much simpler interpretation as a linear map.\nFurthermore, we establish a translation between this qudit ZW-calculus and the\nqudit ZX-calculus which is universal as shown in [Wang 2021], therefore this\nqudit ZW-calculus is also universal for pure qudit quantum computing.",
    "authors": [
      "Quanlong Wang"
    ],
    "publication_date": "2021-09-23T10:46:30Z",
    "arxiv_id": "http://arxiv.org/abs/2109.11285v2",
    "download_url": "http://arxiv.org/abs/2109.11285v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extended finite operator calculus as an example of algebraization of\n  analysis",
    "abstract": "A calculus of sequences started by professor morgan ward constitutes the\ngeneral scheme for extensions of classical operator calculus of the\ndistinguished gian carlo rota considered by many afterwards and after ward\nmorgan. Because of the historically now established notation we call the\nwardian calculus of sequences in its afterwards elaborated form a psi calculus.\nThe psi calculus in parts appears to be almost automatic, natural extension of\nclassical operator calculus or equivalently of umbral calculus . This is a\nreview article based on the turn of the centuries author relevant\ncontributions.",
    "authors": [
      "A. K. Kwasniewski"
    ],
    "publication_date": "2008-12-30T08:09:29Z",
    "arxiv_id": "http://arxiv.org/abs/0812.5027v1",
    "download_url": "http://arxiv.org/abs/0812.5027v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relativized Propositional Calculus",
    "abstract": "Proof systems for the Relativized Propositional Calculus are defined and\ncompared.",
    "authors": [
      "Stephen Cook"
    ],
    "publication_date": "2012-03-09T20:20:06Z",
    "arxiv_id": "http://arxiv.org/abs/1203.2168v1",
    "download_url": "http://arxiv.org/abs/1203.2168v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hilbertian Toposes Epsilon Toposes",
    "abstract": "We study Hilbert's epsilon calculus and Hilbert's partial epsilon calculus in\ntoposes.",
    "authors": [
      "Fabio Pasquali"
    ],
    "publication_date": "2016-03-02T18:43:17Z",
    "arxiv_id": "http://arxiv.org/abs/1603.00822v1",
    "download_url": "http://arxiv.org/abs/1603.00822v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Student gender modulates the intersection of calculus proficiency and\n  calculus self-efficacy in an introductory electricity and magnetism course",
    "abstract": "We assessed changes in calculus proficiency and calculus self-efficacy in a\nsecond semester course of introductory physics focused on electricity and\nmagnetism. While all students demonstrated an increase in calculus proficiency,\nincluding a possible improvement in calculus transfer to physics, women\ndisplayed larger gains than men. Conversely, men showed larger gains in\ncalculus self-efficacy. When combined, these data suggest that student identity\nmodulates the correlation between a student's calculus abilities and their\nperception or self-evaluation of those abilities. These data highlight a\npotential contributing factor to gender-related differences in physics\nself-efficacy as well as the complexity of addressing those differences.",
    "authors": [
      "Christopher J. Fischer",
      "Jennifer Delgado",
      "Sarah LeGresley",
      "Jessy Changstrom"
    ],
    "publication_date": "2024-01-04T19:34:44Z",
    "arxiv_id": "http://arxiv.org/abs/2401.02506v1",
    "download_url": "http://arxiv.org/abs/2401.02506v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graphic lambda calculus and knot diagrams",
    "abstract": "In arXiv:1207.0332 [cs.LO] was proposed a graphic lambda calculus formalism,\nwhich has sectors corresponding to untyped lambda calculus and emergent\nalgebras.\n  Here we explore the sector covering knot diagrams, which are constructed as\nmacros over the graphic lambda calculus.",
    "authors": [
      "Marius Buliga"
    ],
    "publication_date": "2012-11-07T17:04:10Z",
    "arxiv_id": "http://arxiv.org/abs/1211.1604v1",
    "download_url": "http://arxiv.org/abs/1211.1604v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mikusiński's Operational Calculus with Algebraic Foundations and\n  Applications to Bessel Functions",
    "abstract": "We construct an operational calculus supported on the algebraic operational\ncalculus introduced by Bengochea and Verde. With this operational calculus we\nstudy the solution of certain Bessel type equations.",
    "authors": [
      "Gabriel Bengochea",
      "Gabriel López G"
    ],
    "publication_date": "2013-05-28T17:24:00Z",
    "arxiv_id": "http://arxiv.org/abs/1305.6562v1",
    "download_url": "http://arxiv.org/abs/1305.6562v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The unbounded extension of Hille-Phillips functional calculus",
    "abstract": "The extension of Hille-Phillips functional calculus of semigroup generators\nwhich leads to unbounded operators is given. Connections of this calculus to\nBochner-Phillips functional calculus are indicated, and several examples are\nconsidered.",
    "authors": [
      "A. R. Mirotin"
    ],
    "publication_date": "2019-12-17T15:58:47Z",
    "arxiv_id": "http://arxiv.org/abs/1912.08105v1",
    "download_url": "http://arxiv.org/abs/1912.08105v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A decompilation of the pi-calculus and its application to termination",
    "abstract": "We study the correspondence between a concurrent lambda-calculus in\nadministrative, continuation passing style and a pi-calculus and we derive a\ntermination result for the latter.",
    "authors": [
      "Roberto Amadio"
    ],
    "publication_date": "2011-02-11T12:53:14Z",
    "arxiv_id": "http://arxiv.org/abs/1102.2339v1",
    "download_url": "http://arxiv.org/abs/1102.2339v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Calculus on Dual Real Numbers",
    "abstract": "We present the basic theory of calculus on dual real numbers, and prove the\ncounterpart of the ordinary fundamental theorem of calculus in the context of\ndual real numbers.",
    "authors": [
      "Keqin Liu"
    ],
    "publication_date": "2018-08-21T23:29:40Z",
    "arxiv_id": "http://arxiv.org/abs/1808.07159v1",
    "download_url": "http://arxiv.org/abs/1808.07159v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rewriting Calculus: Foundations and Applications",
    "abstract": "This thesis is devoted to the study of a calculus that describes the\napplication of conditional rewriting rules and the obtained results at the same\nlevel of representation. We introduce the rewriting calculus, also called the\nrho-calculus, which generalizes the first order term rewriting and\nlambda-calculus, and makes possible the representation of the non-determinism.\nIn our approach the abstraction operator as well as the application operator\nare objects of calculus. The result of a reduction in the rewriting calculus is\neither an empty set representing the application failure, or a singleton\nrepresenting a deterministic result, or a set having several elements\nrepresenting a not-deterministic choice of results.\n  In this thesis we concentrate on the properties of the rewriting calculus\nwhere a syntactic matching is used in order to bind the variables to their\ncurrent values. We define evaluation strategies ensuring the confluence of the\ncalculus and we show that these strategies become trivial for restrictions of\nthe general rewriting calculus to simpler calculi like the lambda-calculus. The\nrewriting calculus is not terminating in the untyped case but the strong\nnormalization is obtained for the simply typed calculus.\n  In the rewriting calculus extended with an operator allowing to test the\napplication failure we define terms representing innermost and outermost\nnormalizations with respect to a set of rewriting rules. By using these terms,\nwe obtain a natural and concise description of the conditional rewriting.\nFinally, starting from the representation of the conditional rewriting rules,\nwe show how the rewriting calculus can be used to give a semantics to ELAN, a\nlanguage based on the application of rewriting rules controlled by strategies.",
    "authors": [
      "Horatiu Cirstea"
    ],
    "publication_date": "2000-11-28T15:01:07Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0011043v1",
    "download_url": "http://arxiv.org/abs/cs/0011043v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Baxter Algebras and Umbral Calculus",
    "abstract": "We apply recent constructions of free Baxter algebras to the study of the\numbral calculus. We give a characterization of the umbral calculus in terms of\nBaxter algebra. This characterization leads to a natural generalization of the\numbral calculus that include the classical umbral calculus in a family of\n$\\lambda$-umbral calculi parameterized by $\\lambda$ in the base ring.",
    "authors": [
      "Li Guo"
    ],
    "publication_date": "2004-07-09T04:07:27Z",
    "arxiv_id": "http://arxiv.org/abs/math/0407159v1",
    "download_url": "http://arxiv.org/abs/math/0407159v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The lambda-q calculus can efficiently simulate quantum computers",
    "abstract": "We show that the lambda-q calculus can efficiently simulate quantum Turing\nmachines by showing how the lambda-q calculus can efficiently simulate a class\nof quantum cellular automaton that are equivalent to quantum Turing machines.\nWe conclude by noting that the lambda-q calculus may be strictly stronger than\nquantum computers because NP-complete problems such as satisfiability are\nefficiently solvable in the lambda-q calculus but there is a widespread doubt\nthat they are efficiently solvable by quantum computers.",
    "authors": [
      "Philip Maymin"
    ],
    "publication_date": "1997-02-26T22:13:11Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9702057v1",
    "download_url": "http://arxiv.org/abs/quant-ph/9702057v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time scales: from Nabla calculus to Delta calculus and vice versa via\n  duality",
    "abstract": "In this note we show how one can obtain results from the nabla calculus from\nresults on the delta calculus and vice versa via a duality argument. We provide\napplications of the main results to the calculus of variations on time scales.",
    "authors": [
      "M. Cristina Caputo"
    ],
    "publication_date": "2009-10-01T13:26:40Z",
    "arxiv_id": "http://arxiv.org/abs/0910.0085v2",
    "download_url": "http://arxiv.org/abs/0910.0085v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The untyped stack calculus and Bohm's theorem",
    "abstract": "The stack calculus is a functional language in which is in a Curry-Howard\ncorrespondence with classical logic. It enjoys confluence but, as well as\nParigot's lambda-mu, does not admit the Bohm Theorem, typical of the\nlambda-calculus. We present a simple extension of stack calculus which is for\nthe stack calculus what Saurin's Lambda-mu is for lambda-mu.",
    "authors": [
      "Alberto Carraro"
    ],
    "publication_date": "2013-03-29T09:02:05Z",
    "arxiv_id": "http://arxiv.org/abs/1303.7330v1",
    "download_url": "http://arxiv.org/abs/1303.7330v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Propositional Calculus in Coq",
    "abstract": "I formalize important theorems about classical propositional logic in the\nproof assistant Coq. The main theorems I prove are (1) the soundness and\ncompleteness of natural deduction calculus, (2) the equivalence between natural\ndeduction calculus, Hilbert systems and sequent calculus and (3) cut\nelimination for sequent calculus.",
    "authors": [
      "Floris van Doorn"
    ],
    "publication_date": "2015-03-30T17:07:58Z",
    "arxiv_id": "http://arxiv.org/abs/1503.08744v2",
    "download_url": "http://arxiv.org/abs/1503.08744v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Calculus for Language Transformations",
    "abstract": "In this paper we propose a calculus for expressing algorithms for programming\nlanguages transformations. We present the type system and operational semantics\nof the calculus, and we prove that it is type sound. We have implemented our\ncalculus, and we demonstrate its applicability with common examples in\nprogramming languages. As our calculus manipulates inference systems, our work\ncan, in principle, be applied to logical systems.",
    "authors": [
      "Benjamin Mourad",
      "Matteo Cimini"
    ],
    "publication_date": "2019-10-25T20:31:18Z",
    "arxiv_id": "http://arxiv.org/abs/1910.11924v1",
    "download_url": "http://arxiv.org/abs/1910.11924v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the connections of Hille-Phillips functional calculus with\n  Bochner-Phillips functional calculus",
    "abstract": "The extension of Hille-Phillips functional calculus of semigroup generators\nwhich leads to unbounded operators is considered. Connections of this calculus\nto Bochner-Phillips functional calculus are indicated. In particular, the\nmultiplication rule and the composition rule are proved. Several examples are\ngiven.",
    "authors": [
      "A. R. Mirotin"
    ],
    "publication_date": "2019-12-28T08:17:08Z",
    "arxiv_id": "http://arxiv.org/abs/1912.12423v1",
    "download_url": "http://arxiv.org/abs/1912.12423v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparing orthogonal calculus and calculus with Reality",
    "abstract": "We show that there exists a suitable $C_2$-fixed points functor from calculus\nwith Reality to the orthogonal calculus of Weiss which recovers orthogonal\ncalculus ``up to a shift'' in an analogous way with the recovery of real\ntopological $K$-theory from Atiyah's $K$-theory with Reality via appropriate\n$C_2$-fixed points.",
    "authors": [
      "Niall Taggart"
    ],
    "publication_date": "2022-05-31T09:57:16Z",
    "arxiv_id": "http://arxiv.org/abs/2205.15660v2",
    "download_url": "http://arxiv.org/abs/2205.15660v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Full Abstraction for the Resource Lambda Calculus with Tests, through\n  Taylor Expansion",
    "abstract": "We study the semantics of a resource-sensitive extension of the lambda\ncalculus in a canonical reflexive object of a category of sets and relations, a\nrelational version of Scott's original model of the pure lambda calculus. This\ncalculus is related to Boudol's resource calculus and is derived from Ehrhard\nand Regnier's differential extension of Linear Logic and of the lambda\ncalculus. We extend it with new constructions, to be understood as implementing\na very simple exception mechanism, and with a \"must\" parallel composition.\nThese new operations allow to associate a context of this calculus with any\npoint of the model and to prove full abstraction for the finite sub-calculus\nwhere ordinary lambda calculus application is not allowed. The result is then\nextended to the full calculus by means of a Taylor Expansion formula. As an\nintermediate result we prove that the exception mechanism is not essential in\nthe finite sub-calculus.",
    "authors": [
      "Thomas Ehrhard",
      "Antonio Bucciarelli",
      "Alberto Carraro",
      "Giulio Manzonetto"
    ],
    "publication_date": "2012-09-13T13:45:55Z",
    "arxiv_id": "http://arxiv.org/abs/1209.2890v2",
    "download_url": "http://arxiv.org/abs/1209.2890v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparing the Expressive Power of the Synchronous and the Asynchronous\n  pi-calculi",
    "abstract": "The Asynchronous pi-calculus, proposed by Honda and Tokoro (1991) and,\nindependently, by Boudol (1992), is a subset of the pi-calculus (Milner, 1992)\nwhich contains no explicit operators for choice and output-prefixing. The\ncommunication mechanism of this calculus, however, is powerful enough to\nsimulate output-prefixing, as shown by Honda and Tokoro (1991) and by Boudol\n(1992), and input-guarded choice, as shown by Nestmann and Pierce (2000). A\nnatural question arises, then, whether or not it is as expressive as the full\npi-calculus. We show that this is not the case. More precisely, we show that\nthere does not exist any uniform, fully distributed translation from the\npi-calculus into the asynchronous pi-calculus, up to any \"reasonable\" notion of\nequivalence. This result is based on the incapability of the asynchronous\npi-calculus to break certain symmetries possibly present in the initial\ncommunication graph. By similar arguments, we prove a separation result between\nthe pi-calculus and CCS, and between the pi-calculus and the pi-calculus with\ninternal mobility, a subset of the pi-calculus proposed by Sangiorgi where the\noutput actions can only transmit private names.",
    "authors": [
      "Catuscia Palamidessi"
    ],
    "publication_date": "2013-07-08T12:31:50Z",
    "arxiv_id": "http://arxiv.org/abs/1307.2062v1",
    "download_url": "http://arxiv.org/abs/1307.2062v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "DD Calculus",
    "abstract": "This paper introduces DD calculus and describes the basic calculus concepts\nof derivative and integral in a direct and non-traditional way, without limit\ndefinition: Derivative is computed from the point-slope equation of a tangent\nline and integral is defined as the height increment of a curve. This direct\napproach to calculus has three distinct features: (i) it defines derivative and\n(definite) integral without using limits, (ii) it defines derivative and\nantiderivative simultaneously via a derivative-antiderivative (DA) pair, and\n(iii) it posits the fundamental theorem of calculus as a natural corollary of\nthe definitions of derivative and integral. The first D in DD calculus\nattributes to Descartes for his method of tangents and the second D to DA-pair.\nThe DD calculus, or simply direct calculus, makes many traditional notations\nand procedures unnecessary, a plus when introducing calculus to the\nnon-mathematics majors. It has few intermediate procedures, which can help\ndispel the mystery of calculus as perceived by the general public. The\nmaterials in this paper are intended for use in a two-hour introductory lecture\non calculus.",
    "authors": [
      "Samuel S. P. Shen",
      "Qun Lin"
    ],
    "publication_date": "2014-04-01T00:12:05Z",
    "arxiv_id": "http://arxiv.org/abs/1404.0070v1",
    "download_url": "http://arxiv.org/abs/1404.0070v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Symmetric Lambda-Calculus Corresponding to the Negation-Free Bilateral\n  Natural Deduction",
    "abstract": "Filinski constructed a symmetric lambda-calculus consisting of expressions\nand continuations which are symmetric, and functions which have duality. In his\ncalculus, functions can be encoded to expressions and continuations using\nprimitive operators. That is, the duality of functions is not derived in the\ncalculus but adopted as a principle of the calculus. In this paper, we propose\na simple symmetric lambda-calculus corresponding to the negation-free natural\ndeduction based bilateralism in proof-theoretic semantics. In our calculus,\ncontinuation types are represented as not negations of formulae but formulae\nwith negative polarity. Function types are represented as the implication and\nbut-not connectives in intuitionistic and paraconsistent logics, respectively.\nOur calculus is not only simple but also powerful as it includes a call-value\ncalculus corresponding to the call-by-value dual calculus invented by Wadler.\nWe show that mutual transformations between expressions and continuations are\ndefinable in our calculus to justify the duality of functions. We also show\nthat every typable function has dual types. Thus, the duality of function is\nderived from bilateralism.",
    "authors": [
      "Tatsuya Abe",
      "Daisuke Kimura"
    ],
    "publication_date": "2021-01-29T14:39:29Z",
    "arxiv_id": "http://arxiv.org/abs/2101.12607v1",
    "download_url": "http://arxiv.org/abs/2101.12607v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Definition of fractal measures arising from fractional calculus",
    "abstract": "It is wellknown that the ordinary calculus is inadequate to handle fractal\nstructures and processes and another suitable calculus needs to be developed\nfor this purpose. Recently it was realized that fractional calculus with\nsuitable constructions does offer such a possibility. This makes it necessary\nto have a definition of fractal measures based on the fractional calculus so\nthat the fractals can be naturally incorporated in the calculus. With this\nmotivation a definition of fractal measure has been systematically developed\nusing the concepts of fractional calculus. It has been demonstrated that such a\ndefinition naturally arises in the solution of an equation describing diffusion\nin fractal time.",
    "authors": [
      "Kiran M. Kolwankar",
      "Anil D. Gangal"
    ],
    "publication_date": "1998-11-12T17:59:57Z",
    "arxiv_id": "http://arxiv.org/abs/chao-dyn/9811015v1",
    "download_url": "http://arxiv.org/abs/chao-dyn/9811015v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Suspension Calculus and its Relationship to Other Explicit\n  Treatments of Substitution in Lambda Calculi",
    "abstract": "The intrinsic treatment of binding in the lambda calculus makes it an ideal\ndata structure for representing syntactic objects with binding such as\nformulas, proofs, types, and programs. Supporting such a data structure in an\nimplementation is made difficult by the complexity of the substitution\noperation relative to lambda terms. In this paper we present the suspension\ncalculus, an explicit treatment of meta level binding in the lambda calculus.\nWe prove properties of this calculus which make it a suitable replacement for\nthe lambda calculus in implementation. Finally, we compare the suspension\ncalculus with other explicit treatments of substitution.",
    "authors": [
      "Andrew Gacek"
    ],
    "publication_date": "2007-02-05T14:35:01Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0702027v1",
    "download_url": "http://arxiv.org/abs/cs/0702027v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Henri Lebesgue and the End of Classical Theories on Calculus",
    "abstract": "In this paper a novel calculus system has been established based on the\nconcept of 'werden'. The basis of logic self-contraction of the theories on\ncurrent calculus was shown. Mistakes and defects in the structure and meaning\nof the theories on current calculus were exposed. A new quantity-figure model\nas the premise of mathematics has been formed after the correction of\ndefinition of the real number and the point. Basic concepts such as the\nderivative, the differential, the primitive function and the integral have been\nredefined and the theories on calculus have been reestablished. By historical\nverification of theories on calculus, it is demonstrated that the\nNewton-Leibniz theories on calculus have returned in the form of the novel\ntheories established in this paper.",
    "authors": [
      "Xiaoping Ding"
    ],
    "publication_date": "2012-01-11T03:43:00Z",
    "arxiv_id": "http://arxiv.org/abs/1201.2581v1",
    "download_url": "http://arxiv.org/abs/1201.2581v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SZX-calculus: Scalable Graphical Quantum Reasoning",
    "abstract": "We introduce the Scalable ZX-calculus (SZX-calculus for short), a formal and\ncompact graphical language for the design and verification of quantum\ncomputations. The SZX-calculus is an extension of the ZX-calculus, a powerful\nframework that captures graphically the fundamental properties of quantum\nmechanics through its complete set of rewrite rules. The ZX-calculus is,\nhowever, a low level language, with each wire representing a single qubit. This\nlimits its ability to handle large and elaborate quantum evolutions. We extend\nthe ZX-calculus to registers of qubits and allow compact representation of\nsub-diagrams via binary matrices. We show soundness and completeness of the\nSZX-calculus and provide two examples of applications, for graph states and\nerror correcting codes.",
    "authors": [
      "Titouan Carette",
      "Dominic Horsman",
      "Simon Perdrix"
    ],
    "publication_date": "2019-04-30T18:02:03Z",
    "arxiv_id": "http://arxiv.org/abs/1905.00041v1",
    "download_url": "http://arxiv.org/abs/1905.00041v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Recovering unitary calculus from calculus with reality",
    "abstract": "By analogy with complex $K$--theory and $K$--theory with reality, there are\ntheories of unitary functor calculus and unitary functor calculus with reality,\nboth of which are generalisations of Weiss' orthogonal calculus. In this paper\nwe show that unitary functor calculus can be completely recovered from the\nunitary functor calculus with reality, in analogy to how complex topological\n$K$--theory is completely recovered from $K$--theory with reality via\nforgetting the $C_2$--action.",
    "authors": [
      "Niall Taggart"
    ],
    "publication_date": "2020-10-12T18:17:05Z",
    "arxiv_id": "http://arxiv.org/abs/2010.05948v3",
    "download_url": "http://arxiv.org/abs/2010.05948v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interplay between physics self-efficacy, calculus transfer ability, and\n  gender",
    "abstract": "We present our initial work to develop an assessment of calculus proficiency\nin the context of introductory physics (i.e., calculus transfer to physics),\nincluding a comparison of calculus transfer ability with physics self-efficacy\nand how these attributes intersect with student gender. Although students\ndemonstrated an improvement in their calculus transfer ability, most\nnevertheless displayed a decrease in their physics self-efficacy. Similarly,\nwhile women consistently exhibited lower physics self-efficacy than men, women\ndemonstrated larger gains in their proficiency with calculus transfer to\nphysics. We also discuss future work to better evaluate the interdependence of\nmathematics self-efficacy, physics self-efficacy, and ability to transfer\ncalculus to physics.",
    "authors": [
      "Christopher Fischer",
      "Jennifer Delgado",
      "Sarah LeGresley"
    ],
    "publication_date": "2021-10-14T13:48:18Z",
    "arxiv_id": "http://arxiv.org/abs/2110.07364v1",
    "download_url": "http://arxiv.org/abs/2110.07364v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cyclic Shift in the Lambek Calculus",
    "abstract": "We enrich the Lambek calculus with the cyclic shift operation, which is\nexpected to model the closure operator of formal languages with respect to\ncyclic shifts. We introduce a Gentzen-style calculus and prove cut elimination.\nSecondly, we turn to categorial grammars based on this calculus and show that\nthey can generate non-context-free languages; besides, we consider a related\ncalculus where the cyclic shift is a structural rule, and compare recognizing\npower of these two calculi. Thirdly, we attempt to embed the Lambek calculus\nwith the cyclic shift operation in the hypergraph Lambek calculus. This results\nin considering a ``bracelet'' operation, which can be defined through the\ncyclic shift, union, and the reversal operation.",
    "authors": [
      "Tikhon Pshenitsyn"
    ],
    "publication_date": "2021-11-02T20:41:14Z",
    "arxiv_id": "http://arxiv.org/abs/2111.01883v2",
    "download_url": "http://arxiv.org/abs/2111.01883v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Categorified Path Calculus",
    "abstract": "Path calculus, or graphical linear algebra, is a string diagram calculus for\nthe category of matrices over a base ring. It is the usual string diagram\ncalculus for a symmetric monoidal category, where the monoidal product is the\ndirect sum of matrices. We categorify this story to develop a surface diagram\ncalculus for the bicategory of matrices over a base bimonoidal category. This\nyields a surface diagram calculus for any bimonoidal category by restricting to\ndiagrams for 1x1 matrices. We show how additional structure on the base\ncategory, such as biproducts, duals and the dagger, adds structure to the\nresulting calculus. Applied to categorical quantum mechanics this yields a new\ngraphical proof of the teleportation protocol.",
    "authors": [
      "Simon Burton"
    ],
    "publication_date": "2023-07-06T15:45:14Z",
    "arxiv_id": "http://arxiv.org/abs/2307.03075v1",
    "download_url": "http://arxiv.org/abs/2307.03075v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Well-typed Lightweight Situation Calculus",
    "abstract": "Situation calculus has been widely applied in Artificial Intelligence related\nfields. This formalism is considered as a dialect of logic programming language\nand mostly used in dynamic domain modeling. However, type systems are hardly\ndeployed in situation calculus in the literature. To achieve a correct and\nsound typed program written in situation calculus, adding typing elements into\nthe current situation calculus will be quite helpful. In this paper, we propose\nto add more typing mechanisms to the current version of situation calculus,\nespecially for three basic elements in situation calculus: situations, actions\nand objects, and then perform rigid type checking for existing situation\ncalculus programs to find out the well-typed and ill-typed ones. In this way,\ntype correctness and soundness in situation calculus programs can be guaranteed\nby type checking based on our type system. This modified version of a\nlightweight situation calculus is proved to be a robust and well-typed system.",
    "authors": [
      "Li Tan"
    ],
    "publication_date": "2012-01-11T21:44:18Z",
    "arxiv_id": "http://arxiv.org/abs/1201.2430v2",
    "download_url": "http://arxiv.org/abs/1201.2430v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stats-Calculus Pose Descriptor Feeding A Discrete HMM Low-latency\n  Detection and Recognition System For 3D Skeletal Actions",
    "abstract": "Recognition of human actions, under low observational latency, is a growing\ninterest topic, nowadays. Many approaches have been represented based on a\nprovided set of 3D Cartesian coordinates system originated at a certain\nspecific point located on a root joint. In this paper, We will present a\nstatistical detection and recognition system using Hidden Markov Model using 7\ntypes of pose descriptors. * Cartesian Calculus Pose descriptor. * Angular\nCalculus Pose descriptor. * Mixed-mode Stats-Calculus Pose descriptor. *\nCentro-Stats-Calculus Pose descriptor. * Rela-Centro-Stats-Calculus Pose\ndescriptor. * Rela-Centro-Stats-Calculus DCT Pose descriptor. *\nRela-Centro-Stats-Calculus DCT-AMDF Pose descriptor. Stats-Calculus is a\nfeature extracting technique, that is developed on Moving Pose descriptor , but\nusing a combination of Statistics measures and Calculus measures.",
    "authors": [
      "Rofael Emil Fayez Behnam"
    ],
    "publication_date": "2015-09-30T05:02:52Z",
    "arxiv_id": "http://arxiv.org/abs/1509.09014v4",
    "download_url": "http://arxiv.org/abs/1509.09014v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Algebraic Axiomatisation of ZX-calculus",
    "abstract": "ZX-calculus is a graphical language for quantum computing which is complete\nin the sense that calculation in matrices can be done in a purely diagrammatic\nway. However, all previous universally complete axiomatisations of ZX-calculus\nhave included at least one rule involving trigonometric functions such as sin\nand cos which makes it difficult for application purpose. In this paper we give\nan algebraic complete axiomatisation of ZX-calculus instead such that there are\nonly ring operations involved for phases. With this algebraic axiomatisation of\nZX-calculus, we are able to establish for the first time a simple translation\nof diagrams from another graphical language called ZH-calculus and to derive\nall the ZX-translated rules of ZH-calculus. As a consequence, we have a great\nbenefit that all techniques obtained in ZH-calculus can be transplanted to\nZX-calculus, which can't be obtained by just using the completeness of\nZX-calculus.",
    "authors": [
      "Quanlong Wang"
    ],
    "publication_date": "2019-11-15T17:09:31Z",
    "arxiv_id": "http://arxiv.org/abs/1911.06752v3",
    "download_url": "http://arxiv.org/abs/1911.06752v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Event structures for the reversible early internal Pi-calculus",
    "abstract": "The pi-calculus is a widely used process calculus, which models\ncommunications between processes and allows the passing of communication links.\nVarious operational semantics of the pi-calculus have been proposed, which can\nbe classified according to whether transitions are unlabelled (so-called\nreductions) or labelled. With labelled transitions, we can distinguish early\nand late semantics. The early version allows a process to receive names it\nalready knows from the environment, while the late semantics and reduction\nsemantics do not. All existing reversible versions of the pi-calculus use\nreduction or late semantics, despite the early semantics of the (forward-only)\npi-calculus being more widely used than the late. We define piIH, the first\nreversible early pi-calculus, and give it a denotational semantics in terms of\nreversible bundle event structures. The new calculus is a reversible form of\nthe internal pi-calculus, which is a subset of the pi-calculus where every link\nsent by an output is private, yielding greater symmetry between inputs and\noutputs.",
    "authors": [
      "Eva Graversen",
      "Iain Phillips",
      "Nobuko Yoshida"
    ],
    "publication_date": "2020-04-02T18:07:08Z",
    "arxiv_id": "http://arxiv.org/abs/2004.01211v2",
    "download_url": "http://arxiv.org/abs/2004.01211v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extending the Lambda Calculus to Express Randomized and Quantumized\n  Algorithms",
    "abstract": "This paper introduces a formal metalanguage called the lambda-q calculus for\nthe specification of quantum programming languages. This metalanguage is an\nextension of the lambda calculus, which provides a formal setting for the\nspecification of classical programming languages. As an intermediary step, we\nintroduce a formal metalanguage called the lambda-p calculus for the\nspecification of programming languages that allow true random number\ngeneration. We demonstrate how selected randomized algorithms can be programmed\ndirectly in the lambda-p calculus. We also demonstrate how satisfiability can\nbe solved in the lambda-q calculus.",
    "authors": [
      "Philip Maymin"
    ],
    "publication_date": "1996-12-31T19:33:43Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9612052v2",
    "download_url": "http://arxiv.org/abs/quant-ph/9612052v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Categorical Models for a Semantically Linear Lambda-calculus",
    "abstract": "This paper is about a categorical approach to model a very simple\nSemantically Linear lambda calculus, named Sll-calculus. This is a core\ncalculus underlying the programming language SlPCF. In particular, in this\nwork, we introduce the notion of Sll-Category, which is able to describe a very\nlarge class of sound models of Sll-calculus. Sll-Category extends in the\nnatural way Benton, Bierman, Hyland and de Paiva's Linear Category, in order to\nsoundly interpret all the constructs of Sll-calculus. This category is general\nenough to catch interesting models in Scott Domains and Coherence Spaces.",
    "authors": [
      "Marco Gaboardi",
      "Mauro Piccolo"
    ],
    "publication_date": "2010-03-29T12:01:20Z",
    "arxiv_id": "http://arxiv.org/abs/1003.5511v1",
    "download_url": "http://arxiv.org/abs/1003.5511v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Calculus Concept Readiness (CCR) Instrument: Assessing Student\n  Readiness for Calculus",
    "abstract": "The Calculus Concept Readiness (CCR) instrument is based on the broad body of\nmathematics education research that has revealed major understandings,\nrepresentational abilities, and reasoning abilities students need to construct\nin precalculus level courses to be successful in calculus. The CCR is a 25-item\nmultiple-choice instrument, and the CCR taxonomy articulates what the CCR\nassesses. The methodology used to develop and validate the CCR is described and\nillustrated. Results from administering the CCR as a readiness examination in\ncalculus are provided along with data to guide others in using the CCR as a\nreadiness examination for beginning calculus.",
    "authors": [
      "Marilyn Carlson",
      "Bernard Madison",
      "Richard West"
    ],
    "publication_date": "2010-10-13T18:23:03Z",
    "arxiv_id": "http://arxiv.org/abs/1010.2719v1",
    "download_url": "http://arxiv.org/abs/1010.2719v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complex Multiplicative Calculus",
    "abstract": "In the present paper we extend the concepts of multiplicative de- rivative\nand integral to complex-valued functions of complex variable. Some drawbacks,\narising with these concepts in the real case, are explained satis- factorily.\nProperties of complex multiplicative derivatives and integrals are studied. In\nparticular, the fundamental theorem of complex multiplicative calculus,\nrelating these concepts, is proved. It is shown that complex multi- plicative\ncalculus is not just another realization of the ordinary calculus. In\nparticular, the Cauchy formula of complex calculus disappears in multiplicative\ncomplex calculus.",
    "authors": [
      "Agamirza Bashirov",
      "Mustafa Riza"
    ],
    "publication_date": "2011-03-08T08:26:36Z",
    "arxiv_id": "http://arxiv.org/abs/1103.1462v1",
    "download_url": "http://arxiv.org/abs/1103.1462v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Categorical Model for the Lambda Calculus with Constructors",
    "abstract": "The lambda calculus with constructors is an extension of the lambda calculus\nwith variadic constructors. It decomposes the pattern-matching a la ML into a\ncase analysis on constants and a commutation rule between case and application\nconstructs. Although this commutation rule does not match with the usual\ncomputing intuitions, it makes the calculus expressive and confluent, with a\nrather simple syntax. In this paper we define a sound notion of categorical\nmodel for the lambda calculus with constructors. We then prove that this\ndefinition is complete for the fragment of the calculus with no match-failure,\nusing the model of partial equivalence relations.",
    "authors": [
      "Barbara Petit"
    ],
    "publication_date": "2012-02-21T15:48:06Z",
    "arxiv_id": "http://arxiv.org/abs/1202.4678v2",
    "download_url": "http://arxiv.org/abs/1202.4678v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The ZX-calculus is complete for stabilizer quantum mechanics",
    "abstract": "The ZX-calculus is a graphical calculus for reasoning about quantum systems\nand processes. It is known to be universal for pure state qubit quantum\nmechanics, meaning any pure state, unitary operation and post-selected pure\nprojective measurement can be expressed in the ZX-calculus. The calculus is\nalso sound, i.e. any equality that can be derived graphically can also be\nderived using matrix mechanics. Here, we show that the ZX-calculus is complete\nfor pure qubit stabilizer quantum mechanics, meaning any equality that can be\nderived using matrices can also be derived pictorially. The proof relies on\nbringing diagrams into a normal form based on graph states and local Clifford\noperations.",
    "authors": [
      "Miriam Backens"
    ],
    "publication_date": "2013-07-26T13:11:11Z",
    "arxiv_id": "http://arxiv.org/abs/1307.7025v1",
    "download_url": "http://arxiv.org/abs/1307.7025v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "If Archimedes would have known functions",
    "abstract": "These are notes and slides from a Pecha-Kucha talk given on March 6, 2013.\nThe presentation tinkered with the question whether calculus on graphs could\nhave emerged by the time of Archimedes, if the concept of a function would have\nbeen available 2300 years ago. The text first attempts to boil down discrete\nsingle and multivariable calculus to one page each, then presents the slides\nwith additional remarks and finally includes 40 \"calculus problems\" in a\ndiscrete or so-called 'quantum calculus' setting. We also added some sample\nMathematica code, gave a short overview over the emergence of the function\nconcept in calculus and included comments on the development of calculus\ntextbooks over time.",
    "authors": [
      "Oliver Knill"
    ],
    "publication_date": "2014-03-24T00:19:57Z",
    "arxiv_id": "http://arxiv.org/abs/1403.5821v1",
    "download_url": "http://arxiv.org/abs/1403.5821v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A functorial approach to differential calculus",
    "abstract": "We show that differential calculus (in its usual form, or in the general form\nof topological differential calculus) can be fully imdedded into a functor\ncategory (functors from a small category of anchord tangent algebras to\nanchored sets). To prepare this approach, we define a new, symmetric,\npresentation of differential calculus, whose main feature is the central\nr{\\^o}le played by the anchor map, which we study in detail. Our aim for\ndeveloping this theory is twofold: (1) define a setting for calculus over any\ncommutative ring, including finite rings; (2) define a setting that can be\ngeneralized to categories of graded rings (super differential calculus).",
    "authors": [
      "Wolfgang Bertram",
      "Jérémy Haut"
    ],
    "publication_date": "2020-06-08T10:11:38Z",
    "arxiv_id": "http://arxiv.org/abs/2006.04452v2",
    "download_url": "http://arxiv.org/abs/2006.04452v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gentzen-Mints-Zucker duality",
    "abstract": "The Curry-Howard correspondence is often described as relating proofs (in\nintutionistic natural deduction) to programs (terms in simply-typed lambda\ncalculus). However this narrative is hardly a perfect fit, due to the\ncomputational content of cut-elimination and the logical origins of lambda\ncalculus. We revisit Howard's work and interpret it as an isomorphism between a\ncategory of proofs in intuitionistic sequent calculus and a category of terms\nin simply-typed lambda calculus. In our telling of the story the fundamental\nduality is not between proofs and programs but between local (sequent calculus)\nand global (lambda calculus or natural deduction) points of view on a common\nlogico-computational mathematical structure.",
    "authors": [
      "Daniel Murfet",
      "William Troiani"
    ],
    "publication_date": "2020-08-23T23:20:26Z",
    "arxiv_id": "http://arxiv.org/abs/2008.10131v1",
    "download_url": "http://arxiv.org/abs/2008.10131v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical Differential Calculus with Integration",
    "abstract": "Differential lambda-calculus was first introduced by Thomas Ehrhard and\nLaurent Regnier in 2003. Despite more than 15 years of history, little work has\nbeen done on a differential calculus with integration. In this paper, we shall\npropose a differential calculus with integration from programming point of\nview. We show its good correspondence with mathematics, which is manifested by\nhow we construct these reduction rules and how we preserve important\nmathematical theorems in our calculus. Moreover, we highlight applications of\nthe calculus in incremental computation, automatic differentiation, and\ncomputation approximation.",
    "authors": [
      "Han Xu",
      "Zhenjiang Hu"
    ],
    "publication_date": "2021-05-06T13:06:55Z",
    "arxiv_id": "http://arxiv.org/abs/2105.02632v2",
    "download_url": "http://arxiv.org/abs/2105.02632v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The functional calculus for regular operators in Hilbert C*-modules\n  revisited",
    "abstract": "Woronowicz introduced the functional calculus for normal operators in Hilbert\nC*-modules. The aim of this paper is to translate, if possible, some basic\nproperties of the functional calculus in Hilbert spaces to the Hilbert\nC*-module framework.",
    "authors": [
      "Johan Kustermans"
    ],
    "publication_date": "1997-06-20T10:46:07Z",
    "arxiv_id": "http://arxiv.org/abs/funct-an/9706007v1",
    "download_url": "http://arxiv.org/abs/funct-an/9706007v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Introduction to Finite Fibonomial Calculus",
    "abstract": "This is an indicatory presentation of main definitions and theorems of\nfibonomial calculus which is a special case of psi-extented rota's finite\noperator calculus.",
    "authors": [
      "Ewa Krot"
    ],
    "publication_date": "2005-03-11T12:54:29Z",
    "arxiv_id": "http://arxiv.org/abs/math/0503210v1",
    "download_url": "http://arxiv.org/abs/math/0503210v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]