[
  {
    "title": "Hopf coactions on commutative algebras generated by a quadratically independent comodule",
    "abstract": "Let A be a commutative unital algebra over an algebraically closed field k of characteristic not equal to 2, whose generators form a finite-dimensional subspace V, with no nontrivial homogeneous quadratic relations. Let Q be a Hopf algebra that coacts on A inner-faithfully, while leaving V invariant. We prove that Q must be commutative when either: (i) the coaction preserves a non-degenerate bilinear form on V; or (ii) Q is co-semisimple, finite-dimensional, and char(k)=0.",
    "authors": [
      "Pavel Etingof",
      "Debashish Goswami",
      "Arnab Mandal",
      "Chelsea Walton"
    ],
    "publication_date": "2015-07-30T13:09:12Z",
    "arxiv_id": "http://arxiv.org/abs/1507.08486v2",
    "download_url": "https://arxiv.org/abs/1507.08486v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On properties of principal elements of Frobenius Lie algebras",
    "abstract": "We investigate the properties of principal elements of Frobenius Lie algebras, following the work of M. Gerstenhaber and A. Giaquinto. We prove that any Lie algebra with a left symmetric algebra structure can be embedded, in a natural way, as a subalgebra of some sl(m,K), for K= R or C. Hence, the work of Belavin and Drinfeld on solutions of the Classical Yang-Baxter Equation on simple Lie algebras, applied to the particular case of sl(m, K) alone, paves the way to the complete classification of Frobenius and more generally quasi-Frobenius Lie algebras. We prove that, if a Frobenius Lie algebra has the property that every derivation is an inner derivation, then every principal element is semisimple, at least for K=C.\n  As an important case, we prove that in the Lie algebra of the group of affine motions of the Euclidean space of finite dimension, every derivation is inner. We also bring a class of examples of Frobenius Lie algebras, that hence are subalgebras of sl(m, K), but yet have nonsemisimple principal elements as well as some with semisimple principal elements having nonrational eigenvalues, where K=R or C.",
    "authors": [
      "Andre Diatta",
      "Bakary Manga"
    ],
    "publication_date": "2012-12-21T10:13:33Z",
    "arxiv_id": "http://arxiv.org/abs/1212.5380v2",
    "download_url": "https://arxiv.org/abs/1212.5380v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representations of Finite Dimensional Pointed Hopf Algebras over $\\mathbb{z}_n$",
    "abstract": "In this paper, we study the representations of the new finite-dimensional pointed Hopf algebras in positive characteristic given in \\cite{Cib09}. We find that these Hopf algebras are symmetric algebras. We determine the simple modules and their projective covers over these Hopf algebras. We show that these Hopf algebras are of wild representation type.",
    "authors": [
      "Ying Zhang",
      "Hui-Xiang Chen"
    ],
    "publication_date": "2011-06-21T07:56:15Z",
    "arxiv_id": "http://arxiv.org/abs/1106.4117v1",
    "download_url": "https://arxiv.org/abs/1106.4117v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hom-bialgebras and comodule Hom-algebras",
    "abstract": "We study Hom-bialgebras and objects admitting coactions by Hom-bialgebras.  In particular, we construct a Hom-bialgebra M representing the functor of 2x2-matrices on Hom-associative algebras.  Then we construct a Hom-algebra analogue of the affine plane and show that it is a comodule Hom-algebra over M in a suitable sense.  It is also shown that the enveloping Hom-associative algebra of a Hom-Lie algebra is naturally a Hom-bialgebra.",
    "authors": [
      "Donald Yau"
    ],
    "publication_date": "2008-10-27T16:42:11Z",
    "arxiv_id": "http://arxiv.org/abs/0810.4866v3",
    "download_url": "https://arxiv.org/abs/0810.4866v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic constructions for Jacobi-Jordan algebras",
    "abstract": "For a given Jacobi-Jordan algebra $A$ and a vector space $V$ over a field $k$, a non-abelian cohomological type object ${\\mathcal H}^{2}_{A} \\, (V, \\, A)$ is constructed: it classifies all Jacobi-Jordan algebras containing $A$ as a subalgebra of codimension equal to ${\\rm dim}_k (V)$. Any such algebra is isomorphic to a so-called \\emph{unified product} $A \\, \\natural \\, V$. Furthermore, we introduce the bicrossed (semi-direct, crossed, or skew crossed) product $A \\bowtie V$ associated to two Jacobi-Jordan algebras as a special case of the unified product. Several examples and applications are provided: the Galois group of the extension $A \\subseteq A \\bowtie V$ is described as a subgroup of the semidirect product of groups ${\\rm GL}_k (V) \\rtimes {\\rm Hom}_k (V, \\, A)$ and an Artin type theorem for Jacobi-Jordan algebra is proven. The key tools for classifying supersolvable and flag Jacobi-Jordan algebras are introduced.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2021-05-31T06:33:53Z",
    "arxiv_id": "http://arxiv.org/abs/2105.14722v2",
    "download_url": "https://arxiv.org/abs/2105.14722v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representations of hom-Lie algebras",
    "abstract": "In this paper, we study representations of hom-Lie algebras. In particular, the adjoint representation and the trivial representation of hom-Lie algebras are studied in detail. Derivations, deformations, central extensions and derivation extensions of hom-Lie algebras are also studied as an application.",
    "authors": [
      "Yunhe Sheng"
    ],
    "publication_date": "2010-05-02T13:29:20Z",
    "arxiv_id": "http://arxiv.org/abs/1005.0140v4",
    "download_url": "https://arxiv.org/abs/1005.0140v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A commutant realization of Odake's algebra",
    "abstract": "The bcβγ-system W of rank 3 has an action of the affine vertex algebra V_0(sl_2), and the commutant vertex algebra C =Com(V_0(sl_2), W) contains copies of V_{-3/2}(sl_2) and Odake's algebra O. Odake's algebra is an extension of the N=2 superconformal algebra with c=9, and is generated by eight fields which close nonlinearly under operator product expansions. Our main result is that V_{-3/2}(sl_2) and O form a Howe pair (i.e., a pair of mutual commutants) inside C. More generally, any finite-dimensional representation of a Lie algebra g gives rise to a similar Howe pair, and this example corresponds to the adjoint representation of sl_2.",
    "authors": [
      "Thomas Creutzig",
      "Andrew R. Linshaw"
    ],
    "publication_date": "2012-09-27T06:19:49Z",
    "arxiv_id": "http://arxiv.org/abs/1209.6132v3",
    "download_url": "https://arxiv.org/abs/1209.6132v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A survey on the Koszul homology algebra",
    "abstract": "The Koszul homology algebra of a commutative local (or graded) ring $R$ tends to reflect important information about the ring $R$ and its properties. In fact, certain classes of rings are characterized by the algebra structure on their Koszul homologies. In this paper we survey some classical results on the Koszul homology algebras of such rings and highlight some applications. We report on recent progress on the Koszul homology algebras of Koszul algebras and examine some open questions on the topic.",
    "authors": [
      "Rachel N. Diethorn"
    ],
    "publication_date": "2021-03-13T18:21:41Z",
    "arxiv_id": "http://arxiv.org/abs/2103.07767v1",
    "download_url": "https://arxiv.org/abs/2103.07767v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Admissibility Conditions for Degenerate Cyclotomic BMW Algebras",
    "abstract": "We study admissibility conditions for the parameters of degenerate cyclotomic BMW algebras. We show that the u-admissibility condition of Ariki, Mathas and Rui is equivalent to a simple module theoretic condition.",
    "authors": [
      "Frederick M. Goodman"
    ],
    "publication_date": "2009-05-26T17:40:49Z",
    "arxiv_id": "http://arxiv.org/abs/0905.4253v2",
    "download_url": "https://arxiv.org/abs/0905.4253v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Separated Lie models and the homotopy Lie algebra",
    "abstract": "A simply connected topological space X has homotopy Lie algebra $π_*(ΩX) \\tensor \\Q$. Following Quillen, there is a connected differential graded free Lie algebra (dgL) called a Lie model, which determines the rational homotopy type of X, and whose homology is isomorphic to the homotopy Lie algebra. We show that such a Lie model can be replaced with one that has a special property we call separated. The homology of a separated dgL has a particular form which lends itself to calculations.",
    "authors": [
      "Peter Bubenik"
    ],
    "publication_date": "2004-06-21T15:38:37Z",
    "arxiv_id": "http://arxiv.org/abs/math/0406405v3",
    "download_url": "https://arxiv.org/abs/math/0406405v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The universal cover of a monomial triangular algebra without multiple arrows",
    "abstract": "Let A be a basic connected finite dimensional algebra over an algebraically closed field k. Assuming that A is monomial and that the ordinary quiver Q of A has no oriented cycle and no multiple arrows, we prove that A admits a universal cover with group the fundamental group of the underlying space of Q.",
    "authors": [
      "Patrick Le Meur"
    ],
    "publication_date": "2007-01-10T12:52:51Z",
    "arxiv_id": "http://arxiv.org/abs/math/0701282v2",
    "download_url": "https://arxiv.org/abs/math/0701282v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weak Hopf Algebras I: Integral Theory and C^*-structure",
    "abstract": "We give an introduction to the theory of weak Hopf algebras proposed recently as a coassociative alternative of weak quasi-Hopf algebras. We follow an axiomatic approach keeping as close as possible to the \"classical\" theory of Hopf algebras. The emphasis is put on the new structure related to the presence of canonical subalgebras A^L and A^R in any weak Hopf algebra A that play the role of non-commutative numbers in many respects. A theory of integrals is developed in which we show how the algebraic properties of A, such as the Frobenius property, or semisimplicity, or innerness of the square of the antipode, are related to the existence of non-degenerate, normalized, or Haar integrals. In case of C^*-weak Hopf algebras we prove the existence of a unique Haar measure h in A and of a canonical grouplike element g in A implementing the square of the antipode and factorizing into left and right algebra elements. Further discussion of the C^*-case will be presented in Part II.",
    "authors": [
      "G. Bohm",
      "F. Nill",
      "K. Szlachanyi"
    ],
    "publication_date": "1998-05-26T14:07:53Z",
    "arxiv_id": "http://arxiv.org/abs/math/9805116v3",
    "download_url": "https://arxiv.org/abs/math/9805116v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "When almost Cohen-Macaulay algebras map into big Cohen-Macaulay modules",
    "abstract": "In this paper, we show that almost Cohen-Macaulay algebras are solid and in this respect, we seek for some special situation when (a) an almost Cohen-Macaulay algebra will be phantom extension and (b) when it maps into a balanced big Cohen-Macaulay module.",
    "authors": [
      "Rajsekhar Bhattacharyya"
    ],
    "publication_date": "2016-09-11T08:07:43Z",
    "arxiv_id": "http://arxiv.org/abs/1609.03133v2",
    "download_url": "https://arxiv.org/abs/1609.03133v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the equations of the moving curve ideal of a rational algebraic plane curve",
    "abstract": "Given a parametrization of a rational plane algebraic curve C, some explicit adjoint pencils on C are described in terms of determinants. Moreover, some generators of the Rees algebra associated to this parametrization are presented. The main ingredient developed in this paper is a detailed study of the elimination ideal of two homogeneous polynomials in two homogeneous variables that form a regular sequence.",
    "authors": [
      "Laurent Busé"
    ],
    "publication_date": "2007-12-17T10:12:33Z",
    "arxiv_id": "http://arxiv.org/abs/0712.2671v2",
    "download_url": "https://arxiv.org/abs/0712.2671v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Dickson Subcategory Splitting Conjecture for Pseudocompact Algebras",
    "abstract": "Let $A$ be a pseudocompact (or profinite) algebra, so $A=C^*$ where $C$ is a coalgebra. We show that the if the semiartinian part (the \"Dickson\" part) of every $A$-module $M$ splits off in $M$, then $A$ is semiartinian, also giving a positive answer in the case of algebras arising as dual of coalgebras (pseudocompact algebras), to a well known conjecture of Faith.",
    "authors": [
      "M. C. Iovanov",
      "Constantin Nastasescu",
      "Blas Torrecillas-Jover"
    ],
    "publication_date": "2011-09-20T05:44:45Z",
    "arxiv_id": "http://arxiv.org/abs/1109.4210v1",
    "download_url": "https://arxiv.org/abs/1109.4210v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On finite-dimensional Hopf algebras",
    "abstract": "This is a survey on the state-of-the-art of the classification of finite-dimensional complex Hopf algebras. This general question is addressed through the consideration of different classes of such Hopf algebras. Pointed Hopf algebras constitute the class best understood; the classification of those with abelian group is expected to be completed soon and there is substantial progress in the non-abelian case.",
    "authors": [
      "Nicolás Andruskiewitsch"
    ],
    "publication_date": "2014-03-31T00:05:46Z",
    "arxiv_id": "http://arxiv.org/abs/1403.7838v1",
    "download_url": "https://arxiv.org/abs/1403.7838v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Green rings of the 2-rank Taft algebra and its two relatives twisted",
    "abstract": "In the paper, the representation rings (or the Green rings) for a family of Hopf algebras of tame type, the 2-rank Taft algebra (at $q=-1$) and its two relatives twisted by 2-cocycles are explicitly described via a representation theoretic analysis. It turns out that the Green rings can serve to detect effectively the twist-equivalent Hopf algebras here.",
    "authors": [
      "Yunnan Li",
      "Naihong Hu"
    ],
    "publication_date": "2013-05-07T09:22:52Z",
    "arxiv_id": "http://arxiv.org/abs/1305.1444v6",
    "download_url": "https://arxiv.org/abs/1305.1444v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hibi algebras and representation theory",
    "abstract": "This paper gives a survey on the relation between Hibi algebras and representation theory. The notion of Hodge algebras or algebras with straightening laws has been proved to be very useful to describe the structure of many important algebras in classical invariant theory and representation theory. In particular, a special type of such algebras introduced by Hibi provides a nice bridge between combinatorics and representation theory of classical groups. We will examine certain poset structures of Young tableaux and affine monoids, Hibi algebras in toric degenerations of flag varieties, and their relations to polynomial representations of the complex general linear group.",
    "authors": [
      "Sangjib Kim",
      "Victor Protsak"
    ],
    "publication_date": "2018-06-11T23:22:22Z",
    "arxiv_id": "http://arxiv.org/abs/1806.04264v1",
    "download_url": "https://arxiv.org/abs/1806.04264v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Presenting quantum Schur algebras as quotients of the quantized universal enveloping algebra of gl(2)",
    "abstract": "We obtain a presentation of quantum Schur algebras (over the field Q(v)) by generators and relations. This presentation is compatible with the usual presentation of the quantized universal enveloping algebra of the Lie algebra gl(2). We also locate the ``integral'' form of the quantum Schur algebra within the presented algebra and show it has a basis which is closely related to Lusztig's basis of the integral form of the quantized enveloping algebra.",
    "authors": [
      "Stephen Doty",
      "Anthony Giaquinto"
    ],
    "publication_date": "2000-11-21T20:21:36Z",
    "arxiv_id": "http://arxiv.org/abs/math/0011164v2",
    "download_url": "https://arxiv.org/abs/math/0011164v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Categories and weak equivalences of graded algebras",
    "abstract": "When one studies the structure (e.g. graded ideals, graded subspaces, radicals, ...) or graded polynomial identities of graded algebras, the grading group itself does not play an important role, but can be replaced by any other group that realizes the same grading. Here we come to the notion of weak equivalence of gradings: two gradings are weakly equivalent if there exists an isomorphism between the graded algebras that maps each graded component onto a graded component. Each group grading on an algebra can be weakly equivalent to G-gradings for many different groups G, however it turns out that there is one distinguished group among them called the universal group of the grading. In this paper we study categories and functors related to the notion of weak equivalence of gradings. In particular, we introduce an oplax 2-functor that assigns to each grading its support and show that the universal grading group functor has neither left nor right adjoint.",
    "authors": [
      "Alexey Gordienko",
      "Ofir Schnabel"
    ],
    "publication_date": "2018-05-10T17:26:26Z",
    "arxiv_id": "http://arxiv.org/abs/1805.04073v2",
    "download_url": "https://arxiv.org/abs/1805.04073v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Infinitesimal deformations of restricted simple Lie algebras I",
    "abstract": "We compute the infinitesimal deformations of two families of restricted simple modular Lie algebras of Cartan type: the Witt-Jacobson and the Special Lie algebras.",
    "authors": [
      "Filippo Viviani"
    ],
    "publication_date": "2006-12-29T20:12:49Z",
    "arxiv_id": "http://arxiv.org/abs/math/0612861v3",
    "download_url": "https://arxiv.org/abs/math/0612861v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Nichols algebras over basic Hopf algebras",
    "abstract": "This is a contribution to the classification of finite-dimensional Hopf algebras over an algebraically closed field $\\Bbbk$ of characteristic 0. Concretely, we show that a finite-dimensional Hopf algebra whose Hopf coradical is basic is a lifting of a Nichols algebra of a semisimple Yetter-Drinfeld module and we explain how to classify Nichols algebras of this kind. We provide along the way new examples of Nichols algebras and Hopf algebras with finite Gelfand-Kirillov dimension.",
    "authors": [
      "Nicolás Andruskiewitsch",
      "Iván Angiono"
    ],
    "publication_date": "2018-02-01T14:58:09Z",
    "arxiv_id": "http://arxiv.org/abs/1802.00316v4",
    "download_url": "https://arxiv.org/abs/1802.00316v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of division gradings on finite-dimensional simple real algebras",
    "abstract": "We classify, up to isomorphism and up to equivalence, division gradings (by abelian groups) on finite-dimensional simple real algebras. Gradings on finite-dimensional simple algebras are determined by division gradings, so our results give the classification, up to isomorphism, of (not necessarily division) gradings on such algebras.\n  Linear algebra over the field of two elements plays an interesting role in the proofs.",
    "authors": [
      "Adrián Rodrigo-Escudero"
    ],
    "publication_date": "2015-06-04T11:30:52Z",
    "arxiv_id": "http://arxiv.org/abs/1506.01552v2",
    "download_url": "https://arxiv.org/abs/1506.01552v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Frobenius-Schur indicators for semisimple Lie algebras",
    "abstract": "Let g be a finite dimensional complex semisimple Lie algebra, and let V be a finite dimensional represenation of g. We give a closed formula for the mth Frobenius-Schur indicator, m>1, of V in representation-theoretic terms. We deduce that the indicators take integer values, and that for a large enough m, the mth indicator of V equals the dimension of the zero weight space of V. For the classical Lie algebras sl(n), so(2n), so(2n+1) and sp(2n), this is the case for m greater or equal to 2n-1, 4n-5, 4n-3 and 2n+1, respectively.",
    "authors": [
      "Mohammad Abu-Hamed",
      "Shlomo Gelaki"
    ],
    "publication_date": "2007-04-02T10:59:52Z",
    "arxiv_id": "http://arxiv.org/abs/0704.0165v1",
    "download_url": "https://arxiv.org/abs/0704.0165v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Division algebras in monoidal categories",
    "abstract": "This work adapts the equivalent definitions of division algebras over a field into multiple types of division algebras in a monoidal category. Examples and consequences of these definitions are then established in various monoidal settings.",
    "authors": [
      "Jacob Kesten",
      "Chelsea Walton"
    ],
    "publication_date": "2025-02-04T17:54:03Z",
    "arxiv_id": "http://arxiv.org/abs/2502.02532v3",
    "download_url": "https://arxiv.org/abs/2502.02532v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computing minimal free resolutions of right modules over noncommutative algebras",
    "abstract": "In this paper we propose a general method for computing a minimal free right resolution of a finitely presented graded right module over a finitely presented graded noncommutative algebra. In particular, if such module is the base field of the algebra then one obtains its graded homology. The approach is based on the possibility to obtain the resolution via the computation of syzygies for modules over commutative algebras. The method behaves algorithmically if one bounds the degree of the required elements in the resolution. Of course, this implies a complete computation when the resolution is a finite one. Finally, for a monomial right module over a monomial algebra we provide a bound for the degrees of the non-zero Betti numbers of any single homological degree in terms of the maximal degree of the monomial relations of the module and the algebra.",
    "authors": [
      "Roberto La Scala"
    ],
    "publication_date": "2016-05-23T09:07:13Z",
    "arxiv_id": "http://arxiv.org/abs/1605.06944v3",
    "download_url": "https://arxiv.org/abs/1605.06944v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Counting Using Hall Algebras I. Quivers",
    "abstract": "We survey some results on counting the rational points of moduli spaces of quiver representations. We then make generalizations to Grassmannians and flags of quiver representations. These results have nice applications to the cluster algebra. Along the way, we use the full Hopf structure of the Hall algebra of a quiver.",
    "authors": [
      "Jiarui Fei"
    ],
    "publication_date": "2011-11-28T14:39:46Z",
    "arxiv_id": "http://arxiv.org/abs/1111.6452v2",
    "download_url": "https://arxiv.org/abs/1111.6452v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The colored symmetric and exterior algebras",
    "abstract": "We study colored generalizations of the symmetric algebra and its Koszul dual, the exterior algebra. The symmetric group $\\mathfrak{S}_n$ acts on the multilinear components of these algebras. While $\\mathfrak{S}_n$ acts trivially on the multilinear components of the colored symmetric algebra, we use poset topology techniques to understand the representation on its Koszul dual. We introduce an $\\mathfrak{S}_n$-poset of weighted subsets that we call the weighted boolean algebra and we prove that the multilinear components of the colored exterior algebra are $\\mathfrak{S}_n$-isomorphic to the top cohomology modules of its maximal intervals. We use a technique of Sundaram to compute group representations on Cohen-macaulay posets to give a generating formula for the Frobenius series of the colored exterior algebra. We exploit that formula to find an explicit expression for the expansion of the corresponding representations in terms of irreducible $\\mathfrak{S}_n$-representations. We show that the two colored Koszul dual algebras are Koszul in the sense of Priddy.",
    "authors": [
      "Rafael S. González D'León"
    ],
    "publication_date": "2016-08-02T07:12:31Z",
    "arxiv_id": "http://arxiv.org/abs/1608.00715v3",
    "download_url": "https://arxiv.org/abs/1608.00715v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hopf algebras arising from dg manifolds",
    "abstract": "Let $(\\mathcal{M}, Q)$ be a dg manifold. The space of vector fields with shifted degrees $(\\mathcal{X}(\\mathcal{M})[-1], L_Q)$ is a Lie algebra object in the homology category $\\mathrm{H}((C^{\\infty}_{\\mathcal{M}},Q)\\mathrm{-}\\mathbf{mod})$ of dg modules over $(\\mathcal{M},Q)$, the Atiyah class $α_{\\mathcal{M}}$ being its Lie bracket. The triple $(\\mathcal{X}(\\mathcal{M})[-1], L_Q; α_{\\mathcal{M}})$ is also a Lie algebra object in the Gabriel-Zisman homotopy category $Π((C^{\\infty}_{\\mathcal{M}},Q)\\mathrm{-}\\mathbf{mod})$.\n  In this paper, we describe the universal enveloping algebra of $(\\mathcal{X}(\\mathcal{M})[-1], L_Q; α_{\\mathcal{M}})$ and prove that it is a Hopf algebra object in $Π((C^{\\infty}_{\\mathcal{M}},Q)\\mathrm{-}\\mathbf{mod})$. As an application, we study Fedosov dg Lie algebroids and recover a result of Stiénon, Xu, and the second author on the Hopf algebra arising from a Lie pair.",
    "authors": [
      "Jiahao Cheng",
      "Zhuo Chen",
      "Dadi Ni"
    ],
    "publication_date": "2019-11-04T18:17:51Z",
    "arxiv_id": "http://arxiv.org/abs/1911.01388v4",
    "download_url": "https://arxiv.org/abs/1911.01388v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The quantum divided power algebra of a finite-dimensional Nichols algebra of diagonal type",
    "abstract": "Let $\\mathcal{B}_\\mathfrak{q}$ be a finite-dimensional Nichols algebra of diagonal type corresponding to a matrix $\\mathfrak{q}$. We consider the graded dual $\\mathcal{L}_{\\mathfrak{q}}$ of the distinguished pre-Nichols algebra $\\widetilde{\\mathcal{B}}_{\\mathfrak{q}}$ from [A3] and the divided powers algebra $\\mathcal{U}_{\\mathfrak{q}}$, a suitable Drinfeld double of $\\mathcal{L}_{\\mathfrak{q}} # \\mathbf{k} \\mathbb{Z}^θ$. We provide basis and presentations by generators and relations of $\\mathcal{L}_{\\mathfrak{q}}$ and $\\mathcal{U}_{\\mathfrak{q}}$, and prove that they are noetherian and have finite Gelfand-Kirillov dimension.",
    "authors": [
      "Nicolás Andruskiewitsch",
      "Iván Angiono",
      "Fiorela Rossi Bertone"
    ],
    "publication_date": "2015-01-19T15:16:11Z",
    "arxiv_id": "http://arxiv.org/abs/1501.04518v5",
    "download_url": "https://arxiv.org/abs/1501.04518v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Potent preservers of incidence algebras",
    "abstract": "Let $X$ be a finite connected poset, $F$ a field and $I(X,F)$ the incidence algebra of $X$ over $F$. We describe the bijective linear idempotent preservers $\\varphi:I(X,F)\\to I(X,F)$. Namely, we prove that, whenever $\\mathrm{char}(F)\\ne 2$, $\\varphi$ is either an automorphism or an anti-automorphism of $I(X,F)$. If $\\mathrm{char}(F)=2$ and $|F|>2$, then $\\varphi$ is a (in general, non-proper) Lie automorphism of $I(X,F)$. Finally, if $F=\\mathbb{Z}_2$, then $\\varphi$ is the composition of a bijective shift map and a Lie automorphism of $I(X,F)$. Under certain restrictions on the characteristic of $F$ we also obtain descriptions of the bijective linear maps which preserve tripotents and, more generally, $k$-potents of $I(X,F)$ for $k\\ge 3$.",
    "authors": [
      "Jorge J. Garcés",
      "Mykola Khrypchenko"
    ],
    "publication_date": "2021-10-20T17:32:39Z",
    "arxiv_id": "http://arxiv.org/abs/2110.10676v2",
    "download_url": "https://arxiv.org/abs/2110.10676v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Almost Cohen-Macaulay and almost regular algebras via almost flat extensions",
    "abstract": "The present paper deals with various aspects of the notion of almost Cohen-Macaulay property, which was introduced and studied by Roberts, Singh and Srinivas. We employ the definition of almost zero modules as defined by a value map, which is different from the version of Gabber-Ramero. We prove that, if the local cohomology modules of an algebra $T$ of certain type over a local Noetherian ring are almost zero, $T$ maps to a big Cohen-Macaulay algebra. Then we study how the almost Cohen-Macaulay property behaves under almost faithfully flat extension. As a consequence, we study the structure of $F$-coherent rings of positive characteristic in terms of almost regularity.",
    "authors": [
      "Mohsen Asgharzadeh",
      "Kazuma Shimomoto"
    ],
    "publication_date": "2010-03-01T07:25:47Z",
    "arxiv_id": "http://arxiv.org/abs/1003.0265v3",
    "download_url": "https://arxiv.org/abs/1003.0265v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Linear Mappings of Free Algebra",
    "abstract": "For arbitrary F-algebra, in which the operation of addition is defined, I explore biring of matrices of mappings. The sum of matrices is determined by the sum in F-algebra, and the product of matrices is determined by the product of mappings. The system of equations, whose matrix is a matrix of mappings, is called a system of additive equations. I considered the methods of solving system of additive equations. As an example, I consider the solution of a system of linear equations over the complex field provided that the equations contain unknown quantities and their conjugates.\n  Linear mappings of algebra over a commutative ring preserve the operation of addition in algebra and the product of elements of the algebra by elements of the ring. The representation of tensor product A\\otimes A in algebra A generates the set of linear transformations of algebra A.\n  The results of this research will be useful for mathematicians and physicists who deal with different algebras.",
    "authors": [
      "Aleks Kleyn"
    ],
    "publication_date": "2010-03-08T02:58:37Z",
    "arxiv_id": "http://arxiv.org/abs/1003.1544v2",
    "download_url": "https://arxiv.org/abs/1003.1544v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Indecomposability for differential algebraic groups",
    "abstract": "We study a notion of indecomposability in differential algebraic groups which is inspired by both model theory and differential algebra. After establishing some basic definitions and results, we prove an indecomposability theorem for differential algebraic groups. The theorem establishes a sufficient criterion for the subgroup of a differential algebraic group generated by an infinite family of subvarieties to be a differential algebraic subgroup. This theorem is used for various definability results. For instance, we show every noncommutative almost simple differential algebraic group is perfect, solving a problem of Cassidy and Singer. We also establish numerous bounds on Kolchin polynomials, some of which seem to be of a nature not previously considered in differential algebraic geometry; in particular, we establish bounds on the Kolchin polynomial of the generators of the differential field of definition of a differential algebraic variety.",
    "authors": [
      "James Freitag"
    ],
    "publication_date": "2011-06-03T15:58:28Z",
    "arxiv_id": "http://arxiv.org/abs/1106.0695v3",
    "download_url": "https://arxiv.org/abs/1106.0695v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The quantum algebra $U_q(sl_2)$ and its equitable presentation",
    "abstract": "We show that the quantum algebra $U_q(sl_2)$ has a presentation with generators $x,x^{-1},y,z$ and relations\n  $x x^{-1}=1$, $x^{-1} x=1$,\n  $\\frac{qxy-q^{-1}yx}{q-q^{-1}}=1$,\n  $\\frac{qyz-q^{-1}zy}{q-q^{-1}}=1$,\n  $\\frac{qzx-q^{-1}xz}{q-q^{-1}}=1$.\n  We call this the equitable presentation. We investigate the action of $x,x^{-1},y,z$ on finite-dimensional $U_q(sl_2)$-modules.",
    "authors": [
      "Tatsuro Ito",
      "Paul Terwilliger",
      "Chih-wen Weng"
    ],
    "publication_date": "2005-07-22T13:42:41Z",
    "arxiv_id": "http://arxiv.org/abs/math/0507477v1",
    "download_url": "https://arxiv.org/abs/math/0507477v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An $\\mathfrak{sl}_2$-type tensor category for the Virasoro algebra at central charge $25$ and applications",
    "abstract": "Let $\\mathcal{O}_{25}$ be the vertex algebraic braided tensor category of finite-length modules for the Virasoro Lie algebra at central charge $25$ whose composition factors are the irreducible quotients of reducible Verma modules. We show that $\\mathcal{O}_{25}$ is rigid and that its simple objects generate a semisimple tensor subcategory that is braided tensor equivalent to an abelian $3$-cocycle twist of the category of finite-dimensional $\\mathfrak{sl}_2$-modules. We also show that this $\\mathfrak{sl}_2$-type subcategory is braid-reversed tensor equivalent to a similar category for the Virasoro algebra at central charge $1$. As an application, we construct a simple conformal vertex algebra which contains the Virasoro vertex operator algebra of central charge $25$ as a $PSL_2(\\mathbb{C})$-orbifold. We also use our results to study Arakawa's chiral universal centralizer algebra of $SL_2$ at level $-1$, showing that it has a symmetric tensor category of representations equivalent to $\\mathrm{Rep}\\,PSL_2(\\mathbb{C})$. This algebra is an extension of the tensor product of Virasoro vertex operator algebras of central charges $1$ and $25$, analogous to the modified regular representations of the Virasoro algebra constructed earlier for generic central charges by I. Frenkel-Styrkas and I. Frenkel-M. Zhu.",
    "authors": [
      "Robert McRae",
      "Jinwei Yang"
    ],
    "publication_date": "2022-02-15T12:19:40Z",
    "arxiv_id": "http://arxiv.org/abs/2202.07351v3",
    "download_url": "https://arxiv.org/abs/2202.07351v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Brace algebras and the cohomology comparison theorem",
    "abstract": "The Gerstenhaber and Schack cohomology comparison theorem asserts that there is a cochain equivalence between the Hochschild complex of a certain algebra and the usual singular cochain complex of a space. We show that this comparison theorem preserves the brace algebra structures. This result gives a structural reason for the recent results establishing fine topological structures on the Hochschild cohomology, and a simple way to derive them from the corresponding properties of cochain complexes.",
    "authors": [
      "F. Patras"
    ],
    "publication_date": "2001-12-18T14:16:22Z",
    "arxiv_id": "http://arxiv.org/abs/math/0112177v2",
    "download_url": "https://arxiv.org/abs/math/0112177v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Hopf (co)center of a Hopf algebra",
    "abstract": "The notion of Hopf center and Hopf cocenter of a Hopf algebra is investigated by the extension theory of Hopf algebras. We prove that each of them yields an exact sequence of Hopf algebras. Moreover the exact sequences are shown to satisfy the faithful (co)flatness condition. Hopf center and cocenter are computed for $\\mathsf{U}_q(\\mathfrak{g})$ and the Hopf algebra $\\textrm{Pol}(\\mathbb{G}_q)$, where $\\mathbb{G}_q$ is the Drinfeld-Jimbo quantization of a compact semisimple simply connected Lie group $\\mathbb{G}$ and $\\mathfrak{g}$ is a simple complex Lie algebra.",
    "authors": [
      "Alexandru Chirvasitu",
      "Paweł Kasprzak"
    ],
    "publication_date": "2015-12-11T18:13:48Z",
    "arxiv_id": "http://arxiv.org/abs/1512.03749v4",
    "download_url": "https://arxiv.org/abs/1512.03749v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Linear resolutions over Koszul complexes and Koszul homology algebras",
    "abstract": "Let $R$ be a standard graded commutative algebra over a field $k$, let $K$ be its Koszul complex viewed as a differential graded $k$-algebra, and let $H$ be the homology algebra of $K$. This paper studies the interplay between homological properties of the three algebras $R$, $K$, and $H$. In particular, we introduce two definitions of Koszulness that extend the familiar property originally introduced by Priddy: one which applies to $K$ (and, more generally, to any connected differential graded $k$-algebra) and the other, called strand-Koszulness, which applies to $H$. The main theoretical result is a complete description of how these Koszul properties of $R$, $K$, and $H$ are related to each other. This result shows that strand-Koszulness of $H$ is stronger than Koszulness of $R$, and we include examples of classes of algebras which have Koszul homology algebras that are strand-Koszul.",
    "authors": [
      "John Myers"
    ],
    "publication_date": "2019-06-10T17:12:31Z",
    "arxiv_id": "http://arxiv.org/abs/1906.04136v3",
    "download_url": "https://arxiv.org/abs/1906.04136v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The central simple modules of Artinian Gorenstein algebras",
    "abstract": "Let A be a standard graded Artinian algebra over a field of characteristic zero and let z be a linear form in A. We define the central simple modules for each such pair (A, z). Assume that A is Gorenstein. Then we prove that A has the strong Lefschetz property if and only if there exists a linear form z in A such that all central simple modules of the pair (A,z) have the strong Lefschetz property. In the course of proof we need to extend the definition of the strong Lefschetz property to finite graded modules over graded Artinian algebra, which previously was defined only for standard graded Artinian algebras.",
    "authors": [
      "T. Harima",
      "J. Watanabe"
    ],
    "publication_date": "2006-12-13T06:26:24Z",
    "arxiv_id": "http://arxiv.org/abs/math/0612344v1",
    "download_url": "https://arxiv.org/abs/math/0612344v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On finitistic dimension of stratified algebras",
    "abstract": "In this survey we discuss the results on the finitistic dimension of various stratified algebras. We describe what is already known, present some recent estimates, and list some open problems.",
    "authors": [
      "Volodymyr Mazorchuk"
    ],
    "publication_date": "2006-03-08T07:31:07Z",
    "arxiv_id": "http://arxiv.org/abs/math/0603179v1",
    "download_url": "https://arxiv.org/abs/math/0603179v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Koszul blowup algebras associated to three-dimensional Ferrers diagrams",
    "abstract": "We investigate the Rees algebra and the toric ring of the squarefree monomial ideal associated to the three-dimensional Ferrers diagram. Under the projection property condition, we describe explicitly the presentation ideals of the Rees algebra and the toric ring. We show that the toric ring is a Koszul Cohen--Macaulay normal domain, while the Rees algebra is Koszul and the defining ideal is of fiber type.",
    "authors": [
      "Kuei-Nuan Lin",
      "Yi-Huang Shen"
    ],
    "publication_date": "2017-09-11T05:55:00Z",
    "arxiv_id": "http://arxiv.org/abs/1709.03251v2",
    "download_url": "https://arxiv.org/abs/1709.03251v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exceptional sequences and Drinfeld double Hall algebras",
    "abstract": "Let $\\A$ be a finitary hereditary abelian category and $D(\\A)$ be its reduced Drinfeld double Hall algebra. By giving explicit formulas in $D(\\A)$ for left and right mutations, we show that the subalgebras of $D(\\A)$ generated by exceptional sequences are invariant under mutation equivalences. As an application, we obtain that if $\\A$ is the category of finite dimensional modules over a finite dimensional hereditary algebra, or the category of coherent sheaves on a weighted projective line, the double composition algebra of $\\A$ is generated by any complete exceptional sequence. Moreover, for the Lie algebra case, we also have paralleled results.",
    "authors": [
      "Shiquan Ruan",
      "Haicheng Zhang"
    ],
    "publication_date": "2016-12-29T06:38:58Z",
    "arxiv_id": "http://arxiv.org/abs/1612.09051v2",
    "download_url": "https://arxiv.org/abs/1612.09051v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Morita context and Galois extensions for Quasi-Hopf algebras",
    "abstract": "If H is a finite dimensional quasi-Hopf algebra and A is a left H-module algebra, we prove that there is a Morita context connecting the smash product A#H and the subalgebra of invariants A^{H}. We define also Galois extensions and prove the connection with this Morita context, as in the Hopf case.",
    "authors": [
      "Adriana Balan"
    ],
    "publication_date": "2007-05-24T19:12:13Z",
    "arxiv_id": "http://arxiv.org/abs/0705.3515v2",
    "download_url": "https://arxiv.org/abs/0705.3515v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Noetherian quotients of the algebra of partial difference polynomials and Grobner bases of symmetric ideals",
    "abstract": "In this paper we develop a Grobner bases theory for ideals of partial difference polynomials with constant or non-constant coefficients. In particular, we introduce a criterion providing the finiteness of such bases when a difference ideal contains elements with suitable linear leading monomials. This can be explained in terms of Noetherianity of the corresponding quotient algebra. Among these Noetherian quotients we find finitely generated polynomial algebras where the action of suitable finite dimensional commutative algebras and in particular finite abelian groups is defined. We obtain therefore a consistent Grobner bases theory for ideals that possess such symmetries.",
    "authors": [
      "Vladimir P. Gerdt",
      "Roberto La Scala"
    ],
    "publication_date": "2013-04-30T12:03:25Z",
    "arxiv_id": "http://arxiv.org/abs/1304.7967v4",
    "download_url": "https://arxiv.org/abs/1304.7967v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Connected quantized Weyl algebras and quantum cluster algebras",
    "abstract": "For an algebraically closed field $K$, we investigate a class of noncommutative $K$-algebras called connected quantized Weyl algebras. Such an algebra has a PBW basis for a set of generators $\\{x_1,\\dots,x_n\\}$ such that each pair satisfies a relation of the form $x_ix_j=q_{ij}x_jx_i+r_{ij}$, where $q_{ij}\\in K^*$ and $r_{ij}\\in K$, with, in some sense, sufficiently many pairs for which $r_{ij}\\neq 0$. We classify connected quantized Weyl algebras, showing that there are two types, linear and cyclic, each depending on a single parameter $q$. When $q$ is not a root of unity we determine the prime spectra for each type. In the linear case all prime ideals are completely prime but in the cyclic case, which can only occur if $n$ is odd, there are prime ideals for which the factors have arbitrarily large Goldie rank.\n  We apply connected quantized Weyl algebras to obtain presentations of the quantum cluster algebras for two classes of quiver, namely, for $m$ even, the Dynkin quiver of type $A_m$ and the quiver $P_m^{(1)}$ identified by Fordy and Marsh in their analysis of periodic quiver mutation.\n  We establish Poisson analogues of the results on prime ideals and quantum cluster algebras.",
    "authors": [
      "Christopher D. Fish",
      "David A. Jordan"
    ],
    "publication_date": "2016-11-29T16:50:43Z",
    "arxiv_id": "http://arxiv.org/abs/1611.09721v3",
    "download_url": "https://arxiv.org/abs/1611.09721v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Group actions on central simple algebras: a geometric approach",
    "abstract": "We study actions of linear algebraic groups on central simple algebras using algebro-geometric techniques. Suppose an algebraic group G acts on a central simple algebra A of degree n. We are interested in questions of the following type: (a) Do the G-fixed elements form a central simple subalgebra of A of degree n? (b) Does A have a G-invariant maximal subfield? (c) Does A have a splitting field with a G-action, extending the G-action on the center of A?\n  Somewhat surprisingly, we find that under mild assumptions on A and the actions, one can answer these questions by using techniques from birational invariant theory (i.e., the study of group actions on algebraic varieties, up to equivariant birational isomorphisms). In fact, group actions on central simple algebras turn out to be related to some of the central problems in birational invariant theory, such as the existence of sections, stabilizers in general position, affine models, etc. In this paper we explain these connections and explore them to give partial answers to questions (a)-(c).",
    "authors": [
      "Zinovy Reichstein",
      "Nikolaus Vonessen"
    ],
    "publication_date": "2004-08-31T02:31:15Z",
    "arxiv_id": "http://arxiv.org/abs/math/0408420v2",
    "download_url": "https://arxiv.org/abs/math/0408420v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tate and Tate-Hochschild Cohomology for finite dimensional Hopf Algebras",
    "abstract": "Let A be any finite dimensional Hopf algebra over a field k. We specify the Tate and Tate-Hochschild cohomology for A and introduce cup products that make them become graded rings. We establish the relationship between these rings. In particular, the Tate-Hochschild cohomology of A is isomorphic (as algebras) to its Tate cohomology with coefficients in an adjoint module. Consequently, the Tate cohomology ring of A is a direct summand of its Tate-Hochschild cohomology ring. As an example, we explicitly compute both the Tate and Tate-Hochschild cohomology for the Sweedler algebra H_4.",
    "authors": [
      "Van C. Nguyen"
    ],
    "publication_date": "2012-09-21T19:20:56Z",
    "arxiv_id": "http://arxiv.org/abs/1209.4888v2",
    "download_url": "https://arxiv.org/abs/1209.4888v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Applications of closure operations on big CohenMacaulay algebras",
    "abstract": "In this note we present some remarks on big Cohen-Macaulay algebras. Our methods for doing this are inspired by the notion of dagger closure and by ideas of Northcott on dropping of the Noetherian assumption of certain homological properties.",
    "authors": [
      "Mohsen Asgharzadeh",
      "Rajsekhar Bhattacharyya"
    ],
    "publication_date": "2010-09-08T06:10:30Z",
    "arxiv_id": "http://arxiv.org/abs/1009.1454v2",
    "download_url": "https://arxiv.org/abs/1009.1454v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Transport of structure in higher homological algebra",
    "abstract": "We fill a gap in the literature regarding `transport of structure' for (n+2)-angulated, n-exact, n-abelian and n-exangulated categories appearing in (classical and higher) homological algebra. As an application of our main results, we show that a skeleton of one of these kinds of categories inherits the same structure in a canonical way, up to equivalence. In particular, it follows that a skeleton of a weak (n+2)-angulated category is in fact what we call a strong (n+2)-angulated category. When n=1 this clarifies a technical concern with the definition of a cluster category. We also introduce the notion of an n-exangulated functor between n-exangulated categories. This recovers the definition of an (n+2)-angulated functor when the categories concerned are (n+2)-angulated, and the higher analogue of an exact functor when the categories concerned are n-exact.",
    "authors": [
      "Raphael Bennett-Tennenhaus",
      "Amit Shah"
    ],
    "publication_date": "2020-03-04T18:52:35Z",
    "arxiv_id": "http://arxiv.org/abs/2003.02254v3",
    "download_url": "https://arxiv.org/abs/2003.02254v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Vertex-algebraic structure of the principal subspaces of level one modules for the untwisted affine Lie algebras of types A,D,E",
    "abstract": "Generalizing some of our earlier work, we prove natural presentations of the principal subspaces of the level one standard modules for the untwisted affine Lie algebras of types A, D and E, and also of certain related spaces. As a consequence, we obtain a canonical complete set of recursions (q-difference equations) for the (multi-)graded dimensions of these spaces, and we derive their graded dimensions. Our methods are based on intertwining operators in vertex operator algebra theory.",
    "authors": [
      "Corina Calinescu",
      "James Lepowsky",
      "Antun Milas"
    ],
    "publication_date": "2009-08-27T18:21:51Z",
    "arxiv_id": "http://arxiv.org/abs/0908.4054v2",
    "download_url": "https://arxiv.org/abs/0908.4054v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Diagram automorphisms and canonical bases for quantized enveloping algebras",
    "abstract": "Let ${\\mathbf U}^-_q$ be the negative part of the quantized enveloping algebra associated to a Kac-Moody algebra ${\\mathfrak g}$ of symmetric type, and $\\underline{\\mathbf U}^-_q$ the algebra corresponding to the orbit algebra ${\\mathfrak g}^σ$ obtained from an admissible diagram automorphism $σ$ on ${\\mathfrak g}$. Lusztig consructed the canonical basis ${\\mathbf B}$ of ${\\mathbf U}_q^-$ and the canonical signed basis $\\underline{\\widetilde{\\mathbf B}}$ of $\\underline{\\mathbf U}_q^-$ by making use of the geometric theory of quivers. He proved that there is a natural bijection $\\widetilde{\\mathbf B}^σ \\to \\widetilde{\\underline{\\mathbf B}}$. In this paper, assuming the existence of the canonical basis ${\\mathbf B}$ of ${\\mathbf U}_q^-$, we construct the canonical signed basis $\\widetilde{\\underline{\\mathbf B}}$ of $\\underline{\\mathbf U}_q^-$, and a natural bijection $\\widetilde{\\mathbf B}^σ \\to \\widetilde{\\underline{\\mathbf B}}$ by an elementary method.",
    "authors": [
      "Ying Ma",
      "Toshiaki Shoji",
      "Zhiping Zhou"
    ],
    "publication_date": "2021-08-15T07:16:43Z",
    "arxiv_id": "http://arxiv.org/abs/2108.06673v3",
    "download_url": "https://arxiv.org/abs/2108.06673v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Double loop quantum enveloping algebras",
    "abstract": "In this paper we describe certain homological properties and representations of a two-parameter quantum enveloping algebra $U_{g,h}$ of ${\\frak {sl}}(2)$, where $g,h$ are group-like elements.",
    "authors": [
      "Zhixiang Wu"
    ],
    "publication_date": "2013-03-03T14:00:41Z",
    "arxiv_id": "http://arxiv.org/abs/1303.0498v1",
    "download_url": "https://arxiv.org/abs/1303.0498v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New generalized simple Lie algebras of Cartan type over a field with charcteristic 0",
    "abstract": "We construct four new series of generalized simple Lie algebras of Cartan type, using the mixtures of grading operators and down-grading operators. Our results in this paper are further generalizations of those in Osborn's work ``New simple infinite-dimensional Lie algebras of characteristic 0.''",
    "authors": [
      "Xiaoping Xu"
    ],
    "publication_date": "1999-11-27T05:22:11Z",
    "arxiv_id": "http://arxiv.org/abs/math/9911221v1",
    "download_url": "https://arxiv.org/abs/math/9911221v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lie algebras and degenerate Affine Hecke Algebras of type A",
    "abstract": "We construct a family of exact functors from the BGG category of representations of the Lie algebra sl to the category of finite-dimensional representations of the degenerate (or graded) affine Hecke algebra H of GL. These functors transform Verma modules to standard modules or zero, and simple modules to simple modules or zero. Any simple H-module can be thus obtained.",
    "authors": [
      "T. Arakawa",
      "T. Suzuki"
    ],
    "publication_date": "1997-10-30T07:17:56Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9710037v2",
    "download_url": "https://arxiv.org/abs/q-alg/9710037v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Duplex Hecke Algebras of type B",
    "abstract": "As a sequel to [14], in this article we first introduce a so-called duplex Hecke algebras of type B which is a Q(q)-algebra associated with the Weyl group W (B) of type B, and symmetric groups S_l for l = 0, 1, . . . ,m, satisfying some Hecke relations. This notion originates from the degenerate duplex Hecke algebra arising from the course of study of a kind of Schur-Weyl duality of Levi-type, extending the duplex Hecke algebra of type A arising from the related q-Schur-Weyl duality of Levi-type. A duplex Hecke algebra of type B admits natural representations on certain tensor spaces. We then establish a Levi-type q-Schur-Weyl duality of type B, which reveals the double centralizer property between such duplex Hecke algebras and ıquantum groups studied by Bao-Wang in [1].",
    "authors": [
      "Yu Xie",
      "An Zhang",
      "Bin Shu"
    ],
    "publication_date": "2023-12-11T08:57:13Z",
    "arxiv_id": "http://arxiv.org/abs/2312.06214v2",
    "download_url": "https://arxiv.org/abs/2312.06214v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The strong Lefschetz property for Artinian algebras with non-standard grading",
    "abstract": "We define the strong Lefschetz property for finite graded modules over graded Artinian algebras whose grading is not necessarily standard. We show that most results which have been obtained for Artinian algebras with standard grading can be extended for non-standard grading. Our results on the strong Lefschetz property for non-standard grading can be used to prove that certain Artinian complete intersections with standard grading have the strong Lefschetz property.",
    "authors": [
      "Tadahito Harima",
      "Junzo Watanabe"
    ],
    "publication_date": "2007-02-15T10:42:19Z",
    "arxiv_id": "http://arxiv.org/abs/math/0702444v1",
    "download_url": "https://arxiv.org/abs/math/0702444v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Basic quasi-Hopf algebras of dimension n^3",
    "abstract": "It is shown in math.QA/0310253 that a finite dimensional quasi-Hopf algebra over the complex numbers with radical of codimension 2 is twist equivalent to a Nichols Hopf algebra, or to a lifting of one of four special quasi-Hopf algebras of dimensions 2, 8, 8, and 32. The purpose of this paper is to construct new finite dimensional basic quasi-Hopf algebras A(q) of dimension n^3, n>2, parametrized by primitive roots of unity q of order n^2, with radical of codimension n, which generalize the construction of the basic quasi-Hopf algebras of dimension 8 given in math.QA/0310253. These quasi-Hopf algebras are not twist equivalent to a Hopf algebra, and may be regarded as quasi-Hopf analogs of Taft Hopf algebras. By math.QA/0301027, our construction is equivalent to the construction of new finite tensor categories whose simple objects form a cyclic group of order n, and which are not tensor equivalent to a representation category of a Hopf algebra. In a later publication we plan to use our construction to classify finite tensor categories whose simple objects form a cyclic group of prime order n. We also prove that if H is a finite dimensional radically graded quasi-Hopf algebra with H[0]=(C[\\Z/n\\Z],Φ), where n is prime and Φis a nontrivial associator, such that H[1] is a free left module over H[0] of rank 1 (it is always free) then H is isomorphic to A(q).",
    "authors": [
      "Shlomo Gelaki"
    ],
    "publication_date": "2004-02-10T15:47:01Z",
    "arxiv_id": "http://arxiv.org/abs/math/0402159v3",
    "download_url": "https://arxiv.org/abs/math/0402159v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Invertible bimodule categories over the representation category of a Hopf algebra",
    "abstract": "For any finite-dimensional Hopf algebra $H$ we construct a group homomorphism $\\biga(H)\\to \\text{BrPic}(\\Rep(H))$, from the group of equivalence classes of $H$-biGalois objects to the group of equivalence classes of invertible exact $\\Rep(H)$-bimodule categories. We discuss the injectivity of this map. We exemplify in the case $H=T_q$ is a Taft Hopf algebra and for this we classify all exact indecomposable $\\Rep(T_q)$-bimodule categories.",
    "authors": [
      "Bojana Femic",
      "Adriana Mejia Castaño",
      "Martin Mombelli"
    ],
    "publication_date": "2014-02-12T20:15:59Z",
    "arxiv_id": "http://arxiv.org/abs/1402.2955v1",
    "download_url": "https://arxiv.org/abs/1402.2955v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cohomologies and crossed modules for pre-Lie Rinehart algebras",
    "abstract": "A pre-Lie-Rinehart algebra is an algebraic generalization of the notion of a left-symmetric algebroid. We construct pre-Lie-Rinehart algebras from r-matrices through Lie algebra actions. We study cohomologies of pre-Lie-Rinehart algebras and show that abelian extensions of pre-Lie-Rinehart algebras are classified by the second cohomology groups. We introduce the notion of crossed modules for pre-Lie-Rinehart algebras and show that they are classified by the third cohomology groups of pre-Lie-Rinehart algebras. At last, we use (pre-)Lie-Rinehart 2-algebras to characterize the crossed modules for (pre-)Lie Rinehart algebras.",
    "authors": [
      "Liangyun Chen",
      "Meijun Liu",
      "Jiefeng Liu"
    ],
    "publication_date": "2021-10-28T02:35:21Z",
    "arxiv_id": "http://arxiv.org/abs/2110.14857v2",
    "download_url": "https://arxiv.org/abs/2110.14857v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Local topological algebraicity with algebraic coefficients of analytic sets or functions",
    "abstract": "We prove that any complex or real analytic set or function germ is topologically equivalent to a germ defined by polynomial equations whose coefficients are algebraic numbers.",
    "authors": [
      "Guillaume Rond"
    ],
    "publication_date": "2017-06-19T13:42:52Z",
    "arxiv_id": "http://arxiv.org/abs/1706.05938v2",
    "download_url": "https://arxiv.org/abs/1706.05938v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Grothendieck Group of Hopf Algebras",
    "abstract": "Let H be a cosemisimple Hopf algebra over an algebraically closed field k which contains a simple subcoalgebra of dimension 9. We show that if H has no simple subcoalgebras of even dimension then H contains either a grouplike element with order 2 or 3, a Hopf subalgebra of dimension 75, or a family of simple subcoalgebras whose dimensions are the squares of each positive odd integer. In particular, if H is finite odd dimensional, then its dimension is divisible by 3.",
    "authors": [
      "S. Burciu"
    ],
    "publication_date": "2003-10-24T19:33:42Z",
    "arxiv_id": "http://arxiv.org/abs/math/0310388v3",
    "download_url": "https://arxiv.org/abs/math/0310388v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The extended affine Lie algebra associated with a connected non-negative unit form",
    "abstract": "Given a connected non-negative unit form we construct an extended affine Lie algebra by giving a Chevalley basis for it. We also obtain this algebra as a quotient of an algebra defined by means of generalized Serre relations by M. Barot, D. Kussin and H. Lenzing. This is done in an analogous way to the construction of the simply-laced affine Kac-Moody algebras. Thus, we obtain a family of extended affine Lie algebras of simply-laced Dynkin type and arbitrary nullity. Furthermore, there is a one-to-one correspondence between these Lie algebras and the equivalence classes of connected non-negative unit forms.",
    "authors": [
      "Gustavo Jasso"
    ],
    "publication_date": "2012-09-19T21:57:50Z",
    "arxiv_id": "http://arxiv.org/abs/1209.4380v3",
    "download_url": "https://arxiv.org/abs/1209.4380v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On module categories over finite-dimensional Hopf algebras",
    "abstract": "We show that indecomposable exact module categories over the category Rep H of representations of a finite-dimensional Hopf algebra H are classified by left comodule algebras, H-simple from the right and with trivial coinvariants, up to equivariant Morita equivalence. Specifically, any indecomposable exact module categories is equivalent to the category of finite-dimensional modules over a left comodule algebra. This is an alternative approach to the results of Etingof and Ostrik. For this, we study the stabilizer introduced by Yan and Zhu and show that it coincides with the internal Hom. We also describe the correspondence of module categories between Rep H and Rep (H^*).",
    "authors": [
      "Nicolas Andruskiewitsch",
      "Juan Martin Mombelli"
    ],
    "publication_date": "2006-08-31T13:19:19Z",
    "arxiv_id": "http://arxiv.org/abs/math/0608781v2",
    "download_url": "https://arxiv.org/abs/math/0608781v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Generalized Vertex Operator Algebra for Heisenberg Intertwiners",
    "abstract": "We consider the extension of the Heisenberg vertex operator algebra by all its irreducible modules. We give an elementary construction for the intertwining vertex operators and show that they satisfy a complex parametrized generalized vertex operator algebra. We illustrate some of our results with the example of integral lattice vertex operator superalgebras.",
    "authors": [
      "Michael P. Tuite",
      "Alexander Zuevsky"
    ],
    "publication_date": "2011-06-30T09:01:41Z",
    "arxiv_id": "http://arxiv.org/abs/1106.6149v2",
    "download_url": "https://arxiv.org/abs/1106.6149v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ado theorem for nilpotent Hom-Lie algebras",
    "abstract": "We prove an analog of the Ado theorem - the existence of a finite-dimensional faithful representation - for a certain kind of finite-dimensional nilpotent Hom-Lie algebras.",
    "authors": [
      "Abdenacer Makhlouf",
      "Pasha Zusmanovich"
    ],
    "publication_date": "2018-07-28T14:56:49Z",
    "arxiv_id": "http://arxiv.org/abs/1807.10944v2",
    "download_url": "https://arxiv.org/abs/1807.10944v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On finite generation of Noetherian algebras over two-dimensional regular local rings",
    "abstract": "Let $R$ be a complete regular local ring with an algebraically closed residue field and let $A$ be a Noetherian $R$-subalgebra of the polynomial ring $R[X]$. It has been shown in \\cite{DO2} that if $\\dim R=1$, then $A$ is necessarily finitely generated over $R$. In this paper, we give necessary and sufficient conditions for $A$ to be finitely generated over $R$ when $\\dim R=2$ and present an example of a Noetherian normal non-finitely generated $R$-subalgebra of $R[X]$ over $R= {\\mathbb C}[[u, v]]$.",
    "authors": [
      "Amartya Kumar Dutta",
      "Neena Gupta",
      "Nobuharu Onoda"
    ],
    "publication_date": "2020-04-19T14:47:09Z",
    "arxiv_id": "http://arxiv.org/abs/2004.08869v1",
    "download_url": "https://arxiv.org/abs/2004.08869v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fusion rules and complete reducibility of certain modules for affine Lie algebras",
    "abstract": "We develop a new method for obtaining branching rules for affine Kac-Moody Lie algebras at negative integer levels. This method uses fusion rules for vertex operator algebras of affine type. We prove that an infinite family of ordinary modules for affine vertex algebra of type A investigated in Adamović and O. Perše (2008) is closed under fusion. Then we apply these fusion rules on explicit bosonic realization of level -1 modules for the affine Lie algebra of type $A_{\\ell-1}^{(1)}$, obtain a new proof of complete reducibility for these representations, and the corresponding decomposition for $\\ell \\ge 3$. We also obtain the complete reducibility of the associated level -1 modules for affine Lie algebra of type $C_{\\ell}^{(1)}$. Next we notice that the category of $D_{2 \\ell -1}^{(1)}$ modules at level $- 2 \\ell +3 $ obtained in Perše (2012) has the isomorphic fusion algebra. This enables us to decompose certain $E_6 ^{(1)}$ and $F_4 ^{(1)}$--modules at negative levels.",
    "authors": [
      "Drazen Adamovic",
      "Ozren Perse"
    ],
    "publication_date": "2012-07-31T07:17:33Z",
    "arxiv_id": "http://arxiv.org/abs/1207.7177v2",
    "download_url": "https://arxiv.org/abs/1207.7177v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Infinitesimal Hecke algebra of sl_2 in positive characteristic",
    "abstract": "In this paper we consider an infinitesimal Hecke algebra of $sl_2$ in positive characteristic. We show that it is a finitely generated module over its center, and the smooth and the Azumaya loci of its center coincide.",
    "authors": [
      "Akaki Tikaradze"
    ],
    "publication_date": "2007-11-30T04:04:02Z",
    "arxiv_id": "http://arxiv.org/abs/0711.4867v3",
    "download_url": "https://arxiv.org/abs/0711.4867v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bidiagonal Triads and the Tetrahedron Algebra",
    "abstract": "We introduce a linear algebraic object called a bidiagonal triad. A bidiagonal triad is a modification of the previously studied and similarly defined concept of bidiagonal triple. A bidiagonal triad and a bidiagonal triple both consist of three diagonalizable linear transformations on a finite-dimensional vector space, each of which acts in a bidiagonal fashion on the eigenspaces of the other two. A triad differs from a triple in the way these bidiagonal actions are defined. We modify a number of theorems about bidiagonal triples to the case of bidiagonal triads. We also describe the close relationship between bidiagonal triads and the representation theory of the tetrahedron Lie algebra.",
    "authors": [
      "Darren Funk-Neubauer"
    ],
    "publication_date": "2021-07-13T21:45:09Z",
    "arxiv_id": "http://arxiv.org/abs/2107.06408v1",
    "download_url": "https://arxiv.org/abs/2107.06408v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the structures of hive algebras and tensor product algebras for general linear groups of low rank",
    "abstract": "The tensor product algebra TA(n) for the complex general linear group GL(n), introduced by Howe et al., describes the decomposition of tensor products of irreducible polynomial representations of GL(n). Using the hive model for the Littlewood-Richardson coefficients, we provide a finite presentation of the algebra TA(n) for n=2, 3, 4 in terms of generators and relations, thereby giving a description of highest weight vectors of irreducible representations in the tensor products. We also compute the generating function of certain sums of Littlewood-Richardson coefficients.",
    "authors": [
      "Donggyun Kim",
      "Sangjib Kim",
      "Euisung Park"
    ],
    "publication_date": "2017-12-07T00:31:17Z",
    "arxiv_id": "http://arxiv.org/abs/1712.02454v2",
    "download_url": "https://arxiv.org/abs/1712.02454v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New algebraic properties of quadratic quotients of the Rees algebra",
    "abstract": "We study some properties of a family of rings $R(I)_{a,b}$ that are obtained as quotients of the Rees algebra associated with a ring $R$ and an ideal $I$. In particular, we give a complete description of the spectrum of every member of the family and describe the localizations at a prime ideal. Consequently, we are able to characterize the Cohen-Macaulay and Gorenstein properties, generalizing known results stated in the local case. Moreover, we study when $R(I)_{a,b}$ is an integral domain, reduced, quasi-Gorenstein, or satisfies Serre's conditions.",
    "authors": [
      "Marco D'Anna",
      "Francesco Strazzanti"
    ],
    "publication_date": "2017-06-19T21:13:27Z",
    "arxiv_id": "http://arxiv.org/abs/1706.06180v2",
    "download_url": "https://arxiv.org/abs/1706.06180v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cliffold algebras, modular Virasoro vertex operator algebras and Z[1/2]-forms",
    "abstract": "This paper consists of two parts: (1) Using a Z[1/2]-form of Virasoro vertex operator algebra L(1/2,0) with central charge 1/2, we obtain a modular vertex operator algebra over any field F of finite characteristic different from 2. We determine the generators and classify the irreducible modules for this vertex operator algebra. (2) We investigate modular framed vertex operator algebras. In particular, the rationality of modular framed vertex operator algebras is established. For a modular code vertex operator algebra, the irreducible modules are constructed and classified. Moreover, a Z[1/2]-form for any framed vertex operator algebra over complex field C is constructed. As a result, one can obtain a modular framed vertex operator algebra from any framed vertex operator algebra over C.",
    "authors": [
      "Chongying Dong",
      "Ching Hung Lam",
      "Li Ren"
    ],
    "publication_date": "2017-09-13T07:28:06Z",
    "arxiv_id": "http://arxiv.org/abs/1709.04167v2",
    "download_url": "https://arxiv.org/abs/1709.04167v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A categorical proof of the Parshin reciprocity laws on algebraic surfaces",
    "abstract": "We define and study the 2-category of torsors over a Picard groupoid, a central extension of a group by a Picard groupoid, and commutator maps in this central extension. Using it in the context of two-dimensional local fields and two-dimensional adelic theory we obtain the two-dimensional tame symbol and a new proof of Parshin reciprocity laws on an algebraic surface.",
    "authors": [
      "Denis Osipov",
      "Xinwen Zhu"
    ],
    "publication_date": "2010-02-25T19:42:44Z",
    "arxiv_id": "http://arxiv.org/abs/1002.4848v3",
    "download_url": "https://arxiv.org/abs/1002.4848v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Crossed-products of Calabi-Yau algebras by finite groups",
    "abstract": "Let a finite group G act on a differential graded algebra A. This article presents necessary conditions and sufficient conditions for the skew group algebra A*G to be Calabi-Yau. In particular, when A is the Ginzburg dg algebra of a quiver with an invariant potential, then A*G is Calabi-Yau and Morita equivalent to a Ginzburg dg algebra. Some applications of these results are derived to compare the generalised cluster categories of A and A*G when they are defined and to compare the higher Auslander-Reiten theories of A and A*G when A is a finite dimensional algebra.",
    "authors": [
      "Patrick Le Meur"
    ],
    "publication_date": "2010-06-06T05:20:59Z",
    "arxiv_id": "http://arxiv.org/abs/1006.1082v3",
    "download_url": "https://arxiv.org/abs/1006.1082v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Minimal free resolution of generalized repunit algebras",
    "abstract": "Let $\\Bbbk$ be an arbitrary field and let $b > 1, n > 1$ and $a$ be three positive integers. In this paper we explicitly describe a minimal $S-$graded free resolution of the semigroup algebra $\\Bbbk[S]$ when $S$ is a generalized repunit numerical semigroup, that is, when $S$ is the submonoid of $\\mathbb{N}$ generated by $\\{a_1, a_2, \\ldots, a_n\\}$ where $a_1 = \\sum_{j=0}^{n-1} b^j$ and $a_i - a_{i-1} = a\\, b^{i-2},\\ i = 2, \\ldots, n$, with $\\gcd(a,a_1) = 1$.",
    "authors": [
      "Isabel Colaço",
      "Ignacio Ojeda"
    ],
    "publication_date": "2023-12-10T21:52:50Z",
    "arxiv_id": "http://arxiv.org/abs/2312.06013v2",
    "download_url": "https://arxiv.org/abs/2312.06013v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Two constructions of grading-restricted vertex (super)algebras",
    "abstract": "We give two constructions of grading-restricted vertex (super)algebras. We first give a new construction of a class of grading-restricted vertex (super)algebras originally obtained by Meurman and Primc using a different method. This construction is based on a new definition of vertex operators and a new method. Our second construction is a generalization of the author's construction of the moonshine module vertex operator algebra and a related vertex operator superalgebra. This construction needs properties of intertwining operators formulated and proved by the author.",
    "authors": [
      "Yi-Zhi Huang"
    ],
    "publication_date": "2015-07-22T08:27:16Z",
    "arxiv_id": "http://arxiv.org/abs/1507.06098v2",
    "download_url": "https://arxiv.org/abs/1507.06098v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Note on Odd Periodic derived Hall algebras",
    "abstract": "Let $m$ be an odd positive integer and $D_m(\\mathcal {A})$ be the $m$-periodic derived category of a finitary hereditary abelian category $\\mathcal {A}$. In this note, we prove that there is an embedding of algebras from the derived Hall algebra of $D_m(\\mathcal {A})$ defined by Xu-Chen [13] to the extended derived Hall algebra of $D_m(\\mathcal {A})$ defined in [16]. This homomorphism is given on basis elements, rather than just on generating elements.",
    "authors": [
      "Haicheng Zhang",
      "Xinran Zhang",
      "Zhiwei Zhu"
    ],
    "publication_date": "2023-07-18T08:43:07Z",
    "arxiv_id": "http://arxiv.org/abs/2307.09071v2",
    "download_url": "https://arxiv.org/abs/2307.09071v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Set theoretic complete intersection for curves in a smooth affine algebra",
    "abstract": "It is proved in this paper that a locally complete intersection curve in a smooth affine C-algebra with trival conormal bundle is a set theoretic complete intersection if its corresponding class in the Grothendieck Group is torsion.",
    "authors": [
      "Ze Min Zeng"
    ],
    "publication_date": "2005-08-12T18:20:08Z",
    "arxiv_id": "http://arxiv.org/abs/math/0508221v1",
    "download_url": "https://arxiv.org/abs/math/0508221v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hochschild products and global non-abelian cohomology for algebras. Applications",
    "abstract": "Let $A$ be a unital associative algebra over a field $k$, $E$ a vector space and $π: E \\to A$ a surjective linear map with $V = {\\rm Ker} (π)$. All algebra structures on $E$ such that $π: E \\to A$ becomes an algebra map are described and classified by an explicitly constructed global cohomological type object ${\\mathbb G} {\\mathbb H}^{2} \\, (A, \\, V)$. Any such algebra is isomorphic to a Hochschild product $A \\star V$, an algebra introduced as a generalization of a classical construction. We prove that ${\\mathbb G} {\\mathbb H}^{2} \\, (A, \\, V)$ is the coproduct of all non-abelian cohomologies ${\\mathbb H}^{2} \\, \\, (A, \\, (V, \\cdot))$. The key object ${\\mathbb G} {\\mathbb H}^{2} \\, (A, \\, k)$ responsible for the classification of all co-flag algebras is computed. All Hochschild products $A \\star k$ are also classified and the automorphism groups ${\\rm Aut}_{\\rm Alg} (A \\star k)$ are fully determined as subgroups of a semidirect product $A^* \\, \\ltimes \\bigl(k^* \\times {\\rm Aut}_{\\rm Alg} (A) \\bigl)$ of groups. Several examples are given as well as applications to the theory of supersolvable coalgebras or Poisson algebras. In particular, for a given Poisson algebra $P$, all Poisson algebras having a Poisson algebra surjection on $P$ with a $1$-dimensional kernel are described and classified.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2015-03-18T12:10:43Z",
    "arxiv_id": "http://arxiv.org/abs/1503.05364v2",
    "download_url": "https://arxiv.org/abs/1503.05364v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unified products for Leibniz algebras. Applications",
    "abstract": "Let $\\mathfrak{g}$ be a Leibniz algebra and $E$ a vector space containing $\\mathfrak{g}$ as a subspace. All Leibniz algebra structures on $E$ containing $\\mathfrak{g}$ as a subalgebra are explicitly described and classified by two non-abelian cohomological type objects: ${\\mathcal H}{\\mathcal L}^{2}_{\\mathfrak{g}} \\, (V, \\, \\mathfrak{g})$ provides the classification up to an isomorphism that stabilizes $\\mathfrak{g}$ and ${\\mathcal H}{\\mathcal L}^{2} \\, (V, \\, \\mathfrak{g})$ will classify all such structures from the view point of the extension problem - here $V$ is a complement of $\\mathfrak{g}$ in $E$. A general product, called the unified product, is introduced as a tool for our approach. The crossed (resp. bicrossed) products between two Leibniz algebras are introduced as special cases of the unified product: the first one is responsible for the extension problem while the bicrossed product is responsible for the factorization problem. The description and the classification of all complements of a given extension $\\mathfrak{g} \\subseteq \\mathfrak{E} $ of Leibniz algebras are given as a converse of the factorization problem. They are classified by another cohomological object denoted by ${\\mathcal H}{\\mathcal A}^{2}(\\mathfrak{h}, \\mathfrak{g} \\, | \\, (\\triangleright, \\triangleleft, \\leftharpoonup, \\rightharpoonup))$, where $(\\triangleright, \\triangleleft, \\leftharpoonup, \\rightharpoonup)$ is the canonical matched pair associated to a given complement $\\mathfrak{h}$. Several examples are worked out in details.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2013-07-09T18:46:47Z",
    "arxiv_id": "http://arxiv.org/abs/1307.2540v3",
    "download_url": "https://arxiv.org/abs/1307.2540v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symbolic blowup algebras and invariants associated to certain monomial curves in ${\\mathbb P}^3$",
    "abstract": "In this paper we explicitly describe the symbolic powers of curves ${\\mathcal C}(q,m)$ in ${\\mathbb P}^3$ parametrized by\n  $( x^{d+2m}, x^{d+m} y^m, x^{d} y^{2m}, y^{d+2m})$, where $q,m$ are positive integers, $d=2q+1$ and $\\gcd(d,m)=1$. The defining ideal of these curves is a set-theoretic complete intersection. We show that the symbolic blowup algebra is Noetherian and Gorenstein. An explicit formula for the resurgence and the Waldschmidt constant of the prime ideal ${\\mathfrak p}:={\\mathfrak p}_{ { \\mathcal C}(q,m) }$ defining the curve ${\\mathcal C}(q,m)$ is computed. We also give a formula for the Castelnuovo-Mumford regularity of the symbolic powers ${\\mathfrak p}^{(n)}$ for all $n \\geq 1$.",
    "authors": [
      "Clare D'Cruz",
      "Mousumi Mandal"
    ],
    "publication_date": "2019-04-01T04:26:54Z",
    "arxiv_id": "http://arxiv.org/abs/1904.00556v3",
    "download_url": "https://arxiv.org/abs/1904.00556v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The algebraic structure of the universal complicial sets",
    "abstract": "The nerve of a strict omega-category is a simplicial set with additional structure, making it into a so-called complicial set, and strict omega-categories are in fact equivalent to complicial sets. The nerve functor is represented by a sequence of strict omega-categories, called orientals, which are associated to simplexes. In this paper we give a detailed algebraic description of the morphisms between orientals. The aim is to describe complicial sets algebraically, by operators and equational axioms.",
    "authors": [
      "Richard Steiner"
    ],
    "publication_date": "2010-09-17T10:07:22Z",
    "arxiv_id": "http://arxiv.org/abs/1009.3384v2",
    "download_url": "https://arxiv.org/abs/1009.3384v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Big Cohen-Macaulay and seed algebras in equal characteristic zero via ultraproducts",
    "abstract": "Let $R$ be a commutative, local, Noetherian ring. In a past article, the first author developed a theory of $R$-algebras, termed seeds, that can be mapped to balanced big Cohen-Macaulay $R$-algebras. In prime characteristic $p$, seeds can be characterized based on the existence of certain colon-killers, integral extensions of seeds are seeds, tensor products of seeds are seeds, and the seed property is stable under base change between complete, local domains. As a result, there exist directed systems of big Cohen-Macaulay algebras over complete, local domains. In this work, we will show that these properties can be extended to analogous results in equal characteristic zero. The primary tool for the extension will be the notion of ultraproducts for commutative rings as developed by Schoutens and Aschenbrenner.",
    "authors": [
      "Geoffrey D. Dietz",
      "Rebecca R. G"
    ],
    "publication_date": "2016-08-29T19:48:52Z",
    "arxiv_id": "http://arxiv.org/abs/1608.08193v2",
    "download_url": "https://arxiv.org/abs/1608.08193v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Derived Hall Algebras",
    "abstract": "The purpose of this work is to define a derived Hall algebra $\\mathcal{DH}(T)$, associated to any dg-category $T$ (under some finiteness conditions). Our main theorem states that $\\mathcal{DH}(T)$ is associative and unital. It is shown that $\\mathcal{DH}(T)$ contains the usual Hall algebra $\\mathcal{H}(T)$ when $T$ is an abelian category. We will also prove an explicit formula for the derived Hall numbers purely in terms of invariants of the triangulated category associated to $T$. As an example, we describe the derived Hall algebra of an hereditary abelian category.",
    "authors": [
      "B. Toen"
    ],
    "publication_date": "2005-01-21T12:35:33Z",
    "arxiv_id": "http://arxiv.org/abs/math/0501343v4",
    "download_url": "https://arxiv.org/abs/math/0501343v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric combinatorial algebras: cyclohedron and simplex",
    "abstract": "In this paper we report on results of our investigation into the algebraic structure supported by the combinatorial geometry of the cyclohedron. Our new graded algebra structures lie between two well known Hopf algebras: the Malvenuto-Reutenauer algebra of permutations and the Loday-Ronco algebra of binary trees. Connecting algebra maps arise from a new generalization of the Tonks projection from the permutohedron to the associahedron, which we discover via the viewpoint of the graph associahedra of Carr and Devadoss. At the same time that viewpoint allows exciting geometrical insights into the multiplicative structure of the algebras involved. Extending the Tonks projection also reveals a new graded algebra structure on the simplices. Finally this latter is extended to a new graded Hopf algebra (one-sided) with basis all the faces of the simplices.",
    "authors": [
      "Stefan Forcey",
      "Derriell Springfield"
    ],
    "publication_date": "2009-08-20T23:01:29Z",
    "arxiv_id": "http://arxiv.org/abs/0908.3111v2",
    "download_url": "https://arxiv.org/abs/0908.3111v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Variational calculus of supervariables and related algebraic structures",
    "abstract": "We establish a formal variational calculus of supervariables, which is a combination of the bosonic theory of Gel'fand-Dikii and the fermionic theory in our earlier work. Certain interesting new algebraic structures are found in connection with Hamiltonian superoperators in terms of our theory. In particular, we find connections between Hamiltonian superoperators and Novikov-Poisson algebras that we introduced in our earlier work in order to establish a tensor theory of Novikov algebras. Furthermore, we prove that an odd linear Hamiltonian superoperator in our variational calculus induces a Lie superalgebra, which is a natural generalization of the Super-Virasoro algebra under certain conditions.",
    "authors": [
      "Xiaoping Xu"
    ],
    "publication_date": "1999-11-24T07:11:05Z",
    "arxiv_id": "http://arxiv.org/abs/math/9911191v1",
    "download_url": "https://arxiv.org/abs/math/9911191v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Realizing Algebra Structures on Free Resolutions of Grade 3 Perfect Ideals",
    "abstract": "Perfect ideals $I$ of grade $3$ in a local ring $(R,\\mathfrak{m},\\Bbbk)$ can be classified based on multiplicative structures on $\\text{Tor}^R_{\\bullet}(R/I,\\Bbbk)$. The classification is incomplete in the sense that it remains open which of the possible algebra structures actually occur; this realizability question was formally posed by Avramov in 2012. Of five classes of algebra structures, the realizability question has been answered for one class. In this work, we answer the realizability question for two more classes and contribute towards an answer for a third.",
    "authors": [
      "Alexis Hardesty"
    ],
    "publication_date": "2024-03-01T22:29:21Z",
    "arxiv_id": "http://arxiv.org/abs/2403.01016v2",
    "download_url": "https://arxiv.org/abs/2403.01016v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A combinatorial description of the centralizer algebras connected to the Links-Gould Invariant",
    "abstract": "In this paper we study the tensor powers of the standard representation of the quantum super-algebra $U_q(sl(2|1)$, focusing on the rings of its algebra endomorphisms, called centraliser algebras and denoted by $LG_n$. Their dimensions were conjectured by I. Marin and E. Wagner \\cite{MW}. We prove this conjecture, describing the intertwiner spaces from a semi-simple decomposition as sets consisting of certain paths in a planar lattice with integer coordinates. Using this model, we present a matrix unit basis for the centraliser algebra $LG_n$, by means of closed curves in the plane, which are included in the lattice with integer coordinates.",
    "authors": [
      "Cristina Ana-Maria Anghel"
    ],
    "publication_date": "2017-12-13T17:43:53Z",
    "arxiv_id": "http://arxiv.org/abs/1712.04878v2",
    "download_url": "https://arxiv.org/abs/1712.04878v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Lie algebra crossed modules to tensor hierarchies",
    "abstract": "The present paper, though inspired by the use of tensor hierarchies in theoretical physics, establishes their mathematical credentials, especially as genetically related to Lie algebra crossed modules. Gauging procedures in supergravity rely on a pairing - the embedding tensor - between a Leibniz algebra and a Lie algebra. Two such algebras, together with their embedding tensor, form a triple called a Lie-Leibniz triple, of which Lie algebra crossed modules are particular cases. This paper is devoted to showing that any Lie-Leibniz triple induces a differential graded Lie algebra - its associated tensor hierarchy - whose restriction to the category of Lie algebra crossed modules is the canonical assignment associating to any Lie algebra crossed module its corresponding unique 2-term differential graded Lie algebra. This shows that Lie-Leibniz triples form natural generalizations of Lie algebra crossed modules and that their associated tensor hierarchies can be considered as some kind of 'lie-ization' of the former. We deem the present construction of such tensor hierarchies clearer and more straightforward than previous derivations. We stress that such a construction suggests the existence of further well-defined Leibniz gauge theories.",
    "authors": [
      "Sylvain Lavau",
      "Jim Stasheff"
    ],
    "publication_date": "2020-03-17T17:41:19Z",
    "arxiv_id": "http://arxiv.org/abs/2003.07838v6",
    "download_url": "https://arxiv.org/abs/2003.07838v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mutation of frozen Jacobian algebras",
    "abstract": "We survey results on mutations of Jacobian algebras, while simultaneously extending them to the more general setup of frozen Jacobian algebras, which arise naturally from dimer models with boundary and in the context of the additive categorification of cluster algebras with frozen variables via Frobenius categories. As an application, we show that the mutation of cluster-tilting objects in various such categorifications, such as the Grassmannian cluster categories of Jensen-King-Su, is compatible with Fomin-Zelevinsky mutation of quivers. We also describe an extension of this combinatorial mutation rule allowing for arrows between frozen vertices, which the quivers arising from categorifications and dimer models typically have.",
    "authors": [
      "Matthew Pressland"
    ],
    "publication_date": "2018-10-02T11:48:20Z",
    "arxiv_id": "http://arxiv.org/abs/1810.01179v3",
    "download_url": "https://arxiv.org/abs/1810.01179v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Criterion for Isomorphism of Artinian Gorenstein Algebras",
    "abstract": "Let $A$ be an Artinian Gorenstein algebra over an infinite field $k$ with either $\\hbox{char}(k)=0$ or $\\hbox{char}(k)>ν$, where $ν$ is the socle degree of $A$. To every such algebra and a linear projection $π$ on its maximal ideal ${\\mathfrak m}$ with range equal to the socle $\\hbox {Soc}(A)$ of $A$, one can associate a certain algebraic hypersurface $S_π\\subset{\\mathfrak m}$, which is the graph of a polynomial map $P_π:\\hbox{ker}\\,π\\to \\hbox{Soc}(A)\\simeq k$. Recently, the author and his collaborators have obtained the following surprising criterion: two Artinian Gorenstein algebras $A$, $\\tilde A$ are isomorphic if and only if any two hypersurfaces $S_π$ and $S_{\\tildeπ}$ arising from $A$ and $\\tilde A$, respectively, are affinely equivalent. The proof is indirect and relies on a geometric argument. In the present paper we give a short algebraic proof of this statement. We also discuss a connection, established elsewhere, between the polynomials $P_π$ and Macaulay inverse systems.",
    "authors": [
      "A. V. Isaev"
    ],
    "publication_date": "2015-06-13T02:10:16Z",
    "arxiv_id": "http://arxiv.org/abs/1506.04211v1",
    "download_url": "https://arxiv.org/abs/1506.04211v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the algebraic boundaries among typical ranks for real binary forms",
    "abstract": "We describe the algebraic boundaries of the regions of real binary forms with fixed typical rank and of degree at most eight, showing that they are dual varieties of suitable coincident root loci.",
    "authors": [
      "Maria Chiara Brambilla",
      "Giovanni Staglianò"
    ],
    "publication_date": "2018-04-23T09:49:57Z",
    "arxiv_id": "http://arxiv.org/abs/1804.08309v2",
    "download_url": "https://arxiv.org/abs/1804.08309v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Commuting varieties of $r$-tuples over Lie algebras",
    "abstract": "Let $G$ be a simple algebraic group defined over an algebraically closed field $k$ of characteristic $p$ and let $\\g$ be the Lie algebra of $G$. It is well known that for $p$ large enough the spectrum of the cohomology ring for the $r$-th Frobenius kernel of $G$ is homeomorphic to the commuting variety of $r$-tuples of elements in the nilpotent cone of $\\g$ [Suslin-Friedlander-Bendel, J. Amer. Math. Soc, \\textbf{10} (1997), 693--728]. In this paper, we study both geometric and algebraic properties including irreducibility, singularity, normality and Cohen-Macaulayness of the commuting varieties $C_r(\\mathfrak{gl}_2), C_r(\\fraksl_2)$ and $C_r(\\N)$ where $\\N$ is the nilpotent cone of $\\fraksl_2$. Our calculations lead us to state a conjecture on Cohen-Macaulayness for commuting varieties of $r$-tuples. Furthermore, in the case when $\\g=\\fraksl_2$, we obtain interesting results about commuting varieties when adding more restrictions into each tuple. In the case of $\\fraksl_3$, we are able to verify the aforementioned properties for $C_r(\\fraku)$. Finally, applying our calculations on the commuting variety $C_r(\\overline{\\calO_{\\sub}})$ where $\\overline{\\calO_{\\sub}}$ is the closure of the subregular orbit in $\\fraksl_3$, we prove that the nilpotent commuting variety $C_r(\\N)$ has singularities of codimension $\\ge 2$.",
    "authors": [
      "Nham V. Ngo"
    ],
    "publication_date": "2012-09-07T22:02:22Z",
    "arxiv_id": "http://arxiv.org/abs/1209.1659v2",
    "download_url": "https://arxiv.org/abs/1209.1659v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Images of Multilinear Polynomials in the Algebra of Finitary Matrices Contain Trace Zero Matrices",
    "abstract": "Let $F$ be an infinite field and let $f$ be a nonzero multilinear polynomial with coefficients in $F$. We prove that for every positive integer $d$ there exists a positive integer $s$ such that $f(M_{s}(F))$, the image of $f$ in $M_{s}(F)$, contains all trace zero $d \\times d$ matrices. In particular, the image of $f$ in the algebra of all finitary matrices contains all trace zero finitary matrices.",
    "authors": [
      "Daniel Vitas"
    ],
    "publication_date": "2021-08-01T20:50:59Z",
    "arxiv_id": "http://arxiv.org/abs/2108.00539v1",
    "download_url": "https://arxiv.org/abs/2108.00539v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On a family of Caldero-Chapoton algebras that have the Laurent phenomenon",
    "abstract": "We realize a family of generalized cluster algebras as Caldero-Chapoton algebras of quivers with relations. Each member of this family arises from an unpunctured polygon with one orbifold point of order 3, and is realized as a Caldero-Chapoton algebra of a quiver with relations naturally associated to any triangulation of the alluded polygon. The realization is done by defining for every arc $j$ on the polygon with orbifold point a representation $M(j)$ of the referred quiver with relations, and by proving that for every triangulation $τ$ and every arc $j\\inτ$, the product of the Caldero-Chapoton functions of $M(j)$ and $M(j')$, where $j'$ is the arc that replaces $j$ when we flip $j$ in $τ$, equals the corresponding exchange polynomial of Chekhov-Shapiro in the generalized cluster algebra. Furthermore, we show that there is a bijection between the set of generalized cluster variables and the isomorphism classes of $E$-rigid indecomposable decorated representations of $Λ$.",
    "authors": [
      "Daniel Labardini-Fragoso",
      "Diego Velasco"
    ],
    "publication_date": "2017-04-25T22:12:18Z",
    "arxiv_id": "http://arxiv.org/abs/1704.07921v4",
    "download_url": "https://arxiv.org/abs/1704.07921v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Automorphisms and isomorphisms of Chevalley groups and algebras",
    "abstract": "An adjoint Chevalley group of rank at least 2 over a rational algebra (or a similar ring), its elementary subgroup, and the corresponding Lie ring have the same automorphism group. These automorphisms are explicitly described.",
    "authors": [
      "Anton A. Klyachko"
    ],
    "publication_date": "2007-08-16T17:56:22Z",
    "arxiv_id": "http://arxiv.org/abs/0708.2256v4",
    "download_url": "https://arxiv.org/abs/0708.2256v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complex group algebras of the double covers of the symmetric and alternating groups",
    "abstract": "We prove that the double covers of the alternating and symmetric groups are determined by their complex group algebras. To be more precise, let $n\\geq 5$ be an integer, $G$ a finite group, and let $\\AAA$ and $\\SSS^\\pm$ denote the double covers of $\\Al_n$ and $\\Sy_n$, respectively. We prove that $\\CC G\\cong \\CC \\AAA$ if and only if $G\\cong \\AAA$, and $\\CC G\\cong \\CC \\SSS^+\\cong\\CC\\SSS^-$ if and only if $G\\cong \\SSS^+$ or $\\SSS^-$. This in particular completes the proof of a conjecture proposed by the second and fourth authors that every finite quasi-simple group is determined uniquely up to isomorphism by the structure of its complex group algebra. The known results on prime power degrees and relatively small degrees of irreducible (linear and projective) representations of the symmetric and alternating groups together with the classification of finite simple groups play an essential role in the proofs.",
    "authors": [
      "Christine Bessenrodt",
      "Hung Ngoc Nguyen",
      "Jørn B. Olsson",
      "Hung P. Tong-Viet"
    ],
    "publication_date": "2013-08-20T19:26:06Z",
    "arxiv_id": "http://arxiv.org/abs/1308.4388v2",
    "download_url": "https://arxiv.org/abs/1308.4388v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparison of Admissibility Conditions for Cyclotomic Birman--Wenzl--Murakami Algebras",
    "abstract": "We show the equivalence of admissibility conditions proposed by Wilcox and Yu and by Rui and Xu for the parameters of cyclotomic BMW algebras.",
    "authors": [
      "Frederick M. Goodman"
    ],
    "publication_date": "2009-05-26T17:51:38Z",
    "arxiv_id": "http://arxiv.org/abs/0905.4258v2",
    "download_url": "https://arxiv.org/abs/0905.4258v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]