[
  {
    "title": "Schubert Calculus according to Schubert",
    "abstract": "We try to understand and justify Schubert Calculus the way Schubert did it.",
    "authors": [
      "Felice Ronga"
    ],
    "publication_date": "2006-08-31T13:47:15Z",
    "arxiv_id": "http://arxiv.org/abs/math/0608784v1",
    "download_url": "http://arxiv.org/abs/math/0608784v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ravello lecture notes on geometric calculus -- Part I",
    "abstract": "In these notes of lectures at the 2004 Summer School of Mathematical Physics\nin Ravello, Italy, the author develops an approach to calculus in which more\nefficient choices of limits are taken at key points of the development. For\nexample, $k$-dimensional tangent spaces are replaced by representations of\nsimple $k$-vectors supported in single points as limits of simplicial\n$k$-chains in a Banach space (much like Dirac monopoles). This subtle\ndifference has powerful advantages that will be explored. Through these\n``infinitesimals'', we obtain a coordinate free theory on manifolds that builds\nupon the Cartan exterior calculus. An infinite array of approximating theories\nto the calculus of Newton and Lebiniz becomes available and one can now revisit\nold philosophical questions such as which models are most natural for the\ncontinuum or for physics. Applications include three extensions of calculus:\ncalculus on fractals, bilayer calculus (soap bubbles) and discrete calculus.\nThis paper is a draft of the first half of the lectures.",
    "authors": [
      "Jenny Harrison"
    ],
    "publication_date": "2005-01-01T03:58:42Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0501001v2",
    "download_url": "http://arxiv.org/abs/math-ph/0501001v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evaluating the Root-Mean-Squared of a Sinusoidal Signal Without Using\n  Calculus",
    "abstract": "The frequently mentioned root-mean-squared value of an alternating voltage is\nderived without using calculus.",
    "authors": [
      "Rajesh R. Parwani"
    ],
    "publication_date": "2005-07-15T09:15:15Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0507115v1",
    "download_url": "http://arxiv.org/abs/physics/0507115v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Differential calculus on deformed E(2) group",
    "abstract": "Fourdimensional bicovariant differential calculus on quantum E(2) group is\nconstructed.",
    "authors": [
      "S. Giller",
      "C. Gonera",
      "P. Kosinski",
      "P. Maslanka"
    ],
    "publication_date": "1995-01-12T15:04:26Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9501011v1",
    "download_url": "http://arxiv.org/abs/q-alg/9501011v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Malliavin calculus of Bismut type without probability",
    "abstract": "We translate in semigroup theory Bismut's way of the Malliavin calculus.",
    "authors": [
      "Remi Leandre"
    ],
    "publication_date": "2007-07-14T10:33:31Z",
    "arxiv_id": "http://arxiv.org/abs/0707.2143v1",
    "download_url": "http://arxiv.org/abs/0707.2143v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Superdeduction in Lambda-Bar-Mu-Mu-Tilde",
    "abstract": "Superdeduction is a method specially designed to ease the use of first-order\ntheories in predicate logic. The theory is used to enrich the deduction system\nwith new deduction rules in a systematic, correct and complete way.\n  A proof-term language and a cut-elimination reduction already exist for\nsuperdeduction, both based on Christian Urban's work on classical sequent\ncalculus. However the computational content of Christian Urban's calculus is\nnot directly related to the (lambda-calculus based) Curry-Howard\ncorrespondence. In contrast the Lambda bar mu mu tilde calculus is a\nlambda-calculus for classical sequent calculus.\n  This short paper is a first step towards a further exploration of the\ncomputational content of superdeduction proofs, for we extend the Lambda bar mu\nmu tilde calculus in order to obtain a proofterm langage together with a\ncut-elimination reduction for superdeduction. We also prove strong\nnormalisation for this extension of the Lambda bar mu mu tilde calculus.",
    "authors": [
      "Clément Houtmann"
    ],
    "publication_date": "2011-01-28T04:25:40Z",
    "arxiv_id": "http://arxiv.org/abs/1101.5443v1",
    "download_url": "http://arxiv.org/abs/1101.5443v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On calculus of functors in model categories",
    "abstract": "We present an analysis of some constructions and arguments from the universe\nof T. G. Goodwillie's Calculus, in a general model theoretic setting.",
    "authors": [
      "Alexandru E. Stanculescu"
    ],
    "publication_date": "2012-08-09T14:29:04Z",
    "arxiv_id": "http://arxiv.org/abs/1208.1919v1",
    "download_url": "http://arxiv.org/abs/1208.1919v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Identities involving Laguerre polynomials derived from umbral calculus",
    "abstract": "In this paper, we investigate some identities of Laguerre polynomials\ninvolving Bernoulli and Euler polynomials which are derived from umbral\ncalculus.",
    "authors": [
      "Taekyun Kim"
    ],
    "publication_date": "2013-01-15T14:59:59Z",
    "arxiv_id": "http://arxiv.org/abs/1301.3793v1",
    "download_url": "http://arxiv.org/abs/1301.3793v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symbol calculus on a projective space",
    "abstract": "In this article, we introduce symbol calculus on a projective scheme. Using\nholomorphic Poisson structures, we construct deformations of ring structures\nfor structure sheaves on projective spaces.",
    "authors": [
      "Naoya Miyazaki"
    ],
    "publication_date": "2013-03-31T10:35:14Z",
    "arxiv_id": "http://arxiv.org/abs/1304.0184v1",
    "download_url": "http://arxiv.org/abs/1304.0184v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Poly-Cauchy numbers and polynomials with umbral calculus viewpoint",
    "abstract": "In this paper, we give some interesting identities of poly-Cauchy numbers and\npolynomials arising from umbral calculus.",
    "authors": [
      "Dae San Kim",
      "Taekyun Kim"
    ],
    "publication_date": "2013-07-19T11:48:04Z",
    "arxiv_id": "http://arxiv.org/abs/1307.5188v1",
    "download_url": "http://arxiv.org/abs/1307.5188v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A symbolic calculus for Fourier integral operators",
    "abstract": "The paper develops a symbolic calculus for Fourier integral operators\nassociated with canonical transformations.",
    "authors": [
      "Yuri Safarov"
    ],
    "publication_date": "2013-08-19T16:47:31Z",
    "arxiv_id": "http://arxiv.org/abs/1308.4073v1",
    "download_url": "http://arxiv.org/abs/1308.4073v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pseudodifferential calculus on manifolds with fibred corners : the\n  groupoid of phi-calculus",
    "abstract": "This paper is concerned with pseudodifferential calculus on manifolds with\nfibred corners. Following work of Connes, Monthubert, Skandalis and\nAndroulidakis, we associate to every manifold with fibred corners a\nlongitudinally smooth groupoid which algebraic and differential structure is\nexplicitely described. This groupoid has a natural geometric meaning as a\nholonomy groupoid of singular foliation, it is a singular leaf space in the\nsense of Androulidakis and Skandalis. We then show that the associated\ncompactly supported pseudodifferential calculus coincides with Mazzeo and\nMelrose's phi-calculus and we introduce an extended algebra of smoothing\noperators that is shown to be stable under holomorphic functional calculus.\nThis result allows the interpretation of phi-calculus as the pseudodifferential\ncalculus associated with the holonomy groupoid of the singular foliation\ndefined by the manifold with fibred corners. It is a key step to set the index\ntheory of those singular manifolds in the noncommutative geometry framework.",
    "authors": [
      "Laurent Guillaume"
    ],
    "publication_date": "2013-10-24T12:45:24Z",
    "arxiv_id": "http://arxiv.org/abs/1310.6585v1",
    "download_url": "http://arxiv.org/abs/1310.6585v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A new resolvent equation for the S-functional calculus",
    "abstract": "The S-functional calculus is a functional calculus for $(n+1)$-tuples of non\nnecessarily commuting operators that can be considered a higher dimensional\nversion of the classical Riesz-Dunford functional calculus for a single\noperator. In this last calculus, the resolvent equation plays an important role\nin the proof of several results. Associated with the S-functional calculus\nthere are two resolvent operators: the left $S_L^{-1}(s,T)$ and the right one\n$S_R^{-1}(s,T)$, where $s=(s_0,s_1,\\ldots,s_n)\\in \\mathbb{R}^{n+1}$ and\n$T=(T_0,T_1,\\ldots,T_n)$ is an $(n+1)$-tuple of non commuting operators. These\ntwo S-resolvent operators satisfy the S-resolvent equations\n$S_L^{-1}(s,T)s-TS_L^{-1}(s,T)=\\mathcal{I}$, and\n$sS_R^{-1}(s,T)-S_R^{-1}(s,T)T=\\mathcal{I}$, respectively, where $\\mathcal{I}$\ndenotes the identity operator. These equations allows to prove some properties\nof the S-functional calculus. In this paper we prove a new resolvent equation\nfor the S-functional calculus which is the analogue of the classical resolvent\nequation. It is interesting to note that the equation involves both the left\nand the right S-resolvent operators simultaneously.",
    "authors": [
      "Daniel Alpay",
      "Fabrizio Colombo",
      "Jonathan Gantner",
      "Irene Sabadini"
    ],
    "publication_date": "2013-10-28T21:12:03Z",
    "arxiv_id": "http://arxiv.org/abs/1310.7626v1",
    "download_url": "http://arxiv.org/abs/1310.7626v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reformulating the Situation Calculus and the Event Calculus in the\n  General Theory of Stable Models and in Answer Set Programming",
    "abstract": "Circumscription and logic programs under the stable model semantics are two\nwell-known nonmonotonic formalisms. The former has served as a basis of\nclassical logic based action formalisms, such as the situation calculus, the\nevent calculus and temporal action logics; the latter has served as a basis of\na family of action languages, such as language A and several of its\ndescendants. Based on the discovery that circumscription and the stable model\nsemantics coincide on a class of canonical formulas, we reformulate the\nsituation calculus and the event calculus in the general theory of stable\nmodels. We also present a translation that turns the reformulations further\ninto answer set programs, so that efficient answer set solvers can be applied\nto compute the situation calculus and the event calculus.",
    "authors": [
      "Joohyung Lee",
      "Ravi Palla"
    ],
    "publication_date": "2014-01-18T21:11:15Z",
    "arxiv_id": "http://arxiv.org/abs/1401.4607v1",
    "download_url": "http://arxiv.org/abs/1401.4607v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Generalized Nonlocal Calculus with Application to the Peridynamics\n  Model for Solid Mechanics",
    "abstract": "A nonlocal vector calculus was introduced in [2] that has proved useful for\nthe analysis of the peridynamics model of nonlocal mechanics and nonlocal\ndiffusion models. A generalization is developed that provides a more general\nsetting for the nonlocal vector calculus that is independent of particular\nnonlocal models. It is shown that general nonlocal calculus operators are\nintegral operators with specific integral kernels. General nonlocal calculus\nproperties are developed, including nonlocal integration by parts formula and\nGreen's identities. The nonlocal vector calculus introduced in [2] is shown to\nbe recoverable from the general formulation as a special example. This special\nnonlocal vector calculus is used to reformulate the peridynamics equation of\nmotion in terms of the nonlocal gradient operator and its adjoint. A new\nexample of nonlocal vector calculus operators is introduced, which shows the\npotential use of the general formulation for general nonlocal models.",
    "authors": [
      "Bacim Alali",
      "Kuo Liu",
      "Max Gunzburger"
    ],
    "publication_date": "2014-02-03T02:33:01Z",
    "arxiv_id": "http://arxiv.org/abs/1402.0271v1",
    "download_url": "http://arxiv.org/abs/1402.0271v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Applications of the Thick Distributional Calculus",
    "abstract": "We give several applications of the thick distributional calculus. We\nconsider homogeneous distributions, point source fields, and higher order\nderivatives of order $0.$",
    "authors": [
      "Yunyun Yang",
      "Ricardo Estrada"
    ],
    "publication_date": "2014-02-08T18:44:23Z",
    "arxiv_id": "http://arxiv.org/abs/1402.1878v1",
    "download_url": "http://arxiv.org/abs/1402.1878v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Applications of Neutrix Calculus to Special Functions in Conjunction\n  with Polygamma Functions",
    "abstract": "In this paper we define the polygamma functions $\\psi^{(n)}(x)$ for negative\nintegers by using neutrix calculus.",
    "authors": [
      "Emin Özçağ"
    ],
    "publication_date": "2014-04-29T11:15:44Z",
    "arxiv_id": "http://arxiv.org/abs/1405.0507v1",
    "download_url": "http://arxiv.org/abs/1405.0507v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Qutrit Dichromatic Calculus and Its Universality",
    "abstract": "We introduce a dichromatic calculus (RG) for qutrit systems. We show that the\ndecomposition of the qutrit Hadamard gate is non-unique and not derivable from\nthe dichromatic calculus. As an application of the dichromatic calculus, we\ndepict a quantum algorithm with a single qutrit. Since it is not easy to\ndecompose an arbitrary d by d unitary matrix into Z and X phase gates when d >\n2, the proof of the universality of qudit ZX calculus for quantum mechanics is\nfar from trivial. We construct a counterexample to Ranchin's universality\nproof, and give another proof by Lie theory that the qudit ZX calculus contains\nall single qudit unitary transformations, which implies that qudit ZX calculus,\nwith qutrit dichromatic calculus as a special case, is universal for quantum\nmechanics.",
    "authors": [
      "Quanlong Wang",
      "Xiaoning Bian"
    ],
    "publication_date": "2014-06-08T15:12:56Z",
    "arxiv_id": "http://arxiv.org/abs/1406.3056v3",
    "download_url": "http://arxiv.org/abs/1406.3056v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A categorical semantic for the Typed Epsilon Calculus",
    "abstract": "We show that every boolean category satisfying AC provides a categorical\nsemantic of the typed Epsilon calculus.",
    "authors": [
      "Fabio Pasquali"
    ],
    "publication_date": "2014-09-08T19:06:34Z",
    "arxiv_id": "http://arxiv.org/abs/1409.2467v1",
    "download_url": "http://arxiv.org/abs/1409.2467v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Q-tableaux for Implicational Propositional Calculus",
    "abstract": "We study $Q$-tableaux and axiom systems that they engender, producing a new\nproof that the Implicational Propositional Calculus is complete.",
    "authors": [
      "P. L. Robinson"
    ],
    "publication_date": "2015-12-11T05:13:38Z",
    "arxiv_id": "http://arxiv.org/abs/1512.03525v1",
    "download_url": "http://arxiv.org/abs/1512.03525v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Operads in It{ô} calculus",
    "abstract": "We discuss algebraic and geometric properties of the It{\\^o} calculus",
    "authors": [
      "Roland Friedrich"
    ],
    "publication_date": "2016-04-28T18:40:24Z",
    "arxiv_id": "http://arxiv.org/abs/1604.08547v1",
    "download_url": "http://arxiv.org/abs/1604.08547v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A curious differential calculus on the quantum disc and cones",
    "abstract": "A non-classical differential calculus on the quantum disc and cones is\nconstructed and the associated integral is calculated.",
    "authors": [
      "Tomasz Brzeziński",
      "Ludwik Dąbrowski"
    ],
    "publication_date": "2016-11-10T18:17:14Z",
    "arxiv_id": "http://arxiv.org/abs/1611.03434v1",
    "download_url": "http://arxiv.org/abs/1611.03434v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representing operational semantics with enriched Lawvere theories",
    "abstract": "Many term calculi, like lambda calculus or pi calculus, involve binders for\nnames, and the mathematics of bound variable names is subtle. Schoenfinkel\nintroduced the SKI combinator calculus in 1924 to clarify the role of\nquantified variables in intuitionistic logic by eliminating them. Yoshida\ndemonstrated how to eliminate the bound names coming from the input prefix in\nthe asynchronous pi calculus, but her combinators still depend on the new\noperator to bind names. Recently, Meredith and Stay showed how to modify\nYoshida's combinators by replacing new and replication with reflective\noperators to provide the first combinator calculus with no bound names into\nwhich the asynchronous pi calculus has a faithful embedding. Here we provide an\nalternative set of combinators built from SKI plus reflection that also\neliminates all nominal phenomena, yet provides a faithful embedding of a\nreflective higher-order pi calculus. We show that with the nominal features\neffectively eliminated as syntactic sugar, multisorted Lawvere theories\nenriched over graphs suffice to capture the operational semantics of the\ncalculus.",
    "authors": [
      "Michael Stay",
      "L. G. Meredith"
    ],
    "publication_date": "2017-04-10T22:54:54Z",
    "arxiv_id": "http://arxiv.org/abs/1704.03080v1",
    "download_url": "http://arxiv.org/abs/1704.03080v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some Gruss type Inequalities using Pompeiu's mean value theorem on\n  Conformable Fractional Calculus",
    "abstract": "The main objective of this paper is to obtain some Gruss Like Inequalities\nusing Pompeiu's mean value theorem on Conformable Fractional Calculus.",
    "authors": [
      "Deepak B. Pachpatte"
    ],
    "publication_date": "2017-08-23T05:42:52Z",
    "arxiv_id": "http://arxiv.org/abs/1708.06888v1",
    "download_url": "http://arxiv.org/abs/1708.06888v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Encoding Turing Machines into the Deterministic Lambda-Calculus",
    "abstract": "This note is about encoding Turing machines into the lambda-calculus.",
    "authors": [
      "Ugo Dal Lago",
      "Beniamino Accattoli"
    ],
    "publication_date": "2017-11-28T01:19:59Z",
    "arxiv_id": "http://arxiv.org/abs/1711.10078v1",
    "download_url": "http://arxiv.org/abs/1711.10078v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Remarks on basic calculus in hyperboloidal foliation",
    "abstract": "In this article we will give a systematic summary on the basic calculus in\nthe hyperboloidal foliation context, especially the estimates based on\ncommutators.",
    "authors": [
      "Yue Ma"
    ],
    "publication_date": "2018-03-03T14:49:05Z",
    "arxiv_id": "http://arxiv.org/abs/1803.01177v1",
    "download_url": "http://arxiv.org/abs/1803.01177v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Weyl calculus for group generators satisfying the canonical\n  commutation relations",
    "abstract": "Classical pseudo-differential calculus on $\\mathbb{R}^{d}$ can be viewed as a\n(non-commutative) functional calculus for the standard position and momentum\noperators $(Q_{1}, \\dots , Q_{d})$ and $(P_{1}, \\dots , P_{d})$. We generalise\nthis calculus to the setting of two $d$-tuples of operators $A=(A_{1}, \\dots ,\nA_{d})$ and $B=(B_{1}, \\dots , B_{d})$ acting on a Banach space $X$ such that\n$iA_{1}, \\dots , iA_{d}$ and $iB_{1}, \\dots , iB_{d}$ generate bounded\n$C_0$-groups satisfying the Weyl canonical commutation relations\n$e^{isA_j}e^{itA_k} = e^{itA_k}e^{isA_j}$, $e^{isB_j}e^{itB_k} =\ne^{itB_k}e^{isB_j}$, and $e^{isA_j}e^{itB_k} = e^{-ist \\delta_{jk}}\ne^{itB_k}e^{isA_j}$ $(1\\le j,k\\le d)$.\n  We show that the resulting calculus $a\\mapsto a(A,B) \\in \\mathscr{L}(X)$,\ninitially defined for Schwartz functions $a\\in \\mathscr{S}(\\mathbb{R}^{2d})$,\nextends to symbols in the standard symbol class $S^{0}$ of pseudo-differential\ncalculus provided appropriate bounds can be established. We also prove a\ntransference result that bounds the operators $a(A,B)$ in terms of the twisted\nconvolution operators $C_{\\widehat{a}}$ acting on $L^{2}(\\mathbb{R}^{2d};X)$.\nWe apply these results to obtain $R$-sectoriality and boundedness of the\n$H^{\\infty}$-functional calculus (and even the H\\\"ormander calculus), for the\nabstract harmonic oscillator $L = \\frac12\\sum_{j=1}^d (A_j^2+B_j^2)-\\frac12d$.",
    "authors": [
      "Jan van Neerven",
      "Pierre Portal"
    ],
    "publication_date": "2018-06-04T06:49:11Z",
    "arxiv_id": "http://arxiv.org/abs/1806.00980v1",
    "download_url": "http://arxiv.org/abs/1806.00980v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Goodwillie Calculus",
    "abstract": "We survey the theory and applications of Goodwillie's calculus of homotopy\nfunctors and related topics.",
    "authors": [
      "Gregory Arone",
      "Michael Ching"
    ],
    "publication_date": "2019-02-02T22:10:52Z",
    "arxiv_id": "http://arxiv.org/abs/1902.00803v1",
    "download_url": "http://arxiv.org/abs/1902.00803v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Completeness of the Phase-free ZH-calculus",
    "abstract": "The ZH-calculus is a graphical calculus for linear maps between qubits that\nallows a natural representation of the Toffoli+Hadamard gate set. The original\nversion of the calculus, which allows every generator to be labelled by an\narbitrary complex number, was shown to be complete by Backens and Kissinger.\nEven though the calculus is complete, this does not mean it allows one to\neasily reason in restricted settings such as is the case in quantum computing.\nIn this paper we study the fragment of the ZH-calculus that is phase-free, and\nthus is closer aligned to physically implementable maps. We present a modified\nrule-set for the phase-free ZH-calculus and show that it is complete. We\nfurther discuss the minimality of this rule-set and we give an intuitive\ninterpretation of the rules. Our completeness result follows by reducing to\nVilmart's rule-set for the phase-free $\\Delta$ZX-calculus.",
    "authors": [
      "John van de Wetering",
      "Sal Wolffs"
    ],
    "publication_date": "2019-04-16T09:17:09Z",
    "arxiv_id": "http://arxiv.org/abs/1904.07545v1",
    "download_url": "http://arxiv.org/abs/1904.07545v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Examples of Morphological Calculus",
    "abstract": "In this paper we present an introduction to morphological calculus in which\ngeometrical objects play the rule of generalised natural numbers.",
    "authors": [
      "Frank Sommen"
    ],
    "publication_date": "2020-02-21T11:04:49Z",
    "arxiv_id": "http://arxiv.org/abs/2002.10229v1",
    "download_url": "http://arxiv.org/abs/2002.10229v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ZX-calculus for the working quantum computer scientist",
    "abstract": "The ZX-calculus is a graphical language for reasoning about quantum\ncomputation that has recently seen an increased usage in a variety of areas\nsuch as quantum circuit optimisation, surface codes and lattice surgery,\nmeasurement-based quantum computation, and quantum foundations. The first half\nof this review gives a gentle introduction to the ZX-calculus suitable for\nthose familiar with the basics of quantum computing. The aim here is to make\nthe reader comfortable enough with the ZX-calculus that they could use it in\ntheir daily work for small computations on quantum circuits and states. The\nlatter sections give a condensed overview of the literature on the ZX-calculus.\nWe discuss Clifford computation and graphically prove the Gottesman-Knill\ntheorem, we discuss a recently introduced extension of the ZX-calculus that\nallows for convenient reasoning about Toffoli gates, and we discuss the recent\ncompleteness theorems for the ZX-calculus that show that, in principle, all\nreasoning about quantum computation can be done using ZX-diagrams.\nAdditionally, we discuss the categorical and algebraic origins of the\nZX-calculus and we discuss several extensions of the language which can\nrepresent mixed states, measurement, classical control and higher-dimensional\nqudits.",
    "authors": [
      "John van de Wetering"
    ],
    "publication_date": "2020-12-27T15:54:25Z",
    "arxiv_id": "http://arxiv.org/abs/2012.13966v1",
    "download_url": "http://arxiv.org/abs/2012.13966v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bakry-Emery Calculus For Diffusion With Additional Multiplicative Term",
    "abstract": "We extend the Gamma_2 calculus of Bakry and Emery to include a Carre du champ\noperator with multiplicative term, providing results which allow to analyse\ninhomogeneous diffusions.",
    "authors": [
      "C. Roberto",
      "B. Zegarlinski"
    ],
    "publication_date": "2021-02-21T16:12:14Z",
    "arxiv_id": "http://arxiv.org/abs/2102.10633v1",
    "download_url": "http://arxiv.org/abs/2102.10633v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lectures on the Epsilon Calculus",
    "abstract": "Notes to lectures on the epsilon calculus, covering axioms, semantics,\ncompleteness, and the first epsilon theorem.",
    "authors": [
      "Richard Zach"
    ],
    "publication_date": "2014-11-13T17:41:11Z",
    "arxiv_id": "http://arxiv.org/abs/1411.3629v1",
    "download_url": "http://arxiv.org/abs/1411.3629v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Compact Introduction to Fractional Calculus",
    "abstract": "A Compact Introduction to Fractional Calculus is presented including basic\ndefinitions, fractional differential equations and special functions.",
    "authors": [
      "Alexander I. Zhmakin"
    ],
    "publication_date": "2022-12-30T19:42:58Z",
    "arxiv_id": "http://arxiv.org/abs/2301.00037v1",
    "download_url": "http://arxiv.org/abs/2301.00037v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Vinogradov's Cohomological Geometry of Partial Differential Equations",
    "abstract": "Secondary Calculus is a formal replacement for differential calculus on the\nspace of solutions of a system of possibly non-linear partial differential\nequations and it is essentially due to Alexandre M. Vinogradov and his\ncollaborators. Many coordinate free properties of PDEs find their natural place\nin Secondary Calculus including: symmetries and conservation laws, variational\nprinciples and the coordinate free aspects of the calculus of variations,\nrecursion operators and Hamiltonian structures, etc. The building blocks of\nthis language are horizontal cohomologies of diffieties, i.e. infinite\nprolongations of PDEs, and their versions with local coefficients. The main\nparadigm of Secondary Calculus is the principle, due to A. M. Vinogradov,\nroughly stating that: differential calculus on the space of solutions of a PDE\nis calculus up to homotopy on the horizontal De Rham algebra of the associated\ndiffiety. We will review the fundamentals of Secondary Calculus including its\nmain motivations. In the last part of the paper, we will try to explain the\nrole of homotopy in the theory.",
    "authors": [
      "Fabrizio Pugliese",
      "Giovanni Sparano",
      "Luca Vitagliano"
    ],
    "publication_date": "2023-01-05T12:19:38Z",
    "arxiv_id": "http://arxiv.org/abs/2301.02038v1",
    "download_url": "http://arxiv.org/abs/2301.02038v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Light-Matter Interaction in the ZXW Calculus",
    "abstract": "In this paper, we develop a graphical calculus to rewrite photonic circuits\ninvolving light-matter interactions and non-linear optical effects. We\nintroduce the infinite ZW calculus, a graphical language for linear operators\non the bosonic Fock space which captures both linear and non-linear photonic\ncircuits. This calculus is obtained by combining the QPath calculus, a\ndiagrammatic language for linear optics, and the recently developed qudit ZXW\ncalculus, a complete axiomatisation of linear maps between qudits. It comes\nwith a 'lifting' theorem allowing to prove equalities between infinite\noperators by rewriting in the ZXW calculus. We give a method for representing\nbosonic and fermionic Hamiltonians in the infinite ZW calculus. This allows us\nto derive their exponentials by diagrammatic reasoning. Examples include phase\nshifts and beam splitters, as well as non-linear Kerr media and Jaynes-Cummings\nlight-matter interaction.",
    "authors": [
      "Giovanni de Felice",
      "Razin A. Shaikh",
      "Boldizsár Poór",
      "Lia Yeh",
      "Quanlong Wang",
      "Bob Coecke"
    ],
    "publication_date": "2023-06-03T13:55:34Z",
    "arxiv_id": "http://arxiv.org/abs/2306.02114v2",
    "download_url": "http://arxiv.org/abs/2306.02114v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Liquid functional calculus",
    "abstract": "We develop an elementary formalism of functional calculus for entire\nholomorphic functions in the setting of Clausen and Scholze's $p$-liquid vector\nspaces.",
    "authors": [
      "Kendric Schefers"
    ],
    "publication_date": "2023-10-08T20:08:13Z",
    "arxiv_id": "http://arxiv.org/abs/2310.05272v1",
    "download_url": "http://arxiv.org/abs/2310.05272v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The calculus of neo-Peircean relations",
    "abstract": "The calculus of relations was introduced by De Morgan and Peirce during the\nsecond half of the 19th century, as an extension of Boole's algebra of classes.\nLater developments on quantification theory by Frege and Peirce himself, paved\nthe way to what is known today as first-order logic, causing the calculus of\nrelations to be long forgotten. This was until 1941, when Tarski raised the\nquestion on the existence of a complete axiomatisation for it. This question\nfound only negative answers: there is no finite axiomatisation for the calculus\nof relations and many of its fragments, as shown later by several no-go\ntheorems. In this paper we show that -- by moving from traditional syntax\n(cartesian) to a diagrammatic one (monoidal) -- it is possible to have complete\naxiomatisations for the full calculus. The no-go theorems are circumvented by\nthe fact that our calculus, named the calculus of neo-Peircean relations, is\nmore expressive than the calculus of relations and, actually, as expressive as\nfirst-order logic. The axioms are obtained by combining two well known\ncategorical structures: cartesian and linear bicategories.",
    "authors": [
      "Filippo Bonchi",
      "Alessandro Di Giorgio",
      "Nathan Haydon",
      "Pawel Sobocinski"
    ],
    "publication_date": "2025-05-08T14:52:25Z",
    "arxiv_id": "http://arxiv.org/abs/2505.05306v3",
    "download_url": "http://arxiv.org/abs/2505.05306v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Belief Calculus",
    "abstract": "In Dempster-Shafer belief theory, general beliefs are expressed as belief\nmass distribution functions over frames of discernment. In Subjective Logic\nbeliefs are expressed as belief mass distribution functions over binary frames\nof discernment. Belief representations in Subjective Logic, which are called\nopinions, also contain a base rate parameter which express the a priori belief\nin the absence of evidence. Philosophically, beliefs are quantitative\nrepresentations of evidence as perceived by humans or by other intelligent\nagents. The basic operators of classical probability calculus, such as addition\nand multiplication, can be applied to opinions, thereby making belief calculus\npractical. Through the equivalence between opinions and Beta probability\ndensity functions, this also provides a calculus for Beta probability density\nfunctions. This article explains the basic elements of belief calculus.",
    "authors": [
      "Audun Josang"
    ],
    "publication_date": "2006-06-07T14:32:55Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0606029v1",
    "download_url": "http://arxiv.org/abs/cs/0606029v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Riesz-Clifford Functional Calculus for Non-Commuting Operators and\n  Quantum Field Theory",
    "abstract": "We present a Riesz-like hyperholomorphic functional calculus for a set of\nnon-commuting operators based on the Clifford analysis. Applications to the\nquantum field theory are described. Keywords: Functional calculus, Weyl\ncalculus, Riesz calculus, Clifford analysis, quantization, quantum field\ntheory. AMSMSC Primary:47A60, Secondary: 81T10",
    "authors": [
      "Vladimir V. Kisil",
      "Enrique Ramírez de Arellano"
    ],
    "publication_date": "1995-02-25T23:45:40Z",
    "arxiv_id": "http://arxiv.org/abs/funct-an/9502006v1",
    "download_url": "http://arxiv.org/abs/funct-an/9502006v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A $κ$-Symmetry Calculus for Superparticles",
    "abstract": "We develop a $\\kappa$-symmetry calculus for the d=2 and d=3, N=2 massive\nsuperparticles, which enables us to construct higher order $\\kappa$-invariant\nactions. The method relies on a reformulation of these models as supersymmetric\nsigma models that are invariant under local worldline superconformal\ntransformations. We show that the $\\kappa$-symmetry is embedded in the\nsuperconformal symmetry so that a calculus for the $\\kappa$-symmetry is\nequivalent to a tensor calculus for the latter. We develop such a calculus\nwithout the introduction of a worldline supergravity multiplet.",
    "authors": [
      "Jerome P. Gauntlett"
    ],
    "publication_date": "1991-09-20T20:00:48Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9109039v1",
    "download_url": "http://arxiv.org/abs/hep-th/9109039v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Noncommutative Differential Calculus: Quantum Groups, Stochastic\n  Processes, and the Antibracket",
    "abstract": "We explore a differential calculus on the algebra of smooth functions on a\nmanifold. The former is `noncommutative' in the sense that functions and\ndifferentials do not commute, in general. Relations with bicovariant\ndifferential calculus on certain quantum groups and stochastic calculus are\ndiscussed. A similar differential calculus on a superspace is shown to be\nrelated to the Batalin-Vilkovisky antifield formalism.",
    "authors": [
      "A. Dimakis",
      "F. M\"uller-Hoissen"
    ],
    "publication_date": "1994-01-28T16:10:22Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9401151v1",
    "download_url": "http://arxiv.org/abs/hep-th/9401151v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal and Generalized Cartan Calculus on Hopf Algebras",
    "abstract": "We extend the universal differential calculus on an arbitrary Hopf algebra to\na ``universal Cartan calculus''. This is accomplished by introducing inner\nderivations and Lie derivatives which act on the elements of the universal\ndifferential envelope. A new algebra is formulated by incorporating these new\nobjects into the universal differential calculus together with consistent\ncommutation relations. We also explain how to include nontrivial commutation\nrelations into this formulation to obtain the ``generalized Cartan calculus''.",
    "authors": [
      "Peter Schupp",
      "Paul Watts"
    ],
    "publication_date": "1994-02-23T21:02:41Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9402134v1",
    "download_url": "http://arxiv.org/abs/hep-th/9402134v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Descent-cycling in Schubert calculus",
    "abstract": "We prove two lemmata about Schubert calculus on generalized flag manifolds\nG/B, and in the case of the ordinary flag manifold GL_n/B we interpret them\ncombinatorially in terms of descents, and geometrically in terms of missing\nsubspaces. One of them gives a symmetry of Schubert calculus that we\nchristen_descent-cycling_. Computer experiment shows that these lemmata suffice\nto determine all of GL_n Schubert calculus through n=5, and 99.97%+ at n=6. We\nuse them to give a quick proof of Monk's rule. The lemmata also hold in\nequivariant (``double'') Schubert calculus for Kac-Moody groups G.",
    "authors": [
      "Allen Knutson"
    ],
    "publication_date": "2000-09-11T20:18:35Z",
    "arxiv_id": "http://arxiv.org/abs/math/0009112v1",
    "download_url": "http://arxiv.org/abs/math/0009112v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The $H^{\\infty}-$calculus and sums of closed operators",
    "abstract": "We develop a very general operator-valued functional calculus for operators\nwith an $H^{\\infty}-$calculus. We then apply this to the joint functional\ncalculus of two commuting sectorial operators when one has an\n$H^{\\infty}$calculus. Using this we prove theorem of Dore-Venni type on sums of\ncommuting sectorial operators and apply our results to the problem of\n$L_p-$maximal regularity. Our main assumption is the R-boundedness of certain\nsets of operators, and therefore methods from the geometry of Banach spaces are\nessential here. In the final section we exploit the special Banach space\nstructure of $L_1-$spaces and $C(K)-$spaces, to obtain some more detailed\nresults in this setting.",
    "authors": [
      "N. J. Kalton",
      "L. Weis"
    ],
    "publication_date": "2000-10-15T22:00:35Z",
    "arxiv_id": "http://arxiv.org/abs/math/0010155v1",
    "download_url": "http://arxiv.org/abs/math/0010155v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Calcul d'erreur complet lipschitzien et formes de Dirichlet",
    "abstract": "We study the error calculus from a mathematical point of view, in particular\nfor the infinite dimensional models met in stochastic analysis. Gauss was the\nfirst to propose an error calculus. It can be reinforced by an extension\nprinciple based on Dirichlet forms which gives more strength to the coherence\nproperty. One gets a Lipschitzian complete error calculus which behaves well by\nimages and by products and allows a quick and easy construction of the basic\nmathematical tools of Malliavin calculus. This allows also to revisit the\ndelicate question of error permanency that Poincar\\'{e} emphasized. This error\ncalculus is connected with statistics by mean of the notion of Fisher\ninformation.",
    "authors": [
      "Nicolas Bouleau"
    ],
    "publication_date": "2006-10-16T15:14:45Z",
    "arxiv_id": "http://arxiv.org/abs/math/0610491v1",
    "download_url": "http://arxiv.org/abs/math/0610491v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bicovariant Calculus on Twisted ISO(N), Quantum Poincare' Group and\n  Quantum Minkowski Space",
    "abstract": "A bicovariant calculus on the twisted inhomogeneous multiparametric\n$q$-groups of the $B_n,C_n,D_n$ type, and on the corresponding quantum planes,\nis found by means of a projection from the bicovariant calculus on $B_{n+1}$,\n$C_{n+1}$, $D_{n+1}$. In particular we obtain the bicovariant calculus on a\ndilatation-free $q$-Poincar\\'e group $ISO_q (3,1)$, and on the corresponding\nquantum Minkowski space. The classical limit of the $B_n,C_n,D_n$ bicovariant\ncalculus is discussed in detail.",
    "authors": [
      "Paolo Aschieri",
      "Leonardo Castellani"
    ],
    "publication_date": "1996-01-09T17:01:58Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9601006v1",
    "download_url": "http://arxiv.org/abs/q-alg/9601006v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Problem of Differential Calculus on Quantum Groups",
    "abstract": "The bicovariant differential calculi on quantum groups of Woronowicz have the\ndrawback that their dimensions do not agree with that of the corresponding\nclassical calculus. In this paper we discuss the first-order differential\ncalculus which arises from a simple quantum Lie algebra. This calculus has the\ncorrect dimension and is shown to be bicovariant and complete. But it does not\nsatisfy the Leibniz rule. For sl_n this approach leads to a differential\ncalculus which satisfies a simple generalization of the Leibniz rule.",
    "authors": [
      "Gustav W. Delius"
    ],
    "publication_date": "1996-08-14T11:41:49Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9608010v1",
    "download_url": "http://arxiv.org/abs/q-alg/9608010v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generalized Cauchy identities, trees and multidimensional Brownian\n  motions. Part II: Combinatorial differential calculus",
    "abstract": "We present an analogue of the differential calculus in which the role of\npolynomials is played by certain ordered sets and trees. Our combinatorial\ncalculus has all nice features of the usual calculus and has an advantage that\nthe elements of the considered ordered sets might carry some additional\ninformation. In this way an analytic proof of generalized Cauchy identities\nfrom the previous work of the second author can be directly reformulated in our\nnew language of the combinatorial calculus; furthermore the additional\ninformation carried by vertices determines uniquely the bijections presented in\nPart I of this series.",
    "authors": [
      "Artur Jez",
      "Piotr Sniady"
    ],
    "publication_date": "2007-08-25T18:10:17Z",
    "arxiv_id": "http://arxiv.org/abs/0708.3441v1",
    "download_url": "http://arxiv.org/abs/0708.3441v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A new functional calculus for non-commuting operators",
    "abstract": "In this paper we use the notion of slice monogenic functions \\cite{slicecss}\nto define a new functional calculus for an $n$-tuple $T$ of not necessarily\ncommuting operators. This calculus is different from the one discussed in\n\\cite{jefferies} and it allows the explicit construction of the eigenvalue\nequation for the $n$-tuple $T$ based on a new notion of spectrum for $T$. Our\nfunctional calculus is consistent with the Riesz-Dunford calculus in the case\nof a single operator.",
    "authors": [
      "F. Colombo",
      "I. Sabadini",
      "D. C. Struppa"
    ],
    "publication_date": "2007-08-27T13:01:32Z",
    "arxiv_id": "http://arxiv.org/abs/0708.3594v2",
    "download_url": "http://arxiv.org/abs/0708.3594v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]