[
  {
    "title": "Higher level Zhu algebras and modules for vertex operator algebras",
    "abstract": "Motivated by the study of indecomposable, nonsimple modules for a vertex operator algebra $V$, we study the relationship between various types of $V$-modules and modules for the higher level Zhu algebras for $V$, denoted $A_n(V)$, for $n \\in \\mathbb{N}$, first introduced by Dong, Li, and Mason in 1998. We resolve some issues that arise in a few theorems previously presented when these algebras were first introduced, and give examples illustrating the need for certain modifications of the statements of those theorems. We establish that whether or not $A_{n-1}(V)$ is isomorphic to a direct summand of $A_n(V)$ affects the types of indecomposable $V$-modules which can be constructed by inducing from an $A_n(V)$-module, and in particular whether there are $V$-modules induced from $A_n(V)$-modules that were not already induced by $A_0(V)$. We give some characterizations of the $V$-modules that can be constructed from such inducings, in particular as regards their singular vectors. To illustrate these results, we discuss two examples of $A_1(V)$: when $V$ is the vertex operator algebra associated to either the Heisenberg algebra or the Virasoro algebra. For these two examples, we show how the structure of $A_1(V)$ in relationship to $A_0(V)$ determines what types of indecomposable $V$-modules can be induced from a module for the level zero versus level one Zhu algebras. We construct a family of indecomposable modules for the Virasoro vertex operator algebra that are logarithmic modules and are not highest weight modules.",
    "authors": [
      "Katrina Barron",
      "Nathan Vander Werf",
      "Jinwei Yang"
    ],
    "publication_date": "2017-10-13T01:07:41Z",
    "arxiv_id": "http://arxiv.org/abs/1710.04767v2",
    "download_url": "https://arxiv.org/abs/1710.04767v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weak Hopf Algebras II: Representation theory, dimensions and the Markov trace",
    "abstract": "If A is a weak C^*-Hopf algebra then the category of finite dimensional unitary representations of A is a monoidal C^*-category with monoidal unit being the GNS representation D_eps associated to the counit \\eps. This category has isomorphic left dual and right dual objects which leads, as usual, to the notion of dimension function. However, if \\eps is not pure the dimension function is matrix valued with rows and columns labelled by the irreducibles contained in D_eps. This happens precisely when the inclusions A^L < A and A^R < A are not connected. Still there exists a trace on A which is the Markov trace for both inclusions. We derive two numerical invariants for each C^*-WHA of trivial hypercenter. These are the common indices I and δ, of the Haar, respectively Markov conditional expectations of either one of the inclusions A^{L/R} < A and Adual^{L/R} < Adual. In generic cases I > δ. In the special case of weak Kac algebras we show that I=δis an integer.",
    "authors": [
      "G. Bohm",
      "K. Szlachanyi"
    ],
    "publication_date": "1999-06-08T13:22:21Z",
    "arxiv_id": "http://arxiv.org/abs/math/9906045v1",
    "download_url": "https://arxiv.org/abs/math/9906045v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic Frobenius Splitting of Cotangent Bundles of Flag Varieties",
    "abstract": "Following the program of algebraic Frobenius splitting begun by Kumar and Littelmann, we use representation-theoretic techniques to construct a Frobenius splitting of the cotangent bundle of the flag variety of a semisimple algebraic group over an algebraically closed field of positive characteristic. We also show that this splitting is the same as one of the splittings constructed by Kumar, Lauritzen, and Thomsen.",
    "authors": [
      "Chuck Hague"
    ],
    "publication_date": "2012-08-21T17:34:12Z",
    "arxiv_id": "http://arxiv.org/abs/1208.4314v2",
    "download_url": "https://arxiv.org/abs/1208.4314v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Free field realization of the twisted Heisenberg-Virasoro algebra at level zero and its applications",
    "abstract": "We investigate the free fields realization of the twisted Heisenberg-Virasoro algebra $\\mathcal{H}$ at level zero. We completely describe the structure of the associated Fock representations. Using vertex-algebraic methods and screening operators we construct singular vectors in certain Verma modules as Schur polynomials. We completely solve the irreducibility problem for tensor product of irreducible highest weight modules with intermediate series. We also determine the fusion rules for an interesting subcategory of $\\mathcal{H}$-modules. Finally, as an application we present a free field realization of the $W(2,2)$-algebra and interpret the $W(2,2)$-singular vectors as $\\mathcal{H}$-singular vectors in Verma modules.",
    "authors": [
      "Drazen Adamovic",
      "Gordan Radobolja"
    ],
    "publication_date": "2014-05-07T19:18:36Z",
    "arxiv_id": "http://arxiv.org/abs/1405.1707v2",
    "download_url": "https://arxiv.org/abs/1405.1707v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "McKay Correspondence for semisimple Hopf actions on regular graded algebras, I",
    "abstract": "In establishing a more general version of the McKay correspondence, we prove Auslander's theorem for actions of semisimple Hopf algebras H on noncommutative Artin-Schelter regular algebras A of global dimension two, where A is a graded H-module algebra, and the Hopf action on A is inner faithful with trivial homological determinant. We also show that each fixed ring A^H under such an action arises an analogue of a coordinate ring of a Kleinian singularity.",
    "authors": [
      "Kenneth Chan",
      "Ellen Kirkman",
      "Chelsea Walton",
      "James Zhang"
    ],
    "publication_date": "2016-07-23T22:47:22Z",
    "arxiv_id": "http://arxiv.org/abs/1607.06977v2",
    "download_url": "https://arxiv.org/abs/1607.06977v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The global extension problem, crossed products and co-flag non-commutative Poisson algebras",
    "abstract": "Let $P$ be a Poisson algebra, $E$ a vector space and $π: E \\to P$ an epimorphism of vector spaces with $V = {\\rm Ker} (π)$. The global extension problem asks for the classification of all Poisson algebra structures that can be defined on $E$ such that $π: E \\to P$ becomes a morphism of Poisson algebras. From a geometrical point of view it means to decompose this groupoid into connected components and to indicate a point in each such component. All such Poisson algebra structures on $E$ are classified by an explicitly constructed classifying set ${\\mathcal G} {\\mathcal P} {\\mathcal H}^{2} \\, (P, \\, V)$ which is the coproduct of all non-abelian cohomological objects ${\\mathcal P} {\\mathcal H}^{2} \\, (P, \\, (V, \\cdot_V, [-,-]_V))$ which are the classifying sets for all extensions of $P$ by $(V, \\cdot_V, [-,-]_V)$. The second classical Poisson cohomology group $H^2 (P, V)$ appears as the most elementary piece among all components of ${\\mathcal G} {\\mathcal P} {\\mathcal H}^{2} \\, (P, \\, V)$. Several examples are provided in the case of metabelian Poisson algebras or co-flag Poisson algebras over $P$: the latter being Poisson algebras $Q$ which admit a finite chain of epimorphisms of Poisson algebras $P_n : = Q \\stackrel{π_{n}}{\\longrightarrow} P_{n-1} \\, \\cdots \\, P_1 \\stackrel{π_{1}} {\\longrightarrow} P_{0} := P$ such that ${\\rm dim} ( {\\rm Ker} (π_{i}) ) = 1$, for all $i = 1, \\cdots, n$.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2013-09-08T18:14:15Z",
    "arxiv_id": "http://arxiv.org/abs/1309.1986v3",
    "download_url": "https://arxiv.org/abs/1309.1986v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic properties of face algebras",
    "abstract": "Prompted an inquiry of Manin on whether a coacting Hopf-type structure $H$ and an algebra $A$ that is coacted upon share algebraic properties, we study the particular case of $A$ being a path algebra $\\Bbbk Q$ of a finite quiver $Q$ and $H$ being Hayashi's face algebra $\\mathfrak{H}(Q)$ attached to $Q$. This is motivated by the work of Huang, Wicks, Won, and the second author, where it was established that the weak bialgebra coacting universally on $\\Bbbk Q$ (either from the left, right, or both sides compatibly) is $\\mathfrak{H}(Q)$. For our study, we define the Kronecker square $\\widehat{Q}$ of $Q$, and show that $\\mathfrak{H}(Q) \\cong \\Bbbk \\widehat{Q}$ as unital algebras. Then we obtain ring-theoretic and homological properties of $\\mathfrak{H}(Q)$ in terms of graph-theoretic properties of $Q$ by way of $\\widehat{Q}$.",
    "authors": [
      "Fabio Calderón",
      "Chelsea Walton"
    ],
    "publication_date": "2021-05-25T16:21:47Z",
    "arxiv_id": "http://arxiv.org/abs/2105.12042v2",
    "download_url": "https://arxiv.org/abs/2105.12042v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of Harish-Chandra modules over some Lie algebras related to the Virasoro algebra",
    "abstract": "In this paper, we provide a uniform method to thoroughly classify all Harish-Chandra modules over some Lie algebras related to the Virasoro algebras. We first classify such modules over the Lie algebra $W(\\varrho)[s]$ for $s=0,\\frac12$. With this result and method, we can also do such works for some Lie algebras and superconformal algebras related to the Virasoro algebra, including the several kinds of Schrödinger-Virasoro Lie algebras, which are open up to now.",
    "authors": [
      "Dong Liu"
    ],
    "publication_date": "2010-11-15T16:32:42Z",
    "arxiv_id": "http://arxiv.org/abs/1011.3438v6",
    "download_url": "https://arxiv.org/abs/1011.3438v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Abelian and non-abelian second cohomologies of quantized enveloping algebras",
    "abstract": "For a class of pointed Hopf algebras including the quantized enveloping algebras, we discuss cleft extensions, cocycle deformations and the second cohomology. We present such a non-standard method of computing the abelian second cohomology that derives information from the non-abelian second cohomology classifying cleft extensions. As a sample computation, a quantum analogue of Whitehead's second lemma for Lie-algebra cohomology is proved.",
    "authors": [
      "Akira Masuoka"
    ],
    "publication_date": "2007-08-15T02:31:45Z",
    "arxiv_id": "http://arxiv.org/abs/0708.1982v4",
    "download_url": "https://arxiv.org/abs/0708.1982v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The relative modular object and Frobenius extensions of finite Hopf algebras",
    "abstract": "For a certain kind of tensor functor $F: \\mathcal{C} \\to \\mathcal{D}$, we define the relative modular object $χ_F \\in \\mathcal{D}$ as the \"difference\" between a left adjoint and a right adjoint of $F$. Our main result claims that, if $\\mathcal{C}$ and $\\mathcal{D}$ are finite tensor categories, then $χ_F$ can be written in terms of a categorical analogue of the modular function on a Hopf algebra. Applying this result to the restriction functor associated to an extension $A/B$ of finite-dimensional Hopf algebras, we recover the result of Fischman, Montgomery and Schneider on the Frobenius type property of $A/B$. We also apply our results to obtain a \"braided\" version and a \"bosonization\" version of the result of Fischman et al.",
    "authors": [
      "Kenichi Shimizu"
    ],
    "publication_date": "2014-11-30T12:48:35Z",
    "arxiv_id": "http://arxiv.org/abs/1412.0211v3",
    "download_url": "https://arxiv.org/abs/1412.0211v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cup products, lower central series, and holonomy Lie algebras",
    "abstract": "We generalize basic results relating the associated graded Lie algebra and the holonomy Lie algebra from finitely presented, commutator-relators groups to arbitrary finitely presented groups. In the process, we give an explicit formula for the cup-product in the cohomology of a finite 2-complex, and an algorithm for computing the corresponding holonomy Lie algebra, using a Magnus expansion method. We illustrate our approach with examples drawn from a variety of group-theoretic and topological contexts, such as link groups, one-relator groups, and fundamental groups of orientable Seifert fibered manifolds.",
    "authors": [
      "Alexander I. Suciu",
      "He Wang"
    ],
    "publication_date": "2017-01-26T16:44:39Z",
    "arxiv_id": "http://arxiv.org/abs/1701.07768v2",
    "download_url": "https://arxiv.org/abs/1701.07768v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Markov traces on the Birman-Wenzl-Murakami algebras",
    "abstract": "We classify the Markov traces factoring through the Birman-Wenzl-Murakami (BMW) algebras. For this purpose, we define a common `cover' for the two variations of the BMW-algebra originating from the quantum orthogonal/symplectic duality, which are responsible for the so-called `Dubrovnik' variation of the Kauffman polynomial. For generic values of the defining parameters of the BMW algebra, this cover is isomorphic to the BMW algebra itself, and this fact provides a shorter defining relation for it, in the generic case. For a certain 1-dimensional family of special values however, it is a non-trivial central extension of the BMW-algebra which induces a central extension of the Temperley-Lieb algebra. Inside this 1-dimensional family, exactly two values provide possibly additional Q-valued Markov traces. We describe both of these potential traces on the (extended) Temperley-Lieb subalgebra. While we only conjecture the existence of one of them, we prove the existence of the other by introducing a central extension of the Iwahori-Hecke algebra at q=-1 for an arbitrary Coxeter system, and by proving that this extension indeed admits an exotic Markov trace. These constructions provide several natural non-vanishing Hochschild cohomology classes on these classical algebras.",
    "authors": [
      "Ivan Marin",
      "Emmanuel Wagner"
    ],
    "publication_date": "2014-03-17T08:19:31Z",
    "arxiv_id": "http://arxiv.org/abs/1403.4021v2",
    "download_url": "https://arxiv.org/abs/1403.4021v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pre-Lie algebras and the rooted trees operad",
    "abstract": "A Pre-Lie algebra is a vector space L endowed with a bilinear product * : L \\times L to L satisfying the relation (x*y)*z-x*(y*z)= (x*z)*y-x*(z*y), for all x,y,z in L. We give an explicit combinatorial description in terms of rooted trees of the operad associated to this type of algebras and prove that it is a Koszul operad.",
    "authors": [
      "Frederic Chapoton",
      "Muriel Livernet"
    ],
    "publication_date": "2000-02-10T09:56:43Z",
    "arxiv_id": "http://arxiv.org/abs/math/0002069v2",
    "download_url": "https://arxiv.org/abs/math/0002069v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Automatic Differentiation With Higher Infinitesimals, or Computational Smooth Infinitesimal Analysis in Weil Algebra",
    "abstract": "We propose an algorithm to compute the $C^\\infty$-ring structure of arbitrary Weil algebra. It allows us to do some analysis with higher infinitesimals numerically and symbolically. To that end, we first give a brief description of the (Forward-mode) automatic differentiation (AD) in terms of $C^\\infty$-rings. The notion of a $C^\\infty$-ring was introduced by Lawvere and used as the fundamental building block of smooth infinitesimal analysis and synthetic differential geometry. We argue that interpreting AD in terms of $C^\\infty$-rings gives us a unifying theoretical framework and modular ways to express multivariate partial derivatives. In particular, we can \"package\" higher-order Forward-mode AD as a Weil algebra, and take tensor products to compose them to achieve multivariate higher-order AD. The algorithms in the present paper can also be used for a pedagogical purpose in learning and studying smooth infinitesimal analysis as well.",
    "authors": [
      "Hiromi Ishii"
    ],
    "publication_date": "2021-06-27T06:17:26Z",
    "arxiv_id": "http://arxiv.org/abs/2106.14153v2",
    "download_url": "https://arxiv.org/abs/2106.14153v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Regularity over homomorphisms and a Frobenius characterization of Koszul algebras",
    "abstract": "Let $R$ be a standard graded algebra over an $F$-finite field of characteristic $p > 0$. Let $φ:R\\to R$ be the Frobenius endomorphism. For each finitely generated graded $R$-module $M$, let ${}^φ\\!M$ be the abelian group $M$ with the $R$-module structure induced by the Frobenius endomorphism. The $R$-module ${}^φ\\!M$ has a natural grading given by $\\text{deg} x=j$ if $x\\in M_{jp+i}$ for some $0\\le i \\le p-1$. In this paper, we prove that $R$ is Koszul if and only if there exists a non-zero finitely generated graded $R$-module $M$ such that $\\text{reg}_R\\,{}^φ\\!M <\\infty$. This result supplies another instance for the ability of the Frobenius in detecting homological properties, as exemplified by Kunz's famous regularity criterion. The main technical tool is the notion of Castelnuovo-Mumford regularity over certain homomorphisms between $\\mathbb{N}$-graded algebras. The latter notion is a common generalization of the relative and absolute Castelnuovo-Mumford regularity of modules.",
    "authors": [
      "Hop D. Nguyen",
      "Thanh Vu"
    ],
    "publication_date": "2013-03-21T04:33:06Z",
    "arxiv_id": "http://arxiv.org/abs/1303.5160v6",
    "download_url": "https://arxiv.org/abs/1303.5160v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complete $L_\\infty$-algebras and their homotopy theory",
    "abstract": "We analyze a model for the homotopy theory of complete filtered $L_\\infty$-algebras intended for applications in algebraic and algebro-geometric deformation theory. We provide an explicit proof of an unpublished result of E.\\ Getzler which states that the category $\\hat{\\mathsf{Lie}}_\\infty$ of such $L_\\infty$-algebras and filtration-preserving $\\infty$-morphisms admits the structure of a category of fibrant objects (CFO) for a homotopy theory. Novel applications of our approach include explicit models for homotopy pullbacks, and an analog of Whitehead's Theorem: under some mild conditions, every filtered $L_\\infty$-quasi-isomorphism in $\\hat{\\mathsf{Lie}}_\\infty$ has a filtration preserving homotopy inverse. Also, we show that the simplicial Maurer--Cartan functor, which assigns a Kan simplicial set to each $L_\\infty$-algebra in $\\hat{\\mathsf{Lie}}_\\infty$, is an exact functor between the respective CFOs. Finally, we provide an obstruction theory for the general problem of lifting a Maurer-Cartan element through an $\\infty$-morphism. The obstruction classes reside in the associated graded mapping cone of the corresponding tangent map.",
    "authors": [
      "Christopher L. Rogers"
    ],
    "publication_date": "2020-08-04T17:17:04Z",
    "arxiv_id": "http://arxiv.org/abs/2008.01706v3",
    "download_url": "https://arxiv.org/abs/2008.01706v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coverings of Laura Algebras: the Standard Case",
    "abstract": "In this paper, we study the covering theory of laura algebras. We prove that if a connected laura algebra is standard (that is, it is not quasi-tilted of canonical type and its connecting components are standard), then this algebra has nice Galois coverings associated to the coverings of the connecting component. As a consequence, we show that the first Hochschild cohomology group of a standard laura algebra vanishes if and only if it has no proper Galois coverings.",
    "authors": [
      "Ibrahim Assem",
      "Juan Carlos Bustamante",
      "Patrick Le Meur"
    ],
    "publication_date": "2008-08-08T17:26:53Z",
    "arxiv_id": "http://arxiv.org/abs/0808.1251v2",
    "download_url": "https://arxiv.org/abs/0808.1251v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Convex Algebraic Geometry of Curvature Operators",
    "abstract": "We study the structure of the set of algebraic curvature operators satisfying a sectional curvature bound under the light of the emerging field of Convex Algebraic Geometry. More precisely, we determine in which dimensions $n$ this convex semialgebraic set is a spectrahedron or a spectrahedral shadow; in particular, for $n\\geq5$, these give new counter-examples to the Helton--Nie Conjecture. Moreover, efficient algorithms are provided if $n=4$ to test membership in such a set. For $n\\geq5$, algorithms using semidefinite programming are obtained from hierarchies of inner approximations by spectrahedral shadows and outer relaxations by spectrahedra.",
    "authors": [
      "Renato G. Bettiol",
      "Mario Kummer",
      "Ricardo A. E. Mendes"
    ],
    "publication_date": "2019-08-10T08:52:59Z",
    "arxiv_id": "http://arxiv.org/abs/1908.03713v2",
    "download_url": "https://arxiv.org/abs/1908.03713v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$\\hbar$-Vertex algebras and chiralization of star products",
    "abstract": "We develop the theory of $\\hbar$-vertex algebras, algebraic structures closely related to vertex algebras but with a deformed translation covariance axiom. We establish their structure theory, including analogues of Goddard's Uniqueness Theorem, the Reconstruction Theorem, Borcherds Identity, and the OPE Expansion Formula, and introduce the associated notions of $\\hbar$-Lie conformal and $\\hbar$-Poisson vertex algebras. The formalism provides a natural and simplified construction of the Zhu algebra. The main application is to the chiralization of classical star-products: we show that every star-product on the symmetric algebra of a Lie algebra (or its central extensions) admits a chiralization, and we derive explicit formulae for these chiral star-products, including the Moyal-Weyl and Gutt star-products. Setting $\\hbar=0$ recovers explicit deformation quantizations of a broad class of Poisson vertex algebras, including the classical limits of free-boson, $βγ$-system, affine, and Virasoro vertex algebras.",
    "authors": [
      "Simone Castellan"
    ],
    "publication_date": "2023-08-25T14:42:08Z",
    "arxiv_id": "http://arxiv.org/abs/2308.13412v3",
    "download_url": "https://arxiv.org/abs/2308.13412v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Combinatorial Dimensions: Indecomposability on Certain Local Finite Dimensional Trivial Extension Algebras",
    "abstract": "We study problems related to indecomposability of modules over certain local finite dimensional trivial extension algebras. We do this by purely combinatorial methods. We introduce the concepts of graph of cyclic modules, of combinatorial dimension, and of fundamental combinatorial dimension of a module. We use these concepts to establish, under favorable conditions, criteria for the indecomposability of a module. We present categorifed versions of these constructions and we use this categorical framework to establish criteria for the indecomposability of modules of infinite rank.",
    "authors": [
      "Juan Orendain"
    ],
    "publication_date": "2013-08-21T20:42:01Z",
    "arxiv_id": "http://arxiv.org/abs/1308.4709v2",
    "download_url": "https://arxiv.org/abs/1308.4709v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A categorification of cluster algebras of type B and C through symmetric quivers",
    "abstract": "We express cluster variables of type $B_n$ and $C_n$ in terms of cluster variables of type $A_n$. Then we associate a cluster tilted bound symmetric quiver $Q$ of type $A_{2n-1}$ to any seed of a cluster algebra of type $B_n$ and $C_n$. Under this correspondence, cluster variables of type $B_n$ (resp. $C_n$) correspond to orthogonal (resp. symplectic) indecomposable representations of $Q$. We find a Caldero-Chapoton map in this setting. We also give a categorical interpretation of the cluster expansion formula in the case of acyclic quivers.",
    "authors": [
      "Azzurra Ciliberti"
    ],
    "publication_date": "2024-03-17T19:06:31Z",
    "arxiv_id": "http://arxiv.org/abs/2403.11308v3",
    "download_url": "https://arxiv.org/abs/2403.11308v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Polytopal linear algebra",
    "abstract": "We investigate similarities between the category of vector spaces and that of polytopal algebras, containing the former as a full subcategory. In Section 2 we introduce the notion of a polytopal Picard group and show that it is trivial for fields. The coincidence of this group with the ordinary Picard group for general rings remains an open question. In Section 3 we survey some of the previous results on the automorphism groups and retractions. These results support a general conjecture proposed in Section 4 about the nature of arbitrary homomorphisms of polytopal algebras. Thereafter a further confirmation of this conjecture is presented by homomorphisms defined on Veronese singularities.\n  This is a continuation of the project started in our papers \"Polytopal linear groups\" (J. Algebra 218 (1999), 715--737), \"Polytopal linear retractions\" preprint, math.AG/0001049) and \"Polyhedral algebras, arrangements of toric varieties, and their groups\" (preprint, http://www.mathematik.uni-osnabrueck.de/K-theory/0232/index.html). The higher $K$-theoretic aspects of polytopal linear objects will be treated in \"Polyhedral $K$-theory\" (in preparation).",
    "authors": [
      "Winfried Bruns",
      "Joseph Gubeladze"
    ],
    "publication_date": "2000-02-03T10:40:12Z",
    "arxiv_id": "http://arxiv.org/abs/math/0002024v3",
    "download_url": "https://arxiv.org/abs/math/0002024v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebras of Quasi-Plücker Coordinates are Koszul",
    "abstract": "Motivated by the theory of quasi-determinants, we study non-commutative algebras of quasi-Plücker coordinates. We prove that these algebras provide new examples of non-homogeneous quadratic Koszul algebras by showing that their quadratic duals have quadratic Gröbner bases.",
    "authors": [
      "Robert Laugwitz",
      "Vladimir Retakh"
    ],
    "publication_date": "2017-03-25T23:32:47Z",
    "arxiv_id": "http://arxiv.org/abs/1703.08747v3",
    "download_url": "https://arxiv.org/abs/1703.08747v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The algebraic dynamics of generic endomorphisms of P^n",
    "abstract": "We investigate some general questions in algebraic dynamics in the case of generic endomorphisms of projective spaces over a field of characteristic zero. The main results that we prove are that a generic endomorphism has no non-trivial preperiodic subvarieties, any infinite set of preperiodic points is Zariski dense and any infinite subset of a single orbit is also Zariski dense, thereby verifying the dynamical \"Manin--Mumford\" conjecture of Zhang and the dynamical \"Mordell--Lang\" conjecture of Denis and Ghioca--Tucker in this case.",
    "authors": [
      "Najmuddin Fakhruddin"
    ],
    "publication_date": "2012-11-30T09:37:22Z",
    "arxiv_id": "http://arxiv.org/abs/1211.7198v2",
    "download_url": "https://arxiv.org/abs/1211.7198v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Constructing cell data for diagram algebras",
    "abstract": "We show how the treatment of cellularity in families of algebras arising from diagram calculi, such as Jones' Temperley--Lieb wreaths, variants on Brauer's centralizer algebras, and the contour algebras of Cox et al (of which many algebras are special cases), may be unified using the theory of tabular algebras. This improves an earlier result of the first author (whose hypotheses covered only the Brauer algebra from among these families).",
    "authors": [
      "R. M. Green",
      "P. P. Martin"
    ],
    "publication_date": "2005-03-31T20:08:27Z",
    "arxiv_id": "http://arxiv.org/abs/math/0503751v3",
    "download_url": "https://arxiv.org/abs/math/0503751v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Koszulity for nonquadratic algebras II",
    "abstract": "It has been shown recently, in a joint work with Michel Dubois-Violette and Marc Wambst (see math.QA/0203035), that Koszul property of $N$-homogeneous algebras (as defined in the original paper) becomes natural in a $N$-complex setting. A basic question is to define the differential of the bimodule Koszul complex of an $N$-homogeneous algebra, e.g., for computing its Hochschild homology. The differential defined here uses $N$-complexes. That puts right the wrong differential presented in the original paper in a 2-complex setting. Actually, as we shall see, it is impossible to avoid $N$-complexes in defining the differential, whereas the bimodule Koszul complex is a 2-complex.",
    "authors": [
      "Roland Berger"
    ],
    "publication_date": "2003-01-16T15:52:00Z",
    "arxiv_id": "http://arxiv.org/abs/math/0301172v1",
    "download_url": "https://arxiv.org/abs/math/0301172v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Ideals of Free Differential Algebras",
    "abstract": "We consider the free ${\\bf C}$-algebra ${\\cal B}_q$ with $N$ generators $\\{ξ_i\\}_{i = 1,...,N}$, together with a set of $N$ differential operators $\\{\\partial_i\\}_{i = 1,...,N}$ that act as twisted derivations on ${\\cal B}_q$ according to the rule $\\partial_iξ_j = δ_{ij} + q_{ij}ξ_j\\partial_i$; that is, $\\forall x \\in {\\cal B}_q, \\partial_i(ξ_jx) = δ_{ij}x + q_{ij}ξ_j\\partial_i x,$ and $\\partial_i{\\bf C} = 0$. The suffix $q$ on ${\\cal B}_q$ stands for $\\{q_{ij}\\}_{i,j \\in \\{1,...,N\\}}$ and is interpreted as a point in parameter space, $q = \\{q_{ij}\\}\\in {\\bf C}^{N^2}$. A constant $C \\in {\\cal B}_q$ is a nontrivial element with the property $\\partial_iC = 0, i = 1,...,N$. To each point in parameter space there correponds a unique set of constants and a differential complex. There are no constants when the parameters $q_{ij}$ are in general position. We obtain some precise results concerning the algebraic surfaces in parameter space on which constants exist. Let ${\\cal I}_q$ denote the ideal generated by the constants. We relate the quotient algebras ${\\cal B}_q' = {\\cal B}_q/{\\cal I}_q$ to Yang-Baxter algebras and, in particular, to quantized Kac-Moody algebras. The differential complex is a generalization of that of a quantized Kac-Moody algebra described in terms of Serre generators. Integrability conditions for $q$-differential equations are related to Hochschild cohomology. It is shown that $H^p({\\cal B}_q',{\\cal B}_q') = 0$ for $p \\geq 1$. The intimate relationship to generalized, quantized Kac-Moody algebras suggests an approach to the problem of classification of these algebras.",
    "authors": [
      "C. Fronsdal",
      "A. Galindo"
    ],
    "publication_date": "1998-06-12T09:43:23Z",
    "arxiv_id": "http://arxiv.org/abs/math/9806069v2",
    "download_url": "https://arxiv.org/abs/math/9806069v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The multiplication theorem and bases in finite and affine quantum cluster algebras",
    "abstract": "We prove a multiplication theorem for quantum cluster algebras of acyclic quivers. The theorem generalizes the multiplication formula for quantum cluster variables in \\cite{fanqin}. We apply the formula to construct some $\\mathbb{ZP}$-bases in quantum cluster algebras of finite and affine types. Under the specialization $q$ and coefficients to $1$, these bases are the integral bases of cluster algebra of finite and affine types (see \\cite{CK1} and \\cite{DXX}).",
    "authors": [
      "Ming Ding",
      "Fan Xu"
    ],
    "publication_date": "2010-06-20T11:29:15Z",
    "arxiv_id": "http://arxiv.org/abs/1006.3928v4",
    "download_url": "https://arxiv.org/abs/1006.3928v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Class of Locally Complete Intersection Multiple Structures on Smooth Algebraic Varieties as Support",
    "abstract": "We give the construction of a class of multiple locally complete intersection structures on a smooth algebraic variety as support. This class contains the structures defined locally by equations of the form $x^n=0$, $y^2=0$, $z=0, >..., u=0$.",
    "authors": [
      "Nicolae Manolache"
    ],
    "publication_date": "2009-07-06T21:23:01Z",
    "arxiv_id": "http://arxiv.org/abs/0907.1108v1",
    "download_url": "https://arxiv.org/abs/0907.1108v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Commuting quantum traces for quadratic algebras",
    "abstract": "Consistent tensor products on auxiliary spaces, hereafter denoted \"fusion procedures\", are defined for general quadratic algebras, non-dynamical and dynamical, inspired by results on reflection algebras. Applications of these procedures then yield integer-indexed families of commuting Hamiltonians.",
    "authors": [
      "Zoltan Nagy",
      "Jean Avan",
      "Anastasia Doikou",
      "Genevieve Rollet"
    ],
    "publication_date": "2004-03-15T15:39:07Z",
    "arxiv_id": "http://arxiv.org/abs/math/0403246v2",
    "download_url": "https://arxiv.org/abs/math/0403246v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Andre-Quillen homology of commutative algebras",
    "abstract": "These notes are an introduction to basic properties of Andre-Quillen homology for commutative algebras. They are an expanded version of my lectures at the summer school: Interactions between homotopy theory and algebra, University of Chicago, 26th July - 6th August, 2004. The aim is to give fairly complete proofs of characterizations of smooth homomorphisms and of locally complete intersection homomorphisms in terms of vanishing of Andre-Quillen homology. The choice of the material, and the point of view, are guided by these goals.",
    "authors": [
      "Srikanth Iyengar"
    ],
    "publication_date": "2006-09-05T17:51:48Z",
    "arxiv_id": "http://arxiv.org/abs/math/0609151v1",
    "download_url": "https://arxiv.org/abs/math/0609151v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lattice-ordered matrix algebras over real GCD-domains",
    "abstract": "Let $ R \\subset \\R $ be a GCD-domain. In this paper, Weinberg's conjecture on the $ n \\times n $ matrix algebra $ M_{n}(R) \\ (n \\geq 2) $ is proved. Moreover, all the lattice orders (up to isomorphisms) on a full $ 2 \\times 2 $ matrix algebra over $ R $ are obtained.",
    "authors": [
      "Fei Li",
      "Xianlong Bai",
      "Derong Qiu"
    ],
    "publication_date": "2010-10-21T07:27:17Z",
    "arxiv_id": "http://arxiv.org/abs/1010.4380v5",
    "download_url": "https://arxiv.org/abs/1010.4380v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modules and Cohomology over Group Algebras: One Commutative Algebraist's Perspective",
    "abstract": "This article explains basic constructions and results on group algebras and their cohomology, starting from the point of view of commutative algebra. It provides the background necessary for a novice in this subject to begin reading Dave Benson's article in the same MSRI volume that this article is slated to appear in.",
    "authors": [
      "Srikanth Iyengar"
    ],
    "publication_date": "2004-09-10T23:06:20Z",
    "arxiv_id": "http://arxiv.org/abs/math/0409188v1",
    "download_url": "https://arxiv.org/abs/math/0409188v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Étale homotopy equivalence of rational points on algebraic varieties",
    "abstract": "It is possible to talk about the étale homotopy equivalence of rational points on algebraic varieties by using a relative version of the étale homotopy type. We show that over $p$-adic fields rational points are homotopy equivalent in this sense if and only if they are étale-Brauer equivalent. We also show that over the real field rational points on projective varieties are étale homotopy equivalent if and only if they are in the same connected component. We also study this equivalence relation over number fields and prove that in this case it is finer than the other two equivalence relations for certain generalised Châtelet surfaces.",
    "authors": [
      "Ambrus Pal"
    ],
    "publication_date": "2010-02-08T22:35:00Z",
    "arxiv_id": "http://arxiv.org/abs/1002.1731v5",
    "download_url": "https://arxiv.org/abs/1002.1731v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Lie algebra of a Malcev algebra",
    "abstract": "This paper develops the structure theory of a Malcev algebra via the consideration of its most important and largest Lie (sub-) algebra. We introduce the notion of a Lie algebra which uniquely corresponds to a Malcev algebra and use this correspondence to derive some basic properties of some types of ideals in the Malcev algebra. We then prove the exact nature of the root-space decomposition of a Malcev algebra.",
    "authors": [
      "Olufemi O. Oyadare"
    ],
    "publication_date": "2024-06-20T13:00:28Z",
    "arxiv_id": "http://arxiv.org/abs/2406.14592v2",
    "download_url": "https://arxiv.org/abs/2406.14592v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Projective Nullstellensatz for not necessarily algebraically closed fields",
    "abstract": "The Nullstellensatz, proved by Hilbert in 1893, is a classical result that holds when the base field is algebraically closed. When the base field is finite, a version of Hilbert's Nullstellensatz is given by Terjanian in 1966. Laksov in 1987 generalized Hilbert's Nullstellensatz to a $K$-Nullstellensatz when the base field $K$ is not necessarily algebraically closed. However, unlike Tarjanian's Nullstellensatz, Laksov's Nullstellensatz is not very explicit. Later, Laksov and Westin in 1990 proposed a strengthening to Laksov's Nullstellensatz in the form of four conjectures.\n  A projective analogue of Nullstellensatz of the classical Nullstellensatz of Hilbert is well-known for projective varieties over algebraically closed fields. For finite fields, the projective analogue of the Nullstellensatz can be derived as an application of Hilbert's Nullstellensatz, though it is not as efficient as Terjanian's Nullstellensatz. Gimenez, Ruano and San-José in 2023 strengthened this result by identifying a computationally efficient set. Here, we introduce an even more efficient set that establishes the projective analogue of the Nullstellensatz for finite fields. Additionally, we provide counterexamples to three of the conjectures of Laksov and Westin.",
    "authors": [
      "Rati Ludhani"
    ],
    "publication_date": "2024-11-10T01:26:18Z",
    "arxiv_id": "http://arxiv.org/abs/2411.06325v2",
    "download_url": "https://arxiv.org/abs/2411.06325v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mapping cones of monomial ideals over exterior algebras",
    "abstract": "Let $K$ be a field, $V$ a finite dimensional $K$-vector space and $E$ the exterior algebra of $V$. We analyze iterated mapping cone over $E$. If $I$ is a monomial ideal of $E$ with linear quotients, we show that the mapping cone construction yields a minimal graded free resolution $F$ of $I$ via the Cartan complex. Moreover, we provide an explicit description of the differentials in $F$ when the ideal $I$ has a regular decomposition function. Finally, we get a formula for the graded Betti numbers of a new class of monomial ideals including the class of strongly stable ideals.",
    "authors": [
      "Marilena Crupi",
      "Antonino Ficarra",
      "Ernesto Lax"
    ],
    "publication_date": "2023-03-13T09:46:29Z",
    "arxiv_id": "http://arxiv.org/abs/2303.06953v2",
    "download_url": "https://arxiv.org/abs/2303.06953v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graded cellular basis and Jucys-Murphy elements for generalized blob algebras",
    "abstract": "We give a concrete construction of a graded cellular basis for the generalized blob algebra B_n introduced by Martin and Woodcock. The construction uses the isomorphism between KLR-algebras and cyclotomic Hecke algebras, proved by Brundan-Kleshchev and Rouquier. It gives rise to a family of Jucys-Murphy elements for B_n.",
    "authors": [
      "Diego Lobos",
      "Steen Ryom-Hansen"
    ],
    "publication_date": "2018-12-28T18:18:35Z",
    "arxiv_id": "http://arxiv.org/abs/1812.11143v3",
    "download_url": "https://arxiv.org/abs/1812.11143v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Goldman-Millson theorem for $A_\\infty$-algebras in arbitrary characteristic",
    "abstract": "Complete filtered $A_\\infty$-algebras model certain deformation problems in the noncommutative setting. The formal deformation theory of a group representation is a classical example. With such applications in mind, we provide the $A_\\infty$ analogs of several key theorems from the Maurer-Cartan theory for $L_\\infty$-algebras. In contrast with the $L_\\infty$ case, our results hold over a field of arbitrary characteristic. We first leverage some abstract homotopical algebra to give a concise proof of the $A_\\infty$-Goldman-Millson theorem: The nerve functor, which assigns a simplicial set $\\mathcal{N}_{\\bullet}(A)$ to an $A_\\infty$-algebra $A$, sends filtered quasi-isomorphisms to homotopy equivalences. We then characterize the homotopy groups of $\\mathcal{N}_\\bullet(A)$ in terms of the cohomology algebra $H(A)$, and its group of quasi-invertible elements. Finally, we return to the characteristic zero case and show that the nerve of $A$ is homotopy equivalent to the simplicial Maurer-Cartan set of its commutator $L_\\infty$-algebra. This answers a question posed by N. de Kleijn and F. Wierstra in arXiv:1809.07743.",
    "authors": [
      "Alex Milham",
      "Christopher L. Rogers"
    ],
    "publication_date": "2022-05-26T01:02:26Z",
    "arxiv_id": "http://arxiv.org/abs/2205.13099v3",
    "download_url": "https://arxiv.org/abs/2205.13099v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Local cohomology modules of bigraded Rees algebras",
    "abstract": "Formulas are obtained in terms of complete reductions for the bigraded components of local cohomology modules of bigraded Rees algebras of 0-dimensional ideals in 2-dimensional Cohen-Macaulay local rings. As a consequence, cohomological expressions for the coefficients of the Bhattacharya polynomial of such ideals are obtained.",
    "authors": [
      "A. V. Jayanthan",
      "J. K. Verma"
    ],
    "publication_date": "2002-10-24T14:05:29Z",
    "arxiv_id": "http://arxiv.org/abs/math/0210381v1",
    "download_url": "https://arxiv.org/abs/math/0210381v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Liftings of Nichols algebras of diagonal type III. Cartan type $G_2$",
    "abstract": "We complete the classification of Hopf algebras whose infinitesimal braiding is a principal Yetter-Drinfeld realization of a braided vector space of Cartan type $G_2$ over a cosemisimple Hopf algebra. We develop a general formula for a class of liftings in which the quantum Serre relations hold. We give a detailed explanation of the procedure for finding the relations, based on the recent work of Andruskiewitsch, Angiono and Rossi Bertone.",
    "authors": [
      "Agustín García Iglesias",
      "João Matheus Jury Giraldi"
    ],
    "publication_date": "2016-07-26T19:41:58Z",
    "arxiv_id": "http://arxiv.org/abs/1607.07857v3",
    "download_url": "https://arxiv.org/abs/1607.07857v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Affine Birman-Wenzl-Murakami Algebras and Tangles in the Solid Torus",
    "abstract": "The ordinary (or classical) Birman-Wenzl-Murakami algebras were initially conceived as an algebraic framework for the Kauffman link invariant. They also appear as centralizer algebras for representations of quantum universal enveloping algebras of orthogonal or symplectic types.\n  It was shown by Morton and Wassermann that the BMW algebras are isomorphic to algebras of tangles in (disc $\\times$ interval), modulo Kauffman skein relations. This isomorphism allows one to see very clearly certain properties of the BMW algebras -- for example existence of Markov traces and conditional expectations and a good basis.\n  In the present work, we establish the correponding results for affine BMW algebras, showing they are isomorphic to algebras of tangles in (annulus $\\times$ interval), modulo Kaufffman skein relations. Again, this provides an important foundation for studying these algebras, as the existence of Markov traces and conditional expectations are consequences of the isomorphism. Moreover, we obtain a basis of the affine BMW algebras analogous to a well known basis of the affine Hecke algebras.",
    "authors": [
      "Frederick M. Goodman",
      "Holly M. Hauschild"
    ],
    "publication_date": "2004-11-07T21:29:08Z",
    "arxiv_id": "http://arxiv.org/abs/math/0411155v2",
    "download_url": "https://arxiv.org/abs/math/0411155v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Addendum to \"Frobenius and Cartier algebras of Stanley-Reisner rings\" [J. Algebra 358 (2012) 162-177]",
    "abstract": "We give a purely combinatorial characterization of complete Stanley-Reisner rings having principally generated (equivalently, finitely generated) Cartier algebras.",
    "authors": [
      "Josep Alvarez Montaner",
      "Kohji Yanagawa"
    ],
    "publication_date": "2013-05-04T16:24:38Z",
    "arxiv_id": "http://arxiv.org/abs/1305.0931v2",
    "download_url": "https://arxiv.org/abs/1305.0931v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of involutions on graded-division simple real algebras",
    "abstract": "We classify, up to isomorphism and up to equivalence, involutions on graded-division finite-dimensional simple real (associative) algebras, when the grading group is abelian.",
    "authors": [
      "Yuri Bahturin",
      "Mikhail Kochetov",
      "Adrián Rodrigo-Escudero"
    ],
    "publication_date": "2017-07-18T08:50:35Z",
    "arxiv_id": "http://arxiv.org/abs/1707.05526v2",
    "download_url": "https://arxiv.org/abs/1707.05526v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Kac-Moody Algebras and Vertex Representations",
    "abstract": "We introduce an affinization of the quantum Kac-Moody algebra associated to a symmetric generalized Cartan matrix. Based on the affinization, we construct a representation of the quantum Kac-Moody algebra by vertex operators from bosonic fields. We also obtain a combinatorial indentity about Hall-Littlewood polynomials.",
    "authors": [
      "Naihuan Jing"
    ],
    "publication_date": "1998-02-06T15:20:47Z",
    "arxiv_id": "http://arxiv.org/abs/math/9802036v2",
    "download_url": "https://arxiv.org/abs/math/9802036v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The algebraic structure of relative twisted vertex operators",
    "abstract": "Twisted vertex operators based on rational lattices have had many applications in vertex operator algebra theory and conformal field theory. In this paper, ``relativized'' twisted vertex operators are constructed in a general context based on isometries of rational lattices, and a generalized twisted Jacobi identity is established for them. This result generalizes many previous results. Relatived untwisted vertex operators had been studied in a monograph by the authors. The present paper includes as a special case the proof of the main relations among twisted vertex operators based on even lattices announced some time ago by the second author.",
    "authors": [
      "Chongying Dong",
      "James Lepowsky"
    ],
    "publication_date": "1996-04-29T20:16:40Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9604022v1",
    "download_url": "https://arxiv.org/abs/q-alg/9604022v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strong test ideals associated to Cartier algebras",
    "abstract": "In this note, we use the theory of test ideals and Cartier algebras to examine the interplay between the tight and integral closures in a local ring of positive characteristic. Using work of Schwede, we prove the abundance of strong test ideals, recovering some older fundamental results, and use this approach in concrete computations. In the second part of the paper, the case of Stanley-Reisner rings is fully examined.",
    "authors": [
      "Florian Enescu",
      "Irina Ilioaea"
    ],
    "publication_date": "2019-01-14T03:38:33Z",
    "arxiv_id": "http://arxiv.org/abs/1901.04113v1",
    "download_url": "https://arxiv.org/abs/1901.04113v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comapactness Conditions in Universal Algebraic Geometry",
    "abstract": "In this article, the properties of being equational noetherian, $q_ω$ and $u_ω$-compactness, and equational Artinian are studied from the perspective of the Zariski topology. The equational conditions on the relative free algebras of arbitrary varieties are also investigated.",
    "authors": [
      "P. Modabberi",
      "M. Shahryari"
    ],
    "publication_date": "2014-01-17T15:56:29Z",
    "arxiv_id": "http://arxiv.org/abs/1401.4389v5",
    "download_url": "https://arxiv.org/abs/1401.4389v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The equitable presentation for the quantum group $U_q(g)$ associated with a symmetrizable Kac-Moody algebra $g$",
    "abstract": "We consider the quantum group $U_q(g)$ associated with a symmetrizable Kac-Moody algebra $g$. We display a presentation for $U_q(g)$ that we find attractive; we call this the equitable presentation. For $g=sl_2$ the equitable presentation has generators $X,X^{-1},Y,Z$ and relations\n  $X X^{-1} =1$,\n  $X^{-1} X=1$,\n  $\\frac{qXY-q^{-1}YX}{q-q^{-1}}=1$,\n  $\\frac{qYZ-q^{-1}ZY}{q-q^{-1}}=1$,\n  $\\frac{qZX-q^{-1}XZ}{q-q^{-1}}=1$.",
    "authors": [
      "Paul Terwilliger"
    ],
    "publication_date": "2005-07-22T14:09:44Z",
    "arxiv_id": "http://arxiv.org/abs/math/0507478v1",
    "download_url": "https://arxiv.org/abs/math/0507478v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Rees Algebra of Parametric Curves via liftings",
    "abstract": "We study the defining equations of the Rees algebra of ideals arising from curve parametrizations in the plane and in rational normal scrolls, inspired by the work of Madsen and Kustin, Polini and Ulrich. The curves are related by work of Bernardi, Gimigliano and Ida, and we use this framework to relate the defining equations.",
    "authors": [
      "Teresa Cortadellas Benitez",
      "David Cox",
      "Carlos D'Andrea"
    ],
    "publication_date": "2018-10-04T07:14:55Z",
    "arxiv_id": "http://arxiv.org/abs/1810.02077v3",
    "download_url": "https://arxiv.org/abs/1810.02077v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Auslander-Gorenstein algebras and precluster tilting",
    "abstract": "We generalize the notions of $n$-cluster tilting subcategories and $τ$-selfinjective algebras into $n$-precluster tilting subcategories and $τ_n$-selfinjective algebras, where we show that a subcategory naturally associated to $n$-precluster tilting subcategories has a higher Auslander--Reiten theory. Furthermore, we give a bijection between $n$-precluster tilting subcategories and $n$-minimal Auslander--Gorenstein algebras, which is a higher dimensional analog of Auslander--Solberg correspondence (Auslander--Solberg, 1993) as well as a Gorenstein analog of $n$-Auslander correspondence (Iyama, 2007). The Auslander--Reiten theory associated to an $n$-precluster tilting subcategory is used to classify the $n$-minimal Auslander--Gorenstein algebras into four disjoint classes. Our method is based on relative homological algebra due to Auslander--Solberg.",
    "authors": [
      "Osamu Iyama",
      "Øyvind Solberg"
    ],
    "publication_date": "2016-08-15T05:07:28Z",
    "arxiv_id": "http://arxiv.org/abs/1608.04179v2",
    "download_url": "https://arxiv.org/abs/1608.04179v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic properties of tensor product of modules over a field",
    "abstract": "Let $A$ and $B$ be commutative Noetherian algebras over an arbitrary field $\\Bbbk$ such that $A \\otimes_\\Bbbk B$ is Noetherian. We consider ideals $I$ and $J$ of $A$ and $B$, respectively, as well as nonzero finitely generated modules $L$ and $N$ over $A$ and $B$, respectively. In this paper, we investigate certain algebraic properties of the $A \\otimes_\\Bbbk B$-module $L\\otimes_{\\Bbbk} N$, which are often inherited from the properties of the $A$-module $L$ and the $B$-module $N$. Specifically, we provide characterizations for the Cohen-Macaulayness, generalized Cohen-Macaulayness, and sequentially Cohen-Macaulayness of $L\\otimes_{\\Bbbk} N$ with respect to the ideal $I \\otimes_\\Bbbk B + A \\otimes_\\Bbbk J$, in terms of the corresponding properties for $L$ and $N$ with respect to $I$ and $J$, respectively.",
    "authors": [
      "Ahad Rahimi"
    ],
    "publication_date": "2025-04-24T03:14:47Z",
    "arxiv_id": "http://arxiv.org/abs/2504.17217v1",
    "download_url": "https://arxiv.org/abs/2504.17217v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Braided Hopf algebras arising from matched pairs of groups",
    "abstract": "Let k be a field. Let also (F, G) be a matched pair of groups. We give necessary and sufficient conditions on a pair (σ, τ) of 2-cocycles in order that the crossed product algebra and the crossed coproduct coalgebra k^G{}^τ#_σ kF combine into a braided Hopf algebra. We also discuss diagonal realizations of such braided Hopf algebras in the category of Yetter-Drinfeld modules over a finite group.",
    "authors": [
      "Nicolas Andruskiewitsch",
      "Sonia Natale"
    ],
    "publication_date": "2002-09-17T09:53:24Z",
    "arxiv_id": "http://arxiv.org/abs/math/0209210v2",
    "download_url": "https://arxiv.org/abs/math/0209210v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the resolution of fan algebras of principal ideals over a Noetherian ring",
    "abstract": "We construct explicitly a resolution of a fan algebra of principal ideals over a Noetherian ring for the case when the fan is a proper rational cone in the plane. Under some mild conditions on the initial data, we show that this resolution is minimal.",
    "authors": [
      "Teresa Cortadellas Benitez",
      "Carlos D'Andrea",
      "Florian Enescu"
    ],
    "publication_date": "2016-12-09T08:27:24Z",
    "arxiv_id": "http://arxiv.org/abs/1612.02939v6",
    "download_url": "https://arxiv.org/abs/1612.02939v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of singularities of cluster algebras of finite type II: coefficients",
    "abstract": "We provide a complete classification of the singularities of cluster algebras of finite cluster type. This extends our previous work about the case of trivial coefficients. Additionally, we classify the singularities of cluster algebras for rank two.",
    "authors": [
      "Angélica Benito",
      "Eleonore Faber",
      "Hussein Mourtada",
      "Bernd Schober"
    ],
    "publication_date": "2024-01-12T18:44:59Z",
    "arxiv_id": "http://arxiv.org/abs/2401.06758v2",
    "download_url": "https://arxiv.org/abs/2401.06758v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Grüss type inequalities for positive linear maps on $C^*$-algebras",
    "abstract": "Let $\\mathcal{A}$ and $\\mathcal{B}$ be two unital $C^*$-algebras and let for $C\\in\\mathcal{A},\\ Γ_C=\\{γ\\in \\mathbb{C} : \\|C-γI\\|=\\inf_{α\\in \\mathbb{C}} \\|C-αI\\|\\}$. We prove that if $Φ:\\mathcal{A} \\longrightarrow \\mathcal{B}$ is a unital positive linear map, then \\begin{eqnarray*} \\big|Φ(AB)-Φ(A)Φ(B)\\big| \\leq \\big\\|Φ(|A^*-ζI|^2)\\big\\|^\\frac{1}{2} \\big[Φ(|B-ξI|^2)\\big]^\\frac{1}{2} \\end{eqnarray*} for all $A,B\\in\\mathcal{A}, ζ\\in Γ_A$ and $ξ\\inΓ_B.$\\\\ In addition, we show that if $(\\mathcal{A},τ)$ is a noncommutative probability space and $T \\in \\mathcal{A}$ is a density operator, then \\begin{eqnarray*} \\ \\ \\big|τ(TAB)-τ(TA)τ(TB)\\big|\\leq \\|A-ζI\\|_p\\|B-ξI\\|_q\\|T\\|_r \\ \\ (p,q\\geq 4, r\\geq 2) \\end{eqnarray*} and \\begin{eqnarray*} \\big|τ(TAB)-τ(TA)τ(TB)\\big|\\leq \\|A-ζI\\|_p\\|B-ξI\\|_q\\|T\\| \\ \\ \\ \\ (p,q\\geq 2)\\ \\ \\ \\ \\ \\end{eqnarray*} for every $A,B \\in \\mathcal{A}$ and $ζ\\in Γ_A,ξ\\in Γ_B$. Our results generalize the corresponding results for matrices to operators on spaces of arbitrary dimension.",
    "authors": [
      "Ali Dadkhah",
      "Mohammad Sal Moslehian"
    ],
    "publication_date": "2016-10-12T20:33:48Z",
    "arxiv_id": "http://arxiv.org/abs/1610.03868v1",
    "download_url": "https://arxiv.org/abs/1610.03868v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Atiyah classes of strongly homotopy Lie pairs",
    "abstract": "The subject of this paper is strongly homotopy (SH) Lie algebras, also known as $L_\\infty$-algebras. We extract an intrinsic character, the Atiyah class, which measures the nontriviality of an (SH) Lie algebra $A$ when it is extended to $L$. In fact, given such an SH Lie pair $(L, A)$, and any $A$-module $E$, there associates a canonical cohomology class, the Atiyah class $[α^E]$, which generalizes earlier known Atiyah classes out of Lie algebra pairs. We show that the Atiyah class $[α^{L/A}]$ induces a graded Lie algebra structure on $\\operatorname{H}^\\bullet_{\\mathrm{CE}}(A,L/A[-2])$, and the Atiyah class $[α^E]$ of any $A$-module $E$ induces a Lie algebra module structure on $\\operatorname{H}^\\bullet_{\\mathrm{CE}}(A,E)$. Moreover, Atiyah classes are invariant under gauge equivalent $A$-compatible infinitesimal deformations of $L$.",
    "authors": [
      "Zhuo Chen",
      "Honglei Lang",
      "Maosong Xiang"
    ],
    "publication_date": "2016-09-04T20:20:15Z",
    "arxiv_id": "http://arxiv.org/abs/1609.00984v4",
    "download_url": "https://arxiv.org/abs/1609.00984v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Corrigendum to \"Degenerate Sklyanin algebras and Generalized Twisted Homogeneous Coordinate rings\", J. Algebra 322 (2009) 2508-2527",
    "abstract": "There is an error in the computation of the truncated point schemes of the degenerate Sklyanin algebra S(1, 1, 1); they are larger than was claimed in Proposition 3.13 of the above paper. We provide a description of the correct truncated point schemes. Results about the corresponding point parameter ring associated to these schemes are given afterward.",
    "authors": [
      "Chelsea M. Walton"
    ],
    "publication_date": "2011-12-22T00:26:28Z",
    "arxiv_id": "http://arxiv.org/abs/1112.5211v2",
    "download_url": "https://arxiv.org/abs/1112.5211v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spectral properties of nonassociative algebras and breaking regularity for nonlinear elliptic type PDEs",
    "abstract": "In this note, we address the following question: Why certain nonassociative algebra structures emerge in the regularity theory of elliptic type PDEs and also in constructing nonclassical and singular solutions? The aim of the paper is twofold. Firstly, to give a survey of diverse examples on nonregular solutions to elliptic PDEs with emphasis on recent results on nonclassical solutions to fully nonlinear equations. Secondly, to define an appropriate algebraic formalism which makes the analytic part of the construction of nonclassical solutions more transparent.",
    "authors": [
      "Vladimir G. Tkachev"
    ],
    "publication_date": "2019-01-09T14:44:54Z",
    "arxiv_id": "http://arxiv.org/abs/1901.02765v3",
    "download_url": "https://arxiv.org/abs/1901.02765v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-noetherian groups and primitivity of their group algebras",
    "abstract": "We prove that the group algebra $KG$ of a group $G$ over a field $K$ is primitive, provided that $G$ has a free subgroup with the same cardinality as $G$, and that $G$ satisfies the following condition $(\\ast)$: for each subset $M$ of $G$ consisting of a finite number of elements not equal to $1$, and for any positive integer $m$, there exist distinct $a$, $b$, and $c$ in $G$ so that if $(x_{1}^{-1}g_1x_{1}) \\cdots (x_{m}^{-1}g_mx_{m})=1$, where $g_i$ is in $M$ and $x_i$ is equal to $a$, $b$, or $c$ for all $i$ between $1$ and $m$, then $x_{i}=x_{i+1}$ for some $i$. This generalizes results of \\cite{Bal}, \\cite{For}, \\cite{Ni07}, and \\cite{Ni11}, and proves that, for every countably infinite group $G$ satisfying $(\\ast)$, $KG$ is primitive for any field $K$. We use this result to determine the primitivity of group algebras of one relator groups with torsion.",
    "authors": [
      "James Alexander",
      "Tsunekazu Nishinaka"
    ],
    "publication_date": "2016-02-10T12:14:16Z",
    "arxiv_id": "http://arxiv.org/abs/1602.03341v3",
    "download_url": "https://arxiv.org/abs/1602.03341v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Braided Rota-Baxter algebras, quantum quasi-shuffle algebras and braided dendriform algebras",
    "abstract": "Rota-Baxter algebras and the closely related dendriform algebras have important physics applications, especially to renormalization of quantum field theory. Braided structures provide effective ways of quantization such as for quantum groups. Continuing recent study relating the two structures, this paper considers Rota-Baxter algebras and dendriform algebras in the braided contexts. Applying the quantum shuffle and quantum quasi-shuffle products, we construct free objects in the categories of braided Rota-Baxter algebras and braided dendriform algebras, under the commutativity condition. We further generalize the notion of dendriform Hopf algebras to the braided context and show that quantum shuffle algebra gives a braided dendriform Hopf algebra. Enveloping braided commutative Rota-Baxter algebras of braided commutative dendriform algebras are obtained.",
    "authors": [
      "Li Guo",
      "Yunnan Li"
    ],
    "publication_date": "2019-01-09T17:33:11Z",
    "arxiv_id": "http://arxiv.org/abs/1901.02843v1",
    "download_url": "https://arxiv.org/abs/1901.02843v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Soergel Bimodules, the Steenrod Algebra and Triply Graded Link homology",
    "abstract": "Soergel bimodules and their Hochschild homology are known to be important in the context of link homology. In this article we observe that Soergel bimodules may be naturally identified as the cohomology of well-defined objects in the category of spectra. This allows us to define forms of Soergel bimodules over the integers after inverting 2, indexed by elements in Braid groups associated to compact Lie groups of adjoint type. Reducing the Soergel bimodules modulo an odd prime, we endow the bimodules with an action of the reduced Steenrod algebra. This action extends to an action of the reduced Steenrod algebra on the Hochschild homology of Soergel bimodules over the primary field F_p for odd primes p. In the special case of the n-stranded Braid group, our results allow us to define the triply graded link homology over any ring where 2 is invertible, and deduce that the reduced Steenrod algebra acts on triply graded link homology over the field F_p for odd primes p.",
    "authors": [
      "Nitu Kitchloo"
    ],
    "publication_date": "2013-05-21T06:25:06Z",
    "arxiv_id": "http://arxiv.org/abs/1305.4725v6",
    "download_url": "https://arxiv.org/abs/1305.4725v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On replacement axioms for the Jacobi identity for vertex algebras and their modules",
    "abstract": "We discuss the axioms for vertex algebras and their modules, using formal calculus. Following certain standard treatments, we take the Jacobi identity as our main axiom and we recall weak commutativity and weak associativity. We derive a third, companion property that we call \"weak skew-associativity.\" This third property in some sense completes an $\\mathcal{S}_{3}$-symmetry of the axioms, which is related to the known $\\mathcal{S}_{3}$-symmetry of the Jacobi identity. We do not initially require a vacuum vector, which is analogous to not requiring an identity element in ring theory. In this more general setting, one still has a property, occasionally used in standard treatments, which is closely related to skew-symmetry, which we call \"vacuum-free skew-symmetry.\" We show how certain combinations of these properties are equivalent to the Jacobi identity for both vacuum-free vertex algebras and their modules. We then specialize to the case with a vacuum vector and obtain further replacement axioms. In particular, in the final section we derive our main result, which says that, in the presence of certain minor axioms, the Jacobi identity for a module is equivalent to either weak associativity or weak skew-associativity. The first part of this result has previously appeared and been used to show the (nontrivial) equivalence of representations of and modules for a vertex algebra. Many but not all of our results appear in standard treatments; some of our arguments are different from the usual ones.",
    "authors": [
      "Thomas J. Robinson"
    ],
    "publication_date": "2009-03-18T18:23:57Z",
    "arxiv_id": "http://arxiv.org/abs/0903.3216v3",
    "download_url": "https://arxiv.org/abs/0903.3216v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Construction of discrete series representations of $SO_{e}(4, 1)$ via algebraic Dirac induction",
    "abstract": "The notion of algebraic Dirac induction was introduced by P. Pandžić and D. Renard. This is a construction which gives representations with prescribed Dirac cohomology. They proved that all holomorphic discrete series representations can be constructed via Dirac induction. All discrete series representations of the group $SO_{e}(4,1)$ are nonholomorphic. In this paper we prove that they can also be constructed using algebraic Dirac induction.",
    "authors": [
      "Ana Prlić"
    ],
    "publication_date": "2018-11-05T11:03:55Z",
    "arxiv_id": "http://arxiv.org/abs/1811.01610v4",
    "download_url": "https://arxiv.org/abs/1811.01610v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Orbifold construction and Lorentzian construction of Leech lattice vertex operator algebra",
    "abstract": "We generalize Conway-Sloane's constructions of the Leech lattice from Niemeier lattices using Lorentzian lattice to holomorphic vertex operator algebras (VOA) of central charge 24. It provides a tool for analyzing the structures and relations among holomorphic VOAs related by orbifold construction. In particular, we are able to get some useful information about certain lattice subVOAs associated with the Cartan subalgebra of the weight one Lie algebra. We also obtain a relatively elementary proof that any strongly regular holomorphic VOA of central charge $24$ with a non-trivial weight one subspace can be constructed directly by a single orbifold construction from the Leech lattice VOA without using a dimension formula.",
    "authors": [
      "Naoki Chigira",
      "Ching Hung Lam",
      "Masahiko Miyamoto"
    ],
    "publication_date": "2021-04-07T12:44:55Z",
    "arxiv_id": "http://arxiv.org/abs/2104.03098v2",
    "download_url": "https://arxiv.org/abs/2104.03098v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Filtered Lie conformal algebras whose associated graded algebras are isomorphic to that of general conformal algebra $gc_1$",
    "abstract": "Let $G$ be a filtered Lie conformal algebra whose associated graded conformal algebra is isomorphic to that of general conformal algebra $gc_1$. In this paper, we prove that $G\\cong gc_1$ or ${\\rm gr\\,}gc_1$ (the associated graded conformal algebra of $gc_1$), by making use of some results on the second cohomology groups of the conformal algebra $\\fg$ with coefficients in its module $M_{b,0}$ of rank 1, where $\\fg=\\Vir\\ltimes M_{a,0}$ is the semi-direct sum of the Virasoro conformal algebra $\\Vir$ with its module $M_{a,0}$. Furthermore, we prove that ${\\rm gr\\,}gc_1$ does not have a nontrivial representation on a finite $\\C[\\partial]$-module, this provides an example of a finitely freely generated simple Lie conformal algebra of linear growth that cannot be embedded into the general conformal algebra $gc_N$ for any $N$.",
    "authors": [
      "Yucai Su",
      "Xiaoqing Yue"
    ],
    "publication_date": "2011-07-05T02:53:12Z",
    "arxiv_id": "http://arxiv.org/abs/1107.0770v1",
    "download_url": "https://arxiv.org/abs/1107.0770v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Semisimple Hopf algebras of dimension pq are trivial",
    "abstract": "Masuoka proved that for a prime p, semisimple Hopf algebras of dimension 2p over an algebraically closed field k of characteristic 0, are trivial (i.e. are either group algebras or the dual of group algebras). Westreich and the second author obtained the same result for dimension 3p, and then pushed the analysis further and among the rest obtained the same result for semisimple Hopf algebras H of dimension pq so that H and H^* are of Frobenius type (i.e. the dimensions of their irreducible representations divide the dimension of H). They concluded with the conjecture that any semisimple Hopf algebra H of dimension pq over k, is trivial. In this paper we use Theorem 1.4 in our previous paper q-alg/9712033 to prove that both H and H^* are of Frobenius type, and hence prove this conjecture.",
    "authors": [
      "Pavel Etingof",
      "Shlomo Gelaki"
    ],
    "publication_date": "1998-01-28T19:21:24Z",
    "arxiv_id": "http://arxiv.org/abs/math/9801129v2",
    "download_url": "https://arxiv.org/abs/math/9801129v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Hopf algebraic structures of quantum toroidal algebras",
    "abstract": "We define an algebra $\\mathcal{U}_0$ using a simplified set of generators for the quantum toroidal algebra $U_q(sl_{n+1}, tor)$ and show that there exists an epimorphism from $\\mathcal{U}_0$ to $U_q(sl_{n+1}, tor)$. We derive a closed formula of the comultiplication on the generators of $\\mathcal{U}_0$ that extends that of the quantum affine algebra $U_q(\\hat{sl}_{n+1})$. As a consequence, we show that $\\mathcal{U}_0$ is a Hopf algebra for $n=1, 2$ and give conjectural formulas in the general case. We further show that $\\mathcal{U}_0$ is isomorphic to a double algebra.",
    "authors": [
      "Naihuan Jing",
      "Honglian Zhang"
    ],
    "publication_date": "2016-04-19T03:17:30Z",
    "arxiv_id": "http://arxiv.org/abs/1604.05416v4",
    "download_url": "https://arxiv.org/abs/1604.05416v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representations of distributive semilattices in ideal lattices of various algebraic structures",
    "abstract": "We study the relationships among existing results about representations of distributive semilattices by ideals in dimension groups, von Neumann regular rings, C*-algebras, and complemented modular lattices. We prove additional representation results which exhibit further connections with the scattered literature on these different topics.",
    "authors": [
      "K. R. Goodearl",
      "F. Wehrung"
    ],
    "publication_date": "2000-11-13T21:14:41Z",
    "arxiv_id": "http://arxiv.org/abs/math/0011083v1",
    "download_url": "https://arxiv.org/abs/math/0011083v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On defining ideals and differential algebras of Nichols algebras",
    "abstract": "This paper is devoted to understanding the defining ideal of a Nichols algebra from the decomposition of specific elements in the group algebra of braid groups. A family of primitive elements are found and algorithms are proposed. To prove the main result, the differential algebra of a Nichols algebra is constructed. Moreover, another point of view on Serre relations is provided.",
    "authors": [
      "Xin Fang"
    ],
    "publication_date": "2011-04-05T23:17:57Z",
    "arxiv_id": "http://arxiv.org/abs/1104.0973v2",
    "download_url": "https://arxiv.org/abs/1104.0973v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A dichotomy between twisted tensor products of bialgebras and Frobenius algebras",
    "abstract": "We endow twisted tensor products with a natural notion of counit and comultiplication, and we provide sufficient and necessary conditions making the twisted tensor product a counital coassociative coalgebra. We then characterize when the twisted tensor product of bialgebras is a bialgebra, and when the twisted tensor product of Frobenius algebras is a Frobenius algebra. Our methods are purely diagrammatic, so these results hold for (braided) monoidal categories. As an application, we recover that some quantum complete intersections are Frobenius algebras, and we construct families of noncommutative symmetric Frobenius algebras. Along the way, we also characterize when twisted tensor products of separable algebras are separable, and we prove that twisted tensor products of special Frobenius algebras are special Frobenius.",
    "authors": [
      "Pablo S. Ocal",
      "Amrei Oswald"
    ],
    "publication_date": "2022-11-27T07:56:10Z",
    "arxiv_id": "http://arxiv.org/abs/2211.14754v4",
    "download_url": "https://arxiv.org/abs/2211.14754v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cayley-Hamilton theorem for quantum matrix algebras of GL(m|n) type",
    "abstract": "The classical Cayley-Hamilton identities are generalized to quantum matrix algebras of the GL(m|n) type.",
    "authors": [
      "D. I. Gurevich",
      "P. N. Pyatov",
      "P. A. Saponov"
    ],
    "publication_date": "2004-12-09T13:11:25Z",
    "arxiv_id": "http://arxiv.org/abs/math/0412192v2",
    "download_url": "https://arxiv.org/abs/math/0412192v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Partial corepresentations of Hopf Algebras",
    "abstract": "We introduce the notion of a partial corepresentation of a given Hopf algebra $H$ over a coalgebra $C$ and the closely related concept of a partial $H$-comodule. We prove that there exists a universal coalgebra $H^{par}$, associated to the original Hopf algebra $H$, such that the category of regular partial $H$-comodules is isomorphic to the category of $H^{par}$-comodules. We introduce the notion of a Hopf coalgebroid and show that the universal coalgebra $H^{par}$ has the structure of a Hopf coalgebroid over a suitable coalgebra.",
    "authors": [
      "Marcelo Muniz S . Alves",
      "Eliezer Batista",
      "Felipe Castro",
      "Glauber Quadros",
      "Joost Vercruysse"
    ],
    "publication_date": "2019-11-20T19:37:43Z",
    "arxiv_id": "http://arxiv.org/abs/1911.09141v2",
    "download_url": "https://arxiv.org/abs/1911.09141v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Batalin-Vilkovisky algebra structures on (Co)Tor and Poisson bialgebroids",
    "abstract": "In this article, we extend our preceding studies on higher algebraic structures of (co)homology theories defined by a left bialgebroid (U,A). For a braided commutative Yetter-Drinfel'd algebra N, explicit expressions for the canonical Gerstenhaber algebra structure on Ext_U(A,N) are given. Similarly, if (U,A) is a left Hopf algebroid where A is an anti Yetter-Drinfel'd module over U, it is shown that the cochain complex computing Cotor_U(A,N) defines a cyclic operad with multiplication and hence the groups Cotor_U(A,N) form a Batalin-Vilkovisky algebra. In the second part of this article, Poisson structures and the Poisson bicomplex for bialgebroids are introduced, which simultaneously generalise, for example, classical Poisson as well as cyclic homology. In case the bialgebroid U is commutative, a Poisson structure on U leads to a Batalin-Vilkovisky algebra structure on Tor_U(A,A). As an illustration, we show how this generalises the classical Koszul bracket on differential forms, and conclude by indicating how classical Lie-Rinehart bialgebras (or, geometrically, Lie bialgebroids) arise from left bialgebroids.",
    "authors": [
      "Niels Kowalzig"
    ],
    "publication_date": "2013-05-14T01:35:12Z",
    "arxiv_id": "http://arxiv.org/abs/1305.2992v3",
    "download_url": "https://arxiv.org/abs/1305.2992v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A remark on simplicity of vertex algebras and Lie conformal algebras",
    "abstract": "I give a short proof of the following algebraic statement: if a vertex algebra is simple, then its underlying Lie conformal algebra is either abelian, or it is an irreducible central extension of a simple Lie conformal algebra.",
    "authors": [
      "Alessandro D'Andrea"
    ],
    "publication_date": "2006-09-13T16:17:41Z",
    "arxiv_id": "http://arxiv.org/abs/math/0609359v2",
    "download_url": "https://arxiv.org/abs/math/0609359v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hilbert-Kunz function and Hilbert-Kunz multiplicity of some ideals of the Rees algebra",
    "abstract": "We prove that the Hilbert-Kunz function of the ideal $(I,It)$ of the Rees algebra $\\mathcal{R}(I)$, where $I$ is an $\\mathfrak{m}$-primary ideal of a $1$-dimensional local ring $(R,\\mathfrak{m})$, is a quasi-polynomial in $e$, for large $e.$ For $s \\in \\mathbb{N}$, we calculate the Hilbert-Samuel function of the $R$-module $I^{[s]}$ and obtain an explicit description of the generalized Hilbert-Kunz function of the ideal $(I,It)\\mathcal{R}(I)$ when $I$ is a parameter ideal in a Cohen-Macaulay local ring of dimension $d \\geq 2$, proving that the generalized Hilbert-Kunz function is a piecewise polynomial in this case.",
    "authors": [
      "Kriti Goel",
      "Mitra Koley",
      "J. K. Verma"
    ],
    "publication_date": "2019-11-10T10:31:11Z",
    "arxiv_id": "http://arxiv.org/abs/1911.03889v2",
    "download_url": "https://arxiv.org/abs/1911.03889v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The polynomiality of the Poisson center and semi-center of a Lie algebra and Dixmier's fourth problem",
    "abstract": "Let L be a finite dimensional Lie algebra over an algebraically closed field k of characteristic zero. We provide necessary and also some sufficient conditions in order for its Poisson center and semi-center to be polynomial algebras over k. This occurs for instance if L is quadratic of index 2 with L not equal to [L,L] and also if L is nilpotent of index at most 2. The converse holds for filiform Lie algebras of type Ln, Qn, Rn and Wn. We also show how Dixmier's fourth problem for an algebraic Lie algebra L can be reduced to that of its canonical truncation. Moreover, Dixmier's statement holds for all Lie algebras of dimension at most eight. The nonsolvable, indecomposable ones among them possess a polynomial Poisson center and semi-center.",
    "authors": [
      "Alfons I. Ooms"
    ],
    "publication_date": "2016-05-13T14:53:11Z",
    "arxiv_id": "http://arxiv.org/abs/1605.04200v3",
    "download_url": "https://arxiv.org/abs/1605.04200v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The lazy homology of a Hopf algebra",
    "abstract": "To any Hopf algebra H we associate two commutative Hopf algebras, which we call the first and second lazy homology Hopf algebras of H. These algebras are related to the lazy cohomology groups based on the so-called lazy cocycles of H by universal coefficient theorems. When H is a group algebra, then its lazy homology can be expressed in terms of the 1- and 2-homology of the group. When H is a cosemisimple Hopf algebra over an algebraically closed field of characteristic zero, then its first lazy homology is the Hopf algebra of the universal abelian grading group of the category of corepresentations of H. We also compute the lazy homology of the Sweedler algebra.",
    "authors": [
      "Julien Bichon",
      "Christian Kassel"
    ],
    "publication_date": "2008-07-10T13:50:51Z",
    "arxiv_id": "http://arxiv.org/abs/0807.1651v1",
    "download_url": "https://arxiv.org/abs/0807.1651v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Equations of the multi-Rees algebra of fattened coordinate subspaces",
    "abstract": "In this paper we describe the equations defining the multi-Rees algebra $k[x_1,\\dots,x_n][I_1^{a_1}t_1,\\dots,I_r^{a_r}t_r]$, where the ideals are generated by subsets of $x_1,\\dots,x_n$. We also show that a family of binomials whose leading terms are squrefree, form a Gröbner basis for the defining equations with lexicographic order. We show that if we remove binomials that include $x$'s, then remaining binomials form a Gröbner basis for the toric ideal associated to the multi-fiber ring. However binomials, including $x$'s, in Gröbner basis of defining equations of the multi-Rees algebra are not necessarily defining equations of corresponding symmetric algebra. Despite this fact, we show that this family of ideals is of multi-fiber type.",
    "authors": [
      "Babak Jabbar Nezhad"
    ],
    "publication_date": "2023-08-03T10:13:03Z",
    "arxiv_id": "http://arxiv.org/abs/2308.01668v1",
    "download_url": "https://arxiv.org/abs/2308.01668v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cofree Hopf algebras on Hopf bimodule algebras",
    "abstract": "We investigate a Hopf algebra structure on the cotensor coalgebra associated to a Hopf bimodule algebra which contains universal version of Clifford algebras and quantum groups as examples. It is shown to be the bosonization of the quantum quasi-shuffle algebra built on the space of its right coinvariants. The universal property and a Rota-Baxter algebra structure are established on this new algebra.",
    "authors": [
      "Xin Fang",
      "Run-Qiang Jian"
    ],
    "publication_date": "2013-07-05T08:27:38Z",
    "arxiv_id": "http://arxiv.org/abs/1307.1545v1",
    "download_url": "https://arxiv.org/abs/1307.1545v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Derivations of Quantum and Involution Generalized Weyl Algebras",
    "abstract": "We classify the derivations of degree-one generalized Weyl algebras over a univariate Laurent polynomial ring. In particular, our results cover the Weyl-Hayashi algebra, a quantization of the first Weyl algebra arising as a primitive factor algebra of $U_q^+(\\mathfrak{so}_5)$, and a family of algebras which localize to the group algebra of the infinite group with generators $x$ and $y$, subject to the relation $xy = y^{-1}x.$",
    "authors": [
      "Andrew P. Kitchin"
    ],
    "publication_date": "2021-07-29T17:24:28Z",
    "arxiv_id": "http://arxiv.org/abs/2107.14189v1",
    "download_url": "https://arxiv.org/abs/2107.14189v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computer Algebra and Algebraic Geometry - Achievements and Perspectives",
    "abstract": "In this survey I should like to introduce some concepts of algebraic geometry and try to demonstrate the fruitful interaction between algebraic geometry and computer algebra and, more generally, between mathematics and computer science. One of the aims of this article is to show, by means of examples, the usefulness of computer algebra to mathematical research.",
    "authors": [
      "Gert-Martin Greuel"
    ],
    "publication_date": "2000-02-29T14:29:48Z",
    "arxiv_id": "http://arxiv.org/abs/math/0002247v1",
    "download_url": "https://arxiv.org/abs/math/0002247v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Parabosonic and parafermionic algebras. Graded structure and Hopf structures",
    "abstract": "Parabosonic $P_{B}^{(n)}$ and parafermionic $P_{F}^{(n)}$ algebras are described as quotients of the tensor algebras of suitably choosen vector spaces. Their (super-) Lie algebraic structure and consequently their (super-) Hopf structure is shortly discussed. A bosonisation-like construction is presented, which produces an ordinary Hopf algebra $P_{B(K^{\\pm})}^{(n)}$ starting from the super Hopf algebra $P_{B}^{(n)}$.",
    "authors": [
      "K. Kanakoglou",
      "C. Daskaloyannis"
    ],
    "publication_date": "2007-01-09T14:26:17Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/0701077v1",
    "download_url": "https://arxiv.org/abs/hep-th/0701077v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An algebraic study of extension algebras",
    "abstract": "We present simple conditions which guarantee a geometric convolution algebra to behave like a variant of the quasi-hereditary algebra. In particular, standard modules of the affine Hecke algebras of type $\\mathsf{BC}$, and the quiver Schur algebras are shown to satisfy the Brauer-Humphreys type reciprocity and the semi-orthogonality property. In addition, we present a new criterion of purity of weights in the geometric side. This yields a proof of Shoji's conjecture on limit symbols of type $\\mathsf{B}$ [Shoji, Adv. Stud. Pure Math. 40 (2004)], and the purity of the exotic Springer fibers [K, Duke Math. 148 (2009)]. Using this, we describe the leading terms of the $C^{\\infty}$-realization of a solution of the Lieb-McGuire system in the appendix. In [K, arXiv:1203.5254], we apply the results of this paper to the KLR algebras of type $\\mathsf{ADE}$ to establish Kashwara's problem and Lusztig's conjecture.",
    "authors": [
      "Syu Kato"
    ],
    "publication_date": "2012-07-19T12:26:48Z",
    "arxiv_id": "http://arxiv.org/abs/1207.4640v5",
    "download_url": "https://arxiv.org/abs/1207.4640v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shuffle algebras for quivers as quantum groups",
    "abstract": "We define a quantum loop group $\\mathbf{U}^+_Q$ associated to an arbitrary quiver $Q=(I,E)$ and maximal set of deformation parameters, with generators indexed by $I \\times \\mathbb{Z}$ and some explicit quadratic and cubic relations. We prove that $\\mathbf{U}^+_Q$ is isomorphic to the (generic, small) shuffle algebra associated to the quiver $Q$ and hence, by [Neg21a], to the localized K-theoretic Hall algebra of $Q$. For the quiver with one vertex and $g$ loops, this yields a presentation of the spherical Hall algebra of a (generic) smooth projective curve of genus $g$ (invoking the results of [SV12]). We extend the above results to the case of non-generic parameters satisfying a certain natural metric condition. As an application, we obtain a description by generators and relations of the subalgebra generated by absolutely cuspidal eigenforms of the Hall algebra of an arbitrary smooth projective curve (invoking the results of [KSV17]).",
    "authors": [
      "Andrei Neguţ",
      "Francesco Sala",
      "Olivier Schiffmann"
    ],
    "publication_date": "2021-10-30T13:36:07Z",
    "arxiv_id": "http://arxiv.org/abs/2111.00249v4",
    "download_url": "https://arxiv.org/abs/2111.00249v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Yokonuma-Schur algebras",
    "abstract": "In this paper, we define the Yokonuma-Schur algebra $\\text{YS}_{q}(r,n)$ as the endomorphism algebra of a permutation module for the Yokonuma-Hecke algebra $\\text{Y}_{r,n}(q).$ We prove that $\\text{YS}_{q}(r,n)$ is cellular by constructing an explicit cellular basis following the approach in [DJM], and we further show that it is a quasi-hereditary cover of $\\text{Y}_{r,n}(q)$ in the sense of Rouquier following [HM2]. We also introduce the tilting modules for $\\text{YS}_{q}(r,n).$ In the appendix, we define and study the cyclotomic Yokonuma-Schur algebra in a similar way.",
    "authors": [
      "Weideng Cui"
    ],
    "publication_date": "2014-05-26T00:42:45Z",
    "arxiv_id": "http://arxiv.org/abs/1405.6441v7",
    "download_url": "https://arxiv.org/abs/1405.6441v7",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Survey of Racks and Quandles: Some recent developments",
    "abstract": "This short survey contains some recent developments of the algebraic theory of racks and quandles. We report on some elements of representation theory of quandles and ring theoretic approach to quandles.",
    "authors": [
      "Mohamed Elhamdadi"
    ],
    "publication_date": "2019-10-16T15:09:10Z",
    "arxiv_id": "http://arxiv.org/abs/1910.07400v1",
    "download_url": "https://arxiv.org/abs/1910.07400v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Isomorphism classes and automorphisms of finite Hopf algebras of type A_n",
    "abstract": "In our previous paper math/0502157 we classified a large class of finite-dimensional pointed Hopf algebras up to isomorphism. However the following problem was left open for Hopf algebras of of type $A,D$ or $E_6$, that is whose Cartan matrix is connected and allows a non-trivial automorphism of the corresponding Dynkin diagram. In this case we described the isomorphisms between two such Hopf algebras with the same Cartan matrix only implicitly. The problem is whether it is possible to compute the isomorphisms in terms of the defining families of parameters. In the present paper we solve this problem for type $A$.",
    "authors": [
      "Nicol/'as Andruskiewitsch",
      "Hans-Jürgen Schneider"
    ],
    "publication_date": "2005-11-10T20:51:08Z",
    "arxiv_id": "http://arxiv.org/abs/math/0511283v2",
    "download_url": "https://arxiv.org/abs/math/0511283v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic deformation quantization of Leibniz algebras",
    "abstract": "In this paper we focus on a certain self-distributive multiplication on coalgebras, which leads to so-called rack bialgebra. We construct canon-ical rack bialgebras (some kind of enveloping algebras) for any Leibniz algebra. Our motivation is deformation quantization of Leibniz algebras in the sense of [6]. Namely, the canonical rack bialgebras we have constructed for any Leibniz algebra lead to a simple explicit formula of the rack-star-product on the dual of a Leibniz algebra recently constructed by Dherin and Wagemann in [6]. We clarify this framework setting up a general deformation theory for rack bialgebras and show that the rack-star-product turns out to be a deformation of the trivial rack bialgebra product.",
    "authors": [
      "Charles Alexandre",
      "Martin Bordemann",
      "Salim Riviere",
      "Friedrich Wagemann"
    ],
    "publication_date": "2018-10-08T10:03:47Z",
    "arxiv_id": "http://arxiv.org/abs/1810.04050v2",
    "download_url": "https://arxiv.org/abs/1810.04050v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Actions of some pointed Hopf algebras on path algebras of quivers",
    "abstract": "We classify Hopf actions of Taft algebras T(n) on path algebras of quivers, in the setting where the quiver is loopless, finite, and Schurian. As a corollary, we see that every quiver admitting a faithful Z_n-action (by directed graph automorphisms) also admits inner faithful actions of a Taft algebra. Several examples for actions of the Sweedler algebra T(2) and for actions of T(3) are presented in detail. We then extend the results on Taft algebra actions on path algebras to actions of the Frobenius-Lusztig kernel u_q(sl_2), and to actions of the Drinfeld double of T(n).",
    "authors": [
      "Ryan Kinser",
      "Chelsea Walton"
    ],
    "publication_date": "2014-10-28T16:46:57Z",
    "arxiv_id": "http://arxiv.org/abs/1410.7696v3",
    "download_url": "https://arxiv.org/abs/1410.7696v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multiparameter Twisted Weyl Algebras",
    "abstract": "We introduce a new family of twisted generalized Weyl algebras, called multiparameter twisted Weyl algebras, for which we parametrize all simple quotients of a certain kind. Both Jordan's simple localization of the multiparameter quantized Weyl algebra and Hayashi's q-analog of the Weyl algebra are special cases of this construction. We classify all simple weight modules over any multiparameter twisted Weyl algebra. Extending results by Benkart and Ondrus, we also describe all Whittaker pairs up to isomorphism over a class of twisted generalized Weyl algebras which includes the multiparameter twisted Weyl algebras.",
    "authors": [
      "Vyacheslav Futorny",
      "Jonas T. Hartwig"
    ],
    "publication_date": "2011-03-28T22:03:11Z",
    "arxiv_id": "http://arxiv.org/abs/1103.5500v1",
    "download_url": "https://arxiv.org/abs/1103.5500v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tropical Algebraic Sets, Ideals and An Algebraic Nullstellensatz",
    "abstract": "This paper introduces the foundations of the polynomial algebra and basic structures for algebraic geometry over the extended tropical semiring. Our development, which includes the tropical version for the fundamental theorem of algebra, leads to the reduced polynomial semiring -- a structure that provides a basis for developing a tropical analogue to the classical theory of commutative algebra. The use of the new notion of tropical algebraic com-sets, built upon the complements of tropical algebraic sets, eventually yields the tropical algebraic Nullstellensatz.",
    "authors": [
      "Zur Izhakian"
    ],
    "publication_date": "2005-11-02T19:05:25Z",
    "arxiv_id": "http://arxiv.org/abs/math/0511059v3",
    "download_url": "https://arxiv.org/abs/math/0511059v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Solvable extensions of the naturally graded quasi-filiform Leibniz algebra of second type $\\mathcal{L}^2$",
    "abstract": "For a sequence of the naturally graded quasi-filiform Leibniz algebra of second type $\\mathcal{L}^2$ introduced by Camacho, Gómez, González and Omirov, all possible right and left solvable indecomposable extensions over the field $\\Bbb R$ are constructed so that the algebra serves as the nilradical of the corresponding solvable Leibniz algebras we find in the paper.",
    "authors": [
      "Anastasia Shabanskaya"
    ],
    "publication_date": "2018-03-01T20:31:23Z",
    "arxiv_id": "http://arxiv.org/abs/1803.00615v3",
    "download_url": "https://arxiv.org/abs/1803.00615v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Canonical Resolutions over Koszul Algebras",
    "abstract": "We generalize Buchsbaum and Eisenbud's resolutions for the powers of the maximal ideal of a polynomial ring to resolve powers of the homogeneous maximal ideal over graded Koszul algebras. Our approach has the advantage of producing resolutions that are both more explicit and minimal compared to those previously discovered by Green and Martínez-Villa \\cite{GreenMartinezVilla} or Martínez-Villa and Zacharia \\cite{MartinezVillaZacharia}.",
    "authors": [
      "Eleonore Faber",
      "Martina Juhnke-Kubitzke",
      "Haydee Lindo",
      "Claudia Miller",
      "Rebecca R. G.",
      "Alexandra Seceleanu"
    ],
    "publication_date": "2020-11-24T21:42:22Z",
    "arxiv_id": "http://arxiv.org/abs/2011.12409v2",
    "download_url": "https://arxiv.org/abs/2011.12409v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite Dimensional Pointed Hopf Algebras with Abelian Coradical and Cartan matrices",
    "abstract": "In a previous work \\cite{AS2} we showed how to attach to a pointed Hopf algebra A with coradical $\\kΓ$, a braided strictly graded Hopf algebra R in the category $_Γ^Γ\\Cal{YD}$ of Yetter-Drinfeld modules over $Γ$. In this paper, we consider a further invariant of A, namely the subalgebra R' of R generated by the space V of primitive elements. Algebras of this kind are known since the pioneering work of Nichols. It turns out that R' is completely determined by the braiding c:V\\otimes V \\to V \\otimes V. We denote R' = B(V). We assume further that $Γ$ is finite abelian. Then c is given by a matrix (b_{ij}) whose entries are roots of unity; we also suppose that they have odd order. We introduce for these braidings the notion of \"braiding of Cartan type\" and we attach a generalized Cartan matrix to a braiding of Cartan type. We prove that B(V) is finite dimensional if its corresponding matrix is of finite Cartan type and give sufficient conditions for the converse statement. As a consequence, we obtain many new families of pointed Hopf algebras. When $Γ$ is a direct sum of copies of a group of prime order, the conditions hold and any matrix is of Cartan type. As a sample, we classify all the finite dimensional pointed Hopf algebras which are coradically graded, generated in degree one and whose coradical has odd prime dimension p. We also characterize coradically graded pointed Hopf algebras of order p^4, which are generated in degree one.",
    "authors": [
      "N. Andruskiewitsch",
      "H-J. Schneider"
    ],
    "publication_date": "1998-06-12T21:23:28Z",
    "arxiv_id": "http://arxiv.org/abs/math/9806074v2",
    "download_url": "https://arxiv.org/abs/math/9806074v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structure of Algebras of Weyl Type",
    "abstract": "In a paper by the authors, the associative and the Lie algebras of Weyl type $A[D]=A\\otimes F[D]$ were introduced, where $A$ is a commutative associative algebra with an identity element over a field $F$ of any characteristic, and $F[D]$ is the polynomial algebra of a commutative derivation subalgebra $D$ of $A$. In the present paper, a class of the above associative and Lie algebras $A[D]$ with $F$ being a field of characteristic 0 and $D$ consisting of locally finite derivations of $A$, is studied. The isomorphism classes of these associative and Lie algebras are determined. The structure of these algebras is described explicitly.",
    "authors": [
      "Yucai Su",
      "Kaiming Zhao"
    ],
    "publication_date": "2004-02-26T03:15:39Z",
    "arxiv_id": "http://arxiv.org/abs/math/0402423v1",
    "download_url": "https://arxiv.org/abs/math/0402423v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]