[
  {
    "title": "Fractional Calculus: Some Basic Problems in Continuum and Statistical Mechanics",
    "abstract": "We review some applications of fractional calculus developed by the author (partly in collaboration with others) to treat some basic problems in continuum and statistical mechanics. The problems in continuum mechanics concern mathematical modelling of viscoelastic bodies (Sect. 1), and unsteady motion of a particle in a viscous fluid, i.e. the Basset problem (Sect. 2). In the former analysis fractional calculus leads us to introduce intermediate models of viscoelasticity which generalize the classical spring-dashpot models. The latter analysis induces us to introduce a hydrodynamic model suitable to revisit in Sect. 3 the classical theory of the Brownian motion, which is a relevant topic in statistical mechanics. By the tools of fractional calculus we explain the long tails in the velocity correlation and in the displacement variance. In Sect. 4 we consider the fractional diffusion-wave equation, which is obtained from the classical diffusion equation by replacing the first-order time derivative by a fractional derivative of order $0< β<2$. Led by our analysis we express the fundamental solutions (the Green functions) in terms of two interrelated auxiliary functions in the similarity variable, which turn out to be of Wright type (see Appendix), and to distinguish slow-diffusion processes ($0 < β< 1$) from intermediate processes ($1 < β< 2$).",
    "authors": [
      "Francesco Mainardi"
    ],
    "publication_date": "2012-01-04T10:06:47Z",
    "arxiv_id": "http://arxiv.org/abs/1201.0863v1",
    "download_url": "https://arxiv.org/abs/1201.0863v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A symbol calculus for foliations",
    "abstract": "The classical Getzler rescaling theorem is extended to the transverse geometry of foliations. More precisely, a Getzler rescaling calculus, as well as a Block-Fox calculus of asymptotic operators, is constructed for all transversely spin foliations. This calculus applies to operators of degree $m$ globally times degree $\\ell$ in the leaf directions, and is thus an appropriate tool for a better understanding of the index theory of transversely elliptic operators on foliations. The main result is that the composition of A$Ψ$DOs is again an A$Ψ$DO, and includes a formula for the leading symbol.",
    "authors": [
      "Moulay Tahar Benameur",
      "L. James Heitsch"
    ],
    "publication_date": "2015-11-18T08:50:18Z",
    "arxiv_id": "http://arxiv.org/abs/1511.05697v2",
    "download_url": "https://arxiv.org/abs/1511.05697v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Experimentation in the Schubert Calculus",
    "abstract": "Many aspects of Schubert calculus are easily modeled on a computer. This enables large-scale experimentation to investigate subtle and ill-understood phenomena in the Schubert calculus. A well-known web of conjectures and results in the real Schubert calculus has been inspired by this continuing experimentation. A similarly rich story concerning intrinsic structure, or Galois groups, of Schubert problems is also beginning to emerge from experimentation. This showcases new possibilities for the use of computers in mathematical research.",
    "authors": [
      "Abraham Martin del Campo",
      "Frank Sottile"
    ],
    "publication_date": "2013-08-15T01:50:50Z",
    "arxiv_id": "http://arxiv.org/abs/1308.3284v1",
    "download_url": "https://arxiv.org/abs/1308.3284v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Numerical Approximations to Fractional Problems of the Calculus of Variations and Optimal Control",
    "abstract": "This chapter presents some numerical methods to solve problems in the fractional calculus of variations and fractional optimal control. Although there are plenty of methods available in the literature, we concentrate mainly on approximating the fractional problem either by discretizing the fractional term or expanding the fractional derivatives as a series involving integer order derivatives. The former method, as a subclass of direct methods in the theory of calculus of variations, uses finite differences, Grunwald-Letnikov definition in this case, to discretize the fractional term. Any quadrature rule for integration, regarding the desired accuracy, is then used to discretize the whole problem including constraints. The final task in this method is to solve a static optimization problem to reach approximated values of the unknown functions on some mesh points.\n  The latter method, however, approximates fractional problems by classical ones in which only derivatives of integer order are present. Precisely, two continuous approximations for fractional derivatives by series involving ordinary derivatives are introduced. Local upper bounds for truncation errors are provided and, through some test functions, the accuracy of the approximations are justified. Then we substitute the fractional term in the original problem with these series and transform the fractional problem to an ordinary one. Hereafter, we use indirect methods of classical theory, e.g. Euler-Lagrange equations, to solve the approximated problem. The methods are mainly developed through some concrete examples which either have obvious solutions or the solution is computed using the fractional Euler-Lagrange equation.",
    "authors": [
      "Shakoor Pooseh",
      "Ricardo Almeida",
      "Delfim F. M. Torres"
    ],
    "publication_date": "2013-10-20T21:55:29Z",
    "arxiv_id": "http://arxiv.org/abs/1310.5377v2",
    "download_url": "https://arxiv.org/abs/1310.5377v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The scaling-law flows: An attempt at scaling-law vector calculus",
    "abstract": "In this paper, the scaling-law vector calculus, which is related to the connection between the vector calculus and the scaling law in fractal geometry, is addressed based on the Leibniz derivative and Stieltjes integral for the first time. The Gauss-Ostrogradsky-like theorem, Stokes-like theorem, Green-like theorem, and Green-like identities are considered in the sense of the scaling-law vector calculus. The Navier-Stokes-like equations are obtained in detail. The obtained result is as a potentially mathematical tool proposed to develop an important way of approaching this challenge for the scaling-law flows.",
    "authors": [
      "Xiao-Jun Yang"
    ],
    "publication_date": "2020-10-20T03:03:40Z",
    "arxiv_id": "http://arxiv.org/abs/2010.13897v1",
    "download_url": "https://arxiv.org/abs/2010.13897v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$λ$-Scale, a lambda calculus for spaces with dilations",
    "abstract": "$λ$-Scale is an enrichment of lambda calculus which is adapted to emergent algebras. It can be used therefore in metric spaces with dilations.",
    "authors": [
      "Marius Buliga"
    ],
    "publication_date": "2012-05-01T11:30:27Z",
    "arxiv_id": "http://arxiv.org/abs/1205.0139v3",
    "download_url": "https://arxiv.org/abs/1205.0139v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fractional Calculus of Variations: a novel way to look at it",
    "abstract": "In this work we look at the original fractional calculus of variations problem in a somewhat different way. As a simple consequence, we show that a fractional generalization of a classical problem has a solution without any restrictions on the derivative-order $α$.",
    "authors": [
      "Rui A. C. Ferreira"
    ],
    "publication_date": "2018-09-06T23:36:07Z",
    "arxiv_id": "http://arxiv.org/abs/1809.02250v2",
    "download_url": "https://arxiv.org/abs/1809.02250v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Algebra of Schubert Calculus",
    "abstract": "A flexible unified framework for both classical and quantum Schubert calculus is proposed. It is based on a natural combinatorial approach relying on the Hasse-Schmidt extension of a certain family of pairwise commuting endomorphisms of an infinite free Z-module M to its exterior algebra.",
    "authors": [
      "Letterio Gatto"
    ],
    "publication_date": "2004-05-09T18:12:31Z",
    "arxiv_id": "http://arxiv.org/abs/math/0405155v1",
    "download_url": "https://arxiv.org/abs/math/0405155v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complete Context Calculus Design and Implementation in GIPSY",
    "abstract": "This paper presents the integration into the GIPSY of Lucx's context calculus defined in Wan's PhD thesis. We start by defining different types of tag sets, then we explain the concept of context, the types of context and the context calculus operators. Finally, we present how context entities have been abstracted into Java classes and embedded into the GIPSY system.",
    "authors": [
      "Xin Tong",
      "Joey Paquet",
      "Serguei A. Mokhov"
    ],
    "publication_date": "2010-02-23T19:29:43Z",
    "arxiv_id": "http://arxiv.org/abs/1002.4392v1",
    "download_url": "https://arxiv.org/abs/1002.4392v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Matrix Calculus You Need For Deep Learning",
    "abstract": "This paper is an attempt to explain all the matrix calculus you need in order to understand the training of deep neural networks. We assume no math knowledge beyond what you learned in calculus 1, and provide links to help you refresh the necessary math where needed. Note that you do not need to understand this material before you start learning to train and use deep learning in practice; rather, this material is for those who are already familiar with the basics of neural networks, and wish to deepen their understanding of the underlying math. Don't worry if you get stuck at some point along the way---just go back and reread the previous section, and try writing down and working through some examples. And if you're still stuck, we're happy to answer your questions in the Theory category at forums.fast.ai. Note: There is a reference section at the end of the paper summarizing all the key matrix calculus rules and terminology discussed here. See related articles at http://explained.ai",
    "authors": [
      "Terence Parr",
      "Jeremy Howard"
    ],
    "publication_date": "2018-02-05T17:37:59Z",
    "arxiv_id": "http://arxiv.org/abs/1802.01528v3",
    "download_url": "https://arxiv.org/abs/1802.01528v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graphic lambda calculus",
    "abstract": "We introduce and study graphic lambda calculus, a visual language which can be used for representing untyped lambda calculus, but it can also be used for computations in emergent algebras or for representing Reidemeister moves of locally planar tangle diagrams.",
    "authors": [
      "Marius Buliga"
    ],
    "publication_date": "2013-05-24T16:38:25Z",
    "arxiv_id": "http://arxiv.org/abs/1305.5786v2",
    "download_url": "https://arxiv.org/abs/1305.5786v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Derivatives and integrals: matrix order operators as an extension of the fractional calculus",
    "abstract": "A natural consequence of the fractional calculus is its extension to a matrix order of differentiation and integration. A matrix-order derivative definition and a matrix-order integration arise from the generalization of the gamma function applied to the fractional differintegration definition. This work focuses on some results applied to the Riemann-Liouville version of the fractional calculus extended to its matrix-order concept. This extension also may apply to other versions of fractional calculus. Some examples of possible ordinary and partial matrix-order differential equations and related exact solutions are shown.",
    "authors": [
      "C. B. da Porciuncula"
    ],
    "publication_date": "2020-04-30T20:36:36Z",
    "arxiv_id": "http://arxiv.org/abs/2005.00091v1",
    "download_url": "https://arxiv.org/abs/2005.00091v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Calculus, constrained minimization and Lagrange multipliers: Is the optimal critical point a local minimizer?",
    "abstract": "In this short note, we discuss how the optimality conditions for the problem of minimizing a multivariate function subject to equality constraints have been dealt with in undergraduate Calculus. We are particularly interested in the 2 or 3-dimensional cases, which are the most common cases in Calculus courses. Besides giving sufficient conditions to a critical point to be a local minimizer, we also present and discuss counterexamples to some statements encountered in the undergraduate literature on Lagrange Multipliers, such as `among the critical points, the ones which have the smallest image (under the function) are minimizers' or `a single critical point (which is a local minimizer) is a global minimizer'.",
    "authors": [
      "Ademir Alves Ribeiro",
      "Jose Renato Ramos Barbosa"
    ],
    "publication_date": "2019-04-10T14:47:37Z",
    "arxiv_id": "http://arxiv.org/abs/1904.05222v1",
    "download_url": "https://arxiv.org/abs/1904.05222v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On a Non-Newtonian Calculus of Variations",
    "abstract": "The calculus of variations is a field of mathematical analysis born in 1687 with Newton's problem of minimal resistance, which is concerned with the maxima or minima of integral functionals. Finding the solution of such problems leads to solving the associated Euler-Lagrange equations. The subject has found many applications over the centuries, e.g., in physics, economics, engineering and biology. Up to this moment, however, the theory of the calculus of variations has been confined to Newton's approach to calculus. As in many applications negative values of admissible functions are not physically plausible, we propose here to develop an alternative calculus of variations based on the non-Newtonian approach first introduced by Grossman and Katz in the period between 1967 and 1970, which provides a calculus defined, from the very beginning, for positive real numbers only, and it is based on a (non-Newtonian) derivative that permits one to compare relative changes between a dependent positive variable and an independent variable that is also positive. In this way, the non-Newtonian calculus of variations we introduce here provides a natural framework for problems involving functions with positive images. Our main result is a first-order optimality condition of Euler-Lagrange type. The new calculus of variations complements the standard one in a nontrivial/multiplicative way, guaranteeing that the solution remains in the physically admissible positive range. An illustrative example is given.",
    "authors": [
      "Delfim F. M. Torres"
    ],
    "publication_date": "2021-07-29T16:22:03Z",
    "arxiv_id": "http://arxiv.org/abs/2107.14152v1",
    "download_url": "https://arxiv.org/abs/2107.14152v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Matrix Calculus (for Machine Learning and Beyond)",
    "abstract": "This course, intended for undergraduates familiar with elementary calculus and linear algebra, introduces the extension of differential calculus to functions on more general vector spaces, such as functions that take as input a matrix and return a matrix inverse or factorization, derivatives of ODE solutions, and even stochastic derivatives of random functions. It emphasizes practical computational applications, such as large-scale optimization and machine learning, where derivatives must be re-imagined in order to be propagated through complicated calculations. The class also discusses efficiency concerns leading to \"adjoint\" or \"reverse-mode\" differentiation (a.k.a. \"backpropagation\"), and gives a gentle introduction to modern automatic differentiation (AD) techniques.",
    "authors": [
      "Paige Bright",
      "Alan Edelman",
      "Steven G. Johnson"
    ],
    "publication_date": "2025-01-07T18:38:35Z",
    "arxiv_id": "http://arxiv.org/abs/2501.14787v1",
    "download_url": "https://arxiv.org/abs/2501.14787v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From homotopy to Ito calculus and Hodge theory",
    "abstract": "We begin with a deformation of a differential graded algebra by adding time and using a homotopy. It is shown that the standard formulae of Itô calculus are an example, with four caveats: First, it says nothing about probability. Second, it assumes smooth functions. Third, it deforms all orders of forms, not just first order. Fourth, it also deforms the product of the DGA. An isomorphism between the deformed and original DGAs may be interpreted as the transformation rule between the Stratonovich and classical calculus (again no probability). The isomorphism can be used to construct covariant derivatives with the deformed calculus. We apply the deformation in noncommutative geometry, to the Podleś sphere $S^2_q$. This involves the Hodge theory of $S^2_q$.",
    "authors": [
      "Ghaliah Alhamzi",
      "Edwin Beggs",
      "Andrew Neate"
    ],
    "publication_date": "2013-07-11T14:11:10Z",
    "arxiv_id": "http://arxiv.org/abs/1307.3119v1",
    "download_url": "https://arxiv.org/abs/1307.3119v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weakly admissible $H^{\\infty}(\\C_{-})$-calculus on general Banach spaces",
    "abstract": "We show that, given a Banach space and a generator of an exponentially stable $C_{0}$-semigroup, a weakly admissible operator $g(A)$ can be defined for any $g$ bounded, analytic function on the left half-plane. This yields an (unbounded) functional calculus. The construction uses a Toeplitz operator and is motivated by system theory. In separable Hilbert spaces, we even get admissibility. Furthermore, it is investigated when a bounded calculus can be guaranteed. For this we introduce the new notion of exact observability by direction. Finally, it is shown that the calculus coincides with one for half-plane-operators.",
    "authors": [
      "Felix Schwenninger",
      "Hans Zwart"
    ],
    "publication_date": "2012-07-26T10:28:25Z",
    "arxiv_id": "http://arxiv.org/abs/1207.6229v1",
    "download_url": "https://arxiv.org/abs/1207.6229v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Loomis-Sikorski theorem and functional calculus for a generalized Hermitian algebra",
    "abstract": "A generalized Hermitian (GH-) algebra is a generalization of the partially ordered Jordan algebra of all Hermitian operators on a Hilbert space. We introduce the notion of a gh-tribe, which is a commutative GH-algebra of functions on a nonempty set $X$ with pointwise partial order and operations, and we prove that every commutative GH-algebra is the image of a gh-tribe under a surjective GH-morphism. Using this result, we prove each element $a$ of a GH-algebra $A$ corresponds to a real observable $ξ_a$ on the $σ$-orthomodular lattice of projections in $A$ and that $ξ_a$ determines the spectral resolution of $a$. Also, if $f$ is a continuous function defined on the spectrum of $a$, we formulate a definition of $f(a)$, thus obtaining a continuous functional calculus for $A$.",
    "authors": [
      "David J. Foulis",
      "Anna Jencova",
      "Sylvia Pulmannova"
    ],
    "publication_date": "2016-10-18T11:49:41Z",
    "arxiv_id": "http://arxiv.org/abs/1610.06208v2",
    "download_url": "https://arxiv.org/abs/1610.06208v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pseudodifferential operator calculus for generalized Q-rank 1 locally symmetric spaces, I",
    "abstract": "This paper is the first of two papers constructing a calculus of pseudodifferential operators suitable for doing analysis on Q-rank 1 locally symmetric spaces and Riemannian manifolds generalizing these. This generalization is the interior of a manifold with boundary, where the boundary has the structure of a tower of fibre bundles. The class of operators we consider on such a space includes those arising naturally from metrics which degenerate to various orders at the boundary, in directions given by the tower of fibrations. As well as Q-rank 1 locally symmetric spaces, examples include Ricci-flat metrics on the complement of a divisor in a smooth variety constructed by Tian and Yau. In this first part of the calculus construction, parametrices are found for \"fully elliptic differential \\bfa-operators\", which are uniformly elliptic operators on these manifolds that satisfy an additional invertibility condition at infinity. In the second part we will consider operators that do not satisfy this condition.",
    "authors": [
      "Daniel Grieser",
      "Eugenie Hunsicker"
    ],
    "publication_date": "2008-09-04T22:17:36Z",
    "arxiv_id": "http://arxiv.org/abs/0809.0925v2",
    "download_url": "https://arxiv.org/abs/0809.0925v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Steps towards a theory and calculus of aliasing",
    "abstract": "A theory, graphical notation, mathematical calculus and implementation for finding whether two given expressions can, at execution time, denote references attached to the same object. Intended as the basis for a comprehensive solution to the \"frame problem\" and as a complement to, or even a replacement for, separation logic, shape analysis, ownership types and dynamic frames.",
    "authors": [
      "Bertrand Meyer"
    ],
    "publication_date": "2010-01-11T09:24:02Z",
    "arxiv_id": "http://arxiv.org/abs/1001.1610v9",
    "download_url": "https://arxiv.org/abs/1001.1610v9",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shape Calculus: Timed Operational Semantics and Well-formedness",
    "abstract": "The Shape Calculus is a bio-inspired calculus for describing 3D shapes moving in a space. A shape forms a 3D process when combined with a behaviour. Behaviours are specified with a timed CCS-like process algebra using a notion of channel that models naturally binding sites on the surface of shapes. Processes can represent molecules or other mobile objects and can be part of networks of processes that move simultaneously and interact in a given geometrical space. The calculus embeds collision detection and response, binding of compatible 3D processes and splitting of previously established bonds. In this work the full formal timed operational semantics of the calculus is provided, together with examples that illustrate the use of the calculus in a well-known biological scenario. Moreover, a result of well-formedness about the evolution of a given network of well-formed 3D processes is proved.",
    "authors": [
      "Ezio Bartocci",
      "Diletta Romana Cacciagrano",
      "Maria Rita Di Berardini",
      "Emanuela Merelli",
      "Luca Tesei"
    ],
    "publication_date": "2010-11-09T11:33:59Z",
    "arxiv_id": "http://arxiv.org/abs/1011.2488v1",
    "download_url": "https://arxiv.org/abs/1011.2488v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Area expectation values in quantum area Regge calculus",
    "abstract": "The Regge calculus generalised to independent area tensor variables is considered. The continuous time limit is found and formal Feynman path integral measure corresponding to the canonical quantisation is written out. The quantum measure in the completely discrete theory is found which possesses the property to lead to the Feynman path integral in the continuous time limit whatever coordinate is chosen as time. This measure can be well defined by passing to the integration over imaginary field variables (area tensors). Averaging with the help of this measure gives finite expectation values for areas.",
    "authors": [
      "V. M. Khatsymovsky"
    ],
    "publication_date": "2002-12-26T18:25:27Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0212110v3",
    "download_url": "https://arxiv.org/abs/gr-qc/0212110v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Formal Calculus for International Relations Computation and Evaluation",
    "abstract": "This publication presents a relation computation or calculus for international relations using a mathematical modeling. It examined trust for international relations and its calculus, which related to Bayesian inference, Dempster-Shafer theory and subjective logic. Based on an observation in the literature, we found no literature discussing the calculus method for the international relations. To bridge this research gap, we propose a relation algebra method for international relations computation. The proposed method will allow a relation computation which is previously subjective and incomputable. We also present three international relations as case studies to demonstrate the proposed method is a real-world scenario. The method will deliver the relation computation for the international relations that to support decision makers in a government such as foreign ministry, defense ministry, presidential or prime minister office. The Department of Defense (DoD) may use our method to determine a nation that can be identified as a friendly, neutral or hostile nation.",
    "authors": [
      "Mohd Anuar Mat Isa",
      "Ramlan Mahmod",
      "Nur Izura Udzir",
      "Jamalul-lail Ab Manan",
      "Audun Jøsang",
      "Ali Dehghan Tanha"
    ],
    "publication_date": "2016-04-02T10:13:26Z",
    "arxiv_id": "http://arxiv.org/abs/1606.02239v1",
    "download_url": "https://arxiv.org/abs/1606.02239v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Para-differential Calculus on Compact Lie Groups and Spherical Capillary Water Waves",
    "abstract": "This paper provides a para-differential calculus toolbox on compact Lie groups and homogeneous spaces. It helps to understand non-local, nonlinear partial differential operators with low regularity on manifolds with high symmetry. In particular, the paper provides a para-linearization formula for the Dirichlet-Neumann operator of a distorted 2-sphere, a key ingredient in understanding long-time behaviour of spherical capillary water waves. As an initial application, the paper provides a new proof of local well-posedness for spherical capillary water waves equation under weaker regularity assumptions compared to previous results.",
    "authors": [
      "Chengyang Shao"
    ],
    "publication_date": "2023-04-20T17:50:44Z",
    "arxiv_id": "http://arxiv.org/abs/2304.10519v3",
    "download_url": "https://arxiv.org/abs/2304.10519v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fractional Calculus in Optimal Control and Game Theory: Theory, Numerics, and Applications -- A Survey",
    "abstract": "Many physical, biological, and engineered systems exhibit memory effects that challenge Markovian models. Fractional calculus provides nonlocal operators to capture hereditary dynamics. This survey connects modeling, analysis, and controller/game design for systems with memory. We unify notation for Caputo, Riemann-Liouville, and Grunwald-Letnikov derivatives and relate them to practical approximations, including diffusive (sum-of-exponentials) state augmentation and frequency-domain realizations (e.g., Oustaloup). We review fractional extensions of the calculus of variations and the Pontryagin maximum principle, and dynamic-programming formulations with memory, including path-dependent HJB for optimal control and HJI for zero-sum games. We cover design tools such as LQR, MPC, and fractional-order PID, as well as fractional differential games with Nash, Stackelberg, and minimax equilibria. Computational approaches are compared across time-domain schemes, frequency-domain approximations, and diffusive augmentations, highlighting accuracy-complexity trade-offs and remedies for the curse of history (windowing and sum-of-exponentials). We conclude with applications and open problems on equilibria with memory, Isaacs-type conditions, constraint handling, and scalable solvers.",
    "authors": [
      "Navid Mojahed",
      "Hooman Fatoorehchi",
      "Shima Nazari"
    ],
    "publication_date": "2025-12-13T01:01:52Z",
    "arxiv_id": "http://arxiv.org/abs/2512.12111v1",
    "download_url": "https://arxiv.org/abs/2512.12111v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spectral-Operator Calculus I: Trace-Form Evaluators and Spectral Growth in the Self-Adjoint Setting",
    "abstract": "We develop Spectral-Operator Calculus (SOC), an axiomatic calculus for scalar evaluation of operator-generated spectral observables. This paper (SOC-I) treats the self-adjoint setting, where observables are bounded Borel transforms and locality is enforced via additivity across spectral partitions. Under unitary invariance, extensivity on orthogonal sums, projector-locality, and a dominated-convergence continuity condition, we prove a rigidity theorem on a natural trace-class envelope: every admissible evaluator agrees with a weighted trace of a single Borel nondecreasing profile applied through the functional calculus. We then introduce a spectral growth taxonomy based on eigenvalue counting asymptotics and show that the polynomial growth regime is stable under the basic constructions of the calculus. These results supply an arithmetic-neutral analytic backbone for subsequent SOC parts and for applications to concrete spectral models. A companion part treats the sectorial/holomorphic setting, where locality is formulated on log-scale via scale-band decompositions and positive kernels rather than spectral projections.",
    "authors": [
      "John Homer"
    ],
    "publication_date": "2025-12-12T16:04:47Z",
    "arxiv_id": "http://arxiv.org/abs/2512.13721v2",
    "download_url": "https://arxiv.org/abs/2512.13721v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Matrix-Variate Statistical Distributions and Fractional Calculus",
    "abstract": "A connection between fractional calculus and statistical distribution theory has been established by the authors recently. Some extensions of the results to matrix-variate functions were also considered. In the present article, more results on matrix-variate statistical densities and their connections to fractional calculus will be established. When considering solutions of fractional differential equations, Mittag-Leffler functions and Fox H-function appear naturally. Some results connected with generalized Mittag-Leffler density and their asymptotic behavior will be considered. Reference is made to applications in physics, particularly superstatistics and nonextensive statistical mechanics.",
    "authors": [
      "A. M. Mathai",
      "H. J. Haubold"
    ],
    "publication_date": "2010-11-25T17:27:22Z",
    "arxiv_id": "http://arxiv.org/abs/1011.5654v1",
    "download_url": "https://arxiv.org/abs/1011.5654v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Linear lambda Calculus with Explicit Substitutions as Proof-Search in Deep Inference",
    "abstract": "SBV is a deep inference system that extends the set of logical operators of multiplicative linear logic with the non commutative operator Seq. We introduce the logical system SBVr which extends SBV by adding a self-dual atom-renaming operator to it. We prove that the cut elimination holds on SBVr. SBVr and its cut free subsystem BVr are complete and sound with respect to linear lambda calculus with explicit substitutions. Under any strategy, a sequence of evaluation steps of any linear lambda-term M becomes a process of proof-search in SBVr (BVr) once M is mapped into a formula of SBVr. Completeness and soundness follow from simulating linear beta-reduction with explicit substitutions as processes. The role of the new renaming operator of SBVr is to rename channel-names on-demand. This simulates the substitution that occurs in a beta-reduction. Despite SBVr is a minimal extension of SBV its proof-search can compute all boolean functions, as linear lambda-calculus with explicit substitutions can compute all boolean functions as well. So, proof search of SBVr and BVr is at least ptime-complete.",
    "authors": [
      "Luca Roversi"
    ],
    "publication_date": "2010-11-16T12:13:16Z",
    "arxiv_id": "http://arxiv.org/abs/1011.3668v4",
    "download_url": "https://arxiv.org/abs/1011.3668v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards a Neural Lambda Calculus: Neurosymbolic AI Applied to the Foundations of Functional Programming",
    "abstract": "Over the last decades, deep neural networks based-models became the dominant paradigm in machine learning. Further, the use of artificial neural networks in symbolic learning has been seen as increasingly relevant recently. To study the capabilities of neural networks in the symbolic AI domain, researchers have explored the ability of deep neural networks to learn mathematical constructions, such as addition and multiplication, logic inference, such as theorem provers, and even the execution of computer programs. The latter is known to be too complex a task for neural networks. Therefore, the results were not always successful, and often required the introduction of biased elements in the learning process, in addition to restricting the scope of possible programs to be executed. In this work, we will analyze the ability of neural networks to learn how to execute programs as a whole. To do so, we propose a different approach. Instead of using an imperative programming language, with complex structures, we use the Lambda Calculus (λ-Calculus), a simple, but Turing-Complete mathematical formalism, which serves as the basis for modern functional programming languages and is at the heart of computability theory. We will introduce the use of integrated neural learning and lambda calculi formalization. Finally, we explore execution of a program in λ-Calculus is based on reductions, we will show that it is enough to learn how to perform these reductions so that we can execute any program. Keywords: Machine Learning, Lambda Calculus, Neurosymbolic AI, Neural Networks, Transformer Model, Sequence-to-Sequence Models, Computational Models",
    "authors": [
      "João Flach",
      "Alvaro F. Moreira",
      "Luis C. Lamb"
    ],
    "publication_date": "2023-04-18T20:30:16Z",
    "arxiv_id": "http://arxiv.org/abs/2304.09276v2",
    "download_url": "https://arxiv.org/abs/2304.09276v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lineal: A linear-algebraic Lambda-calculus",
    "abstract": "We provide a computational definition of the notions of vector space and bilinear functions. We use this result to introduce a minimal language combining higher-order computation and linear algebra. This language extends the Lambda-calculus with the possibility to make arbitrary linear combinations of terms alpha.t + beta.u. We describe how to \"execute\" this language in terms of a few rewrite rules, and justify them through the two fundamental requirements that the language be a language of linear operators, and that it be higher-order. We mention the perspectives of this work in the field of quantum computation, whose circuits we show can be easily encoded in the calculus. Finally, we prove the confluence of the entire calculus.",
    "authors": [
      "Pablo Arrighi",
      "Gilles Dowek"
    ],
    "publication_date": "2006-12-22T17:25:56Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0612199v6",
    "download_url": "https://arxiv.org/abs/quant-ph/0612199v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A survey on fractional variational calculus",
    "abstract": "Main results and techniques of the fractional calculus of variations are surveyed. We consider variational problems containing Caputo derivatives and study them using both indirect and direct methods. In particular, we provide necessary optimality conditions of Euler-Lagrange type for the fundamental, higher-order, and isoperimetric problems, and compute approximated solutions based on truncated Grünwald--Letnikov approximations of Caputo derivatives.",
    "authors": [
      "Ricardo Almeida",
      "Delfim F. M. Torres"
    ],
    "publication_date": "2018-06-13T14:44:06Z",
    "arxiv_id": "http://arxiv.org/abs/1806.05092v1",
    "download_url": "https://arxiv.org/abs/1806.05092v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "H{ö}rmander Functional Calculus for Poisson Estimates",
    "abstract": "The aim of the article is to show a H{ö}rmander spectral multiplier theorem for an operator $A$ whose kernel of the semigroup $\\exp(-zA)$ satisfies certain Poisson estimates for complex times $z.$ Here $\\exp(-zA)$ acts on $L^p(Ω),\\,1 < p < \\infty,$ where $Ω$ is a space of homogeneous type with the additional condition that the measure of annuli is controlled. In most of the known H{ö}rmander type theorems in the literature, Gaussian bounds and self-adjointness for the semigroup are needed, whereas here the new feature is that the assumptions are the to some extend weaker Poisson bounds, and $\\HI$ calculus in place of self-adjointness. The order of derivation in our H{ö}rmander multiplier result is typically $\\frac{d}{2},$ $d$ being the dimension of the space $Ω.$ Moreover the functional calculus resulting from our H{ö}rmander theorem is shown to be $R$-bounded. Finally, the result is applied to some examples.",
    "authors": [
      "Christoph Kriegler"
    ],
    "publication_date": "2013-02-25T14:35:34Z",
    "arxiv_id": "http://arxiv.org/abs/1302.6104v3",
    "download_url": "https://arxiv.org/abs/1302.6104v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Minuscule Schubert calculus and the geometric Satake correspondence",
    "abstract": "We describe a relationship between work of Laksov, Gatto, and their collaborators on realizations of (generalized) Schubert calculus of Grassmannians, and the geometric Satake correspondence of Lusztig, Ginzburg, and Mirković and Vilonen. Along the way we obtain new proofs of equivariant Giambelli formulas for the ordinary and orthogonal Grassmannians, as well as a simple derivation of the \"rim-hook\" rule for computing in the equivariant quantum cohomology of the Grassmannian.",
    "authors": [
      "Dave Anderson",
      "Antonio Nigro"
    ],
    "publication_date": "2019-07-18T15:11:28Z",
    "arxiv_id": "http://arxiv.org/abs/1907.08102v2",
    "download_url": "https://arxiv.org/abs/1907.08102v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The calculus of names -- The legacy of Jan Łukasiewicz",
    "abstract": "With his research on Aristotle's syllogistic, Jan Łukasiewicz (1934, 1939, 1957, 1963) initiates the branch of logic known as the calculus of names. This field deals with axiomatic systems that analyse various fragments of the logic of names, i.e., that branch of logic that studies various forms of names and functors acting on them, as well as logical relationships between sentences in which these names and functors occur. In this work, we want not only to present the genesis of the calculus of names and its first system created by Łukasiewicz. We also want to deliver systems that extend the first. In this work, we will also show that, from the point of view of modern logic, Łukasiewicz's approach to syllogistic is not the only possible one. However, this does not diminish Łukasiewicz's role in the study of syllogism. We believe that the calculus of names is undoubtedly the legacy of Łukasiewicz.",
    "authors": [
      "Andrzej Pietruszczak"
    ],
    "publication_date": "2023-10-09T12:27:56Z",
    "arxiv_id": "http://arxiv.org/abs/2310.05661v3",
    "download_url": "https://arxiv.org/abs/2310.05661v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Divergences as a grading of the formal variational calculus",
    "abstract": "It is shown that the new formula for the field theory Poisson brackets arise naturally in the extension of the formal variational calculus incorporating divergences. The linear spaces of local functionals, evolutionary vector fields, functional forms, multi-vectors and differential operators become graded with respect to divergences. The bilinear operations, such as the action of vector fields on functionals, the commutator of vector fields, the interior product of forms and vectors and the Schouten-Nijenhuis bracket are compatible with the grading. A definition of the adjoint graded operator is proposed and antisymmetric operators are constructed with the help of boundary terms. The fulfilment of the Jacobi identity for the new Poisson brackets is shown to be equivalent to vanishing of the Schouten-Nijenhuis bracket of the Poisson bivector with itself. It is demonstrated, as an example, that the second structure of the Korteweg-de Vries equation is not Hamiltonian with respect to the new brackets until special boundary conditions are prescribed.",
    "authors": [
      "Vladimir O. Soloviev"
    ],
    "publication_date": "1998-09-18T08:06:34Z",
    "arxiv_id": "http://arxiv.org/abs/math/9809103v1",
    "download_url": "https://arxiv.org/abs/math/9809103v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A study on the evolution of a community population by cumulative and fractional calculus approaches",
    "abstract": "Nowadays, in our globalized world,the local and intercountry movements of population have been increased. This situation makes it important for host countries to do right predictions for the future population of their native people as well as immigrant people. The knowledge of the attained number of accumulated population is necessary for future planning, concerning to education,health, job, housing, safety requirements, etc. In this work, for updating historically well known formulas of population dynamics of a community are revisited in the framework of compound growth and fractional calculus to get more realistic relations. Within this context, for a time t, the population evolution of a society which owns two different components is calculated. Concomitant relations have been developed to provide a comparison between the native population and the immigrant population that come into existence where at each time interval a colonial population is joined. Eventually at time t, the case where the native population becomes equal to immigrant population is discussed. Moreover, the differential equation of a probability function for the equilibrium state of accumulative population is obtained. It is seen that the equilibrium solution can be written as a series in terms of Bernoulli numbers. In the calculation of population dynamics, Mittag- Leffler(M-L) function replaces the exponential function.",
    "authors": [
      "F. Buyukkılıç",
      "Z. Ok Bayrakdar",
      "D. Demirhan"
    ],
    "publication_date": "2016-10-31T14:41:03Z",
    "arxiv_id": "http://arxiv.org/abs/1611.00259v1",
    "download_url": "https://arxiv.org/abs/1611.00259v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Positivity of Thom polynomials and Schubert calculus",
    "abstract": "We describe the positivity of Thom polynomials of singularities of maps, Lagrangian Thom polynomials and Legendrian Thom polynomials. We show that these positivities come from Schubert calculus.",
    "authors": [
      "Piotr Pragacz"
    ],
    "publication_date": "2013-04-09T13:13:24Z",
    "arxiv_id": "http://arxiv.org/abs/1304.2573v4",
    "download_url": "https://arxiv.org/abs/1304.2573v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Constrained Nonsmooth Problems of the Calculus of Variations",
    "abstract": "The paper is devoted to an analysis of optimality conditions for nonsmooth multidimensional problems of the calculus of variations with various types of constraints, such as additional constraints at the boundary and isoperimetric constraints. To derive optimality conditions, we study generalised concepts of differentiability of nonsmooth functions called codifferentiability and quasidifferentiability. Under some natural and easily verifiable assumptions we prove that a nonsmooth integral functional defined on the Sobolev space is continuously codifferentiable and compute its codifferential and quasidifferential. Then we apply general optimality conditions for nonsmooth optimisation problems in Banach spaces to obtain optimality conditions for nonsmooth problems of the calculus of variations. Through a series of simple examples we demonstrate that our optimality conditions are sometimes better than existing ones in terms of various subdifferentials, in the sense that our optimality conditions can detect the non-optimality of a given point, when subdifferential-based optimality conditions fail to disqualify this point as non-optimal.",
    "authors": [
      "M. V. Dolgopolik"
    ],
    "publication_date": "2020-04-29T10:30:17Z",
    "arxiv_id": "http://arxiv.org/abs/2004.14061v2",
    "download_url": "https://arxiv.org/abs/2004.14061v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The flaw in the conformable calculus: it is conformable because it is not fractional",
    "abstract": "We point out a major flaw in the conformable calculus. We demonstrate why it fails at defining a fractional derivative and where exactly these tempting conformability properties come from.",
    "authors": [
      "Ahmed A. Abdelhakim"
    ],
    "publication_date": "2018-06-11T11:21:57Z",
    "arxiv_id": "http://arxiv.org/abs/1806.03912v7",
    "download_url": "https://arxiv.org/abs/1806.03912v7",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Solutions of the (free boundary) Reifenberg Plateau problem",
    "abstract": "We solve two variants of the Reifenberg problem for all coefficient groups. We carry out the direct method of the calculus of variation and search a solution as a weak limit of a minimizing sequence. This strategy has been introduced by De Lellis, De Philippis, De Rosa, Ghiraldin and Maggi and allowed them to solve the Reifenberg problem. We use an analogous strategy which allows to take into account the free boundary. Moreover, we show that the Reifenberg class is closed under weak convergence without restriction on the coefficient group.",
    "authors": [
      "Camille Labourie"
    ],
    "publication_date": "2020-02-21T16:05:08Z",
    "arxiv_id": "http://arxiv.org/abs/2002.09376v3",
    "download_url": "https://arxiv.org/abs/2002.09376v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Maximum Principles for Vectorial Approximate Minimizers of Nonconvex Functionals",
    "abstract": "We establish Maximum Principles which apply to vectorial approximate minimizers of the general integral functional of Calculus of Variations. Our main result is a version of the Convex Hull Property.\n  The primary advance compared to results already existing in the literature is that we have dropped the quasiconvexity assumption of the integrand in the gradient term. The lack of weak Lower Semicontinuity is compensated by introducing a nonlinear convergence technique, based on the approximation of the projection onto a convex set by reflections and on the invariance of the integrand in the gradient term under the Orthogonal Group.\n  Maximum Principles are implied for the relaxed solution in the case of non-existence of minimizers and for minimizing solutions of the Euler-Lagrange system of PDE.",
    "authors": [
      "Nikolaos I. Katzourakis"
    ],
    "publication_date": "2008-09-09T16:23:49Z",
    "arxiv_id": "http://arxiv.org/abs/0809.1596v5",
    "download_url": "https://arxiv.org/abs/0809.1596v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Niels Henrik Abel and the birth of fractional calculus",
    "abstract": "This is the paper \"Niels Henrik Abel and the birth of fractional calculus\", Podlubny, I., Magin, R. L., Trymorush I., Fractional Calculus and Applied Analysis, vol.20, no.5, pp.1068-1075, 2017 (https://doi.org/10.1515/fca-2017-0057) with the supplements to it.\n  Hereby translation to English of the first part of the important Abel's paper (Abel, N. H., Oplosning af et par opgaver ved hjelp af bestemte integraler, Magazin for Naturvidenskaberne, Aargang I, Bind 2, Christiania, 1823) and another important Abel's paper (Abel, N. H., Auflosung einer mechanischen ausgabe. Journal fur die Reine und Angewandte Mathematik, Bind I, 153-157, Berlin, 1826) are provided.\n  To preserve the original flavor and the historical development of mathematical notation, the formulas are typeset in the original manner.",
    "authors": [
      "I. Podlubny",
      "R. L. Magin",
      "I. Trymorush"
    ],
    "publication_date": "2018-02-15T09:22:41Z",
    "arxiv_id": "http://arxiv.org/abs/1802.05441v1",
    "download_url": "https://arxiv.org/abs/1802.05441v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lorentzian spin foam amplitudes: graphical calculus and asymptotics",
    "abstract": "The amplitude for the 4-simplex in a spin foam model for quantum gravity is defined using a graphical calculus for the unitary representations of the Lorentz group. The asymptotics of this amplitude are studied in the limit when the representation parameters are large, for various cases of boundary data. It is shown that for boundary data corresponding to a Lorentzian simplex, the asymptotic formula has two terms, with phase plus or minus the Lorentzian signature Regge action for the 4-simplex geometry, multiplied by an Immirzi parameter. Other cases of boundary data are also considered, including a surprising contribution from Euclidean signature metrics.",
    "authors": [
      "John W. Barrett",
      "Richard J. Dowdall",
      "Winston J. Fairbairn",
      "Frank Hellmann",
      "Roberto Pereira"
    ],
    "publication_date": "2009-07-14T19:54:14Z",
    "arxiv_id": "http://arxiv.org/abs/0907.2440v4",
    "download_url": "https://arxiv.org/abs/0907.2440v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fractional Calculus: Integral and Differential Equations of Fractional Order",
    "abstract": "We introduce the linear operators of fractional integration and fractional differentiation in the framework of the Riemann-Liouville fractional calculus. Particular attention is devoted to the technique of Laplace transforms for treating these operators in a way accessible to applied scientists, avoiding unproductive generalities and excessive mathematical rigor. By applying this technique we shall derive the analytical solutions of the most simple linear integral and differential equations of fractional order. We show the fundamental role of the Mittag-Leffler function, whose properties are reported in an ad hoc Appendix. The topics discussed here will be: (a) essentials of Riemann-Liouville fractional calculus with basic formulas of Laplace transforms, (b) Abel type integral equations of first and second kind, (c) relaxation and oscillation type differential equations of fractional order.",
    "authors": [
      "Rudolf Gorenflo",
      "Francesco Mainardi"
    ],
    "publication_date": "2008-05-25T13:17:27Z",
    "arxiv_id": "http://arxiv.org/abs/0805.3823v1",
    "download_url": "https://arxiv.org/abs/0805.3823v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimal random search, fractional dynamics and fractional calculus",
    "abstract": "What is the most efficient search strategy for the random located target sites subject to the physical and biological constraints? Previous results suggested the Lévy flight is the best option to characterize this optimal problem, however, which ignores the understanding and learning abilities of the searcher agents. In the paper we propose the Continuous Time Random Walk (CTRW) optimal search framework and find the optimum for both of search length's and waiting time's distributions. Based on fractional calculus technique, we further derive its master equation to show the mechanism of such complex fractional dynamics. Numerous simulations are provided to illustrate the non-destructive and destructive cases.",
    "authors": [
      "Caibin Zeng",
      "YangQuan Chen"
    ],
    "publication_date": "2013-10-29T05:32:49Z",
    "arxiv_id": "http://arxiv.org/abs/1310.7687v1",
    "download_url": "https://arxiv.org/abs/1310.7687v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cosmology under the fractional calculus approach: a possible $H_0$ tension resolution?",
    "abstract": "Recently, a new field of study called fractional cosmology has emerged. It uses fractional calculus to modify the standard derivative equations and change the Friedmann equations. The evolution of cosmic species densities is also affected by the $μ$ fractional parameter and the age of the Universe $t_0$. This new approach to cosmology modifies the Friedmann equations and allows for a late cosmic acceleration without the need for a dark energy component. This could be a breakthrough in solving longstanding problems in cosmology. By analyzing observational Hubble data and Type Ia supernovae, we have been able to place strict constraints on the fractional and cosmological parameters. Our results suggest that the Universe may be older than previously estimated. We also explore whether fractional cosmology can help resolve the $H_0$ tension.",
    "authors": [
      "Genly Leon",
      "Miguel A. García-Aspeitia",
      "Guillermo Fernandez-Anaya",
      "Alberto Hernández-Almada",
      "Juan Magaña",
      "Esteban González"
    ],
    "publication_date": "2023-04-27T18:51:42Z",
    "arxiv_id": "http://arxiv.org/abs/2304.14465v1",
    "download_url": "https://arxiv.org/abs/2304.14465v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Calculus of Fibonacci Divisors and Fermion-Boson Entanglement for Infinite Hierarchy of N = 2 Supersymmetric Golden Oscillators",
    "abstract": "The quantum calculus with two bases, as powers of the Golden and the Silver ratio, relates Fibonacci divisor derivative with Binet formula of Fibonacci divisor number operator, acting in Fock space of quantum states.It provides a tool to study the hierarchy of Golden oscillators with energy spectrum in form of Fibonacci divisor numbers. We generalize this model to supersymmetric number operator and corresponding Binet formula for supersymmetric Fibonacci divisor number operator. The operator determines the Hamiltonian of hierarchy of supersymmetric Golden oscillators, acting in fermion-boson Hilbert space and belonging to N=2 supersymmetric algebra. The eigenstates of the super Fibonacci divisor number operator are double degenerate and can be characterized by a point on the super-Bloch sphere. By the supersymmetric Fibonacci divisor annihilation operator, we construct the hierarchy of supersymmetric coherent states as eigenstates of this operator. Entanglement of fermions with bosons in these states is calculated by the concurrence, represented by the Gram determinant and hierarchy of Golden exponential functions. We show that the reference states and corresponding von Neumann entropy, measuring fermion-boson entanglement, are characterized completely by the powers of the Golden ratio. The simple geometrical classification of entangled states by the Frobenius ball and meaning of the concurrence as double area of parallelogram in Hilbert space are given.",
    "authors": [
      "Oktay K. Pashaev"
    ],
    "publication_date": "2024-10-05T14:24:32Z",
    "arxiv_id": "http://arxiv.org/abs/2410.04169v2",
    "download_url": "https://arxiv.org/abs/2410.04169v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Double Calculus",
    "abstract": "We present a streamlined, slightly modified version, in the two-variable situation, of a beautiful, but not so well known, theory by Bögel, already from the 1930s, on an alternative higher dimensional calculus of real functions, a double calculus, which includes two-variable extensions of many classical results from single variable calculus, such as Rolle's theorem, Lagrange's mean value theorem, Cauchy's mean value theorem, Fermat's extremum theorem, the first derivative test, and the first and second fundamental theorems of calculus.",
    "authors": [
      "Patrik Lundström"
    ],
    "publication_date": "2021-06-15T12:23:18Z",
    "arxiv_id": "http://arxiv.org/abs/2106.08082v6",
    "download_url": "https://arxiv.org/abs/2106.08082v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symmetric Quantum Calculus",
    "abstract": "We generalize the Hahn variational calculus by studying problems of the calculus of variations with higher-order derivatives. The symmetric quantum calculus is studied, namely the $α,β$-symmetric, the $q$-symmetric, and the Hahn symmetric quantum calculus. We introduce the symmetric quantum variational calculus and an Euler-Lagrange type equation for the $q$-symmetric and Hahn's symmetric quantum calculus is proved. We define a symmetric derivative on time scales and derive some of its properties. Finally, we introduce and study the diamond integral, which is a refined version of the diamond-$α$ integral on time scales.",
    "authors": [
      "Artur M. C. Brito da Cruz"
    ],
    "publication_date": "2013-06-06T07:55:50Z",
    "arxiv_id": "http://arxiv.org/abs/1306.1327v1",
    "download_url": "https://arxiv.org/abs/1306.1327v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cominuscule tableau combinatorics",
    "abstract": "We study \"cominuscule tableau combinatorics\" by generalizing constructions of M. Haiman, S. Fomin and M.-P. Schützenberger. In particular, we extend the dual equivalence ideas of [Haiman, 1992] to reformulate the generalized Littlewood-Richardson rule for cominuscule G/P Schubert calculus from [Thomas-Yong, 2006]. We apply dual equivalence to give an alternative and independent proof of the jeu de taquin results of [Proctor, 2004] needed in our earlier work. We also extend Fomin's growth diagram description of jeu de taquin; the inherent symmetry of these diagrams leads to a generalization of Schützenberger's evacuation involution. Finally, these results are applied to give an cominuscule extension of the carton rule of [Thomas-Yong, 2008].",
    "authors": [
      "Hugh Thomas",
      "Alexander Yong"
    ],
    "publication_date": "2007-01-08T04:39:28Z",
    "arxiv_id": "http://arxiv.org/abs/math/0701215v2",
    "download_url": "https://arxiv.org/abs/math/0701215v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lie Calculus",
    "abstract": "We explain that general differential calculus and Lie theory have a common foundation: Lie Calculus is differential calculus, seen from the point of view of Lie theory, by making use of the groupoid concept as link between them. Higher order theory naturally involves higher algebra (n-fold groupoids).(conceptual, topological) differential calculus, groupoids, higher algebra($n$-fold groupoids), Lie group, Lie groupoid, tangent groupoid, cubes of rings",
    "authors": [
      "Wolfgang Bertram"
    ],
    "publication_date": "2017-02-27T13:49:23Z",
    "arxiv_id": "http://arxiv.org/abs/1702.08282v2",
    "download_url": "https://arxiv.org/abs/1702.08282v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuation calculus",
    "abstract": "Programs with control are usually modeled using lambda calculus extended with control operators. Instead of modifying lambda calculus, we consider a different model of computation. We introduce continuation calculus, or CC, a deterministic model of computation that is evaluated using only head reduction, and argue that it is suitable for modeling programs with control. It is demonstrated how to define programs, specify them, and prove them correct. This is shown in detail by presenting in CC a list multiplication program that prematurely returns when it encounters a zero. The correctness proof includes termination of the program. In continuation calculus we can model both call-by-name and call-by-value. In addition, call-by-name functions can be applied to call-by-value results, and conversely.",
    "authors": [
      "Bram Geron",
      "Herman Geuvers"
    ],
    "publication_date": "2013-09-05T08:03:50Z",
    "arxiv_id": "http://arxiv.org/abs/1309.1257v1",
    "download_url": "https://arxiv.org/abs/1309.1257v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A short proof of the strong normalization of the simply typed $λμ$-calculus",
    "abstract": "We give an elementary and purely arithmetical proof of the strong normalization of Parigot's simply typed $λμ$-calculus.",
    "authors": [
      "René David",
      "Karim Nour"
    ],
    "publication_date": "2009-05-11T06:46:12Z",
    "arxiv_id": "http://arxiv.org/abs/0905.1557v1",
    "download_url": "https://arxiv.org/abs/0905.1557v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Weingarten Calculus",
    "abstract": "This is a short introduction to Weingarten Calculus. Weingarten Calculus is a method to compute the joint moments of matrix variables distributed according to the Haar measure of compact groups.",
    "authors": [
      "Benoit Collins",
      "Sho Matsumoto",
      "Jonathan Novak"
    ],
    "publication_date": "2021-09-30T07:13:42Z",
    "arxiv_id": "http://arxiv.org/abs/2109.14890v1",
    "download_url": "https://arxiv.org/abs/2109.14890v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formal calculus and umbral calculus",
    "abstract": "In this paper we use the viewpoint of the formal calculus underlying vertex operator algebra theory to study certain aspects of the classical umbral calculus and we introduce and study certain operators generalizing the classical umbral shifts. We begin by calculating the exponential generating function of the higher derivatives of a composite function, following a short, elementary proof which naturally arose as a motivating computation related to a certain crucial \"associativity\" property of an important class of vertex operator algebras. Very similar (somewhat forgotten) proofs had appeared by the 19-th century, of course without any motivation related to vertex operator algebras. Using this formula, we derive certain results, including especially the calculation of certain adjoint operators, of the classical umbral calculus. This is, roughly speaking, a reversal of the logical development of some standard treatments, which have obtained formulas for the higher derivatives of a composite function, most notably Faà di Bruno's formula, as a consequence of umbral calculus. We set our results in the context of some standard material in what seems a natural fashion given our point of view. We also show a connection between the Virasoro algebra and the classical umbral shifts. This leads naturally to a more general class of operators, which we introduce, and which include the classical umbral shifts as a special case. We prove a few basic facts about these operators.",
    "authors": [
      "Thomas J. Robinson"
    ],
    "publication_date": "2009-12-04T23:57:25Z",
    "arxiv_id": "http://arxiv.org/abs/0912.0961v3",
    "download_url": "https://arxiv.org/abs/0912.0961v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Refining Calculus Pedagogy",
    "abstract": "There have been several modifications of how basic calculus has been taught, but very few of these modifications have considered the computational tools available at our disposal. Here, we present a few tools that are easy to develop and use. Doing so also addresses a different way to view calculus, and attempts to fill the gaps in students' understanding of both differentiation and integration. We will describe the basics of both these topics in a way that might be much more useful and relevant to students, and hence possible ways in refining calculus pedagogy to make calculus more accessible to them. For integration, an elementary development of Gaussian quadrature using basic linear algebra is presented. This numerical method can be extended to integrate functions over various domains in higher dimensions, a subject that is not currently well covered in multivariable calculus or other Mathematics courses. We also briefly discuss series that may be more useful than some of those taught in current calculus courses.",
    "authors": [
      "Parthasarathy Srinivasan"
    ],
    "publication_date": "2024-09-16T13:36:26Z",
    "arxiv_id": "http://arxiv.org/abs/2410.01823v1",
    "download_url": "https://arxiv.org/abs/2410.01823v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Models for the Displacement Calculus",
    "abstract": "The displacement calculus $\\mathbf{D}$ is a conservative extension of the Lambek calculus $\\mathbf{L1}$ (with empty antecedents allowed in sequents). $\\mathbf{L1}$ can be said to be the logic of concatenation, while $\\mathbf{D}$ can be said to be the logic of concatenation and intercalation. In many senses, it can be claimed that $\\mathbf{D}$ mimics $\\mathbf{L1}$ in that the proof theory, generative capacity and complexity of the former calculus are natural extensions of the latter calculus. In this paper, we strengthen this claim. We present the appropriate classes of models for $\\mathbf{D}$ and prove some completeness results; strikingly, we see that these results and proofs are natural extensions of the corresponding ones for $\\mathbf{L1}$.",
    "authors": [
      "Oriol Valentín"
    ],
    "publication_date": "2017-06-10T15:04:39Z",
    "arxiv_id": "http://arxiv.org/abs/1706.03244v1",
    "download_url": "https://arxiv.org/abs/1706.03244v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Encoding the Factorisation Calculus",
    "abstract": "Jay and Given-Wilson have recently introduced the Factorisation (or SF-) calculus as a minimal fundamental model of intensional computation. It is a combinatory calculus containing a special combinator, F, which is able to examine the internal structure of its first argument. The calculus is significant in that as well as being combinatorially complete it also exhibits the property of structural completeness, i.e. it is able to represent any function on terms definable using pattern matching on arbitrary normal forms. In particular, it admits a term that can decide the structural equality of any two arbitrary normal forms.\n  Since SF-calculus is combinatorially complete, it is clearly at least as powerful as the more familiar and paradigmatic Turing-powerful computational models of Lambda Calculus and Combinatory Logic. Its relationship to these models in the converse direction is less obvious, however. Jay and Given-Wilson have suggested that SF-calculus is strictly more powerful than the aforementioned models, but a detailed study of the connections between these models is yet to be undertaken.\n  This paper begins to bridge that gap by presenting a faithful encoding of the Factorisation Calculus into the Lambda Calculus preserving both reduction and strong normalisation. The existence of such an encoding is a new result. It also suggests that there is, in some sense, an equivalence between the former model and the latter. We discuss to what extent our result constitutes an equivalence by considering it in the context of some previously defined frameworks for comparing computational power and expressiveness.",
    "authors": [
      "Reuben N. S. Rowe"
    ],
    "publication_date": "2015-08-27T03:21:54Z",
    "arxiv_id": "http://arxiv.org/abs/1508.06713v1",
    "download_url": "https://arxiv.org/abs/1508.06713v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Filtered stochastic calculus",
    "abstract": "By introducing a color filtration to the multiplicity space, we extend the quantum Ito calculus on multiple symmetric Fock space to the framework of filtered adapted biprocesses. In this new notion of adaptedness,``classical'' time filtration makes the integrands similar to adapted processes, whereas ``quantum'' color filtration produces their deviations from adaptedness. An important feature of this calculus, which we call filtered stochastic calculus, is that it provides an explicit interpolation between the main types of calculi, regardless of the type of independence, including freeness, Boolean independence (more generally, m-freeness) as well as tensor independence. Moreover, it shows how boson calculus is ``deformed'' by other noncommutative notions of independence.",
    "authors": [
      "Romuald Lenczewski"
    ],
    "publication_date": "2001-03-06T10:31:16Z",
    "arxiv_id": "http://arxiv.org/abs/math/0103033v1",
    "download_url": "https://arxiv.org/abs/math/0103033v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Macro Lambda Calculus",
    "abstract": "The goal of our Macro Lambda Calculus project (MLC) is to encode lambda terms into interaction nets. Its software implementation will accept input in the notation similar to lambda calculus allowing macro definitions. Output is similar to interaction calculus and is suitable for our Interaction Nets Compiler program (INC). In this paper, we describe the interaction system for call-by-need evaluation and the mechanism of encoding lambda terms into this system which MLC is based on.",
    "authors": [
      "Anton Salikhmetov"
    ],
    "publication_date": "2013-04-08T18:17:32Z",
    "arxiv_id": "http://arxiv.org/abs/1304.2290v8",
    "download_url": "https://arxiv.org/abs/1304.2290v8",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A strong call-by-need calculus",
    "abstract": "We present a call-by-need $λ$-calculus that enables strong reduction (that is, reduction inside the body of abstractions) and guarantees that arguments are only evaluated if needed and at most once. This calculus uses explicit substitutions and subsumes the existing strong-call-by-need strategy, but allows for more reduction sequences, and often shorter ones, while preserving the neededness. The calculus is shown to be normalizing in a strong sense: Whenever a $λ$-term t admits a normal form n in the $λ$-calculus, then any reduction sequence from t in the calculus eventually reaches a representative of the normal form n. We also exhibit a restriction of this calculus that has the diamond property and that only performs reduction sequences of minimal length, which makes it systematically better than the existing strategy. We have used the Abella proof assistant to formalize part of this calculus, and discuss how this experiment affected its design. In particular, it led us to derive a new description of call-by-need reduction based on inductive rules.",
    "authors": [
      "Thibaut Balabonski",
      "Antoine Lanco",
      "Guillaume Melquiond"
    ],
    "publication_date": "2021-11-02T10:39:39Z",
    "arxiv_id": "http://arxiv.org/abs/2111.01485v4",
    "download_url": "https://arxiv.org/abs/2111.01485v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Koszul Calculus",
    "abstract": "We present a new calculus which is well-adapted to quadratic algebras. This calculus consists in Koszul (co)homology, together with Koszul cup and cap products. Some applications are given. Koszul duality for Koszul (co)homology is proved for any quadratic algebra.",
    "authors": [
      "Roland Berger",
      "Thierry Lambre",
      "Andrea Solotar"
    ],
    "publication_date": "2015-12-01T09:15:20Z",
    "arxiv_id": "http://arxiv.org/abs/1512.00183v3",
    "download_url": "https://arxiv.org/abs/1512.00183v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Calculus: a limitless perspective",
    "abstract": "We propose a novel foundation for calculus that focuses on the notion of approximations while avoiding the use of limits altogether. Continuity is defined as approximation at a point, while differentiability is defined as approximation with a linear function. The errors in approximation are defined as a class of functions with certain properties; rules for combining error functions lead to all the familiar results in differential calculus.\n  We believe that this approach is more natural for students while still giving a rigourous foundation to differential calculus. We demonstrate its utility by deriving the basic differential rules for trigonometric, hyperbolic and exponential functions, as well as L'Hôpital's Rule, Taylor polynomials, and the Fundamental Theorem of Calculus, all via approximation.",
    "authors": [
      "Michael P. Lamoureux",
      "Matt Yedlin"
    ],
    "publication_date": "2025-10-15T05:40:55Z",
    "arxiv_id": "http://arxiv.org/abs/2510.20836v1",
    "download_url": "https://arxiv.org/abs/2510.20836v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Embedding calculus and smooth structures",
    "abstract": "We study the dependence of the embedding calculus Taylor tower on the smooth structures of the source and target. We prove that embedding calculus does not distinguish exotic smooth structures in dimension 4, implying a negative answer to a question of Viro. In contrast, we show that embedding calculus does distinguish certain exotic spheres in higher dimensions. As a technical tool of independent interest, we prove an isotopy extension theorem for the limit of the embedding calculus tower, which we use to investigate several further examples.",
    "authors": [
      "Ben Knudsen",
      "Alexander Kupers"
    ],
    "publication_date": "2020-06-04T19:38:55Z",
    "arxiv_id": "http://arxiv.org/abs/2006.03109v2",
    "download_url": "https://arxiv.org/abs/2006.03109v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formalizing $\\varphi$-calculus: a purely object-oriented calculus of decorated objects",
    "abstract": "Many calculi exist for modelling various features of object-oriented languages. Many of them are based on $λ$-calculus and focus either on statically typed class-based languages or dynamic prototype-based languages. We formalize untyped calculus of decorated objects, informally presented by Bugayenko, which is defined in terms of objects and relies on decoration as a primary mechanism of object extension. It is not based on $λ$-calculus, yet with only four basic syntactic constructions is just as complete. We prove the calculus is confluent (i.e. possesses Church-Rosser property), and introduce an abstract machine for call-by-name evaluation. Finally, we provide a sound translation to $λ$-calculus with records.",
    "authors": [
      "Nikolai Kudasov",
      "Violetta Sim"
    ],
    "publication_date": "2022-04-15T13:25:01Z",
    "arxiv_id": "http://arxiv.org/abs/2204.07454v2",
    "download_url": "https://arxiv.org/abs/2204.07454v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tuplix Calculus",
    "abstract": "We introduce a calculus for tuplices, which are expressions that generalize matrices and vectors. Tuplices have an underlying data type for quantities that are taken from a zero-totalized field. We start with the core tuplix calculus CTC for entries and tests, which are combined using conjunctive composition. We define a standard model and prove that CTC is relatively complete with respect to it. The core calculus is extended with operators for choice, information hiding, scalar multiplication, clearing and encapsulation. We provide two examples of applications; one on incremental financial budgeting, and one on modular financial budget design.",
    "authors": [
      "J. A. Bergstra",
      "A. Ponse",
      "M. B. van der Zwaag"
    ],
    "publication_date": "2007-12-20T13:58:14Z",
    "arxiv_id": "http://arxiv.org/abs/0712.3423v1",
    "download_url": "https://arxiv.org/abs/0712.3423v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "S-Program Calculus",
    "abstract": "This paper presents a special subset of the first-order predicate logic named S-program calculus (briefly S-calculus). The S-calculus is a calculus consisting of so-called S-formulas that are defined over the abstract state space of a virtual machine. We show that S-formulas are a highly general tool for analyzing program semantics inasmuch as Hoare triplets of total and partial correctness are not more than two S-formulas. Moreover, all the rules of Hoare logic can be derived using S-formulas and axioms/theorems of first-order predicate calculus. The S-calculus is a powerful mechanism for proving program correctness as well as for building additional proving tools using theorems of the predicate logic. Every proof is based on deriving the validity of some S-formula, so the procedure may be automated using automatic theorem provers (we will use Coq in this paper). As an example of the use of S-calculus, we will prove the four basic properties of Dijsktra's operator wp. The proofs given by Dijkstra are not completely formalized and we will show that a full formalization can be achieved using S-calculus. Finally, we add one more theorem to the above-mentioned four, namely the law of negation.",
    "authors": [
      "Aleksandar Kupusinac",
      "Dusan Malbaski"
    ],
    "publication_date": "2010-03-03T10:36:52Z",
    "arxiv_id": "http://arxiv.org/abs/1003.0773v1",
    "download_url": "https://arxiv.org/abs/1003.0773v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]