[
  {
    "title": "The graph topology",
    "abstract": "We study topological properties of the graph topology.",
    "authors": [
      "Lubica Hola"
    ],
    "publication_date": "2012-07-06T11:35:26Z",
    "arxiv_id": "http://arxiv.org/abs/1207.1589v1",
    "download_url": "http://arxiv.org/abs/1207.1589v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Selective survey on spaces of closed subgroups of topological groups",
    "abstract": "We survey different topologizations of the set $\\mathcal{S}(G)$ of all closed\nsubgroups of a topological group $G$ and demonstrate some applications in\nTopological Grous, Model Theory, Geometric Group Theory, Topological Dynamics.",
    "authors": [
      "Igor V. Protasov"
    ],
    "publication_date": "2018-09-01T09:03:23Z",
    "arxiv_id": "http://arxiv.org/abs/1809.00139v1",
    "download_url": "http://arxiv.org/abs/1809.00139v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Expansion, Study and Applications",
    "abstract": "In this paper, we introduce the notion of expanding topological space. We\ndefine the topological expansion of a topological space via local\nmulti-homeomorphism over coproduct topology, and we prove that the coproduct\nfamily associated to any fractal family of topological spaces is expanding. In\nparticular, we prove that the more a topological space expands, the finer the\ntopology of its indexed states is. Using multi-homeomorphisms over associated\ncoproduct topological spaces, we define a locally expandable topological space\nand we prove that a locally expandable topological space has a topological\nexpansion. Specifically, we prove that the expanding fractal manifold is\nlocally expandable and has a natural topological expansion.",
    "authors": [
      "Helene Porchon"
    ],
    "publication_date": "2012-11-13T12:33:25Z",
    "arxiv_id": "http://arxiv.org/abs/1211.3365v1",
    "download_url": "http://arxiv.org/abs/1211.3365v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On a topological simple Warne extension of a semigroup",
    "abstract": "In the paper we introduce topological $\\mathbb{Z}$-Bruck-Reilly and\ntopological $\\mathbb{Z}$-Bruck extensions of (semi)topological monoids which\nare generalizations of topological Bruck-Reilly and topological Bruck\nextensions of (semi)topological monoids and study their topologizations. The\nsufficient conditions under which the topological $\\mathbb{Z}$-Bruck-Reilly\n($\\mathbb{Z}$-Bruck) extension admits only the direct sum topology and\nconditions under which the direct sum topology can be coarsened are given.\nAlso, topological characterizations of some classes of $I$-bisimple\n(semi)topological semigroups are given.",
    "authors": [
      "Iryna Fihel",
      "Oleg Gutik",
      "Kateryna Pavlyk"
    ],
    "publication_date": "2013-01-07T15:45:04Z",
    "arxiv_id": "http://arxiv.org/abs/1301.1232v1",
    "download_url": "http://arxiv.org/abs/1301.1232v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Separation Axioms in Bi-soft Topological Spaces",
    "abstract": "Concept of bi-soft topological spaces is introduced. Several notions of a\nsoft topological space are generalized to study bi-soft topological spaces.\nSeparation axioms play a vital role in study of topological spaces. These\nconcepts have been studied in context of bi-soft topological spaces. There is a\nvery close relationship between topology and rough set theory. An application\nof bi-soft topology is given in rough set theory.",
    "authors": [
      "Munazza Naz",
      "Muhammad Shabir",
      "Muhammad Irfan Ali"
    ],
    "publication_date": "2015-08-29T08:30:04Z",
    "arxiv_id": "http://arxiv.org/abs/1509.00866v1",
    "download_url": "http://arxiv.org/abs/1509.00866v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Digital Shy Maps",
    "abstract": "We study properties of shy maps in digital topology.",
    "authors": [
      "Laurence Boxer"
    ],
    "publication_date": "2016-06-02T18:10:40Z",
    "arxiv_id": "http://arxiv.org/abs/1606.00782v1",
    "download_url": "http://arxiv.org/abs/1606.00782v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multivalued Functions in Digital Topology",
    "abstract": "We study several types of multivalued functions in digital topology.",
    "authors": [
      "Laurence Boxer"
    ],
    "publication_date": "2017-03-06T01:22:20Z",
    "arxiv_id": "http://arxiv.org/abs/1703.01700v1",
    "download_url": "http://arxiv.org/abs/1703.01700v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Subgroup Topologies on Fundamental Groups",
    "abstract": "It is important to classify covering subgroups of the fundamental group of a\ntopological space using their topological properties in the topologized\nfundamental group. In this paper, we introduce and study some topologies on the\nfundamental group and use them to classify coverings, semicoverings, and\ngeneralized coverings of a topological space. To do this, we use the concept of\nsubgroup topology on a group and discuss their properties. In particular, we\nexplore which of these topologies make the fundamental group a topological\ngroup. Moreover, we provide some examples of topological spaces to compare\ntopologies of fundamental groups.",
    "authors": [
      "M. Ab dullahi Rashid",
      "N. Jamali",
      "B. Mashayekhy",
      "S. Z. Pashaei",
      "H. Torabi"
    ],
    "publication_date": "2018-07-03T05:32:12Z",
    "arxiv_id": "http://arxiv.org/abs/1807.00982v1",
    "download_url": "http://arxiv.org/abs/1807.00982v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On topological complexity of twisted products",
    "abstract": "We provide an upper bound on the topological complexity of twisted products.\nWe use it to give an estimate $$TC(X)\\le TC(\\pi_1(X))+\\dim X$$ of the\ntopological complexity of a space in terms of its dimension and the complexity\nof its fundamental group.",
    "authors": [
      "Alexander Dranishnikov"
    ],
    "publication_date": "2013-12-01T01:35:54Z",
    "arxiv_id": "http://arxiv.org/abs/1312.0170v1",
    "download_url": "http://arxiv.org/abs/1312.0170v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological aspect of monodromy groupoid for a group-groupoid",
    "abstract": "In this paper we develop star topological and topological group-groupoid\nstructures of monodromy groupoid and prove that the monodromy groupoid of a\ntopological group-groupoid is also a topological group-groupoid.",
    "authors": [
      "Osman Mucuk",
      "Serap Demir"
    ],
    "publication_date": "2018-01-26T17:18:17Z",
    "arxiv_id": "http://arxiv.org/abs/1801.08900v1",
    "download_url": "http://arxiv.org/abs/1801.08900v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Discreteness and Homogeneity of the Topological Fundamental Group",
    "abstract": "For a locally path connected topological space, the topological fundamental\ngroup is discrete if and only if the space is semilocally simply-connected.\nWhile functoriality of the topological fundamental group for arbitrary\ntopological spaces remains an open question, the topological fundamental group\nis always a homogeneous space.",
    "authors": [
      "Jack S. Calcut",
      "John D. McCarthy"
    ],
    "publication_date": "2009-04-30T04:35:22Z",
    "arxiv_id": "http://arxiv.org/abs/0904.4739v1",
    "download_url": "http://arxiv.org/abs/0904.4739v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On topological Clifford semigroups embeddable into products of cones\n  over topological groups",
    "abstract": "In this paper we detect topological Clifford semigroups which are embeddable\ninto Tychonoff products of topological semilattices and cones over topological\ngroups. Also we detect topological Clifford semigroups which embed into compact\ntopological Clifford semigroups.",
    "authors": [
      "Taras Banakh",
      "Iryna Pastukhova"
    ],
    "publication_date": "2013-04-09T12:42:29Z",
    "arxiv_id": "http://arxiv.org/abs/1304.2558v2",
    "download_url": "http://arxiv.org/abs/1304.2558v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Topologized Fundamental Group and covering spaces of topological\n  groups",
    "abstract": "In this paper, we show that every topological group is a strong small loop\ntransfer space at the identity element. This implies that the quasitopological\nfundamental group of a connected locally path connected topological group is a\ntopological group. Also, we show that every covering space of a connected\nlocally path connected topological group is a topological group and its\ncovering map is homomorphism.",
    "authors": [
      "Hamid Torabi"
    ],
    "publication_date": "2018-03-02T07:28:38Z",
    "arxiv_id": "http://arxiv.org/abs/1803.00741v1",
    "download_url": "http://arxiv.org/abs/1803.00741v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Covers in the Canonical Grothendieck Topology",
    "abstract": "We explore the canonical Grothendieck topology in some specific\ncircumstances. First we use a description of the canonical topology to get a\nvariant of Giraud's Theorem. Then we explore the canonical Grothendieck\ntopology on the categories of sets and topological spaces; here we get a nice\nbasis for the topology. Lastly, we look at the canonical Grothendieck topology\non the category of $R$-modules.",
    "authors": [
      "Cynthia Lester"
    ],
    "publication_date": "2019-09-08T04:20:37Z",
    "arxiv_id": "http://arxiv.org/abs/1909.03384v1",
    "download_url": "http://arxiv.org/abs/1909.03384v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Embedding of partially ordered topological spaces in Fell topological\n  hyperspaces",
    "abstract": "In this paper, we prove a theorem about embedding of some partially ordered\ntopological spaces in topological hyperspaces equipped with Fell topology. Then\nwe give some examples to show that the map defining the embedding may not be\ncontinuous with respect to Vietoris topology or Hausdorff topology equipped on\nthe hyperspaces.",
    "authors": [
      "Jinlu Li"
    ],
    "publication_date": "2021-12-22T00:03:35Z",
    "arxiv_id": "http://arxiv.org/abs/2112.11584v1",
    "download_url": "http://arxiv.org/abs/2112.11584v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Minimum Topological Group Topologies",
    "abstract": "A Hausdorff topological group topology on a group $G$ is the minimum\n(Hausdorff) group topology if it is contained in every Hausdorff group topology\non $G$. For every compact metrizable space $X$ containing an open $n$-cell,\n$n\\ge2$, the homeomorphism group $H(X)$ has no minimum Hausdorff group\ntopology. The homeomorphism groups of the Cantor set and the Hilbert cube have\nno minimum group topology. For every compact metrizable space $X$ containing a\ndense open one-manifold, $H(X)$ has the minimum group topology. Some, but not\nall, oligomorphic groups have the minimum group topology.",
    "authors": [
      "Xiao Chang",
      "Paul Gartside"
    ],
    "publication_date": "2015-10-24T16:44:46Z",
    "arxiv_id": "http://arxiv.org/abs/1510.07161v1",
    "download_url": "http://arxiv.org/abs/1510.07161v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Closed subsets of compact-like topological spaces",
    "abstract": "We investigate closed subsets (subsemigroups, resp.) of compact-like\ntopological spaces (semigroups, resp.). We prove that each Hausdorff\ntopological space can be embedded as a closed subspace into an H-closed\ntopological space. However, the semigroup of $\\omega{\\times\\omega}$-matrix\nunits cannot be embedded into a topological semigroup which is a weakly\nH-closed topological space. We show that each Hausdorff topological space is a\nclosed subspace of some $\\omega$-bounded pracompact topological space and\ndescribe open dense subspaces of countably pracompact topological spaces. Also,\nwe construct a pseudocompact topological semigroup which contains the bicyclic\nmonoid as a closed subsemigroup, providing a positive solution of a problem\nposed by Banakh, Dimitrova, and Gutik.",
    "authors": [
      "Serhii Bardyla",
      "Alex Ravsky"
    ],
    "publication_date": "2019-07-28T19:23:12Z",
    "arxiv_id": "http://arxiv.org/abs/1907.12129v2",
    "download_url": "http://arxiv.org/abs/1907.12129v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weak fuzzy topology on fuzzy topological vector spaces",
    "abstract": "In this paper, we introduce the concept of weak fuzzy linear topology on a\nfuzzy topological vector space as a generalization of usual weak topology. We\nprove that this topology consists of all weakly lower semi-continuous fuzzy\nsets on a given vector space when K (R or C) considered with its usual fuzzy\ntopology. In the case that the topology of K is different from the usual fuzzy\ntopology, we show that the weak fuzzy topology is not equivalent with the\ntopology of weakly lower semi-continuous fuzzy sets.",
    "authors": [
      "B. Daraby",
      "N. Khosravi",
      "A. Rahimi"
    ],
    "publication_date": "2019-10-07T06:56:27Z",
    "arxiv_id": "http://arxiv.org/abs/1910.03405v1",
    "download_url": "http://arxiv.org/abs/1910.03405v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The fundamental group as a topological group",
    "abstract": "This paper is devoted to the study of a natural group topology on the\nfundamental group which remembers local properties of spaces forgotten by\ncovering space theory and weak homotopy type. It is known that viewing the\nfundamental group as the quotient of the loop space often fails to result in a\ntopological group; we use free topological groups to construct a topology which\npromotes the fundamental group of any space to topological group structure. The\nresulting invariant, denoted $\\pi_{1}^{\\tau}$, takes values in the category of\ntopological groups, can distinguish spaces with isomorphic fundamental groups,\nand agrees with the quotient fundamental group precisely when the quotient\ntopology yields a topological group. Most importantly, this choice of topology\nallows us to naturally realize free topological groups and pushouts of\ntopological groups as fundamental groups via topological analogues of classical\nresults in algebraic topology.",
    "authors": [
      "Jeremy Brazas"
    ],
    "publication_date": "2010-09-21T00:43:57Z",
    "arxiv_id": "http://arxiv.org/abs/1009.3972v5",
    "download_url": "http://arxiv.org/abs/1009.3972v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sober topologies on a set",
    "abstract": "The collection of all topologies on a set X forms a complete lattice with\nrespect to the inclusion order, which have been investigated by many\nresearchers. Sobriety is one of the core and extensively studied properties in\nnon-Hausdorff topology. This property plays a crucial role in characterizing\nthe spectral spaces of commutative rings and topological spaces determined by\ntheir lattices of open sets. In this paper, we investigate the statute of sober\ntopologies in the complete lattice of all topologies on a given set. The main\nresults to be proved include: (1) every T1 topology is the join of some sober\ntopologies; (2) every topology is the meet of some sober topologies; (3) the\nset of all sober topologies is directed complete; (4) every Alexanderoff -\ndiscrete topology is the meet of some sober Alexanderoff - discrete topologies;\n(5) the minimal sober topologies are exactly the Scott topologies of\nsup-complete chains; (6) an example will be constructed to show that the\nintersection of a decreasing sequence of Hausdorff topologies need not be\nsober.",
    "authors": [
      "Xiangrui Li",
      "Qingguo Li",
      "Dongsheng Zhao"
    ],
    "publication_date": "2025-08-07T14:10:22Z",
    "arxiv_id": "http://arxiv.org/abs/2508.05419v1",
    "download_url": "http://arxiv.org/abs/2508.05419v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Properties and Characterizations",
    "abstract": "There are three important types of structural properties that remain\nunchanged under the structural transformation of condensed matter physics and\nchemistry. They are the properties that remain unchanged under the structural\nperiodic transformation-periodic properties. The properties that remain\nunchanged under the structural multi scale transformation-fractal properties.\nThe properties that remain unchanged under the structural continuous\ndeformation transformation-topological properties. In this paper, we will\ndescribe topological properties and characterizations in three layers: the\nfirst layer is intuitive concept, characterizations and applications, the\nsecond layer is logical physics understanding of topological properties,\ncharacterizations and applications, and the third layer is the nature of\ntopological properties and its power. Duality and trinity are viewed as\nintrinsically topological objects and are recognized as common knowledge shared\namong human society activity, mathematics, physics, chemistry, biology and many\nother kinds of nature science and technology. Some important methods used so\nfar to characterize the topological properties, including topological index,\ntopological order, topological invariant, topology class and the topology\npartition are discussed. The theories of molecular topology, topological\nquantum matter including topological insulators, topological metal and\ntopological superconductors and topological quantum computing are reviewed. The\ndevelopment of the topological duality connection between the qubit and\nsingularity via topological space time is briefly introduced. We will see the\nuse of iterated function systems (IFS)to simulate the connection between\nsingularities and their qubit control codes. The novel applications of topology\nin integrated circuits technology are also discussed in this paper.",
    "authors": [
      "John Hongguang Zhang"
    ],
    "publication_date": "2021-08-08T13:08:25Z",
    "arxiv_id": "http://arxiv.org/abs/2108.07061v1",
    "download_url": "http://arxiv.org/abs/2108.07061v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and quantum cosmology -- Continuous topological evolution\n  of topologically coherent defects",
    "abstract": "As a point of departure it is suggested that Quantum Cosmology is a\ntopological concept independent from metrical constraints. Methods of\ncontinuous topological evolution and topological thermodynamics are used to\nconstruct a cosmological model of the present universe, using the techniques\nbased upon Cartan's theory of exterior differential systems. Thermodynamic\ndomains, which are either Open, Closed, Isolated, or in Equilibrium, can be put\ninto correspondence with topological systems of Pfaff topological dimension 4,\n3, 2 and 1. If the environment of the universe is assumed to be a physical\nvacuum of Pfaff topological dimension 4, then continuous but irreversible\ntopological evolution can cause the emergence of topologically coherent defect\nstructures of Pfaff topological dimension less than 4. As galaxies and stars\nexchange radiation but not matter with the environment, they are emergent\ntopological defects of Pfaff topological dimension 3 which are far from\nequilibrium. DeRham topological theory of period integrals over closed but not\nexact exterior differential systems leads to the emergence of quantized,\ndeformable, but topologically coherent, singular macrostates at all scales. The\nmethod leads to the conjecture that dark matter and energy is represented by\nthose thermodynamic topological defect structures of Pfaff dimension 2 or less.",
    "authors": [
      "R. M. Kiehn"
    ],
    "publication_date": "2006-03-17T18:22:18Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0603072v1",
    "download_url": "http://arxiv.org/abs/gr-qc/0603072v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological characterization of torus groups",
    "abstract": "Topological characterization of torus groups is given.",
    "authors": [
      "Alex Chigogidze"
    ],
    "publication_date": "1999-08-15T20:15:11Z",
    "arxiv_id": "http://arxiv.org/abs/math/9908075v1",
    "download_url": "http://arxiv.org/abs/math/9908075v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological classification of Morse-Smale flows on 3-manifolds",
    "abstract": "We construct a topological invariant for a Morse-Smale flow on a 3-manifold\nand prove that the flows are topologically equivalent iff their invariants are\nsame.",
    "authors": [
      "Alexandr Prishlyak"
    ],
    "publication_date": "2004-08-18T04:37:09Z",
    "arxiv_id": "http://arxiv.org/abs/math/0408231v1",
    "download_url": "http://arxiv.org/abs/math/0408231v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On homotopical and homological $Z_n$-sets",
    "abstract": "We survey some properties of homotopical and homological $Z_n$-sets in\ntopological spaces.",
    "authors": [
      "Taras Banakh",
      "Robert Cauty",
      "Alex Karassev"
    ],
    "publication_date": "2010-02-14T21:38:11Z",
    "arxiv_id": "http://arxiv.org/abs/1002.2802v1",
    "download_url": "http://arxiv.org/abs/1002.2802v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological equivalence to a projection",
    "abstract": "We present a necessary and sufficient condition for the topological\nequivalence of a continuous function on a plane to a projection onto one of\ncoordinates.",
    "authors": [
      "Volodymyr Sharko",
      "Yuliia Soroka"
    ],
    "publication_date": "2016-07-14T11:35:47Z",
    "arxiv_id": "http://arxiv.org/abs/1607.04093v1",
    "download_url": "http://arxiv.org/abs/1607.04093v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The symmetrized topological complexity of the circle",
    "abstract": "We determine the symmetrized topological complexity of the circle, using\nprimarily just general topology.",
    "authors": [
      "Donald M Davis"
    ],
    "publication_date": "2017-03-15T21:23:39Z",
    "arxiv_id": "http://arxiv.org/abs/1703.05391v1",
    "download_url": "http://arxiv.org/abs/1703.05391v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the coarsest topology preserving continuity",
    "abstract": "We study a topology on a space of functions, called sticking topology, with\nthe property to be the weakest among the topologies preserving continuity. In\nsuitable frameworks, this topology preserves borelianity, local integrability,\nright continuity and other properties. It is coarser than the locally uniform\nconvergence and it allows the presence of gliding humps as we show on examples.\nWe prove relative compactness criteria for this topology and we consider some\nextensions.",
    "authors": [
      "Nicolas Bouleau"
    ],
    "publication_date": "2006-10-11T15:29:39Z",
    "arxiv_id": "http://arxiv.org/abs/math/0610373v1",
    "download_url": "http://arxiv.org/abs/math/0610373v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological defects in two-dimensional crystals",
    "abstract": "By using topological current theory, we study the inner topological structure\nof the topological defects in two-dimensional (2D) crystal. We find that there\nare two elementary point defects topological current in two-dimensional\ncrystal, one for dislocations and the other for disclinations. The topological\nquantization and evolution of topological defects in two-dimensional crystals\nare discussed. Finally, We compare our theory with Brownian-dynamics\nsimulations in 2D Yukawa systems.",
    "authors": [
      "Yong Chen",
      "Wei-Kai Qi"
    ],
    "publication_date": "2008-09-24T06:56:10Z",
    "arxiv_id": "http://arxiv.org/abs/0809.4104v1",
    "download_url": "http://arxiv.org/abs/0809.4104v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Test of Topological Property of YbB6",
    "abstract": "Topological insulator is a recently discovered class of material with\ntopologically protected surface state. YbB6 is predicted to be moderately\ncorrelated Z2 topological insulator similar to SmB6. Here, I experimentally\ntest the resistance property of bulk YbB6 to verify its topological property.\nBy changing the thickness of YbB6, I found out that although the data curves\ndid not completely conform to the theory of topology, the experimental\nobservation to the overall trend showed a similar topological phenomenon.",
    "authors": [
      "Weiwei Wu"
    ],
    "publication_date": "2019-10-04T17:31:20Z",
    "arxiv_id": "http://arxiv.org/abs/1910.02056v1",
    "download_url": "http://arxiv.org/abs/1910.02056v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some properties of I*-sequential topological space",
    "abstract": "In this paper, we will define $\\mathcal{I}^{*}$-sequential topology on a\ntopological space $(X,\\tau)$ where $\\mathcal{I}$ is an ideal of the subset of\nnatural numbers $\\mathbb{N}$. Besides the basic properties of the\n$\\mathcal{I}^{*}$-sequential topology, we proved that\n$\\mathcal{I}^{*}$-sequential topology is finer than $\\mathcal{I}$-sequential\ntopology. Further, we will discus main properties of $\\mathcal{I}^{*}$\nsequential continuity and $\\mathcal{I}^{*}$ sequential compactness.",
    "authors": [
      "H. Sabor Behmanush",
      "M. Kucukaslan"
    ],
    "publication_date": "2023-05-31T08:23:44Z",
    "arxiv_id": "http://arxiv.org/abs/2305.19647v1",
    "download_url": "http://arxiv.org/abs/2305.19647v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Equivariant Movability of Topological Groups",
    "abstract": "The equivariant movability of topological spaces with an action of a given\ntopological group $G$ is considered. In particular, the equivariant movability\nof topological groups is studied. It is proved that a second countable group\n$G$ is Lie if and only if it is equivariantly movable.",
    "authors": [
      "Pavel S. Gevorgyan"
    ],
    "publication_date": "2023-08-03T10:41:36Z",
    "arxiv_id": "http://arxiv.org/abs/2308.01679v1",
    "download_url": "http://arxiv.org/abs/2308.01679v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$κ$-Borel sets, $κ$-Baire spaces, and filtrations between\n  topologies",
    "abstract": "Filtrations are certain transfinite sequences of topologies increasing in\nstrength and interpolating between two given topologies $\\sigma$ and $\\tau$,\nwith $\\tau$ being stronger than $\\sigma$. We prove general results on\nstabilization at $\\tau$ of filtrations interpolating between $\\sigma$ and\n$\\tau$. These topological results involve an interplay between $\\kappa$-Borel\nsets with respect to the topology $\\sigma$ and $\\kappa$-Baireness of the\ntopology $\\tau$.",
    "authors": [
      "Sławomir Solecki"
    ],
    "publication_date": "2024-07-14T09:30:02Z",
    "arxiv_id": "http://arxiv.org/abs/2407.10130v1",
    "download_url": "http://arxiv.org/abs/2407.10130v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rational sequential parametrized topological complexity",
    "abstract": "Sequential parametrized topological complexity is a numerical homotopy\ninvariant of a fibration, which arose in the robot motion planning problem with\nexternal constraints. In this paper, we study sequential parametrized\ntopological complexity in view of rational homotopy theory. We generalize\nresults on topological complexity, and in particular, give an explicit\nalgebraic upper bound for sequential parametrized topological complexity when a\nfibration admits a certain decomposition, which is a generalization of the\nresult of Hamoun, Rami and Vandembroucq on topological complexity.",
    "authors": [
      "Yuki Minowa"
    ],
    "publication_date": "2025-03-03T03:03:54Z",
    "arxiv_id": "http://arxiv.org/abs/2503.01123v1",
    "download_url": "http://arxiv.org/abs/2503.01123v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Existence and deformability of topological Morse functions",
    "abstract": "In the 1950s Morse defined the analogue of Morse functions for topological\nmanifolds. In many instances, when mathematicians are using techniques on\ntopological manifolds that appear to be Morse-theoretic in nature, there is a\ntopological Morse function implicit in the argument. Topological Morse\nfunctions are known to inherit most of the familiar properties of the usual\n(smooth) Morse functions, with two crucial exceptions: existence and\ndeformability. This paper gives a simple construction of continuous families of\ntopological Morse functions.",
    "authors": [
      "Ingrid Irmer"
    ],
    "publication_date": "2025-08-05T09:36:56Z",
    "arxiv_id": "http://arxiv.org/abs/2508.03260v1",
    "download_url": "http://arxiv.org/abs/2508.03260v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Brandt $λ^0$-extensions of monoids with zero",
    "abstract": "We study algebraic properties of the Brandt $\\lambda^0$-extensions of monoids\nwith zero and non-trivial homomorphisms between the Brandt\n$\\lambda^0$-extensions of monoids with zero. We introduce finite, compact\ntopological Brandt $\\lambda^0$-extensions of topological semigroups and\ncountably compact topological Brandt $\\lambda^0$-extensions of topological\ninverse semigroups in the class of topological inverse semigroups and establish\nthe structure of such extensions and non-trivial continuous homomorphisms\nbetween such topological Brandt $\\lambda^0$-extensions of topological monoids\nwith zero. We also describe a category whose objects are ingredients in the\nconstructions of finite (compact, countably compact) topological Brandt\n$\\lambda^0$-extensions of topological monoids with zeros.",
    "authors": [
      "Oleg Gutik",
      "Dušan Repovš"
    ],
    "publication_date": "2009-10-03T10:25:08Z",
    "arxiv_id": "http://arxiv.org/abs/0910.0535v1",
    "download_url": "http://arxiv.org/abs/0910.0535v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Homotopy Groups",
    "abstract": "D. K. Biss (Topology and its Applications 124 (2002) 355-371) introduced the\ntopological fundamental group and presented some interesting basic properties\nof the notion. In this article we intend to extend the above notion to homotopy\ngroups and try to prove some similar basic properties of the topological\nhomotopy groups. We also study more on the topology of the topological homotopy\ngroups in order to find necessary and sufficient conditions for which the\ntopology is discrete. Moreover, we show that studying topological homotopy\ngroups may be more useful than topological fundamental groups.",
    "authors": [
      "Helen Ghane",
      "Zainab Hamed",
      "Behrooz Mashayekhy",
      "Hanieh Mirebrahimi"
    ],
    "publication_date": "2011-02-01T09:06:37Z",
    "arxiv_id": "http://arxiv.org/abs/1102.0102v1",
    "download_url": "http://arxiv.org/abs/1102.0102v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Majorana Lattice Model: Induced \"Topological Superconductor\"\n  on Topological Superconductor with Vortex-lattice",
    "abstract": "In this paper we study an s-wave topological SC with a square vortex-lattice.\nWe proposed a topological Majorana lattice model to describe this topological\nstate. We found that the Majorana lattice model is really a \"topological SC\" on\nthe parent topological SC. Such correspondence between the Majorana lattice\nmodel and the topological SC with vortex-lattice is another holographic feature\nof the topological state. In addition, the numerical calculations confirm our\ntheoretical prediction.",
    "authors": [
      "Jiang Zhou",
      "Ya-Jie Wu",
      "Rong-Wu Li",
      "Jing He",
      "Su-Peng Kou"
    ],
    "publication_date": "2012-11-13T13:31:34Z",
    "arxiv_id": "http://arxiv.org/abs/1211.2989v2",
    "download_url": "http://arxiv.org/abs/1211.2989v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Hierarchy Insulators and Topological Fractal Insulators",
    "abstract": "Topological insulators are new states of quantum matter with metallic\nedge/surface states. In this paper, we pointed out that there exists a new type\nof particle-hole symmetry-protected topological insulator - topological\nhierarchy insulator (THI), a composite topological state of a (parent)\ntopological insulator and its defect-induced topological mid-gap states. A\nparticular type of THI is topological fractal insulator, that is a THI with\nself-similar topological structure. In the end, we discuss the possible\nexperimental realizations of THIs.",
    "authors": [
      "Jing He",
      "Chun-Li Zang",
      "Ying Liang",
      "Su-Peng Kou"
    ],
    "publication_date": "2015-06-05T11:58:53Z",
    "arxiv_id": "http://arxiv.org/abs/1509.06706v1",
    "download_url": "http://arxiv.org/abs/1509.06706v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Each topological group embeds into a duoseparable topological group",
    "abstract": "A topological group $X$ is called $duoseparable$ if there exists a countable\nset $S\\subseteq X$ such that $SUS=X$ for any neighborhood $U\\subseteq X$ of the\nunit. We construct a functor $F$ assigning to each (abelian) topological group\n$X$ a duoseparable (abelain-by-cyclic) topological group $FX$, containing an\nisomorphic copy of $X$. In fact, the functor $F$ is defined on the category of\nunital topologized magmas. Also we prove that each $\\sigma$-compact locally\ncompact abelian topological group embeds into a duoseparable locally compact\nabelian-by-countable topological group.",
    "authors": [
      "Taras Banakh",
      "Igor Guran",
      "Alex Ravsky"
    ],
    "publication_date": "2020-02-14T19:44:24Z",
    "arxiv_id": "http://arxiv.org/abs/2002.06232v2",
    "download_url": "http://arxiv.org/abs/2002.06232v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Time-reversal symmetric topological metal",
    "abstract": "Topological metals possess gapless band structures accompanied with\nnontrivial edge states. Topological metals are created from the topological\ninsulators by adjusting the magnetic flux. Here we propose the time-reversal\nsymmetry protected topological metal without employing the magnetic flux.\nTopological metallic phase presents although the Chern number vanishes. In the\ntopologically nontrivial phase, three different cases in the metallic phase are\ndistinguished from the band-touching and in-gap features of the topological\nedge states. These findings shed light on the time-reversal symmetric\ntopological metals and greatly simplify the realization of topological metals.",
    "authors": [
      "L. C. Xie",
      "H. C. Wu",
      "L. Jin",
      "Z. Song"
    ],
    "publication_date": "2021-10-30T02:47:11Z",
    "arxiv_id": "http://arxiv.org/abs/2111.00150v1",
    "download_url": "http://arxiv.org/abs/2111.00150v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological spaces related with topological quasigroups",
    "abstract": "The article is devoted to a structure of topological spaces related with\ntopological quasigroups. Regular and complete spaces over topological\nquasigroups are studied. Separations and embeddings are also investigated for\nthem. Their homeomorphisms and isomorphisms, relations between\ncompactifications and completeness are scrutinized over topological\nquasigroups. There are investigated applications to families of maps over\ntopological quasigroups, restrictions of mappings, their openness, continuous\nbijections. Necessary theorems about topological quasigroups are proved.",
    "authors": [
      "S. V. Ludkowski"
    ],
    "publication_date": "2023-12-27T20:54:42Z",
    "arxiv_id": "http://arxiv.org/abs/2312.16716v1",
    "download_url": "http://arxiv.org/abs/2312.16716v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tuning the Delicate Topology of Topological Phases",
    "abstract": "We present a unified framework to systematically embed complex knotted and\nlinked structures, beyond the torus family, into diverse topological phases,\nincluding Hopf insulators, classical spin liquids, topological semimetals, and\nnon-Hermitian metals. Using rational maps and level sets of complex\npolynomials, we explicitly construct new topological models exhibiting rich and\npreviously inaccessible textures. These topological features manifest\ndistinctly across physical systems: emergent magnetic field lines in Hopf\ninsulators directly reflect the rational-map topology, paralleling topological\nelectromagnetism, while in classical spin liquids the topology is\nexperimentally accessible via the equal-time structure factor. Our approach\nthus provides both a conceptual unification of previously disconnected systems\nand a practical toolset for realizing and detecting intricate topological\ntextures in experiments.",
    "authors": [
      "Snigdh Sabharwal"
    ],
    "publication_date": "2025-03-26T02:06:13Z",
    "arxiv_id": "http://arxiv.org/abs/2503.20152v1",
    "download_url": "http://arxiv.org/abs/2503.20152v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A note on intrinsic topologies of groups",
    "abstract": "We investigate topologies on groups which arise naturally from their\nalgebraic structure, including the Frech\\'et-Markov, Hausdorff-Markov, and\nvarious kinds of Zariski topologies. Answering a question by Dikranjan and\nToller, we show that there exists a countable abelian group in which no bounded\nversion of the Zariski topology coincides with the full Zariski topology.\nComplementing a recent result by Goffer and Greenfeld, we show that on any\ngroup with no algebraicity the semigroup Zariski topology is hyperconnected and\nhence, in many cases, is distinct from the group Zariski topology. Finally, we\nshow that on the symmetric groups, the semigroup Hausdorff-Markov topology\ncoincides with the topology of pointwise convergence.",
    "authors": [
      "S. Bardyla",
      "L. Elliott",
      "J. D. Mitchell",
      "Y. Péresse"
    ],
    "publication_date": "2025-06-13T06:50:27Z",
    "arxiv_id": "http://arxiv.org/abs/2506.11500v2",
    "download_url": "http://arxiv.org/abs/2506.11500v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lectures on controlled topology: mapping cylinder neighborhoods",
    "abstract": "The existence theorem for mapping cylinder neighborhoods is discussed as a\nprototypical example of controlled topology and its applications. The first of\na projected series developed from lectures at the Summer School on\nHigh-Dimensional Topology, Trieste Italy 2001",
    "authors": [
      "Frank Quinn"
    ],
    "publication_date": "2002-01-22T19:58:28Z",
    "arxiv_id": "http://arxiv.org/abs/math/0201212v1",
    "download_url": "http://arxiv.org/abs/math/0201212v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some equivalences for Martin's Axiom in asymmetric topology",
    "abstract": "We find some statements in the language of asymmetric topology and continuous\npartial orders which are equivalent to the statements $\\kappa < \\mathfrak m$ or\n$\\kappa < \\mathfrak p$.",
    "authors": [
      "Bruce S. Burdick"
    ],
    "publication_date": "2002-04-10T15:16:36Z",
    "arxiv_id": "http://arxiv.org/abs/math/0204116v1",
    "download_url": "http://arxiv.org/abs/math/0204116v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the existence of high index topologically minimal surfaces",
    "abstract": "The topological index of a surface was previously introduced by the first\nauthor as the topological analogue of the index of an unstable minimal surface.\nHere we show that surfaces of arbitrarily high topological index exist.",
    "authors": [
      "David Bachman",
      "Jesse Johnson"
    ],
    "publication_date": "2009-09-14T23:23:21Z",
    "arxiv_id": "http://arxiv.org/abs/0909.2693v1",
    "download_url": "http://arxiv.org/abs/0909.2693v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonstandard Topology without Logic, Ultrafilters as infinitesimal points\n  in topological space",
    "abstract": "Nonstandard analysis is very complex, so finding a simple description of\ninfinitesimal points will be useful. In this paper, ultrafilters as\ninfinitesimal points in a topological space will be proposed, and some\ntopological concepts is restated by this tools.",
    "authors": [
      "M. Akbari Tootkaboni"
    ],
    "publication_date": "2013-02-13T20:13:41Z",
    "arxiv_id": "http://arxiv.org/abs/1302.3205v1",
    "download_url": "http://arxiv.org/abs/1302.3205v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological entropy for automorphisms of totally disconnected locally\n  compact groups",
    "abstract": "We give a \"limit-free formula\" simplifying the computation of the topological\nentropy for topological automorphisms of totally disconnected locally compact\ngroups. This result allows us to extend several basic properties of the\ntopological entropy known to hold for compact groups.",
    "authors": [
      "Anna Giordano Bruno"
    ],
    "publication_date": "2014-01-15T09:11:28Z",
    "arxiv_id": "http://arxiv.org/abs/1401.3523v1",
    "download_url": "http://arxiv.org/abs/1401.3523v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Induced topological pressure for topological dynamical(to appear in JPM)",
    "abstract": "In this paper, inspired by the article [5], we introduce the induced\ntopological pressure for a topological dynamical system. In particular, we\nprove a variational principle for the induced topological pressure.",
    "authors": [
      "Zhitao Xing",
      "Ercai Chen"
    ],
    "publication_date": "2015-02-08T02:24:11Z",
    "arxiv_id": "http://arxiv.org/abs/1502.02204v1",
    "download_url": "http://arxiv.org/abs/1502.02204v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]