[
  {
    "title": "Hopf algebras with the dual Chevalley property of discrete corepresentation type",
    "abstract": "We try to classify Hopf algebras with the dual Chevalley property of discrete corepresentation type over an algebraically closed field $\\Bbb{k}$ with characteristic 0. For such Hopf algebra $H$, we characterize the link quiver of $H$ and determine the structures of the link-indecomposable component $H_{(1)}$ containing $\\Bbb{k}1$. Besides, we construct an infinite-dimensional non-pointed non-cosemisimple link-indecomposable Hopf algebra $H(e_{\\pm 1}, f_{\\pm 1}, u, v)$ with the dual Chevalley property of discrete corepresentation type.",
    "authors": [
      "Jing Yu",
      "Gongxiang Liu"
    ],
    "publication_date": "2024-09-30T13:52:32Z",
    "arxiv_id": "http://arxiv.org/abs/2409.20292v2",
    "download_url": "https://arxiv.org/abs/2409.20292v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of Galois objects of Uq(g) up to homotopy equivalence",
    "abstract": "For any Drinfeld-Jimbo quantum enveloping algebra Uq(g) and for any family $λ=(λ\\_{ij})\\_{1\\leq i < j\\leq t} \\in k^{\\star}$ of invertible elements of the base field, we explicitly construct a Galois object $A\\_λ$ of Uq(g) by generators and relations and we prove that any Galois object of Uq(g) is homotopic to a unique object of type $A\\_λ$.",
    "authors": [
      "Thomas Aubriot"
    ],
    "publication_date": "2005-03-15T20:55:23Z",
    "arxiv_id": "http://arxiv.org/abs/math/0503312v3",
    "download_url": "https://arxiv.org/abs/math/0503312v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PostLie algebra structures on the Lie algebra sl(2,C)",
    "abstract": "The PostLie algebra is an enriched structure of the Lie algebra that has recently arisen from operadic study. It is closely related to pre-Lie algebra, Rota-Baxter algebra, dendriform trialgebra, modified classical Yang-Baxter equations and integrable systems. We give a complete classification of PostLie algebra structures on the Lie algebra sl(2,C) up to isomorphism. We first reduce the classification problem to solving an equation of 3 x 3 matrices. To solve the latter problem, we make use of the classification of complex symmetric matrices up to the congruent action of orthogonal groups.",
    "authors": [
      "Yu Pan",
      "Qing Liu",
      "Chengming Bai",
      "Li Guo"
    ],
    "publication_date": "2011-11-26T01:26:03Z",
    "arxiv_id": "http://arxiv.org/abs/1111.6128v1",
    "download_url": "https://arxiv.org/abs/1111.6128v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-dimensional modules for the polynomial ring in one variable as a vertex algebra",
    "abstract": "A commutative associative algebra $A$ over ${\\mathbb C}$ with a derivation is one of the simplest examples of a vertex algebra. However, the differences between the modules for $A$ as a vertex algebra and the modules for $A$ as an associative algebra are not well understood.\n  In this paper, I give the classification of finite-dimensional indecomposable untwisted or twisted modules for the polynomial ring in one variable over ${\\mathbb C}$ as a vertex algebra.",
    "authors": [
      "Kenichiro Tanabe"
    ],
    "publication_date": "2007-09-03T11:04:05Z",
    "arxiv_id": "http://arxiv.org/abs/0709.0188v1",
    "download_url": "https://arxiv.org/abs/0709.0188v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$q$-Wedge Modules for Quantized Enveloping Algebras of Classical Type",
    "abstract": "We use the fusion construction in the twisted quantum affine algebras to obtain a unified method to deform the wedge product for classical Lie algebras. As a byproduct we uniformly realize all non-spin fundamental modules for quantized enveloping algebras of classical types, and show that they admit natural crystal bases as modules for the (derived) twisted quantum affine algebra. These crystal bases are parametrized in terms of the $q$-wedge products.",
    "authors": [
      "Naihuan Jing",
      "Kailash C. Misra",
      "Masato Okado"
    ],
    "publication_date": "1998-11-03T23:06:28Z",
    "arxiv_id": "http://arxiv.org/abs/math/9811013v1",
    "download_url": "https://arxiv.org/abs/math/9811013v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bipartite graphs whose edge algebras are complete intersections",
    "abstract": "Let R be monomial sub-algebra of $k[x_1,...,x_N]$ generated by square free monomials of degree two. This paper addresses the following question: when is R a complete intersection?\n  For such a k-algebra we can associate a graph G whose vertices are $x_1,...,x_N$ and whose edges are $\\{(x_i, x_j) | x_i x_j \\in R \\}$. Conversely, for any graph G with vertices $\\{x_1,...,x_N\\}$ we define the {\\it edge algebra associated with G} as the sub-algebra of $k[x_1,...,x_N]$ generated by the monomials ${x_i x_j | (x_i,x_j) \\text{is an edge of} G}$. We denote this monomial algebra by k[G].\n  This paper describes all bipartite graphs whose edge algebras are complete intersections.",
    "authors": [
      "Mordechai Katzman"
    ],
    "publication_date": "2002-09-25T17:53:57Z",
    "arxiv_id": "http://arxiv.org/abs/math/0209348v1",
    "download_url": "https://arxiv.org/abs/math/0209348v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Divided Power Algebra, q-Derivatives and Some New Quantum Groups",
    "abstract": "The discussions in the present paper arise from exploring intrinsically the structure nature of the quantum $n$-space. A kind of braided category $\\Cal {GB}$ of $\\La$-graded $þ$-commutative associative algebras over a field $k$ is established. The quantum divided power algebra over $k$ related to the quantum $n$-space is introduced and described as a braided Hopf algebra in $\\Cal {GB}$ (in terms of its 2-cocycle structure), over which the so called special $q$-derivatives are defined so that several new interesting quantum groups, especially, the quantized polynomial algebra in $n$ variables (as the quantized universal enveloping algebra of the abelian Lie algebra of dimension $n$), and the quantum group associated to the quantum $n$-space, are derived from our approach independently of using the $R$-matrix. As a verification of its validity of our discussion, the quantum divided power algebra is equipped with a structure of $U_q(\\frak {sl}_n)$-module algebra via a certain $q$-differential operators realization. Particularly, one of the four kinds of roots vectors of $U_q(\\frak {sl}_n)$ in the sense of Lusztig can be specified precisely under the realization.",
    "authors": [
      "Naihong Hu"
    ],
    "publication_date": "2009-02-17T08:32:09Z",
    "arxiv_id": "http://arxiv.org/abs/0902.2858v1",
    "download_url": "https://arxiv.org/abs/0902.2858v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Skew polynomial algebras with coefficients in Koszul Artin-Schelter regular algebras",
    "abstract": "Let $A$ be a Koszul Artin-Schelter regular algebra with Nakayama automorphism $ξ$. We show that the Yoneda Ext-algebra of the skew polynomial algebra $A[z;ξ]$ is a trivial extension of a Frobenius algebra. Then we prove that $A[z;ξ]$ is Calabi-Yau; and hence each Koszul Artin Schelter regular algebra is a subalgebra of a Koszul Calabi-Yau algebra. A superpotential $\\hat{w}$ is also constructed so that the Calabi-Yau algebra $A[z;ξ]$ is isomorphic to the derivation quotient of $\\hat{w}$. The Calabi-Yau property of a skew polynomial algebra with coefficients in a PBW-deformation of a Koszul Artin-Schelter regular algebra is also discussed.",
    "authors": [
      "Jiwei He",
      "Fred Van Oystaeyen",
      "Yinhuo Zhang"
    ],
    "publication_date": "2013-04-13T11:13:46Z",
    "arxiv_id": "http://arxiv.org/abs/1304.3799v2",
    "download_url": "https://arxiv.org/abs/1304.3799v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Hopf Algebras and Their Generalizations",
    "abstract": "We survey Hopf algebras and their generalizations. In particular, we compare and contrast three well-studied generalizations (quasi-Hopf algebras, weak Hopf algebras, and Hopf algebroids), and two newer ones (Hopf monads and hopfish algebras). Each of these notions was originally introduced for a specific purpose within a particular context; our discussion favors applicability to the theory of dynamical quantum groups. Throughout the note, we provide several definitions and examples in order to make this exposition accessible to readers with differing backgrounds.",
    "authors": [
      "Gizem Karaali"
    ],
    "publication_date": "2007-03-15T02:57:29Z",
    "arxiv_id": "http://arxiv.org/abs/math/0703441v2",
    "download_url": "https://arxiv.org/abs/math/0703441v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Centrally Stable Algebras",
    "abstract": "We define an algebra $A$ to be centrally stable if, for every epimorhism $\\varphi$ from $A$ to another algebra $B$, the center $Z(B)$ of $B$ is equal to $\\varphi(Z(A))$, the image of the center of $A$. After providing some examples and basic observations, we consider in somewhat greater detail central stability in tensor products of algebras, and finally establish our main result which states that a finite-dimensional unital algebra $A$ over a perfect field $F$ is centrally stable if and only if $A$ is isomorphic to a direct product of algebras of the form $C_i\\otimes_{F_i}A_i$, where $F_i$ is a field extension of $F$, $C_i$ is a commutative $F_i$-algebra, and $A_i$ is a central simple $F_i$-algebra.",
    "authors": [
      "Matej Brešar",
      "Ilja Gogić"
    ],
    "publication_date": "2019-05-04T09:29:27Z",
    "arxiv_id": "http://arxiv.org/abs/1905.01463v2",
    "download_url": "https://arxiv.org/abs/1905.01463v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ring theoretical properties of affine cellular algebras",
    "abstract": "As a generalisation of Graham and Lehrer's cellular algebras, affine cellular algebras have been introduced in [12] in order to treat affine versions of diagram algebras like affine Hecke algebras of type A and affine Temperley-Lieb algebras in a unifying fashion. Affine cellular algebras include Kleshchev's graded quasihereditary algebras, KLR algebras and various other classes of algebras. In this paper we will study ring theoretical properties of affine cellular algebras. We show that any affine cellular algebra $A$ satisfies a polynomial identity. Furthermore, we show that $A$ can be embedded into its asymptotic algebra if the occurring commutative affine algebra $B_j$ are reduced and the determinants of the swich matrices are non-zero divisors. As a consequence, we show that the Gelfand-Kirillov dimension of $A$ is less than or equal to the largest Krull dimension of the algebras $B_j$ and that equality hold, in case all affine cell ideals are idempotent or if the Krull dimension of the algebras $B_j$ is less than or equal to $1$. Special emphasis is given to the question when an affine cell ideal is idempotent, generated by an idempotent or finitely generated.",
    "authors": [
      "Paula A. A. B. Carvalho",
      "Steffen Koenig",
      "Christian Lomp",
      "Armin Shalile"
    ],
    "publication_date": "2016-09-06T21:45:07Z",
    "arxiv_id": "http://arxiv.org/abs/1609.01771v1",
    "download_url": "https://arxiv.org/abs/1609.01771v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebras of quotients of path algebras",
    "abstract": "Leavitt path algebras are shown to be algebras of right quotients of their corresponding path algebras. Using this fact we obtain maximal algebras of right quotients from those (Leavitt) path algebras whose associated graph satisfies that every vertex connects to a line point (equivalently, the Leavitt path algebra has essential socle). We also introduce and characterize the algebraic counterpart of Toeplitz algebras.",
    "authors": [
      "Mercedes Siles Molina"
    ],
    "publication_date": "2007-01-23T10:18:05Z",
    "arxiv_id": "http://arxiv.org/abs/math/0701638v2",
    "download_url": "https://arxiv.org/abs/math/0701638v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An equivalence of two constructions of permutation-twisted modules for lattice vertex operator algebras",
    "abstract": "The problem of constructing twisted modules for a vertex operator algebra and an automorphism has been solved in particular in two contexts. One of these two constructions is that initiated by the third author in the case of a lattice vertex operator algebra and an automorphism arising from an arbitrary lattice isometry. This construction, from a physical point of view, is related to the space-time geometry associated with the lattice in the sense of string theory. The other construction is due to the first author, jointly with C. Dong and G. Mason, in the case of a multi-fold tensor product of a given vertex operator algebra with itself and a permutation automorphism of the tensor factors. The latter construction is based on a certain change of variables in the worldsheet geometry in the sense of string theory. In the case of a lattice that is the orthogonal direct sum of copies of a given lattice, these two very different constructions can both be carried out, and must produce isomorphic twisted modules, by a theorem of the first author jointly with Dong and Mason. In this paper, we explicitly construct an isomorphism, thereby providing, from both mathematical and physical points of view, a direct link between space-time geometry and worldsheet geometry in this setting.",
    "authors": [
      "Katrina Barron",
      "Yi-Zhi Huang",
      "James Lepowsky"
    ],
    "publication_date": "2006-09-22T21:59:54Z",
    "arxiv_id": "http://arxiv.org/abs/math/0609656v2",
    "download_url": "https://arxiv.org/abs/math/0609656v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Quantization of the Loday-Ronco Hopf Algebra",
    "abstract": "We propose a quantization algebra of the Loday-Ronco Hopf algebra $k[Y^\\infty]$, based on the Topological Recursion formula of Eynard and Orantin. We have shown in previous works that the Loday-Ronco Hopf algebra of planar binary trees is a space of solutions for the genus 0 version of Topological Recursion, and that an extension of the Loday Ronco Hopf algebra as to include some new graphs with loops is the correct setting to find a solution space for arbitrary genus. Here we show that this new algebra $k[Y^\\infty]_h$ is still a Hopf algebra that can be seen in some sense to be made precise in the text as a quantization of the Hopf algebra of planar binary trees, and that the solution space of Topological Recursion $\\mathcal{A}^h_{\\text{TopRec}}$ is a subalgebra of a quotient algebra $\\mathcal{A}_{\\text{Reg}}^h$ obtained from $k[Y^\\infty]_h$ that nevertheless doesn't inherit the Hopf algebra structure. We end the paper with a discussion on the cohomology of $\\mathcal{A}^h_{\\text{TopRec}}$ in low degree.",
    "authors": [
      "João N. Esteves"
    ],
    "publication_date": "2021-09-20T16:52:01Z",
    "arxiv_id": "http://arxiv.org/abs/2109.09680v2",
    "download_url": "https://arxiv.org/abs/2109.09680v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A differential U-module algebra for U=U_q sl(2) at an even root of unity",
    "abstract": "We show that the full matrix algebra Mat_p(C) is a U-module algebra for U = U_q sl(2), a 2p^3-dimensional quantum sl(2) group at the 2p-th root of unity. Mat_p(C) decomposes into a direct sum of projective U-modules P^+_n with all odd n, 1<=n<=p. In terms of generators and relations, this U-module algebra is described as the algebra of q-differential operators \"in one variable\" with the relations D z = q - q^{-1} + q^{-2} z D and z^p = D^p = 0. These relations define a \"parafermionic\" statistics that generalizes the fermionic commutation relations. By the Kazhdan--Lusztig duality, it is to be realized in a manifestly quantum-group-symmetric description of (p,1) logarithmic conformal field models. We extend the Kazhdan--Lusztig duality between U and the (p,1) logarithmic models by constructing a quantum de Rham complex of the new U-module algebra.",
    "authors": [
      "AM Semikhatov"
    ],
    "publication_date": "2008-08-31T19:19:32Z",
    "arxiv_id": "http://arxiv.org/abs/0809.0144v3",
    "download_url": "https://arxiv.org/abs/0809.0144v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rota-Baxter paired modules and their constructions from Hopf algebras",
    "abstract": "In this paper, we introduce the concept of a Rota-Baxter paired module to study Rota-Baxter modules without necessarily a Rota-Baxter operator. We obtain two characterizations of Rota-Baxter paired modules, and give some basic properties of Rota-Baxter paired modules. Beginning with the connection between the notion of integrals in the representations of Hopf algebra and of the notion of an integral algebra as a motivation and special case of Rota-Baxter algebra of weight zero, we obtain a large number of Rota-Baxter paired modules from Hopf related algebras and modules, including semisimple Hopf algebras, weak Hopf algebras, Long bialgebras, quasitriangular Hopf algebras, weak Hopf modules, dimodules and Doi-Hopf modules. Some of them give new examples of Rota-Baxter algebras.",
    "authors": [
      "Huihui Zheng",
      "Li Guo",
      "Liangyun Zhang"
    ],
    "publication_date": "2017-10-11T02:05:23Z",
    "arxiv_id": "http://arxiv.org/abs/1710.03880v1",
    "download_url": "https://arxiv.org/abs/1710.03880v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Singularities of locally acyclic cluster algebras",
    "abstract": "We show that locally acyclic cluster algebras have (at worst) canonical singularities. In fact, we prove that locally acyclic cluster algebras of positive characteristic are strongly F-regular. In addition, we show that upper cluster algebras are always Frobenius split by a canonically defined splitting, and that they have a free canonical module of rank one. We also give examples to show that not all upper cluster algebras are F-regular if the local acyclicity is dropped.",
    "authors": [
      "Angélica Benito",
      "Greg Muller",
      "Jenna Rajchgot",
      "Karen E. Smith"
    ],
    "publication_date": "2014-04-16T22:45:53Z",
    "arxiv_id": "http://arxiv.org/abs/1404.4399v1",
    "download_url": "https://arxiv.org/abs/1404.4399v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Free brace algebras are free prelie algebras",
    "abstract": "Let g be a free brace algebra. This structure implies that g is also a prelie algebra and a Lie algebra. It is already known that g is a free Lie algebra. We prove here that g is also a free prelie algebra, using a description of g with the help of planar rooted trees, a permutative product, and anipulations on the Poincaré-Hilbert series of g.",
    "authors": [
      "Loïc Foissy"
    ],
    "publication_date": "2008-09-17T07:42:39Z",
    "arxiv_id": "http://arxiv.org/abs/0809.2866v3",
    "download_url": "https://arxiv.org/abs/0809.2866v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Chains of Hopf Algebras with Quantum Double Cosymmetry",
    "abstract": "Given a finite dimensional C^*-Hopf algebra H and its dual H^ we construct the infinite crossed product A=... x H x H^ x H ... and study its superselection sectors in the framework of algebraic quantum field theory. A is the observable algebra of a generalized quantum spin chain with H-order and H^-disorder symmetries, where by a duality transformation the role of order and disorder may also appear interchanged. If H=\\CC G is a group algebra then A becomes an ordinary G-spin model. We classify all DHR-sectors of A --- relative to some Haag dual vacuum representation --- and prove that their symmetry is described by the Drinfeld double D(H). To achieve this we construct localized coactions ρ: A \\to (A \\otimes D(H)) and use a certain compressibility property to prove that they are universal amplimorphisms on A. In this way the double D(H) can be recovered from the observable algebra A as a universal cosymmetrty.",
    "authors": [
      "Florian Nill",
      "Kornel Szlachanyi"
    ],
    "publication_date": "1995-09-12T19:03:22Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9509100v2",
    "download_url": "https://arxiv.org/abs/hep-th/9509100v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Virasoro algebra and wreath product convolution",
    "abstract": "We present a group theoretic construction of the Virasoro algebra in the framework of wreath products. This can be regarded as a counterpart of a geometric construction of Lehn in the theory of Hilbert schemes of points on a surface.",
    "authors": [
      "Igor Frenkel",
      "Weiqiang Wang"
    ],
    "publication_date": "2000-06-12T15:12:35Z",
    "arxiv_id": "http://arxiv.org/abs/math/0006087v2",
    "download_url": "https://arxiv.org/abs/math/0006087v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A decomposition Theorem for pointed braided Hopf algebras",
    "abstract": "A known fundamental Theorem for braided pointed Hopf algebras states that for each coideal subalgebra, that fulfils a few properties, there is an associated quotient coalgebra right module such that the braided Hopf algebra can be decomposed into a tensor product of these two. Often one considers braided Hopf algebras in a Yetter-Drinfeld category of an ordinary Hopf algebra. In this case the braided Hopf algebra is in particular a comodule, as well as many interesting coideal subalgebras. We extend the mentioned Theorem by proving that the decomposition is compatible with this comodule structure if the underlying ordinary Hopf algebra is cosemisimple.",
    "authors": [
      "Istvan Heckenberger",
      "Katharina Schäfer"
    ],
    "publication_date": "2022-09-23T12:03:55Z",
    "arxiv_id": "http://arxiv.org/abs/2209.11543v1",
    "download_url": "https://arxiv.org/abs/2209.11543v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PBW for an inclusion of Lie algebras",
    "abstract": "Let h \\subset g be an inclusion of Lie algebras with quotient h-module n. There is a natural degree filtration on the h-module U(g)/U(g)h whose associated graded h-module is isomorphic to S(n). We give a necessary and sufficient condition for the existence of a splitting of this filtration. In turn such a splitting yields an isomorphism between the h-modules U(g)/U(g)h and S(n). For the diagonal embedding h \\subset h \\oplus h the condition is automatically satisfied and we recover the classical Poincae-Birkhoff-Witt theorem.\n  The main theorem and its proof are direct translations of results in algebraic geometry, obtained using an ad hoc dictionary. This suggests the existence of a unified framework allowing the simultaneous study of Lie algebras and of algebraic varieties, and a closely related work in this direction is on the way.",
    "authors": [
      "Damien Calaque",
      "Andrei Caldararu",
      "Junwu Tu"
    ],
    "publication_date": "2010-10-05T19:08:46Z",
    "arxiv_id": "http://arxiv.org/abs/1010.0985v2",
    "download_url": "https://arxiv.org/abs/1010.0985v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genus $g$ Zhu Recursion for Vertex Operator Algebras and Their Modules",
    "abstract": "We describe Zhu recursion for a vertex operator algebra (VOA) and its modules on a genus $g$ Riemann surface in the Schottky uniformisation. We show that $n$-point (intertwiner) correlation functions are written as linear combinations of $(n-1)$-point functions with universal coefficients given by derivatives of the differential of the third kind, the Bers quasiform and certain holomorphic forms. We use this formula to describe conformal Ward identities framed in terms of a canonical differential operator which acts with respect to the Schottky moduli and to the insertion points of the $n$-point function. We consider the generalised Heisenberg VOA and determine all its correlation functions by Zhu recursion. We also use Zhu recursion to derive linear partial differential equations for the Heisenberg VOA partition function and various structures such as the bidifferential of the second kind, holomorphic $1$-forms, the prime form and the period matrix. Finally, we compute the genus $g$ partition function for any rational Euclidean lattice generalised VOA.",
    "authors": [
      "Michael P. Tuite",
      "Michael Welby"
    ],
    "publication_date": "2023-12-21T10:30:32Z",
    "arxiv_id": "http://arxiv.org/abs/2312.13717v2",
    "download_url": "https://arxiv.org/abs/2312.13717v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weyl algebras for quantum homogeneous spaces",
    "abstract": "We present a new family of quantum Weyl algebras where the polynomial part is the quantum analog of functions on homogeneous spaces corresponding to symmetric matrices, skew symmetric matrices, and the entire space of matrices of a given size. The construction uses twisted tensor products and their deformations combined with invariance properties derived from quantum symmetric pairs. These quantum Weyl algebras admit $U_q(\\mathfrak{gl}_N)$-module algebra structures compatible with standard ones on the polynomial part, have relations that are expressed nicely via matrices, and are closely related to an algebra arising in the theory of quantum bounded symmetric domains.",
    "authors": [
      "Gail Letzter",
      "Siddhartha Sahi",
      "Hadi Salmasian"
    ],
    "publication_date": "2022-11-07T19:37:20Z",
    "arxiv_id": "http://arxiv.org/abs/2211.03833v1",
    "download_url": "https://arxiv.org/abs/2211.03833v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Skein and cluster algebras of unpunctured surfaces for $\\mathfrak{sl}_3$",
    "abstract": "For an unpunctured marked surface $Σ$, we consider a skein algebra $\\mathscr{S}_{\\mathfrak{sl}_{3},Σ}^{q}$ consisting of $\\mathfrak{sl}_3$-webs on $Σ$ with the boundary skein relations at marked points. We construct a quantum cluster algebra $\\mathscr{A}^q_{\\mathfrak{sl}_3,Σ}$ inside the skew-field $\\mathrm{Frac}\\mathscr{S}_{\\mathfrak{sl}_{3},Σ}^{q}$ of fractions, which quantizes the cluster $K_2$-structure on the moduli space $\\mathcal{A}_{SL_3,Σ}$ of decorated $SL_3$-local systems on $Σ$. We show that the cluster algebra $\\mathscr{A}^q_{\\mathfrak{sl}_3,Σ}$ contains the boundary-localized skein algebra $\\mathscr{S}_{\\mathfrak{sl}_{3},Σ}^{q}[\\partial^{-1}]$ as a subalgebra, and their natural structures, such as gradings and certain group actions, agree with each other. We also give an algorithm to compute the Laurent expressions of a given $\\mathfrak{sl}_3$-web in certain clusters and discuss the positivity of coefficients. In particular, we show that the bracelets and the bangles along an oriented simple loop in $Σ$ have Laurent expressions with positive coefficients, hence give rise to quantum GS-universally positive Laurent polynomials.",
    "authors": [
      "Tsukasa Ishibashi",
      "Wataru Yuasa"
    ],
    "publication_date": "2021-01-03T15:37:47Z",
    "arxiv_id": "http://arxiv.org/abs/2101.00643v4",
    "download_url": "https://arxiv.org/abs/2101.00643v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cluster algebras and category O for representations of Borel subalgebras of quantum affine algebras",
    "abstract": "Let $\\mathcal{O}$ be the category of representations of the Borel subalgebra of a quantum affine algebra introduced by Jimbo and the first author. We show that the Grothendieck ring of a certain monoidal subcategory of $\\mathcal{O}$ has the structure of a cluster algebra of infinite rank, with an initial seed consisting of prefundamental representations. In particular, the celebrated Baxter relations for the 6-vertex model get interpreted as Fomin-Zelevinsky mutation relations.",
    "authors": [
      "David Hernandez",
      "Bernard Leclerc"
    ],
    "publication_date": "2016-03-16T10:02:36Z",
    "arxiv_id": "http://arxiv.org/abs/1603.05014v2",
    "download_url": "https://arxiv.org/abs/1603.05014v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic shifting of finite graphs",
    "abstract": "In the present paper, exterior algebraic shifting and symmetric algebraic shifting of bipartite graphs and chordal graphs are studied. First, we will determine the symmetric algebraic shifted graph of complete bipartite graphs. It turns out that, for $a>3$ and $b>3$, the exterior algebraic shifted graph of the complete bipartite graph $K_{a,b}$ of size $a,b$ is different from the symmetric algebraic shifted graph of $K_{a,b}$. Second, we will show that the exterior algebraic shifted graph of any chordal graph $G$ is coincident with the symmetric algebraic shifted graph of $G$.",
    "authors": [
      "Satoshi Murai"
    ],
    "publication_date": "2005-05-02T13:38:47Z",
    "arxiv_id": "http://arxiv.org/abs/math/0505010v2",
    "download_url": "https://arxiv.org/abs/math/0505010v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modified traces for quasi-Hopf algebras",
    "abstract": "Let H be a finite-dimensional unimodular pivotal quasi-Hopf algebra over a field k, and let H-mod be the pivotal tensor category of finite-dimensional H-modules. We give a bijection between left (resp. right) modified traces on the tensor ideal H-pmod of projective modules and left (resp. right) cointegrals for H. The non-zero left/right modified traces are non-degenerate, and we show that non-degenerate left/right modified traces can only exist for unimodular H. This generalises results of Beliakova, Blanchet, and Gainutdinov from Hopf algebras to quasi-Hopf algebras. As an example we compute cointegrals and modified traces for the family of symplectic fermion quasi-Hopf algebras.",
    "authors": [
      "Johannes Berger",
      "Azat M. Gainutdinov",
      "Ingo Runkel"
    ],
    "publication_date": "2018-12-26T18:22:01Z",
    "arxiv_id": "http://arxiv.org/abs/1812.10445v2",
    "download_url": "https://arxiv.org/abs/1812.10445v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum quasi-shuffle algebras II. Explicit formulas, dualization, and representations",
    "abstract": "Using the concept of mixable shuffles, we formulate explicitly the quantum quasi-shuffle product, as well as the subalgebra generated by primitive elements of the quantum quasi-shuffle bialgebra. We construct a braided coalgebra structure which is dual to the quantum quasi-shuffle algebra. We provide representations of quantum quasi-shuffle algebras on commutative braided Rota-Baxter algebras. As an application, we establish a formal power series whose terms come from a special representation of some kind of quasi-shuffle algebra and whose evaluation at 1 is the multiple $q$-zeta values.",
    "authors": [
      "Run-Qiang Jian"
    ],
    "publication_date": "2013-02-24T09:37:55Z",
    "arxiv_id": "http://arxiv.org/abs/1302.5888v4",
    "download_url": "https://arxiv.org/abs/1302.5888v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The R-matrix presentation for the rational form of a quantized enveloping algebra",
    "abstract": "Let $U_q(\\mathfrak{g})$ denote the rational form of the quantized enveloping algebra associated to a complex simple Lie algebra $\\mathfrak{g}$. Let $λ$ be a nonzero dominant integral weight of $\\mathfrak{g}$, and let $V$ be the corresponding type $1$ finite-dimensional irreducible representation of $U_q(\\mathfrak{g})$. Starting from this data, the $R$-matrix formalism for quantum groups outputs a Hopf algebra $\\mathbf{U}_\\mathrm{R}^λ(\\mathfrak{g})$ defined in terms of a pair of generating matrices satisfying well-known quadratic matrix relations. In this paper, we prove that this Hopf algebra admits a Chevalley-Serre type presentation which can be recovered from that of $U_q(\\mathfrak{g})$ by adding a single invertible quantum Cartan element. We simultaneously establish that $\\mathbf{U}_\\mathrm{R}^λ(\\mathfrak{g})$ can be realized as a Hopf subalgebra of the tensor product of the space of Laurent polynomials in a single variable with the quantized enveloping algebra associated to the lattice generated by the weights of $V$. The proofs of these results are based on a detailed analysis of the homogeneous components of the matrix equations and generating matrices defining $\\mathbf{U}_\\mathrm{R}^λ(\\mathfrak{g})$, with respect to a natural grading by the root lattice of $\\mathfrak{g}$ compatible with the weight space decomposition of $\\mathrm{End}(V)$.",
    "authors": [
      "Matthew Rupert",
      "Curtis Wendlandt"
    ],
    "publication_date": "2023-06-16T17:06:03Z",
    "arxiv_id": "http://arxiv.org/abs/2306.09971v1",
    "download_url": "https://arxiv.org/abs/2306.09971v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lie algebras simple with respect to a Taft algebra action",
    "abstract": "We classify finite dimensional $H_{m^2}(ζ)$-simple $H_{m^2}(ζ)$-module Lie algebras $L$ over an algebraically closed field of characteristic $0$ where $H_{m^2}(ζ)$ is the $m$th Taft algebra. As an application, we show that despite the fact that $L$ can be non-semisimple in ordinary sense, $\\lim_{n\\to\\infty}\\sqrt[n]{c_n^{H_{m^2}(ζ)}(L)} = \\dim L$ where $c_n^{H_{m^2}(ζ)}(L)$ is the codimension sequence of polynomial $H_{m^2}(ζ)$-identities of $L$. In particular, the analog of Amitsur's conjecture holds for $c_n^{H_{m^2}(ζ)}(L)$.",
    "authors": [
      "Alexey Gordienko"
    ],
    "publication_date": "2017-05-16T17:22:33Z",
    "arxiv_id": "http://arxiv.org/abs/1705.05809v2",
    "download_url": "https://arxiv.org/abs/1705.05809v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integrals in Hopf algebras over rings",
    "abstract": "Integrals in Hopf algebras are an essential tool in studying finite dimensional Hopf algebras and their action on algebras. Over fields it has been shown by Sweedler that the existence of integrals in a Hopf algebra is equivalent to the Hopf algebra being finite dimensional. In this paper we examine how much of this is true for Hopf algebras over rings. We show that over any commutative ring R that is not a field there exists a Hopf algebra H over R containing a non-zero integral but not being finitely generated as R-module. On the contrary we show that Sweedler's equivalence is still valid for free Hopf algebras or projective Hopf algebras over integral domains. Analogously for a left H-module algebra A we study the influence of non-zero left A#H-linear maps from A to A#H on H being finitely generated as R-module. Examples and application to separability are given.",
    "authors": [
      "Christian Lomp"
    ],
    "publication_date": "2003-07-03T11:29:58Z",
    "arxiv_id": "http://arxiv.org/abs/math/0307046v1",
    "download_url": "https://arxiv.org/abs/math/0307046v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On associative algebras, modules and twisted modules for vertex operator algebras",
    "abstract": "We give a new construction of functors from the category of modules for the associative algebras $A_n(V)$ and $A_g(V)$ associated with a vertex operator algebra $V$, defined by Dong, Li and Mason, to the category of admissible $V$-modules and admissible twisted $V$-modules, respectively, using the method developed in the joint work \\cite{HY1} with Y.-Z. Huang. The functors were first constructed by Dong, Li and Mason, but the importance of the new method, as in \\cite{HY1}, is that we can apply the method to study objects without the commutator formula in the representation theory of vertex operator algebras.",
    "authors": [
      "Jinwei Yang"
    ],
    "publication_date": "2014-08-02T03:09:31Z",
    "arxiv_id": "http://arxiv.org/abs/1408.0329v2",
    "download_url": "https://arxiv.org/abs/1408.0329v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graded integral closures",
    "abstract": "It is investigated how graded variants of integral and complete integral closures behave under coarsening functors and under formation of group algebras.",
    "authors": [
      "Fred Rohrer"
    ],
    "publication_date": "2013-02-07T07:59:41Z",
    "arxiv_id": "http://arxiv.org/abs/1302.1659v2",
    "download_url": "https://arxiv.org/abs/1302.1659v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A formula for the multiplicity of the multi-graded extended Rees algebra",
    "abstract": "Our aim in this paper is to obtain a formula for the multiplicity of the maximal homogeneous ideal of the multi-graded extended Rees algebra. This formula generalizes the one obtained in [8] by Katz and Verma for the ordinary extended Rees algebra.",
    "authors": [
      "Clare D'Cruz"
    ],
    "publication_date": "2004-09-09T11:03:15Z",
    "arxiv_id": "http://arxiv.org/abs/math/0409156v1",
    "download_url": "https://arxiv.org/abs/math/0409156v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Special multserial algebras are quotients of symmetric special multiserial algebras",
    "abstract": "In this paper we give a new definition of symmetric special multiserial algebras in terms of defining cycles. As a consequence, we show that every special multiserial algebra is a quotient of a symmetric special multiserial algebra.",
    "authors": [
      "Edward L. Green",
      "Sibylle Schroll"
    ],
    "publication_date": "2016-01-04T15:57:24Z",
    "arxiv_id": "http://arxiv.org/abs/1601.00550v2",
    "download_url": "https://arxiv.org/abs/1601.00550v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The derivations of some evolution algebras",
    "abstract": "In this work we investigate the derivations of  $n-$dimensional complex evolution algebras, depending on the rank of the appropriate matrices. For evolution algebra with non-singular matrices we prove that the space of derivations is zero. The spaces of derivations for evolution algebras with matrices of rank $n-1$ are described.",
    "authors": [
      "L. M. Camacho",
      "J. R. Gómez",
      "B. A. Omirov",
      "R. M. Turdibaev"
    ],
    "publication_date": "2010-04-12T12:09:27Z",
    "arxiv_id": "http://arxiv.org/abs/1004.1936v1",
    "download_url": "https://arxiv.org/abs/1004.1936v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Howe Pairs in the Theory of Vertex Algebras",
    "abstract": "For any vertex algebra V and any subalgebra A of V, there is a new subalgebra of V known as the commutant of A in V. This construction was introduced by Frenkel-Zhu, and is a generalization of an earlier construction due to Kac-Peterson and Goddard-Kent-Olive known as the coset construction. In this paper, we interpret the commutant as a vertex algebra notion of invariant theory. We present an approach to describing commutant algebras in an appropriate category of vertex algebras by reducing the problem to a question in commutative algebra. We give an interesting example of a Howe pair (ie, a pair of mutual commutants) in the vertex algebra setting.",
    "authors": [
      "Bong H. Lian",
      "Andrew R. Linshaw"
    ],
    "publication_date": "2006-05-07T08:58:00Z",
    "arxiv_id": "http://arxiv.org/abs/math/0605174v3",
    "download_url": "https://arxiv.org/abs/math/0605174v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On some formality criteria for DG-Lie algebras",
    "abstract": "We give some formality criteria for a differential graded Lie algebra to be formal. For instance, we show that a DG-Lie algebra L is formal if and only if the natural spectral sequence computing the Chevalley-Eilenberg cohomology H(L,L) degenerates at second page.",
    "authors": [
      "Marco Manetti"
    ],
    "publication_date": "2013-10-11T08:25:16Z",
    "arxiv_id": "http://arxiv.org/abs/1310.3048v2",
    "download_url": "https://arxiv.org/abs/1310.3048v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "q-Deformed Clifford algebra and level zero fundamental representations of quantum affine algebras",
    "abstract": "We give a realization of the level zero fundamental weight representation $W(\\varpi_k)$ of the quantum affine algebra $U_q'(\\mf{g})$, when $\\mf{g}$ has a maximal parabolic subalgebra of type $C_n$. We define a semisimple $U'_q({\\mf g})$-module structure on $\\E^{\\otimes 2}$ in terms of q-deformed Clifford generators, where $\\E$ is the exterior algebra generated by a dual natural representation $V$ of $U_q(\\mf{sl}_{n})$. We show that each $W(\\varpi_k)$ appears as an irreducible summand (not necessarily multiplicity free) in $\\E^{\\otimes 2}$. As a byproduct, we obtain a simple description of the affine crystal structure of $W(\\varpi_k)$ in terms of $n\\times 2$ binary matrices and their $(\\mf{sl}_n,\\mf{sl}_2)$-bicrystal structure.",
    "authors": [
      "Jae-Hoon Kwon"
    ],
    "publication_date": "2013-04-15T04:09:26Z",
    "arxiv_id": "http://arxiv.org/abs/1304.3976v3",
    "download_url": "https://arxiv.org/abs/1304.3976v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Fomin--Kirillov Algebras for Complex Reflection Groups",
    "abstract": "This note is an application of classification results for finite-dimensional Nichols algebras over groups. We apply these results to generalizations of Fomin--Kirillov algebras to complex reflection groups. First, we focus on the case of cyclic groups where the corresponding Nichols algebras are only finite-dimensional up to order four, and we include results about the existence of Weyl groupoids and finite-dimensional Nichols subalgebras for this class. Second, recent results by Heckenberger--Vendramin [ArXiv e-prints, 1412.0857 (December 2014)] on the classification of Nichols algebras of semisimple group type can be used to find that these algebras are infinite-dimensional for many non-exceptional complex reflection groups in the Shephard--Todd classification.",
    "authors": [
      "Robert Laugwitz"
    ],
    "publication_date": "2016-05-01T09:49:56Z",
    "arxiv_id": "http://arxiv.org/abs/1605.00227v1",
    "download_url": "https://arxiv.org/abs/1605.00227v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "QED Hopf algebras on planar binary trees",
    "abstract": "In this paper we describe the Hopf algebras on planar binary trees used to renormalize the Feynman propagators of quantum electrodynamics, and the coaction which describes the renormalization procedure. Both structures are related to some semi-direct coproduct of Hopf algebras.",
    "authors": [
      "Christian Brouder",
      "Alessandra Frabetti"
    ],
    "publication_date": "2001-12-05T10:29:03Z",
    "arxiv_id": "http://arxiv.org/abs/math/0112043v1",
    "download_url": "https://arxiv.org/abs/math/0112043v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Normality and Related Properties of Forcing Algebras",
    "abstract": "We present a sufficient condition for irreducibility of forcing algebras and study the (non)-reducedness phenomenon. Furthermore, we prove a criterion for normality for forcing algebras over a polynomial base ring with coefficients in a perfect field. This gives a geometrical normality criterion for algebraic (forcing) varieties over algebraically closed fields. Besides, we examine in detail an specific (enlightening) example with several forcing equations. Finally, we compute explicitly the normalization of a particular forcing algebra by means of finding explicitly the generators of the ideal defining it as an affine ring.",
    "authors": [
      "Danny A. J. Gomez-Ramirez",
      "Holger Brenner"
    ],
    "publication_date": "2017-07-26T18:46:39Z",
    "arxiv_id": "http://arxiv.org/abs/1707.08605v1",
    "download_url": "https://arxiv.org/abs/1707.08605v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic connections on projective modules with prescribed curvature",
    "abstract": "In this paper we generalize classical results on Lie algebras and universal enveloping algebras of Lie algebras to Lie-Rinehart algebras. We define for any Lie-Rinehart algebra $L$ and any cocycle $f$ in $Z^2(L,B)$, a universal enveloping algebra $U(B,L,f)$ with the property that the category of left modules on $U(B,L,f)$ is equivalent to the category of modules with an $L$-connection where the curvature has \"type $f$\". A connection of curvature \"type $f$\" is a special case of a non-flat connection. We also study deformations of filtered algebras and prove a relationship between the deformation groupoid $A(\\operatorname{Sym}_B^*(L))$ of the Lie-Rinehart algebra $L$ and $H^2(L,B)$. We also give an explicit realization of the category of $L$-connections as a category of left modules on an associative ring $U(L)$. We use the associative ring $U(L)$ to give a definition of cohomology and homology of arbitrary $L$-Connections. In the construction of the ring $U(L)$ we implicitly introduce the notion \"D-Lie algebra\" for the first time.",
    "authors": [
      "Helge Øystein Maakestad"
    ],
    "publication_date": "2014-01-30T08:15:20Z",
    "arxiv_id": "http://arxiv.org/abs/1401.7760v9",
    "download_url": "https://arxiv.org/abs/1401.7760v9",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On braided Hopf structures on exterior algebras",
    "abstract": "We show that the exterior algebra of a vector space $V$ of dimension greater than one admits a one-parameter family of braided Hopf algebra structures, arising from its identification with a Nichols algebra. We explicitly compute the structure constants with respect to a natural set-theoretic basis.\n  A one-parameter family of diagonal automorphisms exists, which we use to construct solutions to the (constant) Yang--Baxter equation. These solutions are conjectured to give rise to the two-variable Links--Gould polynomial invariants associated with the super-quantum group $U_q(\\mathfrak{gl}(N|1))$, where $N = \\dim(V)$. We support this conjecture through computations for small values of $N$.",
    "authors": [
      "Rinat Kashaev",
      "Vladimir Mangazeev"
    ],
    "publication_date": "2025-05-21T14:23:37Z",
    "arxiv_id": "http://arxiv.org/abs/2505.15569v2",
    "download_url": "https://arxiv.org/abs/2505.15569v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The $F$-regularity of algebraic sets related to commutator matrices",
    "abstract": "We study the algebraic sets of pairs of matrices defined by the vanishing of the anti-diagonal as well as the cross-diagonal of their commutator matrix. We prove that, over a field of prime characterisitic, the coordinate ring of the latter is always $F$-regular and, with exactly one exception, so is that of the former, thus proving a conjecture of Kadyrsizova and Yerlanov.",
    "authors": [
      "Trung Chau"
    ],
    "publication_date": "2023-05-24T18:17:12Z",
    "arxiv_id": "http://arxiv.org/abs/2305.15487v1",
    "download_url": "https://arxiv.org/abs/2305.15487v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the regularity over positively graded algebras",
    "abstract": "We study the relationship between the Tor-regularity and the local-regularity over a positively graded algebra defined over a field which coincide if the algebra is a standard graded polynomial ring. In this case both are characterizations of the so-called Castelnuovo--Mumford regularity. Moreover, we can characterize a standard graded polynomial ring as an algebra with extremal properties with respect to the Tor- and the local-regularity. For modules of finite projective dimension we get a nice formula relating the two regularity notions. Interesting examples are given to help to understand the relationship between the Tor- and the local-regularity in general.",
    "authors": [
      "Tim Roemer"
    ],
    "publication_date": "2006-12-20T11:26:41Z",
    "arxiv_id": "http://arxiv.org/abs/math/0612581v2",
    "download_url": "https://arxiv.org/abs/math/0612581v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Triviality Theorems for Yetter-Drinfel'd Hopf Algebras",
    "abstract": "Under suitable assumptions on the base field, we prove that a commutative semisimple Yetter-Drinfel'd Hopf algebra over a finite abelian group is trivial, i.e., is an ordinary Hopf algebra, if its dimension is relatively prime to the order of the finite abelian group. Furthermore, we prove that a finite-dimensional cocommutative cosemisimple Yetter-Drinfel'd Hopf algebra contains a trivial Yetter-Drinfel'd Hopf subalgebra of dimension greater than one, at least if the Yetter-Drinfel'd Hopf algebra itself has dimension greater than one.",
    "authors": [
      "Yorck Sommerhaeuser"
    ],
    "publication_date": "2015-03-31T19:46:29Z",
    "arxiv_id": "http://arxiv.org/abs/1503.09181v2",
    "download_url": "https://arxiv.org/abs/1503.09181v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Partial $*$-algebraic quantum groups and Drinfeld doubles of partial compact quantum groups",
    "abstract": "We introduce a notion of partial algebraic quantum group. This is an important special case of a weak multiplier Hopf algebra with integrals, as introduced in the work of Van Daele and Wang. At the same time, it generalizes the notion of partial compact quantum group as introduced by De Commer and Timmermann. As an application, we show that the Drinfeld double of a partial compact quantum group can be defined as a partial $*$-algebraic quantum group.",
    "authors": [
      "Kenny De Commer",
      "Johan Konings"
    ],
    "publication_date": "2022-04-06T15:35:02Z",
    "arxiv_id": "http://arxiv.org/abs/2204.02900v2",
    "download_url": "https://arxiv.org/abs/2204.02900v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$RLL$-realization of two-parameter quantum affine algebra in type $C_n^{(1)}$",
    "abstract": "We establish an explicit correspondence between the Drinfeld current algebra presentation for the two-parameter quantum affine algebra $U_{r, s}(\\mathrm{C}_n^{(1)})$ and the $R$-matrix realization á la Faddeev, Reshetikhin and Takhtajan.",
    "authors": [
      "Xin Zhong",
      "Naihong Hu",
      "Naihuan Jing"
    ],
    "publication_date": "2024-05-10T16:54:00Z",
    "arxiv_id": "http://arxiv.org/abs/2405.06597v2",
    "download_url": "https://arxiv.org/abs/2405.06597v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Partially dualized Hopf algebras have equivalent Yetter-Drinfel'd modules",
    "abstract": "Given a Hopf algebra $H$ and a projection $H\\to A$ to a Hopf subalgebra, we construct a Hopf algebra $r(H)$, called the partial dualization of $H$, with a projection to the Hopf algebra dual to $A$. This construction provides powerful techniques in the general setting of braided monoidal categories. The construction comprises in particular the reflections of generalized quantum groups, arxiv:1111.4673 . We prove a braided equivalence between the Yetter-Drinfel'd modules over a Hopf algebra and its partial dualization.",
    "authors": [
      "Alexander Barvels",
      "Simon Lentner",
      "Christoph Schweigert"
    ],
    "publication_date": "2014-02-10T17:15:19Z",
    "arxiv_id": "http://arxiv.org/abs/1402.2214v1",
    "download_url": "https://arxiv.org/abs/1402.2214v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mathieu Subspaces of Associative Algebras",
    "abstract": "Motivated by the Mathieu conjecture [Ma], the image conjecture [Z3] and the well-known Jacobian conjecture [K] (see also [BCW] and [E]), the notion of Mathieu subspaces as a natural generalization of the notion of ideals has been introduced recently in [Z4] for associative algebras. In this paper, we first study algebraic elements in the radicals of Mathieu subspaces of associative algebras over fields and prove some properties and characterizations of Mathieu subspaces with algebraic radicals. We then give some characterizations or classifications for strongly simple algebras (the algebras with no non-trivial Mathieu subspaces) over arbitrary commutative rings, and for quasi-stable algebras (the algebras all of whose subspaces that do not contain the identity element of the algebra are Mathieu spaces) over arbitrary fields. Furthermore, co-dimension one Mathieu subspaces and the minimal non-trivial Mathieu subspaces of the matrix algebras over fields are also completely determined.",
    "authors": [
      "Wenhua Zhao"
    ],
    "publication_date": "2010-05-24T06:49:32Z",
    "arxiv_id": "http://arxiv.org/abs/1005.4260v2",
    "download_url": "https://arxiv.org/abs/1005.4260v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Identities of conformal algebras and pseudoalgebras",
    "abstract": "For a given conformal algebra $C$, we write down the correspondence between identities of the coefficient algebra $\\Coeff C$ and identities of $C$ itself as of pseudoalgebra. In particular, we write down the defining relations of Jordan, alternative and Mal'cev conformal algebras, and show that the analogue of Artin's Theorem does not hold for alternative conformal algebras.",
    "authors": [
      "Pavel Kolesnikov"
    ],
    "publication_date": "2004-12-20T09:27:09Z",
    "arxiv_id": "http://arxiv.org/abs/math/0412397v1",
    "download_url": "https://arxiv.org/abs/math/0412397v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prospecies of algebras I: Basic properties",
    "abstract": "In this paper, we generalise part of the theory of hereditary algebras to the context of prospecies of algebras. Here, a prospecies is a generalisation of Gabriel's concept of species gluing algebras via projective bimodules along a quiver to obtain a new algebra. This provides a categorical perspective on a recent paper by Geiß, Leclerc, and Schröer. In particular, we construct a corresponding preprojective algebra, and establish a theory of a separated prospecies yielding a stable equivalence between certain functorially finite subcategories.",
    "authors": [
      "Julian Külshammer"
    ],
    "publication_date": "2016-08-05T16:54:07Z",
    "arxiv_id": "http://arxiv.org/abs/1608.01934v2",
    "download_url": "https://arxiv.org/abs/1608.01934v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gorensteinness of invariant subrings of quantum algebras",
    "abstract": "We prove Auslander-Gorenstein and $\\GKdim$-Macaulay properties for certain invariant subrings of some quantum algebras, the Weyl algebras, and the universal enveloping algebras of finite dimensional Lie algebras.",
    "authors": [
      "Naihuan Jing",
      "James J. Zhang"
    ],
    "publication_date": "1998-10-27T17:08:15Z",
    "arxiv_id": "http://arxiv.org/abs/math/9810152v2",
    "download_url": "https://arxiv.org/abs/math/9810152v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On intertwining operators and finite automorphism groups of vertex operator algebras",
    "abstract": "Let V be a simple vertex operator algebra and G a finite automorphism group. We give a construction of intertwining operators for irreducible V^G-modules which occur as submodules of irreducible V-modules by using intertwining operators for V. We also determine some fusion rules for a vertex operator algebra as an application.",
    "authors": [
      "Kenichiro Tanabe"
    ],
    "publication_date": "2005-01-20T01:56:40Z",
    "arxiv_id": "http://arxiv.org/abs/math/0501312v1",
    "download_url": "https://arxiv.org/abs/math/0501312v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A generalization of intertwining operators for vertex operator algebras",
    "abstract": "We generalize the notion of an intertwining operator to N-graded weak modules over a vertex operator algebra and study their properties. We show a formula for the dimensions of these intertwining operators in terms of modules over the Zhu algebras under some conditions on N-graded weak modules.",
    "authors": [
      "Kenichiro Tanabe"
    ],
    "publication_date": "2016-03-04T01:57:18Z",
    "arxiv_id": "http://arxiv.org/abs/1603.01326v2",
    "download_url": "https://arxiv.org/abs/1603.01326v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Nichols algebras with standard braiding",
    "abstract": "The class of standard braided vector spaces, introduced by Andruskiewitsch and the author in \\texttt{arXiv:math/0703924v2} to understand the proof of a theorem of Heckenberger \\cite{H2}, is slightly more general than the class of braided vector spaces of Cartan type. In the present paper, we classify standard braided vector spaces with finite-dimensional Nichols algebra. For any such braided vector space, we give a PBW-basis, a closed formula of the dimension and a presentation by generators and relations of the associated Nichols algebra.",
    "authors": [
      "Iván Ezequiel Angiono"
    ],
    "publication_date": "2008-04-04T21:58:07Z",
    "arxiv_id": "http://arxiv.org/abs/0804.0816v1",
    "download_url": "https://arxiv.org/abs/0804.0816v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Edge contraction on dual ribbon graphs and 2D TQFT",
    "abstract": "We present a new set of axioms for 2D TQFT formulated on the category of cell graphs with edge-contraction operations as morphisms. We construct a functor from this category to the endofunctor category consisting of Frobenius algebras. Edge-contraction operations correspond to natural transformations of endofunctors, which are compatible with the Frobenius algebra structure. Given a Frobenius algebra A, every cell graph determines an element of the symmetric tensor algebra defined over the dual space A*. We show that the edge-contraction axioms make this assignment depending only on the topological type of the cell graph, but not on the graph itself. Thus the functor generates the TQFT corresponding to A.",
    "authors": [
      "Olivia Dumitrescu",
      "Motohico Mulase"
    ],
    "publication_date": "2015-08-24T19:31:15Z",
    "arxiv_id": "http://arxiv.org/abs/1508.05922v3",
    "download_url": "https://arxiv.org/abs/1508.05922v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The algebra $U_q(\\hat{sl}_\\infty)$ and applications",
    "abstract": "In this note we consider the algebra $U_q(\\hat{sl}_\\infty)$ and we study the category O of its integrable representations. The main motivations are applications to quantum toroidal algebras, more precisely predictions of character formulae for representations of quantum toroidal algebras. In this context, we state a general positivity conjecture for representations of $U_q(\\hat{sl}_\\infty)$ viewed as representations of quantum toroidal algebras, that we prove for Kirillov-Reshetikhin modules.",
    "authors": [
      "David Hernandez"
    ],
    "publication_date": "2010-01-18T12:59:01Z",
    "arxiv_id": "http://arxiv.org/abs/1001.3047v2",
    "download_url": "https://arxiv.org/abs/1001.3047v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Endomorphism Algebras and q-Traces",
    "abstract": "For a braided vector space $(V,σ)$ with braiding $σ$ of Hecke type, we introduce three associative algebra structures on the space $\\oplus_{p=0}^{M}\\mathrm{End}S_σ^p(V)$ of graded endomorphisms of the quantum symmetric algebra $S_σ(V)$. We use the second product to construct a new trace. This trace is an algebra morphism with respect to the third product. In particular, when $V$ is the fundamental representation of $\\mathcal{U}_{q}\\mathfrak{sl}_{N+1}$ and $σ$ is the action of the $R$-matrix, this trace is a scalar multiple of the quantum trace of type $A$.",
    "authors": [
      "Run-Qiang Jian"
    ],
    "publication_date": "2009-07-01T22:52:41Z",
    "arxiv_id": "http://arxiv.org/abs/0907.0257v3",
    "download_url": "https://arxiv.org/abs/0907.0257v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bijective 1-cocycles and classification of 3-dimensional Left-symmetric Algebras",
    "abstract": "Left-symmetric algebras have close relations with many important fields in mathematics and mathematical physics. Their classification is very complicated due to the nonassociativity. In this paper, we re-study the correspondence between left-symmetric algebras and the bijective 1-cocycles. Then a procedure is provided to classify left-symmetric algebras in terms of classification of equivalent classes of bijective 1-cocycles. As an example, the 3-dimensional complex left-symmetric algebras are classified.",
    "authors": [
      "Chengming Bai"
    ],
    "publication_date": "2007-10-13T14:32:42Z",
    "arxiv_id": "http://arxiv.org/abs/0710.2609v1",
    "download_url": "https://arxiv.org/abs/0710.2609v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Families of Artinian and one-dimensional algebras",
    "abstract": "The purpose of this paper is to study families of Artinian or one dimensional quotients of a polynomial ring $R$ with a special look to level algebras. Let $\\GradAlg^H(R)$ be the scheme parametrizing graded quotients of $R$ with Hilbert function $H$. Let $B \\to A$ be any graded surjection of quotients of $R$ with Hilbert function $H_B$ and $H_A$, and h-vectors $h_B=(1,h_1,...,h_j,...)$ and $h_A$, respectively. If $\\depth A = \\dim A \\leq 1$ and $A$ is a ``truncation'' of $B$ in the sense that $h_A=(1,h_1,...,h_{j-1},α,0,0,...)$ for some $α\\leq h_j$, then we show there is a close relationship between $\\GradAlg^{H_A}(R)$ and $\\GradAlg^{H_B}(R)$ concerning e.g. smoothness and dimension at the points $(A)$ and $(B)$ respectively, provided $B$ is a complete intersection or provided the Castelnuovo-Mumford regularity of $A$ is at least 3 (sometimes 2) larger than the regularity of $B$. In the complete intersection case we generalize this relationship to ``non-truncated'' Artinian algebras $A$ which are compressed or close to being compressed. For more general Artinian algebras we describe the dual of the tangent and obstruction space of deformations in a manageable form which we make rather explicit for level algebras of Cohen-Macaulay type 2. This description and a linkage theorem for families allow us to prove a conjecture of Iarrobino on the existence of at least two irreducible components of $\\GradAlg^H(R)$, $H=(1,3,6,10,14,10,6,2)$, whose general elements are Artinian level algebras of type 2.",
    "authors": [
      "Jan O. Kleppe"
    ],
    "publication_date": "2006-01-19T16:57:00Z",
    "arxiv_id": "http://arxiv.org/abs/math/0601477v1",
    "download_url": "https://arxiv.org/abs/math/0601477v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Hopf modules category and the Hopf equation",
    "abstract": "We study the Hopf equation which is equivalent to the pentagonal equation, from operator algebras. A FRT type theorem is given and new types of quantum groups are constructed. The key role is played now by the classical Hopf modules category. As an application, a five dimensional noncommutative noncocommutative bialgebra is given.",
    "authors": [
      "Gigel Militaru"
    ],
    "publication_date": "1998-07-02T10:40:42Z",
    "arxiv_id": "http://arxiv.org/abs/math/9807003v1",
    "download_url": "https://arxiv.org/abs/math/9807003v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Minimum distance functions of graded ideals and Reed-Muller-type codes",
    "abstract": "We introduce and study the minimum distance function of a graded ideal in a polynomial ring with coefficients in a field, and show that it generalizes the minimum distance of projective Reed-Muller-type codes over finite fields. This gives an algebraic formulation of the minimum distance of a projective Reed-Muller-type code in terms of the algebraic invariants and structure of the underlying vanishing ideal. Then we give a method, based on Groebner bases and Hilbert functions, to find lower bounds for the minimum distance of certain Reed-Muller-type codes. Finally we show explicit upper bounds for the number of zeros of polynomials in a projective nested cartesian set and give some support to a conjecture of Carvalho, Lopez-Neumann and Lopez.",
    "authors": [
      "Jose Martinez-Bernal",
      "Yuriko Pitones",
      "Rafael H. Villarreal"
    ],
    "publication_date": "2015-12-18T03:11:40Z",
    "arxiv_id": "http://arxiv.org/abs/1512.06868v2",
    "download_url": "https://arxiv.org/abs/1512.06868v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fermionic realization of toroidal Lie algebras of classical types",
    "abstract": "We use fermionic operators to construct toroidal Lie algebras of classical types, including in particular that of symplectic affine algebras, which is first realized by fermions.",
    "authors": [
      "Naihuan Jing",
      "Kailash C. Misra"
    ],
    "publication_date": "2008-07-18T23:33:00Z",
    "arxiv_id": "http://arxiv.org/abs/0807.3056v2",
    "download_url": "https://arxiv.org/abs/0807.3056v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Intertwining operators among modules for affine Lie algebra and lattice vertex operator algebras which respect integral forms",
    "abstract": "We define an integral intertwining operator among modules for a vertex operator algebra to be an intertwining operator which respects integral forms in the modules, and we show that an intertwining operator is integral if it is integral when restricted to generators of the integral forms in the modules. We apply this result to classify integral intertwining operators which respect certain natural integral forms in modules for affine Lie algebra and lattice vertex operator algebras.",
    "authors": [
      "Robert McRae"
    ],
    "publication_date": "2014-10-20T04:09:42Z",
    "arxiv_id": "http://arxiv.org/abs/1410.5149v1",
    "download_url": "https://arxiv.org/abs/1410.5149v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classifying (Weak) Coideal Subalgebras of Weak Hopf C*-Algebras",
    "abstract": "We develop a general approach to the problem of classification of weak coideal C*-subalgebras of weak Hopf C*-algebras. As an example, we consider weak Hopf C*-algebras and their weak coideal C*-subalgebras associated with Tambara Yamagami categories.",
    "authors": [
      "Leonid Vainerman",
      "Jean-Michel Vallin"
    ],
    "publication_date": "2019-04-16T11:30:04Z",
    "arxiv_id": "http://arxiv.org/abs/1904.07602v1",
    "download_url": "https://arxiv.org/abs/1904.07602v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The LNED and LFED Conjectures for Algebraic Algebras",
    "abstract": "Let $K$ be a field of characteristic zero and $\\mathcal A$ a $K$-algebra such that all the $K$-subalgebras generated by finitely many elements of $\\mathcal A$ are finite dimensional over $K$. A $K$-$\\mathcal E$-derivation of $\\mathcal A$ is a $K$-linear map of the form $\\operatorname{I}-φ$ for some $K$-algebra endomorphism $φ$ of $\\mathcal A$, where $\\operatorname{I}$ denotes the identity map of $\\mathcal A$. In this paper we first show that for all locally finite $K$-derivations $D$ and locally finite $K$-algebra automorphisms $φ$ of $\\mathcal A$, the images of $D$ and $\\operatorname{I}-φ$ do not contain any nonzero idempotent of $\\mathcal A$. We then use this result to show some cases of the LFED and LNED conjectures proposed in [Z4]. More precisely, We show the LNED conjecture for $\\mathcal A$, and the LFED conjecture for all locally finite $K$-derivations of $\\mathcal A$ and all locally finite $K$-$\\mathcal E$-derivations of the form $δ=\\operatorname{I}-φ$ with $φ$ being surjective. In particular, both conjectures are proved for all finite dimensional $K$-algebras. Furthermore, some finite extensions of derivations and automorphism to inner derivations and inner automorphisms, respectively, have also been established. This result is not only crucial in the proofs of the results above, but also interesting on its own right.",
    "authors": [
      "Wenhua Zhao"
    ],
    "publication_date": "2017-01-21T06:58:30Z",
    "arxiv_id": "http://arxiv.org/abs/1701.05990v1",
    "download_url": "https://arxiv.org/abs/1701.05990v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twisting algebras using non-commutative torsors",
    "abstract": "Non-commutative torsors (equivalently, two-cocycles) for a Hopf algebra can be used to twist comodule algebras. After surveying and extending the literature on the subject, we prove a theorem that affords a presentation by generators and relations for the algebras obtained by such twisting. We give a number of examples, including new constructions of the quantum affine spaces and the quantum tori.",
    "authors": [
      "Pierre Guillot",
      "Christian Kassel",
      "Akira Masuoka"
    ],
    "publication_date": "2009-11-27T15:27:08Z",
    "arxiv_id": "http://arxiv.org/abs/0911.5287v3",
    "download_url": "https://arxiv.org/abs/0911.5287v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum algebra of multiparameter Manin matrices",
    "abstract": "Multiparametric quantum semigroups $\\mathrm{M}_{\\hat{q}, \\hat{p}}(n)$ are generalization of the one-parameter general linear semigroups $\\mathrm{M}_q(n)$, where $\\hat{q}=(q_{ij})$ and $\\hat{p}=(p_{ij})$ are $2n^2$ parameters satisfying certain conditions. In this paper, we study the algebra of multiparametric Manin matrices using the R-matrix method. The systematic approach enables us to obtain several classical identities such as Muir identities, Newton's identities, Capelli-type identities, Cauchy-Binet's identity both for determinant and permanent as well as a rigorous proof of the MacMahon master equation for the quantum algebra of multiparametric Manin matrices. Some of the generalized identities are also generalized to multiparameter $q$-Yangians.",
    "authors": [
      "Naihuan Jing",
      "Yinlong Liu",
      "Jian Zhang"
    ],
    "publication_date": "2023-03-22T14:46:02Z",
    "arxiv_id": "http://arxiv.org/abs/2303.12608v2",
    "download_url": "https://arxiv.org/abs/2303.12608v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal constructions for Poisson algebras. Applications",
    "abstract": "We introduce the \\emph{universal algebra} of two Poisson algebras $P$ and $Q$ as a commutative algebra $A:={\\mathcal P} (P, \\, Q )$ satisfying a certain universal property. The universal algebra is shown to exist for any finite dimensional Poisson algebra $P$ and several of its applications are highlighted. For any Poisson $P$-module $U$, we construct a functor $U \\otimes - \\colon {}_{A} {\\mathcal M} \\to {}_Q{\\mathcal P}{\\mathcal M}$ from the category of $A$-modules to the category of Poisson $Q$-modules which has a left adjoint whenever $U$ is finite dimensional. Similarly, if $V$ is an $A$-module, then there exists another functor $ - \\otimes V \\colon {}_P{\\mathcal P}{\\mathcal M} \\to {}_Q{\\mathcal P}{\\mathcal M}$ connecting the categories of Poisson representations of $P$ and $Q$ and the latter functor also admits a left adjoint if $V$ is finite dimensional. If $P$ is $n$-dimensional, then ${\\mathcal P} (P) := {\\mathcal P} (P, \\, P)$ is the initial object in the category of all commutative bialgebras coacting on $P$. As an algebra, ${\\mathcal P} (P)$ can be deescribed as the quotient of the polynomial algebra $k[X_{ij} \\, | \\, i, j = 1, \\cdots, n]$ through an ideal generated by $2 n^3$ non-homogeneous polynomials of degree $\\leq 2$. Two applications are provided. The first one describes the automorphisms group ${\\rm Aut}_{\\rm Poiss} (P)$ as the group of all invertible group-like elements of the finite dual ${\\mathcal P} (P)^{\\rm o}$. Secondly, we show that for an abelian group $G$, all $G$-gradings on $P$ can be explicitly described and classified in terms of the universal coacting bialgebra ${\\mathcal P} (P)$.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2023-01-10T06:19:41Z",
    "arxiv_id": "http://arxiv.org/abs/2301.03807v2",
    "download_url": "https://arxiv.org/abs/2301.03807v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On integral fusion categories with low-dimensional simple objects",
    "abstract": "Let $k$ be an algebraically closedfield of characteristic zero. In this paper we consider an integral fusion category over $k$ in which the Frobenius-Perron dimensions of its simple objects are at most 3. We prove that such fusion category is of Frobenius type. In addition, we also prove that such fusion category is not simple.",
    "authors": [
      "Jingcheng Dong",
      "Li Dai"
    ],
    "publication_date": "2013-08-25T08:06:25Z",
    "arxiv_id": "http://arxiv.org/abs/1308.5386v1",
    "download_url": "https://arxiv.org/abs/1308.5386v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A universal formula for representing Lie algebra generators as formal power series with coefficients in the Weyl algebra",
    "abstract": "Given a $n$-dimensional Lie algebra $g$ over a field $k \\supset \\mathbb Q$, together with its vector space basis $X^0_1,..., X^0_n$, we give a formula, depending only on the structure constants, representing the infinitesimal generators, $X_i = X^0_i t$ in $g\\otimes_k k [[t]]$, where $t$ is a formal variable, as a formal power series in $t$ with coefficients in the Weyl algebra $A_n$. Actually, the theorem is proved for Lie algebras over arbitrary rings $k\\supset Q$.\n  We provide three different proofs, each of which is expected to be useful for generalizations. The first proof is obtained by direct calculations with tensors. This involves a number of interesting combinatorial formulas in structure constants. The final step in calculation is a new formula involving Bernoulli numbers and arbitrary derivatives of coth(x/2). The dimensions of certain spaces of tensors are also calculated. The second method of proof is geometric and reduces to a calculation of formal right-invariant vector fields in specific coordinates, in a (new) variant of formal group scheme theory. The third proof uses coderivations and Hopf algebras.",
    "authors": [
      "Nikolai Durov",
      "Stjepan Meljanac",
      "Andjelo Samsarov",
      "Zoran Škoda"
    ],
    "publication_date": "2006-04-05T18:58:24Z",
    "arxiv_id": "http://arxiv.org/abs/math/0604096v4",
    "download_url": "https://arxiv.org/abs/math/0604096v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Structure of Tame Graded Basic Hopf Algebras II",
    "abstract": "In continuation of the article \\cite{L} we classify all radically graded basic Hopf algebras of tame type over an algebraically closed field of characteristic 0.",
    "authors": [
      "Hua-Lin Huang",
      "Gongxiang Liu"
    ],
    "publication_date": "2009-03-25T11:22:33Z",
    "arxiv_id": "http://arxiv.org/abs/0903.4301v1",
    "download_url": "https://arxiv.org/abs/0903.4301v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Self-dual modules of semisimple Hopf algebras",
    "abstract": "We prove that, over an algebraically closed field of characteristic zero, a semisimple Hopf algebra that has a nontrivial self-dual simple module must have even dimension. This generalizes a classical result of W. Burnside. As an application, we show under the same assumptions that a semisimple Hopf algebra that has a simple module of even dimension must itself have even dimension.",
    "authors": [
      "Yevgenia Kashina",
      "Yorck Sommerhaeuser",
      "Yongchang Zhu"
    ],
    "publication_date": "2001-06-29T00:34:18Z",
    "arxiv_id": "http://arxiv.org/abs/math/0106254v2",
    "download_url": "https://arxiv.org/abs/math/0106254v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A comodule-bialgebra structure for word-series substitution and mould composition",
    "abstract": "An internal coproduct is described, which is compatible with Hoffman's quasi-shuffle product. Hoffman's quasi-shuffle Hopf algebra, with deconcatenation coproduct, is a comodule-Hopf algebra over the bialgebra thus defined. The relation with J. Ecalle's mould calculus, i.e. mould composition and contracting arborification, is precised.",
    "authors": [
      "Kurusch Ebrahimi-Fard",
      "Frédéric Fauvet",
      "Dominique Manchon"
    ],
    "publication_date": "2016-09-12T19:40:45Z",
    "arxiv_id": "http://arxiv.org/abs/1609.03549v2",
    "download_url": "https://arxiv.org/abs/1609.03549v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-dimensional vertex algebra modules over fixed point commutative subalgebras",
    "abstract": "Let $A$ be a connected commutative $\\C$-algebra with derivation $D$, $G$ a finite linear automorphism group of $A$ which preserves $D$, and $R=A^G$ the fixed point subalgebra of $A$ under the action of $G$. We show that if $A$ is generated by a single element as an $R$-algebra and is a Galois extension over $R$ in the sense of M. Auslander and O. Goldman, then every finite-dimensional vertex algebra $R$-module has a structure of twisted vertex algebra $A$-module.",
    "authors": [
      "Kenichiro Tanabe"
    ],
    "publication_date": "2010-12-05T00:15:35Z",
    "arxiv_id": "http://arxiv.org/abs/1012.0957v1",
    "download_url": "https://arxiv.org/abs/1012.0957v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-commutative duplicates of finite sets",
    "abstract": "We classify the twisted tensor products of a finite set algebra with a two elements set algebra using colored quivers obtained through considerations analogous to Ore extensions. This provides also a classification of entwining structures between a finite set algebra and the grouplike coalgebra on two elements. The resulting 2-nilpotent algebras have particular features with respect to Hochschild (co)homology and cyclic homology.",
    "authors": [
      "Claude Cibils"
    ],
    "publication_date": "2004-05-31T10:03:27Z",
    "arxiv_id": "http://arxiv.org/abs/math/0405593v2",
    "download_url": "https://arxiv.org/abs/math/0405593v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-semisimple Hopf Algebras of Dimension p^2",
    "abstract": "Let H be a Hopf algebra of dimension pq over an algebraically closed field of characteristic 0, where p <= q are odd primes. Suppose that S is the antipode of H. If H is not semisimple, then S^{4p}=id_H and Tr(S^{2p}) is an integer divisible by p^2. In particular, if dim H = p^2, we prove that H is isomorphic to a Taft algebra. We then complete the classification for the Hopf algebras of dimension p^2.",
    "authors": [
      "Siu-Hung Ng"
    ],
    "publication_date": "2001-10-19T19:39:17Z",
    "arxiv_id": "http://arxiv.org/abs/math/0110223v2",
    "download_url": "https://arxiv.org/abs/math/0110223v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On representations of dialgebras and conformal algebras",
    "abstract": "In this note, we observe a relation between dialgebras (in particular, Leibniz algebras) and conformal algebras. The purpose is to show how the methods of conformal algebras help solving problems on dialgebras, and, conversely, how the ideas of dialgebras work for conformal algebras.",
    "authors": [
      "Pavel Kolesnikov"
    ],
    "publication_date": "2011-08-02T08:11:35Z",
    "arxiv_id": "http://arxiv.org/abs/1108.0505v1",
    "download_url": "https://arxiv.org/abs/1108.0505v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Yang-Mills and some related algebras",
    "abstract": "After a short introduction on the theory of homogeneous algebras we describe the application of this theory to the analysis of the cubic Yang-Mills algebra, the quadratic self-duality algebras, their \"super\" versions as well as to some generalization.",
    "authors": [
      "Alain Connes",
      "Michel Dubois-Violette"
    ],
    "publication_date": "2004-11-18T16:42:48Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0411062v2",
    "download_url": "https://arxiv.org/abs/math-ph/0411062v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$τ$-tilting finiteness and $\\mathbf{g}$-tameness: Incidence algebras of posets and concealed algebras",
    "abstract": "We prove that any $τ$-tilting finite incidence algebra of a finite poset is representation-finite, and that any $\\mathbf{g}$-tame incidence algebra of a finite simply connected poset is tame. As the converse of these assertions are known to hold, we obtain characterizations of $τ$-tilting finite incidence algebras and $\\mathbf{g}$-tame simply connected incidence algebras. Both results are proved using the theory of concealed algebras. The former will be deduced from the fact that tame concealed algebras are $τ$-tilting infinite, and to prove the latter, we show that wild concealed algebras are not $\\mathbf{g}$-tame. We conjecture that any incidence algebra of a finite poset is wild if and only if it is not $\\mathbf{g}$-tame, and prove a result showing that there are relatively few possible counterexamples. In the appendix, we determine the representation type of a $τ$-tilting reduction of a concealed algebra of hyperbolic type.",
    "authors": [
      "Erlend D. Børve",
      "Jacob Fjeld Grevstad",
      "Endre S. Rundsveen"
    ],
    "publication_date": "2024-07-25T11:37:22Z",
    "arxiv_id": "http://arxiv.org/abs/2407.17965v3",
    "download_url": "https://arxiv.org/abs/2407.17965v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "R-matrix realization of two-parameter quantum affine algebra $U_{r,s}(\\widehat{gl}_n)$",
    "abstract": "We introduce the two-parameter quantum affine algebra $U_{r,s}(\\widehat{gl}_n)$ via the RTT realization. The Drinfeld realization is given and the type A quantum affine algebra is proved to be a special subalgebra of our extended algebra.",
    "authors": [
      "Naihuan Jing",
      "Ming Liu"
    ],
    "publication_date": "2016-04-21T13:57:10Z",
    "arxiv_id": "http://arxiv.org/abs/1604.06309v1",
    "download_url": "https://arxiv.org/abs/1604.06309v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Invariant chiral differential operators and the W_3 algebra",
    "abstract": "Attached to a vector space V is a vertex algebra S(V) known as the beta-gamma system or algebra of chiral differential operators on V. It is analogous to the Weyl algebra D(V), and is related to D(V) via the Zhu functor. If G is a connected Lie group with Lie algebra g, and V is a linear G-representation, there is an action of the corresponding affine algebra on S(V). The invariant space S(V)^{g[t]} is a commutant subalgebra of S(V), and plays the role of the classical invariant ring D(V)^G. When G is an abelian Lie group acting diagonally on V, we find a finite set of generators for S(V)^{g[t]}, and show that S(V)^{g[t]} is a simple vertex algebra and a member of a Howe pair. The Zamolodchikov W_3 algebra with c=-2 plays a fundamental role in the structure of S(V)^{g[t]}.",
    "authors": [
      "Andrew R. Linshaw"
    ],
    "publication_date": "2007-10-01T08:04:14Z",
    "arxiv_id": "http://arxiv.org/abs/0710.0194v4",
    "download_url": "https://arxiv.org/abs/0710.0194v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Orbifolds of lattice vertex algebras under an isometry of order two",
    "abstract": "Every isometry $σ$ of a positive-definite even lattice $Q$ can be lifted to an automorphism of the lattice vertex algebra $V_Q$. An important problem in vertex algebra theory and conformal field theory is to classify the representations of the $σ$-invariant subalgebra $V_Q^σ$ of $V_Q$, known as an orbifold. In the case when $σ$ is an isometry of $Q$ of order two, we classify the irreducible modules of the orbifold vertex algebra $V_Q^σ$ and identify them as submodules of twisted or untwisted $V_Q$-modules. The examples where $Q$ is a root lattice and $σ$ is a Dynkin diagram automorphism are presented in detail.",
    "authors": [
      "Bojko Bakalov",
      "Jason Elsinger"
    ],
    "publication_date": "2015-02-17T00:27:05Z",
    "arxiv_id": "http://arxiv.org/abs/1502.04756v2",
    "download_url": "https://arxiv.org/abs/1502.04756v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal Object Oriented Languages and Computer Algebra",
    "abstract": "The universal object oriented languages made programming more simple and efficient. In the article is considered possibilities of using similar methods in computer algebra. A clear and powerful universal language is useful if particular problem was not implemented in standard software packages like REDUCE, MATHEMATICA, etc. and if the using of internal programming languages of the packages looks not very efficient.\n Functional languages like LISP had some advantages and traditions for algebraic and symbolic manipulations. Functional and object oriented programming are not incompatible ones. An extension of the model of an object for manipulation with pure functions and algebraic expressions is considered.",
    "authors": [
      "Alexander Yu. Vlasov"
    ],
    "publication_date": "1999-01-15T19:28:58Z",
    "arxiv_id": "http://arxiv.org/abs/cs/9901007v1",
    "download_url": "https://arxiv.org/abs/cs/9901007v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$λ$-Differential operators and $λ$-differential modules for the Virasoro algebra",
    "abstract": "The concept of $λ$-differential operators is a natural generalization of differential operators and difference operators. In this paper, we determine the $λ$-differential Lie algebraic structure on the Witt algebra and the Virasoro algebra for invertible $λ$. Then we consider several families of modules over the Virasoro algebra with explicit module actions and determine the $λ$-differential module structures on them.",
    "authors": [
      "Xuewen Liu",
      "Li Guo",
      "Xiangqian Guo"
    ],
    "publication_date": "2020-02-09T18:53:06Z",
    "arxiv_id": "http://arxiv.org/abs/2002.03426v1",
    "download_url": "https://arxiv.org/abs/2002.03426v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Spectral Hecke Algebra",
    "abstract": "We introduce a derived enhancement of local Galois deformation rings that we call the \"spectral Hecke algebra\", in analogy to a construction in the Geometric Langlands program. This is a Hecke algebra that acts on the spectral side of the Langlands correspondence, i.e. on moduli spaces of Galois representations. We verify the simplest form of derived local-global compatibility between the action of the spectral Hecke algebra on the derived Galois deformation ring of Galatius-Venkatesh, and the action of Venkatesh's derived Hecke algebra on the cohomology of arithmetic groups.",
    "authors": [
      "Tony Feng"
    ],
    "publication_date": "2019-12-09T22:47:31Z",
    "arxiv_id": "http://arxiv.org/abs/1912.04413v3",
    "download_url": "https://arxiv.org/abs/1912.04413v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Rayner structures",
    "abstract": "In this note, we study substructures of generalised power series fields induced by families of well-ordered subsets of the group of exponents. We characterise the set-theoretic and algebraic properties of the induced substructures in terms of conditions on the families. We extend the work of Rayner by giving both \\emph{necessary} and sufficient conditions to obtain truncation closed subgroups, subrings and subfields.",
    "authors": [
      "Lothar Sebastian Krapp",
      "Salma Kuhlmann",
      "Michele Serra"
    ],
    "publication_date": "2020-04-07T10:21:59Z",
    "arxiv_id": "http://arxiv.org/abs/2004.03239v4",
    "download_url": "https://arxiv.org/abs/2004.03239v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lie algebras with given properties of subalgebras and elements",
    "abstract": "Results about the following classes of finite-dimensional Lie algebras over a field of characteristic zero are presented: anisotropic (i.e., Lie algebras for which each adjoint operator is semisimple), regular (i.e., Lie algebras in which each nonzero element is regular in the sense of Bourbaki), minimal nonabelian (i.e., nonabelian Lie algebras all whose proper subalgebras are abelian), and algebras of depth 2 (i.e., Lie algebras all whose proper subalgebras are abelian or minimal nonabelian).",
    "authors": [
      "Pasha Zusmanovich"
    ],
    "publication_date": "2011-05-21T19:56:11Z",
    "arxiv_id": "http://arxiv.org/abs/1105.4284v3",
    "download_url": "https://arxiv.org/abs/1105.4284v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structure of a new class of non-graded infinite dimensional simple Lie algebras",
    "abstract": "A new class of infinite dimensional simple Lie algebras over a field with characteristic 0 are constructed. These are examples of non-graded Lie algebras. The isomorphism classes of these Lie algebras are determined. The structure space of these algebras is given explicitly.",
    "authors": [
      "Yucai Su"
    ],
    "publication_date": "2004-02-26T03:23:46Z",
    "arxiv_id": "http://arxiv.org/abs/math/0402424v1",
    "download_url": "https://arxiv.org/abs/math/0402424v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantizations of generalized Cartan type $S$ Lie algebras and of the special algebra $\\mathbf{S}(n;\\underline{1})$ in the modular case",
    "abstract": "The generalized Cartan type $\\mathbf{S}$ Lie algebras in char 0 with the Lie bialgebra structures involved are quantized, where the Drinfel'd twist we used is proved to be a variation of the Jordanian twist. As the passage from char 0 to char p, their quantization integral forms are given. By the modular reduction and base changes, we obtain certain quantizations of the restricted universal enveloping algebra $\\mathbf u(\\mathbf{S}(n;\\underline{1}))$ (for the Cartan type simple modular restricted Lie algebra $\\mathbf{S}(n;\\underline{1})$ of $\\mathbf{S}$ type). They are new Hopf algebras of truncated $p$-polynomial noncommutative and noncocommutative deformation of dimension $p^{1+(n-1)(p^n-1)}$, which contain the well-known Radford algebra (\\cite{DR}) as a Hopf subalgebra. As a by-product, we also get some Jordanian quantizations for $\\mathfrak {sl}_n$, which are induced from those horizontal quantizations of $\\mathbf S(n;\\underline1)$.",
    "authors": [
      "Naihong Hu",
      "Xiuling Wang"
    ],
    "publication_date": "2009-02-17T02:35:48Z",
    "arxiv_id": "http://arxiv.org/abs/0902.2821v1",
    "download_url": "https://arxiv.org/abs/0902.2821v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weyl modules for the twisted loop algebras",
    "abstract": "The notion of a Weyl module, previously defined for the untwisted affine algebras, is extended here to the twisted affine algebras. We describe an identification of the Weyl modules for the twisted affine algebras with suitably chosen Weyl modules for the untwisted affine algebras. This identification allows us to use known results in the untwisted case to compute the dimensions and characters of the Weyl modules for the twisted algebras.",
    "authors": [
      "Vyjayanthi Chari",
      "Ghislain Fourier",
      "Prasad Senesi"
    ],
    "publication_date": "2007-04-28T22:08:01Z",
    "arxiv_id": "http://arxiv.org/abs/0704.3819v2",
    "download_url": "https://arxiv.org/abs/0704.3819v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complete intersections in binomial and lattice ideals",
    "abstract": "For the family of graded lattice ideals of dimension 1, we establish a complete intersection criterion in algebraic and geometric terms. In positive characteristic, it is shown that all ideals of this family are binomial set theoretic complete intersections. In characteristic zero, we show that an arbitrary lattice ideal which is a binomial set theoretic complete intersection is a complete intersection.",
    "authors": [
      "Hiram H. Lopez",
      "Rafael H. Villarreal"
    ],
    "publication_date": "2012-05-03T17:28:39Z",
    "arxiv_id": "http://arxiv.org/abs/1205.0772v3",
    "download_url": "https://arxiv.org/abs/1205.0772v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Anti-Yetter-Drinfeld Modules for Quasi-Hopf Algebras",
    "abstract": "We apply categorical machinery to the problem of defining anti-Yetter-Drinfeld modules for quasi-Hopf algebras. While a definition of Yetter-Drinfeld modules in this setting, extracted from their categorical interpretation as the center of the monoidal category of modules has been given, none was available for the anti-Yetter-Drinfeld modules that serve as coefficients for a Hopf cyclic type cohomology theory for quasi-Hopf algebras. This is a followup paper to the authors' previous effort that addressed the somewhat different case of anti-Yetter-Drinfeld contramodule coefficients in this and in the Hopf algebroid setting.",
    "authors": [
      "Ivan Kobyzev",
      "Ilya Shapiro"
    ],
    "publication_date": "2018-04-05T19:27:22Z",
    "arxiv_id": "http://arxiv.org/abs/1804.02031v2",
    "download_url": "https://arxiv.org/abs/1804.02031v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A non-unimodal codimension 3 level $h$-vector",
    "abstract": "$(1,3,6,10,15,21,28,27,27,28)$ is a level $h$-vector! This example answers negatively the open question as to whether all codimension 3 level $h$-vectors are unimodal. Moreover, using the same (simple) technique, we are able to construct level algebras of codimension 3 whose $h$-vectors have exactly $N$ ` ` maxima\", for any positive integer $N$. These non-unimodal $h$-vectors, in particular, provide examples of codimension 3 level algebras not enjoying the Weak Lefschetz Property (WLP). Their existence was also an open problem before. In the second part of the paper we further investigate this fundamental property, and show that there even exist codimension 3 level algebras of type 3 without the WLP.",
    "authors": [
      "Fabrizio Zanello"
    ],
    "publication_date": "2005-05-31T11:36:35Z",
    "arxiv_id": "http://arxiv.org/abs/math/0505678v3",
    "download_url": "https://arxiv.org/abs/math/0505678v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graded algebras with cyclotomic Hilbert series",
    "abstract": "Let $R$ be a positively graded algebra over a field. We say that $R$ is Hilbert-cyclotomic if the numerator of its reduced Hilbert series has all of its roots on the unit circle. Such rings arise naturally in commutative algebra, numerical semigroup theory and Ehrhart theory. If $R$ is standard graded, we prove that, under the additional hypothesis that $R$ is Koszul or has an irreducible $h$-polynomial, Hilbert-cyclotomic algebras coincide with complete intersections. In the Koszul case, this is a consequence of some classical results about the vanishing of deviations of a graded algebra.",
    "authors": [
      "Alessio Borzì",
      "Alessio D'Alì"
    ],
    "publication_date": "2020-05-19T19:01:50Z",
    "arxiv_id": "http://arxiv.org/abs/2005.09708v1",
    "download_url": "https://arxiv.org/abs/2005.09708v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]