[
  {
    "title": "Braided enveloping algebras associated to quantum parabolic subalgebras",
    "abstract": "Associated to each subset $J$ of the nodes $I$ of a Dynkin diagram is a triangular decomposition of the corresponding Lie algebra $\\mathfrak{g}$ into three subalgebras $\\widetilde{\\mathfrak{g}_{J}}$ (generated by $e_{j}$, $f_{j}$ for $j\\in J$ and $h_{i}$ for $i\\in I$), $\\mathfrak{n}^{-}_{D}$ (generated by $f_{d}$, $d\\in D=I\\setminus J$) and its dual $\\mathfrak{n}_{D}^{+}$.\n  We demonstrate a quantum counterpart, generalising work of Majid and Rosso, by exhibiting analogous triangular decompositions of $U_{q}(\\mathfrak{g})$ and identifying a graded braided Hopf algebra that quantizes $\\mathfrak{n}_{D}^{-}$. This algebra has many similar properties to $U_{q}^{-}(\\mathfrak{g})$, in many cases being a Nichols algebra and therefore completely determined by its associated braiding.",
    "authors": [
      "Jan E. Grabowski"
    ],
    "publication_date": "2007-06-04T15:20:54Z",
    "arxiv_id": "http://arxiv.org/abs/0706.0455v3",
    "download_url": "https://arxiv.org/abs/0706.0455v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deformations of Lie Algebras using $σ$-derivations",
    "abstract": "In this article we develop an approach to deformations of the Witt and Virasoro algebras based on $σ$-derivations. We show that $σ$-twisted Jacobi type identity holds for generators of such deformations. For the $σ$-twisted generalization of Lie algebras modeled by this construction, we develop a theory of central extensions. We show that our approach can be used to construct new deformations of Lie algebras and their central extensions, which in particular include naturally the $q$-deformations of the Witt and Virasoro algebras associated to $q$-difference operators, providing also corresponding q-deformed Jacobi identities.",
    "authors": [
      "Jonas Hartwig",
      "Daniel Larsson",
      "Sergei Silvestrov"
    ],
    "publication_date": "2004-08-04T17:53:41Z",
    "arxiv_id": "http://arxiv.org/abs/math/0408064v1",
    "download_url": "https://arxiv.org/abs/math/0408064v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Actions of quantum linear spaces on quantum algebras",
    "abstract": "We study actions of bosonizations of quantum linear spaces on quantum algebras. Under mild conditions, we classify actions on quantum affine spaces and quantum matrix algebras. In the former case, it is shown that all actions of generalized Taft algebras are trivial extensions of actions on quantum planes. In both cases we achieve bounds on the rank of the bosonization acting on the algebra.",
    "authors": [
      "Zachary Cline",
      "Jason Gaddis"
    ],
    "publication_date": "2019-08-14T17:18:55Z",
    "arxiv_id": "http://arxiv.org/abs/1908.05248v1",
    "download_url": "https://arxiv.org/abs/1908.05248v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lie algebras of vector fields on smooth affine varieties",
    "abstract": "We reprove the results of Jordan [18] and Siebert [31] and show that the Lie algebra of polynomial vector fields on an irreducible affine variety X is simple if and only if X is a smooth variety. Given proof is self-contained and does not depend on papers mentioned above. Besides, the structure of the module of polynomial functions on an irreducible smooth affine variety over the Lie algebra of vector fields is studied. Examples of Lie algebras of polynomial vector fields on an N-dimensional sphere, non-singular hyperelliptic curves and linear algebraic groups are considered.",
    "authors": [
      "Yuly Billig",
      "Vyacheslav Futorny"
    ],
    "publication_date": "2017-05-16T20:12:59Z",
    "arxiv_id": "http://arxiv.org/abs/1705.05900v3",
    "download_url": "https://arxiv.org/abs/1705.05900v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebras of quotients of graded Lie algebras",
    "abstract": "In this paper we explore graded algebras of quotients of Lie algebras with special emphasis on the 3-graded case and answer some natural questions concerning its relation to maximal Jordan systems of quotients.",
    "authors": [
      "Juana Sanchez Ortega",
      "Mercedes Siles Molina"
    ],
    "publication_date": "2009-12-09T14:46:41Z",
    "arxiv_id": "http://arxiv.org/abs/0912.1764v1",
    "download_url": "https://arxiv.org/abs/0912.1764v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extending Structures II: The Quantum Version",
    "abstract": "Let A be a Hopf algebra and H a coalgebra. We shall describe and classify up to an isomorphism all Hopf algebras E that factorize through A and H: that is E is a Hopf algebra such that A is a Hopf subalgebra of E, H is a subcoalgebra in E with 1_{E} \\in H and the multiplication map $A\\otimes H \\to E$ is bijective. The tool we use is a new product, we call it the unified product, in the construction of which A and H are connected by three coalgebra maps: two actions and a generalized cocycle. Both the crossed product of an Hopf algebra acting on an algebra and the bicrossed product of two Hopf algebras are special cases of the unified product. A Hopf algebra E factorizes through A and H if and only if E is isomorphic to a unified product of A and H. All such Hopf algebras E are classified up to an isomorphism that stabilizes A and H by a Schreier type classification theorem. A coalgebra version of lazy 1-cocycles as defined by Bichon and Kassel plays the key role in the classification theorem.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2010-11-09T18:59:58Z",
    "arxiv_id": "http://arxiv.org/abs/1011.2174v3",
    "download_url": "https://arxiv.org/abs/1011.2174v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Groebner-Shirshov bases for pre-associative algebras",
    "abstract": "We develop Groebner---Shirshov bases technique for pre-associative algebras also known as dendriform (di-)algebras.",
    "authors": [
      "Pavel Kolesnikov"
    ],
    "publication_date": "2015-09-23T06:55:57Z",
    "arxiv_id": "http://arxiv.org/abs/1509.06860v1",
    "download_url": "https://arxiv.org/abs/1509.06860v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Universal Approach to Vertex Algebras",
    "abstract": "We characterize vertex algebras (in a suitable sense) as algebras over a certain graded co-operad. We also discuss some examples and categorical implications of this characterization.",
    "authors": [
      "Ruthi Hortsch",
      "Igor Kriz",
      "Ales Pultr"
    ],
    "publication_date": "2010-05-31T21:57:52Z",
    "arxiv_id": "http://arxiv.org/abs/1006.0027v1",
    "download_url": "https://arxiv.org/abs/1006.0027v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The $q$-difference Noether problem for complex reflection groups and quantum OGZ algebras",
    "abstract": "For any complex reflection group $G=G(m,p,n)$, we prove that the $G$-invariants of the division ring of fractions of the $n$:th tensor power of the quantum plane is a quantum Weyl field and give explicit parameters for this quantum Weyl field. This shows that the $q$-Difference Noether Problem has a positive solution for such groups, generalizing previous work by Futorny and the author. Moreover, the new result is simultaneously a $q$-deformation of the classical commutative case, and of the Weyl algebra case recently obtained by Eshmatov et al.\n  Secondly, we introduce a new family of algebras called quantum OGZ algebras. They are natural quantizations of the OGZ algebras introduced by Mazorchuk originating in the classical Gelfand-Tsetlin formulas. Special cases of quantum OGZ algebras include the quantized enveloping algebra of $\\mathfrak{gl}_n$ and quantized Heisenberg algebras. We show that any quantum OGZ algebra can be naturally realized as a Galois ring in the sense of Futorny-Ovsienko, with symmetry group being a direct product of complex reflection groups $G(m,p,r_k)$.\n  Finally, using these results we prove that the quantum OGZ algebras satisfy the quantum Gelfand-Kirillov conjecture by explicitly computing their division ring of fractions.",
    "authors": [
      "Jonas T. Hartwig"
    ],
    "publication_date": "2015-12-31T07:29:41Z",
    "arxiv_id": "http://arxiv.org/abs/1512.09234v2",
    "download_url": "https://arxiv.org/abs/1512.09234v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Littelmann's path crystal and combinatorics of certain sl_{l+1}^ modules of level zero",
    "abstract": "We construct a subcrystal of the Littelmann's path crystal whose formal character coincides with that of a certain simple integrable module of level zero over the untwisted affine Lie algebra associated to sl_n. We also establish an analogue of the Littlewood-Richardson rule for the tensor product of that crystal with a highest weight crystal.",
    "authors": [
      "Jacob Greenstein"
    ],
    "publication_date": "2002-06-25T11:51:00Z",
    "arxiv_id": "http://arxiv.org/abs/math/0206263v2",
    "download_url": "https://arxiv.org/abs/math/0206263v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the prime ideal structure of symbolic Rees algebras",
    "abstract": "This paper contributes to the study of the prime spectrum and dimension theory of symbolic Rees algebra over Noetherian domains. We first establish some general results on the prime ideal structure of subalgebras of affine domains, which actually arise, in the Noetherian context, as domains between a domain $A$ and $A[a^{-1}]$. We then examine closely the special context of symbolic Rees algebras (which yielded the first counter-example to the Zariski-Hilbert problem). One of the results states that if $A$ is a Noetherian domain and $p$ a maximal ideal of $A$, then the Rees algebra of $p$ inherits the Noetherian-like behavior of being a stably strong S-domain. We also investigate graded rings associated with symbolic Rees algebras of prime ideals $p$ such that $A_{p}$ is a rank-one DVR and close with an application related to Hochster's result on the coincidence of the ordinary and symbolic powers of a prime ideal.",
    "authors": [
      "S. Bouchiba",
      "S. Kabbaj"
    ],
    "publication_date": "2009-02-28T08:17:18Z",
    "arxiv_id": "http://arxiv.org/abs/0903.0052v1",
    "download_url": "https://arxiv.org/abs/0903.0052v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On positivity of Roger--Yang skein algebras",
    "abstract": "We generalize the positivity conjecture on (Kauffman bracket) skein algebras to Roger--Yang skein algebras. To generalize it, we use explicit polynomials like Chebyshev polynomials of the first kind to give candidates of positive bases. Moreover, the polynomials form a lower bound in the sense of [Lê18] and [LTY21]. We also discuss a relation between the polynomials and the centers of Roger--Yang skein algebras when the quantum parameter is a complex root of unity.",
    "authors": [
      "Hiroaki Karuo"
    ],
    "publication_date": "2023-08-02T17:08:53Z",
    "arxiv_id": "http://arxiv.org/abs/2308.01282v3",
    "download_url": "https://arxiv.org/abs/2308.01282v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the isomorphism between the reduction algebra and the invariant differential operators on Lie groups",
    "abstract": "Using techniques of deformation (bi)quantization we establish a non-canonical algebra isomorphism between the deformed reduction algebra and the invariant differential operators on G/H. Further results concerning other deformations of these two algebras are also proved. Part of the author's PhD thesis at University Paris 7, 2009.",
    "authors": [
      "Panagiotis Batakidis"
    ],
    "publication_date": "2011-03-22T21:35:23Z",
    "arxiv_id": "http://arxiv.org/abs/1103.4391v4",
    "download_url": "https://arxiv.org/abs/1103.4391v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Auslander-Reiten conjecture and Auslander-Reiten duality",
    "abstract": "Motivated by a result of Araya, we extend the Auslander-Reiten duality theorem to Cohen-Macaulay local rings. We also study the Auslander-Reiten conjecture, which is rooted in Nakayama's work on finite dimensional algebras. One of our results detects a certain condition that forces the conjecture to hold over local rings of positive depth.",
    "authors": [
      "Olgur Celikbas",
      "Ryo Takahashi"
    ],
    "publication_date": "2011-12-28T23:17:44Z",
    "arxiv_id": "http://arxiv.org/abs/1112.6201v3",
    "download_url": "https://arxiv.org/abs/1112.6201v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the correspondence between path algebras and generalized path algebras",
    "abstract": "The concept of generalized path algebras was introduced in (Coelho and Liu, 2000). It was shown in (Ibáñez Cobos et al., 2008) how to obtain the Gabriel quiver of a given generalized path algebra. In this article, we generalize the concept of generalized path algebra to allow them to have relations, and we extend the result in (Ibáñez Cobos et al., 2008) to this new setting. Moreover, we use the extended result mentioned above to address the inverse problem: that is, the problem of determining when a given algebra is isomorphic to a generalized path algebra in a non-trivial way.",
    "authors": [
      "Viktor Chust",
      "Flávio U. Coelho"
    ],
    "publication_date": "2021-12-22T19:33:33Z",
    "arxiv_id": "http://arxiv.org/abs/2112.12189v1",
    "download_url": "https://arxiv.org/abs/2112.12189v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Jordan types with small parts for Artinian Gorenstein algebras of codimension three",
    "abstract": "We study Jordan types of linear forms for graded Artinian Gorenstein algebras having arbitrary codimension. We introduce rank matrices of linear forms for such algebras that represent the ranks of multiplication maps in various degrees. We show that there is a 1-1 correspondence between rank matrices and Jordan degree types. For Artinian Gorenstein algebras with codimension three we classify all rank matrices that occur for linear forms with vanishing third power. As a consequence, we show for such algebras that the possible Jordan types with parts of length at most four are uniquely determined by at most three parameters.",
    "authors": [
      "Nasrin Altafi"
    ],
    "publication_date": "2020-08-05T19:56:00Z",
    "arxiv_id": "http://arxiv.org/abs/2008.02338v2",
    "download_url": "https://arxiv.org/abs/2008.02338v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hecke Algebra Actions on the Coinvariant Algebra",
    "abstract": "Two actions of the Hecke algebra of type A on the corresponding polynomial ring are studied. Both are deformations of the natural action of the symmetric group on polynomials, and keep symmetric functions invariant. We give an explicit description of these actions, and deduce a combinatorial formula for the resulting graded characters on the coinvariant algebra.",
    "authors": [
      "Ron M. Adin",
      "Alexander Postnikov",
      "Yuval Roichman"
    ],
    "publication_date": "1999-08-17T15:55:26Z",
    "arxiv_id": "http://arxiv.org/abs/math/9908090v2",
    "download_url": "https://arxiv.org/abs/math/9908090v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Uniform Symbolic Topology Property for Diagonally $F$-regular Algebras",
    "abstract": "Let $k$ be a field of positive characteristic. Building on the work of the second named author, we define a new class of $k$-algebras, called diagonally $F$-regular algebras, for which the so-called Uniform Symbolic Topology Property (USTP) holds effectively. We show that this class contains all essentially smooth $k$-algebras. We also show that this class contains certain singular algebras, such as the affine cone over $\\mathbb{P}^r_{k} \\times \\mathbb{P}^s_{k}$, when $k$ is perfect. By reduction to positive characteristic, it follows that USTP holds effectively for the affine cone over $\\mathbb{P}^r_{\\mathbb{C}} \\times \\mathbb{P}^s_{\\mathbb{C}}$ and more generally for complex varieties of diagonal $F$-regular type.",
    "authors": [
      "Javier Carvajal-Rojas",
      "Daniel Smolkin"
    ],
    "publication_date": "2018-07-11T02:16:46Z",
    "arxiv_id": "http://arxiv.org/abs/1807.03928v1",
    "download_url": "https://arxiv.org/abs/1807.03928v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On decomposing monomial algebras with the Lefschetz properties",
    "abstract": "We introduce a general technique for decomposing monomial algebras which we use to study the Lefschetz properties. We apply our technique to various classes of algebras, including monomial almost complete intersections and Gorenstein algebras. In particular, we prove that Gorenstein codimension three algebras arising from numerical semigroups have the strong Lefschetz property. We also study the reverse of the splitting operation -- a gluing operation -- which gives a way to construct monomial algebras with the Lefschetz properties.",
    "authors": [
      "Oleksandra Gasanova",
      "Samuel Lundqvist",
      "Lisa Nicklasson"
    ],
    "publication_date": "2020-06-25T14:48:15Z",
    "arxiv_id": "http://arxiv.org/abs/2006.14453v4",
    "download_url": "https://arxiv.org/abs/2006.14453v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Growth of Graded Twisted Calabi-Yau Algebras",
    "abstract": "We initiate a study of the growth and matrix-valued Hilbert series of non-negatively graded twisted Calabi-Yau algebras that are homomorphic images of path algebras of weighted quivers, generalizing techniques previously used to investigate Artin-Schelter regular algebras and graded Calabi-Yau algebras. Several results are proved without imposing any assumptions on the degrees of generators or relations of the algebras. We give particular attention to twisted Calabi-Yau algebras of dimension d at most 3, giving precise descriptions of their matrix-valued Hilbert series and partial results describing which underlying quivers yield algebras of finite GK-dimension. For d = 2, we show that these are algebras with mesh relations. For d = 3, we show that the resulting algebras are a kind of derivation-quotient algebra arising from an element that is similar to a twisted superpotential.",
    "authors": [
      "Manuel L. Reyes",
      "Daniel Rogalski"
    ],
    "publication_date": "2018-08-30T22:32:43Z",
    "arxiv_id": "http://arxiv.org/abs/1808.10538v1",
    "download_url": "https://arxiv.org/abs/1808.10538v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolution algebras of arbitrary dimension and their decompositions",
    "abstract": "We study evolution algebras of arbitrary dimension. We analyze in deep the notions of evolution subalgebras, ideals and non-degeneracy and describe the ideals generated by one element and characterize the simple evolution algebras. We also prove the existence and unicity of a direct sum decomposition into irreducible components for every non-degenerate evolution algebra. When the algebra is degenerate, the uniqueness cannot be assured.\n  The graph associated to an evolution algebra (relative to a natural basis) will play a fundamental role to describe the structure of the algebra. Concretely, a non-degenerate evolution algebra is irreducible if and only if the graph is connected. Moreover, when the evolution algebra is finite-dimensional, we give a process (called the fragmentation process) to decompose the algebra into irreducible components.",
    "authors": [
      "Yolanda Cabrera Casado",
      "Mercedes Siles Molina",
      "M. Victoria Velasco"
    ],
    "publication_date": "2016-01-08T11:09:42Z",
    "arxiv_id": "http://arxiv.org/abs/1601.01832v2",
    "download_url": "https://arxiv.org/abs/1601.01832v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SL(2,Z)-action for ribbon quasi-Hopf algebras",
    "abstract": "We study the universal Hopf algebra L of Majid and Lyubashenko in the case that the underlying ribbon category is the category of representations of a finite dimensional ribbon quasi-Hopf algebra A. We show that L=A* with coadjoint action and compute the Hopf algebra structure morphisms of L in terms of the defining data of A. We give explicitly the condition on A which makes Rep(A) factorisable and compute Lyubashenko's projective SL(2,Z)-action on the centre of A in this case.\n  The point of this exercise is to provide the groundwork for the applications to ribbon categories arising in logarithmic conformal field theories - in particular symplectic fermions and W_p-models - and to test a conjectural non-semisimple Verlinde formula.",
    "authors": [
      "Vanda Farsad",
      "Azat M. Gainutdinov",
      "Ingo Runkel"
    ],
    "publication_date": "2017-02-03T17:29:46Z",
    "arxiv_id": "http://arxiv.org/abs/1702.01086v3",
    "download_url": "https://arxiv.org/abs/1702.01086v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The universality of one half in commutative nonassociative algebras with identities",
    "abstract": "In this paper we will explain an interesting phenomenon which occurs in general nonassociative algebras. More precisely, we establish that any finite-dimensional commutative nonassociative algebra over a field satisfying an identity always contains $\\frac12$ in its Peirce spectrum. We also show that the corresponding $\\frac12$-Peirce module satisfies the Jordan type fusion laws. The present approach is based on an explicit representation of the Peirce polynomial for an arbitrary algebra identity. To work with fusion rules, we develop the concept of the Peirce symbol and show that it can be explicitly determined for a wide class of algebras. We also illustrate our approach by further applications to genetic algebras and algebra of minimal cones (the so-called Hsiang algebras).",
    "authors": [
      "Vladimir G. Tkachev"
    ],
    "publication_date": "2018-08-11T14:18:26Z",
    "arxiv_id": "http://arxiv.org/abs/1808.03808v1",
    "download_url": "https://arxiv.org/abs/1808.03808v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A study of Galois objects for algebraic quantum groups",
    "abstract": "We supplement the study of Galois theory for algebraic quantum groups started in the paper 'Galois Theory for Multiplier Hopf Algebras with Integrals' by A. Van Daele and Y.H. Zhang. We examine the structure of the Galois objects: algebras equipped with a Galois coaction such that only the scalars are coinvariants. We show how their structure is as rich as the one of the quantum groups themselves: there are two distinguished weak K.M.S. functionals, related by a modular element, and there is an analogue of the antipode squared. We also show how to reflect the quantum group across the Galois object to obtain a (possibly) new algebraic quantum group. We end by considering an example.",
    "authors": [
      "K. De Commer"
    ],
    "publication_date": "2007-11-08T16:51:55Z",
    "arxiv_id": "http://arxiv.org/abs/0711.1319v1",
    "download_url": "https://arxiv.org/abs/0711.1319v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal Algebra Applied to Hom-Associative Algebras, and More",
    "abstract": "The purpose of this paper is to discuss the universal algebra theory of hom-algebras. This kind of algebra involves a linear map which twists the usual identities. We focus on hom-associative algebras and hom-Lie algebras for which we review the main results. We discuss the envelopment problem, operads, and the Diamond Lemma; the usual tools have to be adapted to this new situation. Moreover we study Hilbert series for the hom-associative operad and free algebra, and describe them up to total degree equal 8 and 9 respectively.",
    "authors": [
      "Lars Hellström",
      "Abdenacer Makhlouf",
      "Sergei D. Silvestrov"
    ],
    "publication_date": "2014-04-09T15:17:35Z",
    "arxiv_id": "http://arxiv.org/abs/1404.2516v1",
    "download_url": "https://arxiv.org/abs/1404.2516v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shuffle algebras and their integral forms: specialization map approach in types $C_n$ and $D_n$",
    "abstract": "We construct a family of PBWD bases for the positive subalgebras of quantum loop algebras of type $C_n$ and $D_n$, as well as their Lusztig and RTT integral forms, in the new Drinfeld realization. We also establish a shuffle algebra realization of these $\\mathbb{Q}(v)$-algebras (proved earlier in arXiv:2102.11269 by completely different tools) and generalize the latter to the above $\\mathbb{Z}[v,v^{-1}]$-forms. The rational counterparts provide shuffle algebra realizations of positive subalgebras of type $C_n$ and $D_n$ Yangians and their Drinfeld-Gavarini duals. While this naturally generalizes our earlier treatment of the classical type $B_n$ in arXiv:2305.00810 and $A_n$ in arXiv:1808.09536, the specialization maps in the present setup are more compelling.",
    "authors": [
      "Yue Hu",
      "Alexander Tsymbaliuk"
    ],
    "publication_date": "2025-03-28T15:35:47Z",
    "arxiv_id": "http://arxiv.org/abs/2503.22535v2",
    "download_url": "https://arxiv.org/abs/2503.22535v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lifting Grobner bases from the exterior algebra",
    "abstract": "In the article \"Non-commutative Grobner bases for commutative algebras\", Eisenbud-Peeva-Sturmfels proved a number of results regarding Grobner bases and initial ideals of those ideals in the free associative algebra which contain the commutator ideal. We prove similar results for ideals which contains the anti-commutator ideal (the defining ideal of the exterior algebra). We define one notion of generic initial ideals in the free assoicative algebra, and show that gin's of ideals containing the commutator ideal, or the anti-commutator ideal, are finitely generated.",
    "authors": [
      "Andreas Nilsson",
      "Jan Snellman"
    ],
    "publication_date": "2000-10-12T13:02:43Z",
    "arxiv_id": "http://arxiv.org/abs/math/0010117v2",
    "download_url": "https://arxiv.org/abs/math/0010117v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ascent and descent of the Golod property along algebra retracts",
    "abstract": "We study ascent and descent of the Golod property along an algebra retract. We characterise trivial extensions of modules, fibre products of rings to be Golod rings. We present a criterion for a graded module over a graded affine algebra of characteristic zero to be a Golod module.",
    "authors": [
      "Anjan Gupta"
    ],
    "publication_date": "2015-11-30T13:11:12Z",
    "arxiv_id": "http://arxiv.org/abs/1511.09292v2",
    "download_url": "https://arxiv.org/abs/1511.09292v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Examples of quantum cluster algebras associated to partial flag varieties",
    "abstract": "We give several explicit examples of quantum cluster algebra structures, as introduced by Berenstein and Zelevinsky, on quantized coordinate rings of partial flag varieties and their associated unipotent radicals. These structures are shown to be quantizations of the cluster algebra structures found on the corresponding classical objects by Geiss, Leclerc and Schroer, whose work generalizes that of several other authors. We also exhibit quantum cluster algebra structures on the quantized enveloping algebras of the Lie algebras of the unipotent radicals.",
    "authors": [
      "Jan E. Grabowski"
    ],
    "publication_date": "2009-07-28T16:33:27Z",
    "arxiv_id": "http://arxiv.org/abs/0907.4922v3",
    "download_url": "https://arxiv.org/abs/0907.4922v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integrals for braided Hopf algebras",
    "abstract": "Let H be a Hopf algebra in a rigid braided monoidal category with split idempotents. We prove the existence of integrals on (in) H characterized by the universal property, employing results about Hopf modules, and show that their common target (source) object Int H is invertible. The fully braided version of Radford's formula for the fourth power of the antipode is obtained. Connections of integration with cross-product and transmutation are studied. The results apply to topological Hopf algebras, e.g. a torus with a hole, which do not have additive structure.",
    "authors": [
      "Yuri Bespalov",
      "Thomas Kerler",
      "Volodymyr Lyubashenko",
      "Vladimir Turaev"
    ],
    "publication_date": "1997-09-12T21:32:07Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9709020v2",
    "download_url": "https://arxiv.org/abs/q-alg/9709020v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Categorical Hopf kernels and representations of semisimple Hopf algebras",
    "abstract": "In the category of semisimple Hopf algebras the Hopf kernels introduced by Andruskiewitsch and Devoto in \\cite{AD} coincide with kernels of representation as introduced in \\cite{Bker}. Some new results concerning the normality of kernels are also presented. It is proven that the property for Hopf algebras to have all kernels normal Hopf subalgebras is a self dual property.",
    "authors": [
      "Sebastian Burciu"
    ],
    "publication_date": "2010-10-11T13:14:03Z",
    "arxiv_id": "http://arxiv.org/abs/1010.2096v1",
    "download_url": "https://arxiv.org/abs/1010.2096v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cohomology of quantum groups: An analog of Kostant's Theorem",
    "abstract": "We prove the analog of Kostant's Theorem on Lie algebra cohomology in the context of quantum groups. We prove that Kostant's cohomology formula holds for quantum groups at a generic parameter $q$, recovering an earlier result of Malikov in the case where the underlying semisimple Lie algebra $\\mathfrak{g} = \\mathfrak{sl}(n)$. We also show that Kostant's formula holds when $q$ is specialized to an $\\ell$-th root of unity for odd $\\ell \\ge h-1$ (where $h$ is the Coxeter number of $\\mathfrak{g}$) when the highest weight of the coefficient module lies in the lowest alcove. This can be regarded as an extension of results of Friedlander-Parshall and Polo-Tilouine on the cohomology of Lie algebras of reductive algebraic groups in prime characteristic.",
    "authors": [
      "University of Georgia VIGRE Algebra Group",
      "Irfan Bagci",
      "Brian D. Boe",
      "Leonard Chastkofsky",
      "Benjamin Connell",
      "Benjamin Jones",
      "Wenjing Li",
      "Daniel K. Nakano",
      "Kenyon J. Platt",
      "Jae-Ho Shin",
      "Caroline B. Wright"
    ],
    "publication_date": "2008-09-04T15:32:39Z",
    "arxiv_id": "http://arxiv.org/abs/0809.0838v1",
    "download_url": "https://arxiv.org/abs/0809.0838v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Polarization algebras and their relations",
    "abstract": "Using an approach to the Jacobian Conjecture by L.M. Drużkowski and K. Rusek 12], G. Gorni and G. Zampieri [19], and A.V. Yagzhev[27], we describe a correspondence between finite dimensional symmetric algebras and homogeneous tuples of elements of polynomial algebras. We show that this correspondence closely relates Albert's problem [10, Problem 1.1], in classical ring theory and the homogeneous dependence problem [13, page 145, Problem 7.1.5], in affine algebraic geometry related to the Jacobian Conjecture. We demonstrate these relations in concrete examples and formulate some open questions.",
    "authors": [
      "Ualbai Umirbaev"
    ],
    "publication_date": "2014-12-07T16:10:59Z",
    "arxiv_id": "http://arxiv.org/abs/1412.2365v1",
    "download_url": "https://arxiv.org/abs/1412.2365v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The multigraded Nijenhuis-Richardson Algebra, its universal property and application",
    "abstract": "We define two $(n+1)$ graded Lie brackets on spaces of multilinear mappings. The first one is able to recognize $n$-graded associative algebras and their modules and gives immediately the correct differential for Hochschild cohomology. The second one recognizes $n$-graded Lie algebra structures and their modules and gives rise to the notion of Chevalley cohomology.",
    "authors": [
      "Pierre Lecomte",
      "Peter W. Michor",
      "Hubert Schicketanz"
    ],
    "publication_date": "1992-01-01T00:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/math/9201257v1",
    "download_url": "https://arxiv.org/abs/math/9201257v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tensor products of strongly graded vertex algebras and their modules",
    "abstract": "We study strongly graded vertex algebras and their strongly graded modules, which are conformal vertex algebras and their modules with a second, compatible grading by an abelian group satisfying certain grading restriction conditions. We consider a tensor product of strongly graded vertex algebras and its tensor product strongly graded modules. We prove that a tensor product of strongly graded irreducible modules for a tensor product of strongly graded vertex algebras is irreducible, and that such irreducible modules, up to equivalence, exhaust certain naturally defined strongly graded irreducible modules for a tensor product of strongly graded vertex algebras. We also prove that certain naturally defined strongly graded modules for the tensor product strongly graded vertex algebra are completely reducible if and only if every strongly graded module for each of the tensor product factors is completely reducible. These results generalize the corresponding known results for vertex operator algebras and their modules.",
    "authors": [
      "Jinwei Yang"
    ],
    "publication_date": "2012-01-05T19:32:11Z",
    "arxiv_id": "http://arxiv.org/abs/1201.1271v4",
    "download_url": "https://arxiv.org/abs/1201.1271v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the lower central series of an associative algebra",
    "abstract": "This paper continues the study of the lower central series quotients of an associative algebra A, regarded as a Lie algebra, which was started in math/0610410 by Feigin and Shoikhet. Namely, it provides a basis for the second quotient in the case when A is the free algebra in n generators (note that the Hilbert series of this quotient was determined earlier in math/0610410). Further, it uses this basis to determine the structure of the second quotient in the case when A is the free algebra modulo the relations saying that the generators have given nilpotency orders. Finally, it determines the structure of the third and fourth quotient in the case of 2 generators, confirming an answer conjectured in math/0610410. Finally, in the appendix, the results of math/0610410 are generalized to the case when A is an arbitrary associative algebra (under certain conditions on $A$).",
    "authors": [
      "Galyna Dobrovolska",
      "John Kim",
      "Xiaoguang Ma",
      "Pavel Etingof"
    ],
    "publication_date": "2007-09-12T15:28:04Z",
    "arxiv_id": "http://arxiv.org/abs/0709.1905v3",
    "download_url": "https://arxiv.org/abs/0709.1905v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraically rigid simplicial complexes and graphs",
    "abstract": "We call a simplicial complex algebraically rigid if its Stanley-Reisner ring admits no nontrivial infinitesimal deformations, and call it inseparable if does not allow any deformation to other simplicial complexes. Algebraically rigid simplicial complexes are inseparable. In this paper we study inseparability and rigidity of Stanley-Reisner rings, and apply the general theory to letterplace ideals as well as to edge ideals of graphs. Classes of algebraically rigid simplicial complexes and graphs are identified.",
    "authors": [
      "Klaus Altmann",
      "Mina Bigdeli",
      "Juergen Herzog",
      "Dancheng Lu"
    ],
    "publication_date": "2015-03-27T13:55:22Z",
    "arxiv_id": "http://arxiv.org/abs/1503.08080v3",
    "download_url": "https://arxiv.org/abs/1503.08080v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mathieu Subspaces of Univariate Polynomial Algebras",
    "abstract": "We first give a characterization for Mathieu subspaces of univariate polynomial algebras over fields in terms of their radicals. We then deduce that for some classes of classical univariate orthogonal polynomials the Image Conjecture is true. We also prove two special cases of the one-dimensional Image Conjecture for univariate polynomial algebras $A[t]$ over commutative $\\Bbb Q$-algebras $A$.",
    "authors": [
      "Arno van den Essen",
      "Wenhua Zhao"
    ],
    "publication_date": "2010-12-09T14:35:44Z",
    "arxiv_id": "http://arxiv.org/abs/1012.2017v1",
    "download_url": "https://arxiv.org/abs/1012.2017v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some conjectures on generalized cluster algebras via the cluster formula and $D$-matrix pattern",
    "abstract": "In the theory of generalized cluster algebras, we build the so-called cluster formula and $D$-matrix pattern. Then as applications, some fundamental conjectures of generalized cluster algebras are solved affirmatively.",
    "authors": [
      "Peigen Cao",
      "Fang Li"
    ],
    "publication_date": "2016-11-26T07:37:21Z",
    "arxiv_id": "http://arxiv.org/abs/1611.08672v1",
    "download_url": "https://arxiv.org/abs/1611.08672v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Specialization maps for shuffle algebras of type $B_{n}$ and $G_{2}$",
    "abstract": "We define a filtration of Feigin-Odesskii's shuffle algebras of type B_n and G_2 using specialization maps, generalizing the results in type A_n case given by Negut and Tsymbaliuk. These filtrations are compatible with a class of PBW type bases for the quantum current algebras of type B_n and G_2.",
    "authors": [
      "Yue Hu"
    ],
    "publication_date": "2022-06-26T07:07:51Z",
    "arxiv_id": "http://arxiv.org/abs/2206.12806v3",
    "download_url": "https://arxiv.org/abs/2206.12806v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Skein theory for the D_{2n} planar algebras",
    "abstract": "We give a combinatorial description of the ``$D_{2n}$ planar algebra,'' by generators and relations. We explain how the generator interacts with the Temperley-Lieb braiding. This shows the previously known braiding on the even part extends to a `braiding up to sign' on the entire planar algebra.\n  We give a direct proof that our relations are consistent (using this `braiding up to sign'), give a complete description of the associated tensor category and principal graph, and show that the planar algebra is positive definite. These facts allow us to identify our combinatorial construction with the standard invariant of the subfactor $D_{2n}$.",
    "authors": [
      "Scott Morrison",
      "Emily Peters",
      "Noah Snyder"
    ],
    "publication_date": "2008-08-06T17:25:02Z",
    "arxiv_id": "http://arxiv.org/abs/0808.0764v4",
    "download_url": "https://arxiv.org/abs/0808.0764v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Actions of the Dipper-Donkin quantization GL_2 on the Clifford algebra C(1,3)",
    "abstract": "Following the method already developed for studying the actions of GL_q(2,C) on the Clifford algebra C(1,3) and its quantum invariants (Commun. in Algebra 27, 1843-1878(1999)), we study the action on C(1,3) of the quantum group GL_2 constructed by Dipper and Donkin. We are able of proving that there exists only two non-equivalent cases of actions with nontrivial \"perturbation\". The space of invariants are trivial in both cases. We also prove that each irreducible finite dimensional algebra representation of the quantum group GL_2, q^m\\neq 1, is one dimensional. By studying the cases with zero \"perturbation\" we find that the cases with nonzero \"perturbation\" are the only ones with maximal possible dimension for the operator algebra \\Re.",
    "authors": [
      "Suemi Rodriguez-Romo"
    ],
    "publication_date": "1999-10-29T23:22:36Z",
    "arxiv_id": "http://arxiv.org/abs/math/9910173v1",
    "download_url": "https://arxiv.org/abs/math/9910173v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prime splittings of Determinantal Ideals",
    "abstract": "We consider determinantal ideals, where the generating minors are encoded in a hypergraph. We study when the generating minors form a Gröbner basis. In this case, the ideal is radical, and we can describe algebraic and numerical invariants of these ideals in terms of combinatorial data of their hypergraphs, such as the clique decomposition. In particular, we can construct a minimal free resolution as a tensor product of the minimal free resolution of their cliques. For several classes of hypergraphs we find a combinatorial description of the minimal primes in terms of a prime splitting. That is, we write the determinantal ideal as a sum of smaller determinantal ideals such that each minimal prime is a sum of minimal primes of the summands.",
    "authors": [
      "Fatemeh Mohammadi",
      "Johannes Rauh"
    ],
    "publication_date": "2012-08-14T17:34:58Z",
    "arxiv_id": "http://arxiv.org/abs/1208.2930v3",
    "download_url": "https://arxiv.org/abs/1208.2930v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Resolution and Tor Algebra Structures of Grade 3 Ideals Defining Compressed Rings",
    "abstract": "Let $R=k[x,y,z]$ be a standard graded $3$-variable polynomial ring, where $k$ denotes any field. We study grade $3$ homogeneous ideals $I \\subseteq R$ defining compressed rings with socle $k(-s)^{\\ell} \\oplus k(-2s+1)$, where $s \\geq3$ and $\\ell \\geq 1$ are integers. The case for $\\ell =1$ was studied in a previous paper by the author; a generically minimal resolution was constructed for all such ideals. More recently, this resolution is generalized in the guise of (iterated) trimming complexes. In this paper, we show that all ideals of the above form are resolved by an iterated trimming complex. Moreover, we apply this machinery to construct ideals $I$ such that $R/I$ is a ring of Tor algebra class $G (r)$ for some fixed $r \\geq2$, and $R/I$ may be chosen to have arbitrarily large type. In particular, this provides a new class of counterexamples to a conjecture of Avramov not already constructed by Christensen, Veliche, and Weyman.",
    "authors": [
      "Keller VandeBogert"
    ],
    "publication_date": "2020-04-14T17:48:09Z",
    "arxiv_id": "http://arxiv.org/abs/2004.06691v2",
    "download_url": "https://arxiv.org/abs/2004.06691v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hochschild cohomology commutes with adic completion",
    "abstract": "For a flat commutative $k$-algebra $A$ such that the enveloping algebra $A\\otimes_k A$ is noetherian, given a finitely generated bimodule $M$, we show that the adic completion of the Hochschild cohomology module $HH^n(A/k,M)$ is naturally isomorphic to $HH^n(\\widehat{A}/k,\\widehat{M})$. To show this, we (1) make a detailed study of derived completion as a functor $D(A) \\to D(\\widehat{A})$ over a non-noetherian ring $A$; (2) prove a flat base change result for weakly proregular ideals; and (3) Prove that Hochschild cohomology and analytic Hochschild cohomology of complete noetherian local rings are isomorphic, answering a question of Buchweitz and Flenner. Our results makes it possible for the first time to compute the Hochschild cohomology of $k[[t_1,\\dots,t_n]]$ over any noetherian ring $k$, and open the door for a theory of Hochschild cohomology over formal schemes.",
    "authors": [
      "Liran Shaul"
    ],
    "publication_date": "2015-05-15T19:28:16Z",
    "arxiv_id": "http://arxiv.org/abs/1505.04172v3",
    "download_url": "https://arxiv.org/abs/1505.04172v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the dimension of Schur multiplier of Lie algebras of maximal class",
    "abstract": "The paper is devoted to obtain an upper bound for the Schur multiplier of nilpotent Lie algebras of maximal class. It improves the later upper bounds on the Schur multiplier of such Lie algebras.",
    "authors": [
      "Afsaneh Shamsaki",
      "Peyman Niroomand"
    ],
    "publication_date": "2017-12-01T10:22:05Z",
    "arxiv_id": "http://arxiv.org/abs/1712.00261v1",
    "download_url": "https://arxiv.org/abs/1712.00261v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic properties of word equations",
    "abstract": "The question about maximal size of independent system of word equations is one of the most striking problems in combinatorics on words. Recently, Aleksi Saarela has introduced a new approach to the problem that is based on linear-algebraic properties of polynomials encoding the equations and their solutions. In this paper we develop further this approach and take into account other algebraic properties of polynomials, namely their factorization. This, in particular, allows to improve the bound for the number of independent equations with maximal rank from quadratic to linear.",
    "authors": [
      "Štěpán Holub",
      "Jan Žemlička"
    ],
    "publication_date": "2014-03-08T09:07:57Z",
    "arxiv_id": "http://arxiv.org/abs/1403.1951v2",
    "download_url": "https://arxiv.org/abs/1403.1951v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Lie algebra crossed modules",
    "abstract": "This article constructs a crossed module corresponding to the generator of the third cohomology group with trivial coefficients of a complex simple Lie algebra. This generator reads as <[,],>, constructed from the Lie bracket [,] and the Killing form <,>. The construction is inspired by the corresponding construction for the Lie algebra of formal vector fields in one formal variable on R, and its subalgebra sl_2(R), where the generator is usually called Godbillon-Vey class.",
    "authors": [
      "Friedrich Wagemann"
    ],
    "publication_date": "2006-11-13T08:34:40Z",
    "arxiv_id": "http://arxiv.org/abs/math/0611375v1",
    "download_url": "https://arxiv.org/abs/math/0611375v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Poincare series of some pure and mixed trace algebras of two generic matrices",
    "abstract": "We work over a field K of characteristic zero. The Poincare series for the algebra C_{n,2} of GL_n-invariants and the algebra T_{n,2} of GL_n-concomitants of two generic n x n matrices x and y are presented for n less than or equal 6. Both simply graded and bigraded cases are included. The cases for n at most 4 were known previously. If n=5 or 6, we show that C_{n,2} has no bigraded system of parameters. For the algebra C_{4,2} and C_{5,2} we construct a minimal set of generators and give an application to Specht's theorem on unitary similarity of two complex matrices. Five conjectures are proposed concerning the numerators and denominators of various Poincare series mentioned above. Some heuristic formulas and open problems are stated.",
    "authors": [
      "Dragomir Z. Djokovic"
    ],
    "publication_date": "2006-09-09T23:57:02Z",
    "arxiv_id": "http://arxiv.org/abs/math/0609262v1",
    "download_url": "https://arxiv.org/abs/math/0609262v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The nil Temperley--Lieb algebra of type affine C",
    "abstract": "We introduce a type affine $C$ analogue of the nil Temperley--Lieb algebra, in terms of generators and relations. We show that this algebra $T(n)$, which is a quotient of the positive part of a Kac--Moody algebra of type $D_{n+1}^{(2)}$, has an easily described faithful representation as an algebra of creation and annihilation operators on particle configurations, reminiscent of the open TASEP model in statistical physics. The centre of $T(n)$ consists of polynomials in a certain element $Q$, and $T(n)$ is a free module of finite rank over its centre. We show how to localize $T(n)$ by adjoining an inverse of $Q$, and prove that the resulting algebra is a full matrix ring over a ring of Laurent polynomials over a field. Although $T(n)$ has wild representation type, over an algebraically closed field we can classify all the finite dimensional indecomposable representations of $T(n)$ in which $Q$ acts invertibly.",
    "authors": [
      "R. M. Green"
    ],
    "publication_date": "2017-03-07T21:52:29Z",
    "arxiv_id": "http://arxiv.org/abs/1703.02609v4",
    "download_url": "https://arxiv.org/abs/1703.02609v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$U_q(\\hat{\\frak{gl}}_{{}_N})$ action on $\\hat{\\frak{gl}}_{{}_N}$ -modules and quantum toroidal algebras",
    "abstract": "We construct a vertex representation for the quantum toroidal algebra through the quantum general linear algebra. Using a new realization of the quantum general linear algebra we construct vertex operators for root vectors on the basic representation of the affine Lie algebra $gl_n$ and show that the simple generators give rise a realization of the quantum toroidal algebra with two parameters.",
    "authors": [
      "Yun Gao",
      "Naihuan Jing"
    ],
    "publication_date": "2002-02-27T17:06:05Z",
    "arxiv_id": "http://arxiv.org/abs/math/0202292v1",
    "download_url": "https://arxiv.org/abs/math/0202292v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Invariants in divided power algebras",
    "abstract": "Let $k$ be an algebraically closed field of characteristic $p>0$, let G=GL_n be the general linear group over $k$, let g=gl_n be its Lie algebra and let $D_s$ be subalgebra of the divided power algebra of g^* spanned by the divided power monomials with exponents $<p^s$. We give a basis for the $G$-invariants in $D_s$ up to degree $n$ and show that these are also the g-invariants.\n  We define a certain natural \\emph{restriction property} and show that it doesn't hold when $s>1$. If $s=1$, then $D_1$ is isomorphic to the truncated coordinate ring of g of dimension p^{dim(g)} and we conjecture that the restriction property holds and show that this leads to a conjectural spanning set for the invariants (in all degrees).\n  We give similar results for the divided power algebras of several matrices and of vectors and covectors, and show that in the second case the restriction property doesn't hold.\n  We also give the dimensions of the filtration subspaces of degree $\\le n$ of the centre of the hyper algebra of Dist(G_s).",
    "authors": [
      "Rudolf Tange"
    ],
    "publication_date": "2023-07-06T15:03:33Z",
    "arxiv_id": "http://arxiv.org/abs/2307.03037v3",
    "download_url": "https://arxiv.org/abs/2307.03037v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Jones Index Theorem revisited",
    "abstract": "We prove the Jones Index Theorem using the K-theory of a cluster $C^*$-algebra of the Riemann sphere with two boundary components.",
    "authors": [
      "Andrey Yu. Glubokov",
      "Igor V. Nikolaev"
    ],
    "publication_date": "2018-01-17T00:19:54Z",
    "arxiv_id": "http://arxiv.org/abs/1801.05510v3",
    "download_url": "https://arxiv.org/abs/1801.05510v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$(G,χ_φ)$-equivariant $φ$-coordinated quasi modules for nonlocal vertex algebras",
    "abstract": "In this paper, we study $(G,χ_φ)$-equivariant $φ$-coordinated quasi modules for nonlocal vertex algebras. Among the main results, we establish several conceptual results, including a generalized commutator formula and a general construction of weak quantum vertex algebras and their $(G,χ_φ)$-equivariant $φ$-coordinated quasi modules. As an application, we also construct (equivariant) $φ$-coordinated quasi modules for lattice vertex algebras by using Lepowsky's work on twisted vertex operators.",
    "authors": [
      "Naihuan Jing",
      "Fei Kong",
      "Haisheng Li",
      "Shaobin Tan"
    ],
    "publication_date": "2020-08-13T15:57:05Z",
    "arxiv_id": "http://arxiv.org/abs/2008.05982v1",
    "download_url": "https://arxiv.org/abs/2008.05982v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Neutrabelian algebras",
    "abstract": "We introduce \"neutrabelian algebras\", and prove that finite, hereditarily neutrabelian algebras with a cube term are dualizable.",
    "authors": [
      "Keith A. Kearnes",
      "Connor Meredith",
      "Agnes Szendrei"
    ],
    "publication_date": "2020-07-13T09:08:34Z",
    "arxiv_id": "http://arxiv.org/abs/2007.07198v1",
    "download_url": "https://arxiv.org/abs/2007.07198v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of five-dimensional nilpotent Jordan algebras",
    "abstract": "The paper is devoted to classify nilpotent Jordan algebras of dimension up to five over an algebraically closed field of characteristic not 2. We obtained a list of 35 isolated non-isomorphic 5-dimensional nilpotent non-associative Jordan algebras and 6 families of non-isomorphic 5-dimensional nilpotent non-associative Jordan algebras depending either on one or two parameters over an algebraically closed field of characteristic not 2 or 3. In addition to these algebras we obtained two non-isomorphic 5-dimensional nilpotent non-associative Jordan algebras over an algebraically closed field of characteristic 3.",
    "authors": [
      "A. S. Hegazi",
      "Hani Abdelwahab"
    ],
    "publication_date": "2014-01-16T11:31:31Z",
    "arxiv_id": "http://arxiv.org/abs/1401.3992v2",
    "download_url": "https://arxiv.org/abs/1401.3992v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Skew group algebras of Jacobian algebras",
    "abstract": "For a quiver with potential $(Q,W)$ with an action of a finite cyclic group $G$, we study the skew group algebra $ΛG$ of the Jacobian algebra $Λ= \\mathcal P(Q, W)$. By a result of Reiten and Riedtmann, the quiver $Q_G$ of a basic algebra $η( ΛG) η$ Morita equivalent to $ΛG$ is known. Under some assumptions on the action of $G$, we explicitly construct a potential $W_G$ on $Q_G$ such that $η(ΛG) η\\cong \\mathcal P(Q_G , W_G)$. The original quiver with potential can then be recovered by the skew group algebra construction with a natural action of the dual group of $G$. If $Λ$ is self-injective, then $ΛG$ is as well, and we investigate this case. Motivated by Herschend and Iyama's characterisation of 2-representation finite algebras, we study how cuts on $(Q,W)$ behave with respect to our construction.",
    "authors": [
      "Simone Giovannini",
      "Andrea Pasquali"
    ],
    "publication_date": "2018-05-10T16:15:03Z",
    "arxiv_id": "http://arxiv.org/abs/1805.04041v4",
    "download_url": "https://arxiv.org/abs/1805.04041v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sequence-regular commutative DG-rings",
    "abstract": "We introduce a new class of commutative noetherian DG-rings which generalizes the class of regular local rings. These are defined to be local DG-rings $(A,\\bar{\\mathfrak{m}})$ such that the maximal ideal $\\bar{\\mathfrak{m}} \\subseteq \\mathrm{H}^0(A)$ can be generated by an $A$-regular sequence. We call these DG-rings sequence-regular DG-rings, and make a detailed study of them. Using methods of Cohen-Macaulay differential graded algebra, we prove that the Auslander-Buchsbaum-Serre theorem about localization generalizes to this setting. This allows us to define global sequence-regular DG-rings, and to introduce this regularity condition to derived algebraic geometry. It is shown that these DG-rings share many properties of classical regular local rings, and in particular we are able to construct canonical residue DG-fields in this context. Finally, we show that sequence-regular DG-rings are ubiquitous, and in particular, any eventually coconnective derived algebraic variety over a perfect field is generically sequence-regular.",
    "authors": [
      "Liran Shaul"
    ],
    "publication_date": "2021-06-15T12:55:38Z",
    "arxiv_id": "http://arxiv.org/abs/2106.08109v2",
    "download_url": "https://arxiv.org/abs/2106.08109v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rees Algebras and Almost Linearly Presented Ideals",
    "abstract": "Consider a grade 2 perfect ideal $I$ in $R=k[x_1,\\cdots,x_d]$ which is generated by forms of the same degree. Assume that the presentation matrix $\\varphi$ is almost linear, that is, all but the last column of $\\varphi$ consist of entries which are linear. For such ideals, we find explicit forms of the defining ideal of the Rees algebra $\\mathcal{R}(I)$. We also introduce the notion of iterated Jacobian duals.",
    "authors": [
      "Jacob A. Boswell",
      "Vivek Mukundan"
    ],
    "publication_date": "2015-05-19T01:58:58Z",
    "arxiv_id": "http://arxiv.org/abs/1505.04851v1",
    "download_url": "https://arxiv.org/abs/1505.04851v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Arithmetic invariants of pseudoreflection groups and regular graded algebras",
    "abstract": "The main result of this paper is a generalization of the theorem of Chevalley-Shephard-Todd to the rings of invariants of pseudoreflection groups over Dedekind domains. In the special case of a principal ideal domain in which the group order is invertible it is proved that this ring of invariants is isomorphic to a polynomial ring. An intermediate result is that every finitely generated regular graded algebra over a Dedekind domain is isomorphic to a tensor product of blowup algebras.",
    "authors": [
      "David Mundelius"
    ],
    "publication_date": "2017-11-22T10:06:13Z",
    "arxiv_id": "http://arxiv.org/abs/1711.08201v2",
    "download_url": "https://arxiv.org/abs/1711.08201v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite generation of Andre-Quillen (co-)homology of F-finite algebras",
    "abstract": "We prove that the Andre-Quillen homology and cohomology modules of F-finite Z(p)-algebras are finitely generated.",
    "authors": [
      "Cristodor Ionescu"
    ],
    "publication_date": "2019-09-27T12:37:04Z",
    "arxiv_id": "http://arxiv.org/abs/1909.12652v1",
    "download_url": "https://arxiv.org/abs/1909.12652v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The half-twist for U_q(g) representations",
    "abstract": "We introduce the notion of a half-ribbon Hopf algebra, which is a ribbon Hopf algebra along with a distinguished element $t$ corresponding to twisting a ribbon by 180 degrees (the half-twist). We show that U_q(g) is a (topological) half-ribbon Hopf algebra, but only if one uses a modified ribbon element. We then discuss some consequences of using this modified ribbon element.",
    "authors": [
      "Noah Snyder",
      "Peter Tingley"
    ],
    "publication_date": "2008-10-01T06:58:49Z",
    "arxiv_id": "http://arxiv.org/abs/0810.0084v3",
    "download_url": "https://arxiv.org/abs/0810.0084v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the quiver of the descent algebra",
    "abstract": "We study the quiver of the descent algebra of a finite Coxeter group W. The results include a derivation of the quiver of the descent algebra of types A and B. Our approach is to study the descent algebra as an algebra constructed from the reflection arrangement associated to W.",
    "authors": [
      "Franco V. Saliola"
    ],
    "publication_date": "2007-08-30T18:15:15Z",
    "arxiv_id": "http://arxiv.org/abs/0708.4213v2",
    "download_url": "https://arxiv.org/abs/0708.4213v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structure of the Loday-Ronco Hopf algebra of trees",
    "abstract": "Loday and Ronco defined an interesting Hopf algebra structure on the linear span of the set of planar binary trees. They showed that the inclusion of the Hopf algebra of non-commutative symmetric functions in the Malvenuto-Reutenauer Hopf algebra of permutations factors through their Hopf algebra of trees, and these maps correspond to natural maps from the weak order on the symmetric group to the Tamari order on planar binary trees to the boolean algebra.\n  We further study the structure of this Hopf algebra of trees using a new basis for it. We describe the product, coproduct, and antipode in terms of this basis and use these results to elucidate its Hopf-algebraic structure. We also obtain a transparent proof of its isomorphism with the non-commutative Connes-Kreimer Hopf algebra of Foissy, and show that this algebra is related to non-commutative symmetric functions as the (commutative) Connes-Kreimer Hopf algebra is related to symmetric functions.",
    "authors": [
      "Marcelo Aguiar",
      "Frank Sottile"
    ],
    "publication_date": "2004-09-02T06:30:41Z",
    "arxiv_id": "http://arxiv.org/abs/math/0409022v2",
    "download_url": "https://arxiv.org/abs/math/0409022v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representation theory of 0-Hecke-Clifford algebras",
    "abstract": "The representation theory of 0-Hecke-Clifford algebras as a degenerate case is not semisimple and also with rich combinatorial meaning. Bergeron et al. have proved that the Grothendieck ring of the category of finitely generated supermodules of 0-Hecke-Clifford algebras is isomorphic to the algebra of peak quasisymmetric functions defined by Stembridge. In this paper we further study the category of finitely generated projective supermodules and clarify the correspondence between it and the peak algebra of symmetric groups. In particular, two kinds of restriction rules for induced projective supermodules are obtained. After that, we consider the corresponding Heisenberg double and its Fock representation to prove that the ring of peak quasisymmetric functions is free over the subring of symmetric functions spanned by Schur's Q-functions.",
    "authors": [
      "Yunnan Li"
    ],
    "publication_date": "2015-04-20T02:38:04Z",
    "arxiv_id": "http://arxiv.org/abs/1504.04922v1",
    "download_url": "https://arxiv.org/abs/1504.04922v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cosets of affine vertex algebras inside larger structures",
    "abstract": "Given a finite-dimensional reductive Lie algebra $\\mathfrak{g}$ equipped with a nondegenerate, invariant, symmetric bilinear form $B$, let $V^k(\\mathfrak{g},B)$ denote the universal affine vertex algebra associated to $\\mathfrak{g}$ and $B$ at level $k$. Let $\\mathcal{A}^k$ be a vertex (super)algebra admitting a homomorphism $V^k(\\mathfrak{g},B)\\rightarrow \\mathcal{A}^k$. Under some technical conditions on $\\mathcal{A}^k$, we characterize the coset $\\text{Com}(V^k(\\mathfrak{g},B),\\mathcal{A}^k)$ for generic values of $k$. We establish the strong finite generation of this coset in full generality in the following cases: $\\mathcal{A}^k = V^k(\\mathfrak{g}',B')$, $\\mathcal{A}^k = V^{k-l}(\\mathfrak{g}',B') \\otimes \\mathcal{F}$, and $\\mathcal{A}^k = V^{k-l}(\\mathfrak{g}',B') \\otimes V^{l}(\\mathfrak{g}\",B\")$. Here $\\mathfrak{g}'$ and $\\mathfrak{g}\"$ are finite-dimensional Lie (super)algebras containing $\\mathfrak{g}$, equipped with nondegenerate, invariant, (super)symmetric bilinear forms $B'$ and $B\"$ which extend $B$, $l \\in \\mathbb{C}$ is fixed, and $\\mathcal{F}$ is a free field algebra admitting a homomorphism $V^l(\\mathfrak{g},B) \\rightarrow \\mathcal{F}$. Our approach is essentially constructive and leads to minimal strong finite generating sets for many interesting examples. As an application, we give a new proof of the rationality of the simple $N=2$ superconformal algebra with $c=\\frac{3k}{k+2}$ for all positive integers $k$.",
    "authors": [
      "Thomas Creutzig",
      "Andrew R. Linshaw"
    ],
    "publication_date": "2014-07-31T18:24:28Z",
    "arxiv_id": "http://arxiv.org/abs/1407.8512v6",
    "download_url": "https://arxiv.org/abs/1407.8512v6",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Minimal 3-generated Majorana algebras",
    "abstract": "Majorana theory was introduced by A. A. Ivanov as the axiomatization of certain properties of the 2A-axes of the Griess algebra. Since its inception, Majorana theory has proved to be a remarkable tool with which to study objects related to the Griess algebra and the Monster simple group. We introduce the definition of a minimal 3-generated Majorana algebra and begin the first steps towards classifying such algebras.\n  In particular, we give a complete classification of finite minimal 3-generated 6-transposition groups. We then use an algorithm developed in GAP by M. Pfeiffer and M. Whybrow, together with some additional computational tools, to give an almost complete description of all minimal 3-generated Majorana algebras arising from this list of groups.",
    "authors": [
      "Andrey Mamontov",
      "Alexey Staroletov",
      "Madeleine Whybrow"
    ],
    "publication_date": "2018-09-10T08:47:51Z",
    "arxiv_id": "http://arxiv.org/abs/1809.03184v2",
    "download_url": "https://arxiv.org/abs/1809.03184v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Constants of Weitzenböck derivations and invariants of unipotent transformations acting on relatively free algebras",
    "abstract": "In commutative algebra, a Weitzenböck derivation is a nonzero triangular linear derivation of the polynomial algebra $K[x_1,...,x_m]$ in several variables over a field $K$ of characteristic 0. The classical theorem of Weitzenböck states that the algebra of constants is finitely generated. (This algebra coincides with the algebra of invariants of a single unipotent transformation.) In this paper we study the problem of finite generation of the algebras of constants of triangular linear derivations of finitely generated (not necessarily commutative or associative) algebras over $K$ assuming that the algebras are free in some sense (in most of the cases relatively free algebras in varieties of associative or Lie algebras). In this case the algebra of constants also coincides with the algebra of invariants of some unipotent transformation. \\par The main results are the following: 1. We show that the subalgebra of constants of a factor algebra can be lifted to the subalgebra of constants. 2. For all varieties of associative algebras which are not nilpotent in Lie sense the subalgebras of constants of the relatively free algebras of rank $\\geq 2$ are not finitely generated. 3. We describe the generators of the subalgebra of constants for all factor algebras $K< x,y>/I$ modulo a $GL_2(K)$-invariant ideal $I$. 4. Applying known results from commutative algebra, we construct classes of automorphisms of the algebra generated by two generic $2\\times 2$ matrices. We obtain also some partial results on relatively free Lie algebras.",
    "authors": [
      "Vesselin Drensky",
      "C. K. Gupta"
    ],
    "publication_date": "2004-12-20T10:52:25Z",
    "arxiv_id": "http://arxiv.org/abs/math/0412399v1",
    "download_url": "https://arxiv.org/abs/math/0412399v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-dimensional vertex algebra modules over fixed point differential subfields",
    "abstract": "Let $K$ be a differential field over $\\C$ with derivation $D$, $G$ a finite linear automorphism group over $K$ which preserves $D$, and $K^G$ the fixed point subfield of $K$ under the action of $G$. We show that every finite-dimensional vertex algebra $K^G$-module is contained in some twisted vertex algebra $K$-module.",
    "authors": [
      "Kenichiro Tanabe"
    ],
    "publication_date": "2009-11-01T23:42:34Z",
    "arxiv_id": "http://arxiv.org/abs/0911.0216v2",
    "download_url": "https://arxiv.org/abs/0911.0216v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "F-ideals of degree 2",
    "abstract": "In this paper, we introduce the concept of f-ideals and discuss its algebraic properties. In particular, we give the characterization of all the f-ideals of degree 2.",
    "authors": [
      "G. Q. Abbasi",
      "Sarfraz Ahmad",
      "Imran Anwar",
      "Waqas A. Baig"
    ],
    "publication_date": "2011-01-10T11:49:21Z",
    "arxiv_id": "http://arxiv.org/abs/1101.1780v1",
    "download_url": "https://arxiv.org/abs/1101.1780v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of compatible left-symmetric conformal algebraic structures on the Lie conformal algebra $\\mathcal{W}(a,b)$",
    "abstract": "In this paper, under some natural condition, a complete classification of compatible left-symmetric conformal algebraic structures on the Lie conformal algebra $\\mathcal{W}(a,b)$ is presented. Moreover, applying this result, we obtain a class of compatible left-symmetric algebraic structures on the coefficient algebra of $\\mathcal{W}(a,b)$.",
    "authors": [
      "Deng Liu",
      "Yanyong Hong",
      "Hao Zhou",
      "Nuan Zhang"
    ],
    "publication_date": "2018-08-18T02:51:00Z",
    "arxiv_id": "http://arxiv.org/abs/1808.06035v1",
    "download_url": "https://arxiv.org/abs/1808.06035v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The weak Lefschetz property for Standard graded, Artinian Gorenstein algebras of embedding dimension four and socle degree three",
    "abstract": "Let $\\pmb k$ be an arbitrary field and $A$ be a standard graded Artinian Gorenstein $\\pmb k$-algebra of embedding dimension four and socle degree three. Then, except for exactly one exception, $A$ has the weak Lefschetz property. Furthermore, the exception occurs only in characteristic two.",
    "authors": [
      "Andrew R. Kustin"
    ],
    "publication_date": "2024-04-11T21:01:12Z",
    "arxiv_id": "http://arxiv.org/abs/2404.08123v1",
    "download_url": "https://arxiv.org/abs/2404.08123v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multiplicities and Betti numbers in local algebra via lim Ulrich points",
    "abstract": "This work concerns finite free complexes with finite length homology over a commutative noetherian local ring $R$. The focus is on complexes that have length $\\mathrm{dim}\\, R$, which is the smallest possible value, and in particular on free resolutions of modules of finite length and finite projective dimension. Lower bounds are obtained on the Euler characteristic of such short complexes when $R$ is a strict complete intersection, and also on the Dutta multiplicity, when $R$ is the localization at its maximal ideal of a standard graded algebra over a field of positive prime characteristic. The key idea in the proof is the construction of a suitable Ulrich module, or, in the latter case, a sequence of modules that have the Ulrich property asymptotically, and with good convergence properties in the rational Grothendieck group of $R$. Such a sequence is obtained by constructing an appropriate sequence of sheaves on the associated projective variety.",
    "authors": [
      "Srikanth B. Iyengar",
      "Linquan Ma",
      "Mark E. Walker"
    ],
    "publication_date": "2021-04-20T17:30:41Z",
    "arxiv_id": "http://arxiv.org/abs/2104.10140v2",
    "download_url": "https://arxiv.org/abs/2104.10140v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Whittaker vectors of the Virasoro algebra in terms of Jack symmetric polynomial",
    "abstract": "We give explicit formulae of Whittaker vectors for Virasoro algebra in terms of the Jack symmetric polynomials. Our fundamental tools are the Feigin-Fuchs bosonization and the split expression of the Calogero-Sutherland model given by Awata-Matsuo-Odake-Shiraishi.",
    "authors": [
      "Shintarou Yanagida"
    ],
    "publication_date": "2010-03-04T13:55:34Z",
    "arxiv_id": "http://arxiv.org/abs/1003.1049v2",
    "download_url": "https://arxiv.org/abs/1003.1049v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Jordan degree type for codimension three Gorenstein algebras of small Sperner number",
    "abstract": "The Jordan type $P_{A,\\ell}$ of a linear form $\\ell$ acting on a graded Artinian algebra $A$ over a field $\\sf k$ is the partition describing the Jordan block decomposition of the multiplication map $m_\\ell$, which is nilpotent. The Jordan degree type $\\mathcal S_{A,\\ell}$ is a finer invariant, describing also the initial degrees of the simple submodules of $A$ in a decomposition of $A$ as ${\\sf k}[\\ell]$-modules. The set of Jordan types of $A$ or Jordan degree types (JDT) of $A$ as $\\ell$ varies, is an invariant of the algebra. This invariant has been studied for codimension two graded algebras. We here extend the previous results to certain codimension three graded Artinian Gorenstein (AG) algebras - those of small Sperner number. Given a Gorenstein sequence $T$ - one possible for the Hilbert function of a codimension three AG algebra - the irreducible variety $\\mathrm{Gor}(T)$ parametrizes all Gorenstein algebras of Hilbert function $T$. We here completely determine the JDT possible for all pairs $(A,\\ell), A\\in \\mathrm{Gor}(T)$, for Gorenstein sequences $T$ of the form $T=(1,3,s^k,3,1)$ for Sperner number $s=3,4,5$ and arbitrary multiplicity $k$. For $s=6$ we delimit the prospective JDT, without verifying that each occurs.",
    "authors": [
      "Nancy Abdallah",
      "Nasrin Altafi",
      "Anthony Iarrobino",
      "Joachim Yaméogo"
    ],
    "publication_date": "2024-06-10T14:37:27Z",
    "arxiv_id": "http://arxiv.org/abs/2406.06322v2",
    "download_url": "https://arxiv.org/abs/2406.06322v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representations of the vertex algebra $W_{1+\\infty}$ with a negative integer central charge",
    "abstract": "Let $\\D$ be the Lie algebra of regular differentialoperators on ${\\C} \\setminus \\{0\\}$, and ${\\hD}= {\\D} + {\\C} C$ be the central extension of ${\\D}$. Let $W_{1+\\infty,-N}$ be the vertex algebra associated to the irreducible vacuum $\\hD$-module with the central charge $c=-N$. We show that $W_{1+\\infty,-N}$ is a subalgebra of the Heisenberg vertex algebra M(1) with $2 N$ generators, and construct 2N-dimensional family of irreducible $W_{1+\\infty,-N}$-modules. Considering these modules as $\\hD$-modules, we identify the corresponding highest weights.",
    "authors": [
      "Drazen Adamovic"
    ],
    "publication_date": "1999-04-13T19:21:03Z",
    "arxiv_id": "http://arxiv.org/abs/math/9904057v1",
    "download_url": "https://arxiv.org/abs/math/9904057v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A classification result on prime Hopf algebras of GK-dimension one",
    "abstract": "In this paper, we classify all prime Hopf algebras $H$ of GK-dimension one satisfying the following two conditions: 1) $H$ has a 1-dimensional representation of order PI.deg$(H)$ and 2) the invariant components of $H$ with respect to this 1-dimensional representation are domains (see Section 2 for related definitions). As consequences, 1) a number of new Hopf algebras of GK-dimension one are found and some of them are not pointed, 2) we give a partial answer to a question posed by Brown and Zhang and 3) some new kinds of finite-dimensional Hopf algebras are found.",
    "authors": [
      "Gongxiang Liu"
    ],
    "publication_date": "2018-04-24T12:06:28Z",
    "arxiv_id": "http://arxiv.org/abs/1804.08973v2",
    "download_url": "https://arxiv.org/abs/1804.08973v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Tits--Kantor--Koecher construction for Jordan dialgebras",
    "abstract": "We study a noncommutative generalization of Jordan algebras called Jordan dialgebras. These are algebras that satisfy the identities $[x_1 x_2]x_3= 0$, $(x_1^2,x_2,x_3)=2(x_1,x_2,x_1x_3)$, $x_1(x_1^2 x_2)=x_1^2(x_1 x_2)$; they are related with Jordan algebras in the same way as Leibniz algebras are related to Lie algebras. We present an analogue of the Tits---Kantor---Koecher construction for Jordan dialgebras that provides an embedding of such an algebra into Leibniz algebra.",
    "authors": [
      "V. Yu. Gubarev",
      "P. S. Kolesnikov"
    ],
    "publication_date": "2009-07-10T07:01:51Z",
    "arxiv_id": "http://arxiv.org/abs/0907.1740v3",
    "download_url": "https://arxiv.org/abs/0907.1740v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modular Quantizations of Lie Algebras of Cartan Type K via Drinfeld Twists of Jordanian Type",
    "abstract": "We construct explicit Drinfel'd twists of Jordanian type for the generalized Cartan type K Lie algebras in characteristic 0 and obtain the corresponding quantizations, especially their integral forms. By making modular reductions including modulo p and modulo p-restrictedness reduction, and base changes, we derive certain modular quantizations of the restricted universal enveloping algebra $\\mathbf u(\\mathbf{K}(2n{+}1;\\underline{1}))$ for the restricted simple Lie algebra of Cartan type K in characteristic p. They are new pointed Hopf algebras of noncommutative and noncocommutative and with dimension $p^{p^{2n+1}+1}$ (if $2n+4\\not\\equiv0 \\; (\\mod p)$) or $p^{p^{2n+1}}$ (if $2n+4\\equiv0 \\; (\\mod p))$ over a truncated p-polynomials ring, which also contain the well-known Radford algebras as Hopf subalgebras. Some open questions are proposed.",
    "authors": [
      "Zhaojia Tong",
      "Naihong Hu"
    ],
    "publication_date": "2014-10-03T16:31:32Z",
    "arxiv_id": "http://arxiv.org/abs/1410.0905v2",
    "download_url": "https://arxiv.org/abs/1410.0905v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cohomology of left-symmetric color algebras",
    "abstract": "We develop a new cohomology theory for finite-dimensional left-symmetric color algebras and their finite-dimensional bimodules, establishing a connection between Lie color cohomology and left-symmetric color cohomology. We prove that the cohomology of a left-symmetric color algebra $A$ with coefficients in a bimodule $V$ can be computed by a lower degree cohomology of the corresponding Lie color algebra with coefficients in Hom$(A,V)$, generalizing a result of Dzhumadil'daev in right-symmetric cohomology. We also explore the varieties of two-dimensional and three-dimensional left-symmetric color algebras.",
    "authors": [
      "Yin Chen",
      "Runxuan Zhang"
    ],
    "publication_date": "2024-08-07T18:29:49Z",
    "arxiv_id": "http://arxiv.org/abs/2408.04033v2",
    "download_url": "https://arxiv.org/abs/2408.04033v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On non-connected pointed Hopf algebras of dimension 16 in characteristic 2",
    "abstract": "Let $\\mathbb{k}$ be an algebraically closed field. We give a complete classification of non-connected pointed Hopf algebras of dimension $16$ with char$\\,\\mathbb{k}=2$ that are generated by group-like elements and skew-primitive elements. It turns out that there are infinitely many classes (up to isomorphism) of pointed Hopf algebras of dimension 16. In particular, we obtain infinitely many new examples of non-commutative non-cocommutative finite-dimensional pointed Hopf algebras.",
    "authors": [
      "Rongchuan Xiong"
    ],
    "publication_date": "2019-06-16T14:11:55Z",
    "arxiv_id": "http://arxiv.org/abs/1906.06692v2",
    "download_url": "https://arxiv.org/abs/1906.06692v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Homalg: A meta-package for homological algebra",
    "abstract": "The central notion of this work is that of a functor between categories of finitely presented modules over so-called computable rings, i.e. rings R where one can algorithmically solve inhomogeneous linear equations with coefficients in R. The paper describes a way allowing one to realize such functors, e.g. Hom, tensor product, Ext, Tor, as a mathematical object in a computer algebra system. Once this is achieved, one can compose and derive functors and even iterate this process without the need of any specific knowledge of these functors. These ideas are realized in the ring independent package homalg. It is designed to extend any computer algebra software implementing the arithmetics of a computable ring R, as soon as the latter contains algorithms to solve inhomogeneous linear equations with coefficients in R. Beside explaining how this suffices, the paper describes the nature of the extensions provided by homalg.",
    "authors": [
      "Mohamed Barakat",
      "Daniel Robertz"
    ],
    "publication_date": "2007-01-04T18:16:55Z",
    "arxiv_id": "http://arxiv.org/abs/math/0701146v2",
    "download_url": "https://arxiv.org/abs/math/0701146v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Doi-Hopf Modules over Weak Hopf Algebras",
    "abstract": "The theory of Doi-Hopf modules is generalized to Weak Hopf algebras.",
    "authors": [
      "Gabriella Böhm"
    ],
    "publication_date": "1999-05-05T13:38:24Z",
    "arxiv_id": "http://arxiv.org/abs/math/9905027v1",
    "download_url": "https://arxiv.org/abs/math/9905027v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New approaches to bounding the multiplicity of an ideal",
    "abstract": "We use the theory of resolutions for a given Hilbert function to investigate the multiplicity conjectures of Huneke and Srinivasan and Herzog and Srinivasan. To prove the conjectures for all modules with a particular Hilbert function, we show that it is enough to prove the statements only for elements at the bottom of the partially ordered set of resolutions with that Hilbert function. This enables us to test the conjectured upper bound for the multiplicity efficiently with the computer algebra system Macaulay 2, and we verify the upper bound for many Artinian modules in three variables with small socle degree. Moreover, with this approach, we show that though numerical techniques have been sufficient in several of the known special cases, they are insufficient to prove the conjectures in general. Finally, we apply a result of Herzog and Srinivasan on ideals with a quasipure resolution to prove the upper bound for Cohen-Macaulay quotients by ideals with generators in high degrees relative to the regularity.",
    "authors": [
      "Christopher A. Francisco"
    ],
    "publication_date": "2005-06-01T18:16:33Z",
    "arxiv_id": "http://arxiv.org/abs/math/0506024v1",
    "download_url": "https://arxiv.org/abs/math/0506024v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A characterization of the Arf property for quadratic quotients of the Rees algebra",
    "abstract": "We provide a characterization of the Arf property in both the numerical duplication of a numerical semigroup and in a member of a family of quotients of the Rees algebra studied in arXiv:1403.4200 [math.AC]",
    "authors": [
      "Alessio Borzì"
    ],
    "publication_date": "2018-06-12T11:40:34Z",
    "arxiv_id": "http://arxiv.org/abs/1806.04448v4",
    "download_url": "https://arxiv.org/abs/1806.04448v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On tensor factorizations of Hopf algebras",
    "abstract": "We prove a variety results on tensor product factorizations of finite dimensional Hopf algebras (more generally Hopf algebras satisfying chain conditions in suitable braided categories). The results are analogs of well-known results on direct product factorizations of finite groups (or groups with chain conditions) such as Fitting's Lemma and the uniqueness of the Krull-Remak-Schmidt factorization. We analyze the notion of normal (and conormal) Hopf algebra endomorphisms, and the structure of endomorphisms and automorphisms of tensor products. The results are then applied to compute the automorphism group of the Drinfeld double of a finite group in the case where the group contains an abelian factor. (If it doesn't, the group can be calculated by results of the first author.)",
    "authors": [
      "Marc Keilberg",
      "Peter Schauenburg"
    ],
    "publication_date": "2014-10-23T08:48:18Z",
    "arxiv_id": "http://arxiv.org/abs/1410.6290v1",
    "download_url": "https://arxiv.org/abs/1410.6290v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The structure of smooth algebras in Kapranov's framework for noncommutative geometry",
    "abstract": "In Kapranov, M. {\\it Noncommutative geometry based on commutator expansions,} J. reine angew. Math {\\bf 505} (1998) 73-118, a theory of noncommutative algebraic varieties was proposed. Here we prove a structure theorem for the noncommutative coordinate rings of affine open subsets of such of those varieties which are smooth (Theorem 3.4). The theorem describes the local ring of a point as a truncation of a quantization of the enveloping Poisson algebra of a smooth commutative local algebra. An explicit descripition of this quantization is given in Theorem 2.5. A description of the $A$- module structure of the Poisson envelope of a smooth commutative algebra $A$ was given in loc. cit., Theorem 4.1.3. However the proof given in loc. cit. has a gap. We fix this gap for $A$ local (Theorem 1.4) and prove a weaker global result (Theorem 1.6).",
    "authors": [
      "Guillermo Cortiñas"
    ],
    "publication_date": "2000-02-22T08:22:49Z",
    "arxiv_id": "http://arxiv.org/abs/math/0002177v1",
    "download_url": "https://arxiv.org/abs/math/0002177v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Principal subspaces for the quantum affine vertex algebra in type $A_1^{(1)}$",
    "abstract": "By using the ideas of Feigin and Stoyanovsky and Calinescu, Lepowsky and Milas we introduce and study the principal subspaces associated with the Etingof-Kazhdan quantum affine vertex algebra of integer level $k\\geqslant 1$ and type $A_1^{(1)}$. We show that the principal subspaces possess the quantum vertex algebra structure, which turns to the usual vertex algebra structure of the principal subspaces of generalized Verma and standard modules at the classical limit. Moreover, we find their topological quasi-particle bases which correspond to the sum sides of certain Rogers-Ramanujan-type identities.",
    "authors": [
      "Marijana Butorac",
      "Slaven Kožić"
    ],
    "publication_date": "2020-11-26T00:26:32Z",
    "arxiv_id": "http://arxiv.org/abs/2011.13072v1",
    "download_url": "https://arxiv.org/abs/2011.13072v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Characteristics of Rota-Baxter Algebras",
    "abstract": "The characteristic is a simple yet important invariant of an algebra. In this paper, we study the characteristic of a Rota-Baxter algebra, called the Rota-Baxter characteristic. We introduce an invariant, called the ascent set, of a Rota-Baxter characteristic. By studying its properties, we classify Rota-Baxter characteristics in the homogenous case and relate Rota-Baxter characteristics in general to the homogeneous case through initial ideals. We show that the Rota-Baxter quotients of Rota-Baxter characteristics have the same underlying sets as those in the homogeneous case. We also give a more detailed study of Rota-Baxter characteristics with special base rings. In particular, we determine the prime characteristics of Rota-Baxter rings.",
    "authors": [
      "Li Guo",
      "Houyi Yu"
    ],
    "publication_date": "2015-11-03T14:55:22Z",
    "arxiv_id": "http://arxiv.org/abs/1511.00936v1",
    "download_url": "https://arxiv.org/abs/1511.00936v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multinomial expansion and Nichols algebras associated to non-degenerate involutive solutions of the Yang-Baxter equation",
    "abstract": "In this paper, we investigate the Nichols algebra $\\mathfrak{B}(W_{X,r})$ associated to any non-degenerate involutive solution $(X, r)$ of the Yang-Baxter equation. Infinite examples of finite dimensional Nichols algebras are obtained, including those of dimension $n^m$ with $m$, $n\\in\\Bbb Z^{\\geq 2}$. It turns out that the Nichols algebra $\\mathfrak{B}(W_{X, r})$ has interesting relations with multinomial expansion. This is a generalization of the work in arXiv:2103.06489, which built a connection between the Nichols algebras of squared dimension and Pascal's triangle.",
    "authors": [
      "Yuxing Shi"
    ],
    "publication_date": "2021-10-18T13:23:05Z",
    "arxiv_id": "http://arxiv.org/abs/2110.09280v4",
    "download_url": "https://arxiv.org/abs/2110.09280v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The quantum algebra of partial Hadamard matrices",
    "abstract": "A partial Hadamard matrix is a matrix $H\\in M_{M\\times N}(\\mathbb T)$ whose rows are pairwise orthogonal. We associate to each such $H$ a certain quantum semigroup $G$ of quantum partial permutations of $\\{1,...,M\\}$ and study the correspondence $H\\to G$. We discuss as well the relation between the completion problems for a given partial Hadamard matrix and completion problems for the associated submagic matrix $P\\in M_M(M_N(\\mathbb C))$, in both cases introducing certain criteria for the existence of the suitable completions.",
    "authors": [
      "Teo Banica",
      "Adam Skalski"
    ],
    "publication_date": "2013-10-14T21:16:56Z",
    "arxiv_id": "http://arxiv.org/abs/1310.3855v3",
    "download_url": "https://arxiv.org/abs/1310.3855v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the structure and classification of Bernstein algebras",
    "abstract": "We prove that any Bernstein algebra $(A, ω)$ is isomorphic to a semidirect product $V \\ltimes_{(\\cdot, \\, Ω)} \\, k$ associated to a commutative algebra $(V, \\cdot)$ such that $(x^2)^2 = 0$, for all $x\\in A$ and an idempotent endomorphism $Ω= Ω^2 \\in {\\rm End}_k (V)$ of $V$ satisfying two compatibility conditions. The set of types of $(1 + |I|)$-dimensional Bernstein algebras is parametrized by an explicitely constructed (using linear algebra tools) classified object. The automorphisms group of any Bernstein algebra is described as a subgroup of the canonical semidirect product of groups $(V, +) \\ltimes {\\rm GL}_k (V)$.",
    "authors": [
      "G. Militaru"
    ],
    "publication_date": "2022-03-25T12:57:35Z",
    "arxiv_id": "http://arxiv.org/abs/2203.13627v3",
    "download_url": "https://arxiv.org/abs/2203.13627v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Invariant tensors and cellular categories",
    "abstract": "Let U be the quantised enveloping algebra associated to a Cartan matrix of finite type. Let W be the tensor product of a finite list of highest weight representations of U. Then the centraliser algebra of W has a basis called the dual canonical basis which gives an integral form. We show that this integral form is cellular by using results due to Lusztig.",
    "authors": [
      "Bruce W. Westbury"
    ],
    "publication_date": "2008-06-25T08:26:53Z",
    "arxiv_id": "http://arxiv.org/abs/0806.4045v1",
    "download_url": "https://arxiv.org/abs/0806.4045v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unimodal Gorenstein h-vectors without the Stanley-Iarrobino property",
    "abstract": "The study of the $h$-vectors of graded Gorenstein algebras is an important topic in combinatorial commutative algebra, which despite the large amount of literature produced during the last several years, still presents many interesting open questions. In this note, we commence a study of those unimodal Gorenstein $h$-vectors that do \\emph{not} satisfy the Stanley-Iarrobino property. Our main results, which are characteristic free, show that such $h$-vectors exist: 1) In socle degree $e$ if and only if $e\\ge 6$; and 2) In every codimension five or greater. The main case that remains open is that of codimension four, where no Gorenstein $h$-vector is known without the Stanley-Iarrobino property. We conclude by proposing the following very general conjecture: The existence of any arbitrary level $h$-vector is \\emph{independent} of the characteristic of the base field.",
    "authors": [
      "Juan Migliore",
      "Fabrizio Zanello"
    ],
    "publication_date": "2016-12-16T16:00:23Z",
    "arxiv_id": "http://arxiv.org/abs/1612.05522v2",
    "download_url": "https://arxiv.org/abs/1612.05522v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Algebra of Skew Primitive Elements",
    "abstract": "We study the various term operations on the set of skew primitive elements of Hopf algebras, generated by skew primitive semi-invariants of an Abelian group of grouplike elements. All 1-linear binary operations are described and trilinear and quadrilinear operations are given a detailed treatment. Necessary and sufficient conditions for the existence of multilinear operations are specified in terms of the property of particular noncommutative polynomials being linearly dependent and of one arithmetic condition. We dub the conjecture that this condition implies, in fact, the linear dependence of the polynomials in question and so is itself sufficient (a proof of this conjecture see in \"An existence condition for multilinear quantum operations,\" Journal of Algebra, 217, 1999, 188-228).",
    "authors": [
      "V. K. Kharchenko"
    ],
    "publication_date": "2000-06-09T21:21:42Z",
    "arxiv_id": "http://arxiv.org/abs/math/0006077v1",
    "download_url": "https://arxiv.org/abs/math/0006077v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On pointed Hopf algebras associated with the Mathieu simple groups",
    "abstract": "Let G be a Mathieu simple group, s in G, O_s the conjugacy class of s and ρan irreducible representation of the centralizer of s. We prove that either the Nichols algebra B(O_s,ρ) is infinite-dimensional or the braiding of the Yetter-Drinfeld module M(O_s, ρ) is negative. We also show that if G=M22 or M24, then the group algebra of G is the only (up to isomorphisms) finite-dimensional complex pointed Hopf algebra with group-likes isomorphic to G.",
    "authors": [
      "Fernando Fantino"
    ],
    "publication_date": "2007-11-20T14:19:59Z",
    "arxiv_id": "http://arxiv.org/abs/0711.3142v2",
    "download_url": "https://arxiv.org/abs/0711.3142v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Valuation bases for generalized algebraic series fields",
    "abstract": "We investigate valued fields which admit a valuation basis. Given a countable ordered abelian group G and a real closed, or algebraically closed field F, we give a sufficient condition for a valued subfield of the field of generalized power series F((G)) to admit a K-valuation basis. We show that the field of rational functions F(G) and the field F(G) of power series in F((G)) algebraic over F(G) satisfy this condition. It follows that for archimedean F and divisible G the real closed field F(G) admits a restricted exponential function.",
    "authors": [
      "Franz-Viktor Kuhlmann",
      "Salma Kuhlmann",
      "Jonathan W. Lee"
    ],
    "publication_date": "2007-12-26T09:08:27Z",
    "arxiv_id": "http://arxiv.org/abs/0712.4037v1",
    "download_url": "https://arxiv.org/abs/0712.4037v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Instanton Counting, Quantum Geometry and Algebra",
    "abstract": "The aim of this memoir for \"Habilitation à Diriger des Recherches\" is to present quantum geometric and algebraic aspects of supersymmetric gauge theory, which emerge from non-perturbative nature of the vacuum structure induced by instantons. We start with a brief summary of the equivariant localization of the instanton moduli space, and show how to obtain the instanton partition function and its generalization to quiver gauge theory and supergroup gauge theory in three ways: the equivariant index formula, the contour integral formula, and the combinatorial formula. We then explore the geometric description of $\\mathcal{N} = 2$ gauge theory based on Seiberg-Witten geometry together with its string/M-theory perspective. Through its relation to integrable systems, we show how to quantize such a geometric structure via the $Ω$-deformation of gauge theory. We also discuss the underlying quantum algebraic structure arising from the supersymmetric vacua. We introduce the notion of quiver W-algebra constructed through double quantization of Seiberg-Witten geometry, and show its specific features: affine quiver W-algebras, fractional quiver W-algebras, and their elliptic deformations.",
    "authors": [
      "Taro Kimura"
    ],
    "publication_date": "2020-12-21T22:16:08Z",
    "arxiv_id": "http://arxiv.org/abs/2012.11711v3",
    "download_url": "https://arxiv.org/abs/2012.11711v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cartan Subalgebras of Leibniz $n$-Algebras",
    "abstract": "The present paper is devoted to the investigation of properties of Cartan subalgebras and regular elements in Leibniz $n$-algebras. The relationship between Cartan subalgebras and regular elements of given Leibniz $n$-algebra and Cartan subalgebras and regular elements of the corresponding factor $n$-Lie algebra is established.",
    "authors": [
      "S. Albeverio",
      "Sh. A. Ayupov",
      "B. A. Omirov",
      "R. M. Turdibaev"
    ],
    "publication_date": "2008-02-11T12:17:35Z",
    "arxiv_id": "http://arxiv.org/abs/0802.1426v1",
    "download_url": "https://arxiv.org/abs/0802.1426v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Nichols algebras over PGL(2,q) and PSL(2,q)",
    "abstract": "We compute necessary conditions on Yetter-Drinfeld modules over the groups $\\mathbf{PGL}(2,q)=\\mathbf{PGL}(2,\\FF_q)$ and $\\mathbf{PSL}(2,q)=\\mathbf{PSL}(2,\\FF_q)$ to generate finite dimensional Nichols algebras. This is a first step towards a classification of pointed Hopf algebras with group of group-likes isomorphic to one of these groups.\n  As a by-product of the techniques developed in this work, we prove that there is no non-trivial finite-dimensional pointed Hopf algebra over the Mathieu groups $M_{20}$ and $M_{21}=\\mathbf{PSL}(3,4)$.",
    "authors": [
      "S. Freyre",
      "M. Graña",
      "L. Vendramin"
    ],
    "publication_date": "2008-02-19T11:04:20Z",
    "arxiv_id": "http://arxiv.org/abs/0802.2567v3",
    "download_url": "https://arxiv.org/abs/0802.2567v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]