[
  {
    "title": "Leibniz 2-algebras and twisted Courant algebroids",
    "abstract": "In this paper, we give the categorification of Leibniz algebras, which is equivalent to 2-term sh Leibniz algebras. They reveal the algebraic structure of omni-Lie 2-algebras introduced in \\cite{omniLie2} as well as twisted Courant algebroids by closed 4-forms introduced in \\cite{4form}.\n  We also prove that Dirac structures of twisted Courant algebroids give rise to 2-term $L_\\infty$-algebras and geometric structures behind them are exactly $H$-twisted Lie algebroids introduced in \\cite{Grutzmann}.",
    "authors": [
      "Yunhe Sheng",
      "Zhangju Liu"
    ],
    "publication_date": "2010-12-26T13:52:12Z",
    "arxiv_id": "http://arxiv.org/abs/1012.5515v3",
    "download_url": "https://arxiv.org/abs/1012.5515v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A note on the Schur multiplier of a nilpotent Lie algebra",
    "abstract": "For a nilpotent Lie algebra $L$ of dimension $n$ and dim$(L^2)=m$, we find the upper bound dim$(M(L))\\leq {1/2}(n+m-2)(n-m-1)+1$, where $M(L)$ denotes the Schur multiplier of $L$. In case $m=1$ the equality holds if and only if $L\\cong H(1)\\oplus A$, where $A$ is an abelian Lie algebra of dimension $n-3$ and H(1) is the Heisenberg algebra of dimension 3.",
    "authors": [
      "Peyman Niroomand",
      "Francesco G. Russo"
    ],
    "publication_date": "2010-01-04T12:36:41Z",
    "arxiv_id": "http://arxiv.org/abs/1001.0176v4",
    "download_url": "https://arxiv.org/abs/1001.0176v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A characterisation of Lie algebras amongst anti-commutative algebras",
    "abstract": "Let $\\mathbb{K}$ be an infinite field. We prove that if a variety of anti-commutative $\\mathbb{K}$-algebras - not necessarily associative, where $xx=0$ is an identity - is locally algebraically cartesian closed, then it must be a variety of Lie algebras over $\\mathbb{K}$. In particular, $\\mathsf{Lie}_{\\mathbb{K}}$ is the largest such. Thus, for a given variety of anti-commutative $\\mathbb{K}$-algebras, the Jacobi identity becomes equivalent to a categorical condition: it is an identity in~$\\mathcal{V}$ if and only if $\\mathcal{V}$ is a subvariety of a locally algebraically cartesian closed variety of anti-commutative $\\mathbb{K}$-algebras. This is based on a result saying that an algebraically coherent variety of anti-commutative $\\mathbb{K}$-algebras is either a variety of Lie algebras or a variety of anti-associative algebras over $\\mathbb{K}$.",
    "authors": [
      "Xabier García-Martínez",
      "Tim Van der Linden"
    ],
    "publication_date": "2017-01-19T16:09:42Z",
    "arxiv_id": "http://arxiv.org/abs/1701.05493v3",
    "download_url": "https://arxiv.org/abs/1701.05493v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The commutative core of a Leavitt path algebra",
    "abstract": "For any unital commutative ring $R$ and for any graph $E$, we identify the commutative core of the Leavitt path algebra of $E$ with coefficients in $R$, which is a maximal commutative subalgebra of the Leavitt path algebra. Furthermore, we are able to characterize injectivity of representations which gives a generalization of the Cuntz-Krieger uniqueness theorem.",
    "authors": [
      "Cristóbal Gil Canto",
      "Alireza Nasr-Isfahani"
    ],
    "publication_date": "2015-10-14T08:13:52Z",
    "arxiv_id": "http://arxiv.org/abs/1510.03992v3",
    "download_url": "https://arxiv.org/abs/1510.03992v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some algebras similar to the 2x2 Jordanian matrix algebras",
    "abstract": "The impetus for this study is the work of Dumas and Rigal on the Jordanian deformation of the ring of coordinate functions on $2\\times 2$ matrices. We are also motivated by current interest in birational equivalence of noncommutative rings. Recognizing the construction of the Jordanian matrix algebra as a skew polynomial ring, we construct a family of algebras relative to differential operator rings over a polynomial ring in one variable which are birationally equivalent to the Weyl algebra over a polynomial ring in two variables.",
    "authors": [
      "Jason Gaddis",
      "Kenneth L. Price"
    ],
    "publication_date": "2015-01-29T18:15:16Z",
    "arxiv_id": "http://arxiv.org/abs/1501.07530v3",
    "download_url": "https://arxiv.org/abs/1501.07530v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classifying complements for associative algebras",
    "abstract": "For a given extension $A \\subset E$ of associative algebras we describe and classify up to an isomorphism all $A$-complements of $E$, i.e. all subalgebras $X$ of $E$ such that $E = A + X$ and $A \\cap X = \\{0\\}$. Let $X$ be a given complement and $(A, \\, X, \\, \\triangleright, \\triangleleft, \\leftharpoonup, \\rightharpoonup \\bigl)$ the canonical matched pair associated with the factorization $E = A + X$. We introduce a new type of deformation of the algebra $X$ by means of the given matched pair and prove that all $A$-complements of $E$ are isomorphic to such a deformation of $X$. Several explicit examples involving the matrix algebra are provided.",
    "authors": [
      "A. L. Agore"
    ],
    "publication_date": "2013-11-25T08:42:02Z",
    "arxiv_id": "http://arxiv.org/abs/1311.6232v3",
    "download_url": "https://arxiv.org/abs/1311.6232v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exchange Maps of Cluster Algebras",
    "abstract": "Every two seeds in a field of fractions $\\mathcal{F}$ together with a symmetric group element gives rise to an automorphism of $\\mathcal{F}$ called an exchange automorphism. For positive cluster algebras, we provide equivalent conditions for exchange automorphisms to be cluster isomorphisms of the corresponding cluster algebras. The equivalent conditions are given in terms of a symmetric group action on the set of seeds, which is also studied. Presentations of groups of cluster automorphisms of some seeds of ranks 1 and 2 are given.",
    "authors": [
      "Ibrahim A Saleh"
    ],
    "publication_date": "2010-11-03T14:23:51Z",
    "arxiv_id": "http://arxiv.org/abs/1011.0894v3",
    "download_url": "https://arxiv.org/abs/1011.0894v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weight modules over Bell--Rogalski algebras",
    "abstract": "We study a class of $\\mathbb{Z}$-graded algebras introduced by Bell and Rogalski. Their construction generalizes in large part that of rank one generalized Weyl algebras (GWAs). We establish certain ring-theoretic properties of these algebras and study their connection to GWAs. We classify the simple weight modules in the infinite orbit case and provide a partial classification in the case of orbits of finite order.",
    "authors": [
      "Jason Gaddis",
      "Daniele Rosso",
      "Robert Won"
    ],
    "publication_date": "2022-04-08T21:58:15Z",
    "arxiv_id": "http://arxiv.org/abs/2204.04307v2",
    "download_url": "https://arxiv.org/abs/2204.04307v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the noncommutative geometry of square superpotential algebras",
    "abstract": "A superpotential algebra is square if its quiver admits an embedding into a two-torus such that the image of its underlying graph is a square grid, possibly with diagonal edges in the unit squares; examples are provided by dimer models in physics. Such an embedding reveals much of the algebras representation theory through a device we introduce called an impression. Let A be a square superpotential algebra, Z its center, and \\mathfrak{m} the maximal ideal at the origin of Spec(Z). Using an impression, we give a classification of all simple A-modules up to isomorphism, and give algebraic and homological characterizations of the simple A-modules of maximal k-dimension; show that Z is a 3-dimensional normal toric domain and Z_{\\mathfrak{m}} is Gorenstein, by determining transcendence bases and Z-regular sequences; and show that A_{\\mathfrak{m}} is a noncommutative crepant resolution of Z_{\\mathfrak{m}}, and thus a local Calabi-Yau algebra.\n  A particular class of square superpotential algebras, the Y^{p,q} algebras, is considered in detail. We show that the Azumaya and smooth loci of the centers coincide, and propose that each ramified maximal ideal sitting over the singular locus is the exceptional locus of a blowup shrunk to zero size.",
    "authors": [
      "Charlie Beil"
    ],
    "publication_date": "2008-11-17T20:59:53Z",
    "arxiv_id": "http://arxiv.org/abs/0811.2439v4",
    "download_url": "https://arxiv.org/abs/0811.2439v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Growth of monomial algebras, simple rings and free subalgebras",
    "abstract": "We construct finitely generated simple algebras with prescribed growth types, which can be arbitrarily taken from a large variety of (super-polynomial) growth types. This (partially) answers a question raised by the author in a recent paper.\n  Our construction goes through a construction of finitely generated just-infinite, primitive monomial algebras with prescribed growth type, from which we construct uniformly recurrent infinite words with subword complexity having the same growth type.\n  We also discuss the connection between entropy of algebras and their homomorphic images, as well as the degrees of their generators of free subalgebras.",
    "authors": [
      "Be'eri Greenfeld"
    ],
    "publication_date": "2017-06-29T16:48:54Z",
    "arxiv_id": "http://arxiv.org/abs/1706.09845v1",
    "download_url": "https://arxiv.org/abs/1706.09845v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic identities to prove that a neat finite free algebra is tracically étale",
    "abstract": "The central objective of this article is to provide an elementary proof of the following theorem, of which we are unaware of any trace in the existing literature. If $B$ is a net finite free algebra over a commutative ring $A$, then it is tracically étale (its trace form is nondegenerate) and a fortiori étale over A. As indicated in the title, our proof is based on algebraic identities. This confirms the implicit adage that much of the most abstract commutative algebra is concentrated in algebraic identities concerning matrices of polynomials over an arbitrary commutative ring. --  -- -- L'objectif central de cet article est de donner une démonstration élémentaire du théorème suivant, dont nous ne connaissons pas de trace dans la littérature existante. Si $B$ est une algèbre libre finie nette sur $A$, alors elle est traciquement étale (sa forme trace est non dégénérée) et à fortiori étale sur $A$. Comme indiqué dans le titre, notre démonstration est basée sur des identités algébriques. Cela confirme l'adage implicite selon lequel une grande partie de l'algèbre commutative la plus abstraite se concentre dans des identités algébriques concernant les matrices de polynômes sur un anneau commutatif arbitraire.",
    "authors": [
      "Claude Quitté",
      "Henri Lombardi"
    ],
    "publication_date": "2025-06-04T11:33:50Z",
    "arxiv_id": "http://arxiv.org/abs/2506.03851v1",
    "download_url": "https://arxiv.org/abs/2506.03851v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coverings of graded pointed Hopf algebras",
    "abstract": "We introduce the concept of a covering of a graded pointed Hopf algebra. The theory developed shows that coverings of a bosonized Nichols algebra can be concretely expressed by biproducts using a quotient of the universal coalgebra covering group of the Nichols algebra. If there are enough quadratic relations, the universal coalgebra covering is given by the bosonization by the enveloping group of the underlying rack.",
    "authors": [
      "William Chin",
      "Esther Beneish"
    ],
    "publication_date": "2014-01-31T04:39:44Z",
    "arxiv_id": "http://arxiv.org/abs/1401.8061v2",
    "download_url": "https://arxiv.org/abs/1401.8061v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Constructing quantized enveloping algebras via inverse limits of finite dimensional algebras",
    "abstract": "It is known that a generalized $q$-Schur algebra may be constructed as a quotient of a quantized enveloping algebra $\\UU$ or its modified form $\\dot{\\UU}$. On the other hand, we show here that both $\\UU$ and $\\dot{\\UU}$ may be constructed within an inverse limit of a certain inverse system of generalized $q$-Schur algebras. Working within the inverse limit $\\hat{\\UU}$ clarifies the relation between $\\dot{\\UU}$ and $\\UU$. This inverse limit is a $q$-analogue of the linear dual $R[G]^*$ of the coordinate algebra of a corresponding linear algebraic group $G$.",
    "authors": [
      "Stephen Doty"
    ],
    "publication_date": "2007-11-17T22:31:23Z",
    "arxiv_id": "http://arxiv.org/abs/0711.2764v3",
    "download_url": "https://arxiv.org/abs/0711.2764v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On semigroup algebras with rational exponents",
    "abstract": "In this paper, a semigroup algebra consisting of polynomial expressions with coefficients in a field $F$ and exponents in an additive submonoid $M$ of $\\mathbb{Q}_{\\ge 0}$ is called a Puiseux algebra and denoted by $F[M]$. Here we study the atomic structure of Puiseux algebras. To begin with, we answer the Isomorphism Problem for the class of Puiseux algebras, that is, we show that for a field $F$ if two Puiseux algebras $F[M_1]$ and $F[M_2]$ are isomorphic, then the monoids $M_1$ and $M_2$ must be isomorphic. Then we construct three classes of Puiseux algebras satisfying the following well-known atomic properties: the ACCP property, the bounded factorization property, and the finite factorization property. We show that there are bounded factorization Puiseux algebras with extremal systems of sets of lengths, which allows us to prove that Puiseux algebras cannot be determined up to isomorphism by their arithmetic of lengths. Finally, we give a full description of the seminormal closure, root closure, and complete integral closure of a Puiseux algebra, and use such description to provide a class of antimatter Puiseux algebras (i.e., Puiseux algebras containing no irreducibles).",
    "authors": [
      "Felix Gotti"
    ],
    "publication_date": "2018-01-21T06:54:47Z",
    "arxiv_id": "http://arxiv.org/abs/1801.06779v4",
    "download_url": "https://arxiv.org/abs/1801.06779v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MV-algebras freely generated by finite Kleene algebras",
    "abstract": "If V and W are varieties of algebras such that any V-algebra A has a reduct U(A) in W, there is a forgetful functor U: V->W that acts by A |-> U(A) on objects, and identically on homomorphisms. This functor U always has a left adjoint F: W->V by general considerations. One calls F(B) the V-algebra freely generated by the W-algebra B. Two problems arise naturally in this broad setting. The description problem is to describe the structure of the V-algebra F(B) as explicitly as possible in terms of the structure of the W-algebra B. The recognition problem is to find conditions on the structure of a given V-algebra A that are necessary and sufficient for the existence of a W-algebra B such that F(B) is isomorphic to A. Building on and extending previous work on MV-algebras freely generated by finite distributive lattices, in this paper we provide solutions to the description and recognition problems in case V is the variety of MV-algebras, W is the variety of Kleene algebras, and B is finitely generated--equivalently, finite. The proofs rely heavily on the Davey-Werner natural duality for Kleene algebras, on the representation of finitely presented MV-algebras by compact rational polyhedra, and on the theory of bases of MV-algebras.",
    "authors": [
      "Stefano Aguzzoli",
      "Leonardo M. Cabrer",
      "Vincenzo Marra"
    ],
    "publication_date": "2013-06-14T08:43:02Z",
    "arxiv_id": "http://arxiv.org/abs/1306.3335v1",
    "download_url": "https://arxiv.org/abs/1306.3335v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Homomorphisms of local algebras in positive characteristic",
    "abstract": "We investigate some properties of regularity of homomorphisms of local algebras over positive characteristic fields. We state a result of monomialization of such a homomorphism between algebras of analytic or algebraic power series. From this we deduce some extensions in positive characteristic of results due to S. Izumi and A. Gabrielov.",
    "authors": [
      "Guillaume Rond"
    ],
    "publication_date": "2006-12-08T13:39:34Z",
    "arxiv_id": "http://arxiv.org/abs/math/0612214v2",
    "download_url": "https://arxiv.org/abs/math/0612214v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum cluster algebras and their specializations",
    "abstract": "We show that in case a cluster algebra coincides with its upper cluster algebra and the cluster algebra admits a grading with finite dimensional homogeneous components, the corresponding Berenstein-Zelevinsky quantum cluster algebra can be viewed as a flat deformation of the classical cluster algebra.",
    "authors": [
      "Christof Geiß",
      "Bernard Leclerc",
      "Jan Schröer"
    ],
    "publication_date": "2018-07-25T19:00:55Z",
    "arxiv_id": "http://arxiv.org/abs/1807.09826v2",
    "download_url": "https://arxiv.org/abs/1807.09826v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Linearizing torsion classes in the Picard group of algebraic curves over finite fields",
    "abstract": "We address the problem of computing in the group of $\\ell^k$-torsion rational points of the jacobian variety of algebraic curves over finite fields, with a view toward computing modular representations.",
    "authors": [
      "Jean-Marc Couveignes"
    ],
    "publication_date": "2007-06-02T14:20:14Z",
    "arxiv_id": "http://arxiv.org/abs/0706.0272v2",
    "download_url": "https://arxiv.org/abs/0706.0272v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cocycle deformations for Hopf algebras with a coalgebra projection",
    "abstract": "Let $H$ be a Hopf algebra over a field $K$ of characteristic $0$ and let $A$ be a bialgebra or Hopf algebra such that $H$ is isomorphic to a sub-Hopf algebra of $A$ and there is an $H$-bilinear coalgebra projection $π$ from $A$ to $H$ which splits the inclusion. Then $A \\cong R \\#_ξH$ where $R$ is the pre-bialgebra of coinvariants. In this paper we study the deformations of $A$ by an $H$-bilinear cocycle. If $γ$ is a cocycle for $A$, then $γ$ can be restricted to a cocycle $γ_R$ for $R$, and $A^γ\\cong R^{γ_R} \\#_{ξ_γ} H$. As examples, we consider liftings of $\\mathcal{B}(V) \\# K[Γ]$ where $Γ$ is a finite abelian group, $V$ is a quantum plane and $\\mathcal{B}(V)$ is its Nichols algebra, and explicitly construct the cocycle which twists the Radford biproduct into the lifting.",
    "authors": [
      "Alessandro Ardizzoni",
      "Margaret Beattie",
      "Claudia Menini"
    ],
    "publication_date": "2009-06-01T08:59:50Z",
    "arxiv_id": "http://arxiv.org/abs/0906.0239v3",
    "download_url": "https://arxiv.org/abs/0906.0239v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Intersection Algebra of Principal Ideals",
    "abstract": "We study the finite generation of the intersection algebra of two principal ideals I and J in a unique factorization domain R. We provide an algorithm that produces a list of generators of this algebra over R. In the special case that R is a polynomial ring, this algorithm has been implemented in the commutative algebra software system Macaulay2. A new class of algebras, called fan algebras, is introduced.",
    "authors": [
      "Sara Malec"
    ],
    "publication_date": "2013-02-01T23:09:09Z",
    "arxiv_id": "http://arxiv.org/abs/1302.0312v2",
    "download_url": "https://arxiv.org/abs/1302.0312v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fundamental Theorems of Calculus and Zinbiel Algebras",
    "abstract": "Derivations are linear operators which satisfy the Leibniz rule, while integrations are linear operators which satisfy the Rota-Baxter rule. In this paper, we introduce the notion of an FTC-pair, which consists of an algebra and module with a derivation and integration between them which together satisfy analogues of the two Fundamental Theorems of Calculus. In the special case of when an algebra is seen as a module over itself, we show that this sort of FTC-pair is precisely the same thing as an integro-differential algebra. We provide various constructions of FTC-pairs, as well as numerous examples of FTC-pairs including some based on polynomials, smooth functions, Hurwitz series, and shuffle algebras. Moreover, it is well known that integrations are closely related to Zinbiel algebras. The main result of this paper is that the category of FTC-pairs is equivalent to the category of Zinbiel algebras.",
    "authors": [
      "Jean-Simon Pacaud Lemay"
    ],
    "publication_date": "2024-01-16T09:18:37Z",
    "arxiv_id": "http://arxiv.org/abs/2401.08223v2",
    "download_url": "https://arxiv.org/abs/2401.08223v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Periodicity of d-cluster-tilted algebras",
    "abstract": "It is well-known that any maximal Cohen-Macaulay module over a hypersurface has a periodic free resolution of period 2. Auslander, Reiten and Buchweitz have used this periodicity to explain the existence of periodic projective resolutions over certain finite-dimensional algebras which arise as stable endomorphism rings of Cohen-Macaulay modules. These algebras are in fact periodic, meaning that they have periodic projective resolutions as bimodules and thus periodic Hochschild cohomology as well. The goal of this article is to generalize this construction of periodic algebras to the context of Iyama's higher AR-theory. We start by considering projective resolutions of functors on a maximal (d-1)-orthogonal subcategory C of an exact Frobenius category B. If C is fixed by the d-th syzygy functor of B, then we show that this d-th syzygy functor induces the (2+d)-th syzygy on the category of finitely presented functors on the stable category of C. If C has finite type, i.e., if C = add(T) for a d-cluster tilting object T, then we show that the stable endomorphism ring of T has a quasi-periodic resolution over its enveloping algebra. Moreover, this resolution will be periodic if some higher syzygy functor is isomorphic to the identity on the stable category of C. It follows, in particular, that 2-C.Y. tilted algebras arising as stable endomorphism rings of Cohen-Macaulay modules over curve singularities, as in the work of Burban, Iyama, Keller and Reiten have periodic bimodule resolutions of period 4.",
    "authors": [
      "Alex Dugas"
    ],
    "publication_date": "2010-07-16T16:57:27Z",
    "arxiv_id": "http://arxiv.org/abs/1007.2811v2",
    "download_url": "https://arxiv.org/abs/1007.2811v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integral bases for the universal enveloping algebras of map superalgebras",
    "abstract": "Let $\\mathfrak{g}$ be a finite dimensional complex simple classical Lie superalgebra and $A$ be a commutative, associative algebra with unity over $\\mathbb{C}$. In this paper we define an integral form for the universal enveloping algebra of the map superalgebra $\\mathfrak{g}\\otimes A$, and exhibit an explicit integral basis for this integral form.",
    "authors": [
      "Irfan Bagci",
      "Samuel Chamberlin"
    ],
    "publication_date": "2013-03-28T19:52:20Z",
    "arxiv_id": "http://arxiv.org/abs/1303.7223v3",
    "download_url": "https://arxiv.org/abs/1303.7223v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Radford's S^4 formula for co-Frobenius Hopf algebras",
    "abstract": "This note extends Radford's formula for the fourth power of the antipode of a finite dimensional Hopf algebra to co-Frobenius Hopf algebras and studies equivalent conditions to a Hopf algebra being involutory for finite dimensional and co-Frobenius Hopf algebras.",
    "authors": [
      "Margaret Beattie",
      "Daniel Bulacu",
      "Blas Torrecillas"
    ],
    "publication_date": "2005-11-21T23:43:22Z",
    "arxiv_id": "http://arxiv.org/abs/math/0511535v2",
    "download_url": "https://arxiv.org/abs/math/0511535v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Curved Koszul duality of algebras over unital versions of binary operads",
    "abstract": "We develop a curved Koszul duality theory for algebras presented by quadratic-linear-constant relations over unital versions of binary quadratic operads. As an application, we study Poisson $n$-algebras given by polynomial functions on a standard shifted symplectic space. We compute explicit resolutions of these algebras using curved Koszul duality. We use these resolutions to compute derived enveloping algebras and factorization homology on parallelized simply connected closed manifolds with coefficients in these Poisson $n$-algebras.",
    "authors": [
      "Najib Idrissi"
    ],
    "publication_date": "2018-05-04T16:52:01Z",
    "arxiv_id": "http://arxiv.org/abs/1805.01853v5",
    "download_url": "https://arxiv.org/abs/1805.01853v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic properties of zigzag algebras",
    "abstract": "We give necessary and sufficient conditions for zigzag algebras and certain generalizations of them to be (relative) cellular, quasi-hereditary or Koszul.",
    "authors": [
      "Michael Ehrig",
      "Daniel Tubbenhauer"
    ],
    "publication_date": "2018-07-30T05:03:56Z",
    "arxiv_id": "http://arxiv.org/abs/1807.11173v2",
    "download_url": "https://arxiv.org/abs/1807.11173v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generalized shuffles related to Nijenhuis and TD-algebras",
    "abstract": "Shuffle and quasi-shuffle products are well-known in the mathematics literature. They are intimately related to Loday's dendriform algebras, and were extensively used to give explicit constructions of free commutative Rota-Baxter algebras. In the literature there exist at least two other Rota-Baxter type algebras, namely, the Nijenhuis algebra and the so-called TD-algebra. The explicit construction of the free unital commutative Nijenhuis algebra uses a modified quasi-shuffle product, called the right-shift shuffle. We show that another modification of the quasi-shuffle product, the so-called left-shift shuffle, can be used to give an explicit construction of the free unital commutative TD-algebra. We explore some basic properties of TD-operators and show that the free unital commutative Nijenhuis algebra is a TD-algebra. We relate our construction to Loday's unital commutative dendriform trialgebras, including the involutive case. The concept of Rota-Baxter, Nijenhuis and TD-bialgebras is introduced at the end and we show that any commutative bialgebra provides such objects.",
    "authors": [
      "K. Ebrahimi-Fard",
      "P. Leroux"
    ],
    "publication_date": "2006-06-07T18:08:58Z",
    "arxiv_id": "http://arxiv.org/abs/math/0606164v3",
    "download_url": "https://arxiv.org/abs/math/0606164v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin nilHecke algebras of classical type",
    "abstract": "We formulate and study the spin nilHecke algebras ${}^\\mathfrak{b}\\!{\\mathrm{NH}}_n^-$ and ${}^\\mathfrak{d}\\!{\\mathrm{NH}}_n^-$ of type B/D, which differ from the usual nilHecke algebras by some odd signs. The type B spin nilHecke algebra is a nil version of the spin type B Hecke algebra introduced earlier by the second author and Khongsap, but not for the type D one. We construct faithful polynomial representations $\\mathrm{Pol}_n^-$ of the nilHecke algebras via odd Demazure operators. We formulate the spin Schubert polynomials, and use them to show that the spin nilHecke algebras are matrix algebras with entries in a subalgebra of $\\mathrm{Pol}_n^-$ consisting of spin symmetric polynomials. All these results have their counterparts for the usual nilHecke algebras over the rational field. Our work is a generalization of results of Lauda and Ellis-Khovanov-Lauda in usual/spin type A.",
    "authors": [
      "Ian Johnson",
      "Weiqiang Wang"
    ],
    "publication_date": "2017-06-20T02:18:43Z",
    "arxiv_id": "http://arxiv.org/abs/1706.06240v2",
    "download_url": "https://arxiv.org/abs/1706.06240v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Intersections of translated algebraic subtori",
    "abstract": "We exploit the classical correspondence between finitely generated abelian groups and abelian complex algebraic reductive groups to study the intersection theory of translated subgroups in an abelian complex algebraic reductive group, with special emphasis on intersections of (torsion) translated subtori in an algebraic torus.",
    "authors": [
      "Alexander I. Suciu",
      "Yaping Yang",
      "Gufang Zhao"
    ],
    "publication_date": "2011-09-05T22:03:02Z",
    "arxiv_id": "http://arxiv.org/abs/1109.1023v3",
    "download_url": "https://arxiv.org/abs/1109.1023v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Local derivations on the Lie algebra $W(2,2)$",
    "abstract": "The present paper is devoted to studying local derivations on the Lie algebra $W(2,2)$ which has some outer derivations. Using some linear algebra methods in \\cite{CZZ} and a key construction for $W(2,2)$ we prove that every local derivation on $W(2, 2)$ is a derivation. As an application, we determine all local derivations on the deformed $\\mathfrak{bms}_3$ algebra.",
    "authors": [
      "Qingyan Wu",
      "Shoulan Gao",
      "Dong Liu"
    ],
    "publication_date": "2022-10-26T11:09:22Z",
    "arxiv_id": "http://arxiv.org/abs/2210.14626v1",
    "download_url": "https://arxiv.org/abs/2210.14626v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graded irreducible representations of Leavitt path algebras: a new type and complete classification",
    "abstract": "We present a new class of graded irreducible representations of a Leavitt path algebra. This class is new in the sense that its representation space is not isomorphic to any of the existing simple Chen modules. The corresponding graded simple modules complete the list of Chen modules which are graded, creating an exhaustive class: the annihilator of any graded simple module is equal to the annihilator of either a graded Chen module or a module of this new type.\n  Our characterization of graded primitive ideals of a Leavitt path algebra in terms of the properties of the underlying graph is the main tool for proving the completeness of such classification. We also point out a problem with the characterization of primitive ideals of a Leavitt path algebra in [K. M. Rangaswamy, Theory of prime ideals of Leavitt path algebras over arbitrary graphs, J. Algebra 375 (2013), 73 -- 90].",
    "authors": [
      "Lia Vas"
    ],
    "publication_date": "2022-01-07T13:30:19Z",
    "arxiv_id": "http://arxiv.org/abs/2201.02446v2",
    "download_url": "https://arxiv.org/abs/2201.02446v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tautological algebra of the moduli stack of semistable bundles of rank 2 on a general curve",
    "abstract": "Our aim is to determine the tautological algebra generated by the cohomology classes of the Brill-Noether loci in the rational cohomology of the moduli stack $\\mathcal{U}_C(n,d)$ of semistable bundles of rank $n$ and degree $d$. We show that for a general smooth projective curve $C$ of genus $g\\geq 2$, $d=2g-2$, the tautological algebra of $ \\mathcal{U}_C(2,2g-2)$ (resp. the moduli stack $\\mathcal{SU}_C(2,\\mathcal{L})$ of semistable bundles of rank $2$ and determinant $\\mathcal{L}$ with $°(\\mathcal{L})=2g-2$) is generated by the divisor classes (resp. the class of the Theta divisor $Θ$). This is previously known in rank one situation, called the (classical) Porteous formula.",
    "authors": [
      "Chandranandan Gangopadhyay",
      "Jaya NN Iyer",
      "Arijit Mukherjee"
    ],
    "publication_date": "2020-02-03T05:28:27Z",
    "arxiv_id": "http://arxiv.org/abs/2002.00568v4",
    "download_url": "https://arxiv.org/abs/2002.00568v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Wreath Hecke algebras and centralizer construction for wreath products",
    "abstract": "Generalizing the centralizer construction of Molev and Olshanski on symmetric groups, we study the structures of the centralizer $\\mZ_{m,n}$ of the wreath product $G_{n-m}$ in the group algebra of $G_n$ for any $n\\geq m$. We establish the connection between $\\mZ_{m,n}$ and a generalization of degenerate affine Hecke algebras introduced in our earlier work.",
    "authors": [
      "Jinkui Wan"
    ],
    "publication_date": "2008-10-15T18:29:01Z",
    "arxiv_id": "http://arxiv.org/abs/0810.2767v2",
    "download_url": "https://arxiv.org/abs/0810.2767v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Derivation-Simple Algebras and the Structures of Generalized Lie Algebras of Witt Type",
    "abstract": "We classify all the pairs of a commutative associative algebra with an identity element and its finite-dimensional commutative locally-finite derivation subalgebra such that the commutative associative algebra is derivation-simple with respect to the derivation subalgebra over an algebraically closed field with characteristic 0. Such pairs are the fundamental ingredients for constructing generalized simple Lie algebras of Cartan type. Moreover, we determine the isomorphic classes of the generalized simple Lie algebras of Witt Type. The structure space of these algebras is given explicitly.",
    "authors": [
      "Yucai Su",
      "Xiaoping Xu",
      "Hechun Zhang"
    ],
    "publication_date": "2000-01-30T08:40:00Z",
    "arxiv_id": "http://arxiv.org/abs/math/0001178v1",
    "download_url": "https://arxiv.org/abs/math/0001178v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An algebraic characterization of the affine three space",
    "abstract": "In this paper we give algebraic characterizations of the affine $2$-space and the affine $3$-space over an algebraically closed field of characteristic zero, using a variant of the Makar-Limanov invariant.",
    "authors": [
      "Nikhilesh Dasgupta",
      "Neena Gupta"
    ],
    "publication_date": "2017-09-01T06:19:00Z",
    "arxiv_id": "http://arxiv.org/abs/1709.00169v2",
    "download_url": "https://arxiv.org/abs/1709.00169v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Hilbert series of algebras of Veronese type",
    "abstract": "This paper gives a fairly explicit formula for the Hilbert series of algebras of Veronese type.",
    "authors": [
      "Mordechai Katzman"
    ],
    "publication_date": "2004-08-03T12:51:32Z",
    "arxiv_id": "http://arxiv.org/abs/math/0408038v1",
    "download_url": "https://arxiv.org/abs/math/0408038v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploration of finite dimensional Kac algebras and lattices of intermediate subfactors of irreducible inclusions",
    "abstract": "We study the four infinite families KA(n), KB(n), KD(n), KQ(n) of finite dimensional Hopf (in fact Kac) algebras constructed respectively by A. Masuoka and L. Vainerman: isomorphisms, automorphism groups, self-duality, lattices of coideal subalgebras. We reduce the study to KD(n) by proving that the others are isomorphic to KD(n), its dual, or an index 2 subalgebra of KD(2n). We derive many examples of lattices of intermediate subfactors of the inclusions of depth 2 associated to those Kac algebras, as well as the corresponding principal graphs, which is the original motivation.\n  Along the way, we extend some general results on the Galois correspondence for depth 2 inclusions, and develop some tools and algorithms for the study of twisted group algebras and their lattices of coideal subalgebras. This research was driven by heavy computer exploration, whose tools and methodology we further describe.",
    "authors": [
      "Marie-Claude David",
      "Nicolas M. Thiéry"
    ],
    "publication_date": "2008-12-16T14:03:11Z",
    "arxiv_id": "http://arxiv.org/abs/0812.3044v3",
    "download_url": "https://arxiv.org/abs/0812.3044v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Double Poisson Cohomology of Path Algebras of Quivers",
    "abstract": "In this note, we give a description of the graded Lie algebra of double derivations of a path algebra as a graded version of the necklace Lie algebra equipped with the Kontsevich bracket. Furthermore, we formally introduce the notion of double Poisson-Lichnerowicz cohomology for double Poisson algebras, and give some elementary properties. We introduce the notion of a linear double Poisson tensor on a quiver and show that it induces the structure of a finite dimensional algebra on the vector spaces V_v generated by the loops in the vertex v. We show that the Hochschild cohomology of the associative algebra can be recovered from the double Poisson cohomology. Then, we use the description of the graded necklace Lie algebra to determine the low-dimensional double Poisson-Lichnerowicz cohomology groups for three types of (linear and non-linear) double Poisson brackets on the free algebra in two variables. This allows us to develop some useful techniques for the computation of the double Poisson-Lichnerowicz cohomology.",
    "authors": [
      "Anne Pichereau",
      "Geert Van de Weyer"
    ],
    "publication_date": "2007-01-29T10:55:39Z",
    "arxiv_id": "http://arxiv.org/abs/math/0701837v4",
    "download_url": "https://arxiv.org/abs/math/0701837v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twisted Steinberg algebras",
    "abstract": "We introduce twisted Steinberg algebras over a commutative unital ring $R$. These generalise Steinberg algebras and are a purely algebraic analogue of Renault's twisted groupoid C*-algebras. In particular, for each ample Hausdorff groupoid $G$ and each locally constant $2$-cocycle $σ$ on $G$ taking values in the units $R^\\times$, we study the algebra $A_R(G,σ)$ consisting of locally constant compactly supported $R$-valued functions on $G$, with convolution and involution \"twisted\" by $σ$. We also introduce a \"discretised\" analogue of a twist $Σ$ over a Hausdorff étale groupoid $G$, and we show that there is a one-to-one correspondence between locally constant $2$-cocycles on $G$ and discrete twists over $G$ admitting a continuous global section. Given a discrete twist $Σ$ arising from a locally constant $2$-cocycle $σ$ on an ample Hausdorff groupoid $G$, we construct an associated twisted Steinberg algebra $A_R(G;Σ)$, and we show that it coincides with $A_R(G,σ^{-1})$. Given any discrete field $\\mathbb{F}_d$, we prove a graded uniqueness theorem for $A_{\\mathbb{F}_d}(G,σ)$, and under the additional hypothesis that $G$ is effective, we prove a Cuntz--Krieger uniqueness theorem and show that simplicity of $A_{\\mathbb{F}_d}(G,σ)$ is equivalent to minimality of $G$.",
    "authors": [
      "Becky Armstrong",
      "Lisa Orloff Clark",
      "Kristin Courtney",
      "Ying-Fen Lin",
      "Kathryn McCormick",
      "Jacqui Ramagge"
    ],
    "publication_date": "2019-10-28T23:16:38Z",
    "arxiv_id": "http://arxiv.org/abs/1910.13005v3",
    "download_url": "https://arxiv.org/abs/1910.13005v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Invariant forms on irreducible modules of simple algebraic groups",
    "abstract": "Let $G$ be a simple linear algebraic group over an algebraically closed field $K$ of characteristic $p \\geq 0$ and let $V$ be an irreducible rational $G$-module with highest weight $λ$. When $V$ is self-dual, a basic question to ask is whether $V$ has a non-degenerate $G$-invariant alternating bilinear form or a non-degenerate $G$-invariant quadratic form.\n  If $p \\neq 2$, the answer is well known and easily described in terms of $λ$. In the case where $p = 2$, we know that if $V$ is self-dual, it always has a non-degenerate $G$-invariant alternating bilinear form. However, determining when $V$ has a non-degenerate $G$-invariant quadratic form is a classical problem that still remains open. We solve the problem in the case where $G$ is of classical type and $λ$ is a fundamental highest weight $ω_i$, and in the case where $G$ is of type $A_l$ and $λ= ω_r + ω_s$ for $1 \\leq r < s \\leq l$. We also give a solution in some specific cases when $G$ is of exceptional type.\n  As an application of our results, we refine Seitz's $1987$ description of maximal subgroups of simple algebraic groups of classical type. One consequence of this is the following result. If $X < Y < \\operatorname{SL}(V)$ are simple algebraic groups and $V \\downarrow X$ is irreducible, then one of the following holds: (1) $V \\downarrow Y$ is not self-dual; (2) both or neither of the modules $V \\downarrow Y$ and $V \\downarrow X$ have a non-degenerate invariant quadratic form; (3) $p = 2$, $X = \\operatorname{SO}(V)$, and $Y = \\operatorname{Sp}(V)$.",
    "authors": [
      "Mikko Korhonen"
    ],
    "publication_date": "2016-08-31T12:08:20Z",
    "arxiv_id": "http://arxiv.org/abs/1608.08815v2",
    "download_url": "https://arxiv.org/abs/1608.08815v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The bar derived category of a curved dg algebra",
    "abstract": "Curved A-infinity algebras appear in nature as deformations of dg algebras. We develop the basic theory of curved A-infinity algebras and, in particular, curved dg algebras. We investigate their link with a suitable class of dg coalgebras via the bar construction and produce Quillen model structures on their module categories. We define the analogue of the relative derived category for a curved dg algebra.",
    "authors": [
      "Pedro Nicolas"
    ],
    "publication_date": "2007-02-15T12:36:19Z",
    "arxiv_id": "http://arxiv.org/abs/math/0702449v2",
    "download_url": "https://arxiv.org/abs/math/0702449v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generating functions associated to Frobenius algebras",
    "abstract": "We introduce a generating function associated to the homogeneous generators of a graded algebra that measures how far is this algebra from being finitely generated. For the case of some algebras of Frobenius endomorphisms we describe this generating function explicitly as a rational function.",
    "authors": [
      "Josep Àlvarez Montaner"
    ],
    "publication_date": "2018-02-20T12:59:21Z",
    "arxiv_id": "http://arxiv.org/abs/1802.07096v2",
    "download_url": "https://arxiv.org/abs/1802.07096v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simple associative conformal algebras of linear growth",
    "abstract": "We describe simple finitely generated associative conformal algebras of Gel'fand--Kirillov dimension one.",
    "authors": [
      "Pavel Kolesnikov"
    ],
    "publication_date": "2004-09-21T04:33:46Z",
    "arxiv_id": "http://arxiv.org/abs/math/0409378v3",
    "download_url": "https://arxiv.org/abs/math/0409378v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the flatness and the projectivity over Hopf subalgebras of Hopf algebras over discrete valuation rings",
    "abstract": "We study the flatness and the projectivity of Hopf algebras, defined over a Dedekind ring, over their Hopf subalgebras. We give a criterion for the faithful flatness and use it to show the faithful flatness of an arbitrary flat Hopf algebra upon its finite normal Hopf subalgebra. For the projectivity of a projective Hopf algebras we need some finiteness condition in terms of the module of integral. In particular we show the the module of integral has rank one.",
    "authors": [
      "Nguyen Dai Duong",
      "Phung Ho Hai",
      "Nguyen Huy Hung"
    ],
    "publication_date": "2016-01-05T06:52:06Z",
    "arxiv_id": "http://arxiv.org/abs/1601.00748v3",
    "download_url": "https://arxiv.org/abs/1601.00748v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tame group actions on central simple algebras",
    "abstract": "We study actions of linear algebraic groups on finite-dimensional central simple algebras. We describe the fixed algebra for a broad class of such actions.",
    "authors": [
      "Zinovy Reichstein",
      "Nikolaus Vonessen"
    ],
    "publication_date": "2007-03-14T18:44:48Z",
    "arxiv_id": "http://arxiv.org/abs/math/0703402v2",
    "download_url": "https://arxiv.org/abs/math/0703402v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The relationship between skew group algebras and orbifold theory",
    "abstract": "Let V be a simple vertex operator algebra and let G be a finite automorphism group of V. In [DY], it was shown that any irreducible V-module is a completely reducible V^G-module where V^G is the G-invariant sub-vertex operator algebra of V. In this paper, we give an alternative proof of this fact using the theory of skew group algebras. We also extend this result to any irreducible g-twisted V-module when g is in the center of G and V is a g-rational vertex operator algebra.",
    "authors": [
      "Gaywalee Yamskulna"
    ],
    "publication_date": "2001-07-24T20:32:58Z",
    "arxiv_id": "http://arxiv.org/abs/math/0107180v2",
    "download_url": "https://arxiv.org/abs/math/0107180v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Factorizations in Numerical Semigroup Algebras",
    "abstract": "We study a numerical semigroup ring as an algebra over another numerical semigroup ring. The complete intersection property of numerical semigroup algebras is investigated using factorizations of monomials into minimal ones. The goal is to study whether a flat rectangular algebra is a complete intersection. Along this direction, special types of algebras generated by few monomials are worked out in detail.",
    "authors": [
      "I-Chiau Huang",
      "Raheleh Jafari"
    ],
    "publication_date": "2018-08-31T07:25:22Z",
    "arxiv_id": "http://arxiv.org/abs/1808.10616v1",
    "download_url": "https://arxiv.org/abs/1808.10616v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Almost laura algebras",
    "abstract": "In this paper, we propose a generalization for the class of laura algebras, which we call almost laura. We show that this new class of algebras retains most of the essential features of laura algebras, especially concerning the important role played by the non-semiregular components in their Auslander-Reiten quivers. Also, we study more intensively the left supported almost laura algebras, showing that these are characterized by the presence of a generalized standard, convex and faithful component. Finally, we prove that almost laura algebras behave well with respect to full subcategories, split-by-nilpotent extensions and skew group algebras.",
    "authors": [
      "David Smith"
    ],
    "publication_date": "2007-02-19T19:46:46Z",
    "arxiv_id": "http://arxiv.org/abs/math/0702562v3",
    "download_url": "https://arxiv.org/abs/math/0702562v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the tensor square of non-abelian nilpotent finite dimensional Lie algebras",
    "abstract": "For every finite $p$-group $G$ of order $p^n$ with derived subgroup of order $p^m$, Rocco in \\cite{roc} proved that the order of tensor square of $G$ is at most $p^{n(n-m)}$. This upper bound has been improved recently by author in \\cite{ni}. The aim of the present paper is to obtain a similar result for a non-abelian nilpotent Lie algebra of finite dimension. More precisely, for any given $n$-dimensional non-abelian nilpotent Lie algebra $L$ with derived subalgebra of dimension $m$ we have $\\mathrm{dim} (L\\otimes L)\\leq (n-m)(n-1)+2$. Furthermore for $m=1$, the explicit structure of $L$ is given when the equality holds.",
    "authors": [
      "Peyman Niroomand"
    ],
    "publication_date": "2010-02-12T14:24:05Z",
    "arxiv_id": "http://arxiv.org/abs/1002.2563v2",
    "download_url": "https://arxiv.org/abs/1002.2563v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On non-counital Frobenius algebras",
    "abstract": "A Frobenius algebra is a finite-dimensional algebra $A$ which comes equipped with a coassociative, counital comultiplication map $Δ$ that is an $A$-bimodule map. Here, we examine comultiplication maps for generalizations of Frobenius algebras: finite-dimensional self-injective (quasi-Frobenius) algebras. We show that large classes of such algebras, including finite-dimensional weak Hopf algebras, come equipped with a nonzero map $Δ$ as above that is not necessarily counital. We also conjecture that this comultiplicative structure holds for self-injective algebras in general.",
    "authors": [
      "Amanda Hernandez",
      "Chelsea Walton",
      "Harshit Yadav"
    ],
    "publication_date": "2022-04-29T16:16:35Z",
    "arxiv_id": "http://arxiv.org/abs/2204.14182v3",
    "download_url": "https://arxiv.org/abs/2204.14182v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On integrals and cointegrals for quasi-Hopf algebras",
    "abstract": "Using the machinery provided by a Frobenius algebra we show how the antipode of a quasi-Hopf algebra $H$ carries out left or right cointegrals for $H$. These formulas will allow us to find out the explicit form of an integral and a cointegral for the quantum double $D(H)$ of $H$ in terms of those of $H$, and so to answer to a conjecture of Hausser and Nill raised at the end of the nineties.",
    "authors": [
      "D. Bulacu",
      "S. Caenepeel"
    ],
    "publication_date": "2011-03-11T13:31:12Z",
    "arxiv_id": "http://arxiv.org/abs/1103.2263v2",
    "download_url": "https://arxiv.org/abs/1103.2263v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relative BGG sequences; I. Algebra",
    "abstract": "We develop a relative version of Kostant's harmonic theory and use this to prove a relative version of Kostant's theorem on Lie algebra (co)homology. These are associated to two nested parabolic subalgebras in a semisimple Lie algebra. We show how relative homology groups can be used to realize representations with lowest weight in one (regular or singular) affine Weyl orbit. In the regular case, we show how all the weights in the orbit can be realized as relative homology groups (with different coefficients). These results are motivated by applications to differential geometry and the construction of invariant differential operators.",
    "authors": [
      "Andreas Cap",
      "Vladimir Soucek"
    ],
    "publication_date": "2015-10-12T15:16:23Z",
    "arxiv_id": "http://arxiv.org/abs/1510.03331v3",
    "download_url": "https://arxiv.org/abs/1510.03331v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some properties on the tensor square of Lie algebras",
    "abstract": "In the present paper we extend and improve the results of \\cite{bl, br} for the tensor square of Lie algebras. More precisely, for any Lie algebra $L$ with $L/L^2$ of finite dimension, we prove $L\\otimes L\\cong L\\square L\\oplus L\\wedge L$ and $Z^{\\wedge}(L)\\cap L^2=Z^{\\otimes}(L)$. Moreover, we show that $L\\wedge L$ is isomorphic to derived subalgebra of a cover of $L$, and finally we give a free presentation for it.",
    "authors": [
      "Peyman Niroomand"
    ],
    "publication_date": "2010-06-11T09:43:14Z",
    "arxiv_id": "http://arxiv.org/abs/1006.2240v4",
    "download_url": "https://arxiv.org/abs/1006.2240v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rees algebra of maximal order Pfaffians and its diagonal subalgebras",
    "abstract": "Given a skew-symmetric matrix $X$, the Pfaffian of $X$ is defined as the square root of the determinant of $X$. In this article, we give the explicit defining equations of the Rees algebra of a Pfaffian ideal $I$ generated by the maximal order Pfaffians of a generic skew-symmetric matrix. We further prove that all diagonal subalgebras of the corresponding Rees algebra of $I$ are Koszul. We also look at Rees algebras of Pfaffian ideals of linear type associated with certain sparse skew-symmetric matrices. In particular, we consider the tridiagonal matrices and identify the corresponding Pfaffian ideals to be of Gröbner linear type and as the vertex cover ideals of unmixed bipartite graphs. As an application of our results, we conclude that all their ordinary and symbolic powers have linear quotients.",
    "authors": [
      "Neeraj Kumar",
      "Chitra Venugopal"
    ],
    "publication_date": "2023-02-15T06:21:27Z",
    "arxiv_id": "http://arxiv.org/abs/2302.07486v2",
    "download_url": "https://arxiv.org/abs/2302.07486v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Restricted infinitesimal deformations of restricted simple Lie algebras",
    "abstract": "We compute the restricted infinitesimal deformations of the restricted simple Lie algebras over an algebraically closed field of characteristic different from 2 and 3.",
    "authors": [
      "Filippo Viviani"
    ],
    "publication_date": "2007-05-06T20:29:18Z",
    "arxiv_id": "http://arxiv.org/abs/0705.0821v3",
    "download_url": "https://arxiv.org/abs/0705.0821v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Capability of Nilpotent Lie algebras with small derived Subalgebra",
    "abstract": "In this paper, we classify all capable nilpotent Lie algebras with derived subalgebra of dimension at most 1.",
    "authors": [
      "Peyman Niroomand",
      "Mohsen Parvizi"
    ],
    "publication_date": "2010-02-23T09:49:15Z",
    "arxiv_id": "http://arxiv.org/abs/1002.4280v4",
    "download_url": "https://arxiv.org/abs/1002.4280v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A $D$-module approach on the equations of the Rees algebra",
    "abstract": "Let $I \\subset R = \\mathbb{F}[x_1,x_2]$ be a height two ideal minimally generated by three homogeneous polynomials of the same degree $d$, where $\\mathbb{F}$ is a field of characteristic zero. We use the theory of $D$-modules to deduce information about the defining equations of the Rees algebra of $I$. Let $\\mathcal{K}$ be the kernel of the canonical map $α: \\text{Sym}(I) \\rightarrow \\text{Rees}(I)$ from the symmetric algebra of $I$ onto the Rees algebra of $I$. We prove that $\\mathcal{K}$ can be described as the solution set of a system of differential equations, that the whole bigraded structure of $\\mathcal{K}$ is characterized by the integral roots of certain $b$-functions, and that certain de Rham cohomology groups can give partial information about $\\mathcal{K}$.",
    "authors": [
      "Yairon Cid-Ruiz"
    ],
    "publication_date": "2017-06-19T23:26:09Z",
    "arxiv_id": "http://arxiv.org/abs/1706.06215v2",
    "download_url": "https://arxiv.org/abs/1706.06215v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Existence of almost Cohen-Macaulay algebras implies the existence of big Cohen-Macaulay algebras",
    "abstract": "In \\cite{AB}, the dagger closure is extended over finitely generated modules over Noetherian local domain $(R,\\fm)$ and it is proved to be a Dietz closure. In this short note we show that it also satisfies the `Algebra axiom' of \\cite{R.G} and this leads to the following result of this paper: For a complete Noetherian local domain, if it is contained in an almost Cohen-Macaulay domain, then there exists a balanced big Cohen-Macaulay algebra over it.",
    "authors": [
      "Rajsekhar Bhattacharyya"
    ],
    "publication_date": "2016-01-13T18:09:46Z",
    "arxiv_id": "http://arxiv.org/abs/1601.03335v2",
    "download_url": "https://arxiv.org/abs/1601.03335v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multilinear Polynomials Are Surjective on Algebras With Surjective Inner Derivations",
    "abstract": "Let $f(X_1,\\dots, X_n)$ be a nonzero multilinear noncommutative polynomial. If $A$ is a unital algebra with a surjective inner derivation, then every element in $A$ can be written as $f(a_1,\\dots,a_n)$ for some $a_i\\in A$.",
    "authors": [
      "Daniel Vitas"
    ],
    "publication_date": "2021-06-24T16:14:58Z",
    "arxiv_id": "http://arxiv.org/abs/2106.13140v1",
    "download_url": "https://arxiv.org/abs/2106.13140v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quadratic Leibniz conformal algebras",
    "abstract": "In this paper, we study a class of Leibniz conformal algebras called quadratic Leibniz conformal algebras. An equivalent characterization of a Leibniz conformal algebra $R=\\mathbb{C}[\\partial]V$ through three algebraic operations on $V$ are given. By this characterization, several constructions of quadratic Leibniz conformal algebras are presented. Moreover, one-dimensional central extensions of quadratic Leibniz conformal algebras are considered using some bilinear forms on $V$. In particular, we also study one-dimensional Leibniz central extensions of quadratic Lie conformal algebras.",
    "authors": [
      "Jinsen Zhou",
      "Yanyong Hong"
    ],
    "publication_date": "2016-07-18T02:29:56Z",
    "arxiv_id": "http://arxiv.org/abs/1607.04936v2",
    "download_url": "https://arxiv.org/abs/1607.04936v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Combinatorial derived invariants for gentle algebras",
    "abstract": "We define derived equivalent invariants for gentle algebras, constructed in an easy combinatorial way from the quiver with relations defining these algebras. Our invariants consist of pairs of natural numbers and contain important information about the algebra and the structure of the stable Auslander-Reiten quiver of its repetitive algebra. As a by-product we obtain that the number of arrows of the quiver of a gentle algebra is invariant under derived equivalence. Finally, our invariants separate the derived equivalence classes of gentle algebras with at most one cycle.",
    "authors": [
      "Diana Avella-Alaminos",
      "Christof Geiss"
    ],
    "publication_date": "2006-07-14T16:14:55Z",
    "arxiv_id": "http://arxiv.org/abs/math/0607348v3",
    "download_url": "https://arxiv.org/abs/math/0607348v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Artin-Schelter regular algebras of dimension five",
    "abstract": "We show that there are exactly three types of Hilbert series of Artin-Schelter regular algebras of dimension five with two generators. One of these cases (the most extreme) may not be realized by an enveloping algebra of a graded Lie algebra. This is a new phenomenon compared to lower dimensions, where all resolution types may be realized by such enveloping algebras.",
    "authors": [
      "Gunnar Floystad",
      "Jon Eivind Vatne"
    ],
    "publication_date": "2009-11-26T17:52:07Z",
    "arxiv_id": "http://arxiv.org/abs/0911.5129v3",
    "download_url": "https://arxiv.org/abs/0911.5129v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Connes-Moscovici characteristic map is a Lie algebra morphism",
    "abstract": "Let $H$ be a Hopf algebra with a modular pair in involution $(\\Character,1)$. Let $A$ be a (module) algebra over $H$ equipped with a non-degenerated $\\Character$-invariant $1$-trace $τ$. We show that Connes-Moscovici characteristic map $\\varphi_τ:HC^*_{(\\Character,1)}(H)\\rightarrow HC^*_λ(A)$ is a morphism of graded Lie algebras. We also have a morphism $Φ$ of Batalin-Vilkovisky algebras from the cotorsion product of $H$, $\\text{Cotor}_H^*({\\Bbbk},{\\Bbbk})$, to the Hochschild cohomology of $A$, $HH^*(A,A)$. Let $K$ be both a Hopf algebra and a symmetric Frobenius algebra. Suppose that the square of its antipode is an inner automorphism by a group-like element. Then this morphism of Batalin-Vilkovisky algebras $Φ:\\text{Cotor}_{K^\\vee}^*(\\mathbb{F},\\mathbb{F})\\cong \\text{Ext}_{K}(\\mathbb{F},\\mathbb{F}) \\hookrightarrow HH^*(K,K)$ is injective.",
    "authors": [
      "Luc Menichi"
    ],
    "publication_date": "2010-02-09T04:40:26Z",
    "arxiv_id": "http://arxiv.org/abs/1002.1771v3",
    "download_url": "https://arxiv.org/abs/1002.1771v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Categorical aspects of cointegrals on quasi-Hopf algebras",
    "abstract": "We discuss relations between some category-theoretical notions for a finite tensor category and cointegrals on a quasi-Hopf algebra. Specifically, for a finite-dimensional quasi-Hopf algebra $H$, we give an explicit description of categorical cointegrals of the category ${}_H \\mathscr{M}$ of left $H$-modules in terms of cointegrals on $H$. Provided that $H$ is unimodular, we also express the Frobenius structure of the `adjoint algebra' in the Yetter-Drinfeld category ${}^H_H \\mathscr{YD}$ by using an integral in $H$ and a cointegral on $H$. Finally, we give a description of the twisted module trace for projective $H$-modules in terms of cointegrals on $H$.",
    "authors": [
      "Taiki Shibata",
      "Kenichi Shimizu"
    ],
    "publication_date": "2018-12-09T07:49:36Z",
    "arxiv_id": "http://arxiv.org/abs/1812.03439v2",
    "download_url": "https://arxiv.org/abs/1812.03439v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A generalization of Veldkamp's theorem for a class of Lie algebras",
    "abstract": "A classical theorem of Veldkamp describes the center of an enveloping algebra of a Lie algebra of a semi-simple algebraic group in characteristic $p.$ We generalize this result to a class of Lie algebras with a property that they arise as the reduction modulo $p\\gg 0$ from an algebraic Lie algebra $\\mathfrak{g},$ such that $\\mathfrak{g}$ has no nontrivial semi-invariants in $Sym(\\mathfrak{g})$ and $Sym(\\mathfrak{g})^{\\mathfrak{g}}$ is a polynomial algebra.\n  As an application, we solve the derived isomorphism problem of enveloping algebras for the above class of Lie algebras.",
    "authors": [
      "Akaki Tikaradze"
    ],
    "publication_date": "2019-07-05T21:54:48Z",
    "arxiv_id": "http://arxiv.org/abs/1907.03031v3",
    "download_url": "https://arxiv.org/abs/1907.03031v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-linear positive maps between $C^*$-algebras",
    "abstract": "We present some properties of (not necessarily linear) positive maps between $C^*$-algebras. We first extend the notion of Lieb functions to that of Lieb positive maps between $C^*$-algebras. Then we give some basic properties and fundamental inequalities related to such maps. Next, we study $n$-positive maps ($n\\geq 2$). We show that if for a unital $3$-positive map $Φ: \\mathscr{A}\\longrightarrow\\mathscr{B}$ between unital $C^*$-algebras and some $ A\\in \\mathscr{A}$ equality $Φ(A^*A)= Φ(A)^* Φ(A)$ holds, then $Φ(XA)=Φ(X)Φ(A)$ for all $X \\in \\mathscr{A}$. In addition, we prove that for a certain class of unital positive maps $Φ: \\mathscr{A}\\longrightarrow\\mathscr{B}$ between unital $C^*$-algebras, the inequality $Φ(αA)\\leqαΦ(A)$ holds for all $ α\\in [0,1]$ and all positive elements $ A\\in \\mathscr{A}$ if and only if $Φ(0)=0$. Furthermore, we show that if for some $α$ in the unit ball of $\\mathbb{C}$ or in $\\mathbb{R}_+$ with $|α|\\neq 0,1$, the equality $Φ(αI)=αI$ holds, then $Φ$ is additive on positive elements of $\\mathscr{A}$. Moreover, we present a mild condition for a $6$-positive map, which ensures its linearity.",
    "authors": [
      "Ali Dadkhah",
      "Mox Sal Moslehian"
    ],
    "publication_date": "2018-11-07T19:47:46Z",
    "arxiv_id": "http://arxiv.org/abs/1811.03128v1",
    "download_url": "https://arxiv.org/abs/1811.03128v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Infinitesimal deformations of restricted simple Lie algebras II",
    "abstract": "We compute the infinitesimal deformations of two families of restricted simple Lie algebras: the contact and the Hamiltonian algebras.",
    "authors": [
      "Filippo Viviani"
    ],
    "publication_date": "2007-02-16T20:02:12Z",
    "arxiv_id": "http://arxiv.org/abs/math/0702499v4",
    "download_url": "https://arxiv.org/abs/math/0702499v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hilbert's Theorem 90 and algebraic spaces",
    "abstract": "In modern form, Hilbert's Theorem 90 tells us that R^1f_*(G_m)=0, where f is the canonical map between the etale site and the Zariski site of a scheme X. I construct examples showing that the corresponding statement for algebraic spaces does not hold. The first example is a nonseparated smooth 1-dimensional bug-eyed cover in Kollar's sense. The second example is a nonnormal proper algebraic space obtained by identifying points on suitable nonprojective smooth proper schemes.",
    "authors": [
      "Stefan Schroeer"
    ],
    "publication_date": "2001-10-22T14:30:42Z",
    "arxiv_id": "http://arxiv.org/abs/math/0110243v1",
    "download_url": "https://arxiv.org/abs/math/0110243v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Weak and Strong Lefschetz Properties for Artinian K-Algebras",
    "abstract": "Let A = bigoplus_{i >= 0} A_i be a standard graded Artinian K-algebra, where char K = 0. Then A has the Weak Lefschetz property if there is an element ell of degree 1 such that the multiplication times ell : A_i --> A_{i+1} has maximal rank, for every i, and A has the Strong Lefschetz property if times ell^d : A_i --> A_{i+d} has maximal rank for every i and d.\n  The main results obtained in this paper are the following.\n  1) EVERY height three complete intersection has the Weak Lefschetz property. (Our method, surprisingly, uses rank two vector bundles on P^2 and the Grauert-Mulich theorem.)\n  2) We give a complete characterization (including a concrete construction) of the Hilbert functions that can occur for K-algebras with the Weak or Strong Lefschetz property (and the characterization is the same one).\n  3) We give a sharp bound on the graded Betti numbers (achieved by our construction) of Artinian K-algebras with the Weak or Strong Lefschetz property and fixed Hilbert function. This bound is again the same for both properties. Some Hilbert functions in fact FORCE the algebra to have the maximal Betti numbers.\n  4) EVERY Artinian ideal in K[x,y] possesses the Strong Lefschetz property. This is false in higher codimension.",
    "authors": [
      "T. Harima",
      "J. Migliore",
      "U. Nagel",
      "J. Watanabe"
    ],
    "publication_date": "2002-08-26T18:37:38Z",
    "arxiv_id": "http://arxiv.org/abs/math/0208201v1",
    "download_url": "https://arxiv.org/abs/math/0208201v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Construction of free commutative integro-differential algebras by the method of Gröbner-Shirshov bases",
    "abstract": "In this paper, we construct a canonical linear basis for free commutative integro-differential algebras by applying the method of Gröbner-Shirshov bases. We establish the Composition-Diamond Lemma for free commutative differential Rota-Baxter algebras of order $n$. We also obtain a weakly monomial order on these algebras, allowing us to obtain Gröbner-Shirshov bases for free commutative integro-differential algebras on a set. We finally generalize the concept of functional derivations to free differential algebras with arbitrary weight and generating sets from which to construct a canonical linear basis for free commutative integro-differential algebras.",
    "authors": [
      "Xing Gao",
      "Li Guo",
      "Shanghua Zheng"
    ],
    "publication_date": "2013-02-01T00:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/1302.0041v1",
    "download_url": "https://arxiv.org/abs/1302.0041v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Decomposition of integer-valued polynomial algebras",
    "abstract": "Let $D$ be a commutative domain with field of fractions $K$, let $A$ be a torsion-free $D$-algebra, and let $B$ be the extension of $A$ to a $K$-algebra. The set of integer-valued polynomials on $A$ is ${\\rm Int}(A) = \\{f \\in B[X] \\mid f(A) \\subseteq A\\}$, and the intersection of ${\\rm Int}(A)$ with $K[X]$ is ${\\rm Int}_K(A)$, which is a commutative subring of $K[X]$. The set ${\\rm Int}(A)$ may or may not be a ring, but it always has the structure of a left ${\\rm Int}_K(A)$-module.\n  A $D$-algebra $A$ which is free as a $D$-module and of finite rank is called ${\\rm Int}_K$-decomposable if a $D$-module basis for $A$ is also an ${\\rm Int}_K(A)$-module basis for ${\\rm Int}(A)$; in other words, if ${\\rm Int}(A)$ can be generated by ${\\rm Int}_K(A)$ and $A$. A classification of such algebras has been given when $D$ is a Dedekind domain with finite residue rings. In the present article, we modify the definition of ${\\rm Int}_K$-decomposable so that it can be applied to $D$-algebras that are not necessarily free by defining $A$ to be ${\\rm Int}_K$-decomposable when ${\\rm Int}(A) \\cong {\\rm Int}_K(A) \\otimes_D A$. We then provide multiple characterizations of such algebras in the case where $D$ is a discrete valuation ring or a Dedekind domain with finite residue rings. In particular, if $D$ is the ring of integers of a number field $K$, we show that ${\\rm Int}_K$-decomposable algebras $A$ correspond to maximal $D$-orders in a separable $K$-algebra $B$, whose simple components have as center the same finite unramified Galois extension $F$ of $K$ and are unramified at each finite place of $F$. Finally, when both $D$ and $A$ are rings of integers in number fields, we show that ${\\rm Int}_K$-decomposable algebras correspond to unramified Galois extensions of $K$.",
    "authors": [
      "Giulio Peruginelli",
      "Nicholas J. Werner"
    ],
    "publication_date": "2016-04-28T07:53:43Z",
    "arxiv_id": "http://arxiv.org/abs/1604.08337v4",
    "download_url": "https://arxiv.org/abs/1604.08337v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Crossed products of $4$-algebras. Applications",
    "abstract": "A $4$-algebra is a commutative algebra $A$ over a field $k$ such that $(a^2)^2 = 0$, for all $a \\in A$. We have proved recently \\cite{Mil} that $4$-algebras play a prominent role in the classification of finite dimensional Bernstein algebras. Let $A$ be a $4$-algebra, $E$ a vector space and $π: E \\to A$ a surjective linear map with $V = {\\rm Ker} (π)$. All $4$-algebra structures on $E$ such that $π: E \\to A$ is an algebra map are described and classified by a global cohomological object ${\\mathbb G} {\\mathbb H}^{2} \\, (A, \\, V)$. Any such $4$-algebra is isomorphic to a crossed product $V \\# A$ and ${\\mathbb G} {\\mathbb H}^{2} \\, (A, \\, V)$ is a coproduct, over all $4$-algebras structures $\\cdot_V$ on $V$, of all non-abelian cohomologies ${\\mathbb H}^{2}_{\\rm nab} \\, \\bigl(A, \\, (V, \\, \\cdot_{V} )\\bigl)$, which are the classifying objects for all extensions of $A$ by $V$. Several applications and examples are provided: in particular, ${\\mathbb G} {\\mathbb H}^{2} \\, (A, \\, k)$ and ${\\mathbb G} {\\mathbb H}^{2} \\, (k, \\, V)$ are explicitly computed and the Galois group ${\\rm Gal} \\, (V \\# A/ V )$ of the extension $V \\hookrightarrow V \\# A$ is described.",
    "authors": [
      "G. Militaru"
    ],
    "publication_date": "2022-04-20T14:18:16Z",
    "arxiv_id": "http://arxiv.org/abs/2204.09474v2",
    "download_url": "https://arxiv.org/abs/2204.09474v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bridgeland's Hall algebras and Heisenberg doubles",
    "abstract": "Let $A$ be a finite dimensional hereditary algebra over a finite field, and let $m$ be a fixed integer such that $m=0$ or $m>2$. In the present paper, we first define an algebra $L_m(A)$ associated to $A$, called the $m$-periodic lattice algebra of $A$, and then prove that it is isomorphic to Bridgeland's Hall algebra $\\mathcal {D}\\mathcal {H}_m(A)$ of $m$-cyclic complexes over projective $A$-modules. Moreover, we show that there is an embedding of the Heisenberg double Hall algebra of $A$ into $\\mathcal {D}\\mathcal {H}_m(A)$.",
    "authors": [
      "Haicheng Zhang"
    ],
    "publication_date": "2017-05-11T02:10:47Z",
    "arxiv_id": "http://arxiv.org/abs/1705.03991v1",
    "download_url": "https://arxiv.org/abs/1705.03991v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the ascent of atomicity to monoid algebras",
    "abstract": "A commutative cancellative monoid is atomic if every non-invertible element factors into irreducibles (also called atoms), while an integral domain is atomic if its multiplicative monoid is atomic. Back in the eighties, Gilmer posed the question of whether the fact that a torsion-free monoid $M$ and an integral domain $R$ are both atomic implies that the monoid algebra $R[M]$ of $M$ over $R$ is also atomic. In general this is not true, and the first negative answer to this question was given by Roitman in 1993: he constructed an atomic integral domain whose polynomial extension is not atomic. More recently, Coykendall and the first author constructed finite-rank torsion-free atomic monoids whose monoid algebras over certain finite fields are not atomic. Still, the ascent of atomicity from finite-rank torsion-free monoids to their corresponding monoid algebras over fields of characteristic zero is an open problem. Coykendall and the first author also constructed an infinite-rank torsion-free atomic monoid whose monoid algebras (over any integral domain) are not atomic. As the primary result of this paper, we construct a rank-one torsion-free atomic monoid whose monoid algebras (over any integral domain) are not atomic. To do so, we introduce and study a methodological construction inside the class of rank-one torsion-free monoids that we call lifting, which consists in embedding a given monoid into another monoid that is often more tractable from the arithmetic viewpoint. For instance, the embedding in the lifting construction preserves the ascending chain condition on principal ideals and the existence of maximal common divisors.",
    "authors": [
      "Felix Gotti",
      "Henrick Rabinovitz"
    ],
    "publication_date": "2023-10-28T14:11:07Z",
    "arxiv_id": "http://arxiv.org/abs/2310.18712v2",
    "download_url": "https://arxiv.org/abs/2310.18712v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Monoidal Hom-Hopf algebras",
    "abstract": "Hom-structures (Lie algebras, algebras, coalgebras, Hopf algebras) have been investigated in the literature recently. We study Hom-structures from the point of view of monoidal categories; in particular, we introduce a symmetric monoidal category such that Hom-algebras coincide with algebras in this monoidal category, and similar properties for coalgebras, Hopf algebras and Lie algebras.",
    "authors": [
      "S. Caenepeel",
      "I. Goyvaerts"
    ],
    "publication_date": "2009-07-01T15:50:50Z",
    "arxiv_id": "http://arxiv.org/abs/0907.0187v3",
    "download_url": "https://arxiv.org/abs/0907.0187v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some Non-Unimodal Level Algebras",
    "abstract": "In 2005, building on his own recent work and that of F. Zanello, A. Iarrobino discovered some constructions that, he conjectured, would yield level algebras with non-unimodal Hilbert functions. This thesis provides proofs of non-unimodality for Iarrobino's level algebras, as well as for other level algebras that the author has constructed along similar lines. The key technical contribution is to extend some results published by Iarrobino in 1984. Iarrobino's results provide insight into some naturally arising vector subspaces of the vector space R_d of forms of fixed degree in a polynomial ring in several variables. In this thesis, the problem is approached by combinatorial methods and results similar to Iarrobino's are proved for a different class of vector subspaces of R_d.\n  The combinatorial methods involve the definition of a new class of matrices called L-Matrices, which have useful properties that are inherited by their submatrices. A particular class of square L-Matrices, associated with some specialized partially ordered sets having interesting combinatorial properties, is identified. For this class of L-Matrices, necessary and sufficient conditions are given that they be nonsingular. Several larger questions are discussed whose answers are incrementally improved by the knowledge that the new non-unimodal level algebras exist.",
    "authors": [
      "Arthur Jay Weiss"
    ],
    "publication_date": "2007-08-24T15:19:26Z",
    "arxiv_id": "http://arxiv.org/abs/0708.3354v1",
    "download_url": "https://arxiv.org/abs/0708.3354v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On certain vertex algebras and their modules associated with vertex algebroids",
    "abstract": "We study the family of vertex algebras associated with vertex algebroids, constructed by Gorbounov, Malikov, and Schechtman. As the main result, we classify all the (graded) simple modules for such vertex algebras and we show that the equivalence classes of graded simple modules one-to-one correspond to the equivalence classes of simple modules for the Lie algebroids associated with the vertex algebroids. To achieve our goal, we construct and exploit a Lie algebra from a given vertex algebroid.",
    "authors": [
      "Haisheng Li",
      "Gaywalee Yamskulna"
    ],
    "publication_date": "2004-10-20T14:51:30Z",
    "arxiv_id": "http://arxiv.org/abs/math/0410446v1",
    "download_url": "https://arxiv.org/abs/math/0410446v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On maximal primitive quotients of infinitesimal Cherednik algebras of gl_n",
    "abstract": "We prove analogues of some of Kostant's theorems for infinitesimal Cherednik algebras of gl_n. As a consequence, it follows that in positive characteristic the Azumaya and smooth loci of the center of these algebras coincide.",
    "authors": [
      "Akaki Tikaradze"
    ],
    "publication_date": "2010-08-31T23:00:42Z",
    "arxiv_id": "http://arxiv.org/abs/1009.0046v2",
    "download_url": "https://arxiv.org/abs/1009.0046v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Codensity, profiniteness and algebras of semiring-valued measures",
    "abstract": "We show that, if S is a finite semiring, then the free profinite S-semimodule on a Boolean Stone space X is isomorphic to the algebra of all S-valued measures on X, which are finitely additive maps from the Boolean algebra of clopens of X to S. These algebras naturally appear in the logic approach to formal languages as well as in idempotent analysis. Whenever S is a (pro)finite idempotent semiring, the S-valued measures are all given uniquely by continuous density functions. This generalises the classical representation of the Vietoris hyperspace of a Boolean Stone space in terms of continuous functions into the Sierpinski space.\n  We adopt a categorical approach to profinite algebra which is based on profinite monads. The latter were first introduced by Adamek et al. as a special case of the notion of codensity monads.",
    "authors": [
      "Luca Reggio"
    ],
    "publication_date": "2018-07-27T14:04:30Z",
    "arxiv_id": "http://arxiv.org/abs/1807.10637v2",
    "download_url": "https://arxiv.org/abs/1807.10637v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hopf actions on filtered regular algebras",
    "abstract": "We study finite dimensional Hopf algebra actions on so-called filtered Artin-Schelter regular algebras of dimension n, particularly on those of dimension 2. The first Weyl algebra is an example of such on algebra with n=2, for instance. Results on the Gorenstein condition and on the global dimension of the corresponding fixed subrings are also provided.",
    "authors": [
      "Kenneth Chan",
      "Chelsea Walton",
      "Yanhua Wang",
      "James Zhang"
    ],
    "publication_date": "2012-11-28T03:52:05Z",
    "arxiv_id": "http://arxiv.org/abs/1211.6513v2",
    "download_url": "https://arxiv.org/abs/1211.6513v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Faces of polytopes and Koszul algebras",
    "abstract": "Let $\\g$ be a reductive Lie algebra and $V$ a $\\g$-semisimple module. In this article, we study the category $\\G$ of graded finite-dimensional representations of $\\g \\ltimes V$. We produce a large class of truncated subcategories, which are directed and highest weight. Suppose $V$ is finite-dimensional with weights $\\wt(V)$. Let $Ψ\\subset \\wt(V)$ be the set of weights contained in a face $\\F$ of the polytope that is the convex hull of $\\wt(V)$. For each such $Ψ$, we produce quasi-hereditary Koszul algebras. We use these Koszul algebras to construct an infinite-dimensional graded subalgebra $\\spg$ of the locally finite part of the algebra of invariants $(END{\\C} (\\V) \\otimes \\Sym V)^{\\g}$, where $\\V$ is the direct sum of all simple finite-dimensional $\\g$-modules. We prove that $\\spg$ is Koszul of finite global dimension.",
    "authors": [
      "Vyjayanthi Chari",
      "Apoorva Khare",
      "Tim Ridenour"
    ],
    "publication_date": "2011-05-13T21:22:40Z",
    "arxiv_id": "http://arxiv.org/abs/1105.2840v3",
    "download_url": "https://arxiv.org/abs/1105.2840v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A family of quotients of the Rees algebra",
    "abstract": "A family of quotient rings of the Rees algebra associated to a commutative ring is studied. This family generalizes both the classical concept of idealization by Nagata and a more recent concept, the amalgamated duplication of a ring. It is shown that several properties of the rings of this family do not depend on the particular member.",
    "authors": [
      "Valentina Barucci",
      "Marco D'Anna",
      "Francesco Strazzanti"
    ],
    "publication_date": "2014-03-17T18:32:16Z",
    "arxiv_id": "http://arxiv.org/abs/1403.4200v1",
    "download_url": "https://arxiv.org/abs/1403.4200v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the automorphisms of quantum Weyl algebras",
    "abstract": "Motivated by Weyl algebra analogues of the Jacobian conjecture and the Tame Generators problem, we prove quantum versions of these problems for a family of analogues to the Weyl algebras. In particular, our results cover the Weyl-Hayashi algebras and tensor powers of a quantization of the first Weyl algebra which arises as a primitive factor algebra of $U_q^+(\\mathfrak{so}_5)$.",
    "authors": [
      "A. P. Kitchin",
      "S. Launois"
    ],
    "publication_date": "2015-11-05T15:13:57Z",
    "arxiv_id": "http://arxiv.org/abs/1511.01775v2",
    "download_url": "https://arxiv.org/abs/1511.01775v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The $q$-Schur algebras in type $D$, I: fundamental multiplication formulas",
    "abstract": "By embedding the Hecke algebra $\\check H_q$ of type $D$ into the Hecke algebra $H_{q,1}$ of type $B$ with unequal parameters $(q,1)$, the $q$-Schur algebras $S^κ_q(n,r)$ of type $D$ is naturally defined as the endomorphism algebra of the tensor space with the $\\check H_q$-action restricted from the $H_{q,1}$-action that defines the $(q,1)$-Schur algebra $S^\\jmath_{q,1}(n,r)$ of type $B$. We investigate the algebras $S^\\jmath_{q,1}(n,r)$ and $S^κ_q(n,r)$ both algebraically and geometrically and describe their standard bases, dimension formulas and weight idempotents. Most importantly, we use the geometrically derived two sets of the fundamental multiplication formulas in $S^\\jmath_{q,1}(n,r)$ to derive multi-sets (9 sets in total!) of the fundamental multiplication formulas in $S^κ_q(n,r)$.",
    "authors": [
      "Jie Du",
      "Yiqiang Li",
      "Zhaozhao Zhao"
    ],
    "publication_date": "2024-06-13T12:43:52Z",
    "arxiv_id": "http://arxiv.org/abs/2406.09057v2",
    "download_url": "https://arxiv.org/abs/2406.09057v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Intrinsic construction of invariant functions on simple Lie algebras",
    "abstract": "An algorithm for constructing primitive adjoint-invariant functions on a complex simple Lie algebra is presented. The construction is intrinsic in the sense that it does not resort to any representation. A primitive invariant function on the whole Lie algebra is obtained by lifting a coordinate function on a Kostant slice of the Lie algebra. Such an intrinsic construction of invariant functions is most useful for the bigger exceptional Lie algebras such as the E's. The Maple implementation of this algorithm is outlined at the end and will be applied to these exceptional Lie algebras in a future work.",
    "authors": [
      "Zhaohu Nie"
    ],
    "publication_date": "2013-03-05T18:35:16Z",
    "arxiv_id": "http://arxiv.org/abs/1303.1131v2",
    "download_url": "https://arxiv.org/abs/1303.1131v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An algebraic proof of the commutativity of the intersection with divisors",
    "abstract": "We present a purely algebraic proof of the commutativity of the operation defined by intersection with divisors on the Chow group of a local Noetherian domain.",
    "authors": [
      "Paul Roberts",
      "Sandra Spiroff"
    ],
    "publication_date": "2007-07-03T14:56:29Z",
    "arxiv_id": "http://arxiv.org/abs/0707.0432v2",
    "download_url": "https://arxiv.org/abs/0707.0432v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lattices of Equivalence Relations Closed Under the Operations of Relation Algebras",
    "abstract": "One of the longstanding problems in universal algebra is the question of which finite lattices are isomorphic to the congruence lattices of finite algebras. This question can be phrased as which finite lattices can be represented as lattices of equivalence relations on finite sets closed under certain first order formulas. We generalize this question to a different collection of first-order formulas, giving examples to demonstrate that our new question is distinct. We then prove that every lattice $\\m M_n$ can be represented in this new way. [This is an extended version of a paper submitted to \\emph{Algebra Universalis}.]",
    "authors": [
      "Jeremy F. Alm",
      "John W. Snow"
    ],
    "publication_date": "2012-09-27T00:31:21Z",
    "arxiv_id": "http://arxiv.org/abs/1209.6099v2",
    "download_url": "https://arxiv.org/abs/1209.6099v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quasi-Gorensteinness of extended Rees algebras",
    "abstract": "Let $R$ be a Noetherian local ring and $I$ an $R$-ideal. It is well-known that if the associated graded ring $\\gr_I(R)$ is Cohen-Macaulay (Gorenstein), then so is $R$, but the converse is not true in general. In this paper we investigate the Cohen-Macaulayness and Gorensteinness of the associated graded ring $\\gr_I(R)$ under the hypothesis of the extended Rees algebra $R[It,t^{-1}]$ is quasi-Gorenstein or the associated graded ring $\\gr_I(R)$ is a domain.",
    "authors": [
      "Youngsu Kim"
    ],
    "publication_date": "2013-09-16T16:08:53Z",
    "arxiv_id": "http://arxiv.org/abs/1309.4019v2",
    "download_url": "https://arxiv.org/abs/1309.4019v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The universal cover of an algebra without double bypass",
    "abstract": "Let A be a basic finite dimensional and connected algebra over an algebraically closed field k with zero characteristic. If the ordinary quiver of A has no double bypasses, we show that A admits a Galois covering which satisfies a universal property with respect to the Galois coverings of A. This universal property is similar to the one of the universal cover of a connected topological space.",
    "authors": [
      "Patrick Le Meur"
    ],
    "publication_date": "2005-07-25T14:48:29Z",
    "arxiv_id": "http://arxiv.org/abs/math/0507513v4",
    "download_url": "https://arxiv.org/abs/math/0507513v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The algebraic density property for affine toric varieties",
    "abstract": "In this paper we generalize the algebraic density property to not necessarily smooth affine varieties relative to some closed subvariety containing the singular locus. This property implies the remarkable approximation results for holomorphic automorphisms of the Andersén-Lempert theory. We show that an affine toric variety X satisfies this algebraic density property relative to a closed T-invariant subvariety Y if and only if X-Y is different from T. For toric surfaces we are able to classify those which posses a strong version of the algebraic density property (relative to the singular locus). The main ingredient in this classification is our proof of an equivariant version of Brunella's famous classification of complete algebraic vector fields in the affine plane.",
    "authors": [
      "Frank Kutzschebauch",
      "Matthias Leuenberger",
      "Alvaro Liendo"
    ],
    "publication_date": "2014-02-10T18:10:41Z",
    "arxiv_id": "http://arxiv.org/abs/1402.2227v2",
    "download_url": "https://arxiv.org/abs/1402.2227v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lifting of Quantum Linear Spaces and Pointed Hopf Algebras of order p^3",
    "abstract": "We propose the following principle to study pointed Hopf algebras, or more generally, Hopf algebras whose coradical is a Hopf subalgebra. Given such a Hopf algebra A, consider its coradical filtration and the associated graded coalgebra grad(A). Then grad(A) is a graded Hopf algebra, since the coradical A_0 of A is a Hopf subalgebra. In addition, there is a projection π: grad(A) \\to A_0; let R be the algebra of coinvariants of π. Then, by a result of Radford and Majid, R is a braided Hopf algebra and grad(A) is the bosonization (or biproduct) of R and A_0: grad(A) is isomorphic to (R # A_0). The principle we propose to study A is first to study R, then to transfer the information to grad(A) via bosonization, and finally to lift to A. In this article, we apply this principle to the situation when R is the simplest braided Hopf algebra: a quantum linear space. As consequences of our technique, we obtain the classification of pointed Hopf algebras of order p^3 (p an odd prime) over an algebraically closed field of characteristic zero; with the same hypothesis, the characterization of the pointed Hopf algebras whose coradical is abelian and has index p or p^2; and an infinite family of pointed, non-isomorphic, Hopf algebras of the same dimension. This last result gives a negative answer to a conjecture of I. Kaplansky.",
    "authors": [
      "N. Andruskiewitsch",
      "H. -J. Schneider"
    ],
    "publication_date": "1998-03-13T18:49:50Z",
    "arxiv_id": "http://arxiv.org/abs/math/9803058v1",
    "download_url": "https://arxiv.org/abs/math/9803058v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Jordan type of full Perazzo algebras",
    "abstract": "In this paper, we compute all possible Jordan types of linear forms $\\ell$ in any full Perazzo algebra $A$. In some cases we are also able to compute the corresponding Jordan degree type, which is a finer invariant.",
    "authors": [
      "Pedro Macias Marques",
      "Rosa M. Miró-Roig",
      "Josep Pérez"
    ],
    "publication_date": "2025-06-30T14:34:53Z",
    "arxiv_id": "http://arxiv.org/abs/2506.23904v2",
    "download_url": "https://arxiv.org/abs/2506.23904v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Artinian level algebras of low socle degree",
    "abstract": "In this paper we study Hilbert functions and isomorphism classes of Artinian level local algebras via Macaulay's inverse system. Upper and lower bounds concerning numerical functions admissible for level algebras of fixed type and socle degree are known. For each value in this range we exhibit a level local algebra with that Hilbert function, provided that the socle degree is at most three. Furthermore we prove that level local algebras of socle degree three and maximal Hilbert function are graded. In the graded case the extremal strata have been parametrized by Cho and Iarrobino.",
    "authors": [
      "Alessandro De Stefani"
    ],
    "publication_date": "2012-08-16T22:41:41Z",
    "arxiv_id": "http://arxiv.org/abs/1208.3506v1",
    "download_url": "https://arxiv.org/abs/1208.3506v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Singular equivalence of finite dimensional algebras with radical square zero",
    "abstract": "We prove that the Crisp and Gow's quiver operation on a finite quiver Q produces a new quiver Q' with fewer vertices, such that the finite dimensional algebras kQ/J^2 and kQ'/J^2 are singularly equivalent. This operation is a general quiver operation which includes as specific examples some operations which arise naturally in symbolic dynamics (e.g., (elementary) strong shift equivalent, (in-out) splitting, source elimination, etc.).",
    "authors": [
      "Alireza Nasr-Isfahani"
    ],
    "publication_date": "2016-03-14T10:27:54Z",
    "arxiv_id": "http://arxiv.org/abs/1603.04191v2",
    "download_url": "https://arxiv.org/abs/1603.04191v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twists of graded algebras in monoidal categories",
    "abstract": "Zhang twists are a common tool for deforming graded algebras over a field in a way that preserves important ring-theoretic properties. We generalize Zhang twists to the setting of closed monoidal categories equipped with their self-enriched structure. Along the way, we prove several key results about algebraic structures in closed monoidal categories missing from the literature. We use these to ultimately prove Morita-type results, showcasing when graded algebras with equivalent categories of graded modules can be related by Zhang twists.",
    "authors": [
      "Fernando Liu Lopez",
      "Chelsea Walton"
    ],
    "publication_date": "2023-11-29T21:44:12Z",
    "arxiv_id": "http://arxiv.org/abs/2311.18105v2",
    "download_url": "https://arxiv.org/abs/2311.18105v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Veronese Algebras and Modules of Rings with Straightening Laws",
    "abstract": "Do the Veronese rings of an algebra with straightening laws (ASL) still have an ASL structure? We give positive answers to this question in some particular cases, namely for the second Veronese algebra of Hibi rings and of discrete ASLs. We also prove that the Veronese modules of the polynomial ring have a structure of module with straightening laws. In dimension at most three we present a poset construction that has the required combinatorial properties to support such a structure.",
    "authors": [
      "Alexandru Constantinescu"
    ],
    "publication_date": "2012-01-13T14:45:19Z",
    "arxiv_id": "http://arxiv.org/abs/1201.2851v1",
    "download_url": "https://arxiv.org/abs/1201.2851v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of irreducible modules of the vertex algebra $V_L^+$ when $L$ is a nondegenerate even lattice of an arbitrary rank",
    "abstract": "In this paper, we first classify all irreducible modules of the vertex algebra $V_L^+$ when $L$ is a negative definite even lattice of arbitrary rank. In particular, we show that any irreducible $V_L^+$-module is isomorphic to a submodule of an irreducible twisted $V_L$-module. We then extend this result to a vertex algebra $V_L^+$ when $L$ is a nondegenerate even lattice of finite rank.",
    "authors": [
      "Gaywalee Yamskulna"
    ],
    "publication_date": "2008-07-04T20:26:36Z",
    "arxiv_id": "http://arxiv.org/abs/0807.0817v1",
    "download_url": "https://arxiv.org/abs/0807.0817v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]