[
  {
    "title": "Invariant theory and coefficient algebras of Lie algebras",
    "abstract": "The coefficient algebra of a finite-dimensional Lie algebra on a finite-dimensional representation is defined as the subalgebra generated by all coefficients of the corresponding characteristic polynomial. We explore connections between classical invariant theory and the coefficient algebras of finite-dimensional complex Lie algebras on some representations. Specifically, we prove that with respect to any symmetric power of the standard representation: (a) the coefficient algebra of the upper triangular solvable complex Lie algebra is isomorphic to the ring of symmetric polynomials; (b) the coefficient algebra of the general linear complex Lie algebra is isomorphic to the invariant ring of the general linear group with the conjugacy action on the full space of matrices; and (c) the coefficient algebra of the special linear complex Lie algebra can be generated by classical trace functions. As an application, we determine the characteristic polynomial of the special linear complex Lie algebra on its standard representation.",
    "authors": [
      "Yin Chen",
      "Runxuan Zhang"
    ],
    "publication_date": "2024-11-17T14:52:27Z",
    "arxiv_id": "http://arxiv.org/abs/2411.11095v3",
    "download_url": "https://arxiv.org/abs/2411.11095v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Categorical Constructions for Hopf Algebras",
    "abstract": "We prove that both, the embedding of the category of Hopf algebras into that of bialgebras and the forgetful functor from the category of Hopf algebras to the category of algebras, have right adjoints; in other words: every bialgebra has a Hopf coreflection and on every algebra there exists a cofree Hopf algebra. In this way we give an affirmative answer to a forty years old problem posed by Sweedler. On the route the coequalizers and the coproducts in the category of Hopf algebras are explicitly described.",
    "authors": [
      "A. L. Agore"
    ],
    "publication_date": "2009-05-16T17:42:40Z",
    "arxiv_id": "http://arxiv.org/abs/0905.2613v3",
    "download_url": "https://arxiv.org/abs/0905.2613v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Crossed product of Hopf algebras",
    "abstract": "The main properties of the crossed product in the category of Hopf algebras are investigated. Let $A$ and $H$ be two Hopf algebras connected by two morphism of coalgebras $\\triangleright : H\\ot A \\to A$, $f:H\\ot H\\to A$. The crossed product $A #_{f}^{\\triangleright} H$ is a new Hopf algebra containing $A$ as a normal Hopf subalgebra. Furthermore, a Hopf algebra $E$ is isomorphic as a Hopf algebra to a crossed product of Hopf algebras $A #_{f}^{\\triangleright} H$ if and only if $E$ factorizes through a normal Hopf subalgebra $A$ and a subcoalgebra $H$ such that $1_{E} \\in H$. The universality of the construction, the existence of integrals, commutativity or involutivity of the crossed product are studied. Looking at the quantum side of the construction we shall give necessary and sufficient conditions for a crossed product to be a coquasitriangular Hopf algebra. In particular, all braided structures on the monoidal category of $A #_{f}^{\\triangleright} H$-comodules are explicitly described in terms of their components. As an example, the braidings on a crossed product between $H_{4}$ and $k[C_{3}]$ are described in detail.",
    "authors": [
      "A. L. Agore"
    ],
    "publication_date": "2012-03-12T10:45:35Z",
    "arxiv_id": "http://arxiv.org/abs/1203.2454v2",
    "download_url": "https://arxiv.org/abs/1203.2454v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classifying complements for Hopf algebras and Lie algebras",
    "abstract": "Let $A \\subseteq E$ be a given extension of Hopf (respectively Lie) algebras. We answer the \\emph{classifying complements problem} (CCP) which consists of describing and classifying all complements of $A$ in $E$. If $H$ is a given complement then all the other complements are obtained from $H$ by a certain type of deformation. We establish a bijective correspondence between the isomorphism classes of all complements of $A$ in $E$ and a cohomological type object ${\\mathcal H}{\\mathcal A}^{2} (H, A \\, | \\, (\\triangleright, \\triangleleft) )$, where $(\\triangleright, \\triangleleft)$ is the matched pair associated to $H$. The factorization index $[E: A]^f$ is introduced as a numerical measure of the (CCP). For two $n$-th roots of unity we construct a $4n^2$-dimensional Hopf algebra whose factorization index over the group algebra is arbitrary large.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2012-05-30T07:28:38Z",
    "arxiv_id": "http://arxiv.org/abs/1205.6564v5",
    "download_url": "https://arxiv.org/abs/1205.6564v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantizations of generalized-Witt algebra and of Jacobson-Witt algebra in the modular case",
    "abstract": "We quantize the generalized-Witt algebra in characteristic 0 with its Lie bialgebra structures discovered by Song-Su (\\cite{GY}). Via a modulo p reduction and a modulo \"p-restrictedness\" reduction process, we get 2^n{-}1 families of truncated p-polynomial noncocommutative deformations of the restricted universal enveloping algebra of the Jacobson-Witt algebra \\mathbf{W}(n;\\underline{1}) (for the Cartan type simple modular restricted Lie algebra of W type). They are new families of noncommutative and noncocommutative Hopf algebras of dimension p^{1+np^n} in characteristic p. Our results generalize a work of Grunspan (J. Algebra 280 (2004), 145--161, \\cite{CG}) in rank n=1 case in characteristic 0. In the modular case, the argument for a refined version follows from the modular reduction approach (different from \\cite{CG}) with some techniques from the modular Lie algebra theory.",
    "authors": [
      "Naihong Hu",
      "Xiuling Wang"
    ],
    "publication_date": "2006-02-13T20:02:10Z",
    "arxiv_id": "http://arxiv.org/abs/math/0602281v5",
    "download_url": "https://arxiv.org/abs/math/0602281v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Orbifolds of Gaiotto-Rapčák $Y$-algebras",
    "abstract": "The universal two-parameter ${\\mathcal W}_{\\infty}$-algebra is a classifying object for vertex algebras of type ${\\mathcal W}(2,3,\\dots, N)$ for some $N$. Gaiotto and Rapčák recently introduced a large family of such vertex algebras called $Y$-algebras, which includes many known examples such as the principal ${\\mathcal W}$-algebras of type $A$. These algebras admit an action of $\\mathbb{Z}_2$, and in this paper we study the structure of their orbifolds. Aside from the extremal cases of either the Virasoro algebra or the ${\\mathcal W}_3$-algebra, we show that these orbifolds are generated by a single field in conformal weight $4$, and we give strong finite generating sets.",
    "authors": [
      "Masoumah Al-Ali",
      "Andrew R. Linshaw"
    ],
    "publication_date": "2022-08-22T03:41:54Z",
    "arxiv_id": "http://arxiv.org/abs/2208.10037v2",
    "download_url": "https://arxiv.org/abs/2208.10037v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of PM Quiver Hopf Algebras",
    "abstract": "We describe certain quiver Hopf algebras by parameters. This leads to the classification of multiple Taft algebras as well as pointed Yetter-Drinfeld modules and their corresponding Nichols algebras. In particular, when the ground-field $k$ is the complex field and $G$ is a finite abelian group, we classify quiver Hopf algebras over $G$, multiple Taft algebras over $G$ and Nichols algebras in $^{kG}_{kG} {\\cal YD}$. We show that the quantum enveloping algebra of a complex semisimple Lie algebra is a quotient of a semi-path Hopf algebra.",
    "authors": [
      "Shouchuan Zhang",
      "Yao-Zhong Zhang",
      "Hui-Xiang Chen"
    ],
    "publication_date": "2004-10-06T11:14:56Z",
    "arxiv_id": "http://arxiv.org/abs/math/0410150v15",
    "download_url": "https://arxiv.org/abs/math/0410150v15",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Connected Hopf Algebras of Dimension $p^2$",
    "abstract": "Let $H$ be a finite-dimensional connected Hopf algebra over an algebraically closed field $\\field$ of characteristic $p>0$. We provide the algebra structure of the associated graded Hopf algebra $\\gr H$. Then, we study the case when $H$ is generated by a Hopf subalgebra $K$ and another element and the case when $H$ is cocommutative. When $H$ is a restricted universal enveloping algebra, we give a specific basis for the second term of the Hochschild cohomology of the coalgebra $H$ with coefficients in the trivial $H$-bicomodule $\\field$. Finally, we classify all connected Hopf algebras of dimension $p^2$ over $\\field$.",
    "authors": [
      "Xingting Wang"
    ],
    "publication_date": "2012-08-10T20:24:54Z",
    "arxiv_id": "http://arxiv.org/abs/1208.2280v2",
    "download_url": "https://arxiv.org/abs/1208.2280v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Left-symmetric Algebras From Linear Functions",
    "abstract": "In this paper, some left-symmetric algebras are constructed from linear functions. They include a kind of simple left-symmetric algebras and some examples appearing in mathematical physics. Their complete classification is also given, which shows that they can be regarded as generalization of certain 2-dimensional left-symmetric algebras.",
    "authors": [
      "Chengming Bai"
    ],
    "publication_date": "2004-06-16T14:55:39Z",
    "arxiv_id": "http://arxiv.org/abs/math/0406325v1",
    "download_url": "https://arxiv.org/abs/math/0406325v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structure of semisimple Hopf algebras of dimension $p^2q^2$",
    "abstract": "Let $p,q$ be prime numbers with $p^4<q$, and $k$ an algebraically closed field of characteristic 0. We show that semisimple Hopf algebras of dimension $p^2q^2$ can be constructed either from group algebras and their duals by means of extensions, or from Radford biproduct $R#kG$, where $kG$ is the group algebra of group $G$ of order $p^2$, $R$ is a semisimple Yetter-Drinfeld Hopf algebra in ${}^{kG}_{kG}\\mathcal{YD}$ of dimension $q^2$. As an application, the special case that the structure of semisimple Hopf algebras of dimension $4q^2$ is given.",
    "authors": [
      "Jingcheng Dong"
    ],
    "publication_date": "2010-09-18T09:15:25Z",
    "arxiv_id": "http://arxiv.org/abs/1009.3541v2",
    "download_url": "https://arxiv.org/abs/1009.3541v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A note on Rees algebras and the MFMC property",
    "abstract": "We study irreducible representations of Rees cones and characterize the max-flow min-cut property of clutters in terms of the normality of Rees algebras and the integrality of certain polyhedra. Then we present some applications to combinatorial optimization and commutative algebra. As a byproduct we obtain an \"effective\" method, based on the program \"Normaliz\", to determine whether a given clutter satisfies the max-flow min-cut property. Let C be a clutter and let I be its edge ideal. We prove that C has the max-flow min-cut property if and only if I is normally torsion free, that is, I^i=I^{(i)} for all i>=1, where I^{(i)} is the ith symbolic power of I.",
    "authors": [
      "I. Gitler",
      "C. E. Valencia",
      "R. H. Villarreal"
    ],
    "publication_date": "2005-11-11T17:18:56Z",
    "arxiv_id": "http://arxiv.org/abs/math/0511307v2",
    "download_url": "https://arxiv.org/abs/math/0511307v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Doubling pre-Lie algebra of rooted trees",
    "abstract": "We study the pre-Lie algebra of rooted trees $(\\Cal T, \\rightarrow)$ and we define a pre-Lie structure on its doubling space $(V, \\leadsto)$. Also, we find the enveloping algebras of the two pre-Lie algebras denoted respectively by $(\\Cal H', \\star, Γ)$ and $(\\Cal D', \\bigstar, χ)$. We prove that $(\\Cal D', \\bigstar, χ)$ is a module-bialgebra on $(\\Cal H', \\star, Γ)$ and we find some relations between the two pre-Lie structures.",
    "authors": [
      "Mohamed Belhaj Mohamed"
    ],
    "publication_date": "2019-12-12T06:05:58Z",
    "arxiv_id": "http://arxiv.org/abs/1912.05787v1",
    "download_url": "https://arxiv.org/abs/1912.05787v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some interpretations for algebraic invariants of edge ideals of hypergraphs via combinatorial invariants",
    "abstract": "The present work is concerned with characterizing some algebraic invariants of edge ideals of hypergraphs. To this aim, firstly, we introduce some kinds of combinatorial invariants similar to matching numbers for hypergraphs. Then we compare them to each other and to previously existing ones. These invariants are used for characterizing or bounding some algebraic invariants of edge ideals of hypergraphs such as graded Betti numbers, projective dimension and Castelnouvo-Mumford regularity.",
    "authors": [
      "Somayeh Moradi",
      "Fahimeh Khosh-Ahang Ghasr"
    ],
    "publication_date": "2020-01-24T19:51:33Z",
    "arxiv_id": "http://arxiv.org/abs/2001.09176v1",
    "download_url": "https://arxiv.org/abs/2001.09176v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deformations of the Exterior Algebra of Differential Forms",
    "abstract": "Let $D:Ω\\xrightarrow{}Ω$ be a differential operator defined in the exterior algebra $Ω$ of differential forms over the polynomial ring $S$ in $n$ variables. In this work we give conditions for deforming the module structure of $Ω$ over $S$ induced by the differential operator $D$, in order to make $D$ an $S$-linear morphism while leaving the $\\mathbb{C}$-vector space structure of $Ω$ unchanged. One can then apply the usual algebraic tools to study differential operators: finding generators of the kernel and image, computing a Hilbert polynomial of these modules, etc.\n  Taking differential operators arising from a distinguished family of derivations, we are able to classify which of them allow such deformations on $Ω$. Finally we give examples of differential operators and the deformations that they induce.",
    "authors": [
      "Ariel Molinuevo"
    ],
    "publication_date": "2015-03-10T18:39:54Z",
    "arxiv_id": "http://arxiv.org/abs/1503.03032v2",
    "download_url": "https://arxiv.org/abs/1503.03032v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An improved Multiplicity Conjecture for codimension three Gorenstein algebras",
    "abstract": "The Multiplicity Conjecture is a deep problem relating the multiplicity (or degree) of a Cohen-Macaulay standard graded algebra with certain extremal graded Betti numbers in its minimal free resolution. In the case of level algebras of codimension three, Zanello has proposed a stronger conjecture. We prove this conjecture for the case of codimension three graded Gorenstein algebras.",
    "authors": [
      "Juan C. Migliore",
      "Uwe Nagel",
      "Fabrizio Zanello"
    ],
    "publication_date": "2006-04-22T10:12:38Z",
    "arxiv_id": "http://arxiv.org/abs/math/0604485v2",
    "download_url": "https://arxiv.org/abs/math/0604485v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The $h$-vector of a relatively compressed level algebra",
    "abstract": "The purpose of this note is to supply an upper and a lower bound (which are in general sharp) for the $h$-vector of a level algebra which is relatively compressed with respect to any arbitrary level algebra $A$. The useful concept of relatively compressed algebra was recently introduced in $[MMN]$ by Migliore {\\it et al.} (whose investigations mainly focused on the particular case of $A$ a complete intersection). The key idea of this note is the simple observation that the level algebras which are relatively compressed with respect to $A$ coincide (after an obvious isomorphism) with the generic level quotients of suitable truncations of $A$. Therefore, we are able to apply to relatively compressed algebras the main result of our recent work $[Za3]$.",
    "authors": [
      "Fabrizio Zanello"
    ],
    "publication_date": "2005-03-24T10:00:36Z",
    "arxiv_id": "http://arxiv.org/abs/math/0503526v2",
    "download_url": "https://arxiv.org/abs/math/0503526v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the vanishing ideal of an algebraic toric set and its parameterized linear codes",
    "abstract": "Let K be a finite field and let X be a subset of a projective space, over the field K, which is parameterized by monomials arising from the edges of a clutter. We show some estimates for the degree-complexity, with respect to the revlex order, of the vanishing ideal I(X) of X. If the clutter is uniform, we classify the complete intersection property of I(X) using linear algebra. We show an upper bound for the minimum distance of certain parameterized linear codes along with certain estimates for the algebraic invariants of I(X).",
    "authors": [
      "Eliseo Sarmiento",
      "Maria Vaz Pinto",
      "Rafael H. Villarreal"
    ],
    "publication_date": "2011-07-21T14:21:44Z",
    "arxiv_id": "http://arxiv.org/abs/1107.4284v2",
    "download_url": "https://arxiv.org/abs/1107.4284v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A new invariant for finite dimensional Leibniz/Lie algebras",
    "abstract": "For an $n$-dimensional Leibniz/Lie algebra $\\mathfrak{h}$ over a field $k$ we introduce a new invariant ${\\mathcal A}(\\mathfrak{h})$, called the \\emph{universal algebra} of $\\mathfrak{h}$, as a quotient of the polynomial algebra $k[X_{ij} \\, | \\, i, j = 1, \\cdots, n]$ through an ideal generated by $n^3$ polynomials. We prove that ${\\mathcal A}(\\mathfrak{h})$ admits a unique bialgebra structure which makes it an initial object among all commutative bialgebras coacting on $\\mathfrak{h}$. The new object ${\\mathcal A} (\\mathfrak{h})$ is the key tool in answering two open problems in Lie algebra theory. First, we prove that the automorphism group ${\\rm Aut}_{Lbz} (\\mathfrak{h})$ of $\\mathfrak{h}$ is isomorphic to the group $U \\bigl( G({\\mathcal A} (\\mathfrak{h})^{\\rm o} ) \\bigl)$ of all invertible group-like elements of the finite dual ${\\mathcal A} (\\mathfrak{h})^{\\rm o}$. Secondly, for an abelian group $G$, we show that there exists a bijection between the set of all $G$-gradings on $\\mathfrak{h}$ and the set of all bialgebra homomorphisms ${\\mathcal A} (\\mathfrak{h}) \\to k[G]$. Based on this, all $G$-gradings on $\\mathfrak{h}$ are explicitly classified and parameterized. ${\\mathcal A} (\\mathfrak{h})$ is also used to prove that there exists a universal commutative Hopf algebra associated to any finite dimensional Leibniz algebra $\\mathfrak{h}$.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2020-06-01T04:36:57Z",
    "arxiv_id": "http://arxiv.org/abs/2006.00711v3",
    "download_url": "https://arxiv.org/abs/2006.00711v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representations of certain non-rational vertex operator algebras of affine type",
    "abstract": "In this paper we study a series of vertex operator algebras of integer level associated to the affine Lie algebra $A_{\\ell}^{(1)}$. These vertex operator algebras are constructed by using the explicit construction of certain singular vectors in the universal affine vertex operator algebra $N(n-2,0)$ at the integer level. In the case $n=1$ or $l=2$, we explicitly determine Zhu's algebras and classify all irreducible modules in the category $\\mathcal{O}$. In the case $l=2$, we show that the vertex operator algebra $N(n-2,0)$ contains two linearly independent singular vectors of the same conformal weight.",
    "authors": [
      "Drazen Adamovic",
      "Ozren Perse"
    ],
    "publication_date": "2007-02-01T11:07:31Z",
    "arxiv_id": "http://arxiv.org/abs/math/0702018v2",
    "download_url": "https://arxiv.org/abs/math/0702018v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Center and representations of infinitesimal Hecke algebras of sl_2",
    "abstract": "In this paper, we compute the center of the infinitesimal Hecke algebras Hz associated to sl_2 ; then using nontriviality of the center, we study representations of these algebras in the framework of the BGG category O. We also discuss central elements in infinitesimal Hecke algebras over gl(n) and sp(2n) for all n. We end by proving an analogue of the theorem of Duflo for Hz.",
    "authors": [
      "Akaki Tikaradze",
      "Apoorva Khare"
    ],
    "publication_date": "2008-07-30T03:43:41Z",
    "arxiv_id": "http://arxiv.org/abs/0807.4776v2",
    "download_url": "https://arxiv.org/abs/0807.4776v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ancestor ideals of vector spaces of forms, and level algebras",
    "abstract": "Let R be the polynomial ring in r variables over a field k, with maximal ideal M and let V denote a vector subspace of the space of degree-j homogeneous elements of R. We study three related algebras determined by V. The first is the ``ancestor algebra'' whose defining ideal is the largest graded ideal whose intersection with M^j is the ideal (V).\n  The second is the ``level algebra'', whose defining ideal L(V) is the largest graded ideal of R such that the degree-j component is V; and third is the algebra R/(V).\n  When r=2, we determine the possible Hilbert functions H for each of these algebras, and as well the dimension of each Hilbert function stratum. We characterize the graded Betti numbers of these algebras in terms of certain partitions depending only on H, and give the codimension of each stratum in terms of invariants of the partitions. When r=2 and k is algebraically closed the Hilbert function strata for each of the three algebras satisfy a frontier property that the closure of a stratum is the union of more special strata. The family G(H) of all graded quotients of R having the given Hilbert function is a natural desingularization of this closure.",
    "authors": [
      "Anthony Iarrobino"
    ],
    "publication_date": "2003-07-21T15:41:34Z",
    "arxiv_id": "http://arxiv.org/abs/math/0307281v1",
    "download_url": "https://arxiv.org/abs/math/0307281v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nichols-Woronowicz algebra model for Schubert calculus on Coxeter groups",
    "abstract": "We realise the cohomology ring of a flag manifold, more generally the coinvariant algebra of an arbitrary finite Coxeter group W, as a commutative subalgebra of a certain Nichols algebra in the Yetter-Drinfeld category over W. This gives a braided Hopf algebra version of the corresponding Schubert calculus. Our proof is based on methods of braided differential calculus rather than on working directly with the relations in the Nichols algebra, which are not known explicitly. We also discuss the relationship between Fomin-Kirillov quadratic algebras, Kirillov-Maeno bracket algebras and our construction.",
    "authors": [
      "Yuri Bazlov"
    ],
    "publication_date": "2004-09-13T19:33:47Z",
    "arxiv_id": "http://arxiv.org/abs/math/0409206v2",
    "download_url": "https://arxiv.org/abs/math/0409206v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Level algebras of type 2",
    "abstract": "In this paper we study standard graded artinian level algebras, in particular those whose socle-vector has type 2. Our main results are: the characterization of the level $h$-vectors of the form $(1,r,...,r,2)$ for $r\\leq 4$; the characterization of the minimal free resolutions associated to each of the $h$-vectors above when $r=3$; a sharp upper-bound (under certain mild hypotheses) for the level $h$-vectors $(1,r,...,a,2)$ of arbitrary codimension $r$ and type 2, which depends on the next to last entry $a$.",
    "authors": [
      "Fabrizio Zanello"
    ],
    "publication_date": "2004-11-10T14:51:03Z",
    "arxiv_id": "http://arxiv.org/abs/math/0411228v2",
    "download_url": "https://arxiv.org/abs/math/0411228v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Remarks on Cyclotomic and Degenerate Cyclotomic BMW Algebras",
    "abstract": "We relate the structure of cyclotomic and degenerate cyclotomic BMW algebras, for arbitrary parameter values, to that for admissible parameter values. In particular, we show that these algebras are cellular. We characterize those parameter sets for affine BMW algebras over an algebraically closed field that permit the algebras to have non--trivial cyclotomic quotients.",
    "authors": [
      "Frederick M. Goodman"
    ],
    "publication_date": "2010-11-15T03:42:43Z",
    "arxiv_id": "http://arxiv.org/abs/1011.3284v3",
    "download_url": "https://arxiv.org/abs/1011.3284v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebra retracts and Stanley-Reisner rings",
    "abstract": "In a paper from 2002, Bruns and Gubeladze conjectured that graded algebra retracts of polytopal algebras over a field $k$ are again polytopal algebras. Motivated by this conjecture, we prove that graded algebra retracts of Stanley-Reisner rings over a field $k$ are again Stanley-Reisner rings. Extending this result further, we give partial evidence for a conjecture saying that monomial quotients of standard graded polynomial rings over $k$ descend along graded algebra retracts.",
    "authors": [
      "Neil Epstein",
      "Hop D. Nguyen"
    ],
    "publication_date": "2013-01-17T02:16:27Z",
    "arxiv_id": "http://arxiv.org/abs/1301.3967v2",
    "download_url": "https://arxiv.org/abs/1301.3967v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient generation of ideals in a discrete Hodge algebra",
    "abstract": "Let $R$ be a commutative Noetherian ring and $D$ be a discrete Hodge algebra over $R$ of dimension $d>\\text{dim}(R)$. Then we show that\n  (i) the top Euler class group $E^d(D)$ of $D$ is trivial.\n  (ii) if $d>\\text{dim}(R)+1$, then $(d-1)$-st Euler class group $E^{d-1}(D)$ of $D$ is trivial.",
    "authors": [
      "Manoj K. Keshari",
      "Md. Ali Zinna"
    ],
    "publication_date": "2016-11-08T10:39:33Z",
    "arxiv_id": "http://arxiv.org/abs/1611.02468v1",
    "download_url": "https://arxiv.org/abs/1611.02468v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classifying coalgebra split extensions of Hopf algebras",
    "abstract": "For a given Hopf algebra $A$ we classify all Hopf algebras $E$ that are coalgebra split extensions of $A$ by $H_4$, where $H_4$ is the Sweedler's 4-dimensional Hopf algebra. Equivalently, we classify all crossed products of Hopf algebras $A # H_4$ by computing explicitly two classifying objects: the cohomological 'group' ${\\mathcal H}^{2} (H_4, A)$ and $\\textsc{C}\\textsc{r}\\textsc{p} (H_4, A) :=$ the set of types of isomorphisms of all crossed products $A # H_4$. All crossed products $A #H_4$ are described by generators and relations and classified: they are parameterized by the set ${\\mathcal Z}{\\mathcal P} (A)$ of all central primitive elements of $A$. Several examples are worked out in detail: in particular, over a field of characteristic $p \\geq 3$ an infinite family of non-isomorphic Hopf algebras of dimension $4p$ is constructed. The groups of automorphisms of these Hopf algebras are also described.",
    "authors": [
      "A. L. Agore",
      "C. G. Bontea",
      "G. Militaru"
    ],
    "publication_date": "2012-07-02T14:44:04Z",
    "arxiv_id": "http://arxiv.org/abs/1207.0411v4",
    "download_url": "https://arxiv.org/abs/1207.0411v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algebraic curves for commuting elements in the q-deformed Heisenberg algebra",
    "abstract": "In this paper we extend the eliminant construction of Burchnall and Chaundy for commuting differential operators in the Heisenberg algebra to the q-deformed Heisenberg algebra and show that it again provides annihilating curves for commuting elements, provided q satisfies a natural condition. As a side result we obtain estimates on the dimensions of the eigenspaces of elements of this algebra in its faithful module of Laurent series.",
    "authors": [
      "Marcel de Jeu",
      "Christian Svensson",
      "Sergei Silvestrov"
    ],
    "publication_date": "2007-10-15T09:13:20Z",
    "arxiv_id": "http://arxiv.org/abs/0710.2748v2",
    "download_url": "https://arxiv.org/abs/0710.2748v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The t-Analogs of q-Characters at Roots of Unity for Quantum Affine Algebras and Beyound",
    "abstract": "The q-characters were introduced by Frenkel and mReshetikhin to study finite dimensional representations of the untwisted quantum affine algebra for q generic. The $ε$-characters at roots of unity were constructed by Frenkel and Mukhin to study finite dimensional representations of various specializations of the quantum affine algebra at $q^s=1$. In the finite simply laced case Nakajima defined deformations of q-characters called q,t-characters, for q generic and also at roots of unity. The definition is combinatorial but the proof of the existence uses the geometric theory of quiver varieties which holds only in the simply laced case. In math.QA/0212257 we proposed an algebraic general (non necessarily simply laced) new approach to q,t-characters for q generic. In this paper we treat the root of unity case. Moreover we construct q-characters and q,t-characters for a large class of generalized Cartan matrices (including finite and affine cases except $A_1^{(1)}$, $A_2^{(2)}$) by extending our algebraic approach. In particular we generalize the construction of Nakajima's Kazhdan-Lusztig polynomials at roots of unity to those cases. We also study properties of various objects used in this article : deformed screening operators at roots of unity, t-deformed polynomial algebras, bicharacters arising from symmetrizable Cartan matrices, deformation of the Frenkel-Mukhin's algorithm.",
    "authors": [
      "David Hernandez"
    ],
    "publication_date": "2003-05-26T16:02:39Z",
    "arxiv_id": "http://arxiv.org/abs/math/0305366v5",
    "download_url": "https://arxiv.org/abs/math/0305366v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symbolic Rees algebras, vertex covers and irreducible representations of Rees cones",
    "abstract": "Let G be a simple graph and let J be its ideal of vertex covers. We give a graph theoretical description of the irreducible b-vertex covers of G, i.e., we describe the minimal generators of the symbolic Rees algebra of J. Then we study the irreducible b-vertex covers of the blocker of G, i.e., we study the minimal generators of the symbolic Rees algebra of the edge ideal of G. We give a graph theoretical description of the irreducible binary b-vertex covers of the blocker of G. It is shown that they correspond to irreducible induced subgraphs of G. As a byproduct we obtain a method, using Hilbert bases, to obtain all irreducible induced subgraphs of G. In particular we obtain all odd holes and antiholes. We study irreducible graphs and give a method to construct irreducible b-vertex covers of the blocker of G with high degree relative to the number of vertices of G.",
    "authors": [
      "Luis A. Dupont",
      "Rafael H. Villarreal"
    ],
    "publication_date": "2007-12-08T00:46:08Z",
    "arxiv_id": "http://arxiv.org/abs/0712.1249v3",
    "download_url": "https://arxiv.org/abs/0712.1249v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Capable Lie algebras with the derived subalgebra of dimension two over an arbitrary field",
    "abstract": "In this paper, we classify all capable nilpotent Lie algebras with the derived subalgebra of dimension 2 over an arbitrary field. Moreover, the explicit structure of such Lie algebras of class 3 is given.",
    "authors": [
      "Peyman Niroomand",
      "Farangis Johari",
      "Mohsen Parvizi"
    ],
    "publication_date": "2017-12-05T09:40:39Z",
    "arxiv_id": "http://arxiv.org/abs/1712.01542v2",
    "download_url": "https://arxiv.org/abs/1712.01542v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On integral forms for vertex algebras associated with affine Lie algebras and lattices",
    "abstract": "We revisit the construction of integral forms for vertex (operator) algebras $V_L$ based on even lattices $L$ using generators instead of bases, and we construct integral forms for $V_L$-modules. We construct integral forms for vertex (operator) algebras based on highest-weight modules for affine Lie algebras and we exhibit natural generating sets. For vertex operator algebras in general, we give conditions showing when an integral form contains the standard conformal vector generating the Virasoro algebra. Finally, we study integral forms in contragredients of modules for vertex algebras.",
    "authors": [
      "Robert McRae"
    ],
    "publication_date": "2014-01-11T06:17:47Z",
    "arxiv_id": "http://arxiv.org/abs/1401.2505v2",
    "download_url": "https://arxiv.org/abs/1401.2505v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite dimensional Hopf actions on algebraic quantizations",
    "abstract": "Let k be an algebraically closed field of characteristic zero. In joint work with J. Cuadra [arxiv.org/abs/1409.1644, arxiv.org/abs/1509.01165], we showed that a semisimple Hopf action on a Weyl algebra over a polynomial algebra k[z_1,...,z_s] factors through a group action, and this in fact holds for any finite dimensional Hopf action if s=0. We also generalized these results to finite dimensional Hopf actions on algebras of differential operators. In this work we establish similar results for Hopf actions on other algebraic quantizations of commutative domains. This includes universal enveloping algebras of finite dimensional Lie algebras, spherical symplectic reflection algebras, quantum Hamiltonian reductions of Weyl algebras (in particular, quantized quiver varieties), finite W-algebras and their central reductions, quantum polynomial algebras, twisted homogeneous coordinate rings of abelian varieties, and Sklyanin algebras. The generalization in the last three cases uses a result from algebraic number theory, due to A. Perucca.",
    "authors": [
      "Pavel Etingof",
      "Chelsea Walton"
    ],
    "publication_date": "2016-05-02T16:45:48Z",
    "arxiv_id": "http://arxiv.org/abs/1605.00560v3",
    "download_url": "https://arxiv.org/abs/1605.00560v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pointed Hopf actions on quantum generalized Weyl algebras",
    "abstract": "We study actions of pointed Hopf algebras in the $\\ZZ$-graded setting. Our main result classifies inner-faithful actions of generalized Taft algebras on quantum generalized Weyl algebras which respect the $\\ZZ$-grading. We also show that generically the invariant rings of Taft actions on quantum generalized Weyl algebras are commutative Kleinian singularities.",
    "authors": [
      "Jason Gaddis",
      "Robert Won"
    ],
    "publication_date": "2021-01-30T21:48:14Z",
    "arxiv_id": "http://arxiv.org/abs/2102.00320v2",
    "download_url": "https://arxiv.org/abs/2102.00320v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "BiHom-Novikov algebras and infinitesimal BiHom-bialgebras",
    "abstract": "We introduce and study infinitesimal BiHom-bialgebras, BiHom-Novikov algebras, BiHom-Novikov-Poisson algebras, and find some relations among these concepts. Our main result is to show how to obtain a left BiHom-pre-Lie algebra from an infinitesimal BiHom-bialgebra",
    "authors": [
      "Ling Liu",
      "Abdenacer Makhlouf",
      "Claudia Menini",
      "Florin Panaite"
    ],
    "publication_date": "2019-03-18T18:17:11Z",
    "arxiv_id": "http://arxiv.org/abs/1903.08145v2",
    "download_url": "https://arxiv.org/abs/1903.08145v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New Large-Rank Nichols Algebras Over Nonabelian Groups With Commutator Subgroup Z_2",
    "abstract": "In this article, we explicitly construct new finite-dimensional, link-indecomposable Nichols algebras with Dynkin diagrams of type An,Cn,Dn,E6,E7,E8,F4 over any group G with commutator subgroup isomorphic to Z_2.The construction is generic in the sense that the type just depends on the rank and center of G, and thus positively answers for all groups of this class a question raised by Susan Montgomory in 1995 [Mont95][AS02].\n  Our construction uses the new notion of a covering Nichols algebra as a special case of a covering Hopf algebra [Len12] and produces non-faithful Nichols algebras. However, we give faithful examples of Doi twists for type A3,C3,D4,F4 over several nonabelian groups of order 16 and 32. These are hence the first known examples of faithful, finite-dimensional, link-indecomposable Nichols algebras of rank >2 over nonabelian groups.",
    "authors": [
      "Simon D. Lentner"
    ],
    "publication_date": "2013-06-24T17:26:45Z",
    "arxiv_id": "http://arxiv.org/abs/1306.5684v3",
    "download_url": "https://arxiv.org/abs/1306.5684v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The trigonometric Casimir connection of a simple Lie algebra",
    "abstract": "Let g be a complex, semisimple Lie algebra, G the corresponding simply-connected Lie group and H a maximal torus in G. We construct a flat connection on H with logarithmic singularities on the root hypertori and values in the Yangian Y(g) of g. By analogy with the rational Casimir connection of g, we conjecture that the monodromy of this trigonometric connection is described by the quantum Weyl group operators of the quantum loop algebra U_h(Lg).",
    "authors": [
      "Valerio Toledano-Laredo"
    ],
    "publication_date": "2010-03-10T03:29:08Z",
    "arxiv_id": "http://arxiv.org/abs/1003.2017v2",
    "download_url": "https://arxiv.org/abs/1003.2017v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symmetric Decomposition of the Associated Graded Algebra of an Artinian Gorenstein Algebra",
    "abstract": "We study the symmetric subquotient decomposition of the associated graded algebras $A^*$ of a non-homogeneous commutative Artinian Gorenstein (AG) algebra $A$. This decomposition arises from the stratification of $A^*$ by a sequence of ideals $A^*=C_A(0)\\supset C_A(1)\\supset\\cdots$ whose successive quotients $Q(a)=C(a)/C(a+1)$ are reflexive $A^*$ modules. These were introduced by the first author, and have been used more recently by several groups, especially those interested in short Gorenstein algebras, and in the scheme length (cactus rank) of forms.\n  For us a Gorenstein sequence is an integer sequence $H$ occurring as the Hilbert function for an AG algebra $A$, that is not necessarily homogeneous. Such a Hilbert function $H(A)$ is the sum of symmetric non-negative sequences $H_A(a)=H(Q_A(a))$, each having center of symmetry $(j-a)/2$ where $j$ is the socle degree of $A$: we call these the symmetry conditions, and the decomposition $\\mathcal{D}(A)=(H_A(0),H_A(1),\\ldots)$ the symmetric decomposition of $H(A)$.\n  We here study which sequences may occur as the summands $H_A(a)$: in particular we construct in a systematic way examples of AG algebras $A$ for which $H_A(a)$ can have interior zeroes, as $H_A(a)=(0,s,0,\\ldots,0,s,0)$. We also study the symmetric decomposition sets $\\mathcal{D}(A)$, and in particular determine which sequences $H_A(a)$ can be non-zero when the dual generator is linear in a subset of the variables.\n  Several groups have studied \"exotic summands\" of the Macaulay dual generator $F$. Studying these, we recall a normal form for the Macaulay dual generator of an AG algebra that has no \"exotic\" summands. We apply this to Gorenstein algebras that are connected sums.\n  We give throughout many examples and counterexamples, and conclude with some open questions about symmetric decomposition.",
    "authors": [
      "Anthony Iarrobino",
      "Pedro Macias Marques"
    ],
    "publication_date": "2018-12-10T00:52:44Z",
    "arxiv_id": "http://arxiv.org/abs/1812.03586v4",
    "download_url": "https://arxiv.org/abs/1812.03586v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twisted dendriform algebras and the pre-Lie Magnus expansion",
    "abstract": "In this paper an application of the recently introduced pre-Lie Magnus expansion to Jackson's q-integral and q-exponentials is presented. Twisted dendriform algebras, which are the natural algebraic framework for Jackson's q-analogues, are introduced for that purpose. It is shown how the pre-Lie Magnus expansion is used to solve linear q-differential equations. We also briefly outline the theory of linear equations in twisted dendriform algebras.",
    "authors": [
      "Kurusch Ebrahimi-Fard",
      "Dominique Manchon"
    ],
    "publication_date": "2009-10-12T14:17:41Z",
    "arxiv_id": "http://arxiv.org/abs/0910.2166v3",
    "download_url": "https://arxiv.org/abs/0910.2166v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Clifford algebra-parametrized octonions and generalizations",
    "abstract": "Introducing products between multivectors of Cl(0,7) and octonions, resulting in an octonion, and leading to the non-associative standard octonionic product in a particular case, we generalize the octonionic X-product, associated with the transformation rules for bosonic and fermionic fields on the tangent bundle over the 7-sphere, and the XY-product. We also present the formalism necessary to construct Clifford algebra-parametrized octonions. Finally we introduce a method to construct generalized octonionic algebras, where their octonionic units are parametrized by arbitrary Clifford multivectors. The products between Clifford multivectors and octonions, leading to an octonion, are shown to share graded-associative, supersymmetric properties. We also investigate the generalization of Moufang identities, for each one of the products introduced. The X-product equals twice the parallelizing torsion, given by the torsion tensor, and is used to investigate the S7 Kac-Moody algebra. The X-product has also been used to obtain triality maps and G2 actions, and it leads naturally to remarkable geometric and topological properties, for instance the Hopf fibrations and twistor formalism in ten dimensions. The paramount importance of octonions in the search for unification is based, for instance, in the fact that by extending the division-algebra-valued superalgebras to octonions, in D=11 an octonionic generalized Poincare superalgebra can be constructed, the so-called octonionic M-algebra that describes the octonionic M-theory where the octonionic super-2-brane and the octonionic super-5-brane sectors are shown to be equivalent. Also, there are other vast generalizations and applications of the octonionic formalism such as the classification of quaternionic and octonionic spinors and the pseudo-octonionic formalism.",
    "authors": [
      "Roldao da Rocha",
      "Jayme Vaz,"
    ],
    "publication_date": "2006-03-21T21:33:08Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0603053v1",
    "download_url": "https://arxiv.org/abs/math-ph/0603053v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tensor product of filtered $A_\\infty$-algebras",
    "abstract": "We define the tensor product of filtered $A_\\infty$-algebras. establish some of its properties and give a partial description of the space of bounding cochains in the tensor product. Furthermore we show that in the case of classical $A_\\infty$-algebras our definition recovers the one given by Markl and Shnider. We also give a criterion that implies that a given $A_\\infty$-algebra is quasi-isomorphic to the tensor product of two subalgebras. This will be used in a sequel to prove a Künneth Theorem for the Fukaya algebra of a product of Lagrangian submanifolds.",
    "authors": [
      "Lino Amorim"
    ],
    "publication_date": "2014-04-28T22:07:47Z",
    "arxiv_id": "http://arxiv.org/abs/1404.7184v2",
    "download_url": "https://arxiv.org/abs/1404.7184v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Wedderburn principal theorem in conformal algebras",
    "abstract": "We investigate an analogue of the Wedderburn principal theorem for associative conformal algebras with finite faithful representations. It is shown that the radical splitting property for an algebra of this kind holds if the maximal semisimple factor of this algebra is unital, but does not hold in general.",
    "authors": [
      "Pavel Kolesnikov"
    ],
    "publication_date": "2005-08-05T02:56:07Z",
    "arxiv_id": "http://arxiv.org/abs/math/0508105v2",
    "download_url": "https://arxiv.org/abs/math/0508105v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantized symplectic oscillator algebras of rank one",
    "abstract": "A quantized symplectic oscillator algebra of rank 1 is a PBW deformation of the smash product of the quantum plane with U_q(sl_2). We study its representation theory, and in particular, its category O.",
    "authors": [
      "Wee Liang Gan",
      "Nicolas Guay",
      "Apoorva Khare"
    ],
    "publication_date": "2004-05-10T20:24:20Z",
    "arxiv_id": "http://arxiv.org/abs/math/0405176v4",
    "download_url": "https://arxiv.org/abs/math/0405176v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coalgebra Extensions and Algebra Coextensions of Galois Type",
    "abstract": "The notion of a coalgebra-Galois extension is defined as a natural generalisation of a Hopf-Galois extension. It is shown that any coalgebra-Galois extension induces a unique entwining map $ψ$ compatible with the right coaction. For the dual notion of an algebra-Galois coextension it is also proven that there always exists a unique entwining structure compatible with the right action.",
    "authors": [
      "Tomasz Brzezinski",
      "Piotr M. Hajac"
    ],
    "publication_date": "1997-08-09T11:41:50Z",
    "arxiv_id": "http://arxiv.org/abs/q-alg/9708010v2",
    "download_url": "https://arxiv.org/abs/q-alg/9708010v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nichols algebras over groups with finite root system of rank two III",
    "abstract": "We compute the finite-dimensional Nichols algebras over the sum of two simple Yetter-Drinfeld modules V and W over non-abelian quotients of a certain central extension of the dihedral group of eight elements or SL(2,3), and such that the Weyl groupoid of the pair (V,W) is finite. These central extensions appear in the classification of non-elementary finite-dimensional Nichols algebras with finite Weyl groupoid of rank two. We deduce new information on the structure of primitive elements of finite-dimensional Nichols algebras over groups.",
    "authors": [
      "I. Heckenberger",
      "L. Vendramin"
    ],
    "publication_date": "2013-09-18T12:59:53Z",
    "arxiv_id": "http://arxiv.org/abs/1309.4634v2",
    "download_url": "https://arxiv.org/abs/1309.4634v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The isomorphism problem for quantum affine spaces, homogenized quantized Weyl algebras, and quantum matrix algebras",
    "abstract": "Bell and Zhang have shown that if $A$ and $B$ are two connected graded algebras finitely generated in degree one that are isomorphic as ungraded algebras, then they are isomorphic as graded algebras. We exploit this result to solve the isomorphism problem in the cases of quantum affine spaces, quantum matrix algebras, and homogenized multiparameter quantized Weyl algebras. Our result involves determining the degree one normal elements, factoring out, and then repeating. This creates an iterative process that allows one to determine relationships between relative parameters.",
    "authors": [
      "Jason Gaddis"
    ],
    "publication_date": "2016-05-27T16:43:57Z",
    "arxiv_id": "http://arxiv.org/abs/1605.08711v2",
    "download_url": "https://arxiv.org/abs/1605.08711v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On bases of centres of Iwahori-Hecke algebras of the symmetric group",
    "abstract": "Using norms, the second author constructed a basis for the centre of the Hecke algebra of the symmetric group over $\\Q[ξ]$ in 1990. An integral \"minimal\" basis was later given by the first author in 1999, following work of Geck and Rouquier. In principle one can then write elements of the norm basis as integral linear combinations of minimal basis elements.\n  In this paper we find an explicit non-recursive expression for the coefficients appearing in these linear combinations. These coefficients are expressed in terms of readily computable numbers involving orders of symmetric groups and conjugacy classes.\n  In the process of establishing this main theorem, we prove the following items of independent interest: a result on the projection of the norms onto parabolic subalgebras, the existence of an inner product on the Hecke algebra with some interesting properties, and the existence of a partial ordering on the norms.",
    "authors": [
      "Andrew Francis",
      "Lenny Jones"
    ],
    "publication_date": "2004-01-05T20:42:20Z",
    "arxiv_id": "http://arxiv.org/abs/math/0401036v3",
    "download_url": "https://arxiv.org/abs/math/0401036v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The weak Lefschetz property of Gorenstein algebras of codimension three associated to the Apéry sets",
    "abstract": "It has been conjectured that {\\it all} graded Artinian Gorenstein algebras of codimension three have the weak Lefschetz property over a field of characteristic zero. In this paper, we study the weak Lefschetz property of associated graded algebras $A$ of the Apéry set of $M$-pure symmetric numerical semigroups generated by four natural numbers. In 2010, Bryant proved that these algebras are graded Artinian Gorenstein algebras of codimension three. In a recent article, Guerrieri showed that if $A$ is not a complete intersection, then $A$ is of form $A=R/I$ with $R=K[x,y,z]$ and \\begin{align*} I=(x^a, y^b-x^{b-γ} z^γ, z^c, x^{a-b+γ}y^{b-β}, y^{b-β}z^{c-γ}), \\end{align*} where $ 1\\leq β\\leq b-1,\\; \\max\\{1, b-a+1 \\}\\leq γ\\leq \\min \\{b-1,c-1\\}$ and $a\\geq c\\geq 2$. We prove that $A$ has the weak Lefschetz property in the following cases: (a) $ \\max\\{1,b-a+c-1\\}\\leq β\\leq b-1$ and $γ\\geq \\lfloor\\frac{β-a+b+c-2}{2}\\rfloor$; (b) $ a\\leq 2b-c$ and $| a-b| +c-1\\leq β\\leq b-1$; (c) one of $a,b,c$ is at most five.",
    "authors": [
      "Rosa M. Miró-Roig",
      "Quang Hoa Tran"
    ],
    "publication_date": "2020-07-06T01:02:22Z",
    "arxiv_id": "http://arxiv.org/abs/2007.02485v1",
    "download_url": "https://arxiv.org/abs/2007.02485v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$A_\\infty$-deformations of zigzag algebras via Ginzburg dg algebras",
    "abstract": "This note aims to give a short proof of the recent result due to Etgü-Lekili (2017) and Lekili-Ueda (2021): the zigzag algebra of any finite tree over a field of characteristic 0 is intrinsically formal if and only if the tree is of type ADE. We also complete the proof of this result by considering a field of arbitrary characteristic for type E, which was still open.",
    "authors": [
      "Junyang Liu",
      "Zhengfang Wang"
    ],
    "publication_date": "2023-01-17T08:45:02Z",
    "arxiv_id": "http://arxiv.org/abs/2301.06757v3",
    "download_url": "https://arxiv.org/abs/2301.06757v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representation-reduced stated skein modules and algebras",
    "abstract": "For any marked three manifold $(M,\\mathcal N)$ and any quantum parameter $q^{\\frac{1}{2}}$ (a nonzero complex number), we use $\\mathscr{S}_{q^{1/2}}(M,\\mathcal{N})$ to denote the stated skein module of $(M,\\mathcal{N})$. When $q^{\\frac{1}{2}}$ is a root of unity of odd order, the commutative algebra $\\mathscr{S}_1(M,\\mathcal{N})$ acts on $\\mathscr{S}_{q^{1/2}}(M,\\mathcal{N})$. For any maximal ideal $ρ$ of $\\mathscr{S}_1(M,\\mathcal{N})$, define $\\mathscr{S}_{q^{1/2}}(M,\\mathcal{N})_ρ = \\mathscr{S}_{q^{1/2}}(M,\\mathcal{N})\\otimes _{\\mathscr{S}_1(M,\\mathcal{N})} (\\mathscr{S}_1(M,\\mathcal{N})/ρ)$. We prove the splitting map for $\\mathscr{S}_{q^{1/2}}(M,\\mathcal{N})$ respects the $\\mathscr{S}_1(M,\\mathcal{N})$-module structure, so it reduces to the splitting map for $\\mathscr{S}_{q^{1/2}}(M,\\mathcal{N})_ρ$. We prove the splitting map for $\\mathscr{S}_{q^{1/2}}(M,\\mathcal{N})_ρ$ is injective if there exists at least one component of $\\mathcal{N}$ such that this component and the boundary of the splitting disk belong to the same component of $\\partial M$. We also prove the representation-reduced stated skein module of the marked handlebody is an irreducible Azumaya representation of the stated skein algebra of its boundary. Let $M$ be an oriented connected closed three manifold. For any positive integer $k$, we use $M_{k}$ to denote the marked three manifold obtained from $M$ by removing $k$ open three dimensional balls and adding one marking to each newly created sphere boundary component. We prove $\\text{dim}_{\\mathbb{C}}\\mathscr{S}_{q^{1/2}}( M_{k})_ρ = 1$ for any maximal ideal $ρ$ of $\\mathscr{S}_1(M_k)$.",
    "authors": [
      "Zhihao Wang"
    ],
    "publication_date": "2023-12-21T21:57:13Z",
    "arxiv_id": "http://arxiv.org/abs/2312.14316v2",
    "download_url": "https://arxiv.org/abs/2312.14316v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Weak Lefschetz Property for Artinian Gorenstein algebras of codimension three",
    "abstract": "We study the problem of whether an arbitrary codimension three graded artinian Gorenstein algebra has the Weak Lefschetz Property. We reduce this problem to checking whether it holds for all compressed Gorenstein algebras of odd socle degree. In the first open case, namely Hilbert function (1,3,6,6,3,1), we give a complete answer in every characteristic by translating the problem to one of studying geometric aspects of certain morphisms from $\\mathbb P^2$ to $\\mathbb P^3$, and Hesse configurations in $\\mathbb P^2$.",
    "authors": [
      "Mats Boij",
      "Juan Migliore",
      "Rosa M. Miro'-Roig",
      "Uwe Nagel",
      "Fabrizio Zanello"
    ],
    "publication_date": "2013-02-22T23:56:40Z",
    "arxiv_id": "http://arxiv.org/abs/1302.5742v2",
    "download_url": "https://arxiv.org/abs/1302.5742v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Category $\\mathcal{O}$ over triangular Generalized Weyl Algebras",
    "abstract": "We analyze the BGG Category $\\mathcal{O}$ over a large class of generalized Weyl algebras (henceforth termed GWAs). Given such a \"triangular\" GWA for which Category $\\mathcal{O}$ decomposes into a direct sum of subcategories, we study in detail the homological properties of blocks with finitely many simples. As consequences, we show that the endomorphism algebra of a projective generator of such a block is quasi-hereditary, finite-dimensional, and graded Koszul. We also classify all tilting modules in the block, as well as all submodules of all projective and tilting modules. Finally, we present a novel connection between blocks of triangular GWAs and Young tableaux, which provides a combinatorial interpretation of morphisms and extensions between objects of the block.",
    "authors": [
      "Apoorva Khare",
      "Akaki Tikaradze"
    ],
    "publication_date": "2015-07-21T16:21:16Z",
    "arxiv_id": "http://arxiv.org/abs/1507.05894v2",
    "download_url": "https://arxiv.org/abs/1507.05894v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hopf Algebras and Edge-Labeled Posets",
    "abstract": "Given a finite graded poset with labeled Hasse diagram, we construct a quasi- symmetric generating function for (saturated) chains whose labels have fixed descents. This is a common generalization of a generating function for the flag f-vector defined by Ehrenborg and of a symmetric function associated to certain edge-labeled posets which arose in the theory of Schubert polynomials. We show this construction gives a Hopf morphism from an incidence algebra of edge-labeled posets to the Hopf algebra of quasi-symmetric functions.",
    "authors": [
      "Nantel Bergeron",
      "Frank Sottile"
    ],
    "publication_date": "1997-12-17T14:34:11Z",
    "arxiv_id": "http://arxiv.org/abs/math/9712256v2",
    "download_url": "https://arxiv.org/abs/math/9712256v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A categorical interpretation of Morita equivalence for dynamical von Neumann algebras",
    "abstract": "$\\DeclareMathOperator{\\G}{\\mathbb{G}}\\DeclareMathOperator{\\Rep}{Rep} \\DeclareMathOperator{\\Corr}{Corr}$Let $\\G$ be a locally compact quantum group and $(M, α)$ a $\\G$-$W^*$-algebra. The object of study of this paper is the $W^*$-category $\\Rep^{\\G}(M)$ of normal, unital $\\G$-representations of $M$ on Hilbert spaces endowed with a unitary $\\G$-representation. This category has a right action of the category $\\Rep(\\G)= \\Rep^{\\G}(\\mathbb{C})$ for which it becomes a right $\\Rep(\\G)$-module $W^*$-category. Given another $\\G$-$W^*$-algebra $(N, β)$, we denote the category of normal $*$-functors $\\Rep^{\\G}(N)\\to \\Rep^{\\G}(M)$ compatible with the $\\Rep(\\G)$-module structure by $\\operatorname{Fun}_{\\Rep(\\G)}(\\Rep^{\\G}(N), \\Rep^{\\G}(M))$ and we denote the category of $\\G$-$M$-$N$-correspondences by $\\operatorname{Corr}^{\\G}(M,N)$. We prove that there are canonical functors $P: \\Corr^{\\G}(M,N)\\to \\operatorname{Fun}_{\\Rep(\\G)}(\\Rep^{\\G}(N), \\Rep^{\\G}(M))$ and $Q: \\operatorname{Fun}_{\\Rep(\\G)}(\\Rep^{\\G}(N), \\Rep^{\\G}(M))\\to \\operatorname{Corr}^{\\G}(M,N)$ such that $Q \\circ P\\cong \\operatorname{id}.$ We use these functors to show that the $\\G$-dynamical von Neumann algebras $(M, α)$ and $(N, β)$ are equivariantly Morita equivalent if and only if $\\Rep^{\\G}(N)$ and $\\Rep^{\\G}(M)$ are equivalent as $\\Rep(\\G)$-module-$W^*$-categories. Specializing to the case where $\\G$ is a compact quantum group, we prove that moreover $P\\circ Q \\cong \\operatorname{id}$, so that the categories $\\Corr^{\\G}(M,N)$ and $\\operatorname{Fun}_{\\Rep(\\G)}(\\Rep^{\\G}(N), \\Rep^{\\G}(M))$ are equivalent. This is an equivariant version of the Eilenberg-Watts theorem for actions of compact quantum groups on von Neumann algebras.",
    "authors": [
      "Joeri De Ro"
    ],
    "publication_date": "2024-08-14T17:58:16Z",
    "arxiv_id": "http://arxiv.org/abs/2408.07701v2",
    "download_url": "https://arxiv.org/abs/2408.07701v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Crystal Duality Principle: from Hopf Algebras to Geometrical Symmetries",
    "abstract": "We give functorial recipes to get, out of any Hopf algebra over a field, two pairs of Hopf algebras which have some geometrical content. When the ground field has characteristic zero, the first pair is made by a function algebra over a connected Poisson group and a universal enveloping algebra over a Lie bialgebra. In addition, the Poisson group as a variety is an affine space, and the Lie bialgebra as a Lie algebra is graded. Forgetting these last details, the second pair is of the same type.\n  When the Hopf algebra H we start from is already of geometric type the result involves Poisson duality: the first Lie bialgebra associated to H = F[G] is g^* (with g := Lie(G)), and the first Poisson group H = U(g) is of type G^*, i.e. it has g as cotangent Lie bialgebra.\n  If the ground field has positive characteristic, then the same recipes give similar results, but for the fact that the Poisson groups obtained have dimension 0 and height 1, and restricted universal enveloping algebras are obtained.\n  We show how these \"geometrical\" Hopf algebras are linked to the original one via 1-parameter deformations, and explain how these results follow from quantum group theory. The cases of hyperalgebras and group algebras are examined in some detail (thus recovering some well-known, classical construction), along with some relevant examples.",
    "authors": [
      "Fabio Gavarini"
    ],
    "publication_date": "2003-04-14T08:13:08Z",
    "arxiv_id": "http://arxiv.org/abs/math/0304164v4",
    "download_url": "https://arxiv.org/abs/math/0304164v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Finite-dimensional pointed Hopf algebras over finite simple groups of Lie type I. Non-semisimple classes in PSL(n,q)",
    "abstract": "We show that Nichols algebras of most simple Yetter-Drinfeld modules over the projective special linear group over a finite field, corresponding to non-semisimple orbits, have infinite dimension. We spell out a new criterium to show that a rack collapses.",
    "authors": [
      "Nicolás Andruskiewitsch",
      "Giovanna Carnovale",
      "Gastón Andrés García"
    ],
    "publication_date": "2013-12-21T11:07:45Z",
    "arxiv_id": "http://arxiv.org/abs/1312.6238v2",
    "download_url": "https://arxiv.org/abs/1312.6238v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tensor-closed objects in the BGG category of a quantized semisimple Lie algebra",
    "abstract": "We consider the BGG category $\\mathcal{O}$ of a quantized universal enveloping algebra $U_q(\\mathfrak{g})$. We call a module $M\\in \\mathcal{O}$ tensor-closed if $M\\otimes N\\in\\mathcal{O}$ for any $N\\in \\mathcal{O}$. In this paper we prove that $M\\in \\mathcal{O}$ is tensor-closed if and only if $M$ is finite dimensional. The method used in this paper applies to the unquantized case as well.",
    "authors": [
      "Zhaoting Wei"
    ],
    "publication_date": "2019-10-05T20:19:51Z",
    "arxiv_id": "http://arxiv.org/abs/1910.02326v4",
    "download_url": "https://arxiv.org/abs/1910.02326v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On finite-dimensional copointed Hopf algebras over dihedral groups",
    "abstract": "We classify all finite-dimensional Hopf algebras over an algebraically closed field of characteristic zero such that its coradical is isomorphic to the algebra of functions over a dihedral group D_m, with m=4a> 11. We obtain this classification by means of the lifting method, where we use cohomology theory to determine all possible deformations. Our result provides an infinite family of new examples of finite-dimensional copointed Hopf algebras over dihedral groups.",
    "authors": [
      "Fernando Fantino",
      "Gaston Andres Garcia",
      "Mitja Mastnak"
    ],
    "publication_date": "2016-08-22T13:51:48Z",
    "arxiv_id": "http://arxiv.org/abs/1608.06167v3",
    "download_url": "https://arxiv.org/abs/1608.06167v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Hopf algebras whose coradical is a cocentral abelian cleft extension",
    "abstract": "This paper is a first step toward the full description of a family of Hopf algebras whose coradical is isomorphic to a semisimple Hopf algebra K_{n}, n an odd positive integer, obtained by a cocentral abelian cleft extension. We describe the simple Yetter-Drinfeld modules, compute the fusion rules and determine the finite-dimensional Nichols algebras for some of them. In particular, we give the description of the finite-dimensional Nichols algebras over simple modules over K_{3}. This includes a family of 12-dimensional Nichols algebras $B_ξ$ depending on 3rd roots of unity. Here, $B_{1}$ is isomorphic to the well-known Fomin-Kirillov algebra, and $B_ξ \\simeq B_{ξ^{2}} $ as graded algebras but $B_1$ is not isomorphic to $B_ξ $ as algebra for $ξ\\neq 1$. As a byproduct we obtain new Hopf algebras of dimension 216.",
    "authors": [
      "Gaston Andres Garcia",
      "Mitja Mastnak"
    ],
    "publication_date": "2023-04-05T13:13:35Z",
    "arxiv_id": "http://arxiv.org/abs/2304.02427v2",
    "download_url": "https://arxiv.org/abs/2304.02427v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Monadic cointegrals and applications to quasi-Hopf algebras",
    "abstract": "For $\\mathcal{C}$ a finite tensor category we consider four versions of the central monad, $A_1, \\dots, A_4$ on $\\mathcal{C}$. Two of them are Hopf monads, and for $\\mathcal{C}$ pivotal, so are the remaining two. In that case all $A_i$ are isomorphic as Hopf monads. We define a monadic cointegral for $A_i$ to be an $A_i$-module morphism $\\mathbf{1} \\to A_i(D)$, where $D$ is the distinguished invertible object of $\\mathcal{C}$. We relate monadic cointegrals to the categorical cointegral introduced by Shimizu (2019), and, in case $\\mathcal{C}$ is braided, to an integral for the braided Hopf algebra $\\mathcal{L} = \\int^X X^\\vee \\otimes X$ in $\\mathcal{C}$ studied by Lyubashenko (1995). Our main motivation stems from the application to finite dimensional quasi-Hopf algebras $H$. For the category of finite-dimensional $H$-modules, we relate the four monadic cointegrals (two of which require $H$ to be pivotal) to four existing notions of cointegrals for quasi-Hopf algebras: the usual left/right cointegrals of Hausser and Nill (1994), as well as so-called $γ$-symmetrised cointegrals in the pivotal case, for $γ$ the modulus of $H$. For (not necessarily semisimple) modular tensor categories $\\mathcal{C}$, Lyubashenko gave actions of surface mapping class groups on certain Hom-spaces of $\\mathcal{C}$, in particular of $SL(2,\\mathbb{Z})$ on $\\mathcal{C}(\\mathcal{L},\\mathbf{1})$. In the case of a factorisable ribbon quasi-Hopf algebra, we give a simple expression for the action of $S$ and $T$ which uses the monadic cointegral.",
    "authors": [
      "Johannes Berger",
      "Azat M. Gainutdinov",
      "Ingo Runkel"
    ],
    "publication_date": "2020-03-30T09:57:04Z",
    "arxiv_id": "http://arxiv.org/abs/2003.13307v2",
    "download_url": "https://arxiv.org/abs/2003.13307v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genetic Volterra algebras and their derivations",
    "abstract": "The present paper is devoted to genetic Volterra algebras. We first study characters of such algebras. We fully describe associative genetic Volterra algebras, in this case all derivations are trivial. In general setting, i.e. when the algebra is not associative, we provide a sufficient condition to get trivial derivation on generic Volterra algebras. Furthermore, we describe all derivations of three dimensional generic Volterra algebras, which allowed us to prove that any local derivation is a derivation of the algebra.",
    "authors": [
      "Rasul Ganikhodzhaev",
      "Farrukh Mukhamedov",
      "Abror Pirnapasov",
      "Izzat Qaralleh"
    ],
    "publication_date": "2017-06-06T09:18:32Z",
    "arxiv_id": "http://arxiv.org/abs/1706.01667v1",
    "download_url": "https://arxiv.org/abs/1706.01667v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$\\imath$quantum groups of split type via derived Hall algebras",
    "abstract": "A quantum symmetric pair consists of a quantum group $\\mathbf U$ and its coideal subalgebra ${\\mathbf U}^{\\imath}_{\\boldsymbolς}$ (called an $\\imath$quantum group) with parameters ${\\boldsymbolς}$. In this note, we use the derived Hall algebras of 1-periodic complexes to realize the $\\imath$quantum groups ${\\mathbf U}^{\\imath}_{\\boldsymbolς}$ of split type.",
    "authors": [
      "Jiayi Chen",
      "Ming Lu",
      "Shiquan Ruan"
    ],
    "publication_date": "2021-11-18T02:19:02Z",
    "arxiv_id": "http://arxiv.org/abs/2111.09479v2",
    "download_url": "https://arxiv.org/abs/2111.09479v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Realizations of Affine Lie Algebra A_^(1) at Negative Levels",
    "abstract": "A realization of the affine Lie algebra ${A^{(1)}_1}$ and the relevant $Z$-algebra at negative level $-k$ is given in terms of parafermions. This generalizes the recent work on realization of the affine Lie algebra at the critical level.",
    "authors": [
      "Jilan Dong",
      "Naihuan Jing"
    ],
    "publication_date": "2014-05-02T03:16:55Z",
    "arxiv_id": "http://arxiv.org/abs/1405.0339v1",
    "download_url": "https://arxiv.org/abs/1405.0339v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Images of Locally Finite Derivations of Polynomial Algebras in Two Variables",
    "abstract": "In this paper we show that the image of any locally finite $k$-derivation of the polynomial algebra $k[x, y]$ in two variables over a field $k$ of characteristic zero is a Mathieu subspace. We also show that the two-dimensional Jacobian conjecture is equivalent to the statement that the image $Im D$ of every $k$-derivation $D$ of $k[x, y]$ such that $1\\in Im D$ and $div D=0$ is a Mathieu subspace of $k[x, y]$.",
    "authors": [
      "Arno van den Essen",
      "David Wright",
      "Wenhua Zhao"
    ],
    "publication_date": "2010-04-04T17:20:53Z",
    "arxiv_id": "http://arxiv.org/abs/1004.0521v2",
    "download_url": "https://arxiv.org/abs/1004.0521v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Hopf Algebras over quantum subgroups",
    "abstract": "Using the standard filtration associated with a generalized lifting method, we determine all finite-dimensional Hopf algebras over an algebraically closed field of characteristic zero whose coradical generates a Hopf subalgebra isomorphic to the smallest non-pointed non-cosemisimple Hopf algebra ${\\mathcal{K}}$ and the corresponding infinitesimal module is an indecomposable object in ${}^{\\mathcal{K}}_{\\mathcal{K}}\\mathcal{YD}$ (we assume that the diagrams are Nichols algebras). As a byproduct, we obtain new Nichols algebras of dimension 8 and new Hopf algebras of dimension 64.",
    "authors": [
      "Gaston Andres Garcia",
      "Joao Matheus Jury Giraldi"
    ],
    "publication_date": "2016-05-12T21:47:48Z",
    "arxiv_id": "http://arxiv.org/abs/1605.03995v3",
    "download_url": "https://arxiv.org/abs/1605.03995v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Lie algebroid over algebraic spaces",
    "abstract": "We consider Lie algebroids over algebraic spaces (in short we call it as $a$-spaces) by considering the sheaf of Lie-Rinehart algebras. We discuss about properties of universal enveloping algebroid $\\mathscr{U}(\\mathcal{O}_X,\\mathcal{L})$ of a Lie algebroid $\\mathcal{L}$ over an $a$-space $(X, \\mathcal{O}_X)$. This is done by sheafification of the presheaf of universal enveloping algebras for Lie-Rinehart algebras. We review the extent to which structure of the universal enveloping algebroid of Lie algebroids (over special $a$-spaces) resembles a sheaf of bialgebras. In the sequel we present a version of Poincaré-Birkhoff-Witt theorem and Cartier-Milnor-Moore theorem for the Lie algebroid.",
    "authors": [
      "Ashis Mandal",
      "Abhishek Sarkar"
    ],
    "publication_date": "2021-07-25T02:44:20Z",
    "arxiv_id": "http://arxiv.org/abs/2107.11714v4",
    "download_url": "https://arxiv.org/abs/2107.11714v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A commutative algebra approach to multiplicative Hom-Lie algebras",
    "abstract": "Let $\\mathfrak{g}$ be a finite-dimensional complex Lie algebra and $\\textrm{HLie}_{m}(\\mathfrak{g})$ be the affine variety of all multiplicative Hom-Lie algebras on $\\mathfrak{g}$. We use a method of computational ideal theory to describe $\\textrm{HLie}_{m}(\\mathfrak{gl}_{n}(\\mathbb{C}))$, showing that $\\textrm{HLie}_{m}(\\mathfrak{gl}_{2}(\\mathbb{C}))$ consists of two 1-dimensional and one 3-dimensional irreducible components, and showing that $\\textrm{HLie}_{m}(\\mathfrak{gl}_{n}(\\mathbb{C}))=\\{\\textrm{diag}\\{δ,\\dots,δ,a\\}\\mid δ=1\\textrm{ or }0,a\\in\\mathbb{C}\\}$ for $n\\geqslant 3$. We construct a new family of multiplicative Hom-Lie algebras on the Heisenberg Lie algebra $\\mathfrak{h}_{2n+1}(\\mathbb{C})$ and characterize the affine varieties $\\textrm{HLie}_{m}(\\mathfrak{u}_{2}(\\mathbb{C}))$ and $\\textrm{HLie}_{m}(\\mathfrak{u}_{3}(\\mathbb{C}))$. We also study the derivation algebra $\\textrm{Der}_{D}(\\mathfrak{g})$ of a multiplicative Hom-Lie algebra $D$ on $\\mathfrak{g}$ and under some hypotheses on $D$, we prove that the Hilbert series $\\mathcal{H}(\\textrm{Der}_{D}(\\mathfrak{g}),t)$ is a rational function.",
    "authors": [
      "Yin Chen",
      "Runxuan Zhang"
    ],
    "publication_date": "2019-07-04T14:14:08Z",
    "arxiv_id": "http://arxiv.org/abs/1907.02415v4",
    "download_url": "https://arxiv.org/abs/1907.02415v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classifying bicrossed products of two Taft algebras",
    "abstract": "We classify all Hopf algebras which factorize through two Taft algebras $\\mathbb{T}_{n^{2}}(\\bar{q})$ and respectively $T_{m^{2}}(q)$. To start with, all possible matched pairs between the two Taft algebras are described: if $\\bar{q} \\neq q^{n-1}$ then the matched pairs are in bijection with the group of $d$-th roots of unity in $k$, where $d = (m,\\,n)$ while if $\\bar{q} = q^{n-1}$ then besides the matched pairs above we obtain an additional family of matched pairs indexed by $k^{*}$. The corresponding bicrossed products (double cross product in Majid's terminology) are explicitly described by generators and relations and classified. As a consequence of our approach, we are able to compute the number of isomorphism types of these bicrossed products as well as to describe their automorphism groups.",
    "authors": [
      "A. L. Agore"
    ],
    "publication_date": "2016-03-06T18:37:11Z",
    "arxiv_id": "http://arxiv.org/abs/1603.01854v3",
    "download_url": "https://arxiv.org/abs/1603.01854v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cyclic tridiagonal pairs, higher order Onsager algebras and orthogonal polynomials",
    "abstract": "The concept of cyclic tridiagonal pairs is introduced, and explicit examples are given. For a fairly general class of cyclic tridiagonal pairs with cyclicity N, we associate a pair of `divided polynomials'. The properties of this pair generalize the ones of tridiagonal pairs of Racah type. The algebra generated by the pair of divided polynomials is identified as a higher-order generalization of the Onsager algebra. It can be viewed as a subalgebra of the q-Onsager algebra for a proper specialization at q the primitive 2Nth root of unity. Orthogonal polynomials beyond the Leonard duality are revisited in light of this framework. In particular, certain second-order Dunkl shift operators provide a realization of the divided polynomials at N=2 or q=i.",
    "authors": [
      "P. Baseilhac",
      "A. M. Gainutdinov",
      "T. T. Vu"
    ],
    "publication_date": "2016-07-03T07:32:35Z",
    "arxiv_id": "http://arxiv.org/abs/1607.00606v3",
    "download_url": "https://arxiv.org/abs/1607.00606v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symplectic fermions and a quasi-Hopf algebra structure on $\\bar{U}_i sl(2)$",
    "abstract": "We consider the (finite-dimensional) small quantum group $\\bar{U}_q sl(2)$ at $q=i$. We show that $\\bar{U}_i sl(2)$ does not allow for an R-matrix, even though $U \\otimes V \\cong V \\otimes U$ holds for all finite-dimensional representations $U,V$ of $\\bar{U}_i sl(2)$. We then give an explicit coassociator $Φ$ and an R-matrix $R$ such that $\\bar{U}_i sl(2)$ becomes a quasi-triangular quasi-Hopf algebra.\n  Our construction is motivated by the two-dimensional chiral conformal field theory of symplectic fermions with central charge $c=-2$. There, a braided monoidal category, $\\mathcal{SF}$, has been computed from the factorisation and monodromy properties of conformal blocks, and we prove that $\\mathrm{Rep}\\,(\\bar{U}_i sl(2),Φ,R)$ is braided monoidally equivalent to $\\mathcal{SF}$.",
    "authors": [
      "A. M. Gainutdinov",
      "I. Runkel"
    ],
    "publication_date": "2015-03-26T11:44:41Z",
    "arxiv_id": "http://arxiv.org/abs/1503.07695v2",
    "download_url": "https://arxiv.org/abs/1503.07695v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The weights of simple modules in Category $\\mathscr{O}$ for Kac-Moody algebras",
    "abstract": "We give the first positive formulas for the weights of every simple highest weight module $L(λ)$ over an arbitrary Kac-Moody algebra. Under a mild condition on the highest weight, we also express the weights of $L(λ)$ as an alternating sum similar to the Weyl-Kac character formula.\n  To obtain these results, we show the following data attached to a highest weight module are equivalent: (i) its integrability, (ii) the convex hull of its weights, (iii) the Weyl group symmetry of its character, and (iv) when a localization theorem is available, its behavior on certain codimension one Schubert cells. We further determine precisely when the above datum determines the weights themselves. Moreover, we use condition (iv) to relate localizations of the convex hull of the weights with the introduction of poles of the corresponding $D$-module on certain divisors, which answers a question of Brion.\n  Many of these results are new even in finite type. We prove similar assertions for highest weight modules over a symmetrizable quantum group.",
    "authors": [
      "Gurbir Dhillon",
      "Apoorva Khare"
    ],
    "publication_date": "2016-06-30T19:54:05Z",
    "arxiv_id": "http://arxiv.org/abs/1606.09640v5",
    "download_url": "https://arxiv.org/abs/1606.09640v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Braces to Hecke algebras & Quantum Groups",
    "abstract": "We examine links between the theory of braces and set theoretical solutions of the Yang-Baxter equation, and fundamental concepts from the theory of quantum integrable systems. More precisely, we make connections with Hecke algebras and we identify new quantum groups associated to set-theoretic solutions coming from braces. We also construct a novel class of quantum discrete integrable systems and we derive symmetries for the corresponding periodic transfer matrices.",
    "authors": [
      "Anastasia Doikou",
      "Agata Smoktunowicz"
    ],
    "publication_date": "2019-12-06T12:51:49Z",
    "arxiv_id": "http://arxiv.org/abs/1912.03091v3",
    "download_url": "https://arxiv.org/abs/1912.03091v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Skew group algebras of path algebras and preprojective algebras",
    "abstract": "We compute explicitly up to Morita-equivalence the skew group algebra of a finite group acting on the path algebra of a quiver and the skew group algebra of a finite group acting on a preprojective algebra. These results generalize previous results of Reiten and Riedtmann for a cyclic group acting on the path algebra of a quiver and of Reiten and Van den Bergh for a finite subgroup of $\\SL(\\C X \\oplus \\C Y)$ acting on $\\C[X, Y]$.",
    "authors": [
      "Laurent Demonet"
    ],
    "publication_date": "2009-02-09T09:49:05Z",
    "arxiv_id": "http://arxiv.org/abs/0902.1390v2",
    "download_url": "https://arxiv.org/abs/0902.1390v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Free Subalgebras of Graded Algebras",
    "abstract": "Let $k$ be a field and let $A=\\bigoplus_{n\\ge 1}A_n$ be a positively graded $k$-algebra. We recall that $A$ is graded nilpotent if for every $d\\ge 1$, the subalgebra of $A$ generated by elements of degree $d$ is nilpotent. We give a method of producing grading nilpotent algebras and use this to prove that over any base field $k$ there exists a finitely generated graded nilpotent algebra that contains a free $k$-subalgebra on two generators.",
    "authors": [
      "Jason P. Bell",
      "Be'eri Greenfeld"
    ],
    "publication_date": "2016-05-31T11:28:38Z",
    "arxiv_id": "http://arxiv.org/abs/1605.09585v2",
    "download_url": "https://arxiv.org/abs/1605.09585v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The irreducible weak modules for the fixed point subalgebra of the vertex algebra associated to a non-degenerate even lattice by an automorphism of order $2$ (Part $1$)",
    "abstract": "Let $V_{L}$ be the vertex algebra associated to a non-degenerate even lattice $L$, $θ$ the automorphism of $V_{L}$ induced from the $-1$-isometry of $L$, and $V_{L}^{+}$ the fixed point subalgebra of $V_{L}$ under the action of $θ$. In this series of papers, we classify the irreducible weak $V_{L}^{+}$-modules and show that any irreducible weak $V_{L}^{+}$-module is isomorphic to a weak submodule of some irreducible weak $V_{L}$-module or to a submodule of some irreducible $θ$-twisted $V_{L}$-module.\n  In this paper (Part 1), we show that when the rank of $L$ is $1$, every non-zero weak $V_{L}^{+}$-module contains a non-zero $M(1)^{+}$-module, where $M(1)^{+}$ is the fixed point subalgebra of the Heisenberg vertex operator algebra $M(1)$ under the action of $θ$.",
    "authors": [
      "Kenichiro Tanabe"
    ],
    "publication_date": "2021-02-23T06:11:44Z",
    "arxiv_id": "http://arxiv.org/abs/2102.11515v1",
    "download_url": "https://arxiv.org/abs/2102.11515v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simplicial complexes and minimal free resolution of monomial algebras",
    "abstract": "This paper is concerned with the combinatorial description of the graded minimal free resolution of certain monomial algebras which includes toric rings. Concretely, we explicitly describe how the graded minimal free resolution of those algebras is related to the combinatorics of some simplicial complexes. Our description may be interpreted as an algorithmic procedure to partially compute this resolution.",
    "authors": [
      "Ignacio Ojeda",
      "A. Vigneron-Tenorio"
    ],
    "publication_date": "2008-10-27T15:22:47Z",
    "arxiv_id": "http://arxiv.org/abs/0810.4836v3",
    "download_url": "https://arxiv.org/abs/0810.4836v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The centre of generic algebras of small PI algebras",
    "abstract": "Verbally prime algebras are important in PI theory. They are well known over a field $K$ of characteristic zero: 0 and $K<T>$ (the trivial ones), $M_n(K)$, $M_n(E)$, $M_{ab}(E)$. Here $K<T>$ is the free associative algebra with free generators $T$, $E$ is the infinite dimensional Grassmann algebra over $K$, $M_n(K)$ and $M_n(E)$ are the $n\\times n$ matrices over $K$ and over $E$, respectively. Moreover $M_{ab}(E)$ are certain subalgebras of $M_{a+b}(E)$, defined below. The generic algebras of these algebras have been studied extensively. Procesi gave a very tight description of the generic algebra of $M_n(K)$. The situation is rather unclear for the remaining nontrivial verbally prime algebras.\n  In this paper we study the centre of the generic algebra of $M_{11}(E)$ in two generators. We prove that this centre is a direct sum of the field and a nilpotent ideal (of the generic algebra). We describe the centre of this algebra. As a corollary we obtain that this centre contains nonscalar elements thus we answer a question posed by Berele.",
    "authors": [
      "Thiago Castilho de Mello",
      "Plamen Koshlukov"
    ],
    "publication_date": "2012-08-07T01:33:16Z",
    "arxiv_id": "http://arxiv.org/abs/1208.1317v2",
    "download_url": "https://arxiv.org/abs/1208.1317v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tridiagonal pairs and the q-tetrahedron algebra",
    "abstract": "In this paper we further develop the connection between tridiagonal pairs and the q-tetrahedron algebra $\\boxtimes_q$. Let V denote a finite dimensional vector space over an algebraically closed field and let A, A^* denote a tridiagonal pair on V. For $0 \\leq i \\leq d$ let $θ_i$ (resp. $θ^*_i$) denote a standard ordering of the eigenvalues of A (resp. A^*). Fix a nonzero scalar q which is not a root of unity. T. Ito and P. Terwilliger have shown that when $θ_i = q^{2i-d}$ and $θ^*_i = q^{d-2i}$ there exists an irreducible $\\boxtimes_q$-module structure on V such that the $\\boxtimes_q$ generators x_{01}, x_{23} act as A, A^* respectively. In this paper we examine the case in which there exists a nonzero scalar c in K such that $θ_i = q^{2i-d}$ and $θ^*_i = q^{2i-d} + c q^{d-2i}$. In this case we associate to A,A^* a polynomial P and prove the following equivalence. The following are equivalent: (i) There exists a $\\boxtimes_q$-module structure on V such that x_{01} acts as A and x_{30} + cx_{23} acts as A^*, where x_{01}, x_{30}, x_{23} are standard generators for $\\boxtimes_q$. (ii) P(q^{2d-2} (q-q^{-1})^{-2}) \\neq 0. Suppose (i),(ii) hold. Then the $\\boxtimes_q$-module structure on V is unique and irreducible.",
    "authors": [
      "Darren Funk-Neubauer"
    ],
    "publication_date": "2008-06-05T16:55:01Z",
    "arxiv_id": "http://arxiv.org/abs/0806.0901v3",
    "download_url": "https://arxiv.org/abs/0806.0901v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Left Regular Bands of Groups and the Mantaci--Reutenauer algebra",
    "abstract": "We develop the idempotent theory for algebras over a class of semigroups called left regular bands of groups (LRBGs), which simultaneously generalize group algebras of finite groups and left regular band (LRB) algebras. Our techniques weave together the representation theory of finite groups and LRBs, opening the door for a systematic study of LRBGs in an analogous way to LRBs. We apply our results to construct complete systems of primitive orthogonal idempotents in the Mantaci--Reutenauer algebra ${\\sf{MR}}_n[G]$ associated to any finite group $G$. When $G$ is abelian, we give closed form expressions for these idempotents, and when $G$ is the cyclic group of order two, we prove that these recover idempotents introduced by Vazirani.",
    "authors": [
      "Jose Bastidas",
      "Sarah Brauner",
      "Franco Saliola"
    ],
    "publication_date": "2023-06-26T18:11:48Z",
    "arxiv_id": "http://arxiv.org/abs/2306.14985v2",
    "download_url": "https://arxiv.org/abs/2306.14985v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bidiagonal pairs, the Lie algebra sl_2, and the quantum group U_q(sl_2)",
    "abstract": "We introduce a linear algebraic object called a bidiagonal pair. Roughly speaking, a bidiagonal pair is a pair of diagonalizable linear transformations on a finite-dimensional vector space, each of which acts in a bidiagonal fashion on the eigenspaces of the other. We associate to each bidiagonal pair a sequence of scalars called a parameter array. Using this concept of a parameter array we present a classification of bidiagonal pairs up to isomorphism. The statement of this classification does not explicitly mention the Lie algebra $\\SL$ or the quantum group $\\uq$. However, its proof makes use of the finite-dimensional representation theory of $\\SL$ and $\\uq$. In addition to the classification we make explicit the relationship between bidiagonal pairs and modules for $\\SL$ and $\\uq$.",
    "authors": [
      "Darren Funk-Neubauer"
    ],
    "publication_date": "2011-08-04T20:55:25Z",
    "arxiv_id": "http://arxiv.org/abs/1108.1219v2",
    "download_url": "https://arxiv.org/abs/1108.1219v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twisted and folded Auslander-Reiten quivers and applications to the representation theory of quantum affine algebras",
    "abstract": "In this paper, we introduce twisted and folded AR-quivers of type $A_{2n+1}$, $D_{n+1}$, $E_6$ and $D_4$ associated to (triply) twisted Coxeter elements. Using the quivers of type $A_{2n+1}$ and $D_{n+1}$, we describe the denominator formulas and Dorey's rule for quantum affine algebras $U'_q(B^{(1)}_{n+1})$ and $U'_q(C^{(1)}_{n})$, which are important information of representation theory of quantum affine algebras. More precisely, we can read the denominator formulas for $U'_q(B^{(1)}_{n+1})$ (resp. $U'_q(C^{(1)}_{n})$) using certain statistics on any folded AR-quiver of type $A_{2n+1}$ (resp. $D_{n+1}$) and Dorey's rule for $U'_q(B^{(1)}_{n+1})$ (resp. $U'_q(C^{(1)}_{n})$) applying the notion of minimal pairs in a twisted AR-quiver. By adopting the same arguments, we propose the conjectural denominator formulas and Dorey's rule for $U'_q(F^{(1)}_{4})$ and $U'_q(G^{(1)}_{2})$.",
    "authors": [
      "Se-jin Oh",
      "Uhi Rinn Suh"
    ],
    "publication_date": "2020-11-06T22:00:30Z",
    "arxiv_id": "http://arxiv.org/abs/2011.03611v1",
    "download_url": "https://arxiv.org/abs/2011.03611v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Free integro-differential algebras and Gröbner-Shirshov bases",
    "abstract": "The notion of commutative integro-differential algebra was introduced for the algebraic study of boundary problems for linear ordinary differential equations. Its noncommutative analog achieves a similar purpose for linear systems of such equations. In both cases, free objects are crucial for analyzing the underlying algebraic structures, e.g. of the (matrix) functions. In this paper we apply the method of Gröbner-Shirshov bases to construct the free (noncommutative) integro-differential algebra on a set. The construction is from the free Rota-Baxter algebra on the free differential algebra on the set modulo the differential Rota-Baxter ideal generated by the noncommutative integration by parts formula. In order to obtain a canonical basis for this quotient, we first reduce to the case when the set is finite. Then in order to obtain the monomial order needed for the Composition-Diamond Lemma, we consider the free Rota-Baxter algebra on the truncated free differential algebra. A Composition-Diamond Lemma is proved in this context, and a Gröbner-Shirshov basis is found for the corresponding differential Rota-Baxter ideal.",
    "authors": [
      "Xing Gao",
      "Li Guo",
      "Markus Rosenkranz"
    ],
    "publication_date": "2014-02-08T21:04:00Z",
    "arxiv_id": "http://arxiv.org/abs/1402.1890v4",
    "download_url": "https://arxiv.org/abs/1402.1890v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Groebner---Shirshov bases for replicated algebras",
    "abstract": "We establish a universal approach to solution of the word problem in the varieties of di- and tri-algebras. This approach, for example, allows to apply Groebner---Shirshov bases method for Lie algebras to solve the ideal membership problem in free Leibniz algebras (Lie di-algebras). As another application, we prove an analogue of the Poincare---Birkhoff---Witt Theorem for universal enveloping associative tri-algebra of a Lie tri-algebra (CTD^!-algebra).",
    "authors": [
      "Pavel Kolesnikov"
    ],
    "publication_date": "2017-06-26T05:16:00Z",
    "arxiv_id": "http://arxiv.org/abs/1706.08235v1",
    "download_url": "https://arxiv.org/abs/1706.08235v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Commutative post-Lie algebra structures on Kac--Moody algebras",
    "abstract": "We determine commutative post-Lie algebra structures on some infinite-dimensional Lie algebras. We show that all commutative post-Lie algebra structures on loop algebras are trivial. This extends the results for finite-dimensional perfect Lie algebras. Furthermore we show that all commutative post-Lie algebra structures on affine Kac--Moody Lie algebras are \"almost trivial\".",
    "authors": [
      "Dietrich Burde",
      "Pasha Zusmanovich"
    ],
    "publication_date": "2018-05-11T08:04:44Z",
    "arxiv_id": "http://arxiv.org/abs/1805.04267v2",
    "download_url": "https://arxiv.org/abs/1805.04267v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extension algebras of standard modules",
    "abstract": "Let $A$ be a finite dimensional $k$-algebra standardly stratified for a partial order $\\leqslant$ and $Δ$ be the direct sum of all standard modules. In this paper we study the extension algebra $E= \\text{Ext}_A^{\\ast} (Δ, Δ)$ of standard modules, characterize the stratification property of $E$ for $\\leqslant$ and $\\leqslant ^{op}$, and obtain a sufficient condition for $E$ to be a generalized Koszul algebra (in a sense which we define).",
    "authors": [
      "Liping Li"
    ],
    "publication_date": "2011-10-29T05:42:42Z",
    "arxiv_id": "http://arxiv.org/abs/1110.6502v3",
    "download_url": "https://arxiv.org/abs/1110.6502v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gradings on associative algebras with involution and real forms of classical simple Lie algebras",
    "abstract": "We study gradings by abelian groups on associative algebras with involution over an arbitrary field. Of particular importance are the fine gradings (that is, those that do not admit a proper refinement), because any grading on a finite-dimensional algebra can be obtained from them via a group homomorphism (although not in a unique way). We classify up to equivalence the fine gradings on simple associative algebras with involution over the field of real numbers (or any real closed field) and, as a consequence, on the real forms of classical simple Lie algebras.",
    "authors": [
      "Alberto Elduque",
      "Mikhail Kochetov",
      "Adrián Rodrigo-Escudero"
    ],
    "publication_date": "2021-05-28T08:26:25Z",
    "arxiv_id": "http://arxiv.org/abs/2105.13666v3",
    "download_url": "https://arxiv.org/abs/2105.13666v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Category O for the Schrödinger algebra",
    "abstract": "We study category O for the (centrally extended) Schrödinger algebra. We determine the quivers for all blocks and relations for blocks of nonzero central charge. We also describe the quiver and relations for the finite dimensional part of O. We use this to determine the center of the universal enveloping algebra and annihilators of Verma modules. Finally, we classify primitive ideals with nonzero central charge.",
    "authors": [
      "Brendan Dubsky",
      "Rencai Lü",
      "Volodymyr Mazorchuk",
      "Kaiming Zhao"
    ],
    "publication_date": "2014-02-03T10:31:19Z",
    "arxiv_id": "http://arxiv.org/abs/1402.0334v2",
    "download_url": "https://arxiv.org/abs/1402.0334v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Derivations, Automorphisms, and Representations of Complex $ω$-Lie Algebras",
    "abstract": "Let $(\\mathfrak{g},ω)$ be a finite-dimensional non-Lie complex $ω$-Lie algebra. We study the derivation algebra $Der(\\mathfrak{g})$ and the automorphism group $Aut(\\mathfrak{g})$ of $(\\mathfrak{g},ω)$. We introduce the notions of $ω$-derivations and $ω$-automorphisms of $(\\mathfrak{g},ω)$ which naturally preserve the bilinear form $ω$. We show that the set $Der_ω(\\mathfrak{g})$ of all $ω$-derivations is a Lie subalgebra of $Der(\\mathfrak{g})$ and the set $Aut_ω(\\mathfrak{g})$ of all $ω$-automorphisms is a subgroup of $Aut(\\mathfrak{g})$. For any 3-dimensional and 4-dimensional nontrivial $ω$-Lie algebra $\\mathfrak{g}$, we compute $Der(\\mathfrak{g})$ and $Aut(\\mathfrak{g})$ explicitly, and study some Lie group properties of $Aut(\\mathfrak{g})$. We also study representation theory of $ω$-Lie algebras. We show that all 3-dimensional nontrivial $ω$-Lie algebras are multiplicative, as well as we provide a 4-dimensional example of $ω$-Lie algebra that is not multiplicative. Finally, we show that any irreducible representation of the simple $ω$-Lie algebra $C_α(α\\neq 0,-1)$ is 1-dimensional.",
    "authors": [
      "Yin Chen",
      "Ziping Zhang",
      "Runxuan Zhang",
      "Rushu Zhuang"
    ],
    "publication_date": "2017-04-26T10:21:39Z",
    "arxiv_id": "http://arxiv.org/abs/1704.08042v1",
    "download_url": "https://arxiv.org/abs/1704.08042v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On a type of commutative algebras",
    "abstract": "We introduce some basic concepts for Jacobi-Jordan algebras such as: representations, crossed products or Frobenius/metabelian/co-flag objects. A new family of solutions for the quantum Yang-Baxter equation is constructed arising from any $3$-step nilpotent Jacobi-Jordan algebra. Crossed products are used to construct the classifying object for the extension problem in its global form. For a given Jacobi-Jordan algebra $A$ and a given vector space $V$ of dimension $\\mathfrak{c}$, a global non-abelian cohomological object ${\\mathbb G} {\\mathbb H}^{2} \\, (A, \\, V)$ is constructed: it classifies, from the view point of the extension problem, all Jacobi-Jordan algebras that have a surjective algebra map on $A$ with kernel of dimension $\\mathfrak{c}$. The object ${\\mathbb G} {\\mathbb H}^{2} \\, (A, \\, k)$ responsible for the classification of co-flag algebras is computed, all $1 + {\\rm dim} (A)$ dimensional Jacobi-Jordan algebras that have an algebra surjective map on $A$ are classified and the automorphism groups of these algebras is determined. Several examples involving special sets of matrices and symmetric bilinear forms as well as equivalence relations between them (generalizing the isometry relation) are provided.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2015-07-29T13:54:52Z",
    "arxiv_id": "http://arxiv.org/abs/1507.08146v1",
    "download_url": "https://arxiv.org/abs/1507.08146v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Raising/lowering maps and modules for the quantum affine algebra $U_q(sl_2hat)$",
    "abstract": "Let V denote a finite dimensional vector space over an algebraically closed field. Let U_0, U_1,..., U_d denote a sequence of nonzero subspaces whose direct sum is V. Let R:V \\to V and L:V \\to V denote linear maps with the following properties: for 0 \\leq i \\leq d, R U_i \\subseteq U_{i+1} and L U_i \\subseteq U_{i-1} where U_{-1}=0, U_{d+1}=0; for 0 \\leq i \\leq d/2, the restrictions R^{d-2i}: U_i \\to U_{d-i} and L^{d-2i}: U_{d-i} \\to U_i are bijections; the maps R and L satisfy the cubic q-Serre relations where q is nonzero and not a root of unity. Let K:V \\to V be the linear map such that (K-q^{2i-d}I)U_i=0 for 0 \\leq i \\leq d. We show that there exists a unique U_q(sl_2hat)-module structure on V such that each of R-e^{-}_1, L-e^{-}_0, K-K_0, and K^{-1}-K_1 vanish on V, where e^{-}_1, e^{-}_0, K_0, K_1 are Chevalley generators for U_q(sl_2hat). We determine which U_q(sl_2hat)-modules arise from our construction.",
    "authors": [
      "Darren Funk-Neubauer"
    ],
    "publication_date": "2005-06-30T18:15:12Z",
    "arxiv_id": "http://arxiv.org/abs/math/0506629v2",
    "download_url": "https://arxiv.org/abs/math/0506629v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Category O over a deformation of the symplectic oscillator algebra",
    "abstract": "We discuss the representation theory of $H_f$, which is a deformation of the symplectic oscillator algebra $sp(2n) \\ltimes h_n$, where $h_n$ is the ((2n+1)-dimensional) Heisenberg algebra. We first look at a more general setup, involving an algebra with a triangular decomposition. Assuming the PBW theorem, and one other hypothesis, we show that the BGG category $\\mathcal{O}$ is abelian, finite length, and self-dual.\n  We decompose $\\mathcal{O}$ as a direct sum of blocks $\\calo(\\la)$, and show that each block is a highest weight category.\n  In the second part, we focus on the case $H_f$ for $n=1$, where we prove all these assumptions, as well as the PBW theorem.",
    "authors": [
      "Apoorva Khare"
    ],
    "publication_date": "2003-09-15T21:29:04Z",
    "arxiv_id": "http://arxiv.org/abs/math/0309251v3",
    "download_url": "https://arxiv.org/abs/math/0309251v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nahm Algebras",
    "abstract": "Given a Lie algebra $\\frak{g}$, the \\emph{Nahm algebra} of $\\frak{g}$ is the vector space $\\frak{g}\\times \\frak{g}\\times \\frak{g}$ with the natural commutative, nonassociative algebra structure associated with the Nahm equations $\\dot{x} = [y,z]$, $\\dot{y} = [z,x]$, $\\dot{z} = [x,y]$. Motivated by potential application to the study of these equations, we herein initiate the study of Nahm algebras.",
    "authors": [
      "Michael K. Kinyon",
      "Arthur A. Sagle"
    ],
    "publication_date": "1999-07-13T15:31:26Z",
    "arxiv_id": "http://arxiv.org/abs/math/9907084v1",
    "download_url": "https://arxiv.org/abs/math/9907084v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Induced quadratic modules in $*$-algebras",
    "abstract": "Positivity in $\\ast$-algebras can be defined either algebraically, by quadratic modules, or analytically, by $\\ast$-representations. By the induction procedure for $\\ast$-representations we can lift the analytical notion of positivity from a $\\ast$-subalgebra to the entire $\\ast$-algebra. The aim of this paper is to define and study the induction procedure for quadratic modules. The main question is when a given quadratic module on the $\\ast$-algebra is induced from its intersection with the $\\ast$-subalgebra. This question is very hard even for the smallest quadratic module (i.e. the set of all sums of hermitian squares) and will be answered only in very special cases.",
    "authors": [
      "Jaka Cimpric",
      "Yurii Savchuk"
    ],
    "publication_date": "2012-01-06T09:01:54Z",
    "arxiv_id": "http://arxiv.org/abs/1201.1374v3",
    "download_url": "https://arxiv.org/abs/1201.1374v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "${\\mathcal O}$-operators of Loday algebras and analogues of the classical Yang-Baxter equation",
    "abstract": "We introduce notions of ${\\mathcal O}$-operators of the Loday algebras including the dendriform algebras and quadri-algebras as a natural generalization of Rota-Baxter operators. The invertible $\\mathcal O$-operators give a sufficient and necessary condition on the existence of the $2^{n+1}$ operations on an algebra with the $2^{n}$ operations in an associative cluster. The analogues of the classical Yang-Baxter equation in these algebras can be understood as the $\\mathcal O$-operators associated to certain dual bimodules. As a byproduct, the constraint conditions (invariances) of nondegenerate bilinear forms on these algebras are given.",
    "authors": [
      "Chengming Bai"
    ],
    "publication_date": "2009-09-21T14:21:48Z",
    "arxiv_id": "http://arxiv.org/abs/0909.3740v1",
    "download_url": "https://arxiv.org/abs/0909.3740v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quadratic automaton algebras and intermediate growth",
    "abstract": "We present an example of a quadratic algebra given by three generators and three relations, which is automaton (the set of normal words forms a regular language) and such that its ideal of relations does not possess a finite Gröbner basis with respect to any choice of generators and any choice of a well-ordering of monomials compatible with multiplication. This answers a question of Ufnarovski.\n  Another result is a simple example (4 generators and 7 relations) of a quadratic algebra of intermediate growth.",
    "authors": [
      "Natalia Iyudu",
      "Stanislav Shkarin"
    ],
    "publication_date": "2017-05-28T17:58:31Z",
    "arxiv_id": "http://arxiv.org/abs/1705.09972v2",
    "download_url": "https://arxiv.org/abs/1705.09972v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Itô's theorem and metabelian Leibniz algebras",
    "abstract": "We prove that the celebrated Itô's theorem for groups remains valid at the level of Leibniz algebras: if $\\mathfrak{g}$ is a Leibniz algebra such that $\\mathfrak{g} = A + B$, for two abelian subalgebras $A$ and $B$, then $\\mathfrak{g}$ is metabelian, i.e. $[ \\, [\\mathfrak{g}, \\, \\mathfrak{g}], \\, [ \\mathfrak{g}, \\, \\mathfrak{g} ] \\, ] = 0$. A structure type theorem for metabelian Leibniz/Lie algebras is proved. All metabelian Leibniz algebras having the derived algebra of dimension $1$ are described, classified and their automorphisms groups are explicitly determined as subgroups of a semidirect product of groups $P^* \\ltimes \\bigl(k^* \\times {\\rm Aut}_{k} (P) \\bigl)$ associated to any vector space $P$.",
    "authors": [
      "A. L. Agore",
      "G. Militaru"
    ],
    "publication_date": "2014-01-19T14:52:18Z",
    "arxiv_id": "http://arxiv.org/abs/1401.4675v3",
    "download_url": "https://arxiv.org/abs/1401.4675v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hom-Lie 2-algebras",
    "abstract": "In this paper, we introduce the notions of hom-Lie 2-algebras, which is the categorification of hom-Lie algebras, $HL_\\infty$-algebras, which is the hom-analogue of $L_\\infty$-algebras, and crossed modules of hom-Lie algebras. We prove that the category of hom-Lie 2-algebras and the category of 2-term $HL_\\infty$-algebras are equivalent. We give a detailed study on skeletal hom-Lie 2-algebras. In particular, we construct the hom-analogues of the string Lie 2-algebras associated to any semisimple involutive hom-Lie algebras. We also proved that there is a one-to-one correspondence between strict hom-Lie 2-algebras and crossed modules of hom-Lie algebras. We give the construction of strict hom-Lie 2-algebras from hom-left-symmetric algebras and symplectic hom-Lie algebras.",
    "authors": [
      "Yunhe Sheng",
      "Danhua Chen"
    ],
    "publication_date": "2011-10-15T11:51:15Z",
    "arxiv_id": "http://arxiv.org/abs/1110.3405v3",
    "download_url": "https://arxiv.org/abs/1110.3405v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]