[
  {
    "title": "A Development Calculus for Specifications",
    "abstract": "A first order inference system, called R-calculus, is defined to develop the specifications. It is used to eliminate the laws which is not consistent with the user's requirements. The R-calculus consists of the structural rules, an axiom, a cut rule, and the rules for logical connectives. Some examples are given to demonstrate the usage of the R-calculus. The properties about reachability and completeness of the R-calculus are formally defined and are proved.",
    "authors": [
      "Wei Li"
    ],
    "publication_date": "2003-03-21T08:23:33Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0303021v2",
    "download_url": "https://arxiv.org/abs/cs/0303021v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Countdown $μ$-calculus",
    "abstract": "We introduce the countdown $μ$-calculus, an extension of the modal $μ$-calculus with ordinal approximations of fixpoint operators. In addition to properties definable in the classical calculus, it can express (un)boundedness properties such as the existence of arbitrarily long sequences of specific actions. The standard correspondence with parity games and automata extends to suitably defined countdown games and automata. However, unlike in the classical setting, the scalar fragment is provably weaker than the full vectorial calculus and corresponds to automata satisfying a simple syntactic condition. We establish some facts, in particular decidability of the model checking problem and strictness of the hierarchy induced by the maximal allowed nesting of our new operators.",
    "authors": [
      "Jędrzej Kołodziejski",
      "Bartek Klin"
    ],
    "publication_date": "2022-07-31T22:47:44Z",
    "arxiv_id": "http://arxiv.org/abs/2208.00536v1",
    "download_url": "https://arxiv.org/abs/2208.00536v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A sequent calculus for the Tamari order",
    "abstract": "We introduce a sequent calculus with a simple restriction of Lambek's product rules that precisely captures the classical Tamari order, i.e., the partial order on fully-bracketed words (equivalently, binary trees) induced by a semi-associative law (equivalently, tree rotation). We establish a focusing property for this sequent calculus (a strengthening of cut-elimination), which yields the following coherence theorem: every valid entailment in the Tamari order has exactly one focused derivation. One combinatorial application of this coherence theorem is a new proof of the Tutte-Chapoton formula for the number of intervals in the Tamari lattice $Y_n$. We also apply the sequent calculus and the coherence theorem to build a surprising bijection between intervals of the Tamari order and a certain fragment of lambda calculus, consisting of the $β$-normal planar lambda terms with no closed proper subterms.",
    "authors": [
      "Noam Zeilberger"
    ],
    "publication_date": "2017-01-11T10:31:04Z",
    "arxiv_id": "http://arxiv.org/abs/1701.02917v1",
    "download_url": "https://arxiv.org/abs/1701.02917v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Network Calculus with Localized Application of Martingales",
    "abstract": "Stochastic Network Calculus is a probabilistic method to compute performance bounds in networks, such as end-to-end delays. It relies on the analysis of stochastic processes using formalism of (Deterministic) Network Calculus. However, unlike the deterministic theory, the computed bounds are usually very loose compared to the simulation. This is mainly due to the intensive use of the Boole's inequality. On the other hand, analyses based on martingales can achieve tight bounds, but until now, they have not been applied to sequences of servers. In this paper, we improve the accuracy of Stochastic Network Calculus by combining this martingale analysis with a recent Stochastic Network Calculus results based on the Pay-Multiplexing-Only-Once property, well-known from the Deterministic Network calculus. We exhibit a non-trivial class of networks that can benefit from this analysis and compare our bounds with simulation.",
    "authors": [
      "Anne Bouillard"
    ],
    "publication_date": "2022-11-10T15:36:31Z",
    "arxiv_id": "http://arxiv.org/abs/2211.05657v2",
    "download_url": "https://arxiv.org/abs/2211.05657v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Calculus without Limit Theory",
    "abstract": "This paper establishes calculus upon two physical facts: (1) any average velocity is always between two instantaneous velocities, and (2) the motion of an object is determined once its velocity has been determined. It directly defines derivative and definite integral on an ordered field, proves the fundamental theorem of calculus with no auxiliary conditions, easily reveals the common properties of derivatives, and obtains differentiation formulas for elementary functions. Further discussion shows that the new definitions are in accord with the traditional concepts for continuously differentiable functions. This is a result of the authors' research in the field of educational mathematics, which hopes to provide a more elementary and effective way to teach calculus.",
    "authors": [
      "Jingzhong Zhang",
      "Zengxiang Tong"
    ],
    "publication_date": "2018-02-08T19:27:30Z",
    "arxiv_id": "http://arxiv.org/abs/1802.03029v1",
    "download_url": "https://arxiv.org/abs/1802.03029v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Introduction to Regge Calculus for Gravitation",
    "abstract": "With the theory of general relativity, Einstein abolished the interpretation of gravitation as a force and associated it to the curvature of spacetime. Tensorial calculus and differential geometry are the mathematical resources necessary to study the spacetime manifold in the context of Einstein's theory. In 1961, Tullio Regge published a work on which he uses the old idea of triangulation of surfaces aiming the description of curvature, and, therefore, gravitation, through the use of discrete calculus. In this paper, we approach Regge Calculus pedagogically, as well as the main results towards a discretized version of Einstein's theory of gravitation.",
    "authors": [
      "R. R. Cuzinatto",
      "C. A. M. de Melo",
      "C. Naldoni de Souza"
    ],
    "publication_date": "2019-04-01T22:26:05Z",
    "arxiv_id": "http://arxiv.org/abs/1904.01966v1",
    "download_url": "https://arxiv.org/abs/1904.01966v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Combinatorics and algebra of tensor calculus",
    "abstract": "In this paper, motivated by the theory of operads and PROPs we reveal the combinatorial nature of tensor calculus for strict tensor categories and show that there exists a monad which is described by the coarse-graining of graphs and characterizes the algebraic nature of tensor calculus.",
    "authors": [
      "Sen Hu",
      "Xuexing Lu",
      "Yu Ye"
    ],
    "publication_date": "2015-01-08T10:36:43Z",
    "arxiv_id": "http://arxiv.org/abs/1501.01790v1",
    "download_url": "https://arxiv.org/abs/1501.01790v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simplifying and Refactoring Introductory Calculus",
    "abstract": "First year calculus is often taught in a way that is very burdensome to the student. Students have to memorize a diversity of processes for essentially performing the same task. However, many calculus processes can be simplified and streamlined so that fewer concepts can provide more flexibility and capability for first-year students.",
    "authors": [
      "Jonathan Bartlett"
    ],
    "publication_date": "2018-11-07T15:04:08Z",
    "arxiv_id": "http://arxiv.org/abs/1811.03459v1",
    "download_url": "https://arxiv.org/abs/1811.03459v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hereditary Substitution for the λΔ-Calculus",
    "abstract": "Hereditary substitution is a form of type-bounded iterated substitution, first made explicit by Watkins et al. and Adams in order to show normalization of proof terms for various constructive logics. This paper is the first to apply hereditary substitution to show normalization of a type theory corresponding to a non-constructive logic, namely the lambda-Delta calculus as formulated by Rehof. We show that there is a non-trivial extension of the hereditary substitution function of the simply-typed lambda calculus to one for the lambda-Delta calculus. Then hereditary substitution is used to prove normalization.",
    "authors": [
      "Harley Eades",
      "Aaron Stump"
    ],
    "publication_date": "2013-09-05T08:03:41Z",
    "arxiv_id": "http://arxiv.org/abs/1309.1256v1",
    "download_url": "https://arxiv.org/abs/1309.1256v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Intersection Types for the Computational lambda-Calculus",
    "abstract": "We study polymorphic type assignment systems for untyped lambda-calculi with effects, based on Moggi's monadic approach. Moving from the abstract definition of monads, we introduce a version of the call-by-value computational lambda-calculus based on Wadler's variant with unit and bind combinators, and without let. We define a notion of reduction for the calculus and prove it confluent, and also we relate our calculus to the original work by Moggi showing that his untyped metalanguage can be interpreted and simulated in our calculus. We then introduce an intersection type system inspired to Barendregt, Coppo and Dezani system for ordinary untyped lambda-calculus, establishing type invariance under conversion, and provide models of the calculus via inverse limit and filter model constructions and relate them. We prove soundness and completeness of the type system, together with subject reduction and expansion properties. Finally, we introduce a notion of convergence, which is precisely related to reduction, and characterize convergent terms via their types.",
    "authors": [
      "Ugo de'Liguoro",
      "Riccardo Treglia"
    ],
    "publication_date": "2019-07-12T12:46:24Z",
    "arxiv_id": "http://arxiv.org/abs/1907.05706v3",
    "download_url": "https://arxiv.org/abs/1907.05706v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Application of Quantum Stochastic Calculus to Feedback Control",
    "abstract": "The basic aspects of the Hudson-Parthasarathy quantum stochastic calculus and of the Accardi-Fagnola-Quaegebeur representation free stochastic calculus are presented. The basic features of the stochastic calculus for the square of white noise recently developed by Accardi-Boukas are described. The feedback control problem for stochastic processes driven by quantum noise is solved",
    "authors": [
      "Andreas Boukas"
    ],
    "publication_date": "2013-08-07T21:28:48Z",
    "arxiv_id": "http://arxiv.org/abs/1308.1948v1",
    "download_url": "https://arxiv.org/abs/1308.1948v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Functional Calculus Approach to the Spectral Theorem",
    "abstract": "A consistent functional calculus approach to the spectral theorem for strongly commuting normal operators on Hilbert spaces is presented. In contrast to the common approaches using projection-valued measures or multiplication operators, here the functional calculus is not treated as a subordinate but as the central concept. Based on five simple axioms for a \"measurable functional calculus\", the theory of such calculi is developed in detail, including spectral theory, uniqueness results and construction principles. Finally, the functional calculus form of the spectral theorem is stated and proved, with some proof variants being discussed.",
    "authors": [
      "Markus Haase"
    ],
    "publication_date": "2020-03-13T06:24:45Z",
    "arxiv_id": "http://arxiv.org/abs/2003.06130v2",
    "download_url": "https://arxiv.org/abs/2003.06130v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Magnetic Weyl Calculus",
    "abstract": "In the presence of a variable magnetic field, the Weyl pseudodifferential calculus must be modified. The usual modification, based on ``the minimal coupling principle'' at the level of the classical symbols, does not lead to gauge invariant formulae if the magnetic field is not constant. We present a gauge covariant quantization, relying on the magnetic canonical commutation relations. The underlying symbolic calculus is a deformation, defined in terms of the magnetic flux through triangles, of the classical Moyal product.",
    "authors": [
      "Marius Mantoiu",
      "Radu Purice"
    ],
    "publication_date": "2004-01-27T16:13:08Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0401043v1",
    "download_url": "https://arxiv.org/abs/math-ph/0401043v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The algebraic structure of quantity calculus",
    "abstract": "An algebraic structure underlying the quantity calculus is proposed consisting in an algebraic fiber bundle, that is, a base structure which is a free Abelian group together with fibers which are one dimensional vector spaces, all of them bound by algebraic restrictions. Subspaces, tensor product and quotient spaces are considered as well as homomorphisms to end with a classification theorem of these structures. The new structure provides an axiomatic foundation for quantity calculus and gives complete justification within its framework of the way that quantity calculus is actually performed. It is hoped that this exposition helps to clarify the role of the interviening concepts of quantity, quantity value, quantity dimension and their relation with a system of units, particularly, the SI.",
    "authors": [
      "Alvaro P. Raposo"
    ],
    "publication_date": "2016-10-21T10:33:33Z",
    "arxiv_id": "http://arxiv.org/abs/1611.01502v1",
    "download_url": "https://arxiv.org/abs/1611.01502v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Order of Magnitude Calculus",
    "abstract": "This paper develops a simple calculus for order of magnitude reasoning.  A semantics is given with soundness and completeness results.  Order of magnitude probability functions are easily defined and turn out to be equivalent to kappa functions, which are slight generalizations of Spohn's Natural Conditional Functions.  The calculus also gives rise to an order of magnitude decision theory, which can be used to justify an amended version of Pearl's decision theory for kappa functions, although the latter is weaker and less expressive.",
    "authors": [
      "Nic Wilson"
    ],
    "publication_date": "2013-02-20T15:24:11Z",
    "arxiv_id": "http://arxiv.org/abs/1302.4989v1",
    "download_url": "https://arxiv.org/abs/1302.4989v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cirquent calculus in a nutshell",
    "abstract": "This paper is a brief and informal presentation of cirquent calculus, a novel proof system for resource-conscious logics. As such, it is a refinement of sequent calculus with mechanisms that allow to explicitly account for the possibility of sharing of subexpressions/subresources between different expressions/resources. This is achieved by dealing with circuit-style constructs, termed cirquents, instead of formulas, sequents or other tree-like structures. The approach exhibits greater expressiveness, flexibility and efficiency compared to the more traditional proof-theoretic approaches.",
    "authors": [
      "Giorgi Japaridze",
      "Bikal Lamichhane"
    ],
    "publication_date": "2021-08-28T02:25:42Z",
    "arxiv_id": "http://arxiv.org/abs/2108.12552v1",
    "download_url": "https://arxiv.org/abs/2108.12552v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integral Categories and Calculus Categories",
    "abstract": "Differential categories are now an established abstract setting for differentiation. However not much attention has been given to the process which is inverse to differentiation: integration. This paper presents the parallel development for integration by axiomatizing an integral transformation, $s_A: !A \\to !A \\otimes A$, in a symmetric monoidal category with a coalgebra modality. When integration is combined with differentiation, the two fundamental theorems of calculus are expected to hold (in a suitable sense): a differential category with integration which satisfies these two theorem is called a {\\em calculus category\\/}.\n  Modifying an approach to antiderivatives by T. Ehrhard, we define having antiderivatives as the demand that a certain natural transformation, $K: !A \\to !A$, is invertible. We observe that a differential category having antiderivatives, in this sense, is always a calculus category.\n  When the coalgebra modality is monoidal, it is natural to demand an extra coherence between integration and the coalgebra modality. In the presence of this extra coherence we show that a calculus category with a monoidal coalgebra modality has its integral transformation given by antiderivatives and, thus, that the integral structure is uniquely determined by the differential structure.\n  The paper finishes by providing a suite of separating examples. Examples of differential categories, integral categories, and calculus categories based on both monoidal and (mere) coalgebra modalities are presented. In addition, differential categories which are not integral categories are discussed and vice versa.",
    "authors": [
      "J. R. B. Cockett",
      "JS Lemay"
    ],
    "publication_date": "2017-07-25T20:36:04Z",
    "arxiv_id": "http://arxiv.org/abs/1707.08211v3",
    "download_url": "https://arxiv.org/abs/1707.08211v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Differential calculus and gauge theory on finite sets",
    "abstract": "We develop differential calculus and gauge theory on a finite set G. An elegant formulation is obtained when G is supplied with a group structure and in particular for a cyclic group. Connes' two-point model (which is an essential ingredient of his reformulation of the standard model of elementary particle physics) is recovered in our approach. Reductions of the universal differential calculus to `lower-dimensional' differential calculi are considered. The `complete reduction' leads to a differential calculus on a periodic lattice which is related to q-calculus.",
    "authors": [
      "A. Dimakis",
      "F. M\"uller-Hoissen"
    ],
    "publication_date": "1994-01-28T15:47:25Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9401149v1",
    "download_url": "https://arxiv.org/abs/hep-th/9401149v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formalizing Box Inference for Capture Calculus",
    "abstract": "Capture calculus has recently been proposed as a solution to effect checking, achieved by tracking the captured references of terms in the types. Boxes, along with the box and unbox operations, are a crucial construct in capture calculus, which maintains the hygiene of types and improves the expressiveness of polymorphism over capturing types. Despite their usefulness in the formalism, boxes would soon become a heavy notational burden for users when the program grows. It thus necessitates the inference of boxes when integrating capture checking into a mainstream programming language. In this paper, we develop a formalisation of box inference for capture calculus. We begin by introducing a semi-algorithmic variant of the capture calculus, from which we derive an inference system where typed transformations are applied to complete missing box operations in programs. Then, we propose a type-level system that performs provably equivalent inference on the type level, without actually transforming the program. In the metatheory, we establish the relationships between these systems and capture calculus, thereby proving both the soundness and the completeness of box inference.",
    "authors": [
      "Yichen Xu",
      "Martin Odersky"
    ],
    "publication_date": "2023-06-10T17:42:06Z",
    "arxiv_id": "http://arxiv.org/abs/2306.06496v1",
    "download_url": "https://arxiv.org/abs/2306.06496v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric Approach to Subdifferential Calculus",
    "abstract": "In this paper we develop a geometric approach to convex subdifferential calculus in finite dimensions with employing some ideas of modern variational analysis. This approach allows us to obtain natural and rather easy proofs of basic results of convex subdifferential calculus in full generality and also derive new results of convex analysis concerning marginal/value functions, normal of inverse images of sets under set-valued mappings, calculus rules for coderivatives of single-valued and set-valued mappings, and calculating coderivatives of solution maps to convex generalized equations.",
    "authors": [
      "Boris Mordukhovich",
      "Nguyen Mau Nam"
    ],
    "publication_date": "2015-04-22T23:25:12Z",
    "arxiv_id": "http://arxiv.org/abs/1504.06004v4",
    "download_url": "https://arxiv.org/abs/1504.06004v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Introduction to Cirquent Calculus and Abstract Resource Semantics",
    "abstract": "This paper introduces a refinement of the sequent calculus approach called cirquent calculus. While in Gentzen-style proof trees sibling (or cousin, etc.) sequents are disjoint sequences of formulas, in cirquent calculus they are permitted to share elements. Explicitly allowing or disallowing shared resources and thus taking to a more subtle level the resource-awareness intuitions underlying substructural logics, cirquent calculus offers much greater flexibility and power than sequent calculus does. A need for substantially new deductive tools came with the birth of computability logic (see http://www.cis.upenn.edu/~giorgi/cl.html) - the semantically constructed formal theory of computational resources, which has stubbornly resisted any axiomatization attempts within the framework of traditional syntactic approaches. Cirquent calculus breaks the ice. Removing contraction from the full collection of its rules yields a sound and complete system for the basic fragment CL5 of computability logic. Doing the same in sequent calculus, on the other hand, throws out the baby with the bath water, resulting in the strictly weaker affine logic. An implied claim of computability logic is that it is CL5 rather than affine logic that adequately materializes the resource philosophy traditionally associated with the latter. To strengthen this claim, the paper further introduces an abstract resource semantics and shows the soundness and completeness of CL5 with respect to it.",
    "authors": [
      "Giorgi Japaridze"
    ],
    "publication_date": "2005-06-27T19:45:06Z",
    "arxiv_id": "http://arxiv.org/abs/math/0506553v3",
    "download_url": "https://arxiv.org/abs/math/0506553v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Stochastic Fractional Calculus with Applications to Variational Principles",
    "abstract": "We introduce a stochastic fractional calculus. As an application, we present a stochastic fractional calculus of variations, which generalizes the fractional calculus of variations to stochastic processes. A stochastic fractional Euler-Lagrange equation is obtained, extending those available in the literature for the classical, fractional, and stochastic calculus of variations. To illustrate our main theoretical result, we discuss two examples: one derived from quantum mechanics, the second validated by an adequate numerical simulation.",
    "authors": [
      "Houssine Zine",
      "Delfim F. M. Torres"
    ],
    "publication_date": "2020-08-01T10:16:34Z",
    "arxiv_id": "http://arxiv.org/abs/2008.00233v1",
    "download_url": "https://arxiv.org/abs/2008.00233v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inductive types in the Calculus of Algebraic Constructions",
    "abstract": "In a previous work, we proved that almost all of the Calculus of Inductive Constructions (CIC), which is the basis of the proof assistant Coq, can be seen as a Calculus of Algebraic Constructions (CAC), an extension of the Calculus of Constructions with functions and predicates defined by higher-order rewrite rules. In this paper, we not only prove that CIC as a whole can be seen as a CAC, but also that it can be extended with non-free constructors, pattern-matching on defined symbols, non-strictly positive types and inductive-recursive types.",
    "authors": [
      "Frédéric Blanqui"
    ],
    "publication_date": "2006-10-11T15:18:13Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0610070v1",
    "download_url": "https://arxiv.org/abs/cs/0610070v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Refinement Calculus for Logic Programs",
    "abstract": "Existing refinement calculi provide frameworks for the stepwise development of imperative programs from specifications. This paper presents a refinement calculus for deriving logic programs. The calculus contains a wide-spectrum logic programming language, including executable constructs such as sequential conjunction, disjunction, and existential quantification, as well as specification constructs such as general predicates, assumptions and universal quantification. A declarative semantics is defined for this wide-spectrum language based on executions. Executions are partial functions from states to states, where a state is represented as a set of bindings. The semantics is used to define the meaning of programs and specifications, including parameters and recursion. To complete the calculus, a notion of correctness-preserving refinement over programs in the wide-spectrum language is defined and refinement laws for developing programs are introduced. The refinement calculus is illustrated using example derivations and prototype tool support is discussed.",
    "authors": [
      "Ian Hayes",
      "Robert Colvin",
      "David Hemer",
      "Paul Strooper",
      "Ray Nickson"
    ],
    "publication_date": "2002-02-04T01:20:38Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0202002v1",
    "download_url": "https://arxiv.org/abs/cs/0202002v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Calculus for Modular Loop Acceleration",
    "abstract": "Loop acceleration can be used to prove safety, reachability, runtime bounds, and (non-)termination of programs operating on integers. To this end, a variety of acceleration techniques has been proposed. However, all of them are monolithic: Either they accelerate a loop successfully or they fail completely. In contrast, we present a calculus that allows for combining acceleration techniques in a modular way and we show how to integrate many existing acceleration techniques into our calculus. Moreover, we propose two novel acceleration techniques that can be incorporated into our calculus seamlessly. An empirical evaluation demonstrates the applicability of our approach.",
    "authors": [
      "Florian Frohn"
    ],
    "publication_date": "2020-01-06T12:22:14Z",
    "arxiv_id": "http://arxiv.org/abs/2001.01516v3",
    "download_url": "https://arxiv.org/abs/2001.01516v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On functional calculus properties of Ritt operators",
    "abstract": "We compare various functional calculus properties of Ritt operators. We show the existence of a Ritt operator T : X --> X on some Banach space X with the following property: T has a bounded $\\H^\\infty$ functional calculus with respect to the unit disc $\\D$ (that is, T is polynomially bounded) but T does not have any bounded $\\H^\\infty$ functional calculus with respect to a Stolz domain of $\\D$ with vertex at 1. Also we show that for an R-Ritt operator, the unconditional Ritt condition of Kalton-Portal is equivalent to the existence of a bounded $\\H^\\infty$ functional calculus with respect to such a Stolz domain.",
    "authors": [
      "Florence Lancien",
      "Christian Le Merdy"
    ],
    "publication_date": "2013-01-21T14:37:51Z",
    "arxiv_id": "http://arxiv.org/abs/1301.4875v1",
    "download_url": "https://arxiv.org/abs/1301.4875v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Differential Calculus and Discrete Structures",
    "abstract": "There is a deformation of the ordinary differential calculus which leads from the continuum to a lattice (and induces a corresponding deformation of physical theories). We recall some of its features and relate it to a general framework of differential calculus on discrete sets. This framework generalizes the usual (lattice) discretization.",
    "authors": [
      "A. Dimakis",
      "F. M\"uller-Hoissen"
    ],
    "publication_date": "1994-01-28T16:08:24Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9401150v1",
    "download_url": "https://arxiv.org/abs/hep-th/9401150v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tangent infinity-categories and Goodwillie calculus",
    "abstract": "We make precise the analogy between Goodwillie's calculus of functors in homotopy theory and the differential calculus of smooth manifolds by introducing a higher-categorical framework of which both theories are examples. That framework is an extension to infinity-categories of the tangent categories of Cockett and Cruttwell (introduced originally by Rosický). The basic data of a tangent infinity-category consist of an endofunctor, that plays the role of the tangent bundle construction, together with various natural transformations that mimic structure possessed by the ordinary tangent bundles of smooth manifolds.\n  The role of the tangent bundle functor in Goodwillie calculus is played by Lurie's tangent bundle for infinity-categories, introduced to generalize the cotangent complexes of André, Quillen and Illusie. We show that Lurie's construction admits the additional structure maps and satisfies the conditions needed to form a tangent infinity-category which we refer to as the Goodwillie tangent structure.\n  Cockett and Cruttwell (and others) have started to develop various aspects of differential geometry in the abstract context of tangent categories, and we begin to apply those ideas to Goodwillie calculus. For example, we show that the role of Euclidean spaces in the calculus of manifolds is played in Goodwillie calculus by the stable infinity-categories. We also show that Goodwillie's n-excisive functors are the direct analogues of n-jets of smooth maps between manifolds; to state that connection precisely, we develop a notion of tangent (infinity,2)-category and show that Goodwillie calculus is best understood in that context.",
    "authors": [
      "Kristine Bauer",
      "Matthew Burke",
      "Michael Ching"
    ],
    "publication_date": "2021-01-19T19:03:02Z",
    "arxiv_id": "http://arxiv.org/abs/2101.07819v4",
    "download_url": "https://arxiv.org/abs/2101.07819v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Computation of Tamarkin-Tsygan Calculus",
    "abstract": "We compute the full Tamarkin-Tsygan calculus of a Koszul algebra whose global dimension exceeds the number of generators. Our results show that even for algebras possessing an economic presentation and agreeable homological properties, the Hochschild (co)homology, as well as the structure of the Tamarkin--Tsygan calculus may exhibit a rather intricate behavior.",
    "authors": [
      "Jun Chen",
      "Xiabing Ruan",
      "Jia Yang"
    ],
    "publication_date": "2025-09-16T11:45:27Z",
    "arxiv_id": "http://arxiv.org/abs/2509.12984v2",
    "download_url": "https://arxiv.org/abs/2509.12984v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Sequent Calculus for Dynamic Topological Logic",
    "abstract": "We introduce a sequent calculus for the temporal-over-topological fragment $\\textbf{DTL}_{0}^{\\circ * \\slash \\Box}$ of dynamic topological logic $\\textbf{DTL}$, prove soundness semantically, and prove completeness syntactically using the axiomatization of $\\textbf{DTL}_{0}^{\\circ * \\slash \\Box}$ given in \\cite{paper3}. A cut-free sequent calculus for $\\textbf{DTL}_{0}^{\\circ * \\slash \\Box}$ is obtained as the union of the propositional fragment of Gentzen's classical sequent calculus, two $\\Box$ structural rules for the modal extension, and nine $\\circ$ (next) and $*$ (henceforth) structural rules for the temporal extension. Future research will focus on the construction of a hypersequent calculus for dynamic topological $\\textbf{S5}$ logic in order to prove Kremer's Next Removal Conjecture for the logic of homeomorphisms on almost discrete spaces $\\textbf{S5H}$.",
    "authors": [
      "Samuel Reid"
    ],
    "publication_date": "2014-07-25T20:44:02Z",
    "arxiv_id": "http://arxiv.org/abs/1407.7803v2",
    "download_url": "https://arxiv.org/abs/1407.7803v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Calculus with respect to Gaussian Processes",
    "abstract": "Stochastic integration with respect to Gaussian processes, such as fractional Brownian motion (fBm) or multifractional Brownian motion (mBm), has raised strong interest in recent years, motivated in particular by applications in finance, Internet traffic modeling and biomedicine. The aim of this work to define and develop, using White Noise Theory, an anticipative stochastic calculus with respect to a large class of Gaussian processes, denoted G, that contains, among many other processes, Volterra processes (and thus fBm) and also mBm. This stochastic calculus includes a definition of a stochastic integral, Itô formulas (both for tempered distributions and for functions with sub-exponential growth), a Tanaka Formula as well as a definition, and a short study, of (both weighted and non weighted) local times of elements of G . In that view, a white noise derivative of any Gaussian process G of G is defined and used to integrate, with respect to G, a large class of stochastic processes, using Wick products. A comparison of our integral wrt elements of G to the ones provided by Malliavin calculus in [AMN01] and by Itô stochastic calculus is also made. Moreover, one shows that the stochastic calculus with respect to Gaussian processes provided in this work generalizes the stochastic calculus originally proposed for fBm in [EVdH03, BSØW04, Ben03a] and for mBm in [LLV14, Leb13, LLVH14]. Likewise, it generalizes results given in [NT06] and some results given in [AMN01]. In addition, it offers alternative conditions to the ones required in [AMN01] when one deals with stochastic calculus with respect to Gaussian processes.",
    "authors": [
      "Joachim Lebovits"
    ],
    "publication_date": "2014-08-05T16:16:15Z",
    "arxiv_id": "http://arxiv.org/abs/1408.1020v3",
    "download_url": "https://arxiv.org/abs/1408.1020v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multivariable manifold calculus of functors",
    "abstract": "Manifold calculus of functors, due to M. Weiss, studies contravariant functors from the poset of open subsets of a smooth manifold to topological spaces. We introduce \"multivariable\" manifold calculus of functors which is a generalization of this theory to functors whose domain is a product of categories of open sets. We construct multivariable Taylor approximations to such functors, classify multivariable homogeneous functors, apply this classification to compute the derivatives of a functor, and show what this gives for the space of link maps. We also relate Taylor approximations in single variable calculus to our multivariable ones.",
    "authors": [
      "Brian A. Munson",
      "Ismar Volic"
    ],
    "publication_date": "2009-04-27T15:27:25Z",
    "arxiv_id": "http://arxiv.org/abs/0904.4185v2",
    "download_url": "https://arxiv.org/abs/0904.4185v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Differential equations in Ward's calculus",
    "abstract": "In this paper we solve some differential equations in the $D_h$ derivative in Ward's sense. We use a special metric in the formal power series ring $\\K[[x]]$. The solutions of that equations are giving in terms of fixed points for certain contractive maps in our metric framework. Our main tools are Banach's Fixed Point Theorem, Fundamental Calculus Theorem and Barrow's rule for Ward's calculus. Later, we return to the usual differential calculus via Sheffer's expansion of some kind of operators. Finally, we give some examples related, in some sense, to combinatorics.",
    "authors": [
      "Ana Luzón",
      "Manuel A. Morón",
      "José L. Ramírez"
    ],
    "publication_date": "2024-08-22T17:08:08Z",
    "arxiv_id": "http://arxiv.org/abs/2408.12552v1",
    "download_url": "https://arxiv.org/abs/2408.12552v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Manifold calculus and homotopy sheaves",
    "abstract": "Manifold calculus is a form of functor calculus concerned with functors from some category of manifolds to spaces. A weakness in the original formulation is that it is not continuous in the sense that it does not handle well the natural enrichments. In this paper, we correct this by defining an enriched version of manifold calculus which essentially extends the discrete setting. Along the way, we recast the Taylor tower as a tower of homotopy sheafifications. As a spin-off we obtain a natural connection to operads: the limit of the Taylor tower is a certain (derived) space of right module maps over the framed little discs operad.",
    "authors": [
      "Pedro Boavida de Brito",
      "Michael S. Weiss"
    ],
    "publication_date": "2012-02-06T22:07:01Z",
    "arxiv_id": "http://arxiv.org/abs/1202.1305v2",
    "download_url": "https://arxiv.org/abs/1202.1305v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Calculus via Stopping Derivatives",
    "abstract": "We show that a substantial portion of stochastic calculus can be developed along similar lines to ordinary calculus, with derivative-based concepts driving the development. We define a notion of stopping derivative, which is a form of right derivative with respect to stopping times. Using this, we define the drift and variance rate of a process as stopping derivatives for (generalised) conditional expectation and conditional variance respectively. Applying elementary, derivative-based methods, we derive a calculus of rules describing how drift and variance rate transform under constructions on processes, culminating in a version of the multi-dimensional Itô formula. Our approach connects with the standard machinery of stochastic calculus via a theorem establishing that continuous processes with zero drift coincide with random translations of continuous local martingales. This equivalence allows us to derive a Fundamental Theorem of Calculus for stopping derivatives, which relates the quantities of drift and variance rate, defined as stopping derivatives, to parameters used in the description of a process as a stochastic integral.",
    "authors": [
      "Alex Simpson"
    ],
    "publication_date": "2025-01-06T09:10:05Z",
    "arxiv_id": "http://arxiv.org/abs/2501.02862v3",
    "download_url": "https://arxiv.org/abs/2501.02862v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Discrete Calculus of Finite Sequences",
    "abstract": "The calculus of finite differences is a solid foundation for the development of operations such as the derivative and the integral for infinite sequences. Here we showed a way to extend it for finite sequences. We could then define convexity for finite sequences and some related concepts. To finalize, we propose a way to go from our extension to the calculus of finite differences.",
    "authors": [
      "Sérgio Martins Filho"
    ],
    "publication_date": "2016-06-07T15:30:36Z",
    "arxiv_id": "http://arxiv.org/abs/1606.02182v10",
    "download_url": "https://arxiv.org/abs/1606.02182v10",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extension of Chronological Calculus for Dynamical Systems on Manifolds",
    "abstract": "We propose an extension of the Chronological Calculus, developed by Agrachev and Gamkrelidze for the case of $C^\\infty$-smooth dynamical systems on finite-dimensional $C^\\infty$-smooth manifolds, to the case of $C^m$-smooth dynamical systems and infinite-dimensional $C^m$-manifolds. Due to a relaxation in the underlying structure of the calculus, this extension provides a powerful computational tool without recourse to the theory of calculus in Fréchet spaces required by the classical Chronological Calculus. In addition, this extension accounts for flows of vector fields which are merely measurable in time. To demonstrate the utility of this extension, we prove a variant of Chow-Rashevskii theorem for infinite-dimensional manifolds.",
    "authors": [
      "Robert J. Kipka",
      "Yuri S. Ledyaev"
    ],
    "publication_date": "2014-05-15T20:15:22Z",
    "arxiv_id": "http://arxiv.org/abs/1405.3997v1",
    "download_url": "https://arxiv.org/abs/1405.3997v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Weyl calculus in infinitely many variables",
    "abstract": "We outline an abstract approach to the pseudo-differential Weyl calculus for operators in function spaces in infinitely many variables. Our earlier approach to the Weyl calculus for Lie group representations is extended to the case of representations associated with infinite-dimensional coadjoint orbits. We illustrate the approach by the case of infinite-dimensional Heisenberg groups. The classical Weyl-Hörmander calculus is recovered for the Schrödinger representations of the finite-dimensional Heisenberg groups.",
    "authors": [
      "Ingrid Beltita",
      "Daniel Beltita"
    ],
    "publication_date": "2010-09-04T13:32:48Z",
    "arxiv_id": "http://arxiv.org/abs/1009.0836v1",
    "download_url": "https://arxiv.org/abs/1009.0836v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Differential calculus over N-graded commutative rings",
    "abstract": "The Chevalley-Eilenberg differential calculus and differential operators over N-graded commutative rings are constructed. This is a straightforward generalization of the differential calculus over commutative rings, and it is the most general case of the differential calculus over rings that is not the non-commutative geometry. Since any N-graded ring possesses the associated Z_2-graded structure, this also is the case of the graded differential calculus over Grassmann algebras and the supergeometry and field theory on graded manifolds.",
    "authors": [
      "G. Sardanashvily",
      "W. Wachowski"
    ],
    "publication_date": "2016-05-23T17:44:44Z",
    "arxiv_id": "http://arxiv.org/abs/1605.07115v1",
    "download_url": "https://arxiv.org/abs/1605.07115v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Operational Umbral Calculus",
    "abstract": "In this paper, we investigate the power of nearly purely operational techniques in the study of umbral calculus. We present a concise reconstruction of the theory based on a systematic use of linear operators, with particular attention to umbral operators. We also give an in-depth study of the generating functions associated to umbral calculus, and show how these lead to short proofs of several advanced results, including the Lagrange-Bürmann inversion theorem. Finally, we discuss pseudoinverses for delta operators and illustrate our methods with a variety of examples.",
    "authors": [
      "Kei Beauduin"
    ],
    "publication_date": "2024-07-23T09:50:29Z",
    "arxiv_id": "http://arxiv.org/abs/2407.16348v4",
    "download_url": "https://arxiv.org/abs/2407.16348v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Paragrassmann Differential Calculus",
    "abstract": "Explicit general constructions of paragrassmann calculus with one and many variables are given. Relations of the paragrassmann calculus to quantum groups are outlined and possible physics applications are briefly discussed. This paper is the same as the original 9210075 except added Appendix and minor changes in Acknowledgements and References. IMPORTANT NOTE: This paper bears the same title as the Dubna preprint E5-92-392 but is NOT identical to it, containing new results, extended discussions, and references.",
    "authors": [
      "A. T. Filippov",
      "A. P. Isaev",
      "A. B. Kurdikov"
    ],
    "publication_date": "1992-10-14T07:11:42Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9210075v2",
    "download_url": "https://arxiv.org/abs/hep-th/9210075v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Umbral calculus and Euler polynomials",
    "abstract": "In this paper, we study some properties of Euler polynomials arising from umbral calculus. Finally, we give some interesting identities of Euler polynomials using our results. Recently, Dere and Simsek have studied umbral calculus related to special polynomials (see[6]).",
    "authors": [
      "Dae San Kim",
      "Taekyun Kim",
      "Seog-Hoon Rim"
    ],
    "publication_date": "2012-11-22T02:37:21Z",
    "arxiv_id": "http://arxiv.org/abs/1211.6639v1",
    "download_url": "https://arxiv.org/abs/1211.6639v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weyl Calculus on Graded Groups",
    "abstract": "The aim of this paper is to establish a pseudo-differential Weyl calculus on graded nilpotent Lie groups $G$ which extends the celebrated Weyl calculus on $\\mathbb{R}^n$. To reach this goal, we develop a symbolic calculus for a very general class of quantization schemes, following [Doc. Math., 22, 1539--1592, 2017], using the Hörmander symbol classes $S^m_{ρ, δ}(G)$ introduced in [Progress in Mathematics, 314. Birkhäuser/Springer, 2016]. We particularly focus on the so-called symmetric calculi, for which quantizing and taking the adjoint commute, among them the Euclidean Weyl calculus, but we also recover the (non-symmetric) Kohn-Nirenberg calculus, on $\\mathbb{R}^n$ and on general graded groups [Progress in Mathematics, 314. Birkhäuser/Springer, 2016]. Several interesting applications follow directly from our calculus: expected mapping properties on Sobolev spaces, the existence of one-sided parametrices and the Gårding inequality for elliptic operators, and a generalization of the Poisson bracket for symmetric quantizations on stratified groups.\n  In the particular case of the Heisenberg group $\\mathbb{H}_n$, we are able to answer the fundamental questions of this paper: which, among all the admissible quantizations, is the natural Weyl quantization on $\\mathbb{H}_n$? And which are the criteria that determine it uniquely? The surprisingly simple but compelling answers raise the question whether what is true for $\\mathbb{R}^n$ and $\\mathbb{H}_n$ also extends to general graded groups, which we answer in the affirmative in this paper.\n  Among other things, we discuss and investigate an analogue of the symplectic invariance property of the Weyl quantization in the setting of graded groups, as well as the notion of the Poisson bracket for symbols in the setting of stratified groups, linking it to the symbolic properties of the commutators.",
    "authors": [
      "Serena Federico",
      "David Rottensteiner",
      "Michael Ruzhansky"
    ],
    "publication_date": "2023-06-07T09:21:45Z",
    "arxiv_id": "http://arxiv.org/abs/2306.04275v1",
    "download_url": "https://arxiv.org/abs/2306.04275v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entanglement and Quaternions: The graphical calculus ZQ",
    "abstract": "Graphical calculi are vital tools for representing and reasoning about quantum circuits and processes. Some are not only graphically intuitive but also logically complete. The best known of these is the ZX-calculus, which is an industry candidate for an Intermediate Representation; a language that sits between the algorithm designer's intent and the quantum hardware's gate instructions. The ZX calculus, built from generalised Z and X rotations, has difficulty reasoning about arbitrary rotations. This contrasts with the cross-hardware compiler TriQ which uses these arbitrary rotations to exploit hardware efficiencies. In this paper we introduce the graphical calculus ZQ, which uses quaternions to represent these arbitrary rotations, similar to TriQ, and the phase-free Z spider to represent entanglement, similar to ZX. We show that this calculus is sound and complete for qubit quantum computing, while also showing that a fully spider-based representation would have been impossible. This new calculus extends the zoo of qubit graphical calculi, each with different strengths, and we hope it will provide a common language for the optimisation procedures of both ZX and TriQ.",
    "authors": [
      "Hector Miller-Bakewell"
    ],
    "publication_date": "2020-03-22T21:34:59Z",
    "arxiv_id": "http://arxiv.org/abs/2003.09999v1",
    "download_url": "https://arxiv.org/abs/2003.09999v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Equivalence of a Bridged Link Calculus and Kirby's Calculus on Non-Simply Connected 3-Manifolds",
    "abstract": "We recall an extension of Kirby's Calculus on non-simply connected 3-manifolds given in [FR], and the surgery calculus of bridged links from [Ke], which involves only local moves. We give a short combinatorial proof that the two calculi are equivalent, and thus describe the same classes of 3-manifolds. This makes the proofs for the validity of surgery calculi in [FR] and [Ke] interchangeable.",
    "authors": [
      "Thomas Kerler"
    ],
    "publication_date": "1998-06-20T00:01:14Z",
    "arxiv_id": "http://arxiv.org/abs/math/9806113v1",
    "download_url": "https://arxiv.org/abs/math/9806113v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fractional Brownian Motion and the Fractional Stochastic Calculus",
    "abstract": "This paper begins by giving an historical context to fractional Brownian Motion and its development. Section 2 then introduces the fractional calculus, from the Riemann-Liouville perspective. In Section 3, we introduce Brownian motion and its properties, which is the framework for deriving the Itô integral. In Section 4 we finally introduce the Itô calculus and discuss the derivation of the Itô integral. Section 4.1 continues the discussion about the Itô calculus by introducing the Itô formula, which is the analogue to the chain rule in classical calculus. In Section 5 we present our formal definition of fBm and derive some of its properties that give motivation for the development of a stochastic calculus with respect to fBm. Finally, in Section 6 we define and characterize a stochastic integral with respect to fBm from a pathwise perspective.",
    "authors": [
      "Benjamin McGonegal"
    ],
    "publication_date": "2014-01-13T08:43:31Z",
    "arxiv_id": "http://arxiv.org/abs/1401.2752v1",
    "download_url": "https://arxiv.org/abs/1401.2752v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Encodability and Separation for a Reflective Higher-Order Calculus",
    "abstract": "The $ρ$-calculus (Reflective Higher-Order Calculus) of Meredith and Radestock is a $π$-calculus-like language with some unusual features, notably, structured names, runtime generation of free names, and the lack of an operator for scoping visibility of names. These features pose some interesting difficulties for proofs of encodability and separation results. We describe two errors in a previously published attempt to encode the $π$-calculus in the $ρ$-calculus by Meredith and Radestock. Then we give a new encoding and prove its correctness, using a set of encodability criteria close to those proposed by Gorla, and discuss the adaptations necessary to work with a calculus with runtime generation of structured names. Lastly we prove a separation result, showing that the $ρ$-calculus cannot be encoded in the $π$-calculus.",
    "authors": [
      "Stian Lybech"
    ],
    "publication_date": "2022-09-06T10:39:19Z",
    "arxiv_id": "http://arxiv.org/abs/2209.02356v1",
    "download_url": "https://arxiv.org/abs/2209.02356v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Error calculus and path sensitivity in financial models",
    "abstract": "In the framework of risk management, for the study of the sensitivity of pricing and hedging in stochastic financial models to changes of parameters and to perturbations of the stock prices, we propose an error calculus which is an extension of the Malliavin calculus based on Dirichlet forms. Although useful also in physics, this error calculus is well adapted to stochastic analysis and seems to be the best practicable in finance. This tool is explained here intuitively and with some simple examples.",
    "authors": [
      "Nicolas Bouleau"
    ],
    "publication_date": "2006-10-16T15:04:21Z",
    "arxiv_id": "http://arxiv.org/abs/math/0610489v1",
    "download_url": "https://arxiv.org/abs/math/0610489v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Calculus of Mobility and Communication for Ubiquitous Computing",
    "abstract": "We propose a Calculus of Mobility and Communication (CMC) for the modelling of mobility, communication and context-awareness in the setting of ubiquitous computing. CMC is an ambient calculus with the in and out capabilities of Cardelli and Gordon's Mobile Ambients. The calculus has a new form of global communication similar to that in Milner's CCS. In CMC an ambient is tagged with a set of ports that agents executing inside the ambient are allowed to communicate on. It also has a new context-awareness feature that allows ambients to query their location. We present reduction semantics and labelled transition system semantics of CMC and prove that the semantics coincide. A new notion of behavioural equivalence is given by defining capability barbed bisimulation and congruence which is proved to coincide with barbed bisimulation congruence. The expressiveness of the calculus is illustrated by two case studies.",
    "authors": [
      "Nosheen Gul"
    ],
    "publication_date": "2015-08-17T01:59:25Z",
    "arxiv_id": "http://arxiv.org/abs/1508.03908v1",
    "download_url": "https://arxiv.org/abs/1508.03908v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spinor calculus on 5-dimensional spacetimes",
    "abstract": "Penrose's spinor calculus of 4-dimensional Lorentzian geometry is extended to the case of 5-dimensional Lorentzian geometry. Such fruitful ideas in Penrose's spinor calculus as the spin covariant derivative, the curvature spinors or the definition of the spin coefficients on a spin frame can be carried over to the spinor calculus in 5-dimensional Lorentzian geometry. The algebraic and differential properties of the curvature spinors are studied in detail and as an application we extend the well-known 4-dimensional Newman-Penrose formalism to a 5-dimensional spacetime.",
    "authors": [
      "Alfonso García-Parrado Gómez-Lobo",
      "José M. Martín-García"
    ],
    "publication_date": "2009-05-18T09:50:27Z",
    "arxiv_id": "http://arxiv.org/abs/0905.2846v2",
    "download_url": "https://arxiv.org/abs/0905.2846v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Sequent Calculus for Modelling Interferences",
    "abstract": "A logic calculus is presented that is a conservative extension of linear logic. The motivation beneath this work concerns lazy evaluation, true concurrency and interferences in proof search. The calculus includes two new connectives to deal with multisequent structures and has the cut-elimination property. Extensions are proposed that give first results concerning our objectives.",
    "authors": [
      "Christophe Fouqueré"
    ],
    "publication_date": "2007-06-22T14:24:34Z",
    "arxiv_id": "http://arxiv.org/abs/0706.3341v1",
    "download_url": "https://arxiv.org/abs/0706.3341v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Undecidability of the Lambek calculus with subexponential and bracket modalities",
    "abstract": "The Lambek calculus is a well-known logical formalism for modelling natural language syntax. The original calculus covered a substantial number of intricate natural language phenomena, but only those restricted to the context-free setting. In order to address more subtle linguistic issues, the Lambek calculus has been extended in various ways. In particular, Morrill and Valentin (2015) introduce an extension with so-called exponential and bracket modalities. Their extension is based on a non-standard contraction rule for the exponential that interacts with the bracket structure in an intricate way. The standard contraction rule is not admissible in this calculus. In this paper we prove undecidability of the derivability problem in their calculus. We also investigate restricted decidable fragments considered by Morrill and Valentin and we show that these fragments belong to the NP class.",
    "authors": [
      "Max Kanovich",
      "Stepan Kuznetsov",
      "Andre Scedrov"
    ],
    "publication_date": "2016-08-13T19:30:12Z",
    "arxiv_id": "http://arxiv.org/abs/1608.04020v2",
    "download_url": "https://arxiv.org/abs/1608.04020v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Commutator calculus and symbolic differentiation of matrix functions",
    "abstract": "We propose a functional calculus which allows one to apply functions to the matrix anti-commutator/commutator operator. The calculus is introduced in a straightforward manner if the operators act on symmetric matrices, and it leads to a coordinate-free version of Daleckii--Krein formula. In this sense, the proposed calculus provides symbolic formulae for the derivatives of matrix-valued functions that are explicit and easy to use. We discuss several applications of the newly introduced calculus in continuum mechanics (Hencky logarithmic strain, objective rates, spin tensors, viscoelastic fluids) and in the theory of partial differential equations.",
    "authors": [
      "Michal Bathory"
    ],
    "publication_date": "2025-05-12T18:34:22Z",
    "arxiv_id": "http://arxiv.org/abs/2505.07987v2",
    "download_url": "https://arxiv.org/abs/2505.07987v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Introduction to Semi-discrete Calculus",
    "abstract": "The Infinitesimal Calculus explores mainly two measurements: the instantaneous rates of change and the accumulation of quantities. This work shows that scientists, engineers, mathematicians, and teachers increasingly apply another change measurements tool: functions' local trends. While it seems to be a special case of the rate (via the derivative sign), this work proposes a separate and favorable mathematical framework for the trend, called Semi-discrete Calculus.",
    "authors": [
      "Amir Shachar"
    ],
    "publication_date": "2010-12-28T12:55:07Z",
    "arxiv_id": "http://arxiv.org/abs/1012.5751v8",
    "download_url": "https://arxiv.org/abs/1012.5751v8",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Properadic homotopical calculus",
    "abstract": "In this paper, we initiate the generalisation of the operadic calculus which governs the properties of homotopy algebras to a properadic calculus which governs the properties of homotopy gebras over a properad. In this first article of a series, we generalise the seminal notion of infini-morphisms and the ubiquitous homotopy transfer theorem. As an application, we recover the homotopy properties of involutive Lie bialgebras developed by Cieliebak--Fukaya--Latschev and we produce new explicit formulas.",
    "authors": [
      "Eric Hoffbeck",
      "Johan Leray",
      "Bruno Vallette"
    ],
    "publication_date": "2019-10-11T08:33:27Z",
    "arxiv_id": "http://arxiv.org/abs/1910.05027v2",
    "download_url": "https://arxiv.org/abs/1910.05027v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ordered Models of the Lambda Calculus",
    "abstract": "Answering a question by Honsell and Plotkin, we show that there are two equations between lambda terms, the so-called subtractive equations, consistent with lambda calculus but not simultaneously satisfied in any partially ordered model with bottom element. We also relate the subtractive equations to the open problem of the order-incompleteness of lambda calculus, by studying the connection between the notion of absolute unorderability in a specific point and a weaker notion of subtractivity (namely n-subtractivity) for partially ordered algebras. Finally we study the relation between n-subtractivity and relativized separation conditions in topological algebras, obtaining an incompleteness theorem for a general topological semantics of lambda calculus.",
    "authors": [
      "Antonino Salibra",
      "Alberto Carraro"
    ],
    "publication_date": "2013-11-08T09:55:52Z",
    "arxiv_id": "http://arxiv.org/abs/1311.1916v2",
    "download_url": "https://arxiv.org/abs/1311.1916v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Calculus from a Statistics Perspective",
    "abstract": "This paper provides an approach to establishing the calculus method from the concept of mean, i.e., average. This approach is from a statistics perspective and can help calculus learners understand calculus ideas and analyze a function defined by data or sampling values from a given function, rather than an explicit mathematical formula. The basics of this approach are two averages: arithmetic mean and graphic mean. The arithmetic mean is used to define integral. Area is used to interpret the meaning of an integral. Antiderivative is introduced from integral, and derivative-antiderivative pair is introduced as a mathematical operation entity. The graphic mean is an average speed in an interval and is used to interpret the meaning of a derivative.",
    "authors": [
      "Samuel S. P. Shen",
      "Dov Zazkis",
      "Kimberly Leung",
      "Chris Rasmussen"
    ],
    "publication_date": "2014-06-10T22:04:47Z",
    "arxiv_id": "http://arxiv.org/abs/1406.2731v1",
    "download_url": "https://arxiv.org/abs/1406.2731v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A symmetric quantum calculus",
    "abstract": "We introduce the $α,β$-symmetric difference derivative and the $α,β$-symmetric Nörlund sum. The associated symmetric quantum calculus is developed, which can be seen as a generalization of the forward and backward $h$-calculus.",
    "authors": [
      "Artur M. C. Brito da Cruz",
      "Natalia Martins",
      "Delfim F. M. Torres"
    ],
    "publication_date": "2011-12-28T15:14:17Z",
    "arxiv_id": "http://arxiv.org/abs/1112.6133v1",
    "download_url": "https://arxiv.org/abs/1112.6133v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An ML-style Record Calculus with Extensible Records",
    "abstract": "In this work, we develop a polymorphic record calculus with extensible records. Extensible records are records that can have new fields added to them, or preexisting fields removed from them. We also develop a static type system for this calculus and a sound and complete type inference algorithm. Most ML-style polymorphic record calculi that support extensible records are based on row variables. We present an alternative construction based on the polymorphic record calculus developed by Ohori. Ohori based his polymorphic record calculus on the idea of kind restrictions. This allowed him to express polymorphic operations on records such as field selection and modification. With the addition of extensible types, we were able to extend Ohori's original calculus with other powerful operations on records such as field addition and removal.",
    "authors": [
      "Sandra Alves",
      "Miguel Ramos"
    ],
    "publication_date": "2021-08-13T16:02:03Z",
    "arxiv_id": "http://arxiv.org/abs/2108.06296v2",
    "download_url": "https://arxiv.org/abs/2108.06296v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Complex Gradient Operator and the CR-Calculus",
    "abstract": "A thorough discussion and development of the calculus of real-valued functions of complex-valued vectors is given using the framework of the Wirtinger Calculus. The presented material is suitable for exposition in an introductory Electrical Engineering graduate level course on the use of complex gradients and complex Hessian matrices, and has been successfully used in teaching at UC San Diego. Going beyond the commonly encountered treatments of the first-order complex vector calculus, second-order considerations are examined in some detail filling a gap in the pedagogic literature.",
    "authors": [
      "Ken Kreutz-Delgado"
    ],
    "publication_date": "2009-06-26T03:32:32Z",
    "arxiv_id": "http://arxiv.org/abs/0906.4835v1",
    "download_url": "https://arxiv.org/abs/0906.4835v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin-networks in the ZX-calculus",
    "abstract": "The ZX-calculus, and the variant we consider in this paper (ZXH-calculus), are formal diagrammatic languages for qubit quantum computing. We show that it can also be used to describe SU(2) representation theory. To achieve this, we first recall the definition of Yutsis diagrams, a standard graphical calculus used in quantum chemistry and quantum gravity, which captures the main features of SU(2) representation theory. Second, we show precisely how it embed within Penrose's binor calculus. Third, we subsume both calculus into ZXH-diagrams. In the process we show how the SU(2) invariance of Wigner symbols is trivially provable in the ZXH-calculus. Additionally, we show how we can explicitly diagrammatically calculate 3jm, 4jm and 6j symbols. It has long been thought that quantum gravity should be closely aligned to quantum information theory. In this paper, we present a way in which this connection can be made exact, by writing the spin-networks of loop quantum gravity (LQG) in the ZX-diagrammatic language of quantum computation.",
    "authors": [
      "Richard D. P. East",
      "Pierre Martin-Dussaud",
      "John Van de Wetering"
    ],
    "publication_date": "2021-11-04T19:25:38Z",
    "arxiv_id": "http://arxiv.org/abs/2111.03114v2",
    "download_url": "https://arxiv.org/abs/2111.03114v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The S-functional calculus for the Clifford adjoint operator",
    "abstract": "In this paper, we work within the framework of modules over the Clifford algebra $\\mathbb{R}_d$. Our investigation focuses on the S-spectrum and the S-functional calculus in its various forms for the adjoint T* of a Clifford operator T. One of the key results we present is that the bisectoriality of T can be transferred to T*. This is grounded in the fact that, for Clifford operators, the S-spectrum of the adjoint operator T* is identical to that of T. Furthermore, we demonstrate that for the existing formulations of the S-functional calculus, including bounded, unbounded, $ω$, and $H^\\infty$ versions, there is a clear connection between the left functional calculus of T and the right functional calculus of T*. This explicit link between the left functional calculus of T and the right functional calculus of T* and vice versa is obtained using the function $f^\\#(s):=\\overline{f(\\overline{s})}$. Finally, we discuss the fact that the S-spectrum, related to the invertibility of the second-order operator T^2-2s_0T+|s|^2, can actually be characterized through the invertibility of the first-order $\\mathbb{R}$-linear operator T-I^Rs.",
    "authors": [
      "F. Colombo",
      "F. Mantovani",
      "P. Schlosser"
    ],
    "publication_date": "2025-08-18T14:31:47Z",
    "arxiv_id": "http://arxiv.org/abs/2508.12958v1",
    "download_url": "https://arxiv.org/abs/2508.12958v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Area Regge calculus and continuum limit",
    "abstract": "Encountered in the literature generalisations of general relativity to independent area variables are considered, the discrete (generalised Regge calculus) and continuum ones. The generalised Regge calculus can be either with purely area variables or, as we suggest, with area tensor-connection variables. Just for the latter, in particular, we prove that in analogy with corresponding statement in ordinary Regge calculus (by Feinberg, Friedberg, Lee and Ren), passing to the (appropriately defined) continuum limit yields the generalised continuum area tensor-connection general relativity.",
    "authors": [
      "V. M. Khatsymovsky"
    ],
    "publication_date": "2002-06-21T10:59:13Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/0206067v1",
    "download_url": "https://arxiv.org/abs/gr-qc/0206067v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stochastic Calculus of Wrapped Compartments",
    "abstract": "The Calculus of Wrapped Compartments (CWC) is a variant of the Calculus of Looping Sequences (CLS). While keeping the same expressiveness, CWC strongly simplifies the development of automatic tools for the analysis of biological systems. The main simplification consists in the removal of the sequencing operator, thus lightening the formal treatment of the patterns to be matched in a term (whose complexity in CLS is strongly affected by the variables matching in the sequences).\n  We define a stochastic semantics for this new calculus. As an application we model the interaction between macrophages and apoptotic neutrophils and a mechanism of gene regulation in E.Coli.",
    "authors": [
      "Mario Coppo",
      "Ferruccio Damiani",
      "Maurizio Drocco",
      "Elena Grassi",
      "Angelo Troina"
    ],
    "publication_date": "2010-06-26T03:03:25Z",
    "arxiv_id": "http://arxiv.org/abs/1006.5099v1",
    "download_url": "https://arxiv.org/abs/1006.5099v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Shubin pseudodifferential calculus on asymptotically conic manifolds",
    "abstract": "We present a global pseudodifferential calculus on asymptotically conic manifolds that generalizes (anisotropic versions of) Shubin's classical global pseudodifferential calculus on Euclidean space to this class of noncompact manifolds. Fully elliptic operators are shown to be Fredholm in an associated scale of Sobolev spaces, and to have parametrices in the calculus.",
    "authors": [
      "Thomas Krainer"
    ],
    "publication_date": "2024-08-15T14:03:54Z",
    "arxiv_id": "http://arxiv.org/abs/2408.08169v2",
    "download_url": "https://arxiv.org/abs/2408.08169v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On graphic lambda calculus and the dual of the graphic beta move",
    "abstract": "This is a short description of graphic lambda calculus, with special emphasis on a duality suggested by the two different appearances of knot diagrams, in lambda calculus and emergent algebra sectors of the graphic lambda calculus respectively. This duality leads to the introduction of the dual of the graphic beta move. While the graphic beta move corresponds to beta reduction in untyped lambda calculus, the dual graphic beta move appears in relation to emergent algebras.",
    "authors": [
      "Marius Buliga"
    ],
    "publication_date": "2013-02-04T17:57:05Z",
    "arxiv_id": "http://arxiv.org/abs/1302.0778v1",
    "download_url": "https://arxiv.org/abs/1302.0778v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Introduction to $\\mathcal{A}$-Calculus",
    "abstract": "Let $\\mathcal{A}$ denote a real, $n$-dimensional, unital, associative algebra.This paper provides an introductory exposition of calculus over $\\mathcal{A}$. An $\\mathcal{A}$-differentiable function is one for which the differential is right-$\\mathcal{A}$-linear. We discuss the basis-dependent correspondence between right-$\\mathcal{A}$-linear maps and the regular representation of real matrices in detail. The requirement that the Jacobian matrix of a function fall in the regular representation of $\\mathcal{A}$ gives $n^2-n$ generalized $\\mathcal{A}$-CR equations. In contrast, some authors use a deleted-difference quotient to describe differentiability over an algebra. We compare these concepts of differentiability over an algebra and prove they are equivalent in the semisimple commutative case. We also show how difference quotients are ill-equipt to study calculus over a nilpotent algebra. The Wirtinger calculus is shown to generalize. We find the $\\mathcal{A}$-CReqns are equivalent to the condition that the partial derivatives in all $n-1$ conjugate variables vanish. Our construction modifies that given by Alvarez-Parrilla, Frías-Armenta, López-González and Yee-Romero in a 2012 paper. We also discuss how this conjugate technology gives us a method to convert real PDEs into differential equations over $\\mathcal{A}$. Following Wagner, we show how Generalized Laplace equations are naturally seen from the multiplication table of an algebra. Taylor's Theorem and a Tableau for $\\mathcal{A}$-differentiable function are derived. We prove many of the usual theorems of integral calculus including Cauchy's Integral Theorem for $\\mathcal{A}$ and the Fundamental Theorems of Calculus part I and II. Certainly we do not claim originality in some of what we present, however, we hope this paper adds something useful to the existing literature.",
    "authors": [
      "James S. Cook"
    ],
    "publication_date": "2017-08-04T06:59:00Z",
    "arxiv_id": "http://arxiv.org/abs/1708.04135v1",
    "download_url": "https://arxiv.org/abs/1708.04135v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A calculus for flow categories",
    "abstract": "We describe a calculus of moves for modifying a framed flow category without changing the associated stable homotopy type. We use this calculus to show that if two framed flow categories give rise to the same stable homotopy type of homological width at most three, then the flow categories are move equivalent. The process we describe is essentially algorithmic and can often be performed by hand, without the aid of a computer program.",
    "authors": [
      "Andrew Lobb",
      "Patrick Orson",
      "Dirk Schuetz"
    ],
    "publication_date": "2017-10-04T20:45:36Z",
    "arxiv_id": "http://arxiv.org/abs/1710.01798v2",
    "download_url": "https://arxiv.org/abs/1710.01798v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The localization of orthogonal calculus with respect to homology",
    "abstract": "For a set of maps of based spaces $S$ we construct a version of Weiss' orthogonal calculus which depends only on the $S$-local homotopy type of the functor involved. We show that $S$-local homogeneous functors of degree $n$ are equivalent to levelwise $S$-local spectra with an action of the orthogonal group $O(n)$ via a zigzag of Quillen equivalences between appropriate model categories. Our theory specialises to homological localizations and nullifications at a based space. We give a variety of applications including a reformulation of the Telescope Conjecture in terms of our local orthogonal calculus and a calculus version of Postnikov sections. Our results also apply when considering the orthogonal calculus for functors which take values in spectra.",
    "authors": [
      "Niall Taggart"
    ],
    "publication_date": "2021-09-28T15:34:24Z",
    "arxiv_id": "http://arxiv.org/abs/2109.13806v3",
    "download_url": "https://arxiv.org/abs/2109.13806v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Bi-nested Calculus for Intuitionistic K: Proofs and Countermodels",
    "abstract": "The logic IK is the intuitionistic variant of modal logic introduced by Fischer Servi, Plotkin and Stirling, and studied by Simpson. This logic is considered a fundamental intuitionstic modal system as it corresponds, modulo the standard translation, to a fragment of intuitionstic first-order logic. In this paper we present a labelled-free bi-nested sequent calculus for IK. This proof system comprises two kinds of nesting, corresponding to the two relations of bi-relational models for IK: a pre-order relation, from intuitionistic models, and a binary relation, akin to the accessibility relation of Kripke models. The calculus provides a decision procedure for IK by means of a suitable proof-search strategy. This is the first labelled-free calculus for IK which allows direct counter-model extraction: from a single failed derivation, it is possible to construct a finite countermodel for the formula at the root. We further show the bi-nested calculus can simulate both the (standard) nested calculus and labelled sequent calculus, which are two best known calculi proposed in the literature for IK.",
    "authors": [
      "Han Gao",
      "Marianna Girlando",
      "Nicola Olivetti"
    ],
    "publication_date": "2025-05-13T08:45:12Z",
    "arxiv_id": "http://arxiv.org/abs/2505.08347v1",
    "download_url": "https://arxiv.org/abs/2505.08347v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geometric calculus on pseudo-Riemannian manifolds",
    "abstract": "This article provides a pedagogically oriented introduction to geometric (Clifford) calculus on pseudo-Riemannian manifolds. Unlike usual approaches to the topic, which rely on embedding the geometric algebra either within a tensor algebra or within a vector manifold framework, here we define geometric calculus directly, by elementary methods. In particular we use an axiomatic approach that directly parallels textbook introductions to general relativity and pseudo-Riemannian geometry, so that no structure outside the metrical Clifford bundle of the manifold need be introduced. On this basis we develop the full theory of differential calculus for vector, multivector, and tensor fields.",
    "authors": [
      "Joseph C. Schindler"
    ],
    "publication_date": "2019-11-17T03:41:17Z",
    "arxiv_id": "http://arxiv.org/abs/1911.07145v5",
    "download_url": "https://arxiv.org/abs/1911.07145v5",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Decision Calculus for Belief Functions in Valuation-Based Systems",
    "abstract": "Valuation-based system (VBS) provides a general framework for representing knowledge and drawing inferences under uncertainty.  Recent studies have shown that the semantics of VBS can represent and solve Bayesian decision problems (Shenoy, 1991a).  The purpose of this paper is to propose a decision calculus for Dempster-Shafer (D-S) theory in the framework of VBS.  The proposed calculus uses a weighting factor whose role is similar to the probabilistic interpretation of an assumption that disambiguates decision problems represented with belief functions (Strat 1990).  It will be shown that with the presented calculus, if the decision problems are represented in the valuation network properly, we can solve the problems by using fusion algorithm (Shenoy 1991a).  It will also be shown the presented decision calculus can be reduced to the calculus for Bayesian probability theory when probabilities, instead of belief functions, are given.",
    "authors": [
      "Hong Xu"
    ],
    "publication_date": "2013-03-13T12:56:10Z",
    "arxiv_id": "http://arxiv.org/abs/1303.5439v1",
    "download_url": "https://arxiv.org/abs/1303.5439v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inductive types in the Calculus of Algebraic Constructions",
    "abstract": "In a previous work, we proved that an important part of the Calculus of Inductive Constructions (CIC), the basis of the Coq proof assistant, can be seen as a Calculus of Algebraic Constructions (CAC), an extension of the Calculus of Constructions with functions and predicates defined by higher-order rewrite rules. In this paper, we prove that almost all CIC can be seen as a CAC, and that it can be further extended with non-strictly positive types and inductive-recursive types together with non-free constructors and pattern-matching on defined symbols.",
    "authors": [
      "Frédéric Blanqui"
    ],
    "publication_date": "2006-10-12T11:48:39Z",
    "arxiv_id": "http://arxiv.org/abs/cs/0610073v1",
    "download_url": "https://arxiv.org/abs/cs/0610073v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Functors of Differential Calculus in Diolic Algebras",
    "abstract": "We pose a new algebraic formalism for studying differential calculus in vector bundles. This is achieved by studying various functors of differential calculus over arbitrary graded commutative algebras (DCGCA) and applying this language to a particularly simple class of two-component graded objects introduced in this work, that we call Diolic algebras. A salient feature of this conceptual approach to calculus is that it recovers many well-known objects and notions from ordinary differential, symplectic and Poisson geometry but also provides some unique aspects, which are of their own independent interest.",
    "authors": [
      "Jacob Kryczka"
    ],
    "publication_date": "2020-09-08T23:08:47Z",
    "arxiv_id": "http://arxiv.org/abs/2009.04024v1",
    "download_url": "https://arxiv.org/abs/2009.04024v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Variation of Area Variables in Regge Calculus",
    "abstract": "We consider the possibility to use the areas of two-simplexes, instead of lengths of edges, as the dynamical variables of Regge calculus. We show that if the action of Regge calculus is varied with respect to the areas of two-simplexes, and appropriate constraints are imposed between the variations, the Einstein-Regge equations are recovered.",
    "authors": [
      "Jarmo Makela"
    ],
    "publication_date": "1998-01-09T12:11:21Z",
    "arxiv_id": "http://arxiv.org/abs/gr-qc/9801022v1",
    "download_url": "https://arxiv.org/abs/gr-qc/9801022v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Heisenberg algebra and a graphical calculus",
    "abstract": "A new calculus of planar diagrams involving diagrammatics for biadjoint functors and degenerate affine Hecke algebras is introduced. The calculus leads to an additive monoidal category whose Grothendieck ring contains an integral form of the Heisenberg algebra in infinitely many variables. We construct bases of vector spaces of morphisms between products of generating objects in this category.",
    "authors": [
      "Mikhail Khovanov"
    ],
    "publication_date": "2010-09-16T22:32:04Z",
    "arxiv_id": "http://arxiv.org/abs/1009.3295v1",
    "download_url": "https://arxiv.org/abs/1009.3295v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Calculus for Causal Relevance",
    "abstract": "This paper presents a sound and completecalculus for causal relevance, based onPearl's functional models semantics.The calculus consists of axioms and rulesof inference for reasoning about causalrelevance  relationships.We extend the set of known axioms for causalrelevance with three new axioms, andintroduce two new rules of inference forreasoning about specific subclasses ofmodels.These subclasses give a more refinedcharacterization of causal models than the one given  in Halpern's axiomatizationof counterfactual reasoning.Finally, we show how the calculus for causalrelevance can be used in the task ofidentifying causal structure from non-observational data.",
    "authors": [
      "Blai Bonet"
    ],
    "publication_date": "2013-01-10T16:22:40Z",
    "arxiv_id": "http://arxiv.org/abs/1301.2257v1",
    "download_url": "https://arxiv.org/abs/1301.2257v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical Development of Incomplete Riemann-Liouville Fractional Calculus",
    "abstract": "The theory of fractional calculus has developed in a number of directions over the years, including: the formulation of multiple different definitions of fractional differintegration; the extension of various properties of standard calculus into the fractional scenario; the application of fractional differintegrals to assorted special functions. Recently, a new variant of fractional calculus has arisen, namely incomplete fractional calculus. In two very recent papers, incomplete versions of the Riemann-Liouville and Caputo fractional differintegrals have been formulated and applied to several important special functions.\n  In the current work, we develop the theory of incomplete fractional calculus in more depth, investigating further properties of the incomplete Riemann-Liouville fractional differintegrals and answering some fundamental questions about these operators. By considering appropriate function spaces, we formulate rigorously the definitions of incomplete Riemann-Liouville fractional integration, and justify how this model may be used to analyse a wider class of functions than classical fractional calculus. By using analytic continuation, we formulate definitions for incomplete Riemann-Liouville fractional differentiation, hence extending the incomplete integrals to a fully-fledged model of fractional calculus.\n  We also investigate and analyse these operators further, in order to prove new properties. These include a Leibniz rule for incomplete differintegrals of products, and composition properties of incomplete differintegrals with classical calculus operations. These are natural and expected issues to investigate in any new model of fractional calculus, and in the incomplete Riemann-Liouville model the results emerge naturally from the definition previously proposed.",
    "authors": [
      "Arran Fernandez",
      "Ceren Ustaoğlu",
      "Mehmet Ali Özarslan"
    ],
    "publication_date": "2019-04-04T14:28:56Z",
    "arxiv_id": "http://arxiv.org/abs/1904.02577v1",
    "download_url": "https://arxiv.org/abs/1904.02577v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Vectorial $λ$-Calculus",
    "abstract": "We describe a type system for the linear-algebraic $λ$-calculus. The type system accounts for the linear-algebraic aspects of this extension of $λ$-calculus: it is able to statically describe the linear combinations of terms that will be obtained when reducing the programs. This gives rise to an original type theory where types, in the same way as terms, can be superposed into linear combinations. We prove that the resulting typed $λ$-calculus is strongly normalising and features weak subject reduction. Finally, we show how to naturally encode matrices and vectors in this typed calculus.",
    "authors": [
      "Pablo Arrighi",
      "Alejandro Díaz-Caro",
      "Benoît Valiron"
    ],
    "publication_date": "2013-08-05T22:53:44Z",
    "arxiv_id": "http://arxiv.org/abs/1308.1138v4",
    "download_url": "https://arxiv.org/abs/1308.1138v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Natural discrete differential calculus in physics",
    "abstract": "We sharpen a recent observation by Tim Maudlin: differential calculus is a natural language for physics only if additional structure, like the definition of a Hodge dual or a metric, is given; but the discrete version of this calculus provides this additional structure for free.",
    "authors": [
      "Carlo Rovelli",
      "Václav Zatloukal"
    ],
    "publication_date": "2019-02-08T11:37:30Z",
    "arxiv_id": "http://arxiv.org/abs/1902.03026v2",
    "download_url": "https://arxiv.org/abs/1902.03026v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pseudodifferential calculus on a singular foliation",
    "abstract": "In a previous paper ([1]), we associated a holonomy groupoid and a C*-algebra to any singular foliation (M,F). Using these, we construct the associated pseudodifferential calculus. This calculus gives meaning to a Laplace operator of any singular foliation F on a compact manifold M, and we show that it can be naturally understood as a positive, unbounded, self-adjoint operator on L2(M).",
    "authors": [
      "Iakovos Androulidakis",
      "Georges Skandalis"
    ],
    "publication_date": "2009-09-07T21:07:59Z",
    "arxiv_id": "http://arxiv.org/abs/0909.1342v3",
    "download_url": "https://arxiv.org/abs/0909.1342v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Differential calculus for free algebra and constrained homology",
    "abstract": "In [Discrete differential calculus on simplicial complexes and constrained homology, Chin. Ann. Math. Ser. B 44(4), 615-640, 2023], the constrained (co)homology for simplicial complexes and independence hypergraphs is constructed via differential calculus on discrete sets. In this paper, we study the differential calculus for free algebra and subsequently study the homomorphisms of constrained (co)homology induced by inclusions of simplicial complexes and independence hypergraphs. We apply the differential calculus to hypergraphs. We realize simplicial complexes and independence hypergraphs as certain invariant traces of hypergraphs. As an application, we give the constrained persistent (co)homology for filtrations of simplicial complexes and filtrations of independence hypergraphs.",
    "authors": [
      "Shiquan Ren"
    ],
    "publication_date": "2023-09-12T09:02:26Z",
    "arxiv_id": "http://arxiv.org/abs/2309.06063v3",
    "download_url": "https://arxiv.org/abs/2309.06063v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Is Leibnizian calculus embeddable in first order logic?",
    "abstract": "To explore the extent of embeddability of Leibnizian infinitesimal calculus in first-order logic (FOL) and modern frameworks, we propose to set aside ontological issues and focus on procedural questions. This would enable an account of Leibnizian procedures in a framework limited to FOL with a small number of additional ingredients such as the relation of infinite proximity. If, as we argue here, first order logic is indeed suitable for developing modern proxies for the inferential moves found in Leibnizian infinitesimal calculus, then modern infinitesimal frameworks are more appropriate to interpreting Leibnizian infinitesimal calculus than modern Weierstrassian ones.\n  Keywords: First order logic; infinitesimal calculus; ontology; procedures; Leibniz; Weierstrass; Abraham Robinson",
    "authors": [
      "Piotr Blaszczyk",
      "Vladimir Kanovei",
      "Karin U. Katz",
      "Mikhail G. Katz",
      "Taras Kudryk",
      "Thomas Mormann",
      "David Sherry"
    ],
    "publication_date": "2016-05-11T16:27:00Z",
    "arxiv_id": "http://arxiv.org/abs/1605.03501v1",
    "download_url": "https://arxiv.org/abs/1605.03501v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Remarks on Föllmer's pathwise Itô calculus",
    "abstract": "We extend some results about Föllmer's pathwise Itô calculus that have only been derived for continuous paths to càdlàg paths with quadratic variation. We study some fundamental properties of pathwise Itô integrals with respect to càdlàg integrators, especially associativity and the integration by parts formula. Moreover, we study integral equations with respect to pathwise Itô integrals. We prove that some classes of integral equations, which can be explicitly solved in the usual stochastic calculus, can also be solved within the framework of Föllmer's calculus.",
    "authors": [
      "Yuki Hirai"
    ],
    "publication_date": "2017-10-16T07:17:37Z",
    "arxiv_id": "http://arxiv.org/abs/1710.05541v1",
    "download_url": "https://arxiv.org/abs/1710.05541v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]