[
  {
    "title": "The Largest Subsemilattices of the Endomorphism Monoid of an Independence Algebra",
    "abstract": "An algebra $\\A$ is said to be an independence algebra if it is a matroid algebra and every map $\\al:X\\to A$, defined on a basis $X$ of $\\A$, can be extended to an endomorphism of $\\A$. These algebras are particularly well behaved generalizations of vector spaces, and hence they naturally appear in several branches of mathematics such as model theory, group theory, and semigroup theory.\n  It is well known that matroid algebras have a well defined notion of dimension. Let $\\A$ be any independence algebra of finite dimension $n$, with at least two elements. Denote by $\\End(\\A)$ the monoid of endomorphisms of $\\A$. We prove that a largest subsemilattice of $\\End(\\A)$ has either $2^{n-1}$ elements (if the clone of $\\A$ does not contain any constant operations) or $2^n$ elements (if the clone of $\\A$ contains constant operations). As corollaries, we obtain formulas for the size of the largest subsemilattices of: some variants of the monoid of linear operators of a finite-dimensional vector space, the monoid of full transformations on a finite set $X$, the monoid of partial transformations on $X$, the monoid of endomorphisms of a free $G$-set with a finite set of free generators, among others.\n  The paper ends with a relatively large number of problems that might attract attention of experts in linear algebra, ring theory, extremal combinatorics, group theory, semigroup theory, universal algebraic geometry, and universal algebra.",
    "authors": [
      "João Araújo",
      "Wolfram Bentz",
      "Janusz Konieczny"
    ],
    "publication_date": "2014-05-28T14:36:05Z",
    "arxiv_id": "http://arxiv.org/abs/1405.7260v1",
    "download_url": "https://arxiv.org/abs/1405.7260v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Local Weyl modules for equivariant map algebras with free abelian group actions",
    "abstract": "Suppose a finite group acts on a scheme X and a finite-dimensional Lie algebra g. The associated equivariant map algebra is the Lie algebra of equivariant regular maps from X to g. Examples include generalized current algebras and (twisted) multiloop algebras. Local Weyl modules play an important role in the theory of finite-dimensional representations of loop algebras and quantum affine algebras. In the current paper, we extend the definition of local Weyl modules (previously defined only for generalized current algebras and twisted loop algebras) to the setting of equivariant map algebras where g is semisimple, X is affine of finite type, and the group is abelian and acts freely on X. We do so by defining twisting and untwisting functors, which are isomorphisms between certain categories of representations of equivariant map algebras and their untwisted analogues. We also show that other properties of local Weyl modules (e.g. their characterization by homological properties and a tensor product property) extend to the more general setting considered in the current paper.",
    "authors": [
      "Ghislain Fourier",
      "Tanusree Khandai",
      "Deniz Kus",
      "Alistair Savage"
    ],
    "publication_date": "2011-03-29T20:19:06Z",
    "arxiv_id": "http://arxiv.org/abs/1103.5766v2",
    "download_url": "https://arxiv.org/abs/1103.5766v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "BC_N-graded Lie algebras arising from fermionic representations",
    "abstract": "We use fermionic representations to obtain a class of BC$_{{}_{\\text N}}$-graded Lie algebras coordinatized by quantum tori with nontrivial central extensions.",
    "authors": [
      "Hongjia Chen",
      "Yun Gao"
    ],
    "publication_date": "2006-01-12T12:59:45Z",
    "arxiv_id": "http://arxiv.org/abs/math/0601284v1",
    "download_url": "https://arxiv.org/abs/math/0601284v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twisted vertex algebras, bicharacter construction and boson-fermion correspondences",
    "abstract": "The boson-fermion correspondences are an important phenomena on the intersection of several areas in mathematical physics: representation theory, vertex algebras and conformal field theory, integrable systems, number theory, cohomology. Two such correspondences are well known: the types A and B (and their super extensions). As a main result of this paper we present a new boson-fermion correspondence, of type D-A. Further, we define a new concept of twisted vertex algebra of order $N$, which generalizes super vertex algebra. We develop the bicharacter construction which we use for constructing classes of examples of twisted vertex algebras, as well as for deriving formulas for the operator product expansions (OPEs), analytic continuations and normal ordered products. By using the underlying Hopf algebra structure we prove general bicharacter formulas for the vacuum expectation values for three important groups of examples. We show that the correspondences of type B, C and D-A are isomorphisms of twisted vertex algebras.",
    "authors": [
      "Iana I. Anguelova"
    ],
    "publication_date": "2012-06-18T19:32:03Z",
    "arxiv_id": "http://arxiv.org/abs/1206.4026v3",
    "download_url": "https://arxiv.org/abs/1206.4026v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On semisimple Hopf algebras of dimension $2q^3$",
    "abstract": "Let $q$ be a prime number, $k$ an algebraically closed field of characteristic 0, and $H$ a semisimple Hopf algebra of dimension $2q^3$. This paper proves that $H$ is always semisolvable. That is, such Hopf algebras can be obtained by (a number of) extensions from group algebras or duals of group algebras.",
    "authors": [
      "Jingcheng Dong",
      "Shuanhong Wang"
    ],
    "publication_date": "2011-10-11T05:33:44Z",
    "arxiv_id": "http://arxiv.org/abs/1110.2273v2",
    "download_url": "https://arxiv.org/abs/1110.2273v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fixed rings of quantum generalized Weyl algebras",
    "abstract": "Generalized Weyl Algebras (GWAs) appear in diverse areas of mathematics including mathematical physics, noncommutative algebra, and representation theory. We study the invariants of quantum GWAs under finite automorphisms. We extend a theorem of Jordan and Wells and apply it to determine the fixed ring of quantum GWAs under diagonal automorphisms. We further study properties of the fixed rings, including global dimension, rigidity, and simplicity.",
    "authors": [
      "Jason Gaddis",
      "Phuong Ho"
    ],
    "publication_date": "2019-10-15T15:09:20Z",
    "arxiv_id": "http://arxiv.org/abs/1910.06847v2",
    "download_url": "https://arxiv.org/abs/1910.06847v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pinching Azumaya algebras",
    "abstract": "We show, that for a morphism of schemes from X to Y, that is a finite modification in finitely many closed points, a cohomological Brauer class on Y is represented by an Azumaya algebra if its pullback to X is represented by an Azumaya algebra. Part of the proof uses an extension of a result by Ferrand, on pinching of finite locally free sheaves, to Azumaya algebras.",
    "authors": [
      "Johannes Fischer"
    ],
    "publication_date": "2022-07-13T16:59:50Z",
    "arxiv_id": "http://arxiv.org/abs/2207.06344v2",
    "download_url": "https://arxiv.org/abs/2207.06344v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Triality, Structurable and Pre-structurable Algebras",
    "abstract": "We introduce a notion of Pre-structurable Algebras based upon triality relations and study its relation to structurable algebra of Allison, as well as to Lie algebras satisfying triality.",
    "authors": [
      "Noriaki Kamiya",
      "Susumu Okubo"
    ],
    "publication_date": "2013-10-09T18:23:26Z",
    "arxiv_id": "http://arxiv.org/abs/1310.2568v1",
    "download_url": "https://arxiv.org/abs/1310.2568v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dominant dimensions of two classes of finite dimensional algebras",
    "abstract": "The aim of this paper is to study the dominant dimension of two important classes of finite dimensional algebras, namely, hereditary algebras and tree algebras. We derive an explicit formula for the dominant dimension of each class.",
    "authors": [
      "Muhammad Abrar"
    ],
    "publication_date": "2012-09-04T08:21:11Z",
    "arxiv_id": "http://arxiv.org/abs/1209.0562v1",
    "download_url": "https://arxiv.org/abs/1209.0562v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On q-Deformations of Clifford Algebras",
    "abstract": "Several Clifford algebras that are covariant under the action of a Lie algebra $g$ can be deformed in a way consistent with the deformation of $Ug$ into a quantum group (or into a triangular Hopf algebra) $U_qg$, i.e. so as to remain covariant under the action of $U_qg$. In this report, after recalling these facts, we review our results regarding the formal realization of the elements of such ``q-deformed'' Clifford algebras as ``functions'' (polynomials) in the generators of the undeformed ones; in particular, the intruiging interplay between the original and the q-deformed symmetry. Finally, we briefly illustrate their dramatic consequences on the representation theories of the original and of the q-deformed Clifford algebra, and mention how these results could turn out to be useful in quantum physics.",
    "authors": [
      "Gaetano Fiore"
    ],
    "publication_date": "2000-02-23T21:59:32Z",
    "arxiv_id": "http://arxiv.org/abs/math/0002194v2",
    "download_url": "https://arxiv.org/abs/math/0002194v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On homogeneous locally nilpotent derivations of trinomial algebras",
    "abstract": "We provide an explicit description of homogeneous locally nilpotent derivations of the algebra of regular functions on affine trinomial hypersurfaces. As an application, we describe the set of roots of trinomial algebras.",
    "authors": [
      "Sergey Gaifullin",
      "Yulia Zaitseva"
    ],
    "publication_date": "2018-10-28T17:22:36Z",
    "arxiv_id": "http://arxiv.org/abs/1810.11839v1",
    "download_url": "https://arxiv.org/abs/1810.11839v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Braided Hopf algebras from twisting",
    "abstract": "We show that a class of braided Hopf algebras, which includes the braided $SU_q(2)$ is obtained by twisting. We show further examples and demonstrate that twisting of bicovariant differential calculi gives braided bicovariant differential calculi.",
    "authors": [
      "Arkadiusz Bochniak",
      "Andrzej Sitarz"
    ],
    "publication_date": "2017-01-04T18:44:52Z",
    "arxiv_id": "http://arxiv.org/abs/1701.01106v2",
    "download_url": "https://arxiv.org/abs/1701.01106v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Symmetries of various sets of polynomials",
    "abstract": "Let $K$ be a field of characteristic $0$, and let $k \\geq 2$ be an integer. We prove that every $K$-linear bijection $f \\colon K[X] \\to K[X]$ strongly preserving the set of $k$-free polynomials (or the set of polynomials with a $k$-fold root in $K$) is a constant multiple of a $K$-algebra automorphism of $K[X]$, i.e., that there are elements $a, c \\in K^{\\times}$ and $b \\in K$ such that $f(P)(X) = c P(a X + b)$. When $K$ is a number field or $K=\\mathbb R$, we prove that similar statements hold when $f$ preserves the set of polynomials with a root in $K$.",
    "authors": [
      "Béranger Seguin"
    ],
    "publication_date": "2024-07-12T09:33:58Z",
    "arxiv_id": "http://arxiv.org/abs/2407.09118v3",
    "download_url": "https://arxiv.org/abs/2407.09118v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Poincaré series, exponents of affine Lie algebras, and McKay-Slodowy correspondence",
    "abstract": "Let $N$ be a normal subgroup of a finite group $G$ and $V$ be a fixed finite-dimensional $G$-module. The Poincaré series for the multiplicities of induced modules and restriction modules in the tensor algebra $T(V)=\\oplus_{k \\geq 0}V^{\\otimes k}$ are studied in connection with the McKay-Slodowy correspondence. In particular, it is shown that the closed formulas for the Poincaré series associated with the distinguished pairs of subgroups of $\\mathrm{SU}_2$ give rise to the exponents of all untwisted and twisted affine Lie algebras except ${\\rm A}_{2n}^{(1)}$.",
    "authors": [
      "Naihuan Jing",
      "Danxia Wang",
      "Honglian Zhang"
    ],
    "publication_date": "2018-11-29T01:03:18Z",
    "arxiv_id": "http://arxiv.org/abs/1811.11901v1",
    "download_url": "https://arxiv.org/abs/1811.11901v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nearly Commuting Matrices",
    "abstract": "We prove that the algebraic set of pairs of matrices with a diagonal commutator over a field of positive prime characteristic, its irreducible components, and their intersection are $F$-pure when the size of matrices is equal to 3. Furthermore, we show that this algebraic set is reduced and the intersection of its irreducible components is irreducible in any characteristic for pairs of matrices of any size. In addition, we discuss various conjectures on the singularities of these algebraic sets and the system of parameters on the corresponding coordinate rings.",
    "authors": [
      "Zhibek Kadyrsizova"
    ],
    "publication_date": "2017-05-31T06:52:47Z",
    "arxiv_id": "http://arxiv.org/abs/1705.10957v2",
    "download_url": "https://arxiv.org/abs/1705.10957v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Cores in Yetter-Drinfel'd Hopf Algebras",
    "abstract": "By constructing explicit examples, we show that the core of a group-like element in a cocommutative cosemisimple Yetter-Drinfel'd Hopf algebra over the group ring of a finite abelian group is not always completely trivial.",
    "authors": [
      "Yevgenia Kashina",
      "Yorck Sommerhaeuser"
    ],
    "publication_date": "2019-08-20T21:39:59Z",
    "arxiv_id": "http://arxiv.org/abs/1908.07620v1",
    "download_url": "https://arxiv.org/abs/1908.07620v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Character Amenability of Banach Algebras",
    "abstract": "Associated to a nonzero homomorphism $\\varphi$ of a Banach algebra $A$, we regard special functionals, say $m_\\varphi$, on certain subspaces of $A^\\ast$ which provide equivalent statements to the existence of a bounded right approximate identity in the corresponding maximal ideal in $A$. For instance, applying a fixed point theorem yields an equivalent statement to the existence of a $m_\\varphi$ on $A^\\ast$; and, in addition we expatiate the case that if a functional $m_\\varphi$ is unique, then $m_\\varphi$ belongs to the topological center of the bidual algebra $A^{\\ast\\ast}$. An example of a function algebra, surprisingly, contradicts a conjecture that a Banach algebra $A$ is amenable if $A$ is $\\varphi$-amenable in every character $\\varphi$ and if functionals $m_\\varphi$ associated to the characters $\\varphi$ are uniformly bounded. Aforementioned are also elaborated on the direct sum of two given Banach algebras.",
    "authors": [
      "Ahmadreza Azimifard"
    ],
    "publication_date": "2007-12-13T00:32:48Z",
    "arxiv_id": "http://arxiv.org/abs/0712.2072v2",
    "download_url": "https://arxiv.org/abs/0712.2072v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Derived invariants for surface algebras",
    "abstract": "In this paper we study the derived equivalences between surface algebras, introduced by David-Roesler and Schiffler. Each surface algebra arises from a cut of an ideal triangulation of an unpunctured marked Riemann surface with boundary. A cut can be regarded as a grading on the Jacobian algebra of the quiver with potential (Q,W) associated with the triangulation.\n  Fixing a set $ε$ of generators of the fundamental group of the surface, we associate to any cut $d$ a weight $w^ε(d)\\in\\mathbb Z^{2g+b}$, where $g$ is the genus of $S$ and $b$ the number of boundary components. The main result of the paper asserts that the derived equivalence class of the surface algebra is determined by the corresponding weight $w^ε(d)$ up to homeomorphism of the surface. Surface algebras are gentle and of global dimension $\\leq 2$, and any surface algebras coming from the same surface $(S,M)$ are cluster equivalent, in the sense of Amiot and Oppermann. To prove that the weight is a derived invariant we strongly use Amiot Oppermann's results on cluster equivalent algebras.\n  Furthermore we also show that for surface algebras the invariant defined for gentle algebras by Avella-Alaminos and Geiss, is determined by the weight.",
    "authors": [
      "Claire Amiot",
      "Yvonne Grimeland"
    ],
    "publication_date": "2014-11-03T07:41:26Z",
    "arxiv_id": "http://arxiv.org/abs/1411.0383v2",
    "download_url": "https://arxiv.org/abs/1411.0383v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the tensor product of two oriented quantum algebras",
    "abstract": "In this paper, we give the oriented quantum algebra (abbr. OQA) structures on the tensor product of two different OQAs by using Chen's weak $\\mathfrak{R}$-matrix in [J. Algebra 204(1998):504-531]. As a special case, the OQA structures on the tensor product of an OQA with itself are provided, which are different from Radford's results in [J. Knot Theory Ramifications 16(2007):929-957].",
    "authors": [
      "Tianshui Ma",
      "Haiyang Yang",
      "Tao Yang"
    ],
    "publication_date": "2021-10-31T01:09:13Z",
    "arxiv_id": "http://arxiv.org/abs/2111.00370v1",
    "download_url": "https://arxiv.org/abs/2111.00370v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rings of differential operators as enveloping algebras of Hasse--Schmidt derivations",
    "abstract": "Let $k$ be a commutative ring and $A$ a commutative $k$-algebra. In this paper we introduce the notion of enveloping algebra of Hasse--Schmidt derivations of $A$ over $k$ and we prove that, under suitable smoothness hypotheses, the canonical map from the above enveloping algebra to the ring of differential operators $\\mathcal{D}_{A/k}$ is an isomorphism. This result generalizes the characteristic 0 case in which the ring $\\mathcal{D}_{A/k}$ appears as the enveloping algebra of the Lie-Rinehart algebra of the usual $k$-derivations of $A$ provided that $A$ is smooth over $k$.",
    "authors": [
      "L. Narváez-Macarro"
    ],
    "publication_date": "2018-07-26T15:24:05Z",
    "arxiv_id": "http://arxiv.org/abs/1807.10193v3",
    "download_url": "https://arxiv.org/abs/1807.10193v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twisted Frobenius-Schur indicators for Hopf algebras",
    "abstract": "The classical Frobenius-Schur indicators for finite groups are character sums defined for any representation and any integer m greater or equal to 2. In the familiar case m=2, the Frobenius-Schur indicator partitions the irreducible representations over the complex numbers into real, complex, and quaternionic representations. In recent years, several generalizations of these invariants have been introduced. Bump and Ginzburg, building on earlier work of Mackey, have defined versions of these indicators which are twisted by an automorphism of the group. In another direction, Linchenko and Montgomery have defined Frobenius-Schur indicators for semisimple Hopf algebras. In this paper, the authors construct twisted Frobenius-Schur indicators for semisimple Hopf algebras; these include all of the above indicators as special cases and have similar properties.",
    "authors": [
      "Daniel S. Sage",
      "Maria D. Vega"
    ],
    "publication_date": "2011-07-04T20:47:30Z",
    "arxiv_id": "http://arxiv.org/abs/1107.0742v2",
    "download_url": "https://arxiv.org/abs/1107.0742v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum symmetric functions",
    "abstract": "We study quantum deformations of Poisson orbivarieties. Given a Poisson manifold $(\\mathbb{R}^{m},α)$ we consider the Poisson orbivariety $(\\mathbb{R}^{m})^{n}/S_{n}$. The Kontsevich star product on functions on $(\\mathbb{R}^{m})^{n}$ induces a star product on functions on $(\\mathbb{R}^{m})^{n}/S_{n}$. We provide explicit formulae for the case ${{\\mathfrak h} \\times {\\mathfrak h}}/\\mathcal{W}$, where ${\\mathfrak h}$ is the Cartan subalgebra of a classical Lie algebra ${\\mathfrak g}$ and $\\mathcal{W}$ is the Weyl group of ${\\mathfrak h}$. We approach our problem from a fairly general point of view, introducing Polya functors for categories over non-symmetric Hopf operads.",
    "authors": [
      "Rafael Diaz",
      "Eddy Pariguan"
    ],
    "publication_date": "2003-12-29T22:36:44Z",
    "arxiv_id": "http://arxiv.org/abs/math/0312494v3",
    "download_url": "https://arxiv.org/abs/math/0312494v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extending the idea of compressed algebra to arbitrary socle-vectors",
    "abstract": "Fix a codimension $r$ and a socle-vector $s$. Is there an (entry by entry) maximal $h$-vector $h$ among the $h$-vectors of all the (standard graded artinian) algebras having data $(r,s)$? Extending a definition of Iarrobino, if such an $h$ exists, we define as {\\it generalized compressed} (GCA, in brief) any algebra having the data $(r,s,h)$. The two main results of this paper are: Theorem A, where we supply a very natural upper-bound $H$ for all the $h$-vectors possible for a given pair $(r,s)$; Theorem B, which asserts that, under certain conditions on the pair $(r,s)$, the upper-bound $H$ of Theorem A is actually achieved by a GCA. In particular, it follows that, when $r=2$, there always exists a GCA (having $h$-vector $H$). Moreover, we show that, in general, the hypotheses of Theorem B cannot be improved, i.e., under weaker conditions on the pair $(r,s)$, the upper-bound $H$ above is not always achieved.",
    "authors": [
      "Fabrizio Zanello"
    ],
    "publication_date": "2004-11-24T21:26:01Z",
    "arxiv_id": "http://arxiv.org/abs/math/0411562v1",
    "download_url": "https://arxiv.org/abs/math/0411562v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Decomposing modular tensor products, and periodicity of `Jordan partitions'",
    "abstract": "Let $J_r$ denote an $r\\times r$ matrix over a finite field $F$ with minimal and characteristic polynomials $(t-1)^r$. Suppose $r\\leq s$. It is not hard to show that the Jordan canonical form of $J_r\\otimes J_s$ is similar to $J_{λ_1}\\oplus\\cdots\\oplus J_{λ_r}$ where $λ_1\\geq\\cdots\\geqλ_r>0$ and $\\sum_{i=1}^rλ_i=rs$. The partition $λ(r,s,p):=(λ_1,\\dots,λ_r)$ of $rs$, which depends only on $r,s$ and the characteristic $p$ of $F$, has many applications including to the study of algebraic groups. We prove new periodicity and duality results for $λ(r,s,p)$ that depend on the smallest $p$-power exceeding $r$. This generalizes results of J. A. Green, B. Srinivasan, and others which depend on the smallest $p$-power exceeding the (potentially large) integer $s$. We show that for fixed $r$ we can construct a finite table allowing the computation of $λ(r,s,p)$ for all $s$ with $s\\geq r$, and all primes $p$. This generalizes work of K-i. Iima and R. Iwamatsu.",
    "authors": [
      "S. P. Glasby",
      "Cheryl E. Praeger",
      "Binzhou Xia"
    ],
    "publication_date": "2014-01-13T08:34:56Z",
    "arxiv_id": "http://arxiv.org/abs/1401.2748v3",
    "download_url": "https://arxiv.org/abs/1401.2748v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Relations of multiple zeta values and their algebraic expression",
    "abstract": "We establish a new class of relations among the multiple zeta values ζ(k_1,k_2,...,k_n), which we call the cyclic sum identities. These identities have an elementary proof, and imply the \"sum theorem\" for multiple zeta values. They also have a succinct statement in terms of \"cyclic derivations\" as introduced by Rota, Sagan and Stein. In addition, we discuss the expression of other relations of multiple zeta values via the shuffle and \"harmonic\" products on the underlying vector space H of the noncommutative polynomial ring Q<x,y>, and also using an action on Q<x,y> of the Hopf algebra of quasi-symmetric functions.",
    "authors": [
      "Michael E. Hoffman",
      "Yasuo Ohno"
    ],
    "publication_date": "2000-10-13T19:11:32Z",
    "arxiv_id": "http://arxiv.org/abs/math/0010140v1",
    "download_url": "https://arxiv.org/abs/math/0010140v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spectral-parameter dependent Yang-Baxter operators and Yang-Baxter systems from algebra structures",
    "abstract": "For any algebra two families of coloured Yang-Baxter operators are constructed, thus producing solutions to the two-parameter quantum Yang-Baxter equation. An open problem about a system of functional equations is stated. The matrix forms of these operators for two and three dimensional algebras are computed. A FRT bialgebra for one of these families is presented. Solutions for the one-parameter quantum Yang-Baxter equation are derived and a Yang-Baxter system constructed.",
    "authors": [
      "Florin F. Nichita",
      "Deepak Parashar"
    ],
    "publication_date": "2006-07-27T13:23:07Z",
    "arxiv_id": "http://arxiv.org/abs/math/0607710v1",
    "download_url": "https://arxiv.org/abs/math/0607710v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Jordan Trialgebras and Post-Jordan Algebras",
    "abstract": "We compute minimal sets of generators for the S_n-modules (n <= 4) of multilinear polynomial identities of arity n satisfied by the Jordan product and the Jordan diproduct (resp. pre-Jordan product) in every triassociative (resp. tridendriform) algebra. These identities define Jordan trialgebras and post-Jordan algebras: Jordan analogues of the Lie trialgebras and post-Lie algebras introduced by Dotsenko et al., Pei et al., Vallette & Loday. We include an extensive review of analogous structures existing in the literature, and their interrelations, in order to identify the gaps filled by our two new varieties of algebras. We use computer algebra (linear algebra over finite fields, representation theory of symmetric groups), to verify in both cases that every polynomial identity of arity <= 6 is a consequence of those of arity <= 4. We conjecture that in both cases the next independent identities have arity 8, imitating the Glennie identities for Jordan algebras. We formulate our results as a commutative square of operad morphisms, which leads to the conjecture that the squares in a much more general class are also commutative.",
    "authors": [
      "Fatemeh Bagherzadeh",
      "Murray Bremner",
      "Sara Madariaga"
    ],
    "publication_date": "2016-11-03T22:40:58Z",
    "arxiv_id": "http://arxiv.org/abs/1611.01214v1",
    "download_url": "https://arxiv.org/abs/1611.01214v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On locally complex algebras and low-dimensional Cayley-Dickson algebras",
    "abstract": "The paper begins with short proofs of classical theorems by Frobenius and (resp.) Zorn on associative and (resp.) alternative real division algebras. These theorems characterize the first three (resp. four) Cayley-Dickson algebras. Then we introduce and study the class of real unital nonassociative algebras in which the subalgebra generated by any nonscalar element is isomorphic to C. We call them locally complex algebras. In particular, we describe all such algebras that have dimension at most 4. Our main motivation, however, for introducing locally complex algebras is that this concept makes it possible for us to extend Frobenius' and Zorn's theorems in a way that it also involves the fifth Cayley-Dickson algebra, the sedenions.",
    "authors": [
      "Matej Bresar",
      "Peter Semrl",
      "Spela Spenko"
    ],
    "publication_date": "2010-10-11T16:53:15Z",
    "arxiv_id": "http://arxiv.org/abs/1010.2156v2",
    "download_url": "https://arxiv.org/abs/1010.2156v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extensions of the tensor algebra and their applications",
    "abstract": "This article presents a natural extension of the tensor algebra. In addition to \"left multiplications\" by vectors, we can consider \"derivations\" by covectors as basic operators on this extended algebra. These two types of operators satisfy an analogue of the canonical commutation relations. This algebra and these operators have some applications: (i) applications to invariant theory related to tensor products, and (ii) applications to immanants. The latter one includes a new method to study the quantum immanants in the universal enveloping algebras of the general linear Lie algebras and their Capelli type identities (the higher Capelli identities).",
    "authors": [
      "Minoru Itoh"
    ],
    "publication_date": "2009-09-30T11:57:21Z",
    "arxiv_id": "http://arxiv.org/abs/0909.5586v4",
    "download_url": "https://arxiv.org/abs/0909.5586v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Homological criteria for minimal multiplicity",
    "abstract": "Lower bounds on Hilbert-Samuel multiplicity are known for several types of commutative noetherian local rings, and rings with multiplicities which achieve these lower bounds are said to have minimal multiplicity. The first part of this paper gives characterizations of rings of minimal multiplicity in terms of the Ext-algebra of the ring; in particular, we show that minimal multiplicity can be detected via an Ext-algebra which is Gorenstein or Koszul AS-regular. The second part of this paper characterizes rings of minimal multiplicity via a numerical homological invariant introduced by J. Herzog and S. B. Iyengar called linearity defect. Our characterizations allow us to answer in two special cases a question raised by Herzog and Iyengar.",
    "authors": [
      "John Myers"
    ],
    "publication_date": "2018-03-14T18:03:18Z",
    "arxiv_id": "http://arxiv.org/abs/1803.05454v2",
    "download_url": "https://arxiv.org/abs/1803.05454v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quaternionic matrices: Unitary similarity, simultaneous triangularization and some trace identities",
    "abstract": "We construct six unitary trace invariants for 2 by 2 quaternionic matrices which separate the unitary similarity classes of such matrices, and show that this set is minimal. We prove two quaternionic versions of a well known characterization of triangularizable subalgebras of matrix algebras over an algebraically closed field. Finally we consider the problem of describing the semi-algebraic set of pairs (X,Y) of quaternionic n by n matrices which are simultaneously triangularizable. Even the case n=2, which we analyze in more detail, remains unsolved.",
    "authors": [
      "Dragomir Z. Djokovic",
      "Benjamin H. Smith"
    ],
    "publication_date": "2007-09-04T19:40:08Z",
    "arxiv_id": "http://arxiv.org/abs/0709.0513v1",
    "download_url": "https://arxiv.org/abs/0709.0513v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reductions and special parts of closures",
    "abstract": "We provide an axiomatic framework for working with a wide variety of closure operations on ideals and submodules in commutative algebra, including notions of reduction, independence, spread, and special parts of closures. This framework is applied to tight, Frobenius, and integral closures. Applications are given to evolutions and special Briançon-Skoda theorems.",
    "authors": [
      "Neil Epstein"
    ],
    "publication_date": "2010-02-13T12:18:28Z",
    "arxiv_id": "http://arxiv.org/abs/1002.2703v2",
    "download_url": "https://arxiv.org/abs/1002.2703v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Local criteria for cocommutative Hopf algebras",
    "abstract": "We prove that a finite-dimensional cocommutative Hopf algebra $H$ is local, if and only if the subalgebra generated by the first term of its coradical filtration $H_1$ is local. In particular if $H$ is connected, $H$ is local if and only if all the primitive elements of $H$ are nilpotent.",
    "authors": [
      "Xingting Wang"
    ],
    "publication_date": "2013-04-26T19:31:22Z",
    "arxiv_id": "http://arxiv.org/abs/1304.7261v3",
    "download_url": "https://arxiv.org/abs/1304.7261v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Monomial projections of Veronese varieties: new results and conjectures",
    "abstract": "In this paper, we consider the homogeneous coordinate rings $A(Y_{n,d}) \\cong \\mathbb{K}[Ω_{n,d}]$ of monomial projections $Y_{n,d}$ of Veronese varieties parameterized by subsets $Ω_{n,d}$ of monomials of degree $d$ in $n+1$ variables where: (1) $Ω_{n,d}$ contains all monomials supported in at most $s$ variables and, (2) $Ω_{n,d}$ is a set of monomial invariants of a finite diagonal abelian group $G \\subset GL(n+1,\\mathbb{K})$ of order $d$. Our goal is to study when $\\mathbb{K}[Ω_{n,d}]$ is a quadratic algebra and, if so, when $\\mathbb{K}[Ω_{n,d}]$ is Koszul or G-quadratic. For the family (1), we prove that $\\mathbb{K}[Ω_{n,d}]$ is quadratic when $s \\ge \\lceil \\frac{n+2}{2} \\rceil$. For the family (2), we completely characterize when $\\mathbb{K}[Ω_{2,d}]$ is quadratic in terms of the group $G \\subset GL(3,\\mathbb{K})$, and we prove that $\\mathbb{K}[Ω_{2,d}]$ is quadratic if and only if it is Koszul. We also provide large families of examples where $\\mathbb{K}[Ω_{n,d}]$ is G-quadratic.",
    "authors": [
      "Liena Colarte-Gómez",
      "Rosa M. Miró-Roig",
      "Lisa Nicklasson"
    ],
    "publication_date": "2023-03-16T18:02:58Z",
    "arxiv_id": "http://arxiv.org/abs/2303.09582v1",
    "download_url": "https://arxiv.org/abs/2303.09582v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reducedness of formally unramified algebras over fields",
    "abstract": "We prove that under suitable graded and local hypothesis, a formally unramified algebra over a field must be reduced. We detail examples, including one due to Gabber, to show that it is not possible to generalize these results further.",
    "authors": [
      "Alapan Mukhopadhyay",
      "Karen E. Smith"
    ],
    "publication_date": "2020-05-12T14:52:04Z",
    "arxiv_id": "http://arxiv.org/abs/2005.05833v1",
    "download_url": "https://arxiv.org/abs/2005.05833v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Artin algebras of finite type and finite categories of $Δ$-good modules",
    "abstract": "We give an alternative proof to the fact that if the square of the infinite radical of the module category of an Artin algebra is equal to zero then the algebra is of finite type by making use of the theory of postprojective and preinjective partitions. Further, we use this new approach in order to get a characterization of finite subcategories of $Δ$-good modules of a quasi-hereditary algebra in terms of depth of morphisms similar to a recently obtained characterization of Artin algebras of finite type.",
    "authors": [
      "Danilo D. da Silva"
    ],
    "publication_date": "2015-05-13T20:31:03Z",
    "arxiv_id": "http://arxiv.org/abs/1505.03547v1",
    "download_url": "https://arxiv.org/abs/1505.03547v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On orthogonal and special orthogonal invariants of a single matrix of small order",
    "abstract": "We study the structure of the algebra of polynomial invariants for the usual conjugation action of the complex special, SO_n, and general, O_n, orthogonal group on the space of traceless n by n complex matrices. (Note that these two algebras coincide if n is odd.) Minimal generating sets of these algebras are known for n less than 5. We construct one for n=5. We also construct a Hironaka decomposition in the case n=3 and a new (more economical) such decomposition for n=4. A simple presentation (with just one syzygy) is obtained for the algebra in the case n=3.",
    "authors": [
      "Dragomir Z. Djokovic"
    ],
    "publication_date": "2007-09-03T03:01:19Z",
    "arxiv_id": "http://arxiv.org/abs/0709.0146v2",
    "download_url": "https://arxiv.org/abs/0709.0146v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hidden constructions in abstract algebra, Krull Dimension, Going Up, Going Down",
    "abstract": "We present constructive versions of Krull's dimension theory for commutative rings and distributive lattices. The foundations of these constructive versions are due to Joyal, Espanõl and the authors. We show that this gives a constructive version of basic classical theorems (dimension of finitely presented algebras, Going up and Going down theorem, \\ldots), and hence that we get an explicit computational content where these abstract results are used to show the existence of concrete elements. This can be seen as a partial realisation of Hilbert's program for classical abstract commutative algebra.",
    "authors": [
      "Thierry Coquand",
      "Henri Lombardi"
    ],
    "publication_date": "2017-12-13T12:09:54Z",
    "arxiv_id": "http://arxiv.org/abs/1712.04725v1",
    "download_url": "https://arxiv.org/abs/1712.04725v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Free and cofree Hopf algebras",
    "abstract": "We first prove that a graded, connected, free and cofree Hopf algebra is always self-dual; then that two graded, connected, free and cofree Hopf algebras are isomorphic if, and only if, they have the same Poincaré-Hilbert formal series. If the characteristic of the base field is zero, we prove that the Lie algebra of the primitive elements of such an object is free, and we deduce a characterization of the formal series of free and cofree Hopf algebras by a condition of growth of the coefficients. We finally show that two graded, connected, free and cofree Hopf algebras are isomorphic as (non graded) Hopf algebras if, and only if, the Lie algebra of their primitive elements have the same number of generators.",
    "authors": [
      "Loïc Foissy"
    ],
    "publication_date": "2010-10-26T14:13:09Z",
    "arxiv_id": "http://arxiv.org/abs/1010.5402v3",
    "download_url": "https://arxiv.org/abs/1010.5402v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The logbook of Pointed Hopf algebras over the sporadic groups",
    "abstract": "In this notes we give details of the proofs performed with GAP of the theorems of our paper \"Pointed Hopf Algebras over the Sporadic Simple Groups\".",
    "authors": [
      "N. Andruskiewitsch",
      "F. Fantino",
      "M. Graña",
      "L. Vendramin"
    ],
    "publication_date": "2010-01-07T17:04:17Z",
    "arxiv_id": "http://arxiv.org/abs/1001.1113v2",
    "download_url": "https://arxiv.org/abs/1001.1113v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On strongly primary monoids, with a focus on Puiseux monoids",
    "abstract": "Primary and strongly primary monoids and domains play a central role in the ideal and factorization theory of commutative monoids and domains. It is well-known that primary monoids satisfying the ascending chain condition on divisorial ideals (e.g., numerical monoids) are strongly primary; and the multiplicative monoid of non-zero elements of a one-dimensional local domain is primary and it is strongly primary if the domain is Noetherian. In the present paper, we focus on the study of additive submonoids of the non-negative rationals, called Puiseux monoids. It is easy to see that Puiseux monoids are primary monoids, and we provide conditions ensuring that they are strongly primary. Then we study local and global tameness of strongly primary Puiseux monoids; most notably, we establish an algebraic characterization of when a Puiseux monoid is globally tame. Moreover, we obtain a result on the structure of sets of lengths of all locally tame strongly primary monoids.",
    "authors": [
      "Alfred Geroldinger",
      "Felix Gotti",
      "Salvatore Tringali"
    ],
    "publication_date": "2019-10-22T23:02:31Z",
    "arxiv_id": "http://arxiv.org/abs/1910.10270v2",
    "download_url": "https://arxiv.org/abs/1910.10270v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Projective modules over the real algebraic sphere of dimension 3",
    "abstract": "We show that all the projective modules over the coordinate ring of the real algebraic sphere of dimension 3 are free",
    "authors": [
      "Jean Fasel"
    ],
    "publication_date": "2009-11-17T13:44:31Z",
    "arxiv_id": "http://arxiv.org/abs/0911.3284v3",
    "download_url": "https://arxiv.org/abs/0911.3284v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Remark on Contractible Banach Algebras of Operators",
    "abstract": "For a Banach algebra $A$, we say that an element $M$ in $A\\otimes^γA$ is a hyper-commutator if $(a\\otimes 1)M=M(1\\otimes a)$ for every $a\\in A$. A diagonal for a Banach algebra is a hyper-commutator which its image under diagonal mapping is $1$. It is well-known that a Banach algebra is contractible iff it has a diagonal. The main aim of this note is to show that for any Banach subalgebra $A\\subseteq\\mathcal{L}(X)$ of bounded linear operators on infinite-dimensional Banach space $X$, which contains the ideal of finite-rank operators, the image of any hyper-commutator of $A$ under the canonical algebra-morphism $\\mathcal{L}(X)\\otimes^γ\\mathcal{L}(X)\\to\\mathcal{L}(X\\otimes^γX)$, vanishes.",
    "authors": [
      "Maysam Maysami Sadr"
    ],
    "publication_date": "2022-11-07T12:24:40Z",
    "arxiv_id": "http://arxiv.org/abs/2211.03493v3",
    "download_url": "https://arxiv.org/abs/2211.03493v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "There are no strictly shod algebras in hereditary gentle algebras",
    "abstract": "We prove that there are no strictly shod algebras in hereditary gentle algebras by geometric models. As an application, we give a classification of the silted algebras for Dynkin type $\\mathbb{A}_{n}$ and $\\widetilde{\\mathbb{A}}_{n}$.",
    "authors": [
      "Houjun Zhang",
      "Yu-Zhe Liu"
    ],
    "publication_date": "2022-12-18T15:22:18Z",
    "arxiv_id": "http://arxiv.org/abs/2212.09105v2",
    "download_url": "https://arxiv.org/abs/2212.09105v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Additive Deformations of Hopf Algebras",
    "abstract": "Additive deformations of bialgebras in the sense of Wirth are deformations of the multiplication map of the bialgebra fulfilling a compatibility condition with the coalgebra structure and a continuity condition. Two problems concerning additive deformations are considered. With a deformation theory a cohomology theory should be developed. Here a variant of the Hochschild cohomology is used. The main result in the first partad of this paper is the characterization of the trivial deformations, i.e. deformations generated by a coboundary. Starting with a Hopf algebra, one would expect the deformed multiplications to have some analogue of the antipode, which we call deformed antipodes. We prove, that deformed antipodes always exist, explore their properties, give a formula to calculate them given the deformation and the antipode of the original Hopf algebra and show in the cocommutative case, that each deformation splits into a trivial part and into a part with constant antipodes.",
    "authors": [
      "Malte Gerhold"
    ],
    "publication_date": "2010-06-04T10:32:32Z",
    "arxiv_id": "http://arxiv.org/abs/1006.0847v2",
    "download_url": "https://arxiv.org/abs/1006.0847v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of simple weight modules over the 1-spatial ageing algebra",
    "abstract": "In this paper we use Block's classification of simple modules over the first Weyl algebra to obtain a complete classification of simple weight modules, in particular, of Harish-Chandra modules, over the 1-spatial ageing algebra age(1). Most of these modules have infinite dimensional weight spaces and so far the algebra age(1) is the only Lie algebra having simple weight modules with infinite dimensional weight spaces for which such a classification exists. As an application we classify all simple weight modules over the (1+1)-dimensional space-time Schrodinger algebra S that have a simple age(1)-submodule thus constructing many new simple weight S-modules.",
    "authors": [
      "Rencai Lu",
      "Volodymyr Mazorchuk",
      "Kaiming Zhao"
    ],
    "publication_date": "2014-03-22T18:07:23Z",
    "arxiv_id": "http://arxiv.org/abs/1403.5691v2",
    "download_url": "https://arxiv.org/abs/1403.5691v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cosemisimple Hopf algebras are faithfully flat over Hopf subalgebras",
    "abstract": "The question of whether or not a Hopf algebra $H$ is faithfully flat over a Hopf subalgebra $A$ has received positive answers in several particular cases: when $H$ (or more generally, just $A$) is commutative, or cocommutative, or pointed, or when $K$ contains the coradical of $H$. We prove the statement in the title, adding the class of cosemisimple Hopf algebras to those known to be faithfully flat over all Hopf subalgebras. We also show that the third term of the resulting \"exact sequence\" $A\\to H\\to C$ is always a cosemisimple coalgebra, and that the expectation $H\\to A$ is positive when $H$ is a CQG algebra.",
    "authors": [
      "Alexandru Chirvasitu"
    ],
    "publication_date": "2011-10-31T06:17:12Z",
    "arxiv_id": "http://arxiv.org/abs/1110.6701v3",
    "download_url": "https://arxiv.org/abs/1110.6701v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lie Triple Derivations of Incidence Algebras",
    "abstract": "Let $\\mathcal{R}$ be a $2$-torsion free commutative ring with unity, $X$ a locally finite pre-ordered set and $I(X,\\mathcal{R})$ the incidence algebra of $X$ over $\\mathcal{R}$. If $X$ consists of a finite number of connected components, we prove in this paper that every Lie triple derivation of $I(X,\\mathcal{R})$ is proper.",
    "authors": [
      "Danni Wang",
      "Zhankui Xiao"
    ],
    "publication_date": "2019-01-17T09:12:39Z",
    "arxiv_id": "http://arxiv.org/abs/1901.05690v1",
    "download_url": "https://arxiv.org/abs/1901.05690v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multivariate Hasse-Schmidt Derivation on Exterior Algebras",
    "abstract": "The purpose of this short note is to consider multi-variate Hasse-Schmidt derivations on exterior algebras and to show how they easily provide remarkable identities, holding in the algebra of square matrices, which generalise the classical theorem of Cayley-Hamilton.",
    "authors": [
      "Fereshteh Bahadorykhalily"
    ],
    "publication_date": "2020-03-21T16:32:19Z",
    "arxiv_id": "http://arxiv.org/abs/2003.09694v4",
    "download_url": "https://arxiv.org/abs/2003.09694v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dualities and vertex operator algebras of affine type",
    "abstract": "We notice that for any positive integer $k$, the set of $(1,2)$-specialized characters of level $k$ standard $A_{1}^{(1)}$-modules is the same as the set of rescaled graded dimensions of the subspaces of level $2k+1$ standard $A_{2}^{(2)}$-modules that are vacuum spaces for the action of the principal Heisenberg subalgebra of $A_{2}^{(2)}$. We conjecture the existence of a semisimple category induced by the \"equal level\" representations of some algebraic structure which would naturally explain this duality-like property, and we study potential such structures in the context of generalized vertex operator algebras.",
    "authors": [
      "Julius Borcea"
    ],
    "publication_date": "2002-12-12T19:37:17Z",
    "arxiv_id": "http://arxiv.org/abs/math/0212177v1",
    "download_url": "https://arxiv.org/abs/math/0212177v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The center of the category of bimodules and descent data for non-commutative rings",
    "abstract": "Let $A$ be an algebra over a commutative ring $k$. We compute the center of the category of $A$-bimodules. There are six isomorphic descriptions: the center equals the weak center, and can be described as categories of noncommutative descent data, comodules over the Sweedler canonical $A$-coring, Yetter-Drinfeld type modules or modules with a flat connection from noncommutative differential geometry. All six isomorphic categories are braided monoidal categories: in particular, the category of comodules over the Sweedler canonical $A$-coring $A \\ot A$ is braided monoidal. We provide several applications: for instance, if $A$ is finitely generated projective over $k$ then the category of left End_k(A)$-modules is braided monoidal and we give an explicit description of the braiding in terms of the finite dual basis of $A$. As another application, new families of solutions for the quantum Yang-Baxter equation are constructed: they are canonical maps $Ω$ associated to any right comodule over the Sweedler canonical coring $A \\ot A$ and satisfy the condition $Ω^3 = Ω$. Explicit examples are provided.",
    "authors": [
      "A. L. Agore",
      "S. Caenepeel",
      "G. Militaru"
    ],
    "publication_date": "2011-08-16T08:08:59Z",
    "arxiv_id": "http://arxiv.org/abs/1108.3176v3",
    "download_url": "https://arxiv.org/abs/1108.3176v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of operator extensions, monad liftings and distributive laws for differential algebras and Rota-Baxter algebras",
    "abstract": "Generalizing the algebraic formulation of the First Fundamental Theorem of Calculus (FFTC), a class of constraints involving a pair of operators was considered in \\cite{ZGK2}. For a given constraint, the existences of extensions of differential and Rota-Baxter operators, of liftings of monads and comonads, and of mixed distributive laws are shown to be equivalent. In this paper, we give a classification of the constraints satisfying these equivalent conditions.",
    "authors": [
      "Shilong Zhang",
      "Li Guo",
      "William Keigher"
    ],
    "publication_date": "2020-02-09T17:08:57Z",
    "arxiv_id": "http://arxiv.org/abs/2002.04466v1",
    "download_url": "https://arxiv.org/abs/2002.04466v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Weyl algebras and reflection equation algebras at a root of unity",
    "abstract": "We compute the center and Azumaya locus in the simplest non-abelian examples of quantized multiplicative quiver varieties at a root of unity: quantum Weyl algebras of rank $N$, and quantum differential operators on the quantum group $\\mathrm{GL}_2$. These examples illustrate in elementary terms much more general phenomena explored further in [Ganev-Jordan-Safronov 2019].",
    "authors": [
      "Nicholas Cooney",
      "Iordan Ganev",
      "David Jordan"
    ],
    "publication_date": "2019-07-25T12:29:11Z",
    "arxiv_id": "http://arxiv.org/abs/1907.11005v1",
    "download_url": "https://arxiv.org/abs/1907.11005v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cluster algebra structures on Poisson nilpotent algebras",
    "abstract": "Various coordinate rings of varieties appearing in the theory of Poisson Lie groups and Poisson homogeneous spaces belong to the large, axiomatically defined class of symmetric Poisson nilpotent algebras, e.g. coordinate rings of Schubert cells for symmetrizable Kac--Moody groups. We prove that every Poisson nilpotent algebra satisfying a mild condition on certain scalars is canonically isomorphic to a cluster algebra which coincides with the corresponding upper cluster algebra, without additional localizations by frozen variables. The constructed cluster structure is compatible with the Poisson structure in the sense of Gekhtman, Shapiro and Vainshtein. All Poisson nilpotent algebras are proved to be equivariant Poisson Unique Factorization Domains. Their seeds are constructed from sequences of Poisson-prime elements for chains of Poisson UFDs; mutation matrices are effectively determined from linear systems in terms of the underlying Poisson structure. Uniqueness, existence, mutation, and other properties are established for these sequences of Poisson-prime elements.",
    "authors": [
      "K. R. Goodearl",
      "M. T. Yakimov"
    ],
    "publication_date": "2018-01-06T04:04:50Z",
    "arxiv_id": "http://arxiv.org/abs/1801.01963v2",
    "download_url": "https://arxiv.org/abs/1801.01963v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Skew group algebras of piecewise hereditary algebras are piecewise hereditary",
    "abstract": "We show that the main results of Happel-Rickard-Schofield (1988) and Happel-Reiten-Smalo (1996) on piecewise hereditary algebras are coherent with the notion of group action on an algebra. Then, we take advantage of this compatibility and show that if G is a finite group acting on a piecewise hereditary algebra A over an algebraically closed field whose characteristic does not divide the order of G, then the resulting skew group algebra A[G] is also piecewise hereditary.",
    "authors": [
      "Julie Dionne",
      "Marcelo Lanzilotta",
      "David Smith"
    ],
    "publication_date": "2007-03-17T00:03:43Z",
    "arxiv_id": "http://arxiv.org/abs/math/0703507v3",
    "download_url": "https://arxiv.org/abs/math/0703507v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deformations and rigidity in varieties of Lie algebras",
    "abstract": "We present a novel construction of linear deformations for Lie algebras and use it to prove the non-rigidity of several classes of Lie algebras in different varieties. We consider the family of Lie algebras with an abelian factor showing that, in general, they are not rigid even for the case of a 1-dimensional abelian factor. We also address the problem of k-rigidity for k-step nilpotent Lie algebras. Using our construction and recent results in [BCC] we prove the that the k-step free nilpotent Lie algebras are k-rigid but not (k + 1)-rigid and that Heisenberg Lie algebras are 2-rigid but not 3-rigid.",
    "authors": [
      "Josefina Barrionuevo",
      "Paulo Tirao"
    ],
    "publication_date": "2021-01-24T08:18:12Z",
    "arxiv_id": "http://arxiv.org/abs/2101.09670v2",
    "download_url": "https://arxiv.org/abs/2101.09670v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unstable homotopy groups and Lie algebras",
    "abstract": "We survey the role of Lie algebras in the study of unstable homotopy groups.",
    "authors": [
      "Mark Behrens",
      "Connor Malin"
    ],
    "publication_date": "2024-10-23T23:55:53Z",
    "arxiv_id": "http://arxiv.org/abs/2410.18330v3",
    "download_url": "https://arxiv.org/abs/2410.18330v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Some NP Complete Problems Based on Algebra and Algebraic Geometry",
    "abstract": "This paper describes several new problems and ideas concerning algebraic geometry and complexity theory. It first uses the idea of coloring graphs with elements of finite fields. This procedure then shows that graph coloring problems can be converted into membership problems for a new family of algebraic varieties, coloring varieties, which are closely related to determinantal varieties. This in turn shows that the problem of NP vs P can be converted into questions of if certain polynomials of large degree over finite fields have low multiplicative complexity.",
    "authors": [
      "Paul Hriljac"
    ],
    "publication_date": "2025-03-18T20:25:07Z",
    "arxiv_id": "http://arxiv.org/abs/2503.14715v1",
    "download_url": "https://arxiv.org/abs/2503.14715v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Whittaker modules for the super-Virasoro algebras",
    "abstract": "In this paper, we define and study Whittaker modules for the super-Viraoro algebras, including the Neveu-Schwarz algebra and the Ramond algebra. We classify the simple Whittaker modules and obtain necessary and sufficient conditions for irreducibility of these modules.",
    "authors": [
      "Dong Liu",
      "Yufeng Pei",
      "Limeng Xia"
    ],
    "publication_date": "2018-10-30T08:35:49Z",
    "arxiv_id": "http://arxiv.org/abs/1810.12577v1",
    "download_url": "https://arxiv.org/abs/1810.12577v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Forcing the Strong Lefschetz and the Maximal Rank Properties",
    "abstract": "Three basic properties that standard graded artinian $k$-algebras may or may not enjoy are the Weak and Strong Lefschetz Properties and the Maximal Rank Property (respectively WLP, SLP, and MRP).\n  In this paper we will assume that the base field $k$ has characteristic zero. It is known that SLP implies MRP, which in turn implies WLP, but that both implications are strict. However, it surprisingly turned out that the set of Hilbert functions admitting any algebras with WLP coincides with the corresponding set for SLP (and therefore with that for MRP). J. Migliore and the first author, using Green's theorem and a result of Wiebe, characterized the Hilbert functions forcing all algebras to enjoy WLP. The purpose of this note is to prove the corresponding characterizations for both SLP and MRP. Unsurprisingly (or surprisingly??), the two characterizations coincide, but they define a class of Hilbert functions strictly smaller than that determined for WLP.\n  Our methods include the Herzog-Popescu theorem on quotients of $k$-algebras modulo a general form, a result of Wiebe, and gins and stable ideals. At the end, we will also discuss the importance of assuming that the characteristic be zero, and we will exhibit a class of codimension 2 monomial complete intersections for which SLP (but not MRP) fails in positive characteristic.",
    "authors": [
      "Fabrizio Zanello",
      "Jeffery V. Zylinski"
    ],
    "publication_date": "2008-04-17T19:03:30Z",
    "arxiv_id": "http://arxiv.org/abs/0804.2877v2",
    "download_url": "https://arxiv.org/abs/0804.2877v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Vertex operator algebra analogue of embedding of $B_4$ into $F_4$",
    "abstract": "Let L_{B}(-5/2,0) (resp. L_{F}(-5/2,0)) be the simple vertex operator algebra associated to affine Lie algebra of type $B_{4}^{(1)}$ (resp. $F_{4}^{(1)}$) with the lowest admissible half-integer level -5/2. We show that L_{B}(-5/2,0) is a vertex subalgebra of L_{F}(-5/2,0) with the same conformal vector, and that L_{F}(-5/2,0) is isomorphic to the extension of L_{B}(-5/2,0) by its only irreducible module other than itself. We also study the representation theory of L_{F}(-5/2,0), and determine the decompositions of irreducible weak L_{F}(-5/2,0)-modules from the category $\\mathcal{O}$ into direct sums of irreducible weak L_{B}(-5/2,0)-modules.",
    "authors": [
      "Ozren Perse"
    ],
    "publication_date": "2007-01-01T18:16:56Z",
    "arxiv_id": "http://arxiv.org/abs/math/0701040v2",
    "download_url": "https://arxiv.org/abs/math/0701040v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Recent Advances in the Theory of Polyomino Ideals",
    "abstract": "Polyomino ideals, defined as the ideals generated by the inner $2$-minors of a polyomino, are a class of binomial ideals whose algebraic properties are closely related to the combinatorial structure of the underlying polyomino. We provide a unified account of recent advances on two central themes: the characterization of prime polyomino ideals and the emerging connection between the Hilbert-Poincaré series and Gorensteinness of $K[\\mathcal{P}]$ with the classical rook theory. Some further related properties, as radicality, primary decomposition, and levelness are discussed, and a \\textit{Macaulay2} package, namely \\texttt{PolyominoIdeals}, is also presented.",
    "authors": [
      "Francesco Navarra",
      "Ayesha Asloob Qureshi"
    ],
    "publication_date": "2025-11-27T22:04:16Z",
    "arxiv_id": "http://arxiv.org/abs/2511.22778v1",
    "download_url": "https://arxiv.org/abs/2511.22778v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "One-point theta functions for vertex operator algebras",
    "abstract": "One-point theta functions for modules of vertex operator algebras (VOAs) are defined and studied. These functions are a generalization of the character theta functions studied by Miyamoto and are deviations of the classical one-point functions for modules of a VOA. Transformation laws with respect to the group $\\operatorname{SL}_2(\\mathbb{Z})$ are established.",
    "authors": [
      "Matthew Krauel"
    ],
    "publication_date": "2016-12-07T05:28:30Z",
    "arxiv_id": "http://arxiv.org/abs/1612.02117v2",
    "download_url": "https://arxiv.org/abs/1612.02117v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pointed Hopf algebras of dimension $p^2q$ in characteristic $p$",
    "abstract": "Let $\\mathds{k}$ be an algebraically closed field of characteristic $p$. We give the complete classification of pointed Hopf algebras over $\\mathds{k}$ of dimension $p^2q$ for a prime number $q$. The result shows that there are finitely many isomorphism classes, including 10 classes that are not generated by group-like elements and skew-primitive elements. In particular, there are many new examples of finite-dimensional pointed Hopf algebras.",
    "authors": [
      "Rongchuan Xiong"
    ],
    "publication_date": "2017-04-30T16:35:00Z",
    "arxiv_id": "http://arxiv.org/abs/1705.00339v7",
    "download_url": "https://arxiv.org/abs/1705.00339v7",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twisted generalized Weyl algebras, polynomial Cartan matrices and Serre-type relations",
    "abstract": "Twisted generalized Weyl algebras (TGWAs) are defined as the quotient of a certain graded algebra by the maximal graded ideal I with trivial zero component, analogous to how Kac-Moody algebras can be defined. In this paper we introduce the class of locally finite TGWAs, and show that one can associate to such an algebra a polynomial Cartan matrix (a notion extending the usual generalized Cartan matrices appearing in Kac-Moody algebra theory) and that the corresponding generalized Serre relations hold in the TGWA. We also give an explicit construction of a family of locally finite TGWAs depending on a symmetric generalized Cartan matrix C and some scalars. The polynomial Cartan matrix of an algebra in this family may be regarded as a deformation of the original matrix C and gives rise to quantum Serre relations in the TGWA. We conjecture that these relations generate the graded ideal I for these algebras, and prove it in type A_2.",
    "authors": [
      "Jonas T. Hartwig"
    ],
    "publication_date": "2009-08-14T15:08:43Z",
    "arxiv_id": "http://arxiv.org/abs/0908.2054v1",
    "download_url": "https://arxiv.org/abs/0908.2054v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simultaneous deformations of algebras and morphisms via derived brackets",
    "abstract": "We present a method to construct explicitly L-infinity algebras governing simultaneous deformations of various kinds of algebraic structures and of their morphisms. It is an alternative to the heavy use of the operad machinery of the existing approaches. Our method relies on Voronov's derived bracket construction.",
    "authors": [
      "Yael Fregier",
      "Marco Zambon"
    ],
    "publication_date": "2013-01-21T13:30:32Z",
    "arxiv_id": "http://arxiv.org/abs/1301.4864v2",
    "download_url": "https://arxiv.org/abs/1301.4864v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Noncommutative reality-based algebras of rank 6",
    "abstract": "We classify the RBA-bases of $6$-dimensional noncommutative semisimple algebras for which the algebra has a positive degree map. We show that these RBAs are parametrized by seven real numbers, the first four of which are positive and the remaining three arbitrary. Our classification gives formulas for their standard bases and structure constants. Using these we give a list of all noncommutative integral table algebras of rank 6 with order up to 150. Four in the list are primitive, but we show these cannot be realized as adjacency algebras of association schemes. In the last section of the paper we apply our methods to give a precise description of the noncommutative integral table algebras of rank 6 for which the multiplicity of both linear characters is 1.",
    "authors": [
      "Allen Herman",
      "Mikhael Muzychuk",
      "Bangteng Xu"
    ],
    "publication_date": "2016-08-30T14:12:08Z",
    "arxiv_id": "http://arxiv.org/abs/1608.08463v2",
    "download_url": "https://arxiv.org/abs/1608.08463v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Distributive congruence lattices of congruence-permutable algebras",
    "abstract": "We prove that every distributive algebraic lattice with at most $\\aleph\\_1$ compact elements is isomorphic to the normal subgroup lattice of some group and to the submodule lattice of some right module. The $\\aleph\\_1$ bound is optimal, as we find a distributive algebraic lattice $D$ with $\\aleph\\_2$ compact elements that is not isomorphic to the congruence lattice of any algebra with almost permutable congruences (hence neither of any group nor of any module), thus solving negatively a problem of E. T. Schmidt from 1969. Furthermore, $D$ may be taken as the congruence lattice of the free bounded lattice on $\\aleph\\_2$ generators in any non-distributive lattice variety. Some of our results are obtained via a functorial approach of the semilattice-valued \"distances\" used by B. Jonsson in his proof of Whitman's embedding Theorem. In particular, the semilattice of compact elements of $D$ is not the range of any distance satisfying the V-condition of type 3/2. On the other hand, every distributive join-semilattice with zero is the range of a distance satisfying the V-condition of type 2. This can be done via a functorial construction.",
    "authors": [
      "Pavel Ruzicka",
      "Jiri Tuma",
      "Friedrich Wehrung"
    ],
    "publication_date": "2005-05-18T09:47:33Z",
    "arxiv_id": "http://arxiv.org/abs/math/0505381v3",
    "download_url": "https://arxiv.org/abs/math/0505381v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Distance regularity in buildings and structure constants in Hecke algebras",
    "abstract": "In this paper we define generalised spheres in buildings using the simplicial structure and Weyl distance in the building, and we derive an explicit formula for the cardinality of these spheres. We prove a generalised notion of distance regularity in buildings, and develop a combinatorial formula for the cardinalities of intersections of generalised spheres. Motivated by the classical study of algebras associated to distance regular graphs we investigate the algebras and modules of Hecke operators arising from our generalised distance regularity, and prove isomorphisms between these algebras and more well known parabolic Hecke algebras. We conclude with applications of our main results to non-negativity of structure constants in parabolic Hecke algebras, commutativity of algebras of Hecke operators, double coset combinatorics in groups with $BN$-pairs, and random walks on the simplices of buildings.",
    "authors": [
      "Peter Abramenko",
      "James Parkinson",
      "Hendrik Van Maldeghem"
    ],
    "publication_date": "2015-08-17T02:33:26Z",
    "arxiv_id": "http://arxiv.org/abs/1508.03912v3",
    "download_url": "https://arxiv.org/abs/1508.03912v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integral forms for tensor powers of the Virasoro vertex operator algebra $L(\\frac{1}{2},0)$ and their modules",
    "abstract": "We construct integral forms containing the conformal vector $ω$ in certain tensor powers of the Virasoro vertex operator algebra $L(\\frac{1}{2},0)$, and we construct integral forms in certain modules for these algebras. When a triple of modules for a tensor power of $L(\\frac{1}{2},0)$ have integral forms, we classify which intertwining operators among these modules respect the integral forms. As an application, we explore how these results might be used to obtain integral forms in framed vertex operator algebras.",
    "authors": [
      "Robert McRae"
    ],
    "publication_date": "2014-10-21T14:20:12Z",
    "arxiv_id": "http://arxiv.org/abs/1410.5676v1",
    "download_url": "https://arxiv.org/abs/1410.5676v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Connectivity of $τ$-tilting graphs for quasi-tilted algebras and quotients of $g$-tame algebras",
    "abstract": "This note investigates the connectivity of $τ$-tilting graphs for algebras from the point of view of quotients. We establish the connectivity of $τ$-tilting graph for an arbitrary quasi-tilted algebra and prove that the connectivity of the $τ$-tilting graph of a $g$-tame algebra is preserved under quotient. In particular, quotient algebras of skew-gentle algebras and quotient algebras of tame hereditary algebras have connected $τ$-tilting graphs.",
    "authors": [
      "Changjian Fu",
      "Shengfei Geng",
      "Pin Liu"
    ],
    "publication_date": "2024-01-10T13:44:35Z",
    "arxiv_id": "http://arxiv.org/abs/2401.05158v3",
    "download_url": "https://arxiv.org/abs/2401.05158v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Note on The Cohomology of Color Hopf and Lie Algebras",
    "abstract": "Let $A$ be a $(G, χ)$-Hopf algebra with bijection antipode and let $M$ be a $G$-graded $A$-bimodule. We prove that there exists an isomorphism \\mathrm{HH}^*_{\\rm gr}(A, M)\\cong{\\rm Ext}^*_{A{-}{\\rm gr}} (\\K, {^{ad}(M)}), where $\\K$ is viewed as the trivial graded $A$-module via the counit of $A$, $^{ad} M$ is the adjoint $A$-module associated to the graded $A$-bimodule $M$ and $\\mathrm{HH}_{\\rm gr}$ denotes the $G$-graded Hochschild cohomology. As an application, we deduce that the cohomology of color Lie algebra $L$ is isomorphic to the graded Hochschild cohomology of the universal enveloping algebra $U(L)$, solving a question of M. Scheunert.",
    "authors": [
      "Xiao-Wu Chen",
      "Toukaiddine Petit",
      "Freddy Van Oystaeyen"
    ],
    "publication_date": "2005-04-27T15:39:13Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0504080v2",
    "download_url": "https://arxiv.org/abs/math-ph/0504080v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Iwahori-Hecke algebras acting on tensor space by $q$-deformed letter permutations and $q$-partition algebras",
    "abstract": "Let $R$ be a commutative ring with identity and let $V$ be a free $R$-module of rank $n$ for some $n\\in\\mathbb{N}$. Fixing an $R$-basis $\\mathcal{E}$ of $V$, the symmetric group $\\mathfrak{S}_n$ acts on $V$ by permuting $\\mathcal{E}$ and hence on tensor space $V^{\\otimes r}$ for $r\\in\\mathbb{N}$ via the usual tensor product action turning $V$ and $V^{\\otimes r}$ into $R\\mathfrak{S}_n$-modules. For units $q$ in $R$ we construct an action of the corresponding Iwahori-Hecke algebra $\\mathcal{H}_{R,q}(\\mathfrak{S}_n)$ which specializes to the action of $R\\mathfrak{S}_n$, if $q$ is taken to $1$. The centralizing algebra of this action is called the $q$-partition algebra $\\mathcal{P}_{R,q}(n,r)$. Let $R$ be a field of characteristic not dividing $q$. We prove, that $\\mathcal{P}_{R,q}(n,r)$ is isomorphic to the $q$-partition algebra defined by Halverson and Thiem by different means a few years ago.",
    "authors": [
      "Geetha Thangavelu",
      "Richard Dipper"
    ],
    "publication_date": "2023-11-06T14:50:44Z",
    "arxiv_id": "http://arxiv.org/abs/2311.03156v3",
    "download_url": "https://arxiv.org/abs/2311.03156v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cyclic Homology of Hopf Comodule Algebras and Hopf Module Coalgebras",
    "abstract": "In this paper we construct a cylindrical module $A \\natural \\mathcal{H}$ for an $\\mathcal{H}$-comodule algebra $A$, where the antipode of the Hopf algebra $\\mathcal{H}$ is bijective. We show that the cyclic module associated to the diagonal of $A \\natural \\mathcal{H}$ is isomorphic with the cyclic module of the crossed product algebra $A \\rtimes \\mathcal{H}$. This enables us to derive a spectral sequence for the cyclic homology of the crossed product algebra. We also construct a cocylindrical module for Hopf module coalgebras and establish a similar spectral sequence to compute the cyclic cohomology of crossed product coalgebras.",
    "authors": [
      "R. Akbarpour",
      "M. Khalkhali"
    ],
    "publication_date": "2001-08-19T04:11:11Z",
    "arxiv_id": "http://arxiv.org/abs/math/0108126v3",
    "download_url": "https://arxiv.org/abs/math/0108126v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Heisenberg double H(B^*) as a braided commutative Yetter-Drinfeld module algebra over the Drinfeld double",
    "abstract": "We study the Yetter--Drinfeld D(B)-module algebra structure on the Heisenberg double H(B^*) endowed with a \"heterotic\" action of the Drinfeld double D(B). This action can be interpreted in the spirit of Lu's description of H(B^*) as a twist of D(B). In terms of the braiding of Yetter--Drinfeld modules, H(B^*) is braided commutative. By the Brzezinski--Militaru theorem, H(B^*)#D(B) is then a Hopf algebroid over H(B^*). For B a particular Taft Hopf algebra at a 2p-th root of unity, the construction is adapted to yield Yetter--Drinfeld module algebras over the 2p^3-dimensional quantum group U_q(sl(2)). In particular, it follows that Mat_p(C) is a braided commutative Yetter--Drinfeld U_q(sl(2))-module algebra and Mat_p(U_q(sl(2))) is a Hopf algebroid over Mat_p(C).",
    "authors": [
      "AM Semikhatov"
    ],
    "publication_date": "2010-01-03T16:46:12Z",
    "arxiv_id": "http://arxiv.org/abs/1001.0733v2",
    "download_url": "https://arxiv.org/abs/1001.0733v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complete reducibility theorems for modules over pointed Hopf algebras",
    "abstract": "We investigate the representation theory of a large class of pointed Hopf algebras, extending results of Lusztig and others. We classify all simple modules in a suitable category and determine the weight multiplicities; we establish a complete reducibility theorem in this category.",
    "authors": [
      "Nicolás Andruskiewitsch",
      "David Radford",
      "Hans-Jürgen Schneider"
    ],
    "publication_date": "2010-01-22T12:45:20Z",
    "arxiv_id": "http://arxiv.org/abs/1001.3977v2",
    "download_url": "https://arxiv.org/abs/1001.3977v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spanning sets for Moebius vertex algebras satisfying arbitrary difference conditions",
    "abstract": "Spanning sets for vertex operator algebras satisfying difference-zero and difference-one conditions have been extensively studied in the recent years. In this paper, we extend these results. More specifically, we show that for a suitably chosen generating set, any N-graded Moebius vertex algebra is spanned by monomials satisfying a difference-N ordering condition.",
    "authors": [
      "Geoffrey Buhl",
      "Gizem Karaali"
    ],
    "publication_date": "2008-03-26T20:46:07Z",
    "arxiv_id": "http://arxiv.org/abs/0803.3819v1",
    "download_url": "https://arxiv.org/abs/0803.3819v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The structure, capability and the Schur multiplier of generalized Heisenberg Lie algebras",
    "abstract": "From [Problem 1729, Groups of prime power order, Vol. 3], Berkovich et al. asked to obtain the Schur multiplier and the representation of a group $G$, when $G$ is a special $p$-group minimally generated by $d$ elements and $|G'|=p^{\\frac{1}{2}d(d-1)}$. Since there are analogies between groups and Lie algebras, we intend to give an answer to this question similarly for nilpotent Lie algebras. Furthermore, we give some results about the tensor square and the Schur multiplier of some nilpotent Lie algebras of class two.",
    "authors": [
      "Farangis Johari",
      "Peyman Niroomand"
    ],
    "publication_date": "2017-06-15T21:52:46Z",
    "arxiv_id": "http://arxiv.org/abs/1706.05106v2",
    "download_url": "https://arxiv.org/abs/1706.05106v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Yang-Baxter operators arising from algebra structures and the Alexander polynomial of knots",
    "abstract": "In this note, we consider the problem of constructing knot invariants from Yang-Baxter operators associated to (unitary associative) algebra structures.\n  We first compute the enhancements of these operators. Then, we conclude that Turaev's procedure to construct knot invariants, as modified by Murakami, invariably produces from those enhanced Yang-Baxter operators the Alexander polynomial.",
    "authors": [
      "Gwenael Massuyeau",
      "Florin F. Nichita"
    ],
    "publication_date": "2004-04-01T16:44:48Z",
    "arxiv_id": "http://arxiv.org/abs/math/0404010v1",
    "download_url": "https://arxiv.org/abs/math/0404010v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The degree of the algebra of covariants of a binary form",
    "abstract": "We calculate the degree of the algebra of covariants $\\mathcal{C}_d$ for binary $d$-form. Also, for the degree we obtain its integral representation and asymptotic behavior.",
    "authors": [
      "Leonid Bedratyuk",
      "Nadia Ilash"
    ],
    "publication_date": "2013-04-19T07:03:12Z",
    "arxiv_id": "http://arxiv.org/abs/1304.5328v1",
    "download_url": "https://arxiv.org/abs/1304.5328v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The weak Lefschetz property for Artinian Gorenstein algebras of codimension three",
    "abstract": "We study the weak Lefschetz property of a class of graded Artinian Gorenstein algebras of codimension three associated in a natural way to the Apéry set of a numerical semigroup generated by four natural numbers. We show that these algebras have the weak Lefschetz property whenever the initial degree of their defining ideal is small.",
    "authors": [
      "Rosa Maria Miró-Roig",
      "Quang Hoa Tran"
    ],
    "publication_date": "2019-12-10T18:15:22Z",
    "arxiv_id": "http://arxiv.org/abs/1912.04866v1",
    "download_url": "https://arxiv.org/abs/1912.04866v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Young tableaux and representations of Hecke algebras of type ADE",
    "abstract": "We introduce and study some affine Hecke algebras of type ADE, generalising the affine Hecke algebras of GL. We construct irreducible calibrated representations and describe the calibrated spectrum. This is done in terms of new families of combinatorial objects equipped with actions of the corresponding Weyl groups. These objects are built from and generalise the usual standard Young tableaux, and are controlled by the considered affine Hecke algebras. By restriction and limiting procedure, we obtain several combinatorial models for representations of finite Hecke algebras and Weyl groups of type ADE. Representations are constructed by explicit formulas, in a seminormal form.",
    "authors": [
      "L. Poulain d'Andecy"
    ],
    "publication_date": "2016-05-13T10:52:02Z",
    "arxiv_id": "http://arxiv.org/abs/1605.04125v1",
    "download_url": "https://arxiv.org/abs/1605.04125v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal enveloping algebras of differential graded Poisson algebras",
    "abstract": "In this paper, we introduce the notion of differential graded Poisson algebra and study its universal enveloping algebra. From any differential graded Poisson algebra $A$, we construct two isomorphic differential graded algebras: $A^e$ and $A^E$. It is proved that the category of differential graded Poisson modules over $A$ is isomorphic to the category of differential graded modules over $A^e$, and $A^e$ is the unique universal enveloping algebra of $A$ up to isomorphisms. As applications of the universal property of $A^e$, we prove that $(A^e)^{op}\\cong (A^{op})^e$ and $(A\\otimes_{\\Bbbk}B)^e\\cong A^e\\otimes_{\\Bbbk}B^e$ as differential graded algebras. As consequences, we obtain that ``$e$'' is a monoidal functor and establish links among the universal enveloping algebras of differential graded Poisson algebras, differential graded Lie algebras and associative algebras.",
    "authors": [
      "Jiafeng Lü",
      "Xingting Wang",
      "Guangbin Zhuang"
    ],
    "publication_date": "2014-03-12T23:08:34Z",
    "arxiv_id": "http://arxiv.org/abs/1403.3130v3",
    "download_url": "https://arxiv.org/abs/1403.3130v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Discriminants of quantized walled Brauer algebras",
    "abstract": "In this paper, we compute Gram determinants associated to all cell modules of quantized walled Brauer algebras $\\mathscr B_{r, t}(ρ, q)$ over an arbitrary field $κ$. Suppose $e$ is the quantum characteristic of $q^2$. We classify the blocks of $\\mathscr B_{r, t}(ρ, q)$ when $e>\\max\\{r,t\\}$ and $ρ^2=q^{2n}$, $n\\in\\mathbb Z$. As an application, we give a criterion for a cell module of $\\mathscr B_{r, t}(ρ, q)$ being equal to its simple head over $κ$.",
    "authors": [
      "Mei Si",
      "Linliang Song"
    ],
    "publication_date": "2023-07-16T14:57:30Z",
    "arxiv_id": "http://arxiv.org/abs/2307.08066v1",
    "download_url": "https://arxiv.org/abs/2307.08066v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the non-existence of sympathetic Lie algebras with dimension less than 25",
    "abstract": "In this article we investigate the question of the lowest possible dimension that a sympathetic Lie algebra $\\mathfrak{g}$ can attain, when its Levi subalgebra $\\mathfrak{g}_L$ is simple. We establish the structure of the nilradical of a perfect Lie algebra $\\mathfrak{g}$, as a $\\mathfrak{g}_L$-module, and determine the possible Lie algebra structures that one such $\\mathfrak{g}$ admits. We prove that, as a $\\mathfrak{g}_L$-module, the nilradical must decompose into at least 4 simple modules. We explicitly calculate the semisimple derivations of a perfect Lie algebra $\\mathfrak{g}$ with Levi subalgebra $\\mathfrak{g}_L = \\mathfrak{sl}_2(\\mathbb{C})$ and give necessary conditions for $\\mathfrak{g}$ to be a sympathetic Lie algebra in terms of these semisimple derivations. We show that there is no sympathetic Lie algebra of dimension lower than 15, independently of the nilradical's decomposition. If the nilradical has 4 simple modules, we show that a sympathetic Lie algebra has dimension greater or equal than 25.",
    "authors": [
      "A. L. Garcia-Pulido",
      "G. Salgado"
    ],
    "publication_date": "2022-12-02T16:08:11Z",
    "arxiv_id": "http://arxiv.org/abs/2212.01273v3",
    "download_url": "https://arxiv.org/abs/2212.01273v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Ohm-Rush content function",
    "abstract": "The content of a polynomial over a ring $R$ is a well understood notion. Ohm and Rush generalized this concept of a content map to an arbitrary ring extension of $R$, although it can behave quite badly. We examine five properties an algebra may have with respect to this function -- content algebra, weak content algebra, semicontent algebra (our own definition), Gaussian algebra, and Ohm-Rush algebra. We show that the Gaussian, weak content, and semicontent algebra properties are all transitive. However, transitivity is unknown for the content algebra property. We then compare the Ohm-Rush notion with the more usual notion of content in the power series context. We show that many of the given properties coincide for the power series extension map over a valuation ring of finite dimension, and that they are equivalent to the value group being order-isomorphic to the integers or the reals. Along the way, we give a new characterization of Prüfer domains.",
    "authors": [
      "Neil Epstein",
      "Jay Shapiro"
    ],
    "publication_date": "2014-05-12T23:44:11Z",
    "arxiv_id": "http://arxiv.org/abs/1405.3000v2",
    "download_url": "https://arxiv.org/abs/1405.3000v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Generalizations of Cycles and Chordality to Hypergraphs from an Algebraic Viewpoint",
    "abstract": "In this paper, we study the notion of chordality and cycles in hypergraphs from a commutative algebraic point of view. The corresponding concept of chordality in commutative algebra is having a linear resolution. However, there is no unified definition for cycle or chordality in hypergraphs in the literature, so we consider several generalizations of these notions and study their algebraic interpretations. In particular, we investigate the relationship between chordality and having linear quotients in some classes of hypergraphs. Also we show that if $\\mathcal{C}$ is a hypergraph such that $\\langle \\mathcal{C} \\rangle$ is a vertex decomposable simplicial complex or $I(\\bar{\\mathcal{C}})$ is squarefree stable, then $\\mathcal{C}$ is chordal according to one of the most promising definitions.",
    "authors": [
      "Ashkan Nikseresht",
      "Rashid Zaare-Nahandi"
    ],
    "publication_date": "2016-01-13T11:38:53Z",
    "arxiv_id": "http://arxiv.org/abs/1601.03207v3",
    "download_url": "https://arxiv.org/abs/1601.03207v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The bi-graded structure of Symmetric Algebras with applications to Rees rings",
    "abstract": "Consider a rational projective plane curve C parameterized by three homogeneous forms h1,h2,h3 of the same degree d in the polynomial ring R=k[x,y] over the field k. Extracting a common factor, we may harmlessly assume that the ideal I=(h1,h2,h3)R has height two. Let phi be a homogeneous minimal Hilbert-Burch matrix for the row vector [h1,h2,h3]. So, phi is a 3 by 2 matrix of homogeneous forms from R; the entries in column m have degree dm, with d1 \\le d2 and d1+d2=d. The Rees algebra $cal R$ of I is the subring k[h1t,h2t,h3t] of the polynomial ring k[t]. The bi-projective spectrum of $cal R$ is the graph of the parameterization of C; and therefore, there is a dictionary which translates between the singularities of C and the algebra structure of $cal R$. The ring $cal R$ is the quotient of the symmetric algebra Sym(I) by the ideal, A, of local cohomology with support in the homogeneous maximal ideal of R. The ideal A_{\\ge d2-1}, which is an approximation of A, can be calculated using linkage. We exploit the bi-graded structure of Sym(I) in order to describe the structure of an improved approximation A_{\\ge d1-1} when $d1<d2$ and phi has a generalized zero in its first column. (The later condition is equivalent to assuming that C has a singularity of multiplicity d2.) In particular, we give the bi-degrees of a minimal bi-homogeneous generating set for this ideal. When 2=d1<d2 and phi has a generalized zero in its first column, then we record explicit generators for A. When d1=d2, we provide a translation between the bi-degrees of a bi-homogeneous minimal generating set for A_{d1-2} and the number of singularities of multiplicity d1 which are on or infinitely near C. We conclude with a table which translates between the bi-degrees of a bi-homogeneous minimal generating set for A and the configuration of singularities of C in the case that the curve C has degree six.",
    "authors": [
      "Andrew Kustin",
      "Claudia Polini",
      "Bernd Ulrich"
    ],
    "publication_date": "2013-01-29T23:58:20Z",
    "arxiv_id": "http://arxiv.org/abs/1301.7106v2",
    "download_url": "https://arxiv.org/abs/1301.7106v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tate-Hochschild Cohomology of Radical Square Zero Algebras",
    "abstract": "For algebras with radical square zero, we give a combinatorial description to the Tate-Hochschild cohomology. We compute the Gerstenhaber algebra structure on the Tate-Hochschild cohomology for some classes of such algebras.",
    "authors": [
      "Zhengfang Wang"
    ],
    "publication_date": "2015-11-26T10:40:55Z",
    "arxiv_id": "http://arxiv.org/abs/1511.08348v2",
    "download_url": "https://arxiv.org/abs/1511.08348v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extending structures for associative conformal algebras",
    "abstract": "In this paper, we give a study of the $\\mathbb{C}[\\partial]$-split extending structures problem for associative conformal algebras. Using the unified product as a tool, which includes interesting products such as bicrossed product, cocycle semi-direct product and so on, a cohomological type object is constructed to characterize the $\\mathbb{C}[\\partial]$-split extending structures for associative conformal algebras. Moreover, using this theory, the extending structures of an associative conformal algebra $A$ which is free as a $\\mathbb{C}[\\partial]$-module by the $\\mathbb{C}[\\partial]$-module $Q=\\mathbb{C}[\\partial]x$ are described using flag datums of $A$. Furthermore, we give a classification of the extending structures of $A$ by $Q=\\mathbb{C}[\\partial]x$ in detail up to equivalence when $A$ is a free associative conformal algebra of rank 1.",
    "authors": [
      "Yanyong Hong"
    ],
    "publication_date": "2017-05-08T11:16:58Z",
    "arxiv_id": "http://arxiv.org/abs/1705.02827v2",
    "download_url": "https://arxiv.org/abs/1705.02827v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The weighted fusion category algebra and the q-Schur algebra for \\mathrm{GL}_2(q)",
    "abstract": "We show that the weighted fusion category algebra of the principal 2-block $b_0$ of $\\mathrm{GL}_2(q)$ is the quotient of the $q$-Schur algebra $\\mathcal{S}_2(q)$ by its socle, for $q$ an odd prime power. As a consequence, we get a canonical bijection between the set of isomorphism classes of simple $k\\mathrm{GL}_2(q)b_0$-modules and the set of conjugacy classes of $b_0$-weights in this case.",
    "authors": [
      "Sejong Park"
    ],
    "publication_date": "2007-11-10T22:21:34Z",
    "arxiv_id": "http://arxiv.org/abs/0711.1622v1",
    "download_url": "https://arxiv.org/abs/0711.1622v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fox-Neuwirth-Fuks cells, quantum shuffle algebras, and Malle's conjecture for function fields",
    "abstract": "The purpose of this paper is to prove the upper bound in Malle's conjecture on the distribution of finite extensions of $\\mathbb{F}_q(t)$ with specified Galois group. As in previous work of Ellenberg-Venkatesh-Westerland, our result is based upon computations of the homology of braid groups with certain (exponential) coefficients. However, the approach in this paper is new, relying on a connection between the cohomology of Hurwitz spaces and the cohomology of quantum shuffle algebras.",
    "authors": [
      "Jordan S. Ellenberg",
      "TriThang Tran",
      "Craig Westerland"
    ],
    "publication_date": "2017-01-17T06:07:16Z",
    "arxiv_id": "http://arxiv.org/abs/1701.04541v2",
    "download_url": "https://arxiv.org/abs/1701.04541v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the connection between evolution algebras, random walks and graphs",
    "abstract": "Evolution algebras are a new type of non-associative algebras which are inspired from biological phenomena. A special class of such algebras, called Markov evolution algebras, is strongly related to the theory of discrete time Markov chains. The winning of this relation is that many results coming from Probability Theory may be stated in the context of Abstract Algebra.\n  In this paper we explore the connection between evolution algebras, random walks and graphs. More precisely, we study the relationships between the evolution algebra induced by a random walk on a graph and the evolution algebra determined by the same graph. Given that any Markov chain may be seen as a random walk on a graph we believe that our results may add a new landscape in the study of Markov evolution algebras.",
    "authors": [
      "Paula Cadavid",
      "Mary Luz Rodiño Montoya",
      "Pablo M. Rodríguez"
    ],
    "publication_date": "2017-07-18T23:42:13Z",
    "arxiv_id": "http://arxiv.org/abs/1707.05897v2",
    "download_url": "https://arxiv.org/abs/1707.05897v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the central geometry of nonnoetherian dimer algebras",
    "abstract": "Let $Z$ be the center of a nonnoetherian dimer algebra on a torus. Although $Z$ itself is also nonnoetherian, we show that it has Krull dimension $3$, and is locally noetherian on an open dense set of $\\operatorname{Max}Z$. Furthermore, we show that the reduced center $Z/\\operatorname{nil}Z$ is depicted by a Gorenstein singularity, and contains precisely one closed point of positive geometric dimension.",
    "authors": [
      "Charlie Beil"
    ],
    "publication_date": "2019-03-25T16:49:04Z",
    "arxiv_id": "http://arxiv.org/abs/1903.10460v2",
    "download_url": "https://arxiv.org/abs/1903.10460v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Families of k-derivations on k-algebras",
    "abstract": "Let $A$ be an integral $k$-algebra of finite type over a field $k$ of characteristic zero. Let ${\\cal{F}}$ be a family of $k$-derivations on $A$ and $M_{\\cal{F}}$ the $A$-module spanned by ${\\cal{F}}$. In this paper, we generalize a result due to A. Nowicki and construct an element $\\partial$ of $M_{\\cal{F}}$ such that $\\ker \\partial=\\cap_{d\\in {\\cal{F}}} \\ker d$. Such a derivation is called ${\\cal{F}}$-minimal. Then we establish a density theorem for ${\\cal{F}}$-minimal derivations in $M_{\\cal{F}}$.",
    "authors": [
      "Philippe Bonnet"
    ],
    "publication_date": "2006-02-10T16:35:15Z",
    "arxiv_id": "http://arxiv.org/abs/math/0602220v1",
    "download_url": "https://arxiv.org/abs/math/0602220v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Deformation Complex For DG Hopf Algebras",
    "abstract": "Let H be a differential graded Hopf algebra over a field k. This paper gives an explicit construction of a triple cochain complex that defines the Hochschild-Cartier cohomology of H. A certain truncation of this complex is the appropriate setting for deforming H as an H(q)-structure. The direct limit of all such truncations is the appropriate setting for deforming H as a strongly homotopy associative structure. Sign complications are systematically controlled. The connection between rational perturbation theory and the deformation theory of certain free commutative differential graded algebras is clarified.",
    "authors": [
      "Ronald Umble"
    ],
    "publication_date": "2001-06-29T19:14:06Z",
    "arxiv_id": "http://arxiv.org/abs/math/0106266v2",
    "download_url": "https://arxiv.org/abs/math/0106266v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Whittaker modules for a subalgebra of N=2 superconformal algebra",
    "abstract": "In this paper, Whittaker modules are studied for a subalgebra $\\mathfrak{q}_ε$ of the $\\emph{N}$=2 superconformal algebra.\n  The Whittaker modules are classified by central characters.\n  Additionally, criteria for the irreducibility of the Whittaker modules are given.",
    "authors": [
      "Naihuan Jing",
      "Pengfa Xu",
      "Honglian Zhang"
    ],
    "publication_date": "2024-09-05T01:30:09Z",
    "arxiv_id": "http://arxiv.org/abs/2409.03159v1",
    "download_url": "https://arxiv.org/abs/2409.03159v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Principal subspaces for quantum affine algebra $U_q(A_n^{(1)})$",
    "abstract": "We consider principal subspace W(Λ) of integrable highest weight module L(Λ) for quantum affine algebra $U_q(\\hat{\\mathfrak{sl}}_{n+1})$. We introduce quantum analogues of the quasi-particles associated with the principal subspaces for $\\hat{\\mathfrak{sl}}_{n+1}$ and discover certain relations among them. By using these relations we find, for certain highest weight Λ, combinatorial bases of principal subspace W(Λ) in terms of monomials of quantum quasi-particles.",
    "authors": [
      "Slaven Kozic"
    ],
    "publication_date": "2013-06-16T23:48:37Z",
    "arxiv_id": "http://arxiv.org/abs/1306.3712v1",
    "download_url": "https://arxiv.org/abs/1306.3712v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On isoperimetric profiles of algebras",
    "abstract": "Isoperimetric profile in algebras was first introduced by Gromov. We study the behavior of the isoperimetric profile under various ring theoretic constructions and its relation with the Gelfand-Kirillov dimension.",
    "authors": [
      "Michele D'Adderio"
    ],
    "publication_date": "2008-08-15T23:34:25Z",
    "arxiv_id": "http://arxiv.org/abs/0808.2219v4",
    "download_url": "https://arxiv.org/abs/0808.2219v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the total order of reducibility of a pencil of algebraic plane curves",
    "abstract": "In this paper, the problem of bounding the number of reducible curves in a pencil of algebraic plane curves is addressed. Unlike most of the previous related works, each reducible curve of the pencil is here counted with its appropriate multiplicity. It is proved that this number of reducible curves, counted with multiplicity, is bounded by d^2-1 where d is the degree of the pencil. Then, a sharper bound is given by taking into account the Newton's polygon of the pencil.",
    "authors": [
      "Laurent Busé",
      "Guillaume Chèze"
    ],
    "publication_date": "2008-12-26T20:56:46Z",
    "arxiv_id": "http://arxiv.org/abs/0812.4706v2",
    "download_url": "https://arxiv.org/abs/0812.4706v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]