[
  {
    "title": "Topological invariants of Floquet systems: General formulation, special\n  properties, and Floquet topological defects",
    "abstract": "Periodically driven (Floquet) systems have been under active theoretical and\nexperimental investigations. This paper aims at a systematic study in the\nfollowing aspects of Floquet systems: (i) A systematic formulation of\ntopological invariants of Floquet systems based on the cooperation of topology\nand symmetries. Topological invariants are constructed for the ten symmetry\nclasses in all spatial dimensions, for both homogeneous Floquet systems\n(Floquet topological insulators and superconductors) and Floquet topological\ndefects. Meanwhile, useful representative Dirac Hamiltonians for all the\nsymmetry classes are obtained and studied. (ii) A general theory of Floquet\ntopological defects, based on the proposed topological invariants. (iii) Models\nand proposals of Floquet topological defects in low dimensions. Among other\ndefect modes, we investigate Floquet Majorana zero modes and Majorana Pi modes\nin vortices of topologically trivial superconductors under a periodic drive. In\naddition, we clarified several notable issues about Floquet topological\ninvariants. Among other issues, we prove the equivalence between the\neffective-Hamiltonian-based band topological invariants and the\nfrequency-domain band topological invariants.",
    "authors": [
      "Shunyu Yao",
      "Zhongbo Yan",
      "Zhong Wang"
    ],
    "publication_date": "2017-08-20T16:32:08Z",
    "arxiv_id": "http://arxiv.org/abs/1708.05993v2",
    "download_url": "http://arxiv.org/abs/1708.05993v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Transformation Monoids",
    "abstract": "We investigate semigroup topologies on the full transformation monoid T(X) of\nan infinite set X. We show that the standard pointwise topology is the weakest\nHausdorff semigroup topology on T(X), show that the pointwise topology is the\nunique Hausdorff semigroup topology on T(X) that induces the pointwise topology\non the group of all permutations of X, and construct |X| distinct Hausdorff\nsemigroup topologies on T(X). In the case where X is countable, we prove that\nthe pointwise topology is the only Polish semigroup topology on T(X). We also\nshow that every separable semigroup topology on T(X) is perfect, describe the\ncompact sets in an arbitrary Hausdorff semigroup topology on T(X), and show\nthat there are no locally compact perfect Hausdorff semigroup topologies on\nT(X) when |X| has uncountable cofinality.",
    "authors": [
      "Z. Mesyan",
      "J. D. Mitchell",
      "Y. H. Péresse"
    ],
    "publication_date": "2018-09-12T17:54:58Z",
    "arxiv_id": "http://arxiv.org/abs/1809.04590v2",
    "download_url": "http://arxiv.org/abs/1809.04590v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysis of Maximal Topologies Achieving Optimal DoF and DoF\n  $\\frac{1}{n}$ in Topological Interference Management",
    "abstract": "Topological interference management (TIM) can obtain degrees of freedom (DoF)\ngains with no channel state information at the transmitters (CSIT) except\ntopological information of network in the interference channel. It was shown\nthat TIM achieves the optimal symmetric DoF when internal conflict does not\nexist among messages. However, it is difficult to assure whether a specific\ntopology can achieve the optimal DoF without scrutinizing internal conflict,\nwhich requires lots of works. Also, it is hard to design a specific optimal\ntopology directly from the conventional condition for the optimal DoF. With\nthese problems in mind, we propose a method to derive maximal topology directly\nin TIM, named as alliance construction in K-user interference channel. That is,\nit is proved that a topology is maximal if and only if it is derived from\nalliance construction. We translate a topology design by alliance construction\nin message graph into topology matrix and propose conditions for maximal\ntopology matrix (MTM). Moreover, we propose a generalized alliance construction\nthat derives a topology achieving DoF 1/n for n>=3 by generalizing\nsub-alliances. A topology matrix can also be used to analyze maximality of\ntopology with DoF 1/n.",
    "authors": [
      "Jong-Yoon Yoon",
      "Jong-Seon No"
    ],
    "publication_date": "2018-10-10T01:40:57Z",
    "arxiv_id": "http://arxiv.org/abs/1810.04325v1",
    "download_url": "http://arxiv.org/abs/1810.04325v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deficient topological measures on locally compact spaces",
    "abstract": "Topological measures and quasi-linear functionals generalize measures and\nlinear functionals. We define and study deficient topological measures on\nlocally compact spaces. A deficient topological measure on a locally compact\nspace is a set function on open and closed subsets which is finitely additive\non compact sets, inner regular on open sets, and outer regular on closed sets.\nDeficient topological measures generalize measures and topological measures.\nFirst we investigate positive, negative, and total variation of a signed set\nfunction that is only assumed to be finitely additive on compact sets. These\npositive, negative, and total variations turn out to be deficient topological\nmeasures. Then we examine finite additivity, superadditivity, smoothness, and\nother properties of deficient topological measures. We obtain methods for\ngenerating new deficient topological measures. We provide necessary and\nsufficient conditions for a deficient topological measure to be a topological\nmeasure and to be a measure. The results presented are necessary for further\nstudy of topological measures, deficient topological measures, and\ncorresponding non-linear functionals on locally compact spaces.",
    "authors": [
      "Svetlana V. Butler"
    ],
    "publication_date": "2019-02-07T03:27:15Z",
    "arxiv_id": "http://arxiv.org/abs/1902.02458v1",
    "download_url": "http://arxiv.org/abs/1902.02458v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Separability in (strongly) topological gyrogroups",
    "abstract": "Separability is one of the most basic and important topological properties.\nIn this paper, the separability in (strongly) topological gyrogroups is\nstudied. It is proved that every first-countable left {\\omega}-narrow strongly\ntopological gyrogroup is separable. Furthermore, it is shown that if a\nfeathered strongly topological gyrogroup G is isomorphic to a subgyrogroup of a\nseparable strongly topological gyrogroup, then G is separable. Therefore, if a\nmetrizable strongly topological gyrogroup G is isomorphic to a subgyrogroup of\na separable strongly topological gyrogroup, then G is separable, and if a\nlocally compact strongly topological gyrogroup G is isomorphic to a\nsubgyrogroup of a separable strongly topological gyrogroup, then G is\nseparable.",
    "authors": [
      "Meng Bao",
      "Xiaoyuan Zhang",
      "Xiaoquan Xu"
    ],
    "publication_date": "2020-11-05T03:22:03Z",
    "arxiv_id": "http://arxiv.org/abs/2011.02633v1",
    "download_url": "http://arxiv.org/abs/2011.02633v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological phenomena at topological defects",
    "abstract": "There are two prominent applications of the mathematical concept of topology\nto the physics of materials: band topology, which classifies different\ntopological insulators and semimetals, and topological defects that represent\nimmutable deviations of a solid lattice from its ideal crystalline form. While\nthese two classes of topological phenomena have generally been treated as\nseparate topics, recent experimental advancements have begun to probe their\nintricate and surprising interactions, in real materials as well as synthetic\nmetamaterials. Topological lattice defects in topological materials offer a\nplatform to explore a diverse range of novel phenomena, such as topological\npumping via topological defects, embedded topological phases, synthetic\ndimensions, and non-Hermitian skin effects. In this Perspective, we survey the\ndevelopments in this rapidly moving field, and give an outlook of its impact on\nmaterials science and applications.",
    "authors": [
      "Zhi-Kang Lin",
      "Qiang Wang",
      "Yang Liu",
      "Haoran Xue",
      "Baile Zhang",
      "Yidong Chong",
      "Jian-Hua Jiang"
    ],
    "publication_date": "2022-08-10T00:04:23Z",
    "arxiv_id": "http://arxiv.org/abs/2208.05082v1",
    "download_url": "http://arxiv.org/abs/2208.05082v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal topological marker",
    "abstract": "We elaborate that for topological insulators and topological superconductors\ndescribed by Dirac models in any dimension and symmetry class, the topological\norder can be mapped to lattice sites by a universal topological marker.\nDeriving from a recently discovered momentum-space universal topological\ninvariant, we introduce a topological operator that consists of alternating\nprojectors to filled and empty lattice eigenstates and the position operators,\nmultiplied by the Dirac matrices that are omitted in the Hamiltonian. The\ntopological operator projected to lattice sites yields the topological marker,\nwhose form is explicitly constructed for every topologically nontrivial\nsymmetry class from 1D to 3D. The off-diagonal elements of the topological\noperator yields a nonlocal topological marker, which decays with a correlation\nlength that diverges at topological phase transitions, and represents a Wannier\nstate correlation function. Various prototype examples, including\nSu-Schrieffer-Heeger model, Majorana chain, Chern insulators,\nBernevig-Hughes-Zhang model, 2D chiral and helical $p$-wave superconductors,\nlattice model of $^{3}$He B-phase, and 3D time-reversal symmetric topological\ninsulators, etc, are employed to demonstrate the ubiquity of our formalism.",
    "authors": [
      "Wei Chen"
    ],
    "publication_date": "2022-09-21T23:04:26Z",
    "arxiv_id": "http://arxiv.org/abs/2209.10703v1",
    "download_url": "http://arxiv.org/abs/2209.10703v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Insulators",
    "abstract": "Topological insulators are characterized by insulating bulk and conducting\nsurface, the latter is a necessity consequence of the nontrivial topology of\nthe wavefunctions forming the valence band. This chapter gives a historical\noverview of the discovery of topological insulators and a concise description\nof the $Z_2$ topology which defines them. The concept of topological insulators\nhave been extended to various other topologies, giving rise to the recognition\nof further topological states of matter such as topological crystalline\ninsulators and higher-order topological insulators. Representative materials of\ntopological insulators, their synthesis techniques, and the ways for the\nexperimental confirmation of the topological nature are introduced. Among the\ninteresting phenomena derived from topological insulators, topological\nsuperconductivity, Majorana zero modes, and quantum anomalous Hall effect are\nbriefly discussed.",
    "authors": [
      "Yoichi Ando"
    ],
    "publication_date": "2023-07-26T13:50:20Z",
    "arxiv_id": "http://arxiv.org/abs/2307.14196v1",
    "download_url": "http://arxiv.org/abs/2307.14196v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-Hermitian Topology in Hermitian Topological Matter",
    "abstract": "Non-Hermiticity gives rise to distinctive topological phenomena absent in\nHermitian systems. However, connection between such intrinsic non-Hermitian\ntopology and Hermitian topology has remained largely elusive. Here, considering\nthe bulk and boundary as an environment and system, respectively, we\ndemonstrate that anomalous boundary states in Hermitian topological insulators\nexhibit non-Hermitian topology. We study the self-energy capturing the particle\nexchange between the bulk and boundary, and show that it detects Hermitian\ntopology in the bulk and induces non-Hermitian topology at the boundary. As an\nillustrative example, we reveal non-Hermitian topology and concomitant skin\neffect inherently embedded within chiral edge states of Chern insulators. We\nalso identify the emergence of hinge states within effective non-Hermitian\nHamiltonians at surfaces of three-dimensional topological insulators.\nFurthermore, we comprehensively classify our correspondence across all the\ntenfold symmetry classes of topological insulators and superconductors. Our\nwork uncovers hidden connection between Hermitian and non-Hermitian topology,\nand provides an approach to identifying non-Hermitian topology in quantum\nmatter.",
    "authors": [
      "Shu Hamanaka",
      "Tsuneya Yoshida",
      "Kohei Kawabata"
    ],
    "publication_date": "2024-05-16T11:59:15Z",
    "arxiv_id": "http://arxiv.org/abs/2405.10015v2",
    "download_url": "http://arxiv.org/abs/2405.10015v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The interplay between weak topologies on topological semilattices",
    "abstract": "We study the interplay between three weak topologies on a topological\nsemilattice $X$: the weak$^\\circ$ topology $\\mathcal W^\\circ_X$ (generated by\nthe base consiting of open subsemilattices of $X$), the weak$^\\bullet$ topology\n$\\mathcal W^\\bullet_X$ (generated by the subbase consisting of complements to\nclosed subsemilattices), and the $\\mathbb I$-weak topology $\\mathcal W_X$\n(which is the weakest topology in which all continuous homomorphisms $h:X\\to\n[0,1]$ remain continuous). Also we study the interplay between the weak\ntopologies $\\mathcal W^\\bullet_X$, $\\mathcal W^\\circ_X$, $\\mathcal W_X$ of a\ntopological semilattice $X$ and the Scott and Lawson topologies $\\mathcal S_X$\nand $\\mathcal L_X$, which are determined by the order structure of the\nsemilattice.\n  We prove that the weak$^\\bullet$ topology $\\mathcal W^\\bullet$ on a Hausdorff\nsemitopological semilattice $X$ is compact if and only if $X$ is chain-compact\nin the sense that each closed chain in $X$ is compact. This result implies that\nthe Lawson topology $\\mathcal L_X$ on a semilattice $X$ is compact if and only\nif $X$ is a continuous semilattice if and only if $X$ complete in the sense\nthat each non-empty chain $C$ in $X$ has $\\inf(C)$ and $\\sup(C)$ in $X$.\n  For a chain-compact Hausdorff topological semilattice $X$ with topology\n$\\mathcal T_X$ we prove the inclusions $\\mathcal W_X\\subset\\mathcal\nL_X\\subset\\mathcal W^\\bullet_X\\subset\\mathcal T_X$. For a compact topological\nsemilattice $X$ we prove that $\\mathcal T_X=\\mathcal W^\\bullet_X$ if and only\nif $\\mathcal T_X=\\mathcal L_X$ if and only if $\\mathcal T_X=\\mathcal L_X$.",
    "authors": [
      "Taras Banakh",
      "Serhii Bardyla"
    ],
    "publication_date": "2018-04-10T22:16:49Z",
    "arxiv_id": "http://arxiv.org/abs/1804.03736v3",
    "download_url": "http://arxiv.org/abs/1804.03736v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards complete characterization of topological insulators and\n  superconductors: A systematic construction of topological invariants based on\n  Atiyah-Hirzebruch spectral sequence",
    "abstract": "The past decade has witnessed significant progress in topological materials\ninvestigation. Symmetry-indicator theory and topological quantum chemistry\nprovide an efficient scheme to diagnose topological phases from only partial\ninformation of wave functions without full knowledge of topological invariants,\nwhich has resulted in a recent comprehensive materials search. However, not all\ntopological phases can be captured by this framework, and topological\ninvariants are needed for a more refined diagnosis of topological phases. In\nthis study, we present a systematic framework to construct topological\ninvariants for a large part of symmetry classes, which should be contrasted\nwith the existing invariants discovered through one-by-one approaches. Our\nmethod is based on the recently developed Atiyah-Hirzebruch spectral sequence\nin momentum space. As a demonstration, we construct topological invariants for\ntime-reversal symmetric spinful superconductors with conventional pairing\nsymmetries of all space groups, for which symmetry indicators are silent. We\nalso validate that the obtained quantities work as topological invariants by\ncomputing them for randomly generated symmetric Hamiltonians. Remarkably, the\nconstructed topological invariants completely characterize $K$-groups in 159\nspace groups. Our topological invariants for normal conducting phases are\ndefined under some gauge conditions. To facilitate efficient numerical\nsimulations, we discuss how to derive gauge-independent topological invariants\nfrom the gauge-fixed topological invariants through some examples. Combined\nwith first-principles calculations, our results will help us discover\ntopological materials that could be used in next-generation devices and pave\nthe way for a more comprehensive topological materials database.",
    "authors": [
      "Seishiro Ono",
      "Ken Shiozaki"
    ],
    "publication_date": "2023-11-27T13:40:01Z",
    "arxiv_id": "http://arxiv.org/abs/2311.15814v2",
    "download_url": "http://arxiv.org/abs/2311.15814v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Topological Classification of Real Enriques Surfaces. I",
    "abstract": "This note contains preliminary calculation of topological types or real\nEnriques surfaces. We realize 59 topological types of real Enriques surfaces\n(Theorem 6) and show that all other topological types belong to the list of 21\ntopological types (Theorem 7). In fact, our calculation contains much more\ninformation which is probably useful to constract or prohibit unknown\ntopological types.",
    "authors": [
      "Viacheslav V. Nikulin"
    ],
    "publication_date": "1993-11-28T18:58:45Z",
    "arxiv_id": "http://arxiv.org/abs/alg-geom/9311012v1",
    "download_url": "http://arxiv.org/abs/alg-geom/9311012v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Orthocompactness and semi-stratifiability in the density topology",
    "abstract": "The density topology $\\cal T$ is a topology on the real line, finer than the\nusual topology, having as its open sets the measurable subsets of ${\\mathbb\nR}$, which are of density 1 at each of their points. The aim of this paper is\nto determine which subsets of the density topology are semi-stratifiable,\northocompact and weakly hereditarily pseudocompact.",
    "authors": [
      "Julian Dontchev"
    ],
    "publication_date": "1998-09-12T17:36:08Z",
    "arxiv_id": "http://arxiv.org/abs/math/9809069v1",
    "download_url": "http://arxiv.org/abs/math/9809069v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "van Douwen's problems related to the Bohr topology",
    "abstract": "We comment van Douwen's problems on the Bohr topology of the abelian groups\nraised in his paper (The maximal totally bounded group topology on G and the\nbiggest minimal G-space for Abelian groups G) as well as the steps in the\nsolution of some of them. New solutions to two of the resolved problems are\nalso given.",
    "authors": [
      "Dikran Dikranjan"
    ],
    "publication_date": "2002-04-10T15:51:35Z",
    "arxiv_id": "http://arxiv.org/abs/math/0204120v1",
    "download_url": "http://arxiv.org/abs/math/0204120v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Proceedings of the Ninth Prague Topological Symposium. Contributed\n  papers from the symposium held in Prague, August 19-25, 2001",
    "abstract": "This collection of thirty two reviewed articles covers several fields of\nGeneral Topology. Several contributions represent invited presentations at the\nNinth Prague Topological Symposium.",
    "authors": [
      "Petr Simon"
    ],
    "publication_date": "2002-04-12T14:53:27Z",
    "arxiv_id": "http://arxiv.org/abs/math/0204165v1",
    "download_url": "http://arxiv.org/abs/math/0204165v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Quandles and Invariants of Links",
    "abstract": "We introduce a notion of topological quandle. Given a topological quandle $Q$\nwe associate to every classical link $L$ in $\\R ^3$ an invariant $J_Q(L)$ which\nis a topological space (defined up to a homeomorphism). The space $J_Q(L)$ can\nbe interpreted as a space of colourings of a diagram of the link $L$ with\ncolours from the quandle $Q$.",
    "authors": [
      "Ryszard L. Rubinsztein"
    ],
    "publication_date": "2005-08-26T14:55:08Z",
    "arxiv_id": "http://arxiv.org/abs/math/0508536v1",
    "download_url": "http://arxiv.org/abs/math/0508536v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stability of invariant measures",
    "abstract": "We generalize various notions of stability of invariant sets of dynamical\nsystems to invariant measures, by defining a topology on the set of measures.\nThe defined topology is similar, but not topologically equivalent to weak*\ntopology, and it also differs from topologies induced by the Riesz\nRepresentation Theorem. It turns out that the constructed topology is a\nsolution of a limit case of a $p$-optimal transport problem, for $p=\\infty$.",
    "authors": [
      "Sinisa Slijepcevic"
    ],
    "publication_date": "2008-11-01T19:30:07Z",
    "arxiv_id": "http://arxiv.org/abs/0811.0109v1",
    "download_url": "http://arxiv.org/abs/0811.0109v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The C-compact-open topology on function spaces",
    "abstract": "This paper studies the C-compact-open topology on the set C(X) of all\nrealvalued continuous functions on a Tychonov space X and compares this\ntopology with several well-known and lesser known topologies. We investigate\nthe properties C-compact-open topology on the set C(X) such as submetrizable,\nmetrizable, separable and second countability.",
    "authors": [
      "Alexander V. Osipov"
    ],
    "publication_date": "2012-01-07T15:18:47Z",
    "arxiv_id": "http://arxiv.org/abs/1201.1568v1",
    "download_url": "http://arxiv.org/abs/1201.1568v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On generalized topological groups",
    "abstract": "In this work, we will introduce the notion of generalized topological groups\nusing generalized topological structure and generalized continuity defined by\n?A. Cs?asz?ar [2]. We will discuss some basic properties of this kind of\nstructures and connectedness properties of this structures are given. Keywords:\nGeneralized topology; generalized continuity; generalized topological groups;\ngeneralized connectedness.",
    "authors": [
      "Murad Hussain",
      "Moiz Ud Din Khan",
      "Cenap Özel"
    ],
    "publication_date": "2012-05-17T12:33:29Z",
    "arxiv_id": "http://arxiv.org/abs/1205.3915v1",
    "download_url": "http://arxiv.org/abs/1205.3915v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Set theory and topology. An introduction to the foundations of analysis.\n  Part II: Topology - Fundamental notions",
    "abstract": "We provide a formal introduction into the classic theorems of general\ntopology and its axiomatic foundations in set theory. In this second part we\nintroduce the fundamental concepts of topological spaces, convergence, and\ncontinuity, as well as their applications to real numbers. Various methods to\nconstruct topological spaces are presented.",
    "authors": [
      "Felix Nagel"
    ],
    "publication_date": "2013-06-28T18:51:17Z",
    "arxiv_id": "http://arxiv.org/abs/1306.6926v1",
    "download_url": "http://arxiv.org/abs/1306.6926v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological properties of the unitary group",
    "abstract": "We show that the strong operator topology, the weak operator topology and the\ncompact-open topology agree on the space of unitary operators of a infinite\ndimensional separable Hilbert space. Moreover, we show that the unitary group\nendowed with any of these topologies is a Polish group.",
    "authors": [
      "Jesus Espinoza",
      "Bernardo Uribe"
    ],
    "publication_date": "2014-07-07T20:26:53Z",
    "arxiv_id": "http://arxiv.org/abs/1407.1869v1",
    "download_url": "http://arxiv.org/abs/1407.1869v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological entropy on set-valued functions",
    "abstract": "Topological entropy is a widely studied indicator of chaos in topological\ndynamics. Here we give a generalized definition of topological entropy which\nmay be applied to set-valued functions. We demonstrate that some of the\nwell-known results concerning topological entropy of continuous (single-valued)\nfunctions extend naturally to set-valued functions while others must be\naltered. We also present sufficient conditions for a set-valued function to\nhave positive or infinite topological entropy.",
    "authors": [
      "James Kelly",
      "Tim Tennant"
    ],
    "publication_date": "2015-09-28T17:55:20Z",
    "arxiv_id": "http://arxiv.org/abs/1509.08413v1",
    "download_url": "http://arxiv.org/abs/1509.08413v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-deterministic Semantics for Dynamic Topological Logic",
    "abstract": "Dynamic Topological Logic ($\\mathcal{DTL}$) is a combination of\n$\\mathcal{S}${\\em 4}, under its topological interpretation, and the temporal\nlogic $\\mathcal{LTL}$ interpreted over the natural numbers. $\\mathcal{DTL}$ is\nused to reason about properties of dynamical systems based on topological\nspaces. Semantics are given by dynamic topological models, which are tuples\n$\\left <X,\\mathcal{T},f,V\\right >$, where $\\left <X,\\mathcal{T}\\right >$ is a\ntopological space, $f$ a function on $X$ and $V$ a truth valuation assigning\nsubsets of $X$ to propositional variables.",
    "authors": [
      "David Fernández-Duque"
    ],
    "publication_date": "2016-11-21T11:39:07Z",
    "arxiv_id": "http://arxiv.org/abs/1611.06735v1",
    "download_url": "http://arxiv.org/abs/1611.06735v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entanglement in topological systems",
    "abstract": "These lecture notes on entanglement in topological systems are part of the\n48th IFF Spring School 2017 on Topological Matter: Topological Insulators,\nSkyrmions and Majoranas at the Forschungszentrum Juelich, Germany. They cover a\nshort discussion on topologically ordered phases and review the two main tools\navailable for detecting topological order - the entanglement entropy and the\nentanglement spectrum.",
    "authors": [
      "Maria Hermanns"
    ],
    "publication_date": "2017-02-06T08:09:56Z",
    "arxiv_id": "http://arxiv.org/abs/1702.01525v1",
    "download_url": "http://arxiv.org/abs/1702.01525v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Equivariant topological complexities",
    "abstract": "The aim of this article is to review different generalizations of the the\nnotion of topological complexity to the equivariant setting. In particular, we\nreview the relation (or non-relation) between these notions and the topological\ncomplexity of the quotient space and the topological complexity of the fixed\npoint sets. We give examples of calculations and stress the question: When the\naction is free, do we recover the topological complexity of the quotient?",
    "authors": [
      "Andres Angel",
      "Hellen Colman"
    ],
    "publication_date": "2017-09-02T22:28:35Z",
    "arxiv_id": "http://arxiv.org/abs/1709.00642v1",
    "download_url": "http://arxiv.org/abs/1709.00642v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Group structures of a function spaces with the set-open topology",
    "abstract": "In this paper, we find at the properties of the family lambda which imply\nthat the function space C(X,R^alpha) with the lambda-open topology is a\nsemitopological group (paratopological group, topological group, topological\nvector space and other algebraic structures) under the usual operations of\naddition and multiplication (and multiplication by scalars).",
    "authors": [
      "Alexander V. Osipov"
    ],
    "publication_date": "2017-10-21T21:35:49Z",
    "arxiv_id": "http://arxiv.org/abs/1710.07854v1",
    "download_url": "http://arxiv.org/abs/1710.07854v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuous cohomology of topological quandles",
    "abstract": "A continuous cohomology theory for topological quandles is introduced, and\ncompared to the algebraic theories. Extensions of topological quandles are\nstudied with respect to continuous 2-cocycles, and used to show the differences\nin second cohomology groups for specific topological quandles. A method of\ncomputing the cohomology groups of the inverse limit is applied to quandles.",
    "authors": [
      "Mohamed Elhamdadi",
      "Masahico Saito",
      "Emanuele Zappala"
    ],
    "publication_date": "2018-03-20T18:58:55Z",
    "arxiv_id": "http://arxiv.org/abs/1803.07604v1",
    "download_url": "http://arxiv.org/abs/1803.07604v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological algebras of statistical $τ$-bounded operators on ordered\n  topological vector spaces",
    "abstract": "In this paper, we introduce statistical bounded set on topological vector\nspace. Also, we consider three classes of bounded operators from topological\nvector spaces to ordered topological vector spaces. Moreover, we give relations\nbetween them and order bounded operators. We give algebraic properties of these\noperators concerning to the uniform convergence topology.",
    "authors": [
      "Abdullah Aydın",
      "Muhammed Çınar"
    ],
    "publication_date": "2019-12-14T17:40:35Z",
    "arxiv_id": "http://arxiv.org/abs/1912.06890v1",
    "download_url": "http://arxiv.org/abs/1912.06890v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weak topologies for unbounded nets in CAT($0$) spaces",
    "abstract": "Weak topologies that yield weak convergence for bounded sequences and nets in\nCAT($0$) spaces have been studied in the past. We are here concerned with weak\ntopologies that yield weak convergence of unbounded sequences and nets. We\nanalyze two such topologies that generalize the weak topology on Hilbert spaces\nand that agree with the strong topology on a CAT($0$) space if and only if the\nspace is locally compact.",
    "authors": [
      "Philip Miller",
      "Arian Berdellima",
      "Max Wardetzky"
    ],
    "publication_date": "2022-04-04T07:54:33Z",
    "arxiv_id": "http://arxiv.org/abs/2204.01291v1",
    "download_url": "http://arxiv.org/abs/2204.01291v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A description of the topology of free topological vector spaces",
    "abstract": "We give a simple description of the topology of free topological vector space\n$\\mathbb{V}(X)$ and the topology of the free locally convex space $L(X)$ over a\nTychonoff space $X$. The case when $X$ is a pseudocompact space is also\nconsidered.",
    "authors": [
      "Saak Gabriyelyan"
    ],
    "publication_date": "2018-04-14T09:47:25Z",
    "arxiv_id": "http://arxiv.org/abs/1804.05199v2",
    "download_url": "http://arxiv.org/abs/1804.05199v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Digital Topological Complexity of Digital Maps",
    "abstract": "In this study, we improve the topological complexity computations on digital\nimages with introducing the digital topological complexity computations of a\nsurjective and digitally continuous map between digital images. We also reveal\ndifferences in topological complexity computations of maps between digital\nimages and topological spaces. Moreover, we emphasize the importance of the\nadjacency relation on the domain and the range of a digital map in these\ncomputations.",
    "authors": [
      "Melih Is",
      "Ismet Karaca"
    ],
    "publication_date": "2021-02-28T18:33:57Z",
    "arxiv_id": "http://arxiv.org/abs/2103.00585v1",
    "download_url": "http://arxiv.org/abs/2103.00585v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On structure of topological metagroups",
    "abstract": "In this article topologies on metagroups are studied. They are related with\ngeneralized $C^*$-algebras over ${\\bf R}$ or ${\\bf C}$. Homomorphisms and\nquotient maps on them are investigated. Structure of topological metagroups is\nscrutinized. In particular, topologies on smashed products and smashed twisted\nwreath products of metagroups are scrutinized, which are making them\ntopological metagroups. Moreover, their inverse homomorphism systems are\nstudied.",
    "authors": [
      "Sergey Victor Ludkowski"
    ],
    "publication_date": "2021-10-28T17:23:51Z",
    "arxiv_id": "http://arxiv.org/abs/2110.15308v1",
    "download_url": "http://arxiv.org/abs/2110.15308v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The topological complexity of pure graph braid groups is stably maximal",
    "abstract": "We prove Farber's conjecture on the stable topological complexity of\nconfiguration spaces of graphs. The conjecture follows from a general lower\nbound derived from recent insights into the topological complexity of\naspherical spaces. Our arguments apply equally to higher topological\ncomplexity.",
    "authors": [
      "Ben Knudsen"
    ],
    "publication_date": "2022-06-13T15:52:44Z",
    "arxiv_id": "http://arxiv.org/abs/2206.06268v2",
    "download_url": "http://arxiv.org/abs/2206.06268v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Topological Groups of Monotonic Autohomeomorphisms",
    "abstract": "We study topological groups of monotonic autohomeomorphisms on a generalized\nordered space $L$. We find a condition that is necessary and sufficient for the\nset of all monotonic autohomeomorphisms on $L$ along with the function\ncomposition and the topology of point-wise convergence to be a topological\ngroup.",
    "authors": [
      "Raushan Buzyakova"
    ],
    "publication_date": "2022-12-19T04:14:08Z",
    "arxiv_id": "http://arxiv.org/abs/2212.09236v1",
    "download_url": "http://arxiv.org/abs/2212.09236v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quotient of Topological Ternary Semigroup",
    "abstract": "In this paper we introduce a quotient structure on topological ternary\nsemigroup by defining a congruence suitably. We have found conditions under\nwhich this quotient structure becomes a topological ternary semigroup. We have\nalso obtained conditions that make this quotient a topological ternary group,\nwhenever the base structure is a topological ternary group.",
    "authors": [
      "S. Samanta",
      "S. Jana",
      "S. Kar"
    ],
    "publication_date": "2024-08-19T07:18:07Z",
    "arxiv_id": "http://arxiv.org/abs/2408.09747v1",
    "download_url": "http://arxiv.org/abs/2408.09747v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simulating topological phases and topological phase transitions with\n  classical strings",
    "abstract": "The discovery of the topological insulators has fueled a surge of interests\nin the topological phases in periodic systems. Topological insulators have bulk\nenergy gap and topologically protected gapless edge states. The edge states in\nelectronic systems have been detected by observing the transport properties the\nHgte quantum wells. The electromagnetic analogues of such electronic edge\nstates have been predicted and observed in photonic crystals, coupled\nresonators and linear circuits. However, the edge state spectrums of the two\ndimensional insulators and their electromagnetic analogues haven't been\ndirectly measured and thus the gaplessness of the edge states hasn't been\nexperimentally confirmed. Here I show the classical strings are more convenient\nchoice to study the topological phases than the electromagnetic waves. I found\nthat classical strings with periodic densities can simulate a variety of\ntopological phases in condensed matter physics including two dimensional\ntopological insulators, three dimensional topological semimetals and weak\ntopological insulators. Because the eigenfrequencies and eigenfunctions of the\nstrings can be easily measured, not only the gapless edge state spectrum but\nalso the bulk topological invariant can now be directly observed. Further more\nI show the topological phase transitions can be simulated by the strings. My\nresults show the richness of topological phases of mechanical waves. I\nanticipate my work to be a starting point to study the topological properties\nof mechanical waves. Even richer topological phases other than those have been\nfound in electronics systems can be explored when we use more general\nmechanical waves e.g. waves in membranes with periodic densities. These phases\nmay provide guides to hunt novel topological properties in other branches of\nscience.",
    "authors": [
      "Yi-Dong Wu"
    ],
    "publication_date": "2016-01-29T13:38:35Z",
    "arxiv_id": "http://arxiv.org/abs/1602.00951v2",
    "download_url": "http://arxiv.org/abs/1602.00951v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Weak and strong structures and the $T_{3.5}$ property for generalized\n  topological spaces",
    "abstract": "We investigate weak and strong structures for generalized topological spaces,\namong others products, sums, subspaces, quotients, and the complete lattice of\ngeneralized topologies on a given set. Also we introduce $T_{3.5}$ generalized\ntopological spaces and give a necessary and sufficient condition for a\ngeneralized topological space to be a $T_{3.5}$ space: they are exactly the\nsubspaces of powers of a certain natural generalized topology on $[0,1]$. For\nspaces with at least two points here we can have even dense subspaces. Also,\n$T_{3.5}$ generalized topological spaces are exactly the dense subspaces of\ncompact $T_4$ generalized topological spaces. We show that normality is\nproductive for generalized topological spaces. For compact generalized\ntopological spaces we prove the analogue of the Tychonoff product theorem. We\nprove that also Lindel\\\"ofness (and $\\kappa $-compactness) is productive for\ngeneralized topological spaces. On any ordered set we introduce a generalized\ntopology and determine the continuous maps between two such generalized\ntopological spaces: for $|X|, |Y| \\ge 2$ they are the monotonous maps\ncontinuous between the respective order topologies. We investigate the relation\nof sums and subspaces of generalized topological spaces to ways of defining\ngeneralized topological spaces.",
    "authors": [
      "E. Makai, Jr.",
      "E. Peyghan",
      "B. Samadi"
    ],
    "publication_date": "2016-04-11T10:53:17Z",
    "arxiv_id": "http://arxiv.org/abs/1604.02881v2",
    "download_url": "http://arxiv.org/abs/1604.02881v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Systematic Exploration of the High Likelihood Set of Phylogenetic Tree\n  Topologies",
    "abstract": "Bayesian Markov chain Monte Carlo explores tree space slowly, in part because\nit frequently returns to the same tree topology. An alternative strategy would\nbe to explore tree space systematically, and never return to the same topology.\nIn this paper, we present an efficient parallelized method to map out the high\nlikelihood set of phylogenetic tree topologies via systematic search, which we\nshow to be a good approximation of the high posterior set of tree topologies.\nHere `likelihood' of a topology refers to the tree likelihood for the\ncorresponding tree with optimized branch lengths. We call this method\n`phylogenetic topographer' (PT). The PT strategy is very simple: starting in a\nnumber of local topology maxima (obtained by hill-climbing from random starting\npoints), explore out using local topology rearrangements, only continuing\nthrough topologies that are better than than some likelihood threshold below\nthe best observed topology. We show that the normalized topology likelihoods\nare a useful proxy for the Bayesian posterior probability of those topologies.\nBy using a non-blocking hash table keyed on unique representations of tree\ntopologies, we avoid visiting topologies more than once across all concurrent\nthreads exploring tree space. We demonstrate that PT can be used directly to\napproximate a Bayesian consensus tree topology. When combined with an accurate\nmeans of evaluating per-topology marginal likelihoods, PT gives an alternative\nprocedure for obtaining Bayesian posterior distributions on phylogenetic tree\ntopologies.",
    "authors": [
      "Chris Whidden",
      "Brian C. Claywell",
      "Thayer Fisher",
      "Andrew F. Magee",
      "Mathieu Fourment",
      "Frederick A. Matsen IV"
    ],
    "publication_date": "2018-11-27T14:19:08Z",
    "arxiv_id": "http://arxiv.org/abs/1811.11007v1",
    "download_url": "http://arxiv.org/abs/1811.11007v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Probing Phase Transition of Band Topology via Radiation Topology",
    "abstract": "Topological photonics has received extensive attention from researchers\nbecause it provides brand new physical principles to manipulate light. Band\ntopology of optical materials is characterized using the Berry phase defined by\nBloch states. Until now, the criteria for experimentally probing the\ntopological phase transition of band topology has always been relatively\nlacking in topological physics. Moreover, radiation topology can be aroused by\nthe far-field polarizations of the radiating Bloch states, which is described\nby the Stokes phase. Although such two types of topologies are both related to\nBloch states on the band structure, it is rather surprising that their\ndevelopment is almost independent. Here, we reveal that the phase transition of\nband topology can be probed by the radiation topology. We theoretically design\nand experimentally demonstrate such an intriguing phenomenon by constructing\nphotonic crystals that support optical analogs of quantum spin Hall effects.\nThe results show that the topological charge of the far-field polarization\nvortex changes from +1 to -2 or from -2 to +1 when the band topology changes\nfrom trivial to non-trivial, which provides a new criterion to probe the phase\ntransition of band topology using radiation topology. Our findings not only\nprovide an insightful understanding of band topology and radiation topology,\nbut also can serve as a novel route to manipulate the near and far fields of\nlight.",
    "authors": [
      "Chang-Yin Ji",
      "Wenze Lan",
      "Peng Fu",
      "Gang Wang",
      "Changzhi Gu",
      "Jiafang Li",
      "Yugui Yao",
      "Baoli Liu"
    ],
    "publication_date": "2022-10-31T06:11:03Z",
    "arxiv_id": "http://arxiv.org/abs/2210.17081v1",
    "download_url": "http://arxiv.org/abs/2210.17081v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuum field theory of 3D topological orders with emergent fermions\n  and braiding statistics",
    "abstract": "Universal topological data of topologically ordered phases can be captured by\ntopological quantum field theory in continuous space time by taking the limit\nof low energies and long wavelengths. While previous continuum\nfield-theoretical studies of topological orders in $3$D real space focus on\neither self-statistics, braiding statistics, shrinking rules, fusion rules or\nquantum dimensions, it is yet to systematically put all topological data\ntogether in a unified continuum field-theoretical framework. Here, we construct\nthe topological $BF$ field theory with twisted terms (e.g., $AAdA$ and $AAB$)\nas well as a $K$-matrix $BB$ term, in order to simultaneously explore all such\ntopological data and reach anomaly-free topological orders. Following the\nspirit of the famous $K$-matrix Chern-Simons theory of $2$D topological orders,\nwe present general formulas and systematically show how the $K$-matrix $BB$\nterm confines topological excitations, and how self-statistics of particles is\ntransmuted between bosonic one and fermionic one. In order to reach\nanomaly-free topological orders, we explore, within the present continuum\nfield-theoretical framework, how the principle of gauge invariance\nfundamentally influences possible realizations of topological data. More\nconcretely, we present the topological actions of (i) particle-loop braidings\nwith emergent fermions, (ii) multiloop braidings with emergent fermions, and\n(iii) Borromean-Rings braidings with emergent fermions, and calculate their\nuniversal topological data. Together with the previous efforts, our work paves\nthe way toward a more systematic and complete continuum field-theoretical\nanalysis of exotic topological properties of $3$D topological orders. Several\ninteresting future directions are also discussed.",
    "authors": [
      "Zhi-Feng Zhang",
      "Qing-Rui Wang",
      "Peng Ye"
    ],
    "publication_date": "2023-07-19T13:42:09Z",
    "arxiv_id": "http://arxiv.org/abs/2307.09983v2",
    "download_url": "http://arxiv.org/abs/2307.09983v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "One-dimensional definable topological spaces in o-minimal structures",
    "abstract": "We study the properties of topological spaces $(X,\\tau)$, where $X$ is a\ndefinable set in an o-minimal structure and the topology $\\tau$ on $X$ has a\nbasis that is (uniformly) definable. Examples of such spaces include the\ncanonical euclidean topology on definable sets, definable order topologies,\ndefinable quotient spaces and definable metric spaces. We use o-minimality to\nundertake their study in topological terms, focussing here in particular on\nspaces of dimension one. We present several results, given in terms of\npiecewise decompositions and existence of definable embeddings and\nhomeomorphisms, for various classes of spaces that are described in terms of\nclassical separation axioms and definable analogues of properties such as\nseparability, compactness and metrizability. For example, we prove that all\nHausdorff one-dimensional definable topologies are piecewise the euclidean,\ndiscrete, or upper or lower limit topology; we give a characterization of all\none-dimensional, regular, Hausdorff definable topologies in terms of spaces\nthat have a lexicographic ordering or a topology generalizing the Alexandrov\ndouble of the euclidean topology; and we show that, if the underlying structure\nexpands an ordered field, then any one-dimensional Hausdorff definable topology\nthat is piecewise euclidean is definably homeomorphic to a euclidean space. As\napplications of these results, we prove definable versions of several open\nconjectures from set-theoretic topology, due to Gruenhage and Fremlin, on the\nexistence of a 3-element basis for regular, Hausdorff topologies and on the\nnature of perfectly normal, compact, Hausdorff spaces; we obtain universality\nresults for some classes of Hausdorff and regular topologies; and we\ncharacterize when certain metrizable definable topologies admit a definable\nmetric.",
    "authors": [
      "Pablo Andújar Guerrero",
      "Margaret E. M. Thomas"
    ],
    "publication_date": "2023-10-06T18:03:51Z",
    "arxiv_id": "http://arxiv.org/abs/2310.04510v1",
    "download_url": "http://arxiv.org/abs/2310.04510v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-extensive Entropy and Holographic Thermodynamics: Topological\n  Insights",
    "abstract": "In this paper, we delve into the thermodynamic topology of AdS\nEinstein-Gauss-Bonnet black holes, employing non-extensive entropy formulations\nsuch as Barrow, R\\'enyi, and Sharma-Mittal entropy within two distinct\nframeworks: bulk boundary and restricted phase space (RPS) thermodynamics. Our\nfindings reveal that in the bulk boundary framework, the topological charges,\nare influenced by the free parameters and the Barrow non-extensive parameter\n$(\\delta)$. So, we faced three topological charges $(\\omega = +1, -1, +1)$.\nWhen the parameter $\\delta$ increases to 0.9, the classification changes,\nresulting in two topological charges $(\\omega = +1, -1)$. When $\\delta$ is set\nto zero, the equations reduce to the Bekenstein-Hawking entropy structure,\nyielding consistent results with three topological charges. Additionally,\nsetting the non-extensive parameter $\\lambda$ in R\\'enyi entropy to zero\nincreases the number of topological charges, but the total topological charge\nremains (W = +1). The presence of the R\\'enyi non-extensive parameter alters\nthe topological behavior compared to the Bekenstein-Hawking entropy.\nSharma-Mittal entropy shows different classifications and the various numbers\nof topological charges influenced by the non-extensive parameters $\\alpha$ and\n$\\beta$. When $\\alpha$ and $\\beta$ have values close to each other, three\ntopological charges with a total topological charge $(W = +1)$ are observed.\nVarying one parameter while keeping the other constant significantly changes\nthe topological classification and number of topological charges. In contrast,\nthe RPS framework demonstrates remarkable consistency in topological behavior.\nUnder all conditions and for all free parameters, the topological charge\nremains $(\\omega = +1)$ with the total topological charge $(W = +1)$. This\nuniformity persists even when reduced to Bekenstein-Hawking entropy.",
    "authors": [
      "Saeed Noori Gashti",
      "B. Pourhassan"
    ],
    "publication_date": "2024-12-06T11:23:18Z",
    "arxiv_id": "http://arxiv.org/abs/2412.12132v1",
    "download_url": "http://arxiv.org/abs/2412.12132v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Data Analysis and Topological Deep Learning Beyond\n  Persistent Homology -- A Review",
    "abstract": "Topological data analysis (TDA) is a rapidly evolving field in applied\nmathematics and data science that leverages tools from topology to uncover\nrobust, shape-driven insights in complex datasets. The main workhorse is\npersistent homology, a technique rooted in algebraic topology. Paired with\ntopological deep learning (TDL) or topological machine learning, persistent\nhomology has achieved tremendous success in a wide variety of applications in\nscience, engineering, medicine, and industry. However, persistent homology has\nmany limitations due to its high-level abstraction, insensitivity to\nnon-topological changes, and reliance on point cloud data. This paper presents\na comprehensive review of TDA and TDL beyond persistent homology. It analyzes\nhow persistent topological Laplacians and Dirac operators provide spectral\nrepresentations to capture both topological invariants and homotopic evolution.\nOther formulations are presented in terms of sheaf theory, Mayer topology, and\ninteraction topology. For data on differentiable manifolds, techniques rooted\nin differential topology, such as persistent de Rham cohomology, persistent\nHodge Laplacian, and Hodge decomposition, are reviewed. For one-dimensional\n(1D) curves embedded in 3-space, approaches from geometric topology are\ndiscussed, including multiscale Gauss-link integrals, persistent Jones\npolynomials, and persistent Khovanov homology. This paper further discusses the\nappropriate selection of topological tools for different input data, such as\npoint clouds, sequential data, data on manifolds, curves embedded in 3-space,\nand data with additional non-geometric information. A review is also given of\nvarious topological representations, software packages, and machine learning\nvectorizations. Finally, this review ends with concluding remarks.",
    "authors": [
      "Zhe Su",
      "Xiang Liu",
      "Layal Bou Hamdan",
      "Vasileios Maroulas",
      "Jie Wu",
      "Gunnar Carlsson",
      "Guo-Wei Wei"
    ],
    "publication_date": "2025-07-12T16:08:11Z",
    "arxiv_id": "http://arxiv.org/abs/2507.19504v1",
    "download_url": "http://arxiv.org/abs/2507.19504v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological defect system in O(n) symmetric time-dependent\n  Ginzburg-Landau model",
    "abstract": "We present a new generalized topological current in terms of the order\nparameter field $\\vec \\phi$ to describe the topological defect system in O(n)\nsymmetric time-dependent Ginzburg-Landau model. With the aid of the $%\n\\phi$-mapping method, the structure of the topological defects and the\ntopological quantization of their topological charges in TDGL model are\nobtained under the condition that the Jacobian $% J(\\frac \\phi v)\\neq 0$. We\nshow that the topological defects are generated from the zero points of the\norder parameter field $\\vec \\phi$, and the topological charges of these\ntopological defects are topological quantized in terms of the Hopf indices and\nBrouwer degrees of $\\phi$-mapping under the condition. When $J(\\frac \\phi\nv)=0$, it is shown that there exist the crucial case of branch process. Based\non the implicit function theorem and the Taylor expansion, we detail the\nbifurcation of generalized topological current and find different directions of\nthe bifurcation. The topological defects in TDGL model are found splitting or\nmerging at the degenerate point of field function $\\vec \\phi $ but the total\ncharge of the topological defects is still unchanged.",
    "authors": [
      "Ying Jiang"
    ],
    "publication_date": "2000-03-31T02:05:18Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0003498v2",
    "download_url": "http://arxiv.org/abs/cond-mat/0003498v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Various topologies on trees",
    "abstract": "This is a survey article on trees, with a modest number of proofs to give a\nflavor of the way these topologies can be efficiently handled. Trees are\ndefined in set-theorist fashion as partially ordered sets in which the elements\nbelow each element are well-ordered. A number of different topologies on trees\nare treated, some at considerable length. Two sections deal in some depth with\nthe coarse and fine wedge topologies, and the interval topology, respectively.\nThe coarse wedge topology gives a class of supercompact monotone normal\ntopological spaces, and the fine wedge topology puts a monotone normal,\nhereditarily ultraparacompact topology on every tree. The interval topology\ngives a large variety of topological properties, some of which depend upon\nset-theoretic axioms beyond ZFC. Many of the open problems in this area are\ngiven in the last section.",
    "authors": [
      "Peter J. Nyikos"
    ],
    "publication_date": "2004-12-31T18:41:57Z",
    "arxiv_id": "http://arxiv.org/abs/math/0412554v1",
    "download_url": "http://arxiv.org/abs/math/0412554v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Group topologies coarser than the Isbell topology",
    "abstract": "The Isbell, compact-open and point-open topologies on the set\n$C(X,\\mathbb{R})$ of continuous real-valued maps can be represented as the dual\ntopologies with respect to some collections $\\alpha(X)$ of compact families of\nopen subsets of a topological space $X$. Those $\\alpha(X)$ for which addition\nis jointly continuous at the zero function in $C_\\alpha(X,\\mathbb{R})$ are\ncharacterized, and sufficient conditions for translations to be continuous are\nfound. As a result, collections $\\alpha(X)$ for which\n$C_{\\alpha}(X,\\mathbb{R})$ is a topological vector space are defined\ncanonically. The Isbell topology coincides with this vector space topology if\nand only if $X$ is infraconsonant. Examples based on measure theoretic methods,\nthat $C_\\alpha (X,\\mathbb{R})$ can be strictly finer than the compact-open\ntopology, are given. To our knowledge, this is the first example of a splitting\ngroup topology strictly finer than the compact-open topology.",
    "authors": [
      "S. Dolecki",
      "F. Jordan",
      "F. Mynard"
    ],
    "publication_date": "2010-02-16T14:47:14Z",
    "arxiv_id": "http://arxiv.org/abs/1002.3089v1",
    "download_url": "http://arxiv.org/abs/1002.3089v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Fate of the Photon in Topological Matter: Superconductivity,\n  Confinement and the Vortex Quantum Hall Effect",
    "abstract": "Topological matter is characterized by the presence of a topological BF term\nin its long-distance effective action. Topological defects due to the\ncompactness of the U(1) gauge fields induce quantum phase transitions between\ntopological insulators, topological superconductors and topological\nconfinement. In conventional superconductivity, due to spontaneous symmetry\nbreaking, the photon acquires a mass due to the Anderson-Higgs mechanism. In\nthis paper we derive the corresponding effective actions for the\nelectromagnetic field in topological superconductors and topological\nconfinement phases. In topological superconductors magnetic flux is confined\nand the photon acquires a topological mass through the BF mechanism: no\nsymmetry breaking is involved, the ground state has topological order and the\ntransition is induced by quantum fluctuations. In topological confinement,\ninstead, electric charge is linearly confined and the photon becomes a massive\nantisymmetric tensor via the St\\\"uckelberg mechanism. Oblique confinement\nphases arise when the string condensate carries both magnetic and electric flux\n(dyonic strings). Such phases are characterized by a vortex quantum Hall effect\npotentially relevant for the dissipationless transport of information stored on\nvortices.",
    "authors": [
      "M. C. Diamantini",
      "C. A. Trugenberger"
    ],
    "publication_date": "2011-05-26T19:04:59Z",
    "arxiv_id": "http://arxiv.org/abs/1105.5375v2",
    "download_url": "http://arxiv.org/abs/1105.5375v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A topological transistor of waves via the Euler characteristic",
    "abstract": "Although topological materials have recently seen tremendous development,\ntheir applications have remained elusive. Simultaneously, there exists\nconsiderable interest in pushing the limits of topological materials, including\nthe exploration of new forms of topological protection and the establishment of\ntopologically protected order in non-electronic systems. Here we develop some\nnovel forms of topological order (i.e. topological charges), primarily the\nEuler characteristic as well as manifold class. We further demonstrate that\nthese topological orders can protect bulk current transmission, even when the\ntopologically trivial phase possesses an arbitrarily large band gap. Such a\ntransition between topologically trivial, periodic dispersion and topologically\nnon-trivial, aperiodic dispersion can be obtained by the anomalous Doppler\nshift of waves in a gapped periodic medium. Our work suggests that additional\ntopological charges may become relevant in moving beyond topological\nelectronics.",
    "authors": [
      "Sophia R. Sklan",
      "Baowen Li"
    ],
    "publication_date": "2017-02-07T05:53:41Z",
    "arxiv_id": "http://arxiv.org/abs/1702.01884v1",
    "download_url": "http://arxiv.org/abs/1702.01884v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$Z_{2}$ Topological Order and Topological Protection of Majorana Fermion\n  Qubits",
    "abstract": "The Kitaev chain model exhibits topological order that manifests as\ntopological degeneracy, Majorana edge modes and $Z_{2}$ topological invariance\nof the abulk spectrum. This model can be obtained from a transverse field Ising\nmodel(TFIM) using the Jordan-Wigner transformation. TFIM has neither\ntopological degeneracy nor any edge modes. Topological degeneracy associated\nwith topological order is central to topological quantum computation. In this\npaper we will explore topological protection of the ground state manifold in\nthe case of Majorana fermion models which exhibit $Z_{2}$ topological order. We\nwill show that there are at least two different ways to understand this\ntopological protection of Majorana fermion qubits: one way is based on\nfermionic mode operators and the other is based on anti-commuting symmetry\noperators. We will also show how these two different ways are related to each\nother. We provide a very general approach of understanding the topological\nprotection of Majorana fermion qubits in the case of lattice Hamiltonians.",
    "authors": [
      "Rukhsan Ul Haq",
      "Louis H Kauffman"
    ],
    "publication_date": "2017-04-02T05:41:53Z",
    "arxiv_id": "http://arxiv.org/abs/1704.00252v3",
    "download_url": "http://arxiv.org/abs/1704.00252v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reconstruction of the core convex topology and its applications in\n  vector optimization and convex analysis",
    "abstract": "In this paper, the core convex topology on a real vector space $X$, which is\nconstructed just by $X$ operators, is investigated. This topology, denoted by\n$\\tau_c$, is the strongest topology which makes $X$ into a locally convex\nspace. It is shown that some algebraic notions $(closure ~ and ~ interior)$\nexisting in the literature come from this topology. In fact, it is proved that\nalgebraic interior and vectorial closure notions, considered in the literature\nas replacements of topological interior and topological closure, respectively,\nin vector spaces not necessarily equipped with a topology, are actually nothing\nelse than the interior and closure with the respect to the core convex\ntopology. We reconstruct the core convex topology using an appropriate\ntopological basis which enables us to characterize its open sets.\n  Furthermore, it is proved that $(X,\\tau_c)$ is not metrizable when X is\ninfinite-dimensional, and also it enjoys the Hine-Borel property. Using these\nproperties, $\\tau_c$-compact sets are characterized and a characterization of\nfinite-dimensionality is provided. Finally, it is shown that the properties of\nthe core convex topology lead to directly extending various important results\nin convex analysis and vector optimization from topological vector spaces to\nreal vector spaces.",
    "authors": [
      "Ashkan Mohammadi",
      "Majid Soleimani-damaneh"
    ],
    "publication_date": "2017-04-23T14:57:32Z",
    "arxiv_id": "http://arxiv.org/abs/1704.06932v1",
    "download_url": "http://arxiv.org/abs/1704.06932v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]