[
  {
    "title": "A bump in the road in elementary topology",
    "abstract": "We observe a subtle and apparently generally unnoticed difficulty with the\ndefinition of the relative topology on a subset of a topological space, and\nwith the weak topology defined by a function.",
    "authors": [
      "Bruce Blackadar"
    ],
    "publication_date": "2018-02-13T15:42:56Z",
    "arxiv_id": "http://arxiv.org/abs/1802.04689v1",
    "download_url": "http://arxiv.org/abs/1802.04689v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Metric topology on the moduli space",
    "abstract": "We define the smooth Lipschitz topology on the moduli space and show that\neach conformal class is dense in the moduli space endowed with Gromov-Hausdorff\ntopology, which offers an answer to the Tuschmann's question.",
    "authors": [
      "Jialong Deng"
    ],
    "publication_date": "2020-02-24T03:05:14Z",
    "arxiv_id": "http://arxiv.org/abs/2002.10054v1",
    "download_url": "http://arxiv.org/abs/2002.10054v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topologically sensitive metaheuristics",
    "abstract": "This paper proposes topologically sensitive metaheuristics, and describes\nconceptual design of topologically sensitive Variable Neighborhood Search\nmethod (TVNS) and topologically sensitive Electromagnetism Metaheuristic (TEM).",
    "authors": [
      "Aleksandar Kartelj",
      "Vladimir Filipović",
      "Siniša Vrećica",
      "Rade Živaljević"
    ],
    "publication_date": "2020-02-25T20:12:47Z",
    "arxiv_id": "http://arxiv.org/abs/2002.11164v1",
    "download_url": "http://arxiv.org/abs/2002.11164v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The May filtration on THH and faithfully flat descent",
    "abstract": "In this paper, we prove that both topological Hochschild homology and\ntopological cyclic homology are sheaves for the fpqc topology on connective\ncommutative ring spectra, by exploiting the May filtration on topological\nHochschild homology.",
    "authors": [
      "Liam Keenan"
    ],
    "publication_date": "2020-04-27T06:37:33Z",
    "arxiv_id": "http://arxiv.org/abs/2004.12600v1",
    "download_url": "http://arxiv.org/abs/2004.12600v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Homology and Cohomology of Topological Quandles",
    "abstract": "A homology and cohomology theory for topological quandles are introduced. The\nrelation between these (co)homology groups and quandle (co)homology groups are\nstudied. The 1 - topological quandle cocycles are used to compute state sum\ninvariants corresponding to knot diagrams.",
    "authors": [
      "Georgy C. Luke",
      "B. Subhash"
    ],
    "publication_date": "2022-08-02T12:10:51Z",
    "arxiv_id": "http://arxiv.org/abs/2208.01388v1",
    "download_url": "http://arxiv.org/abs/2208.01388v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Embedding into connected, locally connected topological gyrogroups",
    "abstract": "In this paper, it is proved that every topological gyrogroup $G$ is\ntopologically groupoid isomorphic to a closed subgyrogroup of a connected,\nlocally connected topological gyrogroup $G^{\\bullet}$.",
    "authors": [
      "Jingling Lin",
      "Meng Bao",
      "Fucai Lin"
    ],
    "publication_date": "2021-11-14T14:18:11Z",
    "arxiv_id": "http://arxiv.org/abs/2111.07354v1",
    "download_url": "http://arxiv.org/abs/2111.07354v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Variational principles on subsets of non-autonomous dynamical systems:\n  topological pressure and topological entropy",
    "abstract": "This paper discusses the variational principles on subsets for topological\npressure and topological entropy of non-autonomous dynamical systems. We define\nthe Pesin-Pitskel topological pressure (weighted topological pressure) and the\nBowen topological entropy (weighted Bowen topological entropy) for any subset.\nAlso, we define the measure-theoretic pressure and the measure-theoretic lower\nentropy for all Borel probability measures. Then, we prove variational\nprinciples for topological pressure (topological entropy) which links the\nPesin-Pitskel topological pressure (weighted topological pressure) on an\narbitrary nonempty compact subset to the measure-theoretic pressure of Borel\nprobability measures for non-autonomous dynamical systems (which links the\nBowen topological entropy (weighted Bowen topological entropy) on an arbitrary\nnonempty compact subset to the measure-theoretic lower entropy of Borel\nprobability measures for non-autonomous dynamical systems).\n  Moreover, we show that the Pesin-Pitskel topological pressure (weighted\ntopological pressure) and the Bowen topological entropy (weighted Bowen\ntopological entropy) can be determined by the measure-theoretic pressure and\nthe measure-theoretic lower entropy of Borel probability measures,\nrespectively. These results extend Feng and Huang's results (Variational\nprinciples for topological entropies of subsets, J. Funct. Anal. (2012)), Ma\nand Wen's results (A Billingsley type theorem for Bowen entropy, Comptes Rendus\nMathematique (2008)), and Tang et al. results (Variational principle for\ntopological pressures on subsets, J. Math. Anal. Appl. (2015)) for classical\ndynamical systems to pressures and entropies of non-autonomous dynamical\nsystems.",
    "authors": [
      "Javad Nazarian Sarkooh"
    ],
    "publication_date": "2022-06-01T18:50:22Z",
    "arxiv_id": "http://arxiv.org/abs/2206.00714v1",
    "download_url": "http://arxiv.org/abs/2206.00714v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On sobriety of Scott topology on dcpos",
    "abstract": "In this paper, we mainly investigate the conditions under which the Scott\ntopology on the product of two posets is equal to the product of the individual\nScott topologies and under which the Scott topology on a dcpo is sober. Some\nsuch conditions are given.",
    "authors": [
      "Xiaoquan Xu"
    ],
    "publication_date": "2022-11-28T03:21:21Z",
    "arxiv_id": "http://arxiv.org/abs/2211.15027v1",
    "download_url": "http://arxiv.org/abs/2211.15027v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Topological Groups of Automorphisms",
    "abstract": "We study spaces $X$ for which the space $Hom_p(X)$ of automorphisms with the\ntopology of point-wise convergence is a topological group. We identify large\nclasses of spaces $X$ for which $Hom_p(X)$ is or is not a topological group.",
    "authors": [
      "Raushan Buzyakova"
    ],
    "publication_date": "2024-06-20T22:47:26Z",
    "arxiv_id": "http://arxiv.org/abs/2406.14771v2",
    "download_url": "http://arxiv.org/abs/2406.14771v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topology of hyperplane arrangements via real structure",
    "abstract": "This note is a survey on the topology of hyperplane arrangements. We mainly\nfocus on the relationship between topology and the real structure, such as\nadjacent relations of chambers and stratifications related to real structures.",
    "authors": [
      "Masahiko Yoshinaga"
    ],
    "publication_date": "2024-08-04T14:13:34Z",
    "arxiv_id": "http://arxiv.org/abs/2408.02038v1",
    "download_url": "http://arxiv.org/abs/2408.02038v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lowering mean topological dimension",
    "abstract": "In this paper, we prove that for a topological dynamical system with positive\nmean topological dimension and marker property, it has factors of arbitrary\nsmall mean topological dimension and zero relative mean topological dimension\nwhich separate points.",
    "authors": [
      "Ruxi Shi"
    ],
    "publication_date": "2024-11-16T09:12:49Z",
    "arxiv_id": "http://arxiv.org/abs/2411.10749v2",
    "download_url": "http://arxiv.org/abs/2411.10749v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological and semi-topological Galois embedding problems",
    "abstract": "We reformulate the embedding problem in Galois theory as a question within\nthe frameworks of topological and semi-topological Galois theory. We prove that\nthese problems are solvable when the fundamental group of the base space is a\nfree group of countable rank.",
    "authors": [
      "Jyh-Haur Teh"
    ],
    "publication_date": "2024-12-11T15:35:35Z",
    "arxiv_id": "http://arxiv.org/abs/2412.08469v1",
    "download_url": "http://arxiv.org/abs/2412.08469v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topologically independent sets in topological groups and vector spaces",
    "abstract": "We study topological versions of an independent set in an abelian group and a\nlinearly independent set in a vector space, a {\\em topologically independent\nset} in a topological group and a {\\em topologically linearly independent set}\nin a topological vector space. These counterparts of their algebraic versions\nare defined analogously and possess similar properties.\n  Let $\\C^\\times$ be the multiplicative group of the field of complex numbers\nwith its usual topology. We prove that a subset $A$ of an arbitrary Tychonoff\npower of $\\C^\\times$ is topologically independent if and only if the\ntopological subgroup $\\hull{A}$ that it generates is the Tychonoff direct sum\n$\\bigoplus_{a\\in A}\\hull{a}$.\n  This theorem substantially generalizes an earlier result of the author, who\nhas proved this for Abelian precompact groups.\n  Further, we show that topologically independent and topologically linearly\nindependent sets coincide in vector spaces with weak topologies, although they\nare different in general.\n  We characterize topologically linearly independent sets in vector spaces with\nweak topologies and normed spaces. In a weak topology, a set $A$\n  is topologically linearly independent if and only if its linear span is the\nTychonoff direct sum $\\R^{(A)}$. In normed spaces $A$ is topologically linearly\nindependent if and only if it is uniformly minimal. Thus, from the point of\nview of topological linear independence, the Tychonoff direct sums $\\R^{(A)}$\nand (linear spans of) uniformly minimal sets, which are closely related to\nbounded biorthogonal systems, are of the same essence.",
    "authors": [
      "Jan Spěvák"
    ],
    "publication_date": "2025-03-21T11:35:59Z",
    "arxiv_id": "http://arxiv.org/abs/2503.17062v1",
    "download_url": "http://arxiv.org/abs/2503.17062v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Automatic boundedness of some operators between ordered and topological\n  vector spaces",
    "abstract": "We study topological boundedness of order-to-topology bounded and\norder-to-topology continuous operators from ordered vector spaces to\ntopological vector spaces. The uniform boundedness principle for such operators\nis investigated.",
    "authors": [
      "Eduard Emelyanov"
    ],
    "publication_date": "2025-05-04T17:37:37Z",
    "arxiv_id": "http://arxiv.org/abs/2505.02200v1",
    "download_url": "http://arxiv.org/abs/2505.02200v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "State-dependent Topological Invariants and Anomalous Bulk-Boundary\n  Correspondence in non-Hermitian Topological Systems",
    "abstract": "The breakdown of the bulk-boundary correspondence in non-Hermitian (NH)\ntopological systems is an open, controversial issue. In this paper, to resolve\nthis issue, we ask the following question: Can a (global) topological invariant\ncompletely describe the topological properties of a NH system as its Hermitian\ncounterpart? Our answer is no. One cannot use a global topological invariant\n(including non-Bloch topological invariant) to accurately characterize the\ntopological properties of the NH systems. Instead, there exist a new type of\ntopological invariants that are absence in its Hermitian counterpart -- the\nstate dependent topological invariants. With the help of the state-dependent\ntopological invariants, we develop a new topological theory for NH topological\nsystem beyond the general knowledge for usual Hermitian systems and obtain an\nexact formulation of the bulk-boundary correspondence, including\nstate-dependent phase diagram, state-dependent phase transition and anomalous\ntransport properties (spontaneous topological current). Therefore, these\nresults will help people to understand the exotic topological properties of\nvarious non-Hermitian systems.",
    "authors": [
      "Xiao-Ran Wang",
      "Cui-Xian Guo",
      "Su-Peng Kou"
    ],
    "publication_date": "2020-03-30T14:17:42Z",
    "arxiv_id": "http://arxiv.org/abs/2003.13494v1",
    "download_url": "http://arxiv.org/abs/2003.13494v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Methods of generating soft topologies and soft separation axioms",
    "abstract": "The paper develops a novel analysis of mutual interactions between topology\nand soft topology. It is known that each soft topology produces a system of\ncrisp (parameterized) topologies. The other way round is also possible. Namely,\none can generate a soft topology from a system of crisp topologies. Different\nmethods of producing soft topologies are discussed by implementing two\nformulas. Then, the relationships between the resulting soft topologies are\nobtained. With the help of an example, it is demonstrated that one formula is\nmore constructible than the other. Now, it is reasonable to ask which\n(topological) properties of a soft topology can be transferred to the set of\ncrisp topologies or the opposite. To address this question, we consider the\nstandard separation axioms and show how well these axioms can be preserved when\nmoving from a system of crisp topologies to the soft topology generated by it\nand contrariwise. Additionally, our findings extend and disprove some results\nfrom the literature.",
    "authors": [
      "Zanyar A. Ameen",
      "Baravan A. Asaad"
    ],
    "publication_date": "2023-02-11T13:20:03Z",
    "arxiv_id": "http://arxiv.org/abs/2302.05691v2",
    "download_url": "http://arxiv.org/abs/2302.05691v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unsupervised Classification of Non-Hermitian Topological Phases under\n  Symmetries",
    "abstract": "The integration of artificial intelligence (AI) into fundamental science has\nopened new possibilities to address long-standing scientific challenges rooted\nin mathematical limitations. For example, topological invariants are used to\ncharacterize topology, but there is no universally applicable one. This\nlimitation explains why, in the past decades-long classification of topological\nphases of matter -- mainly focused on Hermitian systems -- many phases\ninitially classified ``trivial\" were later identified as topological. Recently,\nthe discovery of non-Hermitian band topology has spurred substantial efforts in\nnon-Hermitian topological classification, including the development of new\ntopological invariants. However, such classifications similarly risk\noverlooking key topological features. Here, without relying on any topological\ninvariant, we develop an AI-based unsupervised classification of\nsymmetry-protected non-Hermitian topological phases. This algorithm\ndistinguishes topological differences among non-Hermitian Hamiltonians with\nsymmetries, and constructs, in an unsupervised manner, a topological periodic\ntable for non-Hermitian systems. Additionally, it can account for the boundary\neffects, enabling the exploration of open-boundary effects on the topological\nphase diagram. These results introduce an unsupervised approach for classifying\nsymmetry-protected non-Hermitian topological phases without omission and\nprovide valuable guidance for the development of theories and experiments.",
    "authors": [
      "Yang Long",
      "Haoran Xue",
      "Baile Zhang"
    ],
    "publication_date": "2024-12-30T11:45:36Z",
    "arxiv_id": "http://arxiv.org/abs/2412.20882v1",
    "download_url": "http://arxiv.org/abs/2412.20882v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Natural vs. Artificial Topologies on a Relativistic Spacetime",
    "abstract": "Consider a set $M$ equipped with a structure $*$. We call a natural topology\n$T_*$, on $(M,*)$, the topology induced by $*$. For example, a natural topology\nfor a metric space $(X,d)$ is a topology $T_d$ induced by the metric $d$ and\nfor a linearly ordered set $(X,<)$ a natural topology should be the topology\n$T_<$ that is induced by the order $<$. This fundamental property, for a\ntopology to be called \"natural\", has been largely ignored while studying\ntopological properties of spacetime manifolds $(M,g)$ where $g$ is the Lorentz\n\"metric\", and the manifold topology $T_M$ has been used as a natural topology,\nignoring the spacetime \"metric\" $g$. In this survey we review critically\ncandidate topologies for a relativistic spacetime manifold, we pose open\nquestions and conjectures with the aim to establish a complete guide on the\nlatest results in the field, and give the foundations for future discussions.\nWe discuss the criticism against the manifold topology, a criticism that was\ninitiated by people like Zeeman, G\\\"obel, Hawking-King-McCarthy and others, and\nwe examine what should be meant by the term \"natural topology\" for a spacetime.\nSince the common criticism against spacetime topologies, other than the\nmanifold topology, claims that there has not been established yet a physical\ntheory to justify such topologies, we give examples of seemingly physical\nphenomena, under the manifold topology, which are actually purely effects\ndepending on the choice of the topology; the Limit Curve Theorem, which is\nlinked to singularity theorems in general relativity, and the Theorem of\nGao-Wald type of \"time dilation\" are such examples. }",
    "authors": [
      "Kyriakos Papadopoulos"
    ],
    "publication_date": "2021-07-12T11:39:58Z",
    "arxiv_id": "http://arxiv.org/abs/2107.06646v1",
    "download_url": "http://arxiv.org/abs/2107.06646v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Metamaterials",
    "abstract": "One of the most significant breakthroughs in physics of the last decade has\nbeen the discovery that materials with non-trivial topological properties for\nelectronic, electromagnetic, acoustic and mechanical responses can be designed\nand manufactured at our will through engineered metamaterials (MMs). Here, we\nreview the foundation and the state-of-the-art advances of topological\nphotonics, acoustics and mechanical MMs. We discuss how topological MMs enable\nnontrivial wave phenomena in physics, engineering, of great interest for a\nbroad range of interdisciplinary science disciplines such as classical and\nquantum chemistry. We first introduce the foundations of topological materials\nand the main concepts behind their peculiar features, including the concepts of\ntopological charge and geometric phase. We then discuss the topology of\nelectronic band structures in natural topological materials, like topological\ninsulators and gapless Dirac and Weyl semimetals. Based on these concepts, we\nreview the concept, design and response of topologically nontrivial MMs in\nphotonics and phononics, including topological phases in 2D MMs with and\nwithout time-reversal symmetry, Floquet TIs based on spatial and temporal\nmodulation, topological phases in 3D MMs, higher-order topological phases in\nMMs, non-Hermitian and nonlinear topological MMs and the topological features\nof scattering anomalies. We also discuss the topological properties emerging in\nother related contexts, such as the topological aspects of chemical reactions\nand polaritons. This survey aims at connecting the recent advances in a broad\nrange of scientific areas associated with topological concepts, and highlights\nopportunities offered by topological MMs for the chemistry community at large.",
    "authors": [
      "Xiang Ni",
      "Simon Yves",
      "Alex Krasnok",
      "Andrea Alu"
    ],
    "publication_date": "2022-11-18T03:11:24Z",
    "arxiv_id": "http://arxiv.org/abs/2211.10006v1",
    "download_url": "http://arxiv.org/abs/2211.10006v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological states constructed by two different trivial quantum wires",
    "abstract": "The topological states of the two-leg and three-leg ladders formed by two\ntrivial quantum wires with different lattice constants are theoretically\ninvestigated. Firstly, we take two trivial quantum wires with a lattice\nconstant ratio of 1:2 as an example. For the symmetric nearest-neighbor\nintra-chain hopping two-leg ladder, the inversion symmetry protected\ntopological insulator phase with two degenerate topological edge states\nappears. When the inversion symmetry is broken, the topological insulators with\none or two topological edge states of different energies and topological metals\nwith edge states embedded in the bulk states could emerge depending on the\nfilling factor. The topological origin of these topological states in the\ntwo-leg ladders is the topological properties of the Chern insulators and Chern\nmetals. According to the arrangement of two trivial quantum wires, we construct\ntwo types of three-leg ladders. Each type of the three-leg ladder could be\ndivided into one trivial subspace and one topological nontrivial subspace by\nunitary transformation. The topological nontrivial subspace corresponds to the\neffective two-leg ladder model. As the filling factor changes, the system could\nbe in topological insulators or topological metals phases. When the two-leg\nladder is constructed by two trivial quantum wires with a lattice constant\nratio of 1:3 and 2:3, the system could also realize rich topological states\nsuch as the topological insulators and topological metals with the topological\nedge states. These rich topological states in the two-leg and three-leg ladders\ncould be confirmed by current experimental techniques.",
    "authors": [
      "Jing-Run Lin",
      "Linxi Lv",
      "Zheng-Wei Zuo"
    ],
    "publication_date": "2024-04-10T10:22:20Z",
    "arxiv_id": "http://arxiv.org/abs/2404.06886v2",
    "download_url": "http://arxiv.org/abs/2404.06886v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The topological quantization and the branch process of the\n  (k-1)-dimensional topological defects",
    "abstract": "In the light of $\\phi$-mapping method and topological current theory, the\ntopological structure and the topological quantization of arbitrary dimensional\ntopological defects are obtained under the condition that the Jacobian\n$J(\\phi/v) \\neq 0$. When $J(\\phi/v)=0$, it is shown that there exist the\ncrucial case of branch process. Based on the implicit function theorem and the\nTaylor expansion, we detail the bifurcation of generalized topological current\nand find different directions of the bifurcation. The arbitrary dimensional\ntopological defects are found splitting or merging at the degenerate point of\nfield function $\\vec \\phi$ but the total charge of the topological defects is\nstill unchanged.",
    "authors": [
      "Yishi Duan",
      "Ying Jiang",
      "Guohong Yang"
    ],
    "publication_date": "1998-10-15T06:30:47Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/9810111v1",
    "download_url": "http://arxiv.org/abs/hep-th/9810111v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological groups: where to from here?",
    "abstract": "This is an account of one man's view of the current perspective of theory of\ntopological groups. We survey some recent developments which are, from our\nviewpoint, indicative of the future directions, concentrating on actions of\ntopological groups on compacta, embeddings of topological groups, free\ntopological groups, and `massive' groups (such as groups of homeomorphisms of\ncompacta and groups of isometries of various metric spaces).",
    "authors": [
      "Vladimir Pestov"
    ],
    "publication_date": "1999-10-27T02:30:10Z",
    "arxiv_id": "http://arxiv.org/abs/math/9910144v4",
    "download_url": "http://arxiv.org/abs/math/9910144v4",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Embedding topological semigroups into the hyperspaces over topological\n  groups",
    "abstract": "We study algebraic and topological properties of subsemigroups of the\nhyperspace exp(G) of non-empty compact subsets of a topological group G endowed\nwith the Vietoris topology and the natural semigroup operation. On this base we\nprove that a compact Clifford topological semigroup S is topologically\nisomorphic to a subsemigroup of exp(G) for a suitable topological group G if\nand only if S is a topological inverse semigroup with zero-dimensional\nidempotent semilattice.",
    "authors": [
      "Taras Banakh",
      "Olena Hryniv"
    ],
    "publication_date": "2010-12-12T15:32:15Z",
    "arxiv_id": "http://arxiv.org/abs/1012.2550v1",
    "download_url": "http://arxiv.org/abs/1012.2550v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fractal Topology Foundations",
    "abstract": "In this paper, we introduce the foundation of a fractal topological space\nconstructed via a family of nested topological spaces endowed with subspace\ntopologies, where the number of topological spaces involved in this family is\nrelated to the appearance of new structures on it. The greater the number of\ntopological spaces we use, the stronger the subspace topologies we obtain. The\nfractal manifold model is brought up as an illustration of space that is\nlocally homeomorphic to the fractal topological space.",
    "authors": [
      "Helene Porchon"
    ],
    "publication_date": "2012-01-25T08:51:58Z",
    "arxiv_id": "http://arxiv.org/abs/1201.6223v1",
    "download_url": "http://arxiv.org/abs/1201.6223v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spintronics and spincaloritronics in topological insulators",
    "abstract": "We study spintronics and spincaloritronics in topological insulators. We show\nspintronics effects in 2D topological insulator junctions and 3D topological\ninsulators coupled to ferromagnets. We also investigate spin polarization on\nthe surface of a topological insulator induced by a circularly polarized light\nand refraction at the junction between two topological insulators. As for\nspincaloritronics effects, we show transverse magnetic heat transport and\nthermoelectric transport in topological insulators. Finite-size effect in\ntopological insulators and band structure engineering of interface states of\ntopological insulators are also discussed.",
    "authors": [
      "Takehito Yokoyama",
      "Shuichi Murakami"
    ],
    "publication_date": "2013-01-23T07:19:51Z",
    "arxiv_id": "http://arxiv.org/abs/1301.5416v1",
    "download_url": "http://arxiv.org/abs/1301.5416v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Completeness and related properties of the graph topology on function\n  spaces",
    "abstract": "The graph topology $\\tau_{\\Gamma}$ is the topology on the space $C(X)$ of all\ncontinuous functions defined on a Tychonoff space $X$ inherited from the\nVietoris topology on $X\\times \\mathbb R$ after identifying continuous functions\nwith their graphs. It is shown that all completeness properties between\ncomplete metrizability and hereditary Baireness coincide for the graph topology\nif and only if $X$ is countably compact; however, the graph topology is\n$\\alpha$-favorable in the strong Choquet game, regardless of $X$. Analogous\nresults are obtained for the fine topology on $C(X)$. Pseudocompleteness, along\nwith properties related to 1st and 2nd countability of $(C(X),\\tau_{\\Gamma})$\nare also investigated.",
    "authors": [
      "Lubica Holá",
      "László Zsilinszky"
    ],
    "publication_date": "2013-04-24T15:24:08Z",
    "arxiv_id": "http://arxiv.org/abs/1304.6628v1",
    "download_url": "http://arxiv.org/abs/1304.6628v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topologies induced by group actions",
    "abstract": "We introduce some canonical topologies induced by actions of topological\ngroups on groups and rings. For $H$ being a group [or a ring] and $G$ a\ntopological group acting on $H$ as automorphisms, we describe the finest group\n[ring] topology on $H$ under which the action of $G$ on $H$ is continuous. We\nalso study the introduced topologies in the context of Polish structures. In\nparticular, we prove that there may be no Hausdorff topology on a group $H$\nunder which a given action of a Polish group on $H$ is continuous.",
    "authors": [
      "Jan Dobrowolski"
    ],
    "publication_date": "2014-12-01T12:14:23Z",
    "arxiv_id": "http://arxiv.org/abs/1412.0447v1",
    "download_url": "http://arxiv.org/abs/1412.0447v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Characterization of topological phase transitions via topological\n  properties of transition points",
    "abstract": "We study topological properties of phase transition points of topological\nquantum phase transitions by assigning a topological invariant defined on a\nclosed circle or surface surrounding the phase transition point in the\nparameter space of momentum and transition driving parameter. By applying our\nscheme to the Su-Schrieffer-Heeger model and Haldane model, we demonstrate that\nthe topological phase transition can be well characterized by the defined\ntopological invariant of the transition point, which reflects the change of\ntopological invariants of topologically different phases across the phase\ntransition point.",
    "authors": [
      "Linhu Li",
      "Shu Chen"
    ],
    "publication_date": "2015-03-17T09:17:10Z",
    "arxiv_id": "http://arxiv.org/abs/1503.04959v2",
    "download_url": "http://arxiv.org/abs/1503.04959v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological quantum phase transition of light",
    "abstract": "We study theoretically the topological quantum phase transition in Cavity QED\nlattice. We predict the condition for non-topological phase to the topological\nphase transition conditions for three different model Hamiltonians in cavity\nQED lattice. We study these topological quantum phase transition through\nwinding number, which is a topological invariant quantity. We argue that the\nappearance of topological phase in these systems where the discrete Z 2\nsymmetry broken. We show that the non-topological state is the vacuum state of\nthe system where each cavity contains fermionic type excitations from\nlight-matter interaction whereas the topological state of system contains\nMajorana modes of excitations at the end cavity of the lattice.",
    "authors": [
      "Chandan GN",
      "N. Banerjee",
      "Sujit Sarkar"
    ],
    "publication_date": "2015-06-22T11:00:47Z",
    "arxiv_id": "http://arxiv.org/abs/1506.06549v1",
    "download_url": "http://arxiv.org/abs/1506.06549v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Stiefel--Whitney theory of topological insulators",
    "abstract": "We study the topological band theory of time reversal invariant topological\ninsulators and interpret the topological $\\mathbb{Z}_2$ invariant as an\nobstruction in terms of Stiefel--Whitney classes. The band structure of a\ntopological insulator defines a Pfaffian line bundle over the momentum space,\nwhose structure group can be reduced to $\\mathbb{Z}_2$. So the topological\n$\\mathbb{Z}_2$ invariant will be understood by the Stiefel--Whitney theory,\nwhich detects the orientability of a principal $\\mathbb{Z}_2$-bundle. Moreover,\nthe relation between weak and strong topological insulators will be understood\nbased on cobordism theory. Finally, the topological $\\mathbb{Z}_2$ invariant\ngives rise to a fully extended topological quantum field theory (TQFT).",
    "authors": [
      "Ralph M. Kaufmann",
      "Dan Li",
      "Birgit Wehefritz-Kaufmann"
    ],
    "publication_date": "2016-04-11T04:54:21Z",
    "arxiv_id": "http://arxiv.org/abs/1604.02792v1",
    "download_url": "http://arxiv.org/abs/1604.02792v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Countable Successor Ordinals as Generalized Ordered Topological Spaces",
    "abstract": "A topological space $L$ is called a linear ordered topological space (LOTS)\nwhenever there is a linear order $\\leq$ on $L$ such that the topology on $L$ is\ngenerated by the open sets of the form $(a, b)$ with $a < b$ and $a, b \\in L\n\\cup \\{ -\\infty, +\\infty \\}$. A topological space $X$ is called a generalized\nordered space (GO-space) whenever $X$ is topologically embeddable in a LOTS.\nMain Theorem: Let $X$ be a Hausdorff topological space. Assume that any\ncontinuous image of $X$ is a GO-space. Then $X$ is homeomorphic to a countable\nsuccessor ordinal (with the order topology).\n  The converse trivially holds.",
    "authors": [
      "Robert Bonnet",
      "Arkady Leiderman"
    ],
    "publication_date": "2016-05-17T18:10:04Z",
    "arxiv_id": "http://arxiv.org/abs/1605.05271v2",
    "download_url": "http://arxiv.org/abs/1605.05271v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$\\mathfrak G$-bases in free (locally convex) topological vector spaces",
    "abstract": "We characterize topological (and uniform) spaces whose free (locally convex)\ntopological vector spaces have a local $\\mathfrak G$-base. A topological space\n$X$ has a local $\\mathfrak G$-base if every point $x$ of $X$ has a neighborhood\nbase $(U_\\alpha)_{\\alpha\\in\\omega^\\omega}$ such that $U_\\beta\\subset U_\\alpha$\nfor all $\\alpha\\le\\beta$ in $\\omega^\\omega$. To construct $\\mathfrak G$-bases\nin free topological vector spaces, we exploit a new description of the topology\nof a free topological vector space over a topological (or more generally,\nuniform) space.",
    "authors": [
      "Taras Banakh",
      "Arkady Leiderman"
    ],
    "publication_date": "2016-06-06T22:37:58Z",
    "arxiv_id": "http://arxiv.org/abs/1606.01967v2",
    "download_url": "http://arxiv.org/abs/1606.01967v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Boosting the discovery of 3D topological materials: mixing chemistry\n  with physics via a two-step computational screening strategy",
    "abstract": "Topological materials in crystal solids, including topological insulators\n(TIs), topological crystalline insulators (TCIs), topological Dirac semimetals\n(DSMs), topological Weyl semimetals (WSMs), topological Dirac or Weyl nodal\nline semimetals (NLSMs) and beyond, are mainly featured with topological,\nprotected non-trivial surface states, and their bulk phases are insulators or\nsemimetals with the proper presence of Dirac cones, Weyl nodes or Dirac nodal\nlines around the Fermi level. The author suggests a two-step computational\nscreening strategy of 3D topological materials by mixing chemistry with physics\nwith the considerations of fully filled bands and band inversion.",
    "authors": [
      "Xing-Qiu Chen"
    ],
    "publication_date": "2017-05-01T12:23:24Z",
    "arxiv_id": "http://arxiv.org/abs/1705.01168v2",
    "download_url": "http://arxiv.org/abs/1705.01168v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological spaces of persistence modules and their properties",
    "abstract": "Persistence modules are a central algebraic object arising in topological\ndata analysis. The notion of interleaving provides a natural way to measure\ndistances between persistence modules. We consider various classes of\npersistence modules, including many of those that have been previously studied,\nand describe the relationships between them. In the cases where these classes\nare sets, interleaving distance induces a topology. We undertake a systematic\nstudy the resulting topological spaces and their basic topological properties.",
    "authors": [
      "Peter Bubenik",
      "Tane Vergili"
    ],
    "publication_date": "2018-02-22T15:56:39Z",
    "arxiv_id": "http://arxiv.org/abs/1802.08117v2",
    "download_url": "http://arxiv.org/abs/1802.08117v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological invariants for holographic semimetals",
    "abstract": "We study the behavior of fermion spectral functions for the holographic\ntopological Weyl and nodal line semimetals. We calculate the topological\ninvariants from the Green functions of both holographic semimetals using the\ntopological Hamiltonian method, which calculates topological invariants of\nstrongly interacting systems from an effective Hamiltonian system with the same\ntopological structure. Nontrivial topological invariants for both systems have\nbeen obtained and the presence of nontrivial topological invariants further\nsupports the topological nature of the holographic semimetals.",
    "authors": [
      "Yan Liu",
      "Ya-Wen Sun"
    ],
    "publication_date": "2018-09-03T09:19:39Z",
    "arxiv_id": "http://arxiv.org/abs/1809.00513v2",
    "download_url": "http://arxiv.org/abs/1809.00513v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring Topological Superconductivity in Topological Materials",
    "abstract": "The exploration of topological superconductivity and Majorana zero modes has\nbecome a rapidly developing field. Many types of proposals to realize\ntopological superconductors have been presented, and significant advances have\nbeen recently made. In this review, we conduct a survey on the experimental\nprogress in possible topological superconductors and induced superconductivity\nin topological insulators or semimetals as well as artificial structures. The\napproaches to inducing superconductivity in topological materials mainly\ninclude high pressure application, the hard-tip point contact method, chemical\ndoping or intercalation, the use of artificial topological superconductors, and\nelectric field gating. The evidence supporting topological superconductivity\nand signatures of Majorana zero modes are also discussed and summarized.",
    "authors": [
      "Yupeng Li",
      "Zhu-An Xu"
    ],
    "publication_date": "2019-07-10T02:44:18Z",
    "arxiv_id": "http://arxiv.org/abs/1907.04493v1",
    "download_url": "http://arxiv.org/abs/1907.04493v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Toplogical semigroups embedded into topological groups",
    "abstract": "In this paper we give conditions under which a topological semigroup can be\nembedded algebraically and topologically into a compact topological group. We\nprove that every feebly compact regular first countable cancellative\ncommutative topological semigroup with open shifts is a topological group, as\nwell as every connected locally compact Hausdorff cancellative commutative\ntopological monoid with open shifts. Finally, we use these results to give\nsufficient conditions on a topological semigroup that guarantee it to have\ncountable cellularity.",
    "authors": [
      "Julio César Hernández Arzusa"
    ],
    "publication_date": "2020-05-30T17:11:53Z",
    "arxiv_id": "http://arxiv.org/abs/2006.00320v2",
    "download_url": "http://arxiv.org/abs/2006.00320v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Counterexamples for Topological Complexity in Digital Images",
    "abstract": "Digital topology has its own working conditions and sometimes differs from\nthe normal topology. In the area of topological robotics, we have important\ncounterexamples in this study to emphasize this red line between a digital\nimage and a topological space. We indicate that the results on topological\ncomplexities of certain path-connected topological spaces show alterations in\ndigital images. We also give a result about the digital topological complexity\nnumber using the genus of a digital surface in discrete geometry.",
    "authors": [
      "Melih İs",
      "İsmet Karaca"
    ],
    "publication_date": "2020-06-07T13:13:00Z",
    "arxiv_id": "http://arxiv.org/abs/2006.04144v1",
    "download_url": "http://arxiv.org/abs/2006.04144v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A topologically rigid set of quotients of the Davis complex",
    "abstract": "A class of topological spaces is topologically rigid if any two spaces with\nthe same fundamental group are also homeomorphic. Topological rigidity, in\naddition to its intrinsic interest, has been useful for solving abstract\ncommensurability questions. In this paper, we explore the topological rigidity\nof quotients of the Davis complex of certain right angled Coxeter groups by\nproviding conditions on the defining graphs that obstruct topological rigidity.\nFurthermore, we explore why topological rigidity is hard to achieve for\nquotients of the Davis complex. Nonetheless, we conclude by introducing\ninfinitely many infinite topologically rigid subclasses.",
    "authors": [
      "Yandi Wu"
    ],
    "publication_date": "2022-04-26T01:54:16Z",
    "arxiv_id": "http://arxiv.org/abs/2204.12028v2",
    "download_url": "http://arxiv.org/abs/2204.12028v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological Marker Currents in Chern Insulators",
    "abstract": "Topological states of matter exhibit many novel properties due to the\npresence of robust topological invariants such as the Chern index. These global\ncharacteristics pertain to the system as a whole and are not locally defined.\nHowever, local topological markers can distinguish between topological phases,\nand they can vary in space. In equilibrium, we show that the topological marker\ncan be used to extract the critical behavior of topological phase transitions.\nOut of equilibrium, we show that the topological marker spreads via a flow of\ncurrents, with a bounded maximum propagation speed. We discuss the\npossibilities for measuring the topological marker and its flow in experiment.",
    "authors": [
      "M. D. Caio",
      "G. Möller",
      "N. R. Cooper",
      "M. J. Bhaseen"
    ],
    "publication_date": "2018-08-30T18:00:12Z",
    "arxiv_id": "http://arxiv.org/abs/1808.10463v1",
    "download_url": "http://arxiv.org/abs/1808.10463v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Certain topological methods for computing digital topological complexity",
    "abstract": "In this paper, we examine the relations of two closely related concepts, the\ndigital Lusternik-Schnirelmann category and the digital higher topological\ncomplexity, with each other in digital images. For some certain digital images,\nwe introduce $\\kappa-$topological groups in the digital topological manner for\nhaving stronger ideas about the digital higher topological complexity. Our aim\nis to improve the understanding of the digital higher topological complexity.\nWe present examples and counterexamples for $\\kappa-$topological groups.",
    "authors": [
      "Melih Is",
      "Ismet Karaca"
    ],
    "publication_date": "2021-02-28T11:39:43Z",
    "arxiv_id": "http://arxiv.org/abs/2103.00468v1",
    "download_url": "http://arxiv.org/abs/2103.00468v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological spin defects of light",
    "abstract": "Topological defects are found in a variety of systems, and their existence\nare robust under perturbations due to their topological nature. Here we\nintroduce a new type of topological defects found in electromagnetic waves:\ntopological spin defects. Such a defect is associated with a point where the\nelectromagnetic spin density is zero, and generically have a nontrivial\ntopological spin texture surrounding the defect point. Due to such spin\ntexture, a topological spin defect possesses a quantized topological charge. We\nprovide examples where isolated defect point, periodic or quasi-periodic defect\nlattices can be created. Such topological spin defect points may find\napplications in 3D imaging and nanoparticle manipulation.",
    "authors": [
      "Haiwen Wang",
      "Charles C. Wojcik",
      "Shanhui Fan"
    ],
    "publication_date": "2022-10-17T02:03:35Z",
    "arxiv_id": "http://arxiv.org/abs/2210.08694v1",
    "download_url": "http://arxiv.org/abs/2210.08694v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Typed topology and its application to data set",
    "abstract": "The concept of $typed$ $topology$ is introduced. In a typed topological\nspace, some open sets are assigned \"types\", and topological concepts such as\nclosure, connectedness can be defined using types. A finite data set in $R^2$\nis a typically typed topological space. Clusters calculated by the DBSCAN\nalgorithm for data clustering can be well represent in a finite typed\ntopological space. Other concepts such as tracks, port (starting points),\ntype-p-connectedness, p-closure-connectedness, indexing, branches are also\nintroduced for a finite typed topological space. Finally, $left-r$ and\n$up-left-r$ type open sets are introduced for data sets in $R^2$, so that\ntracks, port, branches can be calculated.",
    "authors": [
      "Wanjun Hu"
    ],
    "publication_date": "2023-02-10T16:15:42Z",
    "arxiv_id": "http://arxiv.org/abs/2302.05352v2",
    "download_url": "http://arxiv.org/abs/2302.05352v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Floquet topological phases with time-reversal and space inversion\n  symmetries and dynamical detection of topological charges",
    "abstract": "For spinful systems with spin 1/2, it is generally believed that P and T\ninvariant strong and second-order topologies exist in four band and eight band\nsystem, respectively. Here, by using periodic driving, we find it is possible\nto have strong topological insulator, second-order topological insulator and\nhybrid-order topological insulator in a single four band system. Furthermore,\nwe established a direct connection between topology and dynamics. More\nconvenient experimental detection for these topological phases has also been\nproposed. This study provides the theoretical basis for novel topological\ninsulator that possess hybrid-order boundary states beyond the conventional\nregimes.",
    "authors": [
      "Hong Wu",
      "Yu-Chen Dong",
      "Hui Liu"
    ],
    "publication_date": "2024-06-12T13:10:30Z",
    "arxiv_id": "http://arxiv.org/abs/2406.08532v1",
    "download_url": "http://arxiv.org/abs/2406.08532v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On The Whisker Topology",
    "abstract": "The purpose of this paper is to explore properties of the whisker topology,\nwhich is a topology endowed on the fundamental group and whose utility is to\ndetect locally complicated phenomena in pathological topological spaces. We\nshow that the whisker topology preserves products, resolve an open question\nregarding the existence of a space which makes $\\pi_1^{wh}(X,x_0)$ a\nnon-discrete, non-abelian, and Hausdorff topological group, and show the\nwhisker topology is not separable on the earring group $\\pi_1(\\Er^1,x_0)$.",
    "authors": [
      "John K. Aceti"
    ],
    "publication_date": "2024-11-26T13:01:20Z",
    "arxiv_id": "http://arxiv.org/abs/2412.05304v1",
    "download_url": "http://arxiv.org/abs/2412.05304v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Algorithms and topological invariants for dynamic systems. III.\n  Algorithms for Recognition and Classification of 2-Dimensional Surfaces",
    "abstract": "We construct algorithms and topological invariants that allow us to\ndistinguish the topological type of a surface, as well as functions and vector\nfields for their topological equivalence. In the first part (arXiv:2501.15657),\nwe discused basic concepts of diferential topology. In the second part\n(arXiv:2502.00506 ) we discused the main discrete topological structures used\nin the topological theory of dynamic systems. In third part we construct\nalgorithms that allow us recognise 2-manifolds and 3-manifolds in simplicial\ncomplexes and regular CW-complex and detreminate topological type for\n2-manifolds (connectivity, type of orientability, genus, number of boundary\ncomponent).",
    "authors": [
      "Alexandr Prishlyak"
    ],
    "publication_date": "2025-02-14T07:35:01Z",
    "arxiv_id": "http://arxiv.org/abs/2502.09958v1",
    "download_url": "http://arxiv.org/abs/2502.09958v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological groupoids with involution and real algebraic stacks",
    "abstract": "To a topological groupoid endowed with an involution, we associate a\ntopological groupoid of fixed points, generalizing the fixed-point subspace of\na topological space with involution. We prove that when the topological\ngroupoid with involution arises from a Deligne-Mumford stack over $\\mathbb{R}$,\nthis fixed locus coincides with the real locus of the stack. This provides a\ntopological framework to study real algebraic stacks, and in particular real\nmoduli spaces. Finally, we propose a Smith-Thom type conjecture in this\nsetting, generalizing the Smith-Thom inequality for topological spaces endowed\nwith an involution.",
    "authors": [
      "Emiliano Ambrosi",
      "Olivier de Gaay Fortman"
    ],
    "publication_date": "2025-04-03T16:54:46Z",
    "arxiv_id": "http://arxiv.org/abs/2504.02760v2",
    "download_url": "http://arxiv.org/abs/2504.02760v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparison of Topologies on Fundamental Groups with Subgroup Topology\n  Viewpoint",
    "abstract": "In order to make the fundamental group, one of the most well known invariants\nin algebraic topology, more useful and powerful some researchers have\nintroduced and studied various topologies on the fundamental group from the\nbeginning of the 21st century onwards. In this paper by reviewing these\ntopologies, using the concept of subgroup topology, we are going to compare\nthese topologies in order to present some results on topologized fundamental\ngroups.",
    "authors": [
      "Naghme Shahami",
      "Behrooz Mashayekhy"
    ],
    "publication_date": "2025-08-26T15:22:42Z",
    "arxiv_id": "http://arxiv.org/abs/2508.19122v2",
    "download_url": "http://arxiv.org/abs/2508.19122v2",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The topological fundamental group and free topological groups",
    "abstract": "The topological fundamental group $\\pi_{1}^{top}$ is a homotopy invariant\nfiner than the usual fundamental group. It assigns to each space a\nquasitopological group and is discrete on spaces which admit universal covers.\nFor an arbitrary space $X$, we compute the topological fundamental group of the\nsuspension space $\\Sigma(X_+)$ and find that $\\pi_{1}^{top}(\\Sigma(X_+))$\neither fails to be a topological group or is the free topological group on the\npath component space of $X$. Using this computation, we provide an abundance of\ncounterexamples to the assertion that all topological fundamental groups are\ntopological groups. A relation to free topological groups allows us to reduce\nthe problem of characterizing Hausdorff spaces $X$ for which\n$\\pi_{1}^{top}(\\Sigma(X_+))$ is a Hausdorff topological group to some well\nknown classification problems in topology.",
    "authors": [
      "Jeremy Brazas"
    ],
    "publication_date": "2010-06-01T11:55:46Z",
    "arxiv_id": "http://arxiv.org/abs/1006.0119v3",
    "download_url": "http://arxiv.org/abs/1006.0119v3",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Distance measures and evolution of polymer chains in their topological\n  space",
    "abstract": "Conformational transitions are ubiquitous in biomolecular systems, have\nsignificant functional roles and are subject to evolutionary pressures. Here we\nprovide a first theoretical framework for topological transition, i.e.\nconformational transitions that are associated with changes in molecular\ntopology. For folded linear biomolecules, arrangement of intramolecular\ncontacts is identified as a key topological property, termed as circuit\ntopology. Distance measures are proposed as reaction coordinates to represent\nprogress along a pathway from initial topology to final topology. Certain\ntopological classes are shown to be more accessible from a random topology. We\nstudy dynamic stability and pathway degeneracy associated with a topological\nreaction and found that off-pathways might seriously hamper evolution to\ndesired topologies. Finally we present an algorithm for estimating the number\nof intermediate topologies visited during a topological reaction. The results\nof this study are relevant to, among others, structural studies of RNA and\nproteins, analysis of topologically associated domains in chromosomes, and\nmolecular evolution.",
    "authors": [
      "Alireza Mashaghi",
      "Abolfazl Ramezanpour"
    ],
    "publication_date": "2015-09-01T19:07:47Z",
    "arxiv_id": "http://arxiv.org/abs/1509.00444v1",
    "download_url": "http://arxiv.org/abs/1509.00444v1",
    "field_of_study": "mathematics",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]