[
  {
    "title": "Singularity-free approximate analytical solution of capillary rise dynamics",
    "abstract": "Capillary rise is one of the most well-known capillarity; however, no single and complete analytic solution has ever been obtained yet. This paper used the singularity-free equation, and successfully obtained its Taylor's series solution. The solution revealed that capillary rise dynamics is mainly controlled by the Bond number and the Galileo number, while the Bond number is a key parameter within the solution. To avoid the poor rate of convergence of Taylor's series solution, an approximate analytic solution was proposed, which was verified numerically.",
    "authors": [
      "Bohua Sun"
    ],
    "publication_date": "2018-07-30T11:27:19Z",
    "arxiv_id": "http://arxiv.org/abs/1809.01486v1",
    "download_url": "https://arxiv.org/abs/1809.01486v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Improved Laboratory-Based XAFS and XES Spectrometer for Analytical Applications in Materials Chemistry Research",
    "abstract": "X-ray absorption fine structure (XAFS) and x-ray emission spectroscopy (XES) are advanced x-ray spectroscopies that impact a wide range of disciplines. However, unlike the majority of other spectroscopic methods, XAFS and XES are accompanied by an unusual access model, wherein; the dominant use of the technique is for premier research studies at world-class facilities, i.e., synchrotron x-ray light sources. In this paper we report the design and performance of an improved spectrometer XAFS and XES based on the general conceptual design of Seidler, et al., Rev. Sci. Instrum. 2014. New developments include reduced mechanical degrees of freedom, much-increased flux, and a wider Bragg angle range to enable extended x-ray absorption fine structure (EXAFS) for the first time with this type of modern laboratory XAFS configuration. This instrument enables a new class of routine applications that are incompatible with the mission and access model of the synchrotron light sources. To illustrate this, we provide numerous examples of x-ray absorption near edge structure (XANES), EXAFS, and XES results for a variety of problems and energy ranges. Highlights include XAFS and XES measurements of battery electrode materials, EXAFS of Ni and V with full modeling of results to validate monochromator performance, valence-to-core XES for 3d transition metal compounds, and uranium XANES and XES for different oxidation states. Taken en masse, these results further support the growing perspective that modern laboratory-based XAFS and XES have the potential to develop a new branch of analytical chemistry.",
    "authors": [
      "Evan P. Jahrman",
      "William M. Holden",
      "Alex S. Ditter",
      "Devon R. Mortensen",
      "Gerald T. Seidler",
      "Timothy T. Fister",
      "Stosh A. Kozimor",
      "Louis F. J. Piper",
      "Jatinkumar Rana",
      "Neil C. Hyatt",
      "Martin C. Stennett"
    ],
    "publication_date": "2018-07-21T00:03:29Z",
    "arxiv_id": "http://arxiv.org/abs/1807.08059v1",
    "download_url": "https://arxiv.org/abs/1807.08059v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical modelling of thermal residual stresses and optimal design of ZrO2/(ZrO2+Ni) sandwich ceramics",
    "abstract": "The joining of ceramics with metals have been extensively used in applications requiring high strength and excellent heat insulation. However, evaluating the residual stress generated inevitably due to the mismatch in coefficients of thermal expansion of ceramic and metal is challenging, which is very important for fabrication and characterization of layered inhomogeneous material. A simplified analytical model considering the overall deformation compatibility is established to compute the interlaminar residual stresses of the ZrO2/(ZrO2+Ni) sandwich ceramics, which agrees well with the results obtained by the commercial finite element package. The effects of the thickness ratio of the transitional layer to the middle layer, and the number of transitional layers on the properties of the ZrO2/(ZrO2+Ni) sandwich ceramics are researched to obtain the optimal structure.",
    "authors": [
      "Wenbin Zhou",
      "Rubing Zhang",
      "Shigang Ai",
      "Yongmao Pei",
      "Daining Fang"
    ],
    "publication_date": "2019-04-13T12:55:58Z",
    "arxiv_id": "http://arxiv.org/abs/1907.09259v1",
    "download_url": "https://arxiv.org/abs/1907.09259v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical calculation of the solid angle defined by a cylindrical detector and a point cosine source with parallel axes",
    "abstract": "We derive analytical expressions for the solid angle subtended by a right finite circular cylinder at a point source with cosine angular distribution in the case where the source direction is parallel to the cylinder axis. As a subsidiary result, an expression for the solid angle subtended by a disc detector at a spread disc source is also provided, in the case where the two discs have a common symmetry axis which is also coincident with the source direction.",
    "authors": [
      "M. J. Prata"
    ],
    "publication_date": "2003-02-02T01:15:55Z",
    "arxiv_id": "http://arxiv.org/abs/math-ph/0302003v2",
    "download_url": "https://arxiv.org/abs/math-ph/0302003v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical Solution of a Gas Release Problem Considering Permeation with Time-Dependent Boundary Conditions",
    "abstract": "In this paper the determination of material properties such as Sieverts' constant (solubility) and diffusivity (transport rate) via so-called gas release experiments is discussed. In order to simulate the time-dependent hydrogen fluxes and concentration profiles efficiently, we make use of an analytical method, namely we provide an analytical solution for the corresponding diffusion equations on a cylindrical specimen and a cylindrical container for three boundary conditions. These conditions occur in three phases -- loading phase, evacuation phase and gas release phase. In the loading phase the specimen is charged with hydrogen assuring a constant partial pressure of hydrogen. Then the gas will be quickly removed by a vacuum pump in the second phase, and finally in the third time interval, the hydrogen is released from the specimen to the gaseous phase, where the pressure increase will be measured by an equipment which is attached to the cylindrical container. The investigated diffusion equation in each phase is a simple homogeneous equation, but due to the complex time-dependent boundary conditions which include the Sieverts' constant and the pressure, we transform the homogeneous equations to the non-homogeneous ones with a zero Dirichlet boundary condition. Compared with the time consuming numerical methods our analytical approach has an advantage that the flux of desorbed hydrogen can be explicitly given and therefore can be evaluated efficiently. Our analytical solution also assures that the time-dependent boundary conditions are exactly satisfied and furthermore that the interaction between specimen and container is correctly taken into account.",
    "authors": [
      "Marvin R. Schulz",
      "Kaori Nagatou",
      "Axel von der Weth",
      "Frederik Arbeiter",
      "Volker Pasler"
    ],
    "publication_date": "2021-04-14T20:03:15Z",
    "arxiv_id": "http://arxiv.org/abs/2104.07101v1",
    "download_url": "https://arxiv.org/abs/2104.07101v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]