[
  {
    "title": "SELENA: Semi-analytical Integrator for Lunar Artificial Satellites",
    "abstract": "The present report summarizes the main theory and implementation steps associated with SELENA (SEmi-anaLytical intEgrator for a luNar Artificial satellite), i.e. the semi-analytical propagator for lunar satellite orbits developed in the framework of the the R&T R-S20/BS-0005-062 CNES research activity in collaboration between the University of Padova (UniPd), and the Aristotle University of Thessaloniki (AUTH), both acting as contractors with CNES.\n  A detailed account of the method, algorithms and symbolic manipulations employed in the derivation of the final theory are described in detail in this report: they invoke the use of canonical perturbation theory in the form of Lie series computed in `closed form', i.e., without expansions in the satellite's orbital eccentricity. These algorithms are provided in the form of a symbolic package accompanying the present report. The package contains symbolic algebra programs, as well as explicit data files containing the final Hamiltonian, equations of motion and transformations (i.e. the coefficients and exponents of each variable in each term) leading to the averaging of the short-periodic terms in the satellite's equations of motion.",
    "authors": [
      "Christos Efthymiopoulos",
      "Kleomenis Tsiganis",
      "Ioannis Gkolias",
      "Michalis Gaitanas",
      "Carlos Yanez"
    ],
    "publication_date": "2023-09-21T09:15:54Z",
    "arxiv_id": "http://arxiv.org/abs/2309.11904v1",
    "download_url": "https://arxiv.org/abs/2309.11904v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonconvex penalties with analytical solutions for one-bit compressive sensing",
    "abstract": "One-bit measurements widely exist in the real world, and they can be used to recover sparse signals. This task is known as the problem of learning halfspaces in learning theory and one-bit compressive sensing (1bit-CS) in signal processing. In this paper, we propose novel algorithms based on both convex and nonconvex sparsity-inducing penalties for robust 1bit-CS. We provide a sufficient condition to verify whether a solution is globally optimal or not. Then we show that the globally optimal solution for positive homogeneous penalties can be obtained in two steps: a proximal operator and a normalization step. For several nonconvex penalties, including minimax concave penalty (MCP), $\\ell_0$ norm, and sorted $\\ell_1$ penalty, we provide fast algorithms for finding the analytical solutions by solving the dual problem. Specifically, our algorithm is more than $200$ times faster than the existing algorithm for MCP. Its efficiency is comparable to the algorithm for the $\\ell_1$ penalty in time, while its performance is much better. Among these penalties, the sorted $\\ell_1$ penalty is most robust to noise in different settings.",
    "authors": [
      "Xiaolin Huang",
      "Ming Yan"
    ],
    "publication_date": "2017-06-04T02:17:12Z",
    "arxiv_id": "http://arxiv.org/abs/1706.01014v2",
    "download_url": "https://arxiv.org/abs/1706.01014v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data-Driven DRO and Economic Decision Theory: An Analytical Synthesis With Bayesian Nonparametric Advancements",
    "abstract": "We develop an analytical synthesis that bridges data-driven Distributionally Robust Optimization (DRO) and Economic Decision Theory under Ambiguity (DTA). By reinterpreting standard regularization and DRO techniques as data-driven counterparts of ambiguity-averse decision models, we provide a unified framework that clarifies their intrinsic connections. Building on this synthesis, we propose a novel DRO approach that leverages a popular DTA model of smooth ambiguity-averse preferences together with tools from Bayesian nonparametric statistics. Our baseline framework employs Dirichlet Process (DP) posteriors, which naturally extend to heterogeneous data sources via Hierarchical Dirichlet Processes (HDPs), and can be further refined to induce outlier robustness through a procedure that selectively filters poorly-fitting observations during training. Theoretical performance guarantees and convergence results, together with extensive simulations and real-data experiments, illustrate the method's favorable performance in terms of prediction accuracy and stability.",
    "authors": [
      "Nicola Bariletto",
      "Khai Nguyen",
      "Nhat Ho"
    ],
    "publication_date": "2024-05-21T19:03:09Z",
    "arxiv_id": "http://arxiv.org/abs/2405.13160v2",
    "download_url": "https://arxiv.org/abs/2405.13160v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytic multi-Baryonic solutions in the SU(N)-Skyrme model at finite density",
    "abstract": "We construct explicit analytic solutions of the $SU(N)$-Skyrme model (for generic $N$) suitable to describe different phases of nuclear pasta at finite volume in $(3+1)$ dimensions. The first type are crystals of Baryonic tubes (nuclear spaghetti) while the second type are smooth Baryonic layers (nuclear lasagna). Both, the ansatz for the spaghetti and the ansatz for the lasagna phases, reduce the complete set of Skyrme field equations to just one integrable equation for the profile within sectors of arbitrary high topological charge. We compute explicitly the total energy of both configurations in terms of the flavor number, the density and the Baryonic charge. Remarkably, our analytic results allow to compare explicitly the physical properties of nuclear spaghetti and lasagna phases. Our construction shows explicitly that, at lower densities, configurations with $N=2$ light flavors are favored while, at higher densities, configurations with $N=3$ are favored. Our construction also proves that in the high density regime (but still well within the range of validity of the Skyrme model) the lasagna configurations are favored while at low density the spaghetti configurations are favored. Moreover, the integrability property of the present configurations is not spoiled by the inclusion of the subleading corrections to the Skyrme model arising in the 't Hooft expansion. Finally, we briefly discuss the large $N$ limit of our configurations.",
    "authors": [
      "Sergio L. Cacciatori",
      "Fabrizio Canfora",
      "Marcela Lagos",
      "Federica Muscolino",
      "Aldo Vera"
    ],
    "publication_date": "2021-05-22T18:41:19Z",
    "arxiv_id": "http://arxiv.org/abs/2105.10789v2",
    "download_url": "https://arxiv.org/abs/2105.10789v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Slepian Spatial-Spectral Concentration Problem on the Sphere: Analytical Formulation for Limited Colatitude-Longitude Spatial Region",
    "abstract": "In this paper, we develop an analytical formulation for the Slepian spatial-spectral concentration problem on the sphere for a limited colatitude-longitude spatial region on the sphere, defined as the Cartesian product of a range of positive colatitudes and longitudes. The solution of the Slepian problem is a set of functions that are optimally concentrated and orthogonal within a spatial or spectral region. These properties make them useful for applications where measurements are taken within a spatially limited region of the sphere and/or a signal is only to be analyzed within a region of the sphere. To support localized spectral/spatial analysis, and estimation and sparse representation of localized data in these applications, we exploit the expansion of spherical harmonics in the complex exponential basis to develop an analytical formulation for the Slepian concentration problem for a limited colatitude-longitude spatial region. We also extend the analytical formulation for spatial regions that are comprised of a union of rotated limited colatitude-longitude subregions. By exploiting various symmetries of the proposed formulation, we design a computationally efficient algorithm for the implementation of the proposed analytical formulation. Such a reduction in computation time is demonstrated through numerical experiments. We present illustrations of our results with the help of numerical examples and show that the representation of a spatially concentrated signal is indeed sparse in the Slepian basis.",
    "authors": [
      "Alice P. Bates",
      "Zubair Khalid",
      "Rodney A. Kennedy"
    ],
    "publication_date": "2016-08-10T03:09:12Z",
    "arxiv_id": "http://arxiv.org/abs/1608.03031v3",
    "download_url": "https://arxiv.org/abs/1608.03031v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The purple Codex Rossanensis: spectroscopic characterization and first evidence of the use of the elderberry lake in a 6th century manuscript",
    "abstract": "The Codex Rossanensis is a 6th century Bizantine illuminated manuscript written on purple parchment and conserved at the Museo Diocesano in Rossano Calabro, Italy. It is one of the oldest surviving illuminated manuscripts of the New Testament. The challenge of the analysis of the Codex Rossanensis lies in the lack of analytical information on the pictorial media used in the Early Middle Ages. Even though old-medieval illuminated manuscripts have been deeply studied from the historical standpoint, they have been rarely described in their material composition. This paper presents the results obtained during the measurements campaign (June 2012 - November 2013). The spectroscopic analyses performed by Raman, micro-FTIR and XRF allowed for the complete characterization of the pictorial palette, the inks, the support and the material used in a previous restoration treatment. To the author knowledge the article shows the first experimental evidence of the usage of the elderberry lake in a 6th century illuminated manuscript.",
    "authors": [
      "Marina Bicchieri"
    ],
    "publication_date": "2014-04-25T13:34:12Z",
    "arxiv_id": "http://arxiv.org/abs/1404.6414v1",
    "download_url": "https://arxiv.org/abs/1404.6414v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]