[
  {
    "title": "Bose-enhanced chemistry: Amplification of selectivity in the\n  dissociation of molecular Bose-Einstein condensates",
    "abstract": "We study the photodissociation chemistry of a quantum degenerate gas of\nbosonic triatomic $ABC$ molecules, assuming two open rearrangement channels\n($AB+C$ or $A+BC$). The equations of motion are equivalent to those of a\nparametric multimode laser, resulting in an exponential buildup of macroscopic\nmode populations. By exponentially amplifying a small differential in the\nsingle-particle rate-coefficients, Bose stimulation leads to a nearly complete\nselectivity of the collective $N$-body process, indicating a novel type of\nultra-selective quantum degenerate chemistry.",
    "authors": [
      "M. G. Moore",
      "A. Vardi"
    ],
    "publication_date": "2002-02-27T19:52:27Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0202509v2",
    "download_url": "http://arxiv.org/abs/cond-mat/0202509v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Augmented Kohn-Sham Potential for Energy as a Simple Sum of Orbital\n  Energies",
    "abstract": "It has recently been observed [Phys. Rev. Lett. 113, 113002 (2014)] that the\nground-state energy may be obtained directly as a simple sum of augmented\nKohn-Sham orbital energies, where it was ascertained that the corresponding\none-body shifted Kohn-Sham effective potential has appealing features. With\nthis in mind, eigenvalue and virial constraints are deduced for approximating\nthis potential.",
    "authors": [
      "Mel Levy",
      "Federico Zahariev"
    ],
    "publication_date": "2016-02-08T01:28:21Z",
    "arxiv_id": "http://arxiv.org/abs/1602.02447v1",
    "download_url": "http://arxiv.org/abs/1602.02447v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lecture Notes on the Statistical Mechanics of Disordered Systems",
    "abstract": "This material complements David Chandler's Introduction to Modern Statistical\nMechanics (Oxford University Press, 1987) in a graduate-level, one-semester\ncourse I teach in the Department of Chemistry at Duke University. Students\nenter this course with some knowledge of statistical thermodynamics and quantum\nmechanics, usually acquired from undergraduate physical chemistry at the level\nof D. A. McQuarrie & J. D. Simon's Physical Chemistry: A Molecular Approach\n(University Science Books, 1997). These notes, which introduce students to a\nmodern treatment of glassiness and to the replica method, build on the material\nand problems contained in the eight chapters of Chandler's textbook.",
    "authors": [
      "Patrick Charbonneau"
    ],
    "publication_date": "2017-05-19T16:19:31Z",
    "arxiv_id": "http://arxiv.org/abs/1705.07072v1",
    "download_url": "http://arxiv.org/abs/1705.07072v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Correlation and cross-linking effects in imprinting sites for divalent\n  adsorption in gels",
    "abstract": "This paper has been withdrawn by the author(s), as required by JPC-Journal of\nPhysical Chemistry for reasons of publication.",
    "authors": [
      "Kimani A. Stancil",
      "Michael S. Feld",
      "Mehran Kardar"
    ],
    "publication_date": "2003-01-03T17:33:31Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0301026v3",
    "download_url": "http://arxiv.org/abs/cond-mat/0301026v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From fifty years ago, the birth of modern liquid-state science",
    "abstract": "The story told in this autobiographical perspective begins fifty years ago at\nthe 1967 Gordon Research Conference on the Physics and Chemistry of Liquids. It\ntraces developments in liquid-state science from that time, including\ncontributions from the author, and especially in the study of liquid water. It\nemphasizes the importance of fluctuations, and the challenges of\nfar-from-equilibrium phenomena.",
    "authors": [
      "David Chandler"
    ],
    "publication_date": "2016-09-15T20:04:32Z",
    "arxiv_id": "http://arxiv.org/abs/1609.04837v1",
    "download_url": "http://arxiv.org/abs/1609.04837v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Molecular Quantum electro-Dynamics Research Group in Budapest",
    "abstract": "This article briefly overviews the scientific activities of the Molecular\nQuantum (electro-)Dynamics (MQD) Research Group in Budapest. Since its\nfoundation in 2016, the MQD group has worked on molecular spectroscopy and\nmolecular physics topics with primary applications and relevance to\nhigh-resolution and precision spectroscopy.",
    "authors": [
      "Edit Matyus"
    ],
    "publication_date": "2025-03-31T10:47:47Z",
    "arxiv_id": "http://arxiv.org/abs/2503.23942v1",
    "download_url": "http://arxiv.org/abs/2503.23942v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Unified Microscopic-Macroscopic Monte Carlo Simulation of Gas-Grain\n  Chemistry in Cold Dense Interstellar Clouds",
    "abstract": "For the first time, we report a unified microscopic-macroscopic Monte Carlo\nsimulation of gas-grain chemistry in cold interstellar clouds in which both the\ngas-phase and the grain surface chemistry are simulated by a stochastic\ntechnique. The surface chemistry is simulated with a microscopic Monte Carlo\nmethod in which the chemistry occurs on an initially flat surface. The surface\nchemical network consists of 29 reactions initiated by the accreting species H,\nO, C, and CO. Four different models are run with diverse but homogeneous\nphysical conditions including temperature, gas density, and\ndiffusion-barrier-to-desorption energy ratio. As time increases, icy\ninterstellar mantles begin to grow. Our approach allows us to determine the\nmorphology of the ice, layer by layer, as a function of time, and to ascertain\nthe environment or environments for individual molecules. Our calculated\nabundances can be compared with observations of ices and gas-phase species, as\nwell as the results of other models.",
    "authors": [
      "Qiang Chang",
      "Eric Herbst"
    ],
    "publication_date": "2012-09-25T19:31:17Z",
    "arxiv_id": "http://arxiv.org/abs/1209.5733v1",
    "download_url": "http://arxiv.org/abs/1209.5733v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hadro-chemistry effects on charm decayed leptons in heavy-ion collisions",
    "abstract": "Charm-hadrons possess versatile hadro-chemistry as characterized by various\ntransverse-momentum-dependent ratios between their different species. In\nparticular, the charm hadro-chemistry may be modified in relativistic heavy-ion\ncollisions with respect to proton-proton collisions at the same energy, as\ncaused by novel diffusion and hadronization mechanisms of charm quarks in the\nenvironment of the created quark-gluon plasma (QGP) in the former. Inspired by\nrecent measurements of leptons from charm-hadron decays (separated from bottom\ndecays) in Pb-Pb and Au-Au collisions, we investigate the effects of the charm\nhadro-chemistry on the leptonic observables. We find that full consideration of\ncharm hadro-chemistry in both proton-proton and heavy-ion collisions causes\nonly mild change of charm-leptons' suppression factor with respect to previous\ncalculations hadronizing charm quarks into $D$ mesons only, whereas the\nresulting change (increase) in the charm-leptons' elliptic flow turns out to be\nmore pronounced as a consequence of the larger collectivity of $\\Lambda_c$\nbaryons than $D$ mesons.",
    "authors": [
      "Kai Lu",
      "Min He"
    ],
    "publication_date": "2022-08-20T04:28:58Z",
    "arxiv_id": "http://arxiv.org/abs/2208.09605v1",
    "download_url": "http://arxiv.org/abs/2208.09605v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Astrochemistry of dust, ice and gas: introduction and overview",
    "abstract": "A brief introduction and overview of the astrochemistry of dust, ice and gas\nand their interplay is presented, aimed at non-specialists. The importance of\nbasic chemical physics studies of critical reactions is illustrated through a\nnumber of recent examples. Such studies have also triggered new insight into\nchemistry, illustrating how astronomy and chemistry can enhance each other.\nMuch of the chemistry in star- and planet-forming regions is now thought to be\ndriven by gas-grain chemistry rather than pure gas-phase chemistry, and a\ncritical discussion of the state of such models is given. Recent developments\nin studies of diffuse clouds and PDRs, cold dense clouds, hot cores,\nprotoplanetary disks and exoplanetary atmospheres are summarized, both for\nsimple and more complex molecules, with links to papers presented in this\nvolume. In spite of many lingering uncertainties, the future of astrochemistry\nis bright: new observational facilities promise major advances in our\nunderstanding of the journey of gas, ice and dust from clouds to planets.",
    "authors": [
      "Ewine F. van Dishoeck"
    ],
    "publication_date": "2014-11-19T16:29:13Z",
    "arxiv_id": "http://arxiv.org/abs/1411.5280v1",
    "download_url": "http://arxiv.org/abs/1411.5280v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Surface astrochemistry: a computational chemistry perspective",
    "abstract": "Molecules in space are synthesized via a large variety of gas-phase\nreactions, and reactions on dust-grain surfaces, where the surface acts as a\ncatalyst. Especially, saturated, hydrogen-rich molecules are formed through\nsurface chemistry. Astrochemical models have developed over the decades to\nunderstand the molecular processes in the interstellar medium, taking into\naccount grain surface chemistry. However, essential input information for\ngas-grain models, such as binding energies of molecules to the surface, have\nbeen derived experimentally only for a handful of species, leaving hundreds of\nspecies with highly uncertain estimates. Moreover, some fundamental processes\nare not well enough constrained to implement these into the models.\n  The proceedings gives three examples how computational chemistry techniques\ncan help answer fundamental questions regarding grain surface chemistry.",
    "authors": [
      "H. M. Cuppen",
      "A. Fredon",
      "T. Lamberts",
      "E. M. Penteado",
      "M. Simons",
      "C. Walsh"
    ],
    "publication_date": "2022-02-10T12:45:07Z",
    "arxiv_id": "http://arxiv.org/abs/2202.04992v1",
    "download_url": "http://arxiv.org/abs/2202.04992v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PRESTO: Progressive Pretraining Enhances Synthetic Chemistry Outcomes",
    "abstract": "Multimodal Large Language Models (MLLMs) have seen growing adoption across\nvarious scientific disciplines. These advancements encourage the investigation\nof molecule-text modeling within synthetic chemistry, a field dedicated to\ndesigning and conducting chemical reactions to synthesize new compounds with\ndesired properties and applications. Current approaches, however, often neglect\nthe critical role of multiple molecule graph interaction in understanding\nchemical reactions, leading to suboptimal performance in synthetic chemistry\ntasks. This study introduces PRESTO(Progressive Pretraining Enhances Synthetic\nChemistry Outcomes), a new framework that bridges the molecule-text modality\ngap by integrating a comprehensive benchmark of pretraining strategies and\ndataset configurations. It progressively improves multimodal LLMs through\ncross-modal alignment and multi-graph understanding. Our extensive experiments\ndemonstrate that PRESTO offers competitive results in downstream synthetic\nchemistry tasks. The code can be found at https://github.com/IDEA-XL/PRESTO.",
    "authors": [
      "He Cao",
      "Yanjun Shao",
      "Zhiyuan Liu",
      "Zijing Liu",
      "Xiangru Tang",
      "Yuan Yao",
      "Yu Li"
    ],
    "publication_date": "2024-06-19T03:59:46Z",
    "arxiv_id": "http://arxiv.org/abs/2406.13193v1",
    "download_url": "http://arxiv.org/abs/2406.13193v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chunk Twice, Embed Once: A Systematic Study of Segmentation and\n  Representation Trade-offs in Chemistry-Aware Retrieval-Augmented Generation",
    "abstract": "Retrieval-Augmented Generation (RAG) systems are increasingly vital for\nnavigating the ever-expanding body of scientific literature, particularly in\nhigh-stakes domains such as chemistry. Despite the promise of RAG, foundational\ndesign choices -- such as how documents are segmented and represented -- remain\nunderexplored in domain-specific contexts. This study presents the first\nlarge-scale, systematic evaluation of chunking strategies and embedding models\ntailored to chemistry-focused RAG systems. We investigate 25 chunking\nconfigurations across five method families and evaluate 48 embedding models on\nthree chemistry-specific benchmarks, including the newly introduced\nQuestChemRetrieval dataset. Our results reveal that recursive token-based\nchunking (specifically R100-0) consistently outperforms other approaches,\noffering strong performance with minimal resource overhead. We also find that\nretrieval-optimized embeddings -- such as Nomic and Intfloat E5 variants --\nsubstantially outperform domain-specialized models like SciBERT. By releasing\nour datasets, evaluation framework, and empirical benchmarks, we provide\nactionable guidelines for building effective and efficient chemistry-aware RAG\nsystems.",
    "authors": [
      "Mahmoud Amiri",
      "Thomas Bocklitz"
    ],
    "publication_date": "2025-06-13T07:44:53Z",
    "arxiv_id": "http://arxiv.org/abs/2506.17277v1",
    "download_url": "http://arxiv.org/abs/2506.17277v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "When physics meets chemistry at dynamic glass transition",
    "abstract": "Can the laws of physics be unified. One of the most puzzling challenges is to\nreconcile physics and chemistry, where molecular physics meets condensed-matter\nphysics, resulting from the scaling effect and dynamic fluctuation of glassy\nmatter at the glass transition temperature. Pioneer of condensed-matter\nphysics, the Nobel Prize-winning physicist Philip Warren Anderson, wrote in\n1995: The deepest and most interesting unsolved problem in condensed-matter\nphysics is probably the theory of the nature of glassy state and the glass\ntransition. In 2005, the question of 'what is the nature of glassy state' was\nsuggested as one of the greatest scientific conundrums over the next\nquarter-century for Science's 125th anniversary. However, the nature of glassy\nstate and its connection to the glass transition have not been fully understood\nowing to the interdisciplinary complexity of physics and chemistry, where they\nare governed by the physical laws at condensed-matter and molecular scales,\nrespectively. Therefore, study on the glass transition becomes essential to\nexplore the working principles of scaling effect and dynamic fluctuation in\nglassy matter, as well as further reconcile the interdisciplinary complexity of\nphysics and chemistry.",
    "authors": [
      "Haibao Lu"
    ],
    "publication_date": "2023-04-27T12:41:37Z",
    "arxiv_id": "http://arxiv.org/abs/2304.14147v1",
    "download_url": "http://arxiv.org/abs/2304.14147v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bohmian pathways into chemistry: A brief overview",
    "abstract": "Perhaps because of the popularity that trajectory-based methodologies have\nalways had in Chemistry and the important role they have played, Bohmian\nmechanics has been increasingly accepted within this community, particularly in\nthose areas of the theoretical chemistry based on quantum mechanics, e.g.,\nquantum chemistry, chemical physics, or physical chemistry. From a historical\nperspective, this evolution is remarkably interesting, particularly when the\nscarce applications of Madelung's former hydrodynamical formulation, dating\nback to the late 1960s and the 1970s, are compared with the many different\napplications available at present. As also happens with classical\nmethodologies, Bohmian trajectories are essentially used to described and\nanalyze the evolution of chemical systems, to design and implement new\ncomputational propagation techniques, or a combination of both. In the first\ncase, Bohmian trajectories have the advantage that they avoid invoking typical\nquantum-classical correspondence to interpret the corresponding phenomenon or\nprocess, while in the second case quantum-mechanical effects appear by\nthemselves, without the necessity to include artificially quantization\nconditions. Rather than providing an exhaustive revision and analysis of all\nthese applications (excellent monographs on the issue are available in the\nliterature for the interested reader, which can be consulted in the\nbibliography here supplied), this Chapter has been prepared in a way that it\nmay serve the reader to acquire a general view (or impression) on how Bohmian\nmechanics has permeated the different traditional levels or pathways to\napproach molecular systems in Chemistry: electronic structure, molecular\ndynamics and statistical mechanics. This is done with the aid of some\nillustrative examples -- theoretical developments in some cases and numerical\nsimulations in other cases.",
    "authors": [
      "A. S. Sanz"
    ],
    "publication_date": "2018-01-15T13:02:57Z",
    "arxiv_id": "http://arxiv.org/abs/1801.04781v1",
    "download_url": "http://arxiv.org/abs/1801.04781v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Gas-grain chemistry in cold interstellar cloud cores with a microscopic\n  Monte Carlo approach to surface chemistry",
    "abstract": "AIM: We have recently developed a microscopic Monte Carlo approach to study\nsurface chemistry on interstellar grains and the morphology of ice mantles. The\nmethod is designed to eliminate the problems inherent in the rate-equation\nformalism to surface chemistry. Here we report the first use of this method in\na chemical model of cold interstellar cloud cores that includes both gas-phase\nand surface chemistry. The surface chemical network consists of a small number\nof diffusive reactions that can produce molecular oxygen, water, carbon\ndioxide, formaldehyde, methanol and assorted radicals. METHOD: The simulation\nis started by running a gas-phase model including accretion onto grains but no\nsurface chemistry or evaporation. The starting surface consists of either flat\nor rough olivine. We introduce the surface chemistry of the three species H, O\nand CO in an iterative manner using our stochastic technique. Under the\nconditions of the simulation, only atomic hydrogen can evaporate to a\nsignificant extent. Although it has little effect on other gas-phase species,\nthe evaporation of atomic hydrogen changes its gas-phase abundance, which in\nturn changes the flux of atomic hydrogen onto grains. The effect on the surface\nchemistry is treated until convergence occurs. We neglect all non-thermal\ndesorptive processes. RESULTS: We determine the mantle abundances of assorted\nmolecules as a function of time through 2x10^5 yr. Our method also allows\ndetermination of the abundance of each molecule in specific monolayers. The\nmantle results can be compared with observations of water, carbon dioxide,\ncarbon monoxide, and methanol ices in the sources W33A and Elias 16. Other than\na slight underproduction of mantle CO, our results are in very good agreement\nwith observations.",
    "authors": [
      "Q. Chang",
      "H. M. Cuppen",
      "E. Herbst"
    ],
    "publication_date": "2007-04-20T12:56:21Z",
    "arxiv_id": "http://arxiv.org/abs/0704.2704v2",
    "download_url": "http://arxiv.org/abs/0704.2704v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Real-time Quantum Chemistry",
    "abstract": "Significant progress in the development of efficient and fast algorithms for\nquantum chemical calculations has been made in the past two decades. The main\nfocus has always been the desire to be able to treat ever larger molecules or\nmolecular assemblies---especially linear and sub-linear scaling techniques are\ndevoted to the accomplishment of this goal. However, as many chemical reactions\nare rather local, they usually involve only a limited number of atoms so that\nmodels of about two hundred (or even less) atoms embedded in a suitable\nenvironment are sufficient to study their mechanisms. Thus, the system size\ndoes not need to be enlarged, but remains constant for reactions of this type\nthat can be described by less than two hundred atoms. The question then arises\nhow fast one can obtain the quantum chemical results. This question is not\ndirectly answered by linear-scaling techniques. In fact, ideas such as haptic\nquantum chemistry or interactive quantum chemistry require an immediate\nprovision of quantum chemical information which demands the calculation of data\nin \"real time\". In this perspective, we aim at a definition of real-time\nquantum chemistry, explore its realm and eventually discuss applications in the\nfield of haptic quantum chemistry. For the latter we elaborate whether a direct\napproach is possible by virtue of real-time quantum chemistry.",
    "authors": [
      "Moritz P. Haag",
      "Markus Reiher"
    ],
    "publication_date": "2012-08-18T01:59:58Z",
    "arxiv_id": "http://arxiv.org/abs/1208.3717v1",
    "download_url": "http://arxiv.org/abs/1208.3717v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Latent Room-Temperature T$_c$ in Cuprate Superconductors",
    "abstract": "The ancient phrase, \"All roads lead to Rome\" applies to Chemistry and\nPhysics. Both are highly evolved sciences, with their own history, traditions,\nlanguage, and approaches to problems. Despite all these differences, these two\nroads generally lead to the same place. For high temperature cuprate\nsuperconductors however, the Chemistry and Physics roads do not meet or even\ncome close to each other. In this paper, we analyze the physics and chemistry\napproaches to the doped electronic structure of cuprates and find the chemistry\ndoped hole (out-of-the-CuO$\\mathrm{_2}$-planes) leads to explanations of a vast\narray of normal state cuprate phenomenology using simple counting arguments.\nThe chemistry picture suggests that phonons are responsible for\nsuperconductivity in cuprates. We identify the important phonon modes, and show\nthat the observed T$\\mathrm{_c} \\sim 100$ K, the T$\\mathrm{_c}$-dome as a\nfunction of hole doping, the change in T$\\mathrm{_c}$ as a function of the\nnumber of CuO$\\mathrm{_2}$ layers per unit cell, the lack of an isotope effect\nat optimal T$\\mathrm{_c}$ doping, and the D-wave symmetry of the\nsuperconducting Cooper pair wavefunction are all explained by the chemistry\npicture. Finally, we show that \"crowding\" the dopants in cuprates leads to a\npair wavefunction with S-wave symmetry and T$\\mathrm{_c}\\approx280-390$ K.\nHence, we believe there is enormous \"latent\" T$\\mathrm{_c}$ remaining in the\ncuprate class of superconductors.",
    "authors": [
      "Jamil Tahir-Kheli"
    ],
    "publication_date": "2017-02-16T14:56:59Z",
    "arxiv_id": "http://arxiv.org/abs/1702.05001v1",
    "download_url": "http://arxiv.org/abs/1702.05001v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hydrodynamic Singularities",
    "abstract": "We give a brief overview of the physical significance of singularities in\nfluid mechanics.",
    "authors": [
      "Jens Eggers"
    ],
    "publication_date": "2001-10-30T09:28:36Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0110087v1",
    "download_url": "http://arxiv.org/abs/physics/0110087v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Supersymmetric Treatment of a Particle Subjected to a Ring-shaped\n  Potential",
    "abstract": "The ring-shaped Hartmann potential $V = \\eta \\sigma^{2} \\epsilon_{0} \\left(\n\\frac{2 a_{0}}{r} - \\frac{\\eta a_{0}^{2}}{r^{2} sin^{2} \\theta} \\right)$ was\nintroduced in quantum chemistry to describe ring-shaped molecules like benzene.\nIn this article, fundamental concepts of supersymmetric quantum mechanics\n(SUSYQM) are discussed.\n  The energy eigenvalues and (radial) eigenfunctions of the Hartmann potential\nare subsequently rederived using the techniques of SUSYQM.",
    "authors": [
      "Gardo Garnet Blado"
    ],
    "publication_date": "1995-11-28T20:03:02Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/9511040v1",
    "download_url": "http://arxiv.org/abs/quant-ph/9511040v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entanglement as Measure of Electron-Electron Correlation in Quantum\n  Chemistry Calculations",
    "abstract": "In quantum chemistry calculations, the correlation energy is defined as the\ndifference between the Hartree-Fock limit energy and the exact solution of the\nnonrelativistic Schrodinger equation. With this definition, the electron\ncorrelation effects are not directly observable. In this report, we show that\nthe entanglement can be used as an alternative measure of the electron\ncorrelation in quantum chemistry calculations. Entanglement is directly\nobservable and it is one of the most striking properties of quantum mechanics.\nAs an example we calculate the entanglement for He atom and H2 molecule with\ndifferent basis sets.",
    "authors": [
      "Zhen Huang",
      "Sabre Kais"
    ],
    "publication_date": "2005-07-15T16:36:13Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0507148v1",
    "download_url": "http://arxiv.org/abs/quant-ph/0507148v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Star Formation: Chemistry as a Probe of Embedded Protostars",
    "abstract": "The embedded phase of star formation is the crucial phase where most of the\nstellar mass is assembled. Velocity-resolved spectra reveal an infalling\nenvelope, bipolar outflows, and perhaps an infant circumstellar disk -- all\nlocked together in a cosmic dance of gravitational collapse and magnetic winds.\nDensities and temperatures change by orders of magnitude as the protostar\nevolves, driving a chemistry as exotic as it is fascinating. I will review two\nexamples of how to exploit chemistry and molecular spectroscopy to study the\nphysics of low-mass star formation: energetic feedback and episodic accretion.",
    "authors": [
      "Ruud Visser"
    ],
    "publication_date": "2014-02-13T17:29:30Z",
    "arxiv_id": "http://arxiv.org/abs/1402.3229v1",
    "download_url": "http://arxiv.org/abs/1402.3229v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparison of the Research Effectiveness of Chemistry Nobelists and\n  Fields Medalist Mathematicians with Google Scholar: the Yule-Simon Model",
    "abstract": "This paper uses the Yule-Simon model to estimate to what extent the work of\nchemistry Nobelists and Fields medalist mathematicians is incorporated into the\nknowledge corpus of their disciplines as measured by Google Scholar inlinks.\nDue to differences in the disciplines and prizes, it finds that the work of\nchemistry Nobelists is better incorporated than that of Fields medalists.",
    "authors": [
      "Stephen J. Bensman",
      "Lawrence J. Smolinsky",
      "Daniel S. Sage"
    ],
    "publication_date": "2014-04-19T00:29:09Z",
    "arxiv_id": "http://arxiv.org/abs/1404.4904v1",
    "download_url": "http://arxiv.org/abs/1404.4904v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular theory of graphene chemical modification",
    "abstract": "The chapter is devoted to chemical uniqueness of graphene. In view of\nmolecular theory, the latter is a consequence of benzenoid packing of carbon\natoms, based on three neighbors to each carbon atom leaving the atom fourth\nvalence electron (the odd one) on its own. Due to rather large C-C distances,\nthe odd electrons of graphene molecules are correlated whereupon the molecules\nare radicalized and molecular chemistry of graphene is the chemistry of\ndangling bonds. The chapter presents the description of the\nmolecular-theory-dangling-bond view on graphene molecule hydrogenation and\noxidation. Specific peculiarities of the graphene molecular chemistry related\nto size-dependent topochemical features are discussed, as well",
    "authors": [
      "Elena F. Sheka"
    ],
    "publication_date": "2014-12-29T11:12:18Z",
    "arxiv_id": "http://arxiv.org/abs/1412.8306v1",
    "download_url": "http://arxiv.org/abs/1412.8306v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Erratum to the article: Charge transfer to solvent identified using dark\n  channel fluorescence-yield L-edge spectroscopy, NATURE CHEMISTRY 2 (2010) 853",
    "abstract": "Erratum to the article: Charge transfer to solvent identified using dark\nchannel fluorescence-yield L-edge spectroscopy, NATURE CHEMISTRY 2 (2010) 853",
    "authors": [
      "Emad F. Aziz",
      "Hannelore Rittmann-Frank",
      "Kathrin M. Lange",
      "Sebastien Bonhommeau",
      "Majed Chergui"
    ],
    "publication_date": "2017-05-10T20:13:42Z",
    "arxiv_id": "http://arxiv.org/abs/1705.03941v2",
    "download_url": "http://arxiv.org/abs/1705.03941v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lowering of the complexity of quantum chemistry methods by choice of\n  representation",
    "abstract": "The complexity of the standard hierarchy of quantum chemistry methods is not\ninvariant to the choice of representation. This work explores how the scaling\nof common quantum chemistry methods can be reduced using real-space,\nmomentum-space, and time-dependent intermediate representations without\nintroducing approximations. We find the scalings of exact Gaussian basis\nHartree--Fock theory, second-order M{\\o}ller-Plesset perturbation theory, and\ncoupled cluster theory (specifically, linearized coupled cluster doubles and\nthe distinguishable cluster approximation with doubles) to be\n$\\mathcal{O}(N^3)$, $\\mathcal{O}(N^3)$, and $\\mathcal{O}(N^5)$ respectively,\nwhere $N$ denotes system size. These scalings are not asymptotic and hold over\nall ranges of $N$.",
    "authors": [
      "Narbe Mardirossian",
      "James D. McClain",
      "Garnet Kin-Lic Chan"
    ],
    "publication_date": "2017-10-03T06:32:37Z",
    "arxiv_id": "http://arxiv.org/abs/1710.01004v1",
    "download_url": "http://arxiv.org/abs/1710.01004v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Acknowledging user requirements for accuracy in computational chemistry\n  benchmarks",
    "abstract": "Computational chemistry has become an important complement to experimental\nmeasurements. In order to choose among the multitude of the existing\napproximations, it is common to use benchmark data sets, and to issue\nrecommendations based on numbers such as mean absolute errors. We argue, using\nas an example band gaps calculated with density functional approximations, that\na more careful study of the benchmark data is needed, stressing that the user's\nrequirements play a role in the choice of an appropriate method. We also appeal\nto those who measure data capable of being used as a reference, to publish\nerror estimates. We show how the latter can affect the judgment of\napproximations used in computational chemistry.",
    "authors": [
      "Andreas Savin",
      "Pascal Pernot"
    ],
    "publication_date": "2020-04-01T09:09:34Z",
    "arxiv_id": "http://arxiv.org/abs/2004.00297v1",
    "download_url": "http://arxiv.org/abs/2004.00297v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fragment Descriptors in Virtual Screening",
    "abstract": "This article reviews the application of fragment descriptors at different\nstages of virtual screening: filtering, similarity search, and direct activity\nassessment using QSAR/QSPR models. Several case studies are considered. It is\ndemonstrated that the power of fragment descriptors stems from their\nuniversality, very high computational efficiency, simplicity of interpretation\nand versatility.",
    "authors": [
      "Igor I. Baskin",
      "Alexandre Varnek"
    ],
    "publication_date": "2013-11-15T04:23:09Z",
    "arxiv_id": "http://arxiv.org/abs/1311.3723v1",
    "download_url": "http://arxiv.org/abs/1311.3723v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strongly correlated systems and density matrix renormalization group in\n  quantum chemistry",
    "abstract": "This article is a pedagogical introduction to the density matrix\nrenormalization group method and its application in quantum chemistry. It\npresents the easy-to-understand modern formulation based on matrix product\nstates. It is written in Czech language.",
    "authors": [
      "Libor Veis",
      "Jan Brandejs",
      "Jiri Pittner"
    ],
    "publication_date": "2018-07-17T09:07:02Z",
    "arxiv_id": "http://arxiv.org/abs/1807.06289v2",
    "download_url": "http://arxiv.org/abs/1807.06289v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mikhail Lomonosov: Oration on Benefits of Chemistry",
    "abstract": "Mikhail Lomonosov (1711-1765) was a Russian polymath and one of the giants of\nthe European Enlightenment. This English translation of his seminal work\nOration on Benefits of Chemistry continues the series of translations of nine\nmost important scientific works, which were included by Lomonosov himself in\nthe convolute Lomonosow Opera Academica and sent for distribution among\nscientific Academies in Europe.",
    "authors": [
      "Mikhail Lomonosov",
      "Vladimir Shiltsev"
    ],
    "publication_date": "2024-04-27T21:58:15Z",
    "arxiv_id": "http://arxiv.org/abs/2404.18018v1",
    "download_url": "http://arxiv.org/abs/2404.18018v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Large-Scale Simulation of Quantum Computational Chemistry on a New\n  Sunway Supercomputer",
    "abstract": "Quantum computational chemistry (QCC) is the use of quantum computers to\nsolve problems in computational quantum chemistry. We develop a high\nperformance variational quantum eigensolver (VQE) simulator for simulating\nquantum computational chemistry problems on a new Sunway supercomputer. The\nmajor innovations include: (1) a Matrix Product State (MPS) based VQE simulator\nto reduce the amount of memory needed and increase the simulation efficiency;\n(2) a combination of the Density Matrix Embedding Theory with the MPS-based VQE\nsimulator to further extend the simulation range; (3) A three-level\nparallelization scheme to scale up to 20 million cores; (4) Usage of the Julia\nscript language as the main programming language, which both makes the\nprogramming easier and enables cutting edge performance as native C or Fortran;\n(5) Study of real chemistry systems based on the VQE simulator, achieving\nnearly linearly strong and weak scaling. Our simulation demonstrates the power\nof VQE for large quantum chemistry systems, thus paves the way for large-scale\nVQE experiments on near-term quantum computers.",
    "authors": [
      "Honghui Shang",
      "Li Shen",
      "Yi Fan",
      "Zhiqian Xu",
      "Chu Guo",
      "Jie Liu",
      "Wenhao Zhou",
      "Huan Ma",
      "Rongfen Lin",
      "Yuling Yang",
      "Fang Li",
      "Zhuoya Wang",
      "Yunquan Zhang",
      "Zhenyu Li"
    ],
    "publication_date": "2022-07-08T07:02:14Z",
    "arxiv_id": "http://arxiv.org/abs/2207.03711v1",
    "download_url": "http://arxiv.org/abs/2207.03711v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bimolecular chemistry in the ultracold regime",
    "abstract": "Advances in atomic, molecular, and optical (AMO) physics techniques allowed\nthe cooling of simple molecules down to the ultracold regime ($\\lesssim$ 1 mK),\nand opened the opportunities to study chemical reactions with unprecedented\nlevels of control. This review covers recent developments in studying\nbimolecular chemistry at ultralow temperatures. We begin with a brief overview\nof methods for producing, manipulating, and detecting ultracold molecules. We\nthen survey experimental works that exploit the controllability of ultracold\nmolecules to probe and modify their long-range interactions. Further combining\nthe use of physical chemistry techniques, such as mass spectrometry and ion\nimaging, significantly improved the detection of ultracold reactions and\nenabled explorations of their dynamics in the short-range. We discuss a series\nof studies on the reaction KRb + KRb $\\rightarrow$ K$_2$ + Rb$_2$ initiated\nbelow 1 $\\mu$K, including the direct observation of a long-lived complex, the\ndemonstration of product rotational state control via conserved nuclear spins,\nand a test of the statistical model using the complete quantum state\ndistribution of the products.",
    "authors": [
      "Yu Liu",
      "Kang-Kuen Ni"
    ],
    "publication_date": "2021-06-27T17:28:07Z",
    "arxiv_id": "http://arxiv.org/abs/2107.01088v1",
    "download_url": "http://arxiv.org/abs/2107.01088v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Founding the First Chemistry Laboratory in Russia: Mikhail Lomonosov's\n  Project",
    "abstract": "This article, the third in a series about the Russian scientist Mikhail\nLomonosov (1711-1765), covers the first decade of his research at the St.\nPetersburg Academy of Sciences, from his return from an educational his trip\nabroad in 1741, to the mid-1750s. Lomonosov's major focus was on the\nestablishment of the first Russian laboratory used to introduce modern\nexperimental chemistry and physics methods both to original research and\neducation. The lab supported studies of the physics of colors, chemistry and\nphysics of glasses and training of the Academy students. This article describes\nhow Lomonosov, first an Adjunct Professor and then as a young Professor, fought\nto create the chemistry lab, and then to establish a broad program of\nexperiments and tests there. The construction of laboratories to be used not\njust for research but also education only became widespread in the early 19th\ncentury, but Lomonosov's laboratory had a significant impact on the early\ndevelopment of the Academy and on Russian science.",
    "authors": [
      "Robert P. Crease",
      "Vladimir Shiltsev"
    ],
    "publication_date": "2024-04-12T19:05:35Z",
    "arxiv_id": "http://arxiv.org/abs/2404.08779v1",
    "download_url": "http://arxiv.org/abs/2404.08779v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Origin of RNA Precursors on Exoplanets",
    "abstract": "Given that the macromolecular building blocks of life were likely produced\nphotochemically in the presence of ultraviolet (UV) light, we identify some\ngeneral constraints on which stars produce sufficient UV for this\nphotochemistry. We estimate how much light is needed for the UV photochemistry\nby experimentally measuring the rate constant for the UV chemistry (`light\nchemistry', needed for prebiotic synthesis) versus the rate constants for the\nbimolecular reactions that happen in the absence of the UV light (`dark\nchemistry'). We make these measurements for representative photochemical\nreactions involving SO$_3^{2-}$ and HS$^-$. By balancing the rates for the\nlight and dark chemistry, we delineate the \"abiogenesis zones\" around stars of\ndifferent stellar types based on whether their UV fluxes are sufficient for\nbuilding up this macromolecular prebiotic inventory. We find that the\nSO$_3^{2-}$ 'light chemistry' is rapid enough to build up the prebiotic\ninventory for stars hotter than K5 (4400 K). We show how the abiogenesis zone\noverlaps with the liquid water habitable zone. Stars cooler than K5 may also\ndrive the formation of these building blocks if they are very active. The\nHS$^-$ 'light chemistry' is too slow to work even for the Early Earth.",
    "authors": [
      "Paul Brandon Rimmer",
      "Jianfeng Xu",
      "Samantha Thompson",
      "Ed Gillen",
      "John Sutherland",
      "Didier Queloz"
    ],
    "publication_date": "2018-08-08T10:50:30Z",
    "arxiv_id": "http://arxiv.org/abs/1808.02718v1",
    "download_url": "http://arxiv.org/abs/1808.02718v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Meta-analysis of Uniform Scaling Factors for Harmonic Frequency\n  Calculations",
    "abstract": "Vibrational frequency calculations performed under the harmonic approximation\nare widespread across chemistry. However, it is well-known that the calculated\nharmonic frequencies tend to systematically overestimate experimental\nfundamental frequencies; a limitation commonly overcome with multiplicative\nscaling factors.\n  In practice, multiplicative scaling factors are derived for each individual\nmodel chemistry choice (i.e., a level of theory and basis set pair), where\nperformance is judged by, for example, the root-mean square error (RMSE)\nbetween the predicted scaled and experimental frequencies. However, despite the\noverwhelming number of scaling factors reported in the literature and model\nchemistry approximations available, there is little guidance for users on\nappropriate model chemistry choices for harmonic frequency calculations.\n  Here, we compile and analyse the data for 1495 scaling factors calculated\nusing 141 levels of theory and 109 basis sets. Our meta-analysis of this data\nshows that scaling factors and RMSE approach convergence with only hybrid\nfunctionals and double-zeta basis sets, with anharmonicity error already\ndominating model chemistry errors. Noting inconsistent data and the lack of\nindependent testing, we can nevertheless conclude that a minimum error of\n25cm-1 -- arising from insufficiently accurate treatment of anharmonicity -- is\npersistent regardless of the model chemistry choice. Based on the data we\ncompiled and cautioning the need for a future systematic benchmarking study, we\nrecommend wB97X-D/def2-TZVP for most applications and B2PLYP/def2-TZVPD for\nsuperior intensity predictions. With a smaller benchmark set, direct comparison\nstrongly prefers wB97X-D/6-31G* to B3LYP/6-31G*.",
    "authors": [
      "Juan C. Zapata Trujillo",
      "Laura K. McKemmish"
    ],
    "publication_date": "2021-10-25T21:29:42Z",
    "arxiv_id": "http://arxiv.org/abs/2110.13276v1",
    "download_url": "http://arxiv.org/abs/2110.13276v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Implementation of disequilibrium chemistry to spectral retrieval code\n  ARCiS and application to sixteen exoplanet transmission spectra: Indication\n  of disequilibrium chemistry for HD 209458b and WASP-39b",
    "abstract": "The retrieval approach is currently a standard method for deriving\natmospheric properties from observed spectra of exoplanets. However, the\napproach ignores disequilibrium chemistry in most current retrieval codes,\nwhich can lead to misinterpretation of the metallicity or elemental abundance\nratios of the atmosphere. We have implemented the disequilibrium effect of\nvertical mixing or quenching for the major species in hydrogen/helium-dominated\natmospheres, namely $\\mathrm{CH_4}$, $\\mathrm{CO}$, $\\mathrm{H_2O}$,\n$\\mathrm{NH_3}$, $\\mathrm{N_2}$, and $\\mathrm{CO_2}$, for the spectral\nretrieval code ARCiS with a physical basis using the chemical relaxation\nmethod. Then, using ARCiS updated with this module, we have performed\nretrievals of the observed transmission spectra of 16 exoplanets with sizes\nranging from Jupiter to mini-Neptune. As a result, we find indications of\ndisequilibrium chemistry for HD 209458b ($\\geq 4.1\\sigma$) and WASP-39b ($\\geq\n2.7\\sigma$). The retrieved spectrum of HD 209458b exhibits a strong\n$\\mathrm{NH_3}$ absorption feature at 10.5 $\\mu$m accessible by JWST owing to\nan enhanced abundance of $\\mathrm{NH_3}$ due to the quenching effect. This\nfeature is absent in the spectrum retrieved assuming equilibrium chemistry,\nwhich makes HD 209458b an ideal target for studying disequilibrium chemistry in\nexoplanet atmospheres. Moreover, for HAT-P-11b and GJ 436b, we obtain\nrelatively different results than for the retrieval with the equilibrium\nassumption, such as a $2.9\\sigma$ difference for the C/O ratio. We have also\nexamined the retrieved eddy diffusion coefficient, but could not identify a\ntrend over the equilibrium temperature, possibly due to the limits of the\ncurrent observational precision.",
    "authors": [
      "Yui Kawashima",
      "Michiel Min"
    ],
    "publication_date": "2021-10-26T07:14:52Z",
    "arxiv_id": "http://arxiv.org/abs/2110.13443v1",
    "download_url": "http://arxiv.org/abs/2110.13443v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Materials with ZrCuSiAs Type Structure",
    "abstract": "The crystal chemistry and physical properties of materials with ZrCuSiAs type\nstructure is reviewed.",
    "authors": [
      "Rainer Pottgen",
      "Dirk Johrendt"
    ],
    "publication_date": "2008-07-14T12:11:00Z",
    "arxiv_id": "http://arxiv.org/abs/0807.2138v1",
    "download_url": "http://arxiv.org/abs/0807.2138v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magnetic Topological Quantum Chemistry",
    "abstract": "For over 100 years, the group-theoretic characterization of crystalline\nsolids has provided the foundational language for diverse problems in physics\nand chemistry. However, the group theory of crystals with commensurate magnetic\norder has remained incomplete for the past 70 years, due to the complicated\nsymmetries of magnetic crystals. In this work, we complete the 100-year-old\nproblem of crystalline group theory by deriving the small corepresentations,\nmomentum stars, compatibility relations, and magnetic elementary band\ncorepresentations of the 1,421 magnetic space groups (MSGs), which we have made\nfreely accessible through tools on the Bilbao Crystallographic Server. We\nextend Topological Quantum Chemistry to the MSGs to form a complete, real-space\ntheory of band topology in magnetic and nonmagnetic crystalline solids -\nMagnetic Topological Quantum Chemistry (MTQC). Using MTQC, we derive the\ncomplete set of symmetry-based indicators of electronic band topology, for\nwhich we identify symmetry-respecting bulk and anomalous surface and hinge\nstates.",
    "authors": [
      "Luis Elcoro",
      "Benjamin J. Wieder",
      "Zhida Song",
      "Yuanfeng Xu",
      "Barry Bradlyn",
      "B. Andrei Bernevig"
    ],
    "publication_date": "2020-10-01T18:00:02Z",
    "arxiv_id": "http://arxiv.org/abs/2010.00598v2",
    "download_url": "http://arxiv.org/abs/2010.00598v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Foundations of Quantum Information for Physical Chemistry",
    "abstract": "Quantum information, a field in which great advances have been made in the\npast decades, now presents opportunities for chemistry. One roadblock to\nprogress, especially for experimental chemical science, is that new concepts\nand technical definitions need to be learned. In this paper, we review some\nbasic, but sometimes misunderstood, concepts of quantum information based on\nthe mathematical formulation of quantum mechanics that will be useful for\nchemists interested in discovering ways that chemistry can contribute to the\nquantum information field. We cover topics including qubits and their density\nmatrix formalism, quantum measurement as a quantum operation, information\ntheory, and entanglement. We focus on the difference between the concepts in\nthe quantum context and the classic context. We also discuss the relation and\ndistinction among entanglement, correlation, and coherence. We aim to clarify\nthe rigorous definition of these concepts, and then indicate some examples in\nphysical chemistry.",
    "authors": [
      "Weijun Wu",
      "Gregory D. Scholes"
    ],
    "publication_date": "2023-11-20T23:29:04Z",
    "arxiv_id": "http://arxiv.org/abs/2311.12238v1",
    "download_url": "http://arxiv.org/abs/2311.12238v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Chemistry of Dark Clouds: New Astrochemical Tools for Star Formation\n  Studies",
    "abstract": "The past decade has led to significant improvements in our understanding of\nthe physical structure of the molecular cores of cold dark clouds.\nObservational efforts, in combination with improved knowledge of cloud\nstructure, now provide clear evidence that the chemistry of dark clouds is\ndominated by the depletion of gaseous species onto grain surfaces. We outline\nthe basis of these observational efforts and show how the abundance\ndeterminations have moved beyond single point analyses to the derivation of\nabundance profiles. We discuss the basic physics of the interaction between\nmolecules and grain surfaces and show that when physics is coupled into a\nchemical model there is excellent agreement, for a limited set of species,\nbetween theory and observations. We discuss our improved understanding of cloud\nchemistry can be used as a new tool for studies of the formation of stars and\nplanetary systems.",
    "authors": [
      "Edwin A. Bergin"
    ],
    "publication_date": "2002-11-26T16:48:34Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0211576v1",
    "download_url": "http://arxiv.org/abs/astro-ph/0211576v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computational Chemistry as Voodoo Quantum Mechanics : Models,\n  Parameterization, and Software",
    "abstract": "Computational chemistry grew in a new era of \"desktop modeling\", which\ncoincided with a growing demand for modeling software, especially from the\npharmaceutical industry. Parameterization of models in computational chemistry\nis an arduous enterprise, and we argue that this activity leads, in this\nspecific context, to tensions among scientists regarding the lack of epistemic\ntransparency of parameterized methods and the software implementing them. To\nexplicit these tensions, we rely on a corpus which is suited for revealing\nthem, namely the Computational Chemistry mailing List (CCL), a professional\nscientific discussion forum. We relate one flame war from this corpus in order\nto assess in detail the relationships between modeling methods,\nparameterization, software and the various forms of their enclosure or\ndisclosure. Our claim is that parameterization issues are a source of epistemic\nopacity and that this opacity is entangled in methods and software alike.\nModels and software must be addressed together to understand the\nepistemological tensions at stake.",
    "authors": [
      "Frdric Wieber",
      "Alexandre Hocquet"
    ],
    "publication_date": "2018-12-03T02:21:15Z",
    "arxiv_id": "http://arxiv.org/abs/1812.00995v1",
    "download_url": "http://arxiv.org/abs/1812.00995v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Combining Machine Learning and Computational Chemistry for Predictive\n  Insights Into Chemical Systems",
    "abstract": "Machine learning models are poised to make a transformative impact on\nchemical sciences by dramatically accelerating computational algorithms and\namplifying insights available from computational chemistry methods. However,\nachieving this requires a confluence and coaction of expertise in computer\nscience and physical sciences. This review is written for new and experienced\nresearchers working at the intersection of both fields. We first provide\nconcise tutorials of computational chemistry and machine learning methods,\nshowing how insights involving both can be achieved. We then follow with a\ncritical review of noteworthy applications that demonstrate how computational\nchemistry and machine learning can be used together to provide insightful (and\nuseful) predictions in molecular and materials modeling, retrosyntheses,\ncatalysis, and drug design.",
    "authors": [
      "John A. Keith",
      "Valentin Vassilev-Galindo",
      "Bingqing Cheng",
      "Stefan Chmiela",
      "Michael Gastegger",
      "Klaus-Robert Mller",
      "Alexandre Tkatchenko"
    ],
    "publication_date": "2021-02-12T00:32:50Z",
    "arxiv_id": "http://arxiv.org/abs/2102.06321v1",
    "download_url": "http://arxiv.org/abs/2102.06321v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]