[
  {
    "title": "Magnetic molecular wheels and grids - the need for novel concepts in\n  \"zero-dimensional\" magnetism",
    "abstract": "Supramolecular chemistry has allowed the production, by self-assembly, of\ninorganic complexes with a [N x N] square matrix-like configuration of N^2\nmetal centers. Interest in these systems is driven by the potential\napplications in information technology suggested by such a \"two-dimensional\"\n(2D), addressable arrangement of metal ions. From the magnetic perspective, [N\nx N] grids constitute molecular model systems for magnets with extended\ninteractions on a square lattice, which have gained enormous attention in the\ncontext of hightemperature superconductors. Numerous [2 x 2] grids as well as a\nfew [3 x 3] grids with magnetic metal ions such as Cu(II), Ni(II), Co(II),\nFe(II), and Mn(II) have been created. Magnetic studies unraveled a remarkable\nvariety in their magnetic properties, which will be reviewed in this work with\nemphasis on the underlying physical concepts. An intriguing issue is the\nconnection of [2 x 2] and [3 x 3] grids with \"one-dimensional\" (1D) rings, as\nexperimentally realized in the molecular wheels. For a [2 x 2] square of spin\ncenters the distinction between a 2D grid and a 1D ring is semantic, but also a\n[3 x 3] grid retains 1D character: it is best viewed as an octanuclear ring\nwith an additional ion \"doped\" into its center. Challenging familiar concepts\nfrom conventional magnets, the current picture of elementary excitations in\nantiferromagnetic rings will be discussed, as a prerequisite to understand the\ncomplex [3 x 3] grids.",
    "authors": [
      "O. Waldmann"
    ],
    "publication_date": "2004-12-09T16:34:53Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0412242v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0412242v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Theory of Molecular Magnetism",
    "abstract": "The synthesis of molecular magnets has undergone rapid progress in recent\nyears. Each of the identical molecular units can contain as few as two and up\nto several dozens of paramagnetic ions (spins). Although these materials appear\nas macroscopic samples, i.e. crystals or powders, the intermolecular magnetic\ninteractions are utterly negligible as compared to the intramolecular\ninteractions. Therefore, measurements of their magnetic properties reflect\nmainly ensemble properties of single molecules.\n  Their magnetic features promise a variety of applications in physics,\nmagneto-chemistry, biology, biomedicine and material sciences as well as in\nquantum computing.\n  It appears that in the majority of these molecules the localized\nsingle-particle magnetic moments couple antiferromagnetically and the spectrum\nis rather well described by the Heisenberg model with isotropic nearest\nneighbor interaction sometimes augmented by anisotropy terms. Thus, the\ninterest in the Heisenberg model, which is known already for a long time, but\nused mostly for infinite one-, two-, and three-dimensional systems, was renewed\nby the successful synthesis of magnetic molecules. Studying such spin arrays\nfocuses on qualitatively new physics caused by the finite size of the system.\n  Theoretical inorganic chemistry itself provides several methods to understand\nand describe molecular magnetism. In this contribution we would like to focus\non those subjects which are of general interest in the context of quantum\nmagnetism.",
    "authors": [
      "J. Schnack"
    ],
    "publication_date": "2005-01-26T10:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0501625v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0501625v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparing mesoscale chemistry-transport model and remote-sensed Aerosol\n  Optical Depth",
    "abstract": "A comparison of modeled and observed Aerosol Optical Depth (AOD) is\npresented. 3D Eulerian multiphase chemistry-transport model TCAM is employed\nfor simulating AOD at mesoscale. MODIS satellite sensor and AERONET photometer\nAOD are used for comparing spatial patterns and temporal timeseries. TCAM\nsimulations for year 2004 over a domain containing Po-Valley and nearly whole\nNorthern Italy are employed. For the computation of AOD, a configuration of\nexternal mixing of the chemical species is considered. Furthermore, a\nparametrization of the effect of moisture affecting both aerosol size and\ncomposition is used. An analysis of the contributions of the granulometric\nclasses to the extinction coefficient reveals the dominant role of the\ninorganic compounds of submicron size. For the analysis of spatial patterns,\nsummer and winter case study are considered. TCAM AOD reproduces spatial\npatterns similar to those retrieved from space, but AOD values are generally\nsmaller by an order of magnitude. However, accounting also for moisture, TCAM\nAOD significantly increases to values of the same magnitude of the observed\nones. The temporal performance of model AOD is tested in correspondence of\nAERONET site \"Venise\" and some temporal structures are reproduced. The results\nsuggest encouraging perspectives in view of satellite AOD assimilation also at\nthe mesoscale and not only at the global and regional scale as already tested\nin the literature.",
    "authors": [
      "C. Carnevale",
      "G. Mannarini",
      "E. Pisoni",
      "M. Volta"
    ],
    "publication_date": "2010-07-12T09:10:59Z",
    "arxiv_id": "http://arxiv.org/abs/1007.1850v3",
    "download_url": "http://arxiv.org/abs/1007.1850v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comparative Spectra of Oxygen-Rich vs. Carbon-Rich Circumstellar Shells:\n  VY Canis Majoris and IRC+10216 at 215-285 GHz",
    "abstract": "A sensitive (1{\\sigma} rms at 1 MHz resolution ~3 mK) 1 mm spectral line\nsurvey (214.5-285.5 GHz) of VY Canis Majoris (VY CMa) and IRC+10216 has been\nconducted to compare the chemistries of oxygen and carbon-rich circumstellar\nenvelopes. This study was carried out using the Submillimeter Telescope (SMT)\nof the Arizona Radio Observatory (ARO) with a new ALMA-type receiver. This\nsurvey is the first to chemically characterize an O-rich circumstellar shell at\nmillimeter wavelengths. In VY CMa, 128 emission features were detected arising\nfrom 18 different molecules, and in IRC+10216, 720 lines were observed,\nassigned to 32 different species. The 1 mm spectrum of VY CMa is dominated by\nSO2 and SiS; in IRC +10216, C4H and SiC2 are the most recurrent species. Ten\nmolecules were common to both sources: CO, SiS, SiO, CS, CN, HCN, HNC, NaCl,\nPN, and HCO+. Sulfur plays an important role in VY CMa, but\nsaturated/unsaturated carbon dominates the molecular content of IRC+10216,\nproducing CH2NH, for example. Although the molecular complexity of IRC+10216 is\ngreater, VY CMa supports a unique \"inorganic\" chemistry leading to the oxides\nPO, AlO, and AlOH. Only diatomic and triatomic compounds were observed in VY\nCMa, while species with 4 or more atoms are common in IRC+10216, reflecting\ncarbon's ability to form strong multiple bonds, unlike oxygen. In VY CMa, a new\nwater maser (v_2=2) has been found, as well as vibrationally-excited NaCl.\nToward IRC+10216, vibrationally-excited CCH was detected for the first time.",
    "authors": [
      "E. D. Tenenbaum",
      "J. L. Dodd",
      "S. N. Milam",
      "N. J. Woolf",
      "L. M. Ziurys"
    ],
    "publication_date": "2010-07-29T08:43:22Z",
    "arxiv_id": "http://arxiv.org/abs/1007.5149v1",
    "download_url": "http://arxiv.org/abs/1007.5149v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Polygrammar: Grammar for Digital Polymer Representation and Generation",
    "abstract": "Polymers are widely-studied materials with diverse properties and\napplications determined by different molecular structures. It is essential to\nrepresent these structures clearly and explore the full space of achievable\nchemical designs. However, existing approaches are unable to offer\ncomprehensive design models for polymers because of their inherent scale and\nstructural complexity. Here, we present a parametric, context-sensitive grammar\ndesigned specifically for the representation and generation of polymers. As a\ndemonstrative example, we implement our grammar for polyurethanes. Using our\nsymbolic hypergraph representation and 14 simple production rules, our\nPolyGrammar is able to represent and generate all valid polyurethane\nstructures. We also present an algorithm to translate any polyurethane\nstructure from the popular SMILES string format into our PolyGrammar\nrepresentation. We test the representative power of PolyGrammar by translating\na dataset of over 600 polyurethane samples collected from literature.\nFurthermore, we show that PolyGrammar can be easily extended to the other\ncopolymers and homopolymers such as polyacrylates. By offering a complete,\nexplicit representation scheme and an explainable generative model with\nvalidity guarantees, our PolyGrammar takes an important step toward a more\ncomprehensive and practical system for polymer discovery and exploration. As\nthe first bridge between formal languages and chemistry, PolyGrammar also\nserves as a critical blueprint to inform the design of similar grammars for\nother chemistries, including organic and inorganic molecules.",
    "authors": [
      "Minghao Guo",
      "Wan Shou",
      "Liane Makatura",
      "Timothy Erps",
      "Michael Foshey",
      "Wojciech Matusik"
    ],
    "publication_date": "2021-05-05T15:43:29Z",
    "arxiv_id": "http://arxiv.org/abs/2105.05278v1",
    "download_url": "http://arxiv.org/abs/2105.05278v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "M(BO)$_{k+1}^-$ Anions: Novel Superhalogens Based on Boronyl Ligands",
    "abstract": "Superhalogens have been a subject of continuous attraction for the last four\ndecades due to their unusual structures and interesting applications. In the\nquest for new superhalogens based on boronyl (BO) ligands, we investigate\nM(BO)$_{k+1}^-$ anions using high-level ab initio CCSD(T) and B3LYP density\nfunctional method for M = Li, Na, K, Be, Mg, Ca, B, and Al. Their structures\nare linear for M = Li, Na, K, trigonal planar M = Be, Mg, Ca, and tetrahedral\nfor M = B, Al. These anions are energetically and thermodynamically stable\nagainst various fragmentations. Their superhalogen property has been\nestablished due to their higher vertical detachment energy (VDE) than halogen,\nbeing in the range 4.44-7.81 eV. For a given k, the stability and VDE of\nM(BO)$_{k+1}^-$ anions decrease with the increase in the size of M, which is\ndue to a decrease in the charge delocalization on BO moieties. There exists a\nlinear correlation between frontier orbitals energy gap and VDE with the\ncoefficient, R$^2$ = 0.93888. It was also noticed that BO ligand, due to lower\ndimerization energy, can be preferably used as an inorganic analog of CN. We\nbelieve that these findings should be interesting for researchers working in\nsuperatomic chemistry as well as in boron chemistry. Keywords:",
    "authors": [
      "Ambrish Kumar Srivastava"
    ],
    "publication_date": "2021-10-07T13:07:12Z",
    "arxiv_id": "http://arxiv.org/abs/2110.03421v1",
    "download_url": "http://arxiv.org/abs/2110.03421v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A high-$κ$ wide-gap layered dielectric for two-dimensional van der\n  Waals heterostructures",
    "abstract": "Van der Waals heterostructures of two-dimensional materials have opened up\nnew frontiers in condensed matter physics, unlocking unexplored possibilities\nin electronic and photonic device applications. However, the investigation of\nwide-gap high-$\\kappa$ layered dielectrics for devices based on van der Waals\nstructures has been relatively limited. In this work, we demonstrate an easily\nreproducible synthesis method for the rare earth oxyhalide LaOBr, and we\nexfoliate it as a 2D layered material with a measured static dielectric\nconstant of $\\epsilon_{0, \\perp} \\simeq 9$ and a wide bandgap of 5.3 eV.\nFurthermore, our research demonstrates that LaOBr can be used as a\nhigh-$\\kappa$ dielectric in van der Waals field-effect transistors with high\nperformance and low interface defect concentrations. Additionally, it proves to\nbe an attractive choice for electrical gating in excitonic devices based on 2D\nmaterials. Our work demonstrates the versatile realization and functionality of\n2D systems with wide-gap and high-$\\kappa$ van der Waals dielectric\nenvironments.",
    "authors": [
      "A. Söll",
      "E. Lopriore",
      "A. K. Ottesen",
      "J. Luxa",
      "G. Pasquale",
      "J. Sturala",
      "F. Hájek",
      "V. Jarý",
      "D. Sedmidubský",
      "K. Mosina",
      "A. Kis",
      "Z. Sofer"
    ],
    "publication_date": "2023-07-25T11:51:27Z",
    "arxiv_id": "http://arxiv.org/abs/2307.13431v1",
    "download_url": "http://arxiv.org/abs/2307.13431v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Designing optoelectronic properties by on-surface synthesis: formation\n  and electronic structure of an iron-terpyridine macromolecular complex",
    "abstract": "Supramolecular chemistry protocols applied on surfaces offer compelling\navenues for atomic scale control over organic-inorganic interface structures.\nIn this approach, adsorbate-surface interactions and two-dimensional\nconfinement can lead to morphologies and properties that differ dramatically\nfrom those achieved via conventional synthetic approaches. Here, we describe\nthe bottom-up, on-surface synthesis of one-dimensional coordination\nnanostructures based on an iron (Fe)-terpyridine (tpy) interaction borrowed\nfrom functional metal-organic complexes used in photovoltaic and catalytic\napplications. Thermally activated diffusion of sequentially deposited ligands\nand metal atoms, and intra-ligand conformational changes, lead to Fe-tpy\ncoordination and formation of these nanochains. Low-temperature Scanning\nTunneling Microscopy and Density Functional Theory were used to elucidate the\natomic-scale morphology of the system, providing evidence of a linear tri-Fe\nlinkage between facing, coplanar tpy groups. Scanning Tunneling Spectroscopy\nreveals highest occupied orbitals with dominant contributions from states\nlocated at the Fe node, and ligand states that mostly contribute to the lowest\nunoccupied orbitals. This electronic structure yields potential for hosting\nphoto-induced metal-to-ligand charge transfer in the visible/near-infrared. The\nformation of this unusual tpy/tri-Fe/tpy coordination motif has not been\nobserved for wet chemistry synthesis methods, and is mediated by the bottom-up\non-surface approach used here.",
    "authors": [
      "Agustin Schiffrin",
      "Martina Capsoni",
      "Gelareh Farahi",
      "Chen-Guang Wang",
      "Cornelius Krull",
      "Marina Castelli",
      "Tanya S. Roussy",
      "Katherine A. Cochrane",
      "Yuefeng Yin",
      "Nikhil Medhekar",
      "Adam Q. Shaw",
      "Wei Ji",
      "Sarah A. Burke"
    ],
    "publication_date": "2023-08-08T07:43:14Z",
    "arxiv_id": "http://arxiv.org/abs/2308.04105v1",
    "download_url": "http://arxiv.org/abs/2308.04105v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A General and Transferable Local Hybrid Functional for Electronic\n  Structure Theory and Many-Fermion Approaches",
    "abstract": "Density functional theory has become the workhorse of quantum physics,\nchemistry, and materials science. Within these fields, a broad range of\napplications needs to be covered. These applications range from solids to\nmolecular systems, from organic to inorganic chemistry, or even from electrons\nto other fermions such as protons or muons. This is emphasized by the plethora\nof density functional approximations that have been developed for various\ncases. In this work, a new local hybrid exchange-correlation density functional\nis constructed from first principles, promoting generality and transferability.\nWe show that constraint satisfaction can be achieved even for admixtures with\nfull exact exchange, without sacrificing accuracy. The performance of the new\nfunctional for electronic structure theory is assessed for thermochemical\nproperties, excitation energies, M\\\"ossbauer isomer shifts, NMR spin--spin\ncoupling constants, NMR shieldings and shifts, magnetizabilities, as well as\nEPR hyperfine coupling constants. Here, the new density functional shows\nexcellent performance throughout all tests and is numerically robust only\nrequiring small grids for converged results. Additionally, the functional can\nbe easily generalized to arbitrary fermions as shown for electron-proton\ncorrelation energies. Therefore, we outline that density functionals generated\nin this way are general purpose tools for quantum mechanical studies.",
    "authors": [
      "Christof Holzer",
      "Yannick J. Franzke"
    ],
    "publication_date": "2024-07-31T16:28:25Z",
    "arxiv_id": "http://arxiv.org/abs/2407.21727v3",
    "download_url": "http://arxiv.org/abs/2407.21727v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unraveling the Interface Chemistry between HCN and Cosmic Silicates by\n  the Interplay of Infrared Spectroscopy and Quantum Chemical Modeling",
    "abstract": "Understanding the interaction between hydrogen cyanide (HCN) and silicate\nsurfaces is crucial for elucidating the prebiotic processes occurring on\ninterstellar grain cores, as well as in cometary and meteoritic matrices. In\nthis study, we characterized the adsorption features of HCN on crystalline\nforsterite (Mg2SiO4) surfaces, one of the most abundant cosmic silicates, by\ncombining experimental infrared spectra at low temperatures (100-150 K) with\nperiodic DFT simulations. Results showed the coexistence of both molecular and\ndissociative HCN adsorption complexes as a function of the considered\nforsterite crystalline face. Molecular adsorptions dominate on the most stable\nsurfaces, while dissociative adsorptions occur predominantly on surfaces of\nlower stability, catalyzed by the enhanced Lewis acid-base behavior of\nsurface-exposed Mg2+-O2- ion pairs. On the whole set of adsorption cases,\nharmonic frequency calculations were carried out and compared with the\nexperimental infrared bands. To disentangle each vibrational mode contributing\nto the experimental broad bands, we run a best non-linear fit between the\npredicted set of frequencies and the experimental bands. The outcome of this\nprocedure allowed us to: i) deconvolute the experimental IR spectrum by\nassigning computed normal modes of vibrations to the main features of each\nband; ii) reveal which crystal faces are responsible of the largest\ncontribution to the adsorbate vibrational bands, giving information about the\nmorphology of the samples. The present straigthforward procedure is quite\ngeneral and of broad interest in the fine characterization of the infrared\nspectra of adsorbates on complex inorganic material surfaces.",
    "authors": [
      "Niccolò Bancone",
      "Rosangela Santalucia",
      "Stefano Pantaleone",
      "Piero Ugliengo",
      "Lorenzo Mino",
      "Albert Rimola",
      "Marta Corno"
    ],
    "publication_date": "2024-09-12T14:28:21Z",
    "arxiv_id": "http://arxiv.org/abs/2409.08074v1",
    "download_url": "http://arxiv.org/abs/2409.08074v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Room Temperature Molecular Single-Electron Transistor",
    "abstract": "A room temperature single-electron transistor based on the single cluster\nmolecule has been demonstrated for the first time. Scanning tunneling\nmicroscope tip was used to study the transport via single carboran cluster\nmolecule 1,7-(CH_3)_2-1,2-C_2B_{10}H_9Tl(OCOCF_3)_2 incorporated into the\nLangmuir-Blodgett monolayer of the stearic acid. DC I-V curves at 300 K showed\nwell pronounced Coulomb staircase, and the current could be controlled by a\nlithographically fabricated gold gate electrode.",
    "authors": [
      "E. S. Soldatov",
      "V. V. Khanin",
      "A. S. Trifonov",
      "S. P. Gubin",
      "V. V. Kolesov",
      "D. E. Presnov",
      "S. A. Iakovenko",
      "G. B. Khomutov",
      "A. N. Korotkov"
    ],
    "publication_date": "1996-10-22T05:41:46Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9610155v2",
    "download_url": "http://arxiv.org/abs/cond-mat/9610155v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Properties of the energy landscape of network models for covalent\n  glasses",
    "abstract": "We investigate the energy landscape of two dimensional network models for\ncovalent glasses by means of the lid algorithm. For three different particle\ndensities and for a range of network sizes, we exhaustively analyse many\nconfiguration space regions enclosing deep-lying energy minima. We extract the\nlocal densities of states and of minima, and the number of states and minima\naccessible below a certain energy barrier, the 'lid'. These quantities show on\naverage a close to exponential growth as a function of their respective\narguments. We calculate the configurational entropy for these pockets of states\nand find that the excess specific heat exhibits a peak at a critical\ntemperature associated with the exponential growth in the local density of\nstates, a feature of the specific heat also observed in real glasses at the\nglass transition.",
    "authors": [
      "J. Christian Schoen",
      "Paolo Sibani"
    ],
    "publication_date": "1998-05-29T14:12:54Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9805396v1",
    "download_url": "http://arxiv.org/abs/cond-mat/9805396v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamic and spectroscopic properties and low temperature\n  thermochromism of chromium tris-acetylacetonate",
    "abstract": "Two narrow anomalies with peaks at $\\sim 30 K$ and $\\sim 60 K$ and a wide\ndiffuse anomaly within the range 110-240 K have been found in a low temperature\nheat capacity of chromium tris-acetylacetonate Cr(AA)_3. Besides, the\nreversible change in color has been discovered when cooling the crystals to\nliquid nitrogen temperature (thermochromism). To clear up the nature of these\neffects the static magnetic susceptibility was measured within the temperature\nrange 2-300 K, the ESR-spectra on the Cr^{3+} ion and the transmission spectra\nin visible region were recorded at 78 K and 300 K, the Raman spectra were\nmeasured within the range 5-220 K. It has been ascertained that the reversible\neffect of thermochromism is observed in most of $\\beta$-diketonates of the\ntransition metals. Some tentative considerations concerning the origin of\ndiscovered effects are put forward.",
    "authors": [
      "V. N. Naumov",
      "G. I. Frolova",
      "V. V. Nogteva",
      "P. A. Stabnikov",
      "T. V. Basova",
      "V. A. Nadolinny",
      "Yu. G. Shvedenkov",
      "I. K. Igumenov"
    ],
    "publication_date": "2000-01-08T16:00:09Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0001084v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0001084v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Single-Molecule Magnets: Jahn-Teller Isomerism and the Origin of Two\n  Magnetization Relaxation Processes in Mn12 Complexes",
    "abstract": "New Mn12 single-molecule magnets (SMM's) with the composition\n[Mn12O12(O2CR)16(H2O)4] were prepared and structurally characterized. Complexes\nof this type can exhibit two out-of-phase ac magnetic susceptibility signals,\none in the 4-7 K region and the other in the 2-3 K region. The origin of the\ntwo magnetization relaxation processes was systematically examined. The X-ray\nstructures of two isomeric forms of a Mn12 SMM are given. One complex has an\nabnormal Jahn-Teller distortion axis. The magnetization hysteresis loops for\nthe two isomers are quite different.",
    "authors": [
      "Sheila M. J. Aubin",
      "Ziming Sun",
      "Hilary J. Eppley",
      "Evan M. Rumberger",
      "Ilia A. Guzei",
      "Kirsten Folting",
      "Peter K. Gantzel",
      "Arnold L. Rheingold",
      "George Christou",
      "David N. Hendrickson"
    ],
    "publication_date": "2001-09-20T22:54:34Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0109380v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0109380v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Peculiarities of electronic heat capacity of thulium cuprates in\n  pseudogap state",
    "abstract": "Precise calorimetric measurements have been carried out in the 7 - 300 K\ntemperature range on two ceramic samples of thulium 123 cuprates TmBa2Cu3O6.92\nand TmBa2Cu3O6.70. The temperature dependence of the heat capacity was analyzed\nin the region where the pseudogap state (PGS) takes place. The lattice\ncontribution was subtracted from the experimental data. The PGS component has\nbeen obtained by comparing electronic heat capacities of two investigated\nsamples because the PGS contribution for the 6.92 sample is negligible. The\nanomalous behavior of the electronic heat capacity near the temperature\nboundary of PGS was found. It is supposed that this anomaly is due to\npeculiarities in N(E) function where N is the density of electronic states and\nE is the energy of carriers of charge.",
    "authors": [
      "E. B. Amitin",
      "K. R. Zhdanov",
      "M. Y. Kameneva",
      "Yu. A. Kovalevskaya",
      "L. P. Kozeeva",
      "I. E. Paukov",
      "A. G. Blinov"
    ],
    "publication_date": "2002-03-12T07:10:29Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0203243v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0203243v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Study of the SmBaCuO solid solutions decomposition and its possible role\n  for changing critical current",
    "abstract": "We studied thermochemical characteristics of the Sm1+xBa2-xCu3Oy single\ncrystals by solution calorimetry. Dependences of formation enthalpies from\nsamarium content were constructed. It was established that solid solutions on\nthe bases of Sm123 could be decomposed both in inert and in oxygen atmosphere\ninto different mixtures. We supposed that solid solutions decomposition could\nlead to increasing critical current density. We assumed from thermochemical\ndata that Jc could be greater for samples prepared in oxygen than for samples\nsynthesized in inert atmosphere. We confirmed these assumptions by comparison\nof obtained thermochemical data with transport properties measured in\nliterature. We also investigated temperature dependences of resistance in the\ntemperature range of 300-550 K during slow heating. As it was shown there was\nanomaly of resistance near 500 K. The origin of this anomaly was discussed.",
    "authors": [
      "N. I. Matskevich",
      "A. I. Romanenko",
      "L. V. Yakovkina",
      "Th. Wolf",
      "G. Krabbes"
    ],
    "publication_date": "2004-01-16T05:54:28Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0401277v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0401277v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Testing the Hydrogen Peroxide-Water Hypothesis for Life on Mars with the\n  TEGA instrument on the Phoenix Lander",
    "abstract": "Since Viking has conducted its life detection experiments on Mars, many\nmissions have enhanced our knowledge about the environmental conditions on the\nRed Planet. However, the Martian surface chemistry and the Viking lander\nresults remain puzzling. Non-biological explanations that favor a strong\ninorganic oxidant are currently favored (e.g., Mancinelli, 1989; Quinn and\nZent, 1999; Klein, 1999, Yen et al., 2000), but problems remain regarding the\nlife time, source, and abundance of that oxidant to account for the Viking\nobservations (Zent and McKay, 1994). Alternatively, a hypothesis favoring the\nbiological origin of a strong oxidizer has recently been advanced (Houtkooper\nand Schulze-Makuch, 2007). Here, we report about laboratory experiments that\nsimulate the experiments to be conducted by the Thermal and Evolved Gas\nAnalyzer (TEGA) instrument of the Phoenix lander, which is to descend on Mars\nin May 2008. Our experiments provide a baseline for an unbiased test for\nchemical versus biological responses, which can be applied at the time the\nPhoenix Lander transmits its first results from the Martian surface.",
    "authors": [
      "Dirk Schulze-Makuch",
      "Carol Turse",
      "Joop Houtkooper",
      "Chris McKay"
    ],
    "publication_date": "2007-10-04T16:15:22Z",
    "arxiv_id": "http://arxiv.org/abs/0710.1036v1",
    "download_url": "http://arxiv.org/abs/0710.1036v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the nature of the spin frustration in the CuO2 ribbon chains of\n  LiCuVO4: Crystal structure determination at 1.6 K, magnetic susceptibility\n  analysis and density functional evaluation of the spin exchange constants",
    "abstract": "The spin-1/2 Cu2+ ions of LiCuVO4 form one-dimensional chains along the\nb-direction, and the spin frustration in LiCuVO4 is described in terms of the\nnearest-neighbor ferromagnetic exchange J1 and the next-nearest-neighbor\nantiferromagnetic exchange J2 in these chains. Recently, it has become\ncontroversial whether or not J1 is stronger in magnitude than J2. To resolve\nthis controversy, we determined the crystal structure of LiCuVO4 at 1.6 K by\nneutron diffraction, analyzed the magnetic susceptibility of LiCuVO4 to deduce\nthe Curie-Weiss temperature \\theta and the J2/J1 ratio, and finally extracted\nthe spin exchange constants of LiCuVO4 on the basis of density functional\ncalculations. Our work shows unambiguously that the Curie-Weiss temperature\n\\theta of LiCuVO4 is negative in the range of -20 K, so that J2 is\nsubstantially stronger in magnitude than J1.",
    "authors": [
      "Hyun-Joo Koo",
      "Changhoon Lee",
      "Myung-Hwan Whangbo",
      "Garry J. McIntyre",
      "Reinhard K. Kremer"
    ],
    "publication_date": "2011-03-08T19:57:11Z",
    "arxiv_id": "http://arxiv.org/abs/1103.1616v1",
    "download_url": "http://arxiv.org/abs/1103.1616v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On a novel nanomaterial based on graphene and POSS: GRAPOSS",
    "abstract": "A novel nanomaterial which consists of graphene sheets decorated with\nsilsesquioxane molecoles has been developed. Indeed, aminopropyl-silsesquioxane\n(POSS-NH2) has been employed to functionalize graphene oxide sheets (GOs). The\nsurface grafting of GOs with POSS-NH2 has been established by infrared\nspectroscopy and X-ray photoelectron spectroscopy, while the morphology has\nbeen investigated by field emission electron microscopy as well as by atomic\nforce microscopy. The combination of the amino functionalized POSS molecules\nwith GO sheets produces a hybrid silicon/graphite-based nanomaterial, named\nGRAPOSS, for which the electrical conductivity of reduced GO was restored, thus\nallowing promising exploitations in several fields such as polymer\nnanocomposites.",
    "authors": [
      "Luca Valentini",
      "Marta Cardinali",
      "Jose M. Kenny",
      "Mirko Prato",
      "Orietta Monticelli"
    ],
    "publication_date": "2011-12-15T09:38:29Z",
    "arxiv_id": "http://arxiv.org/abs/1112.3459v1",
    "download_url": "http://arxiv.org/abs/1112.3459v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Titania Prepared by Ball Milling: Its Characterization and Application\n  as Liquefied Petroleum Gas Sensor",
    "abstract": "Present paper reports the LPG sensing of TiO2 obtained through ball milling.\nThe milled powder was characterized by XRD, TEM and UV-visible spectroscopy.\nFurther the ball milled powder was compressed in to pellet using hydraulic\npress. This pellet was investigated with the exposure of LPG. Variations in\nresistance with exposure of LPG to the sensing pellet were recorded. The\nsensitivity of the sensor was ~ 11 for 5 vol.% of LPG. Response and recovery\ntimes of the sensor were ~ 100 and 250 sec. The sensor was quite sensitive to\nLPG and results were found reproducible within 91%.",
    "authors": [
      "B. C. Yadav",
      "Tripti Shukla",
      "Satyendra Singh",
      "T. P. Yadav"
    ],
    "publication_date": "2012-02-06T11:12:14Z",
    "arxiv_id": "http://arxiv.org/abs/1205.3032v1",
    "download_url": "http://arxiv.org/abs/1205.3032v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin reorientation in the square-lattice antiferromagnets RMnAsO (R =\n  Ce, Nd): Density functional analysis of the spin exchange interactions\n  between the rare-earth and transition-metal ions",
    "abstract": "The spin reorientation (SR) phenomenon of the square-lattice antiferromagnets\nRMnAsO (R = Ce, Nd) was investigated by analyzing the spin exchange\ninteractions between the rare-earth and transition-metal ions (R3+ and Mn2+,\nrespectively) on the basis of density functional calculations. It is found that\nthe symmetry and strength of the Dzyaloshinskii-Moriya (DM) interaction are\ndetermined primarily by the partially filled 4f states of the R3+ ions, and\nthat the DM and biquadratic (BQ) exchanges between the R3+ and Mn2+ ions are\nunusually strong and control the observed spin reorientation phenomenon. Below\ntheir SR temperature, the Mn2+ and Ce3+ moments are orthogonal in CeMnAsO but\nare collinear in NdMnAsO, because the DM interaction dominates over the BQ\ninteraction for CeMnAsO while the opposite is the case for NdMnAsO. Experiments\ndesigned to test the implications of our findings are proposed.",
    "authors": [
      "Changhoon Lee",
      "Erjun Kan",
      "Hongjun Xiang",
      "Reinhard K. Kremer",
      "Seung-Hun Lee",
      "Zenji Hiroi",
      "Myung-Hwan Whangbo"
    ],
    "publication_date": "2012-05-29T19:54:13Z",
    "arxiv_id": "http://arxiv.org/abs/1205.6463v1",
    "download_url": "http://arxiv.org/abs/1205.6463v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prediction of inorganic superconductors with quasi-one-dimensional\n  crystal structure",
    "abstract": "Models of superconductors having a quasi-one-dimensional crystal structure\nbased on the convoluted into a tube Ginzburg sandwich, which comprises a\nlayered dielectric-metal-dielectric structure, have been suggested. The\ncritical crystal chemistry parameters of the Ginzburg sandwich determining the\npossibility of the emergence of superconductivity and the Tc value in layered\nhigh-Tc cuprates, which could have the same functions in quasi-one-dimensional\nfragments (sandwich-type tubes), have been examined. The crystal structures of\nknown low-temperature superconductors, in which one can mark out similar\nquasi-one- dimensional fragments, have been analyzed. Five compounds with\nquasi-one-dimensional structures, which can be considered as potential parents\nof new superconductor families, possibly with high transition temperatures,\nhave been suggested. The methods of doping and modification of these compounds\nare provided.",
    "authors": [
      "L. M. Volkova",
      "D. V. Marinin"
    ],
    "publication_date": "2012-07-30T21:46:25Z",
    "arxiv_id": "http://arxiv.org/abs/1207.7112v2",
    "download_url": "http://arxiv.org/abs/1207.7112v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Crystal structure and superconducting properties of hexagonal\n  lithium-niobium oxynitride",
    "abstract": "A hexagonal oxynitride (Li0.88_0.12)Nb3.0(O0.13N0.87)4 was synthesized\nthrough ammonia nitridation of LiNb3O8. The structural analysis revealed that\nthis oxynitride consists of alternate stacking of octahedral and prismatic\nlayers with different Li/Nb ratios: significant amounts of Li and Nb atoms\n(Li/Nb = 43/57) coexist in the octahedral layer, while the prismatic site is\npreferentially occupied by Nb (Li/Nb = 3/97). A metallic behavior was\naccompanied by an abrupt drop of electrical resistivity at about 3 K.\nFurthermore, large diamagnetism and specific-heat anomaly were observed below\nthis temperature, suggesting the appearance of superconductivity in the Li-Nb\noxynitride.",
    "authors": [
      "Teruki Motohashi",
      "Masahiko Ito",
      "Yuji Masubuchi",
      "Makoto Wakeshima",
      "Shinichi Kikkawa"
    ],
    "publication_date": "2012-09-29T03:13:15Z",
    "arxiv_id": "http://arxiv.org/abs/1210.0072v1",
    "download_url": "http://arxiv.org/abs/1210.0072v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Flexible fiber batteries for applications in smart textiles",
    "abstract": "Here we discuss two alternative approaches for building flexible batteries\nfor applications in smart textiles. The first approach uses well-studied\ninorganic electrochemistry (Al-NaOCl galvanic cell) and innovative packaging in\norder to produce batteries in a slender and flexible fiber form that can be\nfurther weaved directly into the textiles. During fabrication process the\nbattery electrodes are co-drawn within a microstructured polymer fiber, which\nis later filled with liquid electrolyte. The second approach describes Li-ion\nchemistry within solid polymer electrolytes that are used to build a fully\nsolid and soft rechargeable battery that can be furthermore stitched onto a\ntextile, or integrated as stripes during weaving process.",
    "authors": [
      "Hang Qu",
      "Jean-Pierre Bourgeois",
      "Julien Rolland",
      "Alexandru Vlad",
      "Jean-François Gohy",
      "Maksim Skorobogatiy"
    ],
    "publication_date": "2013-01-07T17:06:18Z",
    "arxiv_id": "http://arxiv.org/abs/1301.1266v1",
    "download_url": "http://arxiv.org/abs/1301.1266v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dust-forming molecules in VY Canis Majoris (and Betelgeuse)",
    "abstract": "The formation of inorganic dust in circumstellar environments of evolved\nstars is poorly understood. Spectra of molecules thought to be most important\nfor the nucleation, i.e. AlO, TiO, and TiO2, have been recently detected in the\nred supergiant VY CMa. These molecules are effectively formed in VY CMa and the\nobservations suggest that non-equilibrium chemistry must be involved in their\nformation and nucleation into dust. In addition to exploring the recent\nobservations of VY CMa, we briefly discuss the possibility of detecting these\nmolecules in the dust-poor circumstellar environment of Betelgeuse.",
    "authors": [
      "T. Kaminski",
      "C. A. Gottlieb",
      "M. R. Schmidt",
      "N. A. Patel",
      "K. H. Young",
      "K. M. Menten",
      "S. Brunken",
      "H. S. P. Muller",
      "J. M. Winters",
      "M. C. McCarthy"
    ],
    "publication_date": "2013-02-27T16:58:19Z",
    "arxiv_id": "http://arxiv.org/abs/1302.6922v1",
    "download_url": "http://arxiv.org/abs/1302.6922v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thirty Femtograms Detection of Iron in Mammalian Cells",
    "abstract": "Inorganic nanomaterials and particles with enhanced optical, mechanical or\nmagnetic attributes are currently being developed for a wide range of\napplications. Safety issues have been formulated however concerning their\npotential cyto- and genotoxicity. For in vivo and in vitro experimentations,\nrecent developments have heightened the need of simple and facile methods to\nmeasure the amount of nanoparticles taken up by cells or tissues. In this work,\nwe present a rapid and highly sensitive method for quantifying the uptake of\niron oxide nanoparticles in mammalian cells. Our approach exploits the\ndigestion of incubated cells with concentrated hydrochloric acid reactant and a\ncolorimetric based UV-Visible absorption technique. The technique allows the\ndetection of iron in cells over 4 decades in masses, from 0.03 to 300 picograms\nper cell. Applied on particles of different surface chemistry and sizes, the\nprotocol demonstrates that the coating is the key parameter in the\nnanoparticle/cell interactions. The data are corroborated by scanning and\ntransmission electron microscopy and stress the importance of resiliently\nadsorbed nanoparticles at the plasma membrane.",
    "authors": [
      "A. Galimard",
      "M. Safi",
      "N. Ould-Moussa",
      "D. Montero",
      "H. Conjeaud",
      "J. -F. Berret"
    ],
    "publication_date": "2013-11-23T16:33:46Z",
    "arxiv_id": "http://arxiv.org/abs/1311.6019v1",
    "download_url": "http://arxiv.org/abs/1311.6019v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New insights on the thermal decomposition of lanthanide(III) and\n  actinide(III) oxalates: from neodymium and cerium to plutonium",
    "abstract": "Lanthanides are often used as surrogates to study the properties of actinide\ncompounds. Their behaviour is considered to be quite similar as they both\npossess f valence electrons and are close in size and chemical properties. This\nstudy examines the potential of using two lanthanides (neodymium and cerium) as\nsurrogates for plutonium during the thermal decomposition of isomorphic oxalate\ncompounds, in the trivalent oxidation state, into oxides. Thus, the thermal\ndecomposition of neodymium, cerium and plutonium (III) oxalates are\ninvestigated by several coupled thermal analyses (TG-DTA/DSC-MS/FT-IR) and\ncomplementary characterisation techniques (XRD, UV-vis, FT-IR, SEM, carbon\nanalyser) under both oxidizing and inert atmosphere. The thermal decomposition\nmechanisms determined in this study confirmed some previous results reported in\nthe literature, among diverging propositions, while also elucidating some\noriginal mechanisms not previously considered. Calculated thermodynamic and\nkinetic parameters for the studied systems under both atmospheres are reported\nand compared with available literature data. Similarities and differences\nbetween the thermal behaviour of plutonium(III) and lanthanide(III) oxalates\nare outlined.",
    "authors": [
      "Lucie De Almeida",
      "Stéphane Grandjean",
      "Nicolas Vigier",
      "Fabrice Patisson"
    ],
    "publication_date": "2014-02-13T07:20:34Z",
    "arxiv_id": "http://arxiv.org/abs/1402.3046v1",
    "download_url": "http://arxiv.org/abs/1402.3046v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Atomic electronic states: the L-S and j-j coupling schemes and their\n  correlation",
    "abstract": "In the first part of this paper, we review the assumption of the L-S coupling\nscheme, with which we derive the electronic states arising from a given atomic\nconfiguration. Then, with the aid of the spectral data of Group 15 elements, it\nbecomes clear that the assumption of the L-S coupling scheme is no longer valid\nas we go farther and farther down the Periodic Table. In the second part, we\nintroduce the j-j coupling scheme, which is seldom covered in standard\ninorganic chemistry texts, and contrast the assumptions of the two schemes.\nNext, we use two worked examples to demonstrate the derivation of electronic\nstates with the j-j coupling scheme. Finally, the correlation between the\nstates derived by L-S and j-j schemes is pictorially shown. It is believed a\nstudent, by also studying j-j coupling schemes (by no means a difficult task)\nalong with the L-S scheme, will gain a better understanding of the concept of\natomic electronic states.",
    "authors": [
      "Wai-Kee Li",
      "S. M. Blinder"
    ],
    "publication_date": "2014-09-06T17:01:58Z",
    "arxiv_id": "http://arxiv.org/abs/1409.2032v1",
    "download_url": "http://arxiv.org/abs/1409.2032v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Discovery of superoxide reductase: an historical perspective",
    "abstract": "For more than 30 years, the only enzymatic system known to catalyze the\nelimination of superoxide was superoxide dismutase, SOD. SOD has been found in\nalmost all organisms living in the presence of oxygen, including some anaerobic\nbacteria, supporting the notion that superoxide is a key and general component\nof oxidative stress. Recently, a new concept in the field of the mechanisms of\ncellular defense against superoxide has emerged. It was discovered that\nelimination of superoxide in some anaerobic and microaerophilic bacteria could\noccur by reduction, a reaction catalyzed by a small metalloenzyme thus named\nsuperoxide reductase, SOR. Having played a major role in this discovery, we\ndescribe here how the concept of superoxide reduction emerged and how it was\nexperimentally substantiated independently in our laboratory.",
    "authors": [
      "Vincent Nivière",
      "Marc Fontecave"
    ],
    "publication_date": "2014-12-03T08:45:12Z",
    "arxiv_id": "http://arxiv.org/abs/1412.1235v1",
    "download_url": "http://arxiv.org/abs/1412.1235v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Role of Zinc and Niobium in the Giant Piezoelectric Response of\n  PbZn1/3Nb2/3O3",
    "abstract": "Relaxor ferroelectric perovskites are highly polarizable and can exhibit\ngiant coupling between elastic strain and an applied electric field. Here, we\nreport an in situ extended X-ray absorption fine structure (EXAFS) study of a\nPbZn1/3Nb2/3O3 (PZN) single crystal as a function of the electric field. We\nshow that the strong dipoles in the NbO6 octahedra bonds are aligned along the\nfour \\textless{} 011 \\textgreater{} directions close to the orientation of the\nelectric field, while a small reversible polar shift occurs for Zn in the\ndirection of the electric field, i.e., positive or negative. This reversible\nZn-O polar shift is proposed to play an important role in both the \"easy\"\nswitching of the ferroelectric polarization and the giant piezoelectric effect\nin PZN.",
    "authors": [
      "Ali Al-Zein",
      "Hichem Dammak",
      "Philippe Papet",
      "Olivier Mathon",
      "Bernard Hehlen",
      "Claire Levelut",
      "Julien Haines",
      "Jerome Rouquette"
    ],
    "publication_date": "2014-12-11T04:36:35Z",
    "arxiv_id": "http://arxiv.org/abs/1412.3536v1",
    "download_url": "http://arxiv.org/abs/1412.3536v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Temperature Dependent Interaction Non-Additivity in the Inorganic Ionic\n  Clusters",
    "abstract": "Interaction non-additivity in the chemical context means that binding of\ncertain atom to a reference atom cannot be fully predicted from the\ninteractions of these two atoms with other atoms. This constitutes one of key\nphenomena determining an identity of our world, which would have been much\npoorer otherwise. Ionic systems provide a good example of the interaction\nnon-additivity in most cases due to electron transfer and delocalization\neffects. We report Born-Oppenheimer molecular dynamics (BOMD) simulations of\nLiCl, NaCl, and KCl at 300, 1500, and 2000 K. We show that our observations\noriginate from interplay of thermal motion during BOMD and cation nature. In\nthe case of alkali cations, ionic nature plays a more significant role than\ntemperature. Our results bring fundamental understanding of electronic effects\nin the condensed phase of ionic systems and foster progress in physical\nchemistry and engineering.",
    "authors": [
      "Vitaly V. Chaban",
      "Oleg V. Prezhdo"
    ],
    "publication_date": "2015-02-21T02:21:45Z",
    "arxiv_id": "http://arxiv.org/abs/1502.06052v1",
    "download_url": "http://arxiv.org/abs/1502.06052v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strengthening gold-gold bonds by complexing gold clusters with noble\n  gases",
    "abstract": "We report an unexpectedly strong and complex chemical bonding of rare-gas\natoms to neutral gold clusters. The bonding features are consistently\nreproduced at different levels of approximation within density-functional\ntheory and beyond: from GGA, through hybrid and double-hybrid functionals, up\nto renormalized second-order perturbation theory. The main finding is that the\nadsorption of Ar, Kr, and Xe reduces electron-electron repulsion within gold\ndimer, causing strengthening of the Au-Au bond. Differently from the dimer, the\nrare-gas adsorption effects on the gold trimer's geometry and vibrational\nfrequencies are mainly due to electron occupation of the trimer's lowest\nunoccupied molecular orbital. For the trimer, the theoretical results are also\nconsistent with far-infrared multiple photon dissociation experiments.",
    "authors": [
      "Luca M. Ghiringhelli",
      "Sergey V. Levchenko"
    ],
    "publication_date": "2015-03-12T14:42:12Z",
    "arxiv_id": "http://arxiv.org/abs/1503.03750v1",
    "download_url": "http://arxiv.org/abs/1503.03750v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Absence of Colossal Magnetoresistance in the Oxypnictide\n  PrMnAsO0.95F0.05",
    "abstract": "We have recently reported a new mechanism of colossal magnetoresistance in\nelectron doped Mn oxypnictides NdMnAsO1-xFx. Magnetoresistances of up to -95\npercent at 3 K have been observed. Here we show that upon replacing Nd for Pr,\nthe CMR is surprisingly no longer present. Instead a sizeable negative\nmagnetoresistance is observed for PrMnAsO0.95F0.05 below 35 K (MR7T (12 K) =\n-13.4 percent for PrMnAsO0.9F0.05. A detailed neutron and synchrotron X-ray\ndiffraction study of PrMnAsO0.95F0.05 has been performed, which shows that a\nstructural transition, Ts, occurs at 35 K from tetragonal P4/nmm to\northorhombic Pmmn symmetry. The structural transition is driven by the Pr 4f\nelectrons degrees of freedom.",
    "authors": [
      "Eve. J. Wildman",
      "Falak Sher",
      "Abbie. C. Mclaughlin"
    ],
    "publication_date": "2015-03-26T08:57:27Z",
    "arxiv_id": "http://arxiv.org/abs/1503.07651v1",
    "download_url": "http://arxiv.org/abs/1503.07651v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First principles study of electronic structure for cubane-like and\n  ring-shaped structures of M4O4, M4S4 clusters (M = Mn, Fe, Co, Ni, Cu)",
    "abstract": "Spin-polarized DFT has been used to perform a comprehensive study of the\ngeometric structures and electronic properties for isolated M4X4 nano-clusters\nbetween their two stable isomers - a planar rhombus-like 2D structure and a\ncubane-like 3D structure with M = Mn, Fe, Co, Ni, Cu ; X = O, S. These two\nstructural patterns of the M4X4 clusters are commonly found as building blocks\nin several poly-nuclear transition metal complexes in inorganic chemistry. The\neffect of the van der Waals corrections to the physical properties have been\nconsidered in the electronic structure calculations employing the empirical\nGrimme's correction (DFT+D2). We report here an interesting trend in their\nrelative structural stability - the isolated M4O4 clusters prefer to stabilize\nmore in the planar structure, while the cubane-like 3D structure is more\nfavourable for most of the isolated M4S4 clusters than their planar 2D\ncounterparts. Our study reveals that this contrasting trend in the relative\nstructural stability is expected to be driven by an interesting interplay\nbetween the s-d and p-d hybridization effects of the constituents' valence\nelectrons.",
    "authors": [
      "Soumendu Datta",
      "Badiur Rahaman"
    ],
    "publication_date": "2015-12-25T05:25:53Z",
    "arxiv_id": "http://arxiv.org/abs/1512.07958v1",
    "download_url": "http://arxiv.org/abs/1512.07958v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the formation of molecules and solid-state compounds from the AGB to\n  the PN phases",
    "abstract": "During the asymptoyic giant branch (AGB) phase, different elements are\ndredge-up to the stellar surface depending on progenitor mass and metallicity.\nWhen the mass loss increases at the end of the AGB, a circumstellar dust shell\nis formed, where different (C-rich or O-rich) molecules and solid-state\ncompounds are formed. These are further processed in the transition phase\nbetween AGB stars and planetary nebulae (PNe) to create more complex organic\nmolecules and inorganic solid-state compounds (e.g., polycyclic aromatic\nhydrocarbons, fullerenes, and graphene precursors in C-rich environments and\noxides and crystalline silicates in O-rich ones). We present an observational\nreview of the different molecules and solid-state materials that are formed\nfrom the AGB to the PN phases. We focus on the formation routes of complex\nfullerene (and fullerene-based) molecules as well as on the level of dust\nprocessing depending on metallicity.",
    "authors": [
      "D. A. Garcia-Hernandez",
      "A. Manchado"
    ],
    "publication_date": "2016-03-02T14:35:38Z",
    "arxiv_id": "http://arxiv.org/abs/1603.00723v1",
    "download_url": "http://arxiv.org/abs/1603.00723v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "La1-xBi1+xS3 (x~0.08): An n-Type Semiconductor",
    "abstract": "The new bismuth chalcogenide La0.92Bi1.08S3 crystallizes in the monoclinic\nspace group C2/m with a = 28.0447(19) {\\AA}, b = 4.0722(2) {\\AA}, c =\n14.7350(9) {\\AA}, and $\\beta$ = 118.493(5){\\deg}. The structure of\nLa0.92Bi1.08S3 is built up of NaCl-type Bi2S5 blocks, and BiS4 and LaS5\ninfinitely long chains forming a compact three-dimensional framework with\nparallel tunnels. Optical spectroscopy and resistivity measurements reveal a\nsemiconducting behavior with a band gap of ~ 1 eV and activation energy for\ntransport of 0.36(1) eV. Thermopower measurements suggest the majority carriers\nof La0.92Bi1.08S3 are electrons. Heat capacity measurements indicate no phase\ntransitions from 2 to 300 K. Band structure calculations at the density\nfunctional theory level confirm the semiconducting nature and the indirect gap\nof La0.92Bi1.08S3.",
    "authors": [
      "Fei Han",
      "Huimei Liu",
      "Christos D. Malliakas",
      "Mihai Sturza",
      "Duck Young Chung",
      "Xiangang Wan",
      "Mercouri G. Kanatzidis"
    ],
    "publication_date": "2016-06-26T07:33:34Z",
    "arxiv_id": "http://arxiv.org/abs/1606.08002v1",
    "download_url": "http://arxiv.org/abs/1606.08002v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Long term stability and reproducibility of magnetic colloids are key\n  issues for steady values of Specific Power Absorption through time",
    "abstract": "Virtually all clinical applications of magnetic nanoparticles (MNPs) require\nthe formulation of biocompatible, water-based magnetic colloids. For magnetic\nhyperthermia, the requirements also include a high colloidal stability against\nprecipitation and agglomeration of the constituent MNPs, in order to keep the\nheating efficiency of the ferrofluid in the long term. The specific power\nabsorption (SPA) of single-domain MNPs depends critically on the average\nparticle size and size distribution width, therefore first-rate reproducibility\namong different batches regarding these parameters are also needed. We have\nstudied the evolution of the SPA of highly reproducible and stable water-based\ncolloid composed of polymer coated $Fe_{3}O_{4}$ magnetic nanoparticles. By\nmeasuring the specific power absorption (SPA) values along one year as a\nfunction of field amplitude and frequencies ($H \\leq 24 kA/m$; $260 \\leq f \\leq\n830 kHz$), we demonstrated that SPA in these samples can be made reproducible\nbetween successive synthesis, and stable along several months, due to the in\nsitu polymer coating that provides colloidal stability and keeps dipolar\ninteractions negligible.",
    "authors": [
      "B. Sanz",
      "M. P. Calatayud",
      "N. Cassinelli",
      "M. R. Ibarra",
      "G. F. Goya"
    ],
    "publication_date": "2016-08-25T07:10:57Z",
    "arxiv_id": "http://arxiv.org/abs/1609.05172v1",
    "download_url": "http://arxiv.org/abs/1609.05172v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Various arsenic network structures in 112-type Ca1-xLaxFe1-yPdyAs2\n  revealed by synchrotron x-ray diffraction experiments",
    "abstract": "Two novel 112-type palladium doped iron arsenides were synthesized and\nidentified using comprehensive studies involving synchrotron x-ray diffraction\nand x-ray absorption near edge structure (XANES) experiments. Whereas in-plane\narsenic zigzag chains were found in 112-type superconducting iron arsenide,\nCa1-xLaxFeAs2 with maximum Tc = 34 K, deformed arsenic network structures\nappeared in 112-type materials such as longitudinal arsenics zigzag chains in\nCaFe1-yPdyAs2 (y ~ 0.51) and arsenic square sheets constructed via hypervalent\nbonding in Ca1-xLaxFe1-yPdyAs2 (x ~ 0.31, y ~ 0.30). As K-edge XANES spectra\nclarified the similar oxidization states around FeAs4 tetrahedrons, expecting\nus the possible parents for high Tc 112-type iron arsenide superconductors.",
    "authors": [
      "Shinya Tamura",
      "Naoyuki Katayama",
      "Yuto Yamada",
      "Yuki Sugiyama",
      "Kento Sugawara",
      "Hiroshi Sawa"
    ],
    "publication_date": "2017-03-13T00:27:27Z",
    "arxiv_id": "http://arxiv.org/abs/1703.04204v1",
    "download_url": "http://arxiv.org/abs/1703.04204v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The spin resonance clock transition of the endohedral fullerene\n  $^{15}\\mathrm{N@C}_{60}$",
    "abstract": "The endohedral fullerene $^{15}\\mathrm{N@C}_{60}$ has narrow electron\nparamagnetic resonance lines which have been proposed as the basis for a\ncondensed-matter portable atomic clock. We measure the low-frequency spectrum\nof this molecule, identifying and characterizing a clock transition at which\nthe frequency becomes insensitive to magnetic field. We infer a linewidth at\nthe clock field of 100 kHz. Using experimental data, we are able to place a\nbound on the clock's projected frequency stability. We discuss ways to improve\nthe frequency stability to be competitive with existing miniature clocks.",
    "authors": [
      "R. T. Harding",
      "S. Zhou",
      "J. Zhou",
      "T. Lindvall",
      "W. K. Myers",
      "A. Ardavan",
      "G. A. D. Briggs",
      "K. Porfyrakis",
      "E. A. Laird"
    ],
    "publication_date": "2017-05-13T13:05:07Z",
    "arxiv_id": "http://arxiv.org/abs/1705.04817v1",
    "download_url": "http://arxiv.org/abs/1705.04817v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Converting water adsorption and capillary condensation in useable forces\n  with simple porous inorganic thin films",
    "abstract": "This work reports an innovative humidity driven actuation concept based on\nBangham effect using simple nanoporous sol-gel silica thin films as humidity\nresponsive materials. Bilayer shaped actuators, consisting on a\nhumidity-sensitive active nanostructured silica film deposited on a polymeric\nsubstrate (Kapton) were demonstrated as an original mean to convert water\nmolecule adsorption and capillary condensation in useable mechanical work.\nReversible silica surface energy modifications by water adsorption and the\nenergy produced by the rigid silica film contraction, induced by water\ncapillary condensation in mesopores, were finely controlled and used as the\nenergy sources. The influence of the film nanostructure (microporosity,\nmesoporosity) and thickness, and of the polymeric support thickness, on the\nactuation force, on the movement speed, and on the amplitude of displacement\nare clearly evidenced and discussed. We show that the global mechanical\nresponse of such silica-based actuators can be easily adjusted to fabricate a\nhumidity variation triggered tailor-made actuation systems. This first insight\nin hard ceramic stimulus responsive materials may open the door toward new\ngeneration of surface chemistry driven actuation systems.",
    "authors": [
      "Mickael Boudot",
      "Hervé Elettro",
      "David Grosso"
    ],
    "publication_date": "2017-07-06T20:10:31Z",
    "arxiv_id": "http://arxiv.org/abs/1708.05610v1",
    "download_url": "http://arxiv.org/abs/1708.05610v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ternary inorganic compounds containing carbon, nitrogen, and oxygen at\n  high pressures",
    "abstract": "Ternary C_{x}N_{y}O_{z} compounds are actively researched as novel high\nenergy density and ultrahard materials. Although some synthesis work has been\nperformed at ambient conditions, very little is known about the high pressure\nchemistry of of C_{x}N_{y}O_{z} compounds. In this work, first principles\nvariable-composition evolutionary structure prediction calculations are\nperformed with the goal of discovering novel mixed C_{x}N_{y}O_{z} materials at\nambient and high pressure conditions. By systematically searching ternary\nvariable composition crystalline materials, the full ternary phase diagram is\nconstructed in the range of pressures from 0 to 100 GPa. The search finds the\nC_{2}N_{2}O crystal containing extended covalent network of C, N, and O atoms,\nhaving space group symmetry Cmc2_{1}, and stable above just 10 GPa. Several\nother novel metastable (CO)_{x}-(N)_{y} crystalline compounds discovered during\nthe search, including two polymorphs of C_{2}NO_{2} and two polymorphs of\nC_{3}N_{2}O_{3} crystals are found to be energetically favorable compared to\npolymeric carbon monoxide (CO) and nitrogen. Predicted new compounds are\ncharacterized by their Raman spectra and equations of state.",
    "authors": [
      "Brad A. Steele",
      "Ivan I. Oleynik"
    ],
    "publication_date": "2017-10-10T15:22:50Z",
    "arxiv_id": "http://arxiv.org/abs/1710.03652v1",
    "download_url": "http://arxiv.org/abs/1710.03652v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Facile synthetic route to transition metal oxyfluorides via reactions\n  between metal oxides and PTFE",
    "abstract": "Inorganic oxyfluorides have significant importance in the development of new\nfunctionalities for energy production and storage, photonics, catalysis, etc.\nIn order to explore a simple preparation route that avoids the use of toxic HF\nor F2 gas as a reaction reagent, we have employed polytetrafluoroethylene\n(PTFE). Five oxyfluorides including Nb5O12F, Nb3O7F, Ta3O7F, TaO2F, and\nMo4O11.2F0.8 were synthesized by reactions between PTFE and transition metal\noxides in sealed quartz ampules. The reaction mechanism was studied by means of\ngas analysis, which detected SiF4 as a main product gas during the reaction. A\npossible reaction mechanism between the PTFE and transition metal oxides is\ndiscussed.",
    "authors": [
      "Daigorou Hirai",
      "Osamu Sawai",
      "Teppei Nunoura",
      "Zenji Hiroi"
    ],
    "publication_date": "2018-03-20T03:05:35Z",
    "arxiv_id": "http://arxiv.org/abs/1803.07229v1",
    "download_url": "http://arxiv.org/abs/1803.07229v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Highly Integrated Organic-Inorganic Hybrid Architectures by Non-Covalent\n  Exfoliation of Graphite and Assembly with Zinc Oxide Nanoparticles",
    "abstract": "Herein, we report an easy, straight forward, and versatile approach to build\n0D/2D hybrid nanoparticle/graphene architectures by means of non-covalent\nchemistry and a modified Layer-by-Layer assembly. Three water soluble perylene\ndiimides were employed to efficiently exfoliate pristine graphite into\npositively charged few- and multilayer graphene flakes. Further combination of\nthese cationic building blocks with anionic zinc oxide nanoparticles led to the\nformation of tailor-made hybrid films via electrostatic and van der Waals\ninteractions. These supramolecular hybrid nano-structures were thoroughly\ncharacterized by UV/Vis and Raman spectroscopy, AFM as well as electron\nmicroscopy, showing outstanding long-range homogeneity and high integrity in\nthe centimetre-scale, uniform nanometric thickness between 60-100 nm and a\nclose contact between the different building blocks. Due to their\nstraightforward assembly. These architectures can be considered as promising\ncandidates for numerous advanced applications especially in the field of energy\nstorage and conversion.",
    "authors": [
      "Mario Marcia",
      "Chau Vinh",
      "Christian Dolle",
      "Gonzalo Abellán",
      "Jörg Schönamsgruber",
      "Torsten Schunk",
      "Benjamin Butz",
      "Erdmann Spiecker",
      "Frank Hauke",
      "Andreas Hirsch"
    ],
    "publication_date": "2018-05-04T10:03:02Z",
    "arxiv_id": "http://arxiv.org/abs/1805.09129v1",
    "download_url": "http://arxiv.org/abs/1805.09129v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optical creation and temperature stability of the hidden charge density\n  wave state in 1T-TaS_{2-x}Se_{x}",
    "abstract": "The femtosecond transinet optical spectroscopy is employed to study the\nrelaxation dynamics of the equilibrium and hidden metastable\ncharge-density-wave states in single crystals of 1$T$-TaS$_{2-x}$Se$_{x}$ as a\nfunction of the Se doping $x$. Similarly to pristine 1$T$-TaS$_{2}$, the\ntransition to a hidden phase is observed at low temperature after a quench with\na single 50~fs laser pulse, in the commensurate Mott phase up to $x=0.6$. The\nphoto-induced hidden-phase formation is accompanied by a notable change in the\ncoherent phonon spectra, and particularly the collective amplitude mode. While\nthe stability of the hidden phase with increased temperatures is only slightly\ndependent of the Se content the hidden-phase creation-treshold fluence strongly\nincreases with the Se content from 1 to $\\sim4$ mJ/cm$^{2}$.",
    "authors": [
      "L. Stojchevska",
      "P. Šutar",
      "E. Goreshnik",
      "D. Mihailovic",
      "T. Mertelj"
    ],
    "publication_date": "2018-06-08T11:34:36Z",
    "arxiv_id": "http://arxiv.org/abs/1806.03094v1",
    "download_url": "http://arxiv.org/abs/1806.03094v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Incipient spin-dipole coupling in a 1D helical-chain metal-organic\n  hybrid",
    "abstract": "Low dimensional magnetic systems (such as spin-chain) are extensively studied\ndue to their exotic magnetic properties. Here, we would like to address that\nsuch systems should also be interesting in the field of dielectric,\nferroelectricity and magnetodielectric coupling. As a prototype example, we\nhave investigated a one-dimensional (1D) helical-chain metal-organic hybrid\nsystem with a chiral structure which shows a broad hump in magnetic\nsusceptibility around 55 K (Tmax). The complex dielectric constant exactly\ntraces this feature, which suggests intrinsic magnetodielectric coupling in\nthis chiral system. The dipolar ordering at Tmax occurs due to\nlattice-distortion which helps to minimize the magnetic energy accompanied by\n1D-magnetic ordering or vice-versa. This experimental demonstration initiates a\nstep to design and investigate hybrid organic-inorganic magnetic systems\nconsisting of chiral structure towards ferroelectricity and magnetodielectric\ncoupling.",
    "authors": [
      "Tathamay Basu",
      "Clarisse Bloyet",
      "Jean-Michel Rueff",
      "Vincent Caignaert",
      "Alain Pautrat",
      "Bernard Raveau",
      "Guillaume Rogez",
      "Paul-Alain Jaffrès"
    ],
    "publication_date": "2018-09-13T07:26:28Z",
    "arxiv_id": "http://arxiv.org/abs/1809.04809v1",
    "download_url": "http://arxiv.org/abs/1809.04809v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolution of Complexity in Out-of-Equilibrium Systems by Time-Resolved\n  or Space-Resolved Synchrotron Radiation Techniques",
    "abstract": "Out-of-equilibrium phenomena are attracting high interest in physics,\nmaterials science, chemistry and life sciences. In this state, the study of\nstructural fluctuations at different length scales in time and space are\nnecessary to achieve significant advances in the understanding of\nstructure-functionality relationship. The visualization of patterns arising\nfrom spatiotemporal fluctuations is nowadays possible thanks to new advances in\nX-ray instrumentation development that combine high resolution both in space\nand in time. We present novel experimental approaches using high brilliance\nsynchrotron radiation sources, fast detectors and focusing optics, joint with\nadvanced data analysis based on automated statistical, mathematical and imaging\nprocessing tools. This approach has been used to investigate structural\nfluctuations in out-of-equilibrium systems in the novel field of inhomogeneous\nquantum complex matter at the crossing point of technology, physics and\nbiology. In particular, we discuss how nanoscale complexity controls the\nemergence of high temperature superconductivity (HTS), myelin functionality and\nformation of hybrid organic-inorganic nanostructures. The emergent complex\ngeometries, opening novel venues to quantum technology and to development of\nquantum physics of living systems, are discussed",
    "authors": [
      "Gaetano Campi",
      "Antonio Bianconi"
    ],
    "publication_date": "2019-02-21T08:20:34Z",
    "arxiv_id": "http://arxiv.org/abs/1902.07909v2",
    "download_url": "http://arxiv.org/abs/1902.07909v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Metal-Organic Frameworks in Germany: from Synthesis to Function",
    "abstract": "Metal-organic frameworks (MOFs) are constructed from a combination of\ninorganic and organic units to produce materials which display high porosity,\namong other unique and exciting properties. MOFs have shown promise in many\nwide-ranging applications, such as catalysis and gas separations. In this\nreview, we highlight MOF research conducted by Germany-based research groups.\nSpecifically, we feature approaches for the synthesis of new MOFs,\nhigh-throughput MOF production, advanced characterization methods and examples\nof advanced functions and properties.",
    "authors": [
      "Jack D. Evans",
      "Bikash Garai",
      "Helge Reinsch",
      "Weijin Li",
      "Stefano Dissegna",
      "Volodymyr Bon",
      "Irena Senkovska",
      "Roland A. Fischer",
      "Stefan Kaskel",
      "Christoph Janiak",
      "Norbert Stock",
      "Dirk Volkmer"
    ],
    "publication_date": "2019-04-29T07:16:17Z",
    "arxiv_id": "http://arxiv.org/abs/1904.12474v1",
    "download_url": "http://arxiv.org/abs/1904.12474v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-throughput Density Functional Perturbation Theory and Machine\n  Learning Predictions of Infrared, Piezoelectric and Dielectric Responses",
    "abstract": "Many technological applications depend on the response of materials to\nelectric fields, but available databases of such responses are limited. Here,\nwe explore the infrared, piezoelectric and dielectric properties of inorganic\nmaterials by combining high-throughput density functional perturbation theory\nand machine learning approaches. We compute {\\Gamma}-point phonons, infrared\nintensities, Born-effective charges, piezoelectric, and dielectric tensors for\n5015 non-metallic materials in the JARVIS-DFT database. We find 3230 and 1943\nmaterials with at least one far and mid-infrared mode, respectively. We\nidentify 577 high-piezoelectric materials, using a threshold of 0.5 C/m2. Using\na threshold of 20, we find 593 potential high-dielectric materials.\nImportantly, we analyze the chemistry, symmetry, dimensionality, and geometry\nof the materials to find features that help explain variations in our datasets.\nFinally, we develop high-accuracy regression models for the highest infrared\nfrequency and maximum Born-effective charges, and classification models for\nmaximum piezoelectric and average dielectric tensors to accelerate discovery.",
    "authors": [
      "Kamal Choudhary",
      "Kevin F. Garrity",
      "Vinit Sharma",
      "Adam J. Biacchi",
      "Angela R. Hight Walker",
      "Francesca Tavazza"
    ],
    "publication_date": "2019-10-02T19:40:49Z",
    "arxiv_id": "http://arxiv.org/abs/1910.01183v2",
    "download_url": "http://arxiv.org/abs/1910.01183v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Superconductivity in a Scandium Borocarbide with a Layered Crystal\n  Structure",
    "abstract": "The discovery of nearly room-temperature superconductivity in superhydrides\nhas motivated further materials research for conventional superconductors. To\nrealize the moderately high critical temperature $(T_\\mathrm{c})$ in materials\ncontaining light elements, we explored new superconducting phases in a scandium\nborocarbide system. Here, we report the observation of superconductivity in a\nnew ternary Sc-B-C compound. The crystal structure, which was determined\nthrough a Rietveld analysis, belongs to tetragonal space group $P4/ncc$. By\ncomplementarily using the density functional theory calculations, a chemical\nformula of the compound was found to be expressed as\nSc$_{20}$C$_{8-x}$B$_x$C$_{20}$($x=1\\:\\mathrm{or}\\:2$). Interestingly, a small\namount of B is essential to stabilize the present structure. Our experiments\nrevealed the typical type-II superconductivity at\n$T_\\mathrm{c}=7.7\\:\\mathrm{K}$. Additionally, we calculated the density of\nstates within a first-principles approach and found that the contribution of\nthe Sc-3d orbital was mainly responsible for the superconductivity.",
    "authors": [
      "Hiroki Ninomiya",
      "Kunihiko Oka",
      "Izumi Hase",
      "Kenji Kawashima",
      "Hiroshi Fujihisa",
      "Yoshito Gotoh",
      "Shigeyuki Ishida",
      "Hiraku Ogino",
      "Akira Iyo",
      "Yoshiyuki Yoshida",
      "Hiroshi Eisaki"
    ],
    "publication_date": "2019-10-30T08:28:38Z",
    "arxiv_id": "http://arxiv.org/abs/1910.13711v1",
    "download_url": "http://arxiv.org/abs/1910.13711v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]