[
  {
    "title": "Quantum Control Landscapes",
    "abstract": "Numerous lines of experimental, numerical and analytical evidence indicate\nthat it is surprisingly easy to locate optimal controls steering quantum\ndynamical systems to desired objectives. This has enabled the control of\ncomplex quantum systems despite the expense of solving the Schrodinger equation\nin simulations and the complicating effects of environmental decoherence in the\nlaboratory. Recent work indicates that this simplicity originates in universal\nproperties of the solution sets to quantum control problems that are\nfundamentally different from their classical counterparts. Here, we review\nstudies that aim to systematically characterize these properties, enabling the\nclassification of quantum control mechanisms and the design of globally\nefficient quantum control algorithms.",
    "authors": [
      "Raj Chakrabarti",
      "Herschel Rabitz"
    ],
    "publication_date": "2007-10-03T19:36:38Z",
    "arxiv_id": "http://arxiv.org/abs/0710.0684v1",
    "download_url": "http://arxiv.org/abs/0710.0684v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comment on \"Pinched Flow Fractionation: Continuous Size Separation of\n  Particles Utilizing a Laminar Flow Profile in a Pinched Microchannel\"",
    "abstract": "[First paragraph] In a recent paper Yamada et al. propose the novel concept\nof \"pinched flow fractionation\" (PFF) for the continuous size separation and\nanalysis of particles in microfabricated lab-on-a-chip devices. In their\ndescription of the basic principle they claim that especially the width of the\npinched and broadened segments will affect theseparation performance. In the\nfollowing we comment on the physics behind this statement.",
    "authors": [
      "Niels Asger Mortensen"
    ],
    "publication_date": "2007-10-31T11:48:10Z",
    "arxiv_id": "http://arxiv.org/abs/0710.5840v1",
    "download_url": "http://arxiv.org/abs/0710.5840v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Improved maximum likelihood estimators in a heteroskedastic\n  errors-in-variables model",
    "abstract": "This paper develops a bias correction scheme for a multivariate\nheteroskedastic errors-in-variables model. The applicability of this model is\njustified in areas such as astrophysics, epidemiology and analytical chemistry,\nwhere the variables are subject to measurement errors and the variances vary\nwith the observations. We conduct Monte Carlo simulations to investigate the\nperformance of the corrected estimators. The numerical results show that the\nbias correction scheme yields nearly unbiased estimates. We also give an\napplication to a real data set.",
    "authors": [
      "Alexandre G. Patriota",
      "Artur J. Lemonte",
      "Heleno Bolfarine"
    ],
    "publication_date": "2009-03-18T12:09:55Z",
    "arxiv_id": "http://arxiv.org/abs/0903.3146v2",
    "download_url": "http://arxiv.org/abs/0903.3146v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Smooth relativistic Hartree-Fock pseudopotentials for H to Ba and Lu to\n  Hg",
    "abstract": "We report smooth relativistic Hartree-Fock pseudopotentials (also known as\naveraged relativistic effective potentials or AREPs) and spin-orbit operators\nfor the atoms H to Ba and Lu to Hg. We remove the unphysical extremely\nnon-local behaviour resulting from the exchange interaction in a controlled\nmanner, and represent the resulting pseudopotentials in an analytic form\nsuitable for use within standard quantum chemistry codes. These\npseudopotentials are suitable for use within Hartree-Fock and correlated wave\nfunction methods, including diffusion quantum Monte Carlo calculations.",
    "authors": [
      "J. R. Trail",
      "R. J. Needs"
    ],
    "publication_date": "2009-09-30T04:51:47Z",
    "arxiv_id": "http://arxiv.org/abs/0909.5503v1",
    "download_url": "http://arxiv.org/abs/0909.5503v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A new yield criterion for the concrete materials",
    "abstract": "The proposed yield criterion depends upon two material constants and is\nproven to be smooth and convex under a simple condition. These properties\ninduce a mathematical robustness that allows a further use in a damage\nmechanics model. The analytical gradient and hessian are given. The obtained\nyield surface is relevant to Kupfer's biaxial testings on concrete. The\nidentification procedure, with respect to the classical uniaxial tension and\ncompression testings, is detailed.",
    "authors": [
      "Marc Louis Maurice François"
    ],
    "publication_date": "2010-02-03T21:19:08Z",
    "arxiv_id": "http://arxiv.org/abs/1002.0856v1",
    "download_url": "http://arxiv.org/abs/1002.0856v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stiefel and Grassmann manifolds in Quantum Chemistry",
    "abstract": "We establish geometric properties of Stiefel and Grassmann manifolds which\narise in relation to Slater type variational spaces in many-particle\nHartree-Fock theory and beyond. In particular, we prove that they are analytic\nhomogeneous spaces and submanifolds of the space of bounded operators on the\nsingle-particle Hilbert space. As a by-product we obtain that they are complete\nFinsler manifolds. These geometric properties underpin state-of-the-art results\non existence of solutions to Hartree-Fock type equations.",
    "authors": [
      "Eduardo Chiumiento",
      "Michael Melgaard"
    ],
    "publication_date": "2011-05-09T12:58:23Z",
    "arxiv_id": "http://arxiv.org/abs/1105.1661v1",
    "download_url": "http://arxiv.org/abs/1105.1661v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytic Combinatorics of Planar Lattice Paths",
    "abstract": "Lattice paths effectively model phenomena in chemistry, physics and\nprobability theory. Asymptotic enumeration of lattice paths is linked with\nentropy in the physical systems being modeled. Lattice paths restricted to\ndifferent regions of the plane are well suited to a functional equation\napproach for exact and asymptotic enumeration. This thesis surveys results on\nlattice paths under various restrictions, with an emphasis on lattice paths in\nthe quarter plane. For these paths, we develop an original systematic\ncombinatorial approach providing direct access to the exponential growth\nfactors of the asymptotic expressions.",
    "authors": [
      "Samuel Johnson"
    ],
    "publication_date": "2013-04-23T21:53:44Z",
    "arxiv_id": "http://arxiv.org/abs/1304.6432v1",
    "download_url": "http://arxiv.org/abs/1304.6432v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Parametric Integration by Magic Point Empirical Interpolation",
    "abstract": "We derive analyticity criteria for explicit error bounds and an exponential\nrate of convergence of the magic point empirical interpolation method\nintroduced by Barrault et al. (2004). Furthermore, we investigate its\napplication to parametric integration. We find that the method is well-suited\nto Fourier transforms and has a wide range of applications in such diverse\nfields as probability and statistics, signal and image processing, physics,\nchemistry and mathematical finance.\n  To illustrate the method, we apply it to the evaluation of probability\ndensities by parametric Fourier inversion. Our numerical experiments display\nconvergence of exponential order, even in cases where the theoretical results\ndo not apply.",
    "authors": [
      "Maximilian Gaß",
      "Kathrin Glau"
    ],
    "publication_date": "2015-11-26T21:19:46Z",
    "arxiv_id": "http://arxiv.org/abs/1511.08510v2",
    "download_url": "http://arxiv.org/abs/1511.08510v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inversion of Strong Field Photoelectron Spectra for Molecular Orbital\n  Imaging",
    "abstract": "Imaging structures at the molecular level is a fast developing\ninterdisciplinary research field that spans across the boundaries of physics\nand chemistry. High spatial resolution images of molecules can be obtained with\nphotons or ultrafast electrons. In addition, images of valence molecular\norbitals can be extracted via tomographic techniques based on the coherent XUV\nradiation emitted by a molecular gas exposed to an intense ultra-short infrared\nlaser pulse. In this paper, we demonstrate that similar information can be\nobtained by inverting energy resolved photoelectron spectra using a simplified\nanalytical model.",
    "authors": [
      "R. Puthumpally-Joseph",
      "J. Viau-Trudel",
      "M. Peters",
      "T. T. Nguyen-Dang",
      "O. Atabek",
      "E. Charron"
    ],
    "publication_date": "2016-07-08T08:59:09Z",
    "arxiv_id": "http://arxiv.org/abs/1607.02273v1",
    "download_url": "http://arxiv.org/abs/1607.02273v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonlinear standing waves on planar branched systems: Shrinking into\n  metric graph",
    "abstract": "We treat the stationary nonlinear Schroodinger equation on two-dimensional\nbranched domains, so-called fat graphs. The shrinking limit when the domain\nbecomes one-dimensional metric graph is studied by using analytical estimate of\nthe convergence of fat graph boundary conditions into those for metric graph.\nDetailed analysis of such convergence on the basis of numerical solution of\nstationary nonlinear Schrodinger equation on a fat graph is provided.\nPossibility for reproducing different metric graph boundary conditions studied\nin earlier works is shown. Practical applications of the proposed model for\nsuch problems as Bose-Einstein condensation in networks, branched optical\nmedia, DNA, conducting polymers and wave dynamics in branched capillary\nnetworks are discussed.",
    "authors": [
      "Z. Sobirov",
      "D. Babajanov",
      "D. Matrasulov"
    ],
    "publication_date": "2017-03-28T12:18:10Z",
    "arxiv_id": "http://arxiv.org/abs/1703.09534v1",
    "download_url": "http://arxiv.org/abs/1703.09534v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Heterogeneous continuous time random walks",
    "abstract": "We introduce a heterogeneous continuous time random walk (HCTRW) model as a\nversatile analytical formalism for studying and modeling diffusion processes in\nheterogeneous structures, such as porous or disordered media, multiscale or\ncrowded environments, weighted graphs or networks. We derive the exact form of\nthe propagator and investigate the effects of spatio-temporal heterogeneities\nonto the diffusive dynamics via the spectral properties of the generalized\ntransition matrix. In particular, we show how the distribution of first passage\ntimes changes due to local and global heterogeneities of the medium. The HCTRW\nformalism offers a unified mathematical language to address various\ndiffusion-reaction problems, with numerous applications in material sciences,\nphysics, chemistry, biology, and social sciences.",
    "authors": [
      "Denis S. Grebenkov",
      "Liubov Tupikina"
    ],
    "publication_date": "2017-12-04T11:41:22Z",
    "arxiv_id": "http://arxiv.org/abs/1712.01020v1",
    "download_url": "http://arxiv.org/abs/1712.01020v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Screened Coulombic Orientational Correlations in Dilute Aqueous\n  Electrolytes",
    "abstract": "The ion-induced long-range orientational order between water molecules\nrecently observed in second harmonic scattering experiments and illustrated\nwith large scale molecular dynamics simulations is quantitatively explained\nusing the Ornstein-Zernike integral equation approach of liquid physics. This\ngeneral effect, not specific to hydrogen-bonding solvents, is controlled by\nelectroneutrality condition, dipolar interactions and dielectric+ionic\nscreening. As expected, all numerical theories recover the well-known\nanalytical expressions established 40 years ago.",
    "authors": [
      "Luc Belloni",
      "Daniel Borgis",
      "Maximilien Levesque"
    ],
    "publication_date": "2018-03-28T12:49:43Z",
    "arxiv_id": "http://arxiv.org/abs/1803.10566v1",
    "download_url": "http://arxiv.org/abs/1803.10566v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimal population transfer in combined Feshbach Resonance and STIRAP\n  process",
    "abstract": "We present a method for the creation and control of cold molecules that\ninvolves coherently combining Feshbach Resonances and STIRAP. We present\nanalytical and numerical results showing how to optimize this process that can\nbe implemented using techniques readily available in standard experimental\nsetups. This will provide a link in the chain from atoms to ground state\nmolecules and can serve as a building block towards more complex processes in\ncoherent ultracold chemistry.",
    "authors": [
      "Phillip Price",
      "Susanne Yelin"
    ],
    "publication_date": "2018-10-01T20:55:16Z",
    "arxiv_id": "http://arxiv.org/abs/1810.00976v1",
    "download_url": "http://arxiv.org/abs/1810.00976v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Numerical Representations of Metabolic Systems",
    "abstract": "Metabolomics is becoming a mature part of analytical chemistry as evidenced\nby the growing number of publications and attendees of international\nconferences dedicated to this topic. Yet, a systematic treatment of the\nfundamental structure and properties of metabolomics data is lagging behind. We\nwant to fill this gap by introducing two fundamental theories concerning\nmetabolomics data: data theory and measurement theory. Our approach is to ask\nsimple questions, the answers of which require applying these theories to\nmetabolomics. We show that we can distinguish at least four different levels of\nmetabolomics data with different properties and warn against confusing data\nwith numbers.",
    "authors": [
      "Age K. Smilde",
      "Thomas Hankemeier"
    ],
    "publication_date": "2019-06-14T09:48:32Z",
    "arxiv_id": "http://arxiv.org/abs/1906.07272v1",
    "download_url": "http://arxiv.org/abs/1906.07272v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Most abundant isotope peaks and efficient selection on $Y=X_1+X_2+\\cdots\n  + X_m$",
    "abstract": "The isotope masses and relative abundances for each element are fundamental\nchemical knowledge. Computing the isotope masses of a compound and their\nrelative abundances is an important and difficult analytical chemistry problem.\nWe demonstrate that this problem is equivalent to sorting\n$Y=X_1+X_2+\\cdots+X_m$. We introduce a novel, practically efficient method for\ncomputing the top values in $Y$. then demonstrate the applicability of this\nmethod by computing the most abundant isotope masses (and their abundances)\nfrom compounds of nontrivial size.",
    "authors": [
      "Patrick Kreitzberg",
      "Kyle Lucke",
      "Oliver Serang"
    ],
    "publication_date": "2019-06-29T21:09:40Z",
    "arxiv_id": "http://arxiv.org/abs/1907.00278v1",
    "download_url": "http://arxiv.org/abs/1907.00278v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Solutions of N-dimensional Schrödinger Equation with Morse Potential\n  Via Laplace Transforms",
    "abstract": "A study is undertaken to investigate an analytical solution for the\nN-dimensional Schr\\\"{o}dinger equation with the Morse potential based on the\nLaplace transformation method. The results show that in the Pekeris\napproximation, the radial part of the Schr\\\"{o}dinger equation reduces to the\ncorresponding equation in one dimension. Hence its exact solutions can be\nobtained by the Laplace transformation method of G. Chen, phys. Lett. A 326\n(2004) 55. In addition, a comparison is made between the energy spectrum\nresulted from this method and the spectra that are obtained from the two-point\nquasi-rational approximation method and the Nikiforov-Uvarov approach.",
    "authors": [
      "S. Miraboutalebi",
      "L. Rajaei"
    ],
    "publication_date": "2020-03-21T16:26:19Z",
    "arxiv_id": "http://arxiv.org/abs/2003.09690v1",
    "download_url": "http://arxiv.org/abs/2003.09690v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interlaboratory consensus building challenge",
    "abstract": "The manuscript is about an interlaboratory comparison which involved eleven\nmetrology institutes. It comprises four tasks: i) deriving a consensus value\nfrom these results; ii) evaluating the associated standard uncertainty; iii)\nproducing a coverage interval that, with 95\\% confidence, is believed to\ninclude the true value of which the consensus value is an estimate; iv)\nsuggesting how the measurement result from NIST may be compared with the\nconsensus value.",
    "authors": [
      "Giovanni Mana"
    ],
    "publication_date": "2021-01-23T14:53:12Z",
    "arxiv_id": "http://arxiv.org/abs/2101.09517v1",
    "download_url": "http://arxiv.org/abs/2101.09517v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dynamic Bayesian Nonlinear Calibration",
    "abstract": "Statistical calibration where the curve is nonlinear is important in many\nareas, such as analytical chemistry and radiometry. Especially in radiometry,\ninstrument characteristics change over time, thus calibration is a process that\nmust be conducted as long as the instrument is in use. We propose a dynamic\nBayesian method to perform calibration in the presence of a curvilinear\nrelationship between the reference measurements and the response variable. The\ndynamic calibration approach adequately derives time dependent calibration\ndistributions in the presence of drifting regression parameters. The method is\napplied to microwave radiometer data and simulated spectroscopy data based on\nwork by Lundberg and de Mar\\'{e} (1980).",
    "authors": [
      "Derick L. Rivers",
      "Edward L. Boone"
    ],
    "publication_date": "2014-11-13T17:59:16Z",
    "arxiv_id": "http://arxiv.org/abs/1411.3637v1",
    "download_url": "http://arxiv.org/abs/1411.3637v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "BAGEL: Brilliantly Advanced General Electronic-structure Library",
    "abstract": "On behalf of the development team, I review the capabilities of the BAGEL\nprogram package in this article. BAGEL is a newly-developed full-fledged\nprogram package for electronic-structure computation in quantum chemistry,\nwhich is released under the GNU General Public License with many contributions\nfrom the developers. The unique features include analytical CASPT2 nuclear\nenergy gradients and derivative couplings, relativistic multireference wave\nfunctions based on the Dirac equation, and implementations of novel electronic\nstructure theories. All of the programs are efficiently parallelized using both\nthreads and MPI processes. We also discuss the code generator SMITH3, which has\nbeen used to implement some of the programs in BAGEL. The developers'\ncontributions are listed at the end of the main text.",
    "authors": [
      "Toru Shiozaki"
    ],
    "publication_date": "2017-07-12T15:44:48Z",
    "arxiv_id": "http://arxiv.org/abs/1707.03771v1",
    "download_url": "http://arxiv.org/abs/1707.03771v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deep learning methods for the computation of vibrational wavefunctions",
    "abstract": "In this paper we design and use two Deep Learning models to generate the\nground and excited wavefunctions of different Hamiltonians suitable for the\nstudy the vibrations of molecular systems. The generated neural networks are\ntrained with Hamiltonians that have analytical solutions, and ask the network\nto generalize these solutions to more complex Hamiltonian functions. This\napproach allows to reproduce the excited vibrational wavefunctions of different\nmolecular potentials. All methodologies used here are data-driven, therefore\nthey do not assume any information about the underlying physical model of the\nsystem. This makes this approach versatile, and can be used in the study of\nmultiple systems in quantum chemistry.",
    "authors": [
      "Laia Domingo",
      "Florentino Borondo"
    ],
    "publication_date": "2021-02-27T12:26:40Z",
    "arxiv_id": "http://arxiv.org/abs/2103.00202v2",
    "download_url": "http://arxiv.org/abs/2103.00202v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhancing sensitivity in absorption spectroscopy using a scattering\n  cavity",
    "abstract": "Absorption spectroscopy is widely used to detect samples with spectral\nspecificity. Here, we propose and demonstrate a method for enhancing the\nsensitivity of absorption spectroscopy. Exploiting multiple light scattering\ngenerated by a boron nitride (h-BN) scattering cavity, the optical path lengths\nof light inside a diffusive reflective cavity are significantly increased,\nresulting in more than ten times enhancement of sensitivity in absorption\nspectroscopy. We demonstrate highly sensitive spectral measurements of low\nconcentrations of malachite green and crystal violet aqueous solutions. Because\nthis method only requires the addition of a scattering cavity to existing\nabsorption spectroscopy, it is expected to enable immediate and widespread\napplications in various fields, from analytical chemistry to environmental\nsciences.",
    "authors": [
      "Jeonghun Oh",
      "KyeoReh Lee",
      "YongKeun Park"
    ],
    "publication_date": "2021-03-04T11:49:54Z",
    "arxiv_id": "http://arxiv.org/abs/2103.02975v1",
    "download_url": "http://arxiv.org/abs/2103.02975v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nanoextraction based on surface nanodroplets for chemical\n  preconcentration and determination",
    "abstract": "Liquid-liquid extraction based on surface nanodroplets, namely\nnanoextraction, can continuously extract and enrich target analytes from the\nflow of a sample solution. This sample preconcentration technique is easy to\noperate in a continuous flow system with low organic solvent consumption and a\nhigh enrichment factor. In this review, the evolution from single drop\nmicroextraction to advanced nanoextraction will be briefly introduced. Also,\nthe formation principle and key features of surface nanodroplets will be\nsummarized. Further, the major findings of nanoextraction combined with\nin-droplet chemistry toward sensitive and quantitative detection will be\ndiscussed. Finally, we will give our perspectives on the future trend of\nnanoextraction.",
    "authors": [
      "Hongyan Wu",
      "Chiranjeevi Kanike",
      "Arnab Atta",
      "Xuehua Zhang"
    ],
    "publication_date": "2022-10-05T23:52:02Z",
    "arxiv_id": "http://arxiv.org/abs/2210.02608v1",
    "download_url": "http://arxiv.org/abs/2210.02608v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Improved Parameterization Procedure for NDDO-Descendant Semiempirical\n  Methods",
    "abstract": "MNDO-based semiempirical methods in quantum chemistry have found widespread\napplication in the modelling of large and complex systems. A method for the\nanalytic evaluation of first and second derivatives of molecular properties\nagainst semiempirical parameters in MNDO-based NDDO-descendant models is\npresented, and the resultant parameter Hessian is compared against the\napproximant currently used in parameterization for the PMx models. As a proof\nof concept, the exact parameter Hessian is employed in a limited\nreparameterization of MNDO for the elements C, H, N, O and F using 1206\nmolecules for reference data.",
    "authors": [
      "Adrian Wee Wen Ong",
      "Steve Yueran Cao",
      "Leong Chuan Kwek"
    ],
    "publication_date": "2022-12-09T19:36:40Z",
    "arxiv_id": "http://arxiv.org/abs/2212.11786v1",
    "download_url": "http://arxiv.org/abs/2212.11786v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Fractional Schrodinger Equation with the Generalized Woods-Saxon\n  Potential",
    "abstract": "The bound state energy eigenvalues and the corresponding eigenfunctions of\nthe generalized Woods-Saxon potential reported in [Phys. Rev. C 72, 027001\n(2005)] is extended to the fractional forms using the generalized fractional\nderivative and the fractional Nikiforov-Uvarov (NU) technique. Analytical\nsolutions of bound states of the Schrodinger equation for the present potential\nare obtained in the terms of fractional Jacobi polynomials. It is demonstrated\nthat the classical results are a special case of the present results at\nElfa=Beta=1 Therefore, the present results play important role in molecular\nchemistry and nuclear physics.",
    "authors": [
      "M. Abu-Shady",
      "Etido P. Inyang"
    ],
    "publication_date": "2023-01-20T10:14:54Z",
    "arxiv_id": "http://arxiv.org/abs/2302.03060v1",
    "download_url": "http://arxiv.org/abs/2302.03060v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Microscopic Theory of Vibrational Polariton Chemistry",
    "abstract": "We present a microscopic theory that aims to explain the vibrational strong\ncoupling (VSC) modified reaction rate constant. The analytic theory is based on\na mechanistic conjecture that cavity modes promote the transition from the\nground state to the vibrational excited state of the reactant, which is the\nrate-limiting step of the reaction. The theory explains the observed resonance\neffect at the normal incident angle. Assuming the coherent vibrational energy\ntransfer picture, the theory can also explain the collective effect and makes\nseveral predictions that are experimentally verifiable.",
    "authors": [
      "Wenxiang Ying",
      "Michael A. D. Taylor",
      "Pengfei Huo"
    ],
    "publication_date": "2023-05-08T19:21:29Z",
    "arxiv_id": "http://arxiv.org/abs/2305.05005v2",
    "download_url": "http://arxiv.org/abs/2305.05005v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the use of complex GTOs for the evaluation of radial integrals\n  involving oscillating functions",
    "abstract": "We study two classes of radial integrals involving a product of bound and\ncontinuum one-electron states. Using a representation of the continuum part\nwith an expansion on complex Gaussian Type Orbitals, such integrals can be\nperformed analytically. We investigate the reliability of this scheme for\nlow-energy physical parameters. This study serves as a premise in view of\npotential applications in molecular scattering processes.",
    "authors": [
      "Abdallah Ammar",
      "Arnaud Leclerc",
      "Lorenzo Ugo Ancarani"
    ],
    "publication_date": "2024-05-16T12:15:02Z",
    "arxiv_id": "http://arxiv.org/abs/2405.10032v1",
    "download_url": "http://arxiv.org/abs/2405.10032v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Parameterizing Intersecting Surfaces via Invariants",
    "abstract": "We introduce and analyze numerical companion matrix methods for the\nreconstruction of hypersurfaces with crossings from smooth interpolants given\nunordered or, without loss of generality, value-sorted data. The problem is\nmotivated by the desire to machine learn potential energy surfaces arising in\nmolecular excited state computational chemistry applications. We present\nsimplified models which reproduce the analytically predicted convergence and\nstability behaviors as well as two application-oriented numerical experiments:\nthe electronic excited states of Graphene featuring Dirac conical cusps and\nenergy surfaces corresponding to a sulfur dioxide ($SO_2$) molecule in\ndifferent configurations.",
    "authors": [
      "Timon S. Gutleb",
      "Rhyan Barrett",
      "Julia Westermayr",
      "Christoph Ortner"
    ],
    "publication_date": "2024-07-04T08:25:08Z",
    "arxiv_id": "http://arxiv.org/abs/2407.03731v1",
    "download_url": "http://arxiv.org/abs/2407.03731v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A polarizable CASSCF/MM approach using the interface between OpenMMPol\n  library and CFour",
    "abstract": "We present a polarizable embedding quantum mechanics/molecular mechanics\n(QM/MM) framework for ground- and excited-state Complete Active Space\nSelf-Consistent Field (CASSCF) calculations on molecules within complex\nenvironments, such as biological systems. These environments are modeled using\nthe AMOEBA polarizable force field. This approach is implemented by integrating\nthe OpenMMPol library with the CFour quantum chemistry software suite. The\nimplementation supports both single-point energy evaluations and geometry\noptimizations, facilitated by the availability of analytical gradients. We\ndemonstrate the methodology by applying it to two distinct photoreceptors,\nexploring the impact of the protein environment on the structural and\nphotophysical properties of their embedded chromophores.",
    "authors": [
      "Tommaso Nottoli",
      "Mattia Bondanza",
      "Filippo Lipparini",
      "Benedetta Mennucci"
    ],
    "publication_date": "2024-11-19T13:21:34Z",
    "arxiv_id": "http://arxiv.org/abs/2411.12489v1",
    "download_url": "http://arxiv.org/abs/2411.12489v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Atmospheric Chemistry for Astrophysicists: A Self-consistent Formalism\n  and Analytical Solutions for Arbitrary C/O",
    "abstract": "We present a self-consistent formalism for computing and understanding the\natmospheric chemistry of exoplanets from the viewpoint of an astrophysicist.\nStarting from the first law of thermodynamics, we demonstrate that the van't\nHoff equation (which describes the equilibrium constant), Arrhenius equation\n(which describes the rate coefficients) and procedures associated with the\nGibbs free energy (minimisation, rescaling) have a common physical and\nmathematical origin. We address an ambiguity associated with the equilibrium\nconstant, which is used to relate the forward and reverse rate coefficients,\nand restate its two definitions. By necessity, one of the equilibrium constants\nmust be dimensionless and equate to an exponential function involving the Gibbs\nfree energy, while the other is a ratio of rate coefficients and must therefore\npossess physical units. We demonstrate that the Arrhenius equation takes on a\nfunctional form that is more general than previously stated without recourse to\ntagging on ad hoc functional forms. Finally, we derive analytical models of\nchemical systems, in equilibrium, with carbon, hydrogen and oxygen. We include\nacetylene and are able to reproduce several key trends, versus temperature and\ncarbon-to-oxygen ratio, published in the literature. The rich variety of\nbehavior that mixing ratios exhibit as a function of the carbon-to-oxygen ratio\nis merely the outcome of stoichiometric book-keeping and not the direct\nconsequence of temperature or pressure variations.",
    "authors": [
      "Kevin Heng",
      "James R. Lyons",
      "Shang-Min Tsai"
    ],
    "publication_date": "2015-06-17T21:27:26Z",
    "arxiv_id": "http://arxiv.org/abs/1506.05501v3",
    "download_url": "http://arxiv.org/abs/1506.05501v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Near dissociation states for H$_2^+$-He on MRCI and FCI potential energy\n  surfaces",
    "abstract": "A new analytical potential energy surface (PES) has been constructed for\nH$_2^+$-He using a reproducing kernel Hilbert space (RKHS) representation from\nan extensive number of $ab initio$ energies computed at the multi-reference and\nfull configuration interaction level of theory. For the MRCI PES the long-range\ninteraction region of the PES is described by analytical functions and is\nconnected smoothly to the short-range interaction region, represented as a\nRKHS. All ro-vibrational states for the ground electronic state of H$_2^+$-He\nare calculated using two different methods to determine quantum bound states.\nComparing transition frequencies for the near-dissociation states for $ortho$-\nand $para$-H$_2^+$-He allows assignment of the 15.2 GHz line to a $J=2$ $e/f$\nparity doublet of $ortho$-H$_2^+$-He whereas the experimentally determined 21.8\nGHz line is only consistent with a $(J=0)$ $\\rightarrow$ $(J=1)$ $e/e$\ntransition in $para$-H$_2^+$-He.",
    "authors": [
      "Debasish Koner",
      "Juan Carlos San Vicente Veliz",
      "Ad van der Avoird",
      "Markus Meuwly"
    ],
    "publication_date": "2019-09-24T15:10:06Z",
    "arxiv_id": "http://arxiv.org/abs/1909.10984v1",
    "download_url": "http://arxiv.org/abs/1909.10984v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Open Chemistry: RESTful Web APIs, JSON, NWChem and the Modern Web\n  Application",
    "abstract": "An end-to-end platform for chemical science research has been developed that\nintegrates data from computational and experimental approaches through a modern\nweb-based interface. The platform offers a highly interactive visualization and\nanalytics environment that functions well on mobile, laptop and desktop\ndevices. It offers pragmatic solutions to ensure that large and complex data\nsets are more accessible. Existing desktop applications/frameworks were\nextended to integrate with high-performance computing (HPC) resources, and\noffer command-line tools to automate interaction---connecting distributed teams\nto this software platform on their own terms. The platform was developed\nopenly, and all source code hosted on the GitHub platform with automated\ndeployment possible using Ansible coupled with standard Ubuntu-based machine\nimages deployed to cloud machines.\n  The platform is designed to enable teams to reap the benefits of the\nconnected web---going beyond what conventional search and analytics platforms\noffer in this area. It also has the goal of offering federated instances, that\ncan be customized to the sites/research performed. Data gets stored using JSON,\nextending upon previous approaches using XML, building structures that support\ncomputational chemistry calculations. These structures were developed to make\nit easy to process data across different languages, and send data to a\nJavaScript web client.",
    "authors": [
      "Marcus D. Hanwell",
      "Wibe A. de Jong",
      "Christopher J. Harris"
    ],
    "publication_date": "2017-07-13T21:27:27Z",
    "arxiv_id": "http://arxiv.org/abs/1707.04330v1",
    "download_url": "http://arxiv.org/abs/1707.04330v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Feature Selection and Regularization in Multi-Class Classification: An\n  Empirical Study of One-vs-Rest Logistic Regression with Gradient Descent\n  Optimization and L1 Sparsity Constraints",
    "abstract": "Multi-class wine classification presents fundamental trade-offs between model\naccuracy, feature dimensionality, and interpretability - critical factors for\nproduction deployment in analytical chemistry. This paper presents a\ncomprehensive empirical study of One-vs-Rest logistic regression on the UCI\nWine dataset (178 samples, 3 cultivars, 13 chemical features), comparing\nfrom-scratch gradient descent implementation against scikit-learn's optimized\nsolvers and quantifying L1 regularization effects on feature sparsity. Manual\ngradient descent achieves 92.59 percent mean test accuracy with smooth\nconvergence, validating theoretical foundations, though scikit-learn provides\n24x training speedup and 98.15 percent accuracy. Class-specific analysis\nreveals distinct chemical signatures with heterogeneous patterns where color\nintensity varies dramatically (0.31 to 16.50) across cultivars. L1\nregularization produces 54-69 percent feature reduction with only 4.63 percent\naccuracy decrease, demonstrating favorable interpretability-performance\ntrade-offs. We propose an optimal 5-feature subset achieving 62 percent\ncomplexity reduction with estimated 92-94 percent accuracy, enabling\ncost-effective deployment with 80 dollars savings per sample and 56 percent\ntime reduction. Statistical validation confirms robust generalization with\nsub-2ms prediction latency suitable for real-time quality control. Our findings\nprovide actionable guidelines for practitioners balancing comprehensive\nchemical analysis against targeted feature measurement in resource-constrained\nenvironments.",
    "authors": [
      "Jahidul Arafat",
      "Fariha Tasmin",
      "Sanjaya Poudel"
    ],
    "publication_date": "2025-10-16T08:47:05Z",
    "arxiv_id": "http://arxiv.org/abs/2510.14449v2",
    "download_url": "http://arxiv.org/abs/2510.14449v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "HELIOS-Retrieval: An Open-source, Nested Sampling Atmospheric Retrieval\n  Code, Application to the HR 8799 Exoplanets and Inferred Constraints for\n  Planet Formation",
    "abstract": "We present an open-source retrieval code named HELIOS-Retrieval (hereafter\nHELIOS-R), designed to obtain chemical abundances and temperature-pressure\nprofiles from inverting the measured spectra of exoplanetary atmospheres. In\nthe current implementation, we use an exact solution of the radiative transfer\nequation, in the pure absorption limit, in our forward model, which allows us\nto analytically integrate over all of the outgoing rays (instead of performing\nGaussian quadrature). Two chemistry models are considered: unconstrained\nchemistry (where the mixing ratios are treated as free parameters) and\nequilibrium chemistry (enforced via analytical formulae, where only the\nelemental abundances are free parameters). The nested sampling algorithm allows\nus to formally implement Occam's Razor based on a comparison of the Bayesian\nevidence between models. We perform a retrieval analysis on the measured\nspectra of the HR 8799b, c, d and e directly imaged exoplanets. Chemical\nequilibrium is disfavored by the Bayesian evidence for HR 8799b, c and d. We\nfind supersolar C/O, C/H and O/H values for the outer HR 8799b and c\nexoplanets, while the inner HR 8799d and e exoplanets have substellar C/O,\nsubstellar C/H and superstellar O/H values. If these retrieved properties are\nrepresentative of the bulk compositions of the exoplanets, then they are\ninconsistent with formation via gravitational instability (without late-time\naccretion) and consistent with a core accretion scenario in which late-time\naccretion of ices occurred differently for the inner and outer exoplanets. For\nHR 8799e, we find that spectroscopy in the K band is crucial for constraining\nC/O and C/H. HELIOS-R is publicly available as part of the Exoclimes Simulation\nPlatform (ESP; www.exoclime.org).",
    "authors": [
      "Baptiste Lavie",
      "João M. Mendonça",
      "Christoph Mordasini",
      "Matej Malik",
      "Mickaël Bonnefoy",
      "Brice-Olivier Demory",
      "Maria Oreshenko",
      "Simon L. Grimm",
      "David Ehrenreich",
      "Kevin Heng"
    ],
    "publication_date": "2016-10-11T07:12:33Z",
    "arxiv_id": "http://arxiv.org/abs/1610.03216v4",
    "download_url": "http://arxiv.org/abs/1610.03216v4",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entropic measures of Rydberg-like harmonic states",
    "abstract": "The Shannon entropy, the desequilibrium and their generalizations (R\\'enyi\nand Tsallis entropies) of the three-dimensional single-particle systems in a\nspherically-symmetric potential $V(r)$ can be decomposed into angular and\nradial parts. The radial part depends on the analytical form of the potential,\nbut the angular part does not. In this paper we first calculate the angular\nentropy of any central potential by means of two analytical procedures. Then,\nwe explicitly find the dominant term of the radial entropy for the highly\nenergetic (i.e., Rydberg) stationary states of the oscillator-like systems. The\nangular and radial contributions to these entropic measures are analytically\nexpressed in terms of the quantum numbers which characterize the corresponding\nquantum states and, for the radial part, the oscillator strength. In the latter\ncase we use some recent powerful results of the information theory of the\nLaguerre polynomials and spherical harmonics which control the oscillator-like\nwavefunctions.",
    "authors": [
      "J. S. Dehesa",
      "I. V. Toranzo",
      "D. Puertas-Centeno"
    ],
    "publication_date": "2016-10-06T14:09:21Z",
    "arxiv_id": "http://arxiv.org/abs/1610.01882v1",
    "download_url": "http://arxiv.org/abs/1610.01882v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shape resonances of Be$^-$ and Mg$^-$ investigated with method of\n  analytic continuation",
    "abstract": "The regularized method of analytic continuation is used to study the\nlow-energy negative ion states of beryllium (configuration 2$s^2\\varepsilon p\\;\n^2P$) and magnesium (configuration 3$s^2\\varepsilon p\\; ^2P$) atoms. The method\napplies an additional perturbation potential and it requires only routine\nbound-state multi-electron quantum calculations. Such computations are\naccessible by most of the free or commercial quantum chemistry software\navailable for atoms and molecules. The perturbation potential is implemented as\na spherical Gaussian function with a fixed width. Stability of the analytic\ncontinuation technique with respect to the width and with respect to the input\nrange of electron affinities is studied in detail. The computed resonance\nparameters $E_r$=0.282 eV, $\\Gamma$=0.316 eV for the $2p$ state of Be$^-$ and\n$E_r$=0.188 eV, $\\Gamma$=0.167 for the $3p$ state of Mg$^-$, agree well with\nthe best results obtained by much more elaborated and computationally demanding\npresent-day methods.",
    "authors": [
      "Roman Čurík",
      "Ivana Paidarová",
      "Jiří Horáček"
    ],
    "publication_date": "2018-03-14T09:52:48Z",
    "arxiv_id": "http://arxiv.org/abs/1803.05178v1",
    "download_url": "http://arxiv.org/abs/1803.05178v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analyticity and hp discontinuous Galerkin approximation of nonlinear\n  Schrödinger eigenproblems",
    "abstract": "We study a class of nonlinear eigenvalue problems of Schr\\\"{o}dinger type,\nwhere the potential is singular on a set of points. Such problems are widely\npresent in physics and chemistry, and their analysis is of both theoretical and\npractical interest. In particular, we study the regularity of the\neigenfunctions of the operators considered, and we propose and analyze the\napproximation of the solution via an isotropically refined $hp$ discontinuous\nGalerkin (dG) method.\n  We show that, for weighted analytic potentials and for up-to-quartic\npolynomial nonlinearities, the eigenfunctions belong to analytic-type non\nhomogeneous weighted Sobolev spaces. We also prove quasi optimal a priori\nestimates on the error of the dG finite element method; when using an\nisotropically refined $hp$ space the numerical solution is shown to converge\nwith exponential rate towards the exact eigenfunction. We conclude with a\nseries of numerical tests to validate the theoretical results.",
    "authors": [
      "Yvon Maday",
      "Carlo Marcati"
    ],
    "publication_date": "2019-12-16T16:28:11Z",
    "arxiv_id": "http://arxiv.org/abs/1912.07483v2",
    "download_url": "http://arxiv.org/abs/1912.07483v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Theory of ionic liquids with polarizable ions on a charged electrode",
    "abstract": "We formulate a general mean-field theory of a flat electric double layer in\nionic liquids and electrolyte solutions with ions possessing static\npolarizability and a permanent dipole moment on a charged electrode. We\nestablish a new analytical expression for electric double layer differential\ncapacitance determining it as an absolute value of the ratio of the local ionic\ncharge density to the local electric field on an electrode surface. We\ndemonstrate that this expression generalizes the analytical expressions\npreviously reported by Kornyshev and Maggs and Podgornik. Using the obtained\nanalytical expression, we explore new features of the differential capacitance\nbehavior with an increase in the static polarizability and permanent dipole\nmoment of cations. We relate these features to the behavior of ionic\nconcentrations on the electrode. In particular, we elucidate the role of the\ncompetition between the dielectrophoretic attraction and Coulomb repulsion\nforces acting on polarizable or polar cations in the electric double layer in\nthe behavior of the differential capacitance. The developed theoretical model\nand obtained theoretical findings could be relevant for different\nelectrochemical applications, e.g. batteries, supercapacitors, catalysis,\nelectrodeposition, etc.",
    "authors": [
      "Yu. A. Budkov",
      "S. V. Zavarzin",
      "A. L. Kolesnikov"
    ],
    "publication_date": "2021-08-14T14:00:02Z",
    "arxiv_id": "http://arxiv.org/abs/2108.06539v1",
    "download_url": "http://arxiv.org/abs/2108.06539v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Study of transport process and discharge structure of inductively\n  coupled electronegative plasmas via fluid model and analytic theory\n  collaboration",
    "abstract": "The discharge structure of inductively coupled plasma is studied via fluid\nsimulation and analytic theory collaboration. At low pressure, the discharge is\nstratified by the double layer, which is modelled as dipole moment. The\nparabolic profile is formed in the discharge core when recombination loss is\nnegligible and both the electron and anions are the Boltzmann balanced. At\nincreasing the pressure, the main characteristics, i.e., parabolic, elliptic\nand flat-topped profile, are experienced, predicted by the simulation and\nanalytics. Self-coagulation is accompanied at all considered pressures. It is\nmore a chemistry process and provides new means of constricting plasma. At its\ninfluence, electron density deviates from the Boltzmann equilibrium. For\nsatisfying the neutrality of bulk plasma, the ambi-polar self-coagulation\nmechanism is suggested. At high pressure, the self-coagulation-to-coil scheme\ncauses the mass point behavior in the plasma. Minor cations re-self-coagulate\nat certain conditions and the correlation with the celestial bodies formation\nis hypothesized.",
    "authors": [
      "Shu-Xia Zhao",
      "An-Qi Tang"
    ],
    "publication_date": "2021-11-03T01:17:48Z",
    "arxiv_id": "http://arxiv.org/abs/2111.01964v1",
    "download_url": "http://arxiv.org/abs/2111.01964v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dust size distributions in coagulation/fragmentation equilibrium:\n  Numerical solutions and analytical fits",
    "abstract": "Context. Grains in circumstellar disks are believed to grow by mutual\ncollisions and subsequent sticking due to surface forces. Results of many\nfields of research involving circumstellar disks, such as radiative transfer\ncalculations, disk chemistry, magneto-hydrodynamic simulations largely depend\non the unknown grain size distribution.\n  Aims. As detailed calculations of grain growth and fragmentation are both\nnumerically challenging and computationally expensive, we aim to find simple\nrecipes and analytical solutions for the grain size distribution in\ncircumstellar disks for a scenario in which grain growth is limited by\nfragmentation and radial drift can be neglected.\n  Methods. We generalize previous analytical work on self-similar steady-state\ngrain distributions. Numerical simulations are carried out to identify under\nwhich conditions the grain size distributions can be understood in terms of a\ncombination of power-law distributions. A physically motivated fitting formula\nfor grain size distributions is derived using our analytical predictions and\nnumerical simulations.\n  Results. We find good agreement between analytical results and numerical\nsolutions of the Smoluchowski equation for simple shapes of the kernel\nfunction. The results for more complicated and realistic cases can be fitted\nwith a physically motivated \"black box\" recipe presented in this paper. Our\nresults show that the shape of the dust distribution is mostly dominated by the\ngas surface density (not the dust-to-gas ratio), the turbulence strength and\nthe temperature and does not obey an MRN type distribution.",
    "authors": [
      "T. Birnstiel",
      "C. W. Ormel",
      "C. P. Dullemond"
    ],
    "publication_date": "2010-09-15T20:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/1009.3011v1",
    "download_url": "http://arxiv.org/abs/1009.3011v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A novel analytic method for solving linear and nonlinear Telegraph\n  Equation",
    "abstract": "The modeling of many phenomena in various fields such as mathematics,\nphysics, chemistry, engineering, biology, and astronomy is done by the\nnonlinear partial differential equations (PDE). The hyperbolic telegraph\nequation is one of them, where it describes the vibrations of structures (e.g.,\nbuildings, beams, and machines) and are the basis for fundamental equations of\natomic physics. There are several analytical and numerical methods are used to\nsolve the telegraph equation. An analytical solution considers framing the\nproblem in a well-understood form and calculating the exact resolution. It also\nhelps to understand the answers to the problem in terms of accuracy and\nconvergence. These analytic methods have limitations with accuracy and\nconvergence. Therefore, a novel analytic approximate method is proposed to deal\nwith constraints in this paper. This method uses the Taylors' series in its\nderivation. The proposed method has used for solving the second-order,\nhyperbolic equation (Telegraph equation) with the initial condition. Three\nexamples have presented to check the effectiveness, accuracy, and convergence\nof the method. The solutions of the proposed method also compared with those\nobtained by the Adomian decomposition method (ADM), and the Homotopy analysis\nmethod (HAM). The technique is easy to implement and produces accurate results.\nIn particular, these results display that the proposed method is efficient and\nbetter than the other methods in terms of accuracy and convergence.",
    "authors": [
      "Ahmed K. Al-Jaberi",
      "Ehsan M. Hameed",
      "Mohammed S. Abdul-Wahab"
    ],
    "publication_date": "2020-10-06T11:32:28Z",
    "arxiv_id": "http://arxiv.org/abs/2010.02633v1",
    "download_url": "http://arxiv.org/abs/2010.02633v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Overview of Numerical and Analytical Methods for solving Ordinary\n  Differential Equations",
    "abstract": "Differential Equations are among the most important Mathematical tools used\nin creating models in the science, engineering, economics, mathematics,\nphysics, aeronautics, astronomy, dynamics, biology, chemistry, medicine,\nenvironmental sciences, social sciences, banking and many other areas [7]. A\ndifferential equation that has only one independent variable is called an\nOrdinary Differential Equation (ODE), and all derivatives in it are taken with\nrespect to that variable. Most often, the variable is time, t; although, I will\nuse x in this paper as the independent variable. The differential equation\nwhere the unknown function depends on two or more variables is referred to as\nPartial Differential Equations (PDE). Ordinary differential equations can be\nsolved by a variety of methods, analytical and numerical. Although there are\nmany analytic methods for finding the solution of differential equations, there\nexist quite a number of differential equations that cannot be solved\nanalytically [8]. This means that the solution cannot be expressed as the sum\nof a finite number of elementary functions (polynomials, exponentials,\ntrigonometric, and hyperbolic functions). For simple differential equations, it\nis possible to find closed form solutions [9]. But many differential equations\narising in applications are so complicated that it is sometimes impractical to\nhave solution formulas; or at least if a solution formula is available, it may\ninvolve integrals that can be calculated only by using a numerical quadrature\nformula. In either case, numerical methods provide a powerful alternative tool\nfor solving the differential equations under the prescribed initial condition\nor conditions [9]. In this paper, I present the basic and commonly used\nnumerical and analytical methods of solving ordinary differential equations.",
    "authors": [
      "Byakatonda Denis"
    ],
    "publication_date": "2020-12-10T14:06:45Z",
    "arxiv_id": "http://arxiv.org/abs/2012.07558v1",
    "download_url": "http://arxiv.org/abs/2012.07558v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytic regularity of strong solutions for the complexified stochastic\n  non-linear Poisson Boltzmann Equation",
    "abstract": "Semi-linear elliptic Partial Differential Equations (PDEs) such as the\nnon-linear Poisson Boltzmann Equation (nPBE) is highly relevant for non-linear\nelectrostatics in computational biology and chemistry. It is of particular\nimportance for modeling potential fields from molecules in solvents or plasmas\nwith stochastic fluctuations. The extensive applications include ones in\ncondensed matter and solid state physics, chemical physics, electrochemistry,\nbiochemistry, thermodynamics, statistical mechanics, and materials science,\namong others. In this paper we study the complex analytic properties of\nsemi-linear elliptic Partial Differential Equations with respect to random\nfluctuations on the domain. We first prove the existence and uniqueness of the\nnPBE on a bounded domain in $\\mathbb{R}^3$. This proof relies on the\napplication of a contraction mapping reasoning, as the standard convex\noptimization argument for the deterministic nPBE no longer applies. Using the\nexistence and uniqueness result we subsequently show that solution to the nPBE\nadmits an analytic extension onto a well defined region in the complex\nhyperplane with respect to the number of stochastic variables. Due to the\nanalytic extension, stochastic collocation theory for sparse grids predict\nalgebraic to sub-exponential convergence rates with respect to the number of\nknots. A series of numerical experiments with sparse grids is consistent with\nthis prediction and the analyticity result. Finally, this approach readily\nextends to a wide class of semi-linear elliptic PDEs.",
    "authors": [
      "Brian Choi",
      "Jie Xu",
      "Trevor Norton",
      "Mark Kon",
      "Julio Enrique Castrillon-Candas"
    ],
    "publication_date": "2023-09-27T23:23:06Z",
    "arxiv_id": "http://arxiv.org/abs/2309.16068v1",
    "download_url": "http://arxiv.org/abs/2309.16068v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Analytic Theory of Quantum Imaginary Time Evolution",
    "abstract": "Quantum imaginary time evolution (QITE) algorithm is one of the most\npromising variational quantum algorithms (VQAs), bridging the current era of\nNoisy Intermediate-Scale Quantum devices and the future of fully fault-tolerant\nquantum computing. Although practical demonstrations of QITE and its potential\nadvantages over the general VQA trained with vanilla gradient descent (GD) in\ncertain tasks have been reported, a first-principle, theoretical understanding\nof QITE remains limited. Here, we aim to develop an analytic theory for the\ndynamics of QITE. First, we show that QITE can be interpreted as a form of a\ngeneral VQA trained with Quantum Natural Gradient Descent (QNGD), where the\ninverse quantum Fisher information matrix serves as the learning-rate tensor.\nThis equivalence is established not only at the level of gradient update rules,\nbut also through the action principle: the variational principle can be\ndirectly connected to the geometric geodesic distance in the quantum Fisher\ninformation metric, up to an integration constant. Second, for wide quantum\nneural networks, we employ the quantum neural tangent kernel framework to\nconstruct an analytic model for QITE. We prove that QITE always converges\nfaster than GD-based VQA, though this advantage is suppressed by the\nexponential growth of Hilbert space dimension. This helps explain certain\nexperimental results in quantum computational chemistry. Our theory encompasses\nlinear, quadratic, and more general loss functions. We validate the analytic\nresults through numerical simulations. Our findings establish a theoretical\nfoundation for QITE dynamics and provide analytic insights for the\nfirst-principle design of variational quantum algorithms.",
    "authors": [
      "Min Chen",
      "Bingzhi Zhang",
      "Quntao Zhuang",
      "Junyu Liu"
    ],
    "publication_date": "2025-10-26T01:43:55Z",
    "arxiv_id": "http://arxiv.org/abs/2510.22481v1",
    "download_url": "http://arxiv.org/abs/2510.22481v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Water, O2 and Ice in Molecular Clouds",
    "abstract": "We model the temperature and chemical structure of molecular clouds as a\nfunction of depth into the cloud, assuming a cloud of constant density n\nilluminated by an external FUV (6 eV < E < 13.6 eV) flux G_0 (scaling factor in\nmultiples of the local interstellar field). Extending previous\nphotodissociation region models, we include the freezing of species, simple\ngrain surface chemistry, and desorption (including FUV photodesorption) of\nices. We also treat the opaque cloud interior with time-dependent chemistry.\nHere, under certain conditions, gas phase elemental oxygen freezes out as water\nice and the elemental C/O abundance ratio can exceed unity, leading to complex\ncarbon chemistry. Gas phase H2O and O2 peak in abundance at intermediate depth\ninto the cloud, roughly A_V~3-8 from the surface, the depth proportional to\nln(G_0/n). Closer to the surface, molecules are photodissociated. Deeper into\nthe cloud, molecules freeze to grain surfaces. At intermediate depths\nphotodissociation rates are attenuated by dust extinction, but photodesorption\nprevents total freezeout. For G_0 < 500, abundances of H2O and O2 peak at\nvalues ~10^(-7), producing columns ~10^(15) per cm^2, independent of G_0 and n.\nThe peak abundances depend primarily on the product of the photodesorption\nyield of water ice and the grain surface area per H nucleus. At higher values\nof G_0, thermal desorption of O atoms from grains enhances the gas phase H2O\npeak abundance and column slightly, whereas the gas phase O2 peak abundance\nrises to ~10^(-5) and the column to ~2x10^(16) per cm^2. We present simple\nanalytic equations for the abundances as a function of depth which clarify the\ndependence on parameters. The models are applied to observations of H2O, O2,\nand water ice in a number of sources, including B68, NGC 2024, and Rho Oph.",
    "authors": [
      "David Hollenbach",
      "Michael J. Kaufman",
      "Edwin A. Bergin",
      "Gary J. Melnick"
    ],
    "publication_date": "2008-09-09T19:45:22Z",
    "arxiv_id": "http://arxiv.org/abs/0809.1642v2",
    "download_url": "http://arxiv.org/abs/0809.1642v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The chemical history of molecules in circumstellar disks. I. Ices",
    "abstract": "(Abridged) Aims & Methods. A two-dimensional, semi-analytical model is\npresented that follows, for the first time, the chemical evolution from a\ncollapsing molecular cloud (a pre-stellar core) to a protostar and\ncircumstellar disk. The model computes infall trajectories from any point in\nthe cloud and tracks the radial and vertical motion of material in the\nviscously evolving disk. It includes a full time-dependent radiative transfer\ntreatment of the dust temperature, which controls much of the chemistry. A\nsmall parameter grid is explored to understand the effects of the sound speed\nand the mass and rotation of the cloud. The freeze-out and evaporation of\ncarbon monoxide (CO) and water (H2O), as well as the potential for forming\ncomplex organic molecules in ices, are considered as important first steps to\nillustrate the full chemistry.\n  Results. Both species freeze out towards the centre before the collapse\nbegins. Pure CO ice evaporates during the infall phase and re-adsorbs in those\nparts of the disk that cool below the CO desorption temperature of ~18 K. H2O\nremains solid almost everywhere during the infall and disk formation phases and\nevaporates within ~10 AU of the star. Mixed CO-H2O ices are important in\nkeeping some solid CO above 18 K and in explaining the presence of CO in\ncomets. Material that ends up in the planet- and comet-forming zones of the\ndisk is predicted to spend enough time in a warm zone during the collapse to\nform first-generation complex organic species on the grains. The dynamical\ntimescales in the hot inner envelope (hot core or hot corino) are too short for\nabundant formation of second-generation molecules by high-temperature gas-phase\nchemistry.",
    "authors": [
      "R. Visser",
      "E. F. van Dishoeck",
      "S. D. Doty",
      "C. P. Dullemond"
    ],
    "publication_date": "2009-01-09T20:46:16Z",
    "arxiv_id": "http://arxiv.org/abs/0901.1313v1",
    "download_url": "http://arxiv.org/abs/0901.1313v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The chemical history of molecules in circumstellar disks. II. Gas-phase\n  species",
    "abstract": "Context: The chemical composition of a molecular cloud changes dramatically\nas it collapses to form a low-mass protostar and circumstellar disk.\nTwo-dimensional (2D) chemodynamical models are required to properly study this\nprocess.\n  Aims: The goal of this work is to follow, for the first time, the chemical\nevolution in two dimensions all the way from a pre-stellar core into a\ncircumstellar disk. Of special interest is the question whether the chemical\ncomposition of the disk is a result of chemical processing during the collapse\nphase, or whether it is determined by in situ processing after the disk has\nformed.\n  Methods: Our model combines a semi-analytical method to get 2D axisymmetric\ndensity and velocity structures with detailed radiative transfer calculations\nto get temperature profiles and UV fluxes. Material is followed in from the\ncore to the disk and a full gas-phase chemistry network -- including freeze-out\nonto and evaporation from cold dust grains -- is evolved along these\ntrajectories. The abundances thus obtained are compared to the results from a\nstatic disk model and to observations of comets.\n  Results: The chemistry during the collapse phase is dominated by a few key\nprocesses, such as the evaporation of CO or the photodissociation of H2O. At\nthe end of the collapse phase, the disk can be divided into zones with\ndifferent chemical histories. The disk is not in chemical equilibrium at the\nend of the collapse, so care must be taken when choosing the initial abundances\nfor stand-alone disk chemistry models. Our model results imply that comets must\nbe formed from material with different chemical histories: some of it is\nstrongly processed, some of it remains pristine. Variations between individual\ncomets are possible if they formed at different positions or different times in\nthe solar nebula.",
    "authors": [
      "R. Visser",
      "S. D. Doty",
      "E. F. van Dishoeck"
    ],
    "publication_date": "2011-09-08T15:12:41Z",
    "arxiv_id": "http://arxiv.org/abs/1109.1741v1",
    "download_url": "http://arxiv.org/abs/1109.1741v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhanced H2O formation through dust grain chemistry in X-ray exposed\n  environments",
    "abstract": "The ULIRG Mrk 231 exhibits very strong water rotational lines between \\lambda\n= 200-670\\mu m, comparable to the strength of the CO rotational lines. High\nredshift quasars also show similar CO and H2O line properties, while starburst\ngalaxies, such as M82, lack these very strong H2O lines in the same wavelength\nrange, but do show strong CO lines. We explore the possibility of enhancing the\ngas phase H2O abundance in X-ray exposed environments, using bare interstellar\ncarbonaceous dust grains as a catalyst. Cloud-cloud collisions cause C and J\nshocks, and strip the grains of their ice layers. The internal UV field created\nby X-rays from the accreting black hole does not allow to reform the ice. We\ndetermine formation rates of both OH and H2O on dust grains, having temperature\nT_dust=10-60 K, using both Monte Carlo as well as rate equation method\nsimulations. The acquired formation rates are added to our X-ray chemistry\ncode, that allows us to calculate the thermal and chemical structure of the\ninterstellar medium near an active galactic nucleus. We derive analytic\nexpressions for the formation of OH and H2O on bare dust grains as a catalyst.\nOxygen atoms arriving on the dust are released into the gas phase under the\nform of OH and H2O. The efficiencies of this conversion due to the chemistry\noccurring on dust are of order 30 percent for oxygen converted into OH and 60\npercent for oxygen converted into H_2O between T_dust=15-40 K. At higher\ntemperatures, the efficiencies rapidly decline. When the gas is mostly atomic,\nmolecule formation on dust is dominant over the gas-phase route, which is then\nquenched by the low H2 abundance. Here, it is possible to enhance the warm (T>\n200 K) water abundance by an order of magnitude in X-ray exposed environments.\nThis helps to explain the observed bright water lines in nearby and\nhigh-redshift ULIRGs and Quasars.",
    "authors": [
      "R. Meijerink",
      "S. Cazaux",
      "M. Spaans"
    ],
    "publication_date": "2011-11-09T13:16:28Z",
    "arxiv_id": "http://arxiv.org/abs/1111.2198v1",
    "download_url": "http://arxiv.org/abs/1111.2198v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "RASER MRI: Magnetic Resonance Images formed Spontaneously exploiting\n  Cooperative Nonlinear Interaction",
    "abstract": "The spatial resolution of magnetic resonance imaging (MRI) is fundamentally\nlimited by the width of Lorentzian point spread functions (PSF) associated with\nthe exponential decay rate of transverse magnetization (1/T2*). Here we show a\ndifferent contrast mechanism in MRI by establishing RASER (Radio-frequency\nAmplification by Stimulated Emission of Radiation) in imaged media. RASER\nimaging bursts emerge out of noise and without applying (Radio Frequency) RF\npulses when placing spins with sufficient population inversion in a weak\nmagnetic field gradient. A small difference in initial population inversion\ndensity creates a stronger image contrast than conventional MRI. This contrast\nis based on the cooperative nonlinear interaction between all slices. On the\nother hand, the cooperative nonlinear interaction gives rise to imaging\nartifacts, such as amplitude distortions and side lobes outside of the imaging\ndomain. Both the contrast and the artifacts are demonstrated experimentally and\npredicted by simulations based on a proposed theory. This theory of RASER MRI\nis strongly connected to many other distinct fields related to synergetics and\nnon-linear dynamics.",
    "authors": [
      "Sören Lehmkuhl",
      "Simon Fleischer",
      "Lars Lohmann",
      "Matthew S. Rosen",
      "Eduard Y. Chekmenev",
      "Alina Adams",
      "Thomas Theis",
      "Stephan Appelt"
    ],
    "publication_date": "2022-03-01T17:19:29Z",
    "arxiv_id": "http://arxiv.org/abs/2203.00632v1",
    "download_url": "http://arxiv.org/abs/2203.00632v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Influence of Octahedral Site Chemistry on the Elastic Properties of\n  Biotite",
    "abstract": "Brillouin light scattering spectroscopy was used along with detailed\ncomposition information obtained from electron probe microanalysis to study the\ninfluence of octahedral site chemistry on the elastic properties of biotite\ncrystals. Elastic wave velocities for a range of directions in the AC and BC\ncrystallographic planes were obtained for each crystal by application of the\nBrillouin equation with refractive indices and phonon frequencies obtained from\nthe Becke line test and spectral peak positions, respectively. In general,\nvelocities increase with decreasing Fe content, approach those of muscovite at\nlow Fe concentrations. 12 of the 13 elastic constants for the full monoclinic\nsymmetry were obtained for each crystal by fitting analytic expressions for the\nvelocities as functions of propagation direction and elastic constants to\ncorresponding experimental data, with the remaining constant estimated using\nhexagonal symmetry. Elastic constants C11, C22, and C66 are comparable to those\nof muscovite and show little change with Fe concentration due to strong bonding\nwithin layers. In contrast, nearly all remaining constants show a pronounced\ndependence on Fe content, likely due to the weak interlayer bonding. Similar\nbehaviour is shown by elastic stability, which falls greatly as Fe\nconcentration increases, and elastic anisotropy within the basal cleavage\nplane, which decreases with Fe content. This consistent dependency of all\nmeasured elastic constants on Fe content suggests that biotite elasticity is a\nfunction of octahedral site chemistry and gives a method to determine the\nelastic constants and elastic stability of most biotite compositions provided,\nFe or Mg concentrations are known. Moreover, the good agreement between elastic\nconstants of Fe-poor biotite and those of phlogopite obtained from DFT\nsimulations indicate a method to predict elastic properties of biotites.",
    "authors": [
      "Dillon F. Hanlon",
      "G. Todd Andrews",
      "Roger A. Mason"
    ],
    "publication_date": "2022-10-19T22:36:12Z",
    "arxiv_id": "http://arxiv.org/abs/2210.10915v1",
    "download_url": "http://arxiv.org/abs/2210.10915v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Planet formation in the PDS 70 system: Constraining the atmospheric\n  chemistry of PDS 70b and c",
    "abstract": "Understanding the chemical link between protoplanetary disks and planetary\natmospheres is complicated by the fact that the popular targets in the study of\ndisks and planets are widely separated both in space and time. The 5 Myr PDS 70\nsystems offers a unique opportunity to directly compare the chemistry of a\ngiant planet's atmosphere to the chemistry of its natal disk. To that end, we\nderive our current best physical and chemical model for the PDS 70 disk through\nforward modelling of the $^{12}$CO, C$^{18}$O, and C$_2$H emission radial\nprofiles with the thermochemical code DALI and find a volatile C/O ratio above\nunity in the outer disk. Using what we know of the PDS 70 disk today, we\nanalytically estimate the properties of the disk as it was 4 Myr in the past\nwhen we assume that the giant planets started their formation, and compute a\nchemical model of the disk at that time. We compute the formation of PDS 70b\nand PDS 70c using the standard core accretion paradigm and account for the\naccretion of volatile and refractory sources of carbon and oxygen to estimate\nthe resulting atmospheric carbon-to-oxygen number ratio (C/O) for these\nplanets. Our inferred C/O ratio of the gas in the PDS 70 disk indicates that it\nis marginally carbon rich relative to the stellar C/O = 0.44 which we derive\nfrom an empirical relation between stellar metallicity and C/O. Under the\nassumption that the disk has been carbon rich for most of its lifetime, we find\nthat the planets acquire a super-stellar C/O in their atmospheres. If the\ncarbon-rich disk is a relatively recent phenomenon (i.e. developed after the\nformation of the planets at $\\sim 1$ Myr) then the planets should have close to\nthe stellar C/O in their atmospheres. This work lays the groundwork to better\nunderstand the disk in the PDS 70 system as well as the planet formation\nscenario that produce its planets.",
    "authors": [
      "A. J. Cridland",
      "S. Facchini",
      "E. F. van Dishoeck",
      "M. Benisty"
    ],
    "publication_date": "2023-03-31T08:57:46Z",
    "arxiv_id": "http://arxiv.org/abs/2303.17899v1",
    "download_url": "http://arxiv.org/abs/2303.17899v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]