[
  {
    "title": "A Gas-Phase Kinetic Study of the N(2D) + CH3CCH and N(2D) + CH3CN Reactions",
    "abstract": "The chemistry of planetary atmospheres containing molecular nitrogen as a major atmospheric component is strongly influenced by the reactions of atomic nitrogen. Although nitrogen atoms in their ground electronic state N(4S) are mostly unreactive towards stable molecules, electronically excited nitrogen atoms N(2D) are much more reactive and could play an important role in the formation of nitriles and other nitrogen bearing organic molecules in planetary atmospheres such as Titan. Despite this, few kinetic studies of N(2D) reactions have been performed over the appropriate low temperature range. Here, we report the results of an experimental study of the reactions N(2D) + methylacetylene, CH3CCH, and N(2D) + acetonitrile, CH3CN, using a supersonic flow reactor at selected temperatures between 50 K and 296 K. N(2D) atoms, which were generated indirectly as a product of the C(3P) + NO reaction, were subsequently detected by laser induced fluorescence in the vacuum ultraviolet wavelength region. The measured rate constants are significantly larger than the estimated values in current photochemical models and do not display large variations as a function of temperature. The new rate constants are included in a 1D coupled ion-neutral model of Titans atmosphere to test their influence on the simulated species abundances. In addition, the overall description of both reactions is improved by considering the results of recent experimental and theoretical work examining the product channels of these processes. These simulations indicate that while the N(2D) + CH3CCH reaction has only a limited overall influence on Titans atmospheric chemistry, the N(2D) + CH3CN reaction could lead to the formation of significant relative abundances of cyanomethamine, HNCHCN, in the upper atmosphere.",
    "authors": [
      "Kevin M. Hickson",
      "Jean-Christophe Loison",
      "Benjamin Benne",
      "Michel Dobrijevic"
    ],
    "publication_date": "2025-11-10T10:46:37Z",
    "arxiv_id": "http://arxiv.org/abs/2511.06941v1",
    "download_url": "https://arxiv.org/abs/2511.06941v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "AI for Manufacturing and Healthcare: a chemistry and engineering perspective",
    "abstract": "Artificial Intelligence (AI) approaches are increasingly being applied to more and more domains of Science, Engineering, Chemistry, and Industries to not only improve efficiencies and enhance productivity, but also enable new capabilities. The new opportunities range from automated molecule design and screening, properties prediction, gaining insights of chemical reactions, to computer-aided design, predictive maintenance of systems, robotics, and autonomous vehicles. This review focuses on the new applications of AI in manufacturing and healthcare. For the Manufacturing Industries, we focus on AI and algorithms for (1) Battery, (2) Flow Chemistry, (3) Additive Manufacturing, (4) Sensors, and (5) Machine Vision. For Healthcare applications, we focus on: (1) Medical Vision (2) Diagnosis, (3) Protein Design, and (4) Drug Discovery. In the end, related topics are discussed, including physics integrated machine learning, model explainability, security, and governance during model deployment.",
    "authors": [
      "Jihua Chen",
      "Yue Yuan",
      "Amir Koushyar Ziabari",
      "Xuan Xu",
      "Honghai Zhang",
      "Panagiotis Christakopoulos",
      "Peter V. Bonnesen",
      "Ilia N. Ivanov",
      "Panchapakesan Ganesh",
      "Chen Wang",
      "Karen Patino Jaimes",
      "Guang Yang",
      "Rajeev Kumar",
      "Bobby G. Sumpter",
      "Rigoberto Advincula"
    ],
    "publication_date": "2024-05-02T17:50:05Z",
    "arxiv_id": "http://arxiv.org/abs/2405.01520v1",
    "download_url": "https://arxiv.org/abs/2405.01520v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The chemistry of compact planetary nebulae",
    "abstract": "We report high-sensitivity millimetre observations of several molecular species (13CO, HCN, HNC, CN, HCO+ and N2H+) in a sample of compact planetary nebulae. Some species such as HCO+ and CN are particularly abundant compared to envelopes around AGB stars or even interstellar clouds. We have estimated the following average values for the column densities ratios: CN/HCN~2.6, HCO+/HCN~0.5, and HNC/HCN~0.4. Thus, the chemical composition of the molecular envelopes in these compact PNe appears somewhat intermediate between the composition of proto-PNe (such as CRL 2688 or CRL 618) and well evolved PNe (such as the Ring, M4--9, or the Helix). From observations of the CO isotopomers, we have estimated that the 12C/13C ratio is in the range 10 ~< 12C/13C ~< 40. These values are below those expected from standard asymptotic giant branch models and suggest non-standard mixing processes. The observed molecular abundances are compared to very recent modelling work, and we conclude that the observations are well explained, in general terms, by time-dependent gas-phase chemical models in which the ionization rate is enhanced by several orders of magnitude with respect to the average interstellar value. Thus, our observations confirm that the chemistry in the neutral shells of PNe is essentially governed by the high energy radiation from the hot central stars. The complexity of the chemical processes is increased by numerous factors linked to the properties of the central star and the geometry and degree of clumpiness of the envelope. Several aspects of the PN chemistry that remains to be understood are discussed within the frame of the available chemical models.",
    "authors": [
      "E. Josselin",
      "R. Bachiller"
    ],
    "publication_date": "2002-10-31T15:20:58Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0210686v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0210686v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Electronics in Biosensing: A Promising Frontier for Medical and Environmental Applications",
    "abstract": "The promising field of organic electronics has ushered in a new era of biosensing technology, offering a promising frontier for applications in both medical diagnostics and environmental monitoring. This review paper provides a comprehensive overview of the remarkable progress and potential of organic electronics in biosensing applications. It explores the multifaceted aspects of organic materials and devices, highlighting their unique advantages, such as flexibility, biocompatibility, and low-cost fabrication. The paper delves into the diverse range of biosensors enabled by organic electronics, including electrochemical, optical, piezoelectric, and thermo sensors, showcasing their versatility in detecting biomolecules, pathogens, and environmental pollutants. Furthermore, integrating organic biosensors into wearable devices and the Internet of Things (IoT) ecosystem is discussed, offering real-time, remote, and personalized monitoring solutions. The review also addresses the current challenges and prospects of organic biosensing, emphasizing the potential for breakthroughs in personalized medicine, environmental sustainability, and the advancement of human health and well-being.",
    "authors": [
      "Jyoti Bala Kaushal",
      "Pratima Raut",
      "Sanjay Kumar"
    ],
    "publication_date": "2023-09-27T20:31:08Z",
    "arxiv_id": "http://arxiv.org/abs/2309.15999v2",
    "download_url": "https://arxiv.org/abs/2309.15999v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sulphur chemistry in the envelopes of massive young stars",
    "abstract": "The sulphur chemistry in nine regions in the earliest stages of high-mass star formation is studied through single-dish submillimeter spectroscopy. The line profiles indicate that 10-50% of the SO and SO2 emission arises in high-velocity gas, either infalling or outflowing. For the low-velocity gas, excitation temperatures are 25 K for H2S, 50 K for SO, H2CS, NS and HCS+, and 100 K for OCS and SO2, indicating that most observed emission traces the outer parts (T<100 K) of the molecular envelopes, except high-excitation OCS and SO2 lines. Abundances in the outer envelopes, calculated with a Monte Carlo program, using the physical structures of the sources derived from previous submillimeter continuum and CS line data, are ~10^-8 for OCS, ~10^-9 for H2S, H2CS, SO and SO2, and ~10^-10 for HCS+ and NS. In the inner envelopes (T>100 K) of six sources, the SO2 abundance is enhanced by factors of ~100-1000. This region of hot, abundant SO2 has been seen before in infrared absorption, and must be small, <~ 0.2 arcsec (180 AU radius). The derived abundance profiles are consistent with models of envelope chemistry which invoke ice evaporation at T~100$ K. Shock chemistry is unlikely to contribute. A major sulphur carrier in the ices is probably OCS, not H2S as most models assume. The source-to-source abundance variations of most molecules by factors of ~10 do not correlate with previous systematic tracers of envelope heating. Without observations of H2S and SO lines probing warm (>~ 100 K) gas, sulphur-bearing molecules cannot be used as evolutionary tracers during star formation.",
    "authors": [
      "F. F. S. van der Tak",
      "A. M. S. Boonman",
      "R. Braakman",
      "E. F. van Dishoeck"
    ],
    "publication_date": "2003-09-04T13:14:46Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0309138v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0309138v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ferrocene as an iconic redox marker: from solution chemistry to molecular electronic devices",
    "abstract": "Ferrocene, since its discovery in 1951, has been extensively exploited as a redox probe in a variety of processes ranging from solution chemistry, medicinal chemistry, supramolecular chemistry, surface chemistry to solid-state molecular electronic and spintronic circuit elements to unravel electrochemical charge-transfer dynamics. Ferrocene represents an extremely chemically and thermally stable, and highly reproducible redox probe that undergoes reversible one-electron oxidation and reduction occurring at the interfaces of electrode/ferrocene solution in response to applied anodic and cathodic potentials, respectively. It has been almost 70 years after its discovery and has become one of the most widely studied and model organometallic compounds not only for probing electrochemical charge-transfer process but also as molecular building blocks for the synthesis of chiral organometallic catalysts, potential drug candidates, polymeric compounds, electrochemical sensors, to name a few. Ferrocene and its derivatives have been a breakthrough in many aspects due to its versatile reactivity, fascinating chemical structures, unconventional metal-ligand coordination, and the magic number of electrons (18 e-). The present review discusses the recent progress made towards ferrocene-containing molecular systems exploited for redox reactions, surface attachment, spin-dependent electrochemical process to probe spin polarization, photo-electrochemistry, and integration into prototype molecular electronic devices. Overall, the present reviews demonstrate a piece of collective information about the recent advancements made towards the ferrocene and its derivatives that have been utilized as iconic redox markers.",
    "authors": [
      "Gargee Roy",
      "Ritu Gupta",
      "Satya Ranjan Sahoo",
      "Sumit Saha",
      "Deepak Asthana",
      "Prakash Chandra Mondal"
    ],
    "publication_date": "2022-05-22T14:05:27Z",
    "arxiv_id": "http://arxiv.org/abs/2205.10829v1",
    "download_url": "https://arxiv.org/abs/2205.10829v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Oxygen Chemistry in the Circumstellar Envelope of the Carbon-Rich Star IRC+10216",
    "abstract": "In this paper we study the oxygen chemistry in the C-rich circumstellar shells of IRC+10216. The recent discoveries of oxygen bearing species (water, hydroxyl radical and formaldehyde) toward this source challenge our current understanding of the chemistry in C-rich circumstellar envelopes. The presence of icy comets surrounding the star or catalysis on iron grain surfaces have been invoked to explain the presence of such unexpected species. This detailed study aims at evaluating the chances of producing O-bearing species in the C-rich circumstellar envelope only by gas phase chemical reactions. For the inner hot envelope, it is shown that although most of the oxygen is locked in CO near the photosphere (as expected for a C/O ratio greater than 1), some stellar radii far away species such as H2O and CO2 have large abundances under the assumption of thermochemical equilibrium. It is also shown how non-LTE chemistry makes very difficult the CO-->H2O,CO2 transformation predicted in LTE. Concerning the chemistry in the outer and colder envelope, we show that formaldehyde can be formed through gas phase reactions. However, in order to form water vapor it is necessary to include a radiative association between atomic oxygen and molecular hydrogen with a quite high rate constant. The chemical models explain the presence of HCO+ and predict the existence of SO and H2CS (which has been detected in a 3 mm line survey to be published). We have modeled the line profiles of H2CO, H2O, HCO+, SO and H2CS using a non-local radiative transfer model and the abundance profiles predicted by our chemical model. The results have been compared to the observations and discussed.",
    "authors": [
      "Marcelino Agundez",
      "Jose Cernicharo"
    ],
    "publication_date": "2006-05-25T10:16:12Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0605645v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0605645v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hydrogen defects and band alignment in metal-organic frameworks",
    "abstract": "Band alignment, namely the prediction of band-edge positions of semiconductors and insulators in aqueous solutions, is an important problem in physics and chemistry. Such a prediction is especially challenging for complex materials. Here we present an approach to align band structure of metal-organic frameworks (MOFs) on an absolute energy scale which can be used for direct comparison with experiments. Hydrogen defects are used as probes into the chemical bonding of the covalently bonded hybrid materials. An effective defect energy level, defined as the average of the charge-state transition levels of the defects at the linker and at the secondary building unit, is identified as a charge neutrality level to align band structures. This level captures subtle chemical details at both the organic and inorganic building blocks and provides results that are in agreement with experiments in a wide range of different MOFs. We also compare with results obtained from using other approaches involving surface calculations and average pore-center electrostatic potentials.",
    "authors": [
      "Khang Hoang"
    ],
    "publication_date": "2025-05-30T13:23:28Z",
    "arxiv_id": "http://arxiv.org/abs/2505.24570v2",
    "download_url": "https://arxiv.org/abs/2505.24570v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Topological Insulators in Organometallic Lattices",
    "abstract": "Topological insulators (TIs) are a recently discovered class of materials having insulating bulk electronic states but conducting boundary states distinguished by nontrivial topology. So far, several generations of TIs have been theoretically predicted and experimentally confirmed, all based on inorganic materials. Here, based on first-principles calculations, we predict a family of two-dimensional organic TIs made of organometallic lattices. Designed by assembling molecular building blocks of triphenyl-metal compounds with strong spin-orbit coupling into a hexagonal lattice, this new classes of organic TIs are shown to exhibit nontrivial topological edge states that are robust against significant lattice strain. We envision that organic TIs will greatly broaden the scientific and technological impact of TIs.",
    "authors": [
      "Z. F. Wang",
      "Zheng Liu",
      "Feng Liu"
    ],
    "publication_date": "2013-04-20T03:50:02Z",
    "arxiv_id": "http://arxiv.org/abs/1304.5582v1",
    "download_url": "https://arxiv.org/abs/1304.5582v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On basis set optimisation in quantum chemistry",
    "abstract": "In this article, we propose general criteria to construct optimal atomic centered basis sets in quantum chemistry. We focus in particular on two criteria, one based on the ground-state one-body density matrix of the system and the other based on the ground-state energy. The performance of these two criteria are then numerically tested and compared on a parametrized eigenvalue problem, which corresponds to a one-dimensional toy version of the ground-state dissociation of a diatomic molecule.",
    "authors": [
      "Eric Cancès",
      "Geneviève Dusson",
      "Gaspard Kemlin",
      "Laurent Vidal"
    ],
    "publication_date": "2022-07-25T13:27:11Z",
    "arxiv_id": "http://arxiv.org/abs/2207.12190v1",
    "download_url": "https://arxiv.org/abs/2207.12190v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Warm dust surface chemistry in protoplanetary disks. Formation of phyllosilicates",
    "abstract": "The origin of the reservoirs of water on Earth is debated. The Earth's crust may contain at least three times more water than the oceans. This crust water is found in the form of phyllosilicates, whose origin probably differs from that of the oceans. We test the possibility to form phyllosilicates in protoplanetary disks, which can be the building blocks of terrestrial planets. We developed an exploratory rate-based warm surface chemistry model where water from the gas-phase can chemisorb on dust grain surfaces and subsequently diffuse into the silicate cores. We apply the phyllosilicate formation model to a zero-dimensional chemical model and to a 2D protoplanetary disk model (ProDiMo). The disk model includes in addition to the cold and warm surface chemistry continuum and line radiative transfer, photoprocesses (photodissociation, photoionization, and photodesorption), gas-phase cold and warm chemistry including three-body reactions, and detailed thermal balance. Despite the high energy barrier for water chemisorption on silicate grain surfaces and for diffusion into the core, the chemisorption sites at the surfaces can be occupied by a hydroxyl bond (-OH) at all gas and dust temperatures from 80 to 700 K for a gas density of 2E4 cm^-3. The chemisorption sites in the silicate cores are occupied at temperatures between 250 and 700 K. At higher temperatures thermal desorption of chemisorbed water occurs. The occupation efficiency is only limited by the maximum water uptake of the silicate. The timescales for complete hydration are at most 1E5 years for 1 mm radius grains at a gas density of 1E8 cm^-3. Phyllosilicates can be formed on dust grains at the dust coagulation stage in protoplanetary disks within 1 Myr. It is however not clear whether the amount of phyllosilicate formed by warm surface chemistry is sufficient compared to that found in Solar System objects.",
    "authors": [
      "W. F. Thi",
      "S. Hocuk",
      "I. Kamp",
      "P. Woitke",
      "Ch. Rab",
      "S. Cazaux",
      "P. Caselli",
      "M. D'Angelo"
    ],
    "publication_date": "2018-12-11T12:36:38Z",
    "arxiv_id": "http://arxiv.org/abs/1812.04357v1",
    "download_url": "https://arxiv.org/abs/1812.04357v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Destruction of refractory carbon grains drives the final stage of proto-planetary disk chemistry",
    "abstract": "Here we aim to explore the origin of the strong C2H lines to reimagine the chemistry of protoplanetary disks. There are a few key aspects that drive our analysis. First, C2H is detected in young and old systems, hinting at a long-lived chemistry. Second, as a radical, C2H is rapidly destroyed, within <1000 yr. These two statements hint that the chemistry responsible for C2H emission must be predominantly in the gas-phase and must be in equilibrium. Combining new and published chemical models we find that elevating the total volatile (gas and ice) C/O ratio is the only natural way to create a long lived, high C2H abundance. Most of the \\ce{C2H} resides in gas with a Fuv/n-gas ~ 10^-7 G0 cm^3. To elevate the volatile C/O ratio, additional carbon has to be released into the gas to enable an equilibrium chemistry under oxygen-poor conditions. Photo-ablation of carbon-rich grains seems the most straightforward way to elevate the C/O ratio above 1.5, powering a long-lived equilibrium cycle. The regions at which the conditions are optimal for the presence of high C/O ratio and elevated C2H abundances in the gas disk set by the Fuv/n-gas ~ 10^-7 G0 cm^3 condition lie just outside the pebble disk as well as possibly in disk gaps. This process can thus also explain the (hints of) structure seen in C2H observations.",
    "authors": [
      "Arthur D. Bosman",
      "Felipe Alarcon",
      "Ke Zhang",
      "Edwin A. Bergin"
    ],
    "publication_date": "2021-01-29T10:16:17Z",
    "arxiv_id": "http://arxiv.org/abs/2101.12502v1",
    "download_url": "https://arxiv.org/abs/2101.12502v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Novel Concepts for Organic Transistors: Physics, Device Design, and Applications",
    "abstract": "Beyond conventional organic thin-film transistors, this thesis explores possible paths for the fourth wave of organic electronics. In this context, mixed ionic-electronic conductors and organic electro-chemical transistors (OECTs) are identified as highly promising approaches for electronic bio-interfaces enabling ultra-sensitive detection of biological signals. Furthermore, these systems show fundamental properties of biological synapses, namely the synaptic plasticity, which renders the possibility to build brain-inspired, neuromorphic networks enabling highly efficient computing. In particular, the combination of OECTs acting as sensor units and self-learning neural networks at once enables the development of intelligent tags for medical applications. Overall, this thesis adds substantially new insight into the field of organic electronics and draws a vision towards further research and applications. The advancements in the field of vertical organic transistors open new perspectives for the implementation of organic transistors in high-resolution AMOLED displays or radio-frequency identification tags. Furthermore, the exploration of OECTs for neuromorphic computing will create a whole new research field across the disciplines of physics, material, and computer science.",
    "authors": [
      "Hans Kleemann"
    ],
    "publication_date": "2021-11-17T22:14:13Z",
    "arxiv_id": "http://arxiv.org/abs/2111.09430v1",
    "download_url": "https://arxiv.org/abs/2111.09430v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Progress in organic single-crystal field-effect transistors",
    "abstract": "Research on organic thin-film transistors tends to focus on improvements in device performance, but very little is understood about the ultimate limits of these devices, the microscopic physical mechanisms responsible for their limitations, and, more generally, the intrinsic transport properties of organic semiconductors. These topics are now being investigated through the study of transport in organic transistors realized using molecular single crystals of unprecedented chemical purity and structural quality. These studies are elucidating detailed microscopic aspects of the physics of organic semiconductors and corresponding devices and have also led to unforeseen high values for carrier mobility in these materials. Here, we discuss developments in this area and present a brief outlook on future goals that have now come into experimental reach.",
    "authors": [
      "Ignacio Gutiérrez Lezama",
      "Alberto F. Morpurgo"
    ],
    "publication_date": "2013-02-14T16:18:30Z",
    "arxiv_id": "http://arxiv.org/abs/1302.3450v1",
    "download_url": "https://arxiv.org/abs/1302.3450v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic magnetoresistance from deep traps",
    "abstract": "We predict that singly-occupied carrier traps, produced by electrical stress or irradiation within organic semiconductors, can cause spin blockades and the large room-temperature magnetoresistance known as organic magnetoresistance. The blockade occurs because many singly-occupied traps can only become doubly occupied in a spin-singlet configuration. Magnetic-field effects on spin mixing during transport dramatically modify the effects of this blockade and produce magnetoresistance.We calculate the quantitative effects of these traps on organic magnetoresistance from percolation theory and find a dramatic nonlinear dependence of the saturated magnetoresistance on trap density, leading to values $\\sim$ 20%, within the theory's range of validity.",
    "authors": [
      "Nicholas J. Harmon",
      "Michael E. Flatté"
    ],
    "publication_date": "2014-07-23T15:55:50Z",
    "arxiv_id": "http://arxiv.org/abs/1407.6277v1",
    "download_url": "https://arxiv.org/abs/1407.6277v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Active control of magnetoresistance of organic spin valves using ferroelectricity",
    "abstract": "Organic spintronic devices have been appealing because of the long spin life time of the charge carriers in the organic materials and their low cost, flexibility and chemical diversity. In previous studies, the control of resistance of organic spin valves is generally achieved by the alignment of the magnetization directions of the two ferromagnetic electrodes, generating magnetoresistance.1 Here we employ a new knob to tune the resistance of organic spin valves by adding a thin ferroelectric interfacial layer between the ferromagnetic electrode and the organic spacer. We show that the resistance can be controlled by not only the spin alignment of the two ferromagnetic electrodes, but also by the electric polarization of the interfacial ferroelectric layer: the MR of the spin valve depends strongly on the history of the bias voltage which is correlated with the polarization of the ferroelectric layer; the MR even changes sign when the electric polarization of the ferroelectric layer is reversed. This new tunability can be understood in terms of the change of relative energy level alignment between ferromagnetic electrode and the organic spacer caused by the electric dipole moment of the ferroelectric layer. These findings enable active control of resistance using both electric and magnetic fields, opening up possibility for multi-state organic spin valves and shed light on the mechanism of the spin transport in organic spin valves.",
    "authors": [
      "Dali Sun",
      "Mei Fang",
      "Xiaoshan Xu",
      "Lu Jiang",
      "Hangwen Guo",
      "Yanmei Wang",
      "Wenting Yang",
      "Lifeng Yin",
      "Paul C. Snijders",
      "T. Z. Ward",
      "Zheng Gai",
      "X. -G. Zhang",
      "Ho Nyung Lee",
      "Jian Shen"
    ],
    "publication_date": "2013-04-09T02:16:58Z",
    "arxiv_id": "http://arxiv.org/abs/1304.2446v2",
    "download_url": "https://arxiv.org/abs/1304.2446v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Emergence of Self-Reproducing Metabolisms as Recursive Algorithms in an Artificial Chemistry",
    "abstract": "One of the main goals of Artificial Life is to research the conditions for the emergence of life, not necessarily as it is, but as it could be. Artificial Chemistries are one of the most important tools for this purpose because they provide us with a basic framework to investigate under which conditions metabolisms capable of reproducing themselves, and ultimately, of evolving, can emerge. While there have been successful attempts at producing examples of emergent self-reproducing metabolisms, the set of rules involved remain too complex to shed much light on the underlying principles at work. In this paper, we hypothesize that the key property needed for self-reproducing metabolisms to emerge is the existence of an auto-catalyzed subset of Turing-complete reactions. We validate this hypothesis with a minimalistic Artificial Chemistry with conservation laws, which is based on a Turing-complete rewriting system called Combinatory Logic. Our experiments show that a single run of this chemistry, starting from a tabula rasa state, discovers -- with no external intervention -- a wide range of emergent structures including ones that self-reproduce in each cycle. All of these structures take the form of recursive algorithms that acquire basic constituents from the environment and decompose them in a process that is remarkably similar to biological metabolisms.",
    "authors": [
      "Germán Kruszewski",
      "Tomas Mikolov"
    ],
    "publication_date": "2021-03-15T09:55:43Z",
    "arxiv_id": "http://arxiv.org/abs/2103.08245v3",
    "download_url": "https://arxiv.org/abs/2103.08245v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Determining Factors for the Accuracy of DMRG in Chemistry",
    "abstract": "The Density Matrix Renormalization Group (DMRG) algorithm has been a rising star for the accurate ab initio exploration of Born-Oppenheimer potential energy surfaces in theoretical chemistry. However, owing to its iterative numerical nature, pit falls, that can affect the accuracy of DMRG energies, need to be circumvented. Here, after a brief introduction into this quantum chemical method, we discuss criteria that determine the accuracy of DMRG calculations.",
    "authors": [
      "Sebastian F. Keller",
      "Markus Reiher"
    ],
    "publication_date": "2014-01-21T21:37:43Z",
    "arxiv_id": "http://arxiv.org/abs/1401.5497v1",
    "download_url": "https://arxiv.org/abs/1401.5497v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Imaging Atomic-Scale Chemistry from Fused Multi-Modal Electron Microscopy",
    "abstract": "Efforts to map atomic-scale chemistry at low doses with minimal noise using electron microscopes are fundamentally limited by inelastic interactions. Here, fused multi-modal electron microscopy offers high signal-to-noise ratio (SNR) recovery of material chemistry at nano- and atomic- resolution by coupling correlated information encoded within both elastic scattering (high-angle annular dark field (HAADF)) and inelastic spectroscopic signals (electron energy loss (EELS) or energy-dispersive x-ray (EDX)). By linking these simultaneously acquired signals, or modalities, the chemical distribution within nanomaterials can be imaged at significantly lower doses with existing detector hardware. In many cases, the dose requirements can be reduced by over one order of magnitude. This high SNR recovery of chemistry is tested against simulated and experimental atomic resolution data of heterogeneous nanomaterials.",
    "authors": [
      "Jonathan Schwartz",
      "Zichao Wendy Di",
      "Yi Jiang",
      "Alyssa J. Fielitz",
      "Don-Hyung Ha",
      "Sanjaya D. Perera",
      "Ismail El Baggari",
      "Richard D. Robinson",
      "Jeffrey A. Fessler",
      "Colin Ophus",
      "Steve Rozeveld",
      "Robert Hovden"
    ],
    "publication_date": "2022-03-03T21:18:32Z",
    "arxiv_id": "http://arxiv.org/abs/2203.02024v2",
    "download_url": "https://arxiv.org/abs/2203.02024v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient Simulations of Interstellar Gas-Grain Chemistry Using Moment Equations",
    "abstract": "Networks of reactions on dust grain surfaces play a crucial role in the chemistry of interstellar clouds, leading to the formation of molecular hydrogen in diffuse clouds as well as various organic molecules in dense molecular clouds. Due to the sub-micron size of the grains and the low flux, the population of reactive species per grain may be very small and strongly fluctuating. Under these conditions rate equations fail and the simulation of surface-reaction networks requires stochastic methods such as the master equation. However, the master equation becomes infeasible for complex networks because the number of equations proliferates exponentially. Here we introduce a method based on moment equations for the simulation of reaction networks on small grains. The number of equations is reduced to just one equation per reactive specie and one equation per reaction. Nevertheless, the method provides accurate results, which are in excellent agreement with the master equation. The method is demonstrated for the methanol network which has been recently shown to be of crucial importance.",
    "authors": [
      "B. Barzel",
      "O. Biham"
    ],
    "publication_date": "2007-10-11T13:53:58Z",
    "arxiv_id": "http://arxiv.org/abs/0710.2250v1",
    "download_url": "https://arxiv.org/abs/0710.2250v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Astrochemical Impact of Cosmic Rays in Protoclusters I: Molecular Cloud Chemistry",
    "abstract": "We present astrochemical photo-dissociation region models in which cosmic ray attenuation has been fully coupled to the chemical evolution of the gas. We model the astrochemical impact of cosmic rays, including those accelerated by protostellar accretion shocks, on molecular clouds hosting protoclusters. Our models with embedded protostars reproduce observed ionization rates. We study the imprint of cosmic ray attenuation on ions for models with different surface cosmic ray spectra and different star formation efficiencies. We find that abundances, particularly ions, are sensitive to the treatment of cosmic rays. We show the column densities of ions are under predicted by the `classic' treatment of cosmic rays by an order of magnitude. We also test two common chemistry approximations used to infer ionization rates. We conclude that the approximation based on the H$_3^+$ abundance under predicts the ionization rate except in regions where the cosmic rays dominate the chemistry. Our models suggest the chemistry in dense gas will be significantly impacted by the increased ionization rates, leading to a reduction in molecules such as NH$_3$ and causing H$_2$-rich gas to become [C II] bright.",
    "authors": [
      "Brandt A. L. Gaches",
      "Stella S. R. Offner",
      "Thomas G. Bisbas"
    ],
    "publication_date": "2019-05-06T18:27:40Z",
    "arxiv_id": "http://arxiv.org/abs/1905.02232v2",
    "download_url": "https://arxiv.org/abs/1905.02232v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the Relationship between CH$_3$OD Abundance and Temperature in the Orion KL Nebula",
    "abstract": "The relative abundances of singly-deuterated methanol isotopologues, [CH$_{2}$DOH]/[CH$_{3}$OD], in star-forming regions deviate from the statistically expected ratio of 3. In Orion KL, the nearest high-mass star-forming region to Earth, the singly-deuterated methanol ratio is about 1, and the cause for this observation has been explored through theory for nearly three decades. We present high-angular resolution observations of Orion KL using the Atacama Large Millimeter/submillimeter Array to map small-scale changes in CH$_{3}$OD column density across the nebula, which provide a new avenue to examine the deuterium chemistry during star and planet formation. By considering how CH$_{3}$OD column densities vary with temperature, we find evidence of chemical processes that can significantly alter the observed column densities. The astronomical data are compared with existing theoretical work and support D-H exchange between CH$_{3}$OH and heavy water (i.e., HDO and D$_{2}$O) at methanol's hydroxyl site in the icy mantles of dust grains. The enhanced CH$_{3}$OD column densities are localized to the Hot Core-SW region, a pattern that may be linked to the coupled evolution of ice mantel chemistry and star formation in giant molecular clouds. This work provides new perspectives on deuterated methanol chemistry in Orion KL and informs considerations that may guide future theoretical, experimental, and observational work.",
    "authors": [
      "Olivia H. Wilkins",
      "Geoffrey A. Blake"
    ],
    "publication_date": "2022-08-17T21:22:37Z",
    "arxiv_id": "http://arxiv.org/abs/2208.08543v1",
    "download_url": "https://arxiv.org/abs/2208.08543v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The chemistry of dust formation in red supergiants",
    "abstract": "Massive stars in their late stages of evolution as Red Supergiants experience mass loss. The resulting winds show various degrees of dynamical and chemical complexity and produce molecules and dust grains. This review summarises our knowledge of the molecular and dust components of the wind of Red Supergiants, including VY CMa and Betelgeuse. We discuss the synthesis of dust as a non-equilibrium process in stellar winds, and present the current knowledge of the chemistry involved in the formation of oxygen-rich dust such as silicates and metal oxides.",
    "authors": [
      "Isabelle Cherchneff"
    ],
    "publication_date": "2013-03-12T08:42:50Z",
    "arxiv_id": "http://arxiv.org/abs/1303.2805v1",
    "download_url": "https://arxiv.org/abs/1303.2805v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "X-ray chemistry in envelopes around young stellar objects",
    "abstract": "We present chemical models of the envelope of a young stellar object (YSO) exposed to a central X-ray source. The models are applied to the massive star-forming region AFGL 2591 for different X-ray fluxes. The total X-ray ionization rate is dominated by the `secondary' ionization rate of H2 resulting from fast electrons. The carbon, sulphur and nitrogen chemistries are discussed. It is found that He+ and H3+ are enhanced and trigger a peculiar chemistry. Several molecular X-ray tracers are found and compared to tracers of the far ultraviolet (FUV) field. Like ultraviolet radiation fields, X-rays enhance simple hydrides, ions and radicals. In contrast to ultraviolet photons, X-rays can penetrate deep into the envelope and affect the chemistry even at large distances from the source. Whereas the FUV enhanced species cover a region of 200-300 AU, the region enhanced by X-rays is >1000 AU. Best-fit models for AFGL 2591 predict an X-ray luminosity LX > 1e+31 ergs/s with a hard X-ray spectrum TX > 3e+07 K. Furthermore, we find LX/Lbol ~ 1e-6. The chemistry of the bulk of the envelope mass is dominated by cosmic-ray induced reactions rather than by X-ray induced ionization for X-ray luminosities LX < 1e+33 ergs/s. The calculated line intensities of HCO+ and HCS+ show that high-J lines are more affected than lower J lines by the presence of X-rays due to their higher critical densities, and that such differences are detectable even with large aperture single-dish telescopes. Future instruments such as Herschel-HIFI or SOFIA will be able to observe X-ray enhanced hydrides whereas the sensitivity and spatial resolution of ALMA is well-suited to measure the size and geometry of the region affected by X-rays.",
    "authors": [
      "P. Staeuber",
      "S. D. Doty",
      "E. F. van Dishoeck",
      "A. O. Benz"
    ],
    "publication_date": "2005-06-14T13:44:56Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0506306v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0506306v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "AI for Interpretable Chemistry: Predicting Radical Mechanistic Pathways via Contrastive Learning",
    "abstract": "Deep learning-based reaction predictors have undergone significant architectural evolution. However, their reliance on reactions from the US Patent Office results in a lack of interpretable predictions and limited generalization capability to other chemistry domains, such as radical and atmospheric chemistry. To address these challenges, we introduce a new reaction predictor system, RMechRP, that leverages contrastive learning in conjunction with mechanistic pathways, the most interpretable representation of chemical reactions. Specifically designed for radical reactions, RMechRP provides different levels of interpretation of chemical reactions. We develop and train multiple deep-learning models using RMechDB, a public database of radical reactions, to establish the first benchmark for predicting radical reactions. Our results demonstrate the effectiveness of RMechRP in providing accurate and interpretable predictions of radical reactions, and its potential for various applications in atmospheric chemistry.",
    "authors": [
      "Mohammadamin Tavakoli",
      "Yin Ting T. Chiu",
      "Alexander Shmakov",
      "Ann Marie Carlton",
      "David Van Vranken",
      "Pierre Baldi"
    ],
    "publication_date": "2023-11-02T09:47:27Z",
    "arxiv_id": "http://arxiv.org/abs/2311.01118v1",
    "download_url": "https://arxiv.org/abs/2311.01118v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "H2 chemistry in interstellar ices: the case of CO ice hydrogenation in UV irradiated CO:H2 ice mixtures",
    "abstract": "Context. In dense clouds, hydrogenation reactions on icy dust grains are key in the formation of molecules, like formaldehyde, methanol, and complex organic molecules (COMs). These species form through the sequential hydrogenation of CO ice. Although molecular hydrogen (H2) abundances can be four orders of magnitude higher than those of free H-atoms in dense clouds, H2 surface chemistry has been largely ignored; several laboratory studies show that H2 does not actively participate in non-energetic ice chemistry because of the high activation energies required. Aims. For the example of CO ice hydrogenation, we experimentally investigated the potential role of H2 molecules on the surface chemistry when energetic processing (i.e., UV photolysis) is involved. We test whether additional hydrogenation pathways become available upon UV irradiation of a CO:H2 ice mixture and whether this reaction mechanism also applies to other chemical systems. Methods. Ultra-high vacuum (UHV) experiments were performed at 8~20 K. A pre-deposited solid mixture of CO:H2 was irradiated with UV-photons. Reflection absorption infrared spectroscopy (RAIRS) was used as an in situ diagnostic tool. Single reaction steps and possible isotopic effects were studied by comparing results from CO:H2 and CO:D2 ice mixtures. Results. After UV-irradiation of a CO:H2 ice mixture, two photon-induced products, HCO and H2CO, are unambiguously detected. The proposed reaction mechanism involves electronically excited CO in the following reaction steps: CO + hν->CO*, CO* + H2->HCO + H where newly formed H-atoms are then available for further hydrogenation reactions. The HCO formation yields have a strong temperature dependence for the investigated regime, which is most likely linked to the H2 sticking coefficient. Finally, the astronomical relevance of this photo-induced reaction channel is discussed.",
    "authors": [
      "K. -J. Chuang",
      "G. Fedoseev",
      "D. Qasim",
      "S. Ioppolo",
      "E. F. van Dishoeck",
      "H. Linnartz"
    ],
    "publication_date": "2018-09-27T13:24:23Z",
    "arxiv_id": "http://arxiv.org/abs/1809.10507v1",
    "download_url": "https://arxiv.org/abs/1809.10507v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Selectivity in single-molecule reactions by tip-induced redox chemistry",
    "abstract": "Controlling selectivity of reactions is a quest in chemistry. Here, we demonstrate reversible and selective bond formation and dissociation promoted by tip-induced reduction-oxidation reactions on a surface. Molecular rearrangements leading to different constitutional isomers are selected by the polarity and magnitude of applied voltage pulses from the tip of a combined scanning tunneling and atomic force microscope. Characterization of voltage dependence of the reactions and determination of reaction rates demonstrate selectivity in constitutional isomerization reactions and provide insight into the underlying mechanisms. With support of density functional theory calculations, we find that the energy landscape of the isomers in different charge states is important to rationalize the selectivity. Tip-induced selective single-molecule reactions increase our understanding of redox chemistry and could lead to novel molecular machines.",
    "authors": [
      "Florian Albrecht",
      "Shadi Fatayer",
      "Iago Pozo",
      "Ivano Tavernelli",
      "Jascha Repp",
      "Diego Peña",
      "Leo Gross"
    ],
    "publication_date": "2022-07-14T05:21:08Z",
    "arxiv_id": "http://arxiv.org/abs/2207.06662v1",
    "download_url": "https://arxiv.org/abs/2207.06662v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Associated Legendre Polynomials and Spherical Harmonics Computation for Chemistry Applications",
    "abstract": "Associated Legendre polynomials and spherical harmonics are central to calculations in many fields of science and mathematics - not only chemistry but computer graphics, magnetic, seismology and geodesy. There are a number of algorithms for these functions published since 1960 but none of them satisfy our requirements. In this paper, we present a comprehensive review of algorithms in the literature and, based on them, propose an efficient and accurate code for quantum chemistry. Our requirements are to efficiently calculate these functions for all non-negative integer degrees and orders up to a given number (<=1000) and the absolute or the relative error of each calculated value should not exceed 10E-10. We achieve this by normalizing the polynomials, employing efficient and stable recurrence relations, and precomputing coefficients. The algorithm presented here is straightforward and may be used in other areas of science.",
    "authors": [
      "Taweetham Limpanuparb",
      "Josh Milthorpe"
    ],
    "publication_date": "2014-10-07T14:45:26Z",
    "arxiv_id": "http://arxiv.org/abs/1410.1748v1",
    "download_url": "https://arxiv.org/abs/1410.1748v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Personal computer realizations for two classics of quantum chemistry",
    "abstract": "Hylleraas in 1929 carried out a variational computation on the Schrodinger equation for the helium atom which gave, for the first time, a ground-state energy in essential agreement with experimental results. Coolidge and James in 1933, likewise did the first accurate computation for the hydrogen molecule. These are considered epoch-making contributions in the development of ab initio quantum chemistry, since they provided definitive evidence for the validity of the multiple-particle Schrodinger equation for atoms and molecules. Before then, exact solutions had been obtained only for one-electron hydrogenlike atoms. The helium and hydrogen work was done long before the advent of electronic computers and required many months of drudgery, using hand-cranked calculating machines. Nowadays, students of chemistry and physics can carry out these same computations in a matter of hours, or even minutes, using relatively straightforward Mathematica routines. Moreover, the results can be easily improved far beyond the capabilities of the original workers.",
    "authors": [
      "S. M. Blinder"
    ],
    "publication_date": "2005-09-15T14:47:07Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0509135v1",
    "download_url": "https://arxiv.org/abs/physics/0509135v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The largest oxigen bearing organic molecule repository",
    "abstract": "We present the first detection of complex aldehydes and isomers in three typical molecular clouds located within 200pc of the center of our Galaxy.\n  We find very large abundances of these complex organic molecules (COMs) in the central molecular zone (CMZ), which we attribute to the ejection of COMs from grain mantles by shocks. The relative abundances of the different COMs with respect to that of CH3OH are strikingly similar for the three sources, located in very different environments in the CMZ. The similar relative abundances point toward a unique grain mantle composition in the CMZ. Studying the Galactic center clouds and objects in the Galactic disk having large abundances of COMs, we find that more saturated molecules are more abundant than the non-saturated ones. We also find differences between the relative abundance between COMs in the CMZ and the Galactic disk, suggesting different chemical histories of the grain mantles between the two regions in the Galaxy for the complex aldehydes. Different possibilities for the grain chemistry on the icy mantles in the GC clouds are briefly discussed. Cosmic rays can play an important role in the grain chemistry. With these new detections, the molecular clouds in the Galactic center appear to be one of the best laboratories for studying the formation of COMs in the Galaxy.",
    "authors": [
      "M. A. Requena-Torres",
      "J. Martin-Pintado",
      "S. Martin",
      "M. R. Morris"
    ],
    "publication_date": "2007-09-05T13:25:27Z",
    "arxiv_id": "http://arxiv.org/abs/0709.0542v1",
    "download_url": "https://arxiv.org/abs/0709.0542v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Concept of orbital entanglement and correlation in quantum chemistry",
    "abstract": "A recent development in quantum chemistry has established the quantum mutual information between orbitals as a major descriptor of electronic structure. This has already facilitated remarkable improvements of numerical methods and may lead to a more comprehensive foundation for chemical bonding theory. Building on this promising development, our work provides a refined discussion of quantum information theoretical concepts by introducing the physical correlation and its separation into classical and quantum parts as distinctive quantifiers of electronic structure. In particular, we succeed in quantifying the entanglement. Intriguingly, our results for different molecules reveal that the total correlation between orbitals is mainly classical, raising questions about the general significance of entanglement in chemical bonding. Our work also shows that implementing the fundamental particle number superselection rule, so far not accounted for in quantum chemistry, removes a major part of correlation and entanglement previously seen. In that respect, realizing quantum information processing tasks with molecular systems might be more challenging than anticipated.",
    "authors": [
      "Lexin Ding",
      "Sam Mardazad",
      "Sreetama Das",
      "Szilárd Szalay",
      "Ulrich Schollwöck",
      "Zoltán Zimborás",
      "Christian Schilling"
    ],
    "publication_date": "2020-06-01T14:17:17Z",
    "arxiv_id": "http://arxiv.org/abs/2006.00961v2",
    "download_url": "https://arxiv.org/abs/2006.00961v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The chemistry of C3 & Carbon Chain Molecules in DR21(OH)",
    "abstract": "(Abridged) We have observed velocity resolved spectra of four ro-vibrational far-infrared transitions of C3 between the vibrational ground state and the low-energy nu2 bending mode at frequencies between 1654--1897 GHz using HIFI on board Herschel, in DR21(OH), a high mass star forming region. Several transitions of CCH and c-C3H2 have also been observed with HIFI and the IRAM 30m telescope. A gas and grain warm-up model was used to identify the primary C3 forming reactions in DR21(OH). We have detected C3 in absorption in four far-infrared transitions, P(4), P(10), Q(2) and Q(4). The continuum sources MM1 and MM2 in DR21(OH) though spatially unresolved, are sufficiently separated in velocity to be identified in the C3 spectra. All C3 transitions are detected from the embedded source MM2 and the surrounding envelope, whereas only Q(4) & P(4) are detected toward the hot core MM1. The abundance of C3 in the envelope and MM2 is \\sim6x10^{-10} and \\sim3x10^{-9} respectively. For CCH and c-C3H2 we only detect emission from the envelope and MM1. The observed CCH, C3, and c-C3H2 abundances are most consistent with a chemical model with n(H2)\\sim5x10^{6} cm^-3 post-warm-up dust temperature, T_max =30 K and a time of \\sim0.7-3 Myr. Post warm-up gas phase chemistry of CH4 released from the grain at t\\sim 0.2 Myr and lasting for 1 Myr can explain the observed C3 abundance in the envelope of DR21(OH) and no mechanism involving photodestruction of PAH molecules is required. The chemistry in the envelope is similar to the warm carbon chain chemistry (WCCC) found in lukewarm corinos. The observed lower C3 abundance in MM1 as compared to MM2 and the envelope could be indicative of destruction of C3 in the more evolved MM1. The timescale for the chemistry derived for the envelope is consistent with the dynamical timescale of 2 Myr derived for DR21(OH) in other studies.",
    "authors": [
      "B. Mookerjea",
      "G. Hassel",
      "M. Gerin",
      "T. Giesen",
      "J. Stutzki",
      "E. Herbst",
      "J. H. Black",
      "P. F. Goldsmith",
      "K. M. Menten",
      "J. Krelowski",
      "M. De Luca",
      "T. Csengeri",
      "C. Joblin",
      "M. Kazmierczak",
      "M. Schmidt",
      "J. R. Goicoechea",
      "J. Cernicharo"
    ],
    "publication_date": "2012-08-09T05:23:10Z",
    "arxiv_id": "http://arxiv.org/abs/1208.1816v1",
    "download_url": "https://arxiv.org/abs/1208.1816v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the geometric stability of an inorganic nanowire and an organic ligand shell",
    "abstract": "The break-up of a nanowire with an organic ligand shell into discrete droplets is analysed in terms of the Rayleigh-Plateau instability. Explicit account is taken of the effect of the organic ligand shell upon the energetics and kinetics of surface diffusion in the wire. Both an initial perturbation analysis and a full numerical analysis of the evolution in wire morphology are conducted, and the governing non-dimensional groups are identified. The perturbation analysis is remarkably accurate in obtaining the main features of the instability, including the pinch-off time and the resulting diameter of the droplets. It is conjectured that the surface energy of the wire and surrounding organic shell depends upon both the mean and deviatoric invariants of the curvature tensor. Such a behaviour allows for the possibility of a stable nanowire such that the Rayleigh-Plateau instability is not energetically favourable. A stability map illustrates this. Maps are also constructed for the final droplet size and pinch-off time as a function of two non-dimensional groups that characterise the energetics and kinetics of diffusion in the presence of the organic shell. These maps can guide future experimental activity on the stabilisation of nanowires by organic ligand shells.",
    "authors": [
      "Simon Bettscheider",
      "Tobias Kraus",
      "Norman A. Fleck"
    ],
    "publication_date": "2018-08-02T20:36:11Z",
    "arxiv_id": "http://arxiv.org/abs/1808.01011v1",
    "download_url": "https://arxiv.org/abs/1808.01011v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electron Charge Density: A Clue from Quantum Chemistry for Quantum Foundations",
    "abstract": "Within quantum chemistry, the electron clouds that surround nuclei in atoms and molecules are sometimes treated as clouds of probability and sometimes as clouds of charge. These two roles, tracing back to Schrödinger and Born, are in tension with one another but are not incompatible. Schrödinger's idea that the nucleus of an atom is surrounded by a spread-out electron charge density is supported by a variety of evidence from quantum chemistry, including two methods that are used to determine atomic and molecular structure: the Hartree-Fock method and density functional theory. Taking this evidence as a clue to the foundations of quantum physics, Schrödinger's electron charge density can be incorporated into many different interpretations of quantum mechanics (and extensions of such interpretations to quantum field theory).",
    "authors": [
      "Charles T. Sebens"
    ],
    "publication_date": "2021-05-23T20:05:04Z",
    "arxiv_id": "http://arxiv.org/abs/2105.11988v2",
    "download_url": "https://arxiv.org/abs/2105.11988v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ACCDB: A Collection of Chemistry DataBases for Broad Computational Purposes",
    "abstract": "The importance of databases of reliable and accurate data in chemistry has substantially increased in the past two decades. Their main usage is to parametrize electronic structure theory methods, and to assess their capabilities and accuracy for a broad set of chemical problems. The collection we present here -ACCDB- includes data from 16 different research groups, for a total of 44,931 unique reference data points, all at a level of theory significantly higher than DFT, and covering most of the periodic table. It is composed of five databases taken from literature (GMTKN, MGCDB84, Minnesota2015B, DP284, and W4-17), two newly developed reaction energy databases (W4-17-RE, and MN-RE), and a new collection of databases containing transition metals. A set of expandable software tools for its manipulation is also presented here for the first time, as well as a case study where ACCDB is used for benchmarking commercial CPUs for chemistry calculations. To be published in J. Comput. Chem.",
    "authors": [
      "Pierpaolo Morgante",
      "Roberto Peverati"
    ],
    "publication_date": "2018-09-05T19:40:38Z",
    "arxiv_id": "http://arxiv.org/abs/1809.01707v2",
    "download_url": "https://arxiv.org/abs/1809.01707v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Effect of Noise on the Performance of Variational Algorithms for Quantum Chemistry",
    "abstract": "Variational quantum algorithms are suitable for use on noisy quantum systems. One of the most important use-cases is the quantum simulation of materials, using the variational quantum eigensolver (VQE). To optimize VQE performance, a suitable parameterized quantum circuit (ansatz) must be selected. We investigate a class of ansatze that incorporates knowledge of the quantum hardware, namely the hardware efficient ansatze. The performance of hardware efficient ansatze is affected differently by noise, and our goal is to study the effect of noise on evaluating which ansatz gives more accurate results in practice. First, we study the effect of noise on the different hardware efficient ansatze by benchmarking and ranking the performance of each ansatz family (i) on a chemistry application using VQE and (ii) by the recently established metric of \"expressibility\". The results demonstrate the ranking of optimal circuits does not remain constant in the presence of noise. Second, we evaluate the suitability of the expressibility measure in this context by performing a correlation study between expressibility and the performance of the same circuits on a chemistry application using VQE. Our simulations reveal a weak correlation and therefore demonstrate that expressibility is not an adequate measure to quantify the effectiveness of parameterized quantum circuits for quantum chemistry. Third, we evaluate the effect of different quantum device noise models on the ordering of which ansatz family is best. Interestingly, we see that to decide which ansatz is optimal for use, one needs to consider the specific hardware used even within the same family of quantum hardware.",
    "authors": [
      "Waheeda Saib",
      "Petros Wallden",
      "Ismail Akhalwaya"
    ],
    "publication_date": "2021-08-27T16:52:18Z",
    "arxiv_id": "http://arxiv.org/abs/2108.12388v1",
    "download_url": "https://arxiv.org/abs/2108.12388v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Swinging between shine and shadow: Theoretical advances on thermally-activated vibropolaritonic chemistry (a perspective)",
    "abstract": "Polariton chemistry has emerged as an appealing branch of synthetic chemistry that promises mode selectivity and a cleaner approach to kinetic control. Of particular interest are the numerous experiments in which reactivity has been modified by virtue of performing the reaction inside infrared optical microcavities in the absence of optical pumping; this effort is known as \"vibropolaritonic chemistry.\" The optimal conditions for these observations are (1) resonance between cavity and reactive modes at normal incidence ($k=0$), and (2) monotonic increase of the effect with the concentration of emitters in the sample. Importantly, vibropolaritonic chemistry has only been experimentally demonstrated in the so-called \"collective\" strong coupling regime, where there is a macroscopic number of molecules (rather than a single molecule) coupled to each photon mode of the microcavity. Strikingly, efforts to understand this phenomenon from a conceptual standpoint have encountered several roadblocks and no single, unifying theory has surfaced thus far. This perspective documents the most relevant approaches taken by theorists, laying out the contributions and unresolved challenges from each work. We expect this manuscript to not only serve as a primer for experimentalists and theorists alike, but also inform future endeavors in the quest for the ultimate formalism of vibropolaritonic chemical kinetics.",
    "authors": [
      "Jorge A. Campos-Gonzalez-Angulo",
      "Yong Rui Poh",
      "Matthew Du",
      "Joel Yuen-Zhou"
    ],
    "publication_date": "2022-12-08T00:44:36Z",
    "arxiv_id": "http://arxiv.org/abs/2212.04017v2",
    "download_url": "https://arxiv.org/abs/2212.04017v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Metal Organic interfaces at the nanoscale",
    "abstract": "In this work, we present an investigation of the Ag-PPP (polyparaphenylene) interface using ballistic electron emission microscopy. Our work is the first successful application of the BEEM technique to metal-organic interfaces. We observe nanometer scale injection inhomogeneities. They have an electronic origin, since we find corresponding Schottky barrier variations. We also determine the transmission function of Ag-PPP interface and find that it agrees qualitatively with the theoretical calculations for a metal-phenyl ring interface. We conclude that charge transport across inhomogeneous barriers needs to be considered for understanding electronic transport across metal-organic interfaces and organic device characteristics.",
    "authors": [
      "Cedric Troadec",
      "Deng Jie",
      "Linda Kunardi",
      "Sean J O'Shea"
    ],
    "publication_date": "2005-01-04T08:38:45Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0501039v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0501039v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemical modeling of Infrared Dark Clouds: the Role of Surface Chemistry",
    "abstract": "We simulate the chemistry of infrared dark clouds (IRDCs) with a model in which the physical conditions are homogeneous and time-independent. The chemistry is solved as a function of time with three networks: one purely gas-phase, one that includes accretion and desorption, and one, the complete gas-grain network, that includes surface chemistry in addition. We compare our results with observed molecular abundances for two representative IRDCs -- IRDC013.90-1 and IRDC321.73-1 -- using the molecular species N$_2$H$^+$, HC$_3$N, HNC, HCO$^+$, HCN, C$_2$H, NH$_3$ and CS. IRDC013.90-1 is a cold IRDC, with a temperature below 20 K, while IRDC321.73-1 is somewhat warmer, in the range 20 - 30 K. We find that the complete gas-grain model fits the data very well, but that the goodness-of-fit is not sharply peaked at a particular temperature. Surface processes are important for the explanation of the high gas-phase abundance of N$_2$H$^+$ in IRDC321.73-1. The general success of the 0-D model in reproducing single-dish observations of our limited sample of 8 species shows that it is probably sufficient for an explanation of this type of data. To build and justify more complicated models, including spatial temperature and density structure, contraction, and heating, we require high-resolution interferometric data.",
    "authors": [
      "T. Vasyunina",
      "A. I. Vasyunin",
      "E. Herbst",
      "H. Linz"
    ],
    "publication_date": "2012-03-26T00:25:01Z",
    "arxiv_id": "http://arxiv.org/abs/1203.5561v1",
    "download_url": "https://arxiv.org/abs/1203.5561v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tunnelling in organic superconductors",
    "abstract": "We discuss the possibility of deciding on the symmetry of the superconducting phase in the organic superconductors (Bechgaard salts), using tunnelling experiments. We first briefly review the properties of organic superconductors, and the possibility to have unconventional (triplet) superconductivity in these systems. We then present a simple scheme for computing the full current-voltage characteristics for tunnelling experiments within the framework of the non-equilibrium Keldysh Green function formalism. This formalism is flexible enough to address different pairing symmetries combined with magnetic fields and finite temperatures at arbitrary bias voltages. We then discuss extensively how to apply these results to probe for the symmetry of the superconducting order parameter.",
    "authors": [
      "C. J. Bolech",
      "T. Giamarchi"
    ],
    "publication_date": "2005-08-06T18:14:07Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0508177v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0508177v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deuterium chemistry of dense gas in the vicinity of low-mass and massive star forming regions",
    "abstract": "The standard interstellar ratio of deuterium to hydrogen (D/H) atoms is $\\sim 1.5 \\times 10^{-5}$. However, the deuterium fractionation is in fact found to be enhanced, to different degrees, in cold, dark cores, hot cores around massive star forming regions, lukewarm cores, and warm cores ({\\it hereafter}, hot corinos) around low-mass star forming regions. In this paper, we investigate the overall differences in the deuterium chemistry between hot cores and hot corinos. We have modelled the chemistry of dense gas around low-mass and massive star forming regions using a gas-grain chemical model. We investigate the influence of varying the core density, the depletion efficiency of gaseous species on to dust grains, the collapse mode and the final mass of the protostar on the chemical evolution of star forming regions. We find that the deuterium chemistry is, in general, most sensitive to variations of the depletion efficiency on to grain surfaces, in agreement with observations. In addition, the results showed that the chemistry is more sensitive to changes in the final density of the collapsing core in hot cores than in hot corinos. Finally, we find that ratios of deuterated sulphur bearing species in dense gas around hot cores and corinos may be good evolutionary indicators in a similar way as their non deuterated counterparts.",
    "authors": [
      "Zainab Awad",
      "Serena Viti",
      "Estelle Bayet",
      "Paola Caselli"
    ],
    "publication_date": "2014-06-09T18:21:22Z",
    "arxiv_id": "http://arxiv.org/abs/1406.2272v1",
    "download_url": "https://arxiv.org/abs/1406.2272v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The impact of chemistry on the structure of high-z galaxies",
    "abstract": "To improve our understanding of high-z galaxies we study the impact of H$_{2}$ chemistry on their evolution, morphology and observed properties. We compare two zoom-in high-resolution (30 pc) simulations of prototypical $M_{\\star}\\sim 10^{10} {\\rm M}_{\\odot}$ galaxies at $z=6$. The first, \"Dahlia\", adopts an equilibrium model for H$_{2}$ formation, while the second, \"Althæa\", features an improved non-equilibrium chemistry network. The star formation rate (SFR) of the two galaxies is similar (within 50\\%), and increases with time reaching values close to 100 ${\\rm M}_{\\odot}/\\rm yr$ at $z=6$. They both have SFR-stellar mass relation consistent with observations, and a specific SFR of $\\simeq 5\\, {\\rm Gyr}^{-1}$. The main differences arise in the gas properties. The non-equilibrium chemistry determines the H$\\rightarrow$ H$_{2}$~transition to occur at densities $> 300\\,{cm}^{-3}$, i.e. about 10 times larger than predicted by the equilibrium model used for Dahlia. As a result, Althæa features a more clumpy and fragmented morphology, in turn making SN feedback more effective. Also, because of the lower density and weaker feedback, Dahlia sits $3σ$ away from the Schmidt-Kennicutt relation; Althæa, instead nicely agrees with observations. The different gas properties result in widely different observables. Althæa outshines Dahlia by a factor of 7 (15) in [CII]~$157.74\\,μ{\\rm m}$ (H$_{2}$~$17.03\\,μ{\\rm m}$) line emission. Yet, Althæa is under-luminous with respect to the locally observed [CII]-SFR relation. Whether this relation does not apply at high-z or the line luminosity is reduced by CMB and metallicity effects remains as an open question.",
    "authors": [
      "A. Pallottini",
      "A. Ferrara",
      "S. Bovino",
      "L. Vallini",
      "S. Gallerani",
      "R. Maiolino",
      "S. Salvadori"
    ],
    "publication_date": "2017-07-13T18:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/1707.04259v1",
    "download_url": "https://arxiv.org/abs/1707.04259v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "p$^\\dagger$q: A tool for prototyping many-body methods for quantum chemistry",
    "abstract": "p$^\\dagger$q is a C++ accelerated Python library designed to generate equations for many-body quantum chemistry methods and to realize proof-of-concept implementations of these equations for rapid prototyping. Central to this library is a simple interface to define strings of second-quantized creation and annihilation operators and to bring these strings to normal order with respect to either the true vacuum state or the Fermi vacuum. Tensor contractions over fully-contracted strings can then be evaluated using standard Python functions ({\\em e.g.}, \\np's einsum). Given one- and two-electron integrals these features allow for the rapid implementation and assessment of a wide array of many-body quantum chemistry methods.",
    "authors": [
      "Nicholas C. Rubin",
      "A. Eugene DePrince"
    ],
    "publication_date": "2021-06-12T20:06:56Z",
    "arxiv_id": "http://arxiv.org/abs/2106.06850v3",
    "download_url": "https://arxiv.org/abs/2106.06850v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin Transport in Organic Semiconductors: A Brief Overview of the First Eight Years",
    "abstract": "In this article we briefly review the current state of the experimental research on spin polarized transport in organic semiconductors. These systems, which include small molecular weight compounds and polymers, are central in the rapidly maturing area of organic electronics. A great deal of effort has been invested in the last eight years toward understanding spin injection and transport in organics. These developments have opened up the possibility of realizing a new family of organic spintronic devices which will blend the chemical versatility of organic materials with spintronic functionalities.",
    "authors": [
      "Kazi M. Alam",
      "Sandipan Pramanik"
    ],
    "publication_date": "2010-05-07T02:12:58Z",
    "arxiv_id": "http://arxiv.org/abs/1005.1118v1",
    "download_url": "https://arxiv.org/abs/1005.1118v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modelling the sulphur chemistry evolution in Orion KL",
    "abstract": "We study the sulphur chemistry evolution in the Orion KL along the gas and grain phases of the cloud. We investigate the processes that dominate the sulphur chemistry and to determine how physical and chemical parameters, such as the final star mass and the initial elemental abundances, influence the evolution of the hot core and of the surrounding outflows and shocked gas (the plateau). We independently modelled the chemistry evolution of both components using the time-dependent gas-grain model UCL_CHEM and considering two different phase calculations. Phase I starts with the collapsing cloud and the depletion of atoms and molecules onto grain surfaces. Phase II starts when a central protostar is formed and the evaporation from grains takes place. We show how the gas density, the gas depletion efficiency, the initial sulphur abundance, the shocked gas temperature and the different chemical paths on the grains leading to different reservoirs of sulphur on the mantles affect sulphur-bearing molecules at different evolutionary stages. We also compare the predicted column densities with those inferred from observations of the species SO, SO2, CS, OCS, H2S and H2CS. The models that reproduce the observations of the largest number of sulphur-bearing species are those with an initial sulphur abundance of 0.1 times the sulphur solar abundance and a density of at least n_H=5x10^6 cm^-3 in the shocked gas region. We conclude that most of the sulphur atoms were ionised during Phase I, consistent with an inhomogeneous and clumpy region where the UV interstellar radiation penetrates leading to sulphur ionisation. We also conclude that the main sulphur reservoir on the ice mantles was H2S. In addition, we deduce that a chemical transition currently takes place in the shocked gas, where SO and SO2 gas-phase formation reactions change from being dominated by O2 to being dominated by OH.",
    "authors": [
      "G. B. Esplugues",
      "S. Viti",
      "J. R. Goicoechea",
      "J. Cernicharo"
    ],
    "publication_date": "2014-06-09T18:41:02Z",
    "arxiv_id": "http://arxiv.org/abs/1406.2278v1",
    "download_url": "https://arxiv.org/abs/1406.2278v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Atmospheric Chemistry of Venus-like Exoplanets",
    "abstract": "We use thermodynamic calculations to model atmospheric chemistry on terrestrial exoplanets that are hot enough for chemical equilibira between the atmosphere and lithosphere, as on Venus. The results of our calculations place constraints on abundances of spectroscopically observable gases, the surface temperature and pressure, and the mineralogy of the surface. These results will be useful in planning future observations of the atmospheres of terrestrial-sized exoplanets by current and proposed space observatories such as the Hubble Space Telescope (HST), Spitzer, James Webb Space Telescope (JWST), Terrestrial Planet Finder, and Darwin.",
    "authors": [
      "Laura Schaefer",
      "Bruce Fegley"
    ],
    "publication_date": "2010-04-23T19:03:14Z",
    "arxiv_id": "http://arxiv.org/abs/1004.4203v3",
    "download_url": "https://arxiv.org/abs/1004.4203v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Jordan-Wigner gadget that reduces T count by more than 6x for quantum chemistry applications",
    "abstract": "Quantum computers have the potential to be a profoundly transformative technology, particularly in the context of quantum chemistry. However, running a chemistry application that is demonstrably useful currently requires a prohibitive number of logical operations. For example, the canonical estimate of the number of operations required to simulate the molecule FeMoco, the key component in biological nitrogen fixation, requires around $10^{15}$ logical gates. A quantum computer that is capable of applying logical operations at 1 Mhz rates would require more than 30 years to complete such a calculation. It is imperative to reduce this prohibitive runtime, by better understanding and optimising quantum algorithms, if the technology is to have commercial utility. The purpose of this paper is to introduce such an optimisation. The gadget that we introduce below affords a 6x improvement in runtime for Trotterized quantum chemistry employing the Jordan-Wigner transformation, without altering the required number of qubits.",
    "authors": [
      "Sam Pallister"
    ],
    "publication_date": "2020-04-10T16:54:50Z",
    "arxiv_id": "http://arxiv.org/abs/2004.05117v1",
    "download_url": "https://arxiv.org/abs/2004.05117v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermally Stimulated Luminescence and Current in new heterocyclic materials for Organic field transistors and organic light emitting diodes",
    "abstract": "The present work is focused on theoretical and experimental study of localised levels in organic materials suitable for light-emitting devices and field effect transistors by means of thermal techniques. In our work we focused on low molecular compounds as well as on polymers, especially of two classes of materials: oxadiazoles and quinoxalines. Both organic compounds are well know as electron transport materials in OLEDs.",
    "authors": [
      "M. Prelipceanu",
      "O. S. Prelipceanu",
      "O. G. Tudose",
      "S. Schrader"
    ],
    "publication_date": "2007-04-04T13:10:17Z",
    "arxiv_id": "http://arxiv.org/abs/0704.0568v1",
    "download_url": "https://arxiv.org/abs/0704.0568v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Topological quantum materials from the viewpoint of chemistry",
    "abstract": "Topology, a mathematical concept, has recently become a popular and truly transdisciplinary topic encompassing condensed matter physics, solid state chemistry, and materials science. Since there is a direct connection between real space, namely atoms, valence electrons, bonds and orbitals, and reciprocal space, namely bands and Fermi surfaces, via symmetry and topology, classifying topological materials within a single-particle picture is possible. Currently, most materials are classified as trivial insulators, semimetals and metals, or as topological insulators, Dirac and Weyl nodal-line semimetals, and topological metals. The key ingredients for topology are: certain symmetries, the inert pair effect of the outer electrons leading to inversion of the conduction and valence bands, and spin-orbit coupling. This review presents the topological concepts related to solids from the viewpoint of a solid-state chemist, summarizes techniques for growing single crystals, and describes basic physical property measurement techniques to characterize topological materials beyond their structure and provide examples of such materials. Finally, a brief outlook on the impact of topology in other areas of chemistry is provided at the end of the article.",
    "authors": [
      "Nitesh Kumar",
      "Satya N. Guin",
      "Kaustuv Manna",
      "Chandra Shekhar",
      "Claudia Felser"
    ],
    "publication_date": "2021-03-22T06:22:14Z",
    "arxiv_id": "http://arxiv.org/abs/2103.11606v1",
    "download_url": "https://arxiv.org/abs/2103.11606v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ice origins of OCS and chemistry of CS2-bearing ice mantles",
    "abstract": "Understanding the formation of carbonyl sulfide (OCS) in interstellar ices is key to constrain the sulfur chemistry in the interstellar medium (ISM), since it is the only ice S-bearing molecule securely detected thus far. Two general pathways for OCS formation have been proposed: sulfurization of CO (CO+S) and oxidation of CS (CS+O), but their relative contribution in interstellar ices remains unconstrained. We have evaluated the contribution of both pathways to OCS formation upon energetic processing in isotopically-labeled CO2:CS2 and CO:CS2 ice samples at 7-50 K. Our results indicated that formation of OCS through the CS+O pathway was more favorable than through the CO+S pathway, as previously suggested by theoretical calculations. In addition, its relative contribution increased at higher temperatures. Therefore, this pathway could play a role in the ice formation of OCS, especially in warm regions where CO is expected to be preferentially in the gas phase. At the same time, we have explored the chemistry of CS2-bearing, CO2-, CO-, and also H2O-rich ices, that could be relevant to the sulfur interstellar chemistry. We observed formation of a variety of S-bearing products in addition to OCS, including SO2, C3S2, and S2. However, a significant fraction of sulfur was not detected at the end of the experiments, and could be locked in long, undetectable sulfur allotropes, one of the potential carriers of the missing sulfur in the dense ISM.",
    "authors": [
      "Rafael Martin-Domenech",
      "Karin I. Öberg",
      "Guillermo M. Muñoz Caro",
      "Héctor Carrascosa de Lucas",
      "Asunción Fuente",
      "Mahesh Rajappan"
    ],
    "publication_date": "2024-10-10T09:13:23Z",
    "arxiv_id": "http://arxiv.org/abs/2410.07736v1",
    "download_url": "https://arxiv.org/abs/2410.07736v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhancing Chemistry on Quantum Computers with Fermionic Linear Optical Simulation",
    "abstract": "We present and open source a quantum circuit simulator tailored to chemistry applications. More specifically, our simulator can compute the Born-rule probabilities of samples obtained from circuits containing passive fermionic linear optical elements and controlled-phase gates. We support both approximate and exact calculation of probabilities, and for approximate probability calculation, our simulator's runtime is exponential only in the magnitudes of the circuit's controlled-phase gate angles. This makes our simulator useful for simulating certain systems that are beyond the reach of conventional state vector methods. We demonstrate our simulator's utility by simulating the local cluster unitary Jastrow (LUCJ) ansatz and integrating it with sample-based quantum diagonalization (SQD) to improve the accuracy of molecular ground-state energy estimates. Applied to a 52-qubit $N_2$ system, we observe accuracy improvements of up to $46\\%$ over the baseline SQD implementation with negligible computational overhead. More generally, we highlight a regime in which our simulator achieves substantially superior latency scaling and exponentially superior memory scaling over a tensor network simulator and a state vector simulator. As an efficient and flexible tool for simulating quantum chemistry circuits, our simulator enables new opportunities for enhancing near-term quantum algorithms in chemistry and related domains.",
    "authors": [
      "Zack Hassman",
      "Oliver Reardon-Smith",
      "Gokul Subramanian Ravi",
      "Frederic T. Chong",
      "Kevin J. Sung"
    ],
    "publication_date": "2025-11-16T02:05:16Z",
    "arxiv_id": "http://arxiv.org/abs/2511.12416v2",
    "download_url": "https://arxiv.org/abs/2511.12416v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum chemistry calculations on a trapped-ion quantum simulator",
    "abstract": "Quantum-classical hybrid algorithms are emerging as promising candidates for near-term practical applications of quantum information processors in a wide variety of fields ranging from chemistry to physics and materials science. We report on the experimental implementation of such an algorithm to solve a quantum chemistry problem, using a digital quantum simulator based on trapped ions. Specifically, we implement the variational quantum eigensolver algorithm to calculate the molecular ground state energies of two simple molecules and experimentally demonstrate and compare different encoding methods using up to four qubits. Furthermore, we discuss the impact of measurement noise as well as mitigation strategies and indicate the potential for adaptive implementations focused on reaching chemical accuracy, which may serve as a cross-platform benchmark for multi-qubit quantum simulators.",
    "authors": [
      "Cornelius Hempel",
      "Christine Maier",
      "Jonathan Romero",
      "Jarrod McClean",
      "Thomas Monz",
      "Heng Shen",
      "Petar Jurcevic",
      "Ben Lanyon",
      "Peter Love",
      "Ryan Babbush",
      "Alan Aspuru-Guzik",
      "Rainer Blatt",
      "Christian Roos"
    ],
    "publication_date": "2018-03-27T18:00:03Z",
    "arxiv_id": "http://arxiv.org/abs/1803.10238v2",
    "download_url": "https://arxiv.org/abs/1803.10238v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Dawn of Chemistry",
    "abstract": "Within the precise cosmological framework provided by the Lambda-Cold Dark Matter model and standard Big Bang nucleosynthesis, the chemical evolution of the pregalactic gas can now be followed with accuracy limited only by the uncertainties on the reaction rates. Starting during the recombination era, the formation of the first molecules and molecular ions containing hydrogen, deuterium, helium, and lithium was severely hindered by the low density of the expanding universe, the intensity of the cosmic radiation field, and the absence of solid catalyzers. Molecular hydrogen and deuterated hydrogen, the most abundant species formed in the gas phase prior to structure formation, played a fundamental role in the cooling of the gas clouds that gave birth to the first stellar generation, contributing to determine the scale of fragmentation. Primordial molecules also interacted with the photons of the cosmic background via resonant scattering, absorption and emission. In this review we examine the current status of the chemistry of the early universe and discuss the most relevant reactions for which uncertainties still exist from theory or laboratory experiments. The prospects for detecting spectral distortions or spatial anisotropies due to the first atoms and molecules are also addressed.",
    "authors": [
      "Daniele Galli",
      "Francesco Palla"
    ],
    "publication_date": "2012-11-14T14:47:38Z",
    "arxiv_id": "http://arxiv.org/abs/1211.3319v1",
    "download_url": "https://arxiv.org/abs/1211.3319v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PAH chemistry and IR emission from circumstellar disks",
    "abstract": "Aims. The chemistry of, and infrared (IR) emission from, polycyclic aromatic hydrocarbons (PAHs) in disks around Herbig Ae/Be and T Tauri stars are investigated. The equilibrium distribution of the PAHs over all accessible charge/hydrogenation states depends on the size and shape of the PAHs and on the physical properties of the star and surrounding disk.\n  Methods. A chemistry model is created to calculate this equilibrium distribution. Destruction of PAHs by ultraviolet (UV) photons, possibly in multi-photon absorption events, is taken into account. The chemistry model is coupled to a radiative transfer code to provide the physical parameters and to combine the PAH emission with the spectral energy distribution (SED) from the star+disk system.\n  Results. Normally hydrogenated PAHs in Herbig Ae/Be disks account for most of the observed PAH emission, with neutral and positively ionized species contributing in roughly equal amounts. Close to the midplane, the PAHs are more strongly hydrogenated and negatively ionized, but these species do not contribute to the overall emission because of the low UV/optical flux deep inside the disk. PAHs of 50 carbon atoms are destroyed out to 100 AU in the disk's surface layer, and the resulting spatial extent of the emission does not agree well with observations. Rather, PAHs of about 100 carbon atoms or more are predicted to cause most of the observed emission. The emission is extended on a scale similar to that of the size of the disk. Furthermore, the emission from T Tauri disks is much weaker and concentrated more towards the central star than that from Herbig Ae/Be disks. Positively ionized PAHs are predicted to be largely absent in T Tauri disks because of the weaker radiation field.",
    "authors": [
      "R. Visser",
      "V. C. Geers",
      "C. P. Dullemond",
      "J. -C. Augereau",
      "K. M. Pontoppidan",
      "E. F. van Dishoeck"
    ],
    "publication_date": "2007-01-22T11:33:24Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0701606v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0701606v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ubiquitous Aromatic Carbon Chemistry at the Earliest Stages of Star Formation",
    "abstract": "Benzonitrile ($c$-C$_6$H$_5$CN), a polar proxy for benzene ($c$-C$_6$H$_6$}), has the potential to serve as a highly convenient radio probe for aromatic chemistry, provided this ring can be found in other astronomical sources beyond the molecule-rich prestellar cloud TMC-1 where it was first reported by McGuire et al. in 2018. Here we present radio astronomical evidence of benzonitrile in four additional pre-stellar, and possibly protostellar, sources: Serpens 1A, Serpens 1B, Serpens 2, and MC27/L1521F. These detections establish benzonitrile is not unique to TMC-1; rather aromatic chemistry appears to be widespread throughout the earliest stages of star formation, likely persisting at least to the initial formation of a protostar. The abundance of benzonitrile far exceeds predictions from models which well reproduce the abundances of carbon chains, such as HC$_7$N, a cyanpolyyne with the same heavy atoms, indicating the chemistry responsible for planar carbon structures (as opposed to linear ones) in primordial sources is favorable but not well understood. The abundance of benzonitrile relative to carbon-chain molecules displays sizable variations between sources within the Taurus and Serpens clouds, implying the importance of physical conditions and initial elemental reservoirs of the clouds themselves.",
    "authors": [
      "Andrew M. Burkhardt",
      "Ryan A. Loomis",
      "Christopher N. Shingledecker",
      "Kin Long Kelvin Lee",
      "Anthony J. Remijan",
      "Michael C. McCarthy",
      "Brett A. McGuire"
    ],
    "publication_date": "2020-09-28T18:00:24Z",
    "arxiv_id": "http://arxiv.org/abs/2009.13548v1",
    "download_url": "https://arxiv.org/abs/2009.13548v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simultaneous measurement of organic scintillator response to carbon and proton recoils",
    "abstract": "Background: Organic scintillators are widely used for neutron detection in both basic nuclear physics and applications. While the proton light yield of organic scintillators has been extensively studied, measurements of the light yield from neutron interactions with carbon nuclei are scarce. Purpose: Demonstrate a new approach for the simultaneous measurement of the proton and carbon light yield of organic scintillators. Provide new carbon light yield data for the EJ-309 liquid and EJ-204 plastic organic scintillators. Method: A 33~MeV $^{2}$H$^{+}$ beam from the 88-Inch Cyclotron at Lawrence Berkeley National Laboratory was impinged upon a 3-mm-thick Be target to produce a high-flux, broad-spectrum neutron beam. The double time-of-flight technique was extended to simultaneously measure the proton and carbon light yield of the organic scintillators, wherein the light output associated with the recoil particle was determined using $np$ and $n$C elastic scattering kinematics. Results: The proton and carbon light yield relations of the EJ-309 liquid and EJ-204 plastic organic scintillators were measured over a recoil energy range of approximately 0.3 to 1~MeV and 2 to 5~MeV, respectively for EJ-309, and 0.2 to 0.5~MeV and 1 to 4~MeV, respectively for EJ-204. Conclusions: These data provide new insight into the ionization quenching effect in organic scintillators and key input for simulation of the response of organic scintillators for both basic science and a broad range of applications.",
    "authors": [
      "T. A. Laplace",
      "B. L. Goldblum",
      "J. J. Manfredi",
      "J. A. Brown",
      "D. L. Bleuel",
      "C. A. Brand",
      "G. Gabella",
      "J. Gordon",
      "E. Brubaker"
    ],
    "publication_date": "2021-07-12T21:50:12Z",
    "arxiv_id": "http://arxiv.org/abs/2107.05752v1",
    "download_url": "https://arxiv.org/abs/2107.05752v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A possible mechanism for the negative capacitance observed in organic devices",
    "abstract": "The mechanism of negative capacitance, e.g. inductance, induced by a sufficient electrical field in the organic device is investigated. The cations in organic bulk are proposed to be driven by the applied voltage and to accumulate at the interface, and further to generate the surface states or media states. These states result in a larger junction current through the device, indicating the negative capacitances which are simulated in three situations: impedance spectrum, capacitance measurement and current response. This simple kinetic model may be helpful to understand why the negative capacitance phenomenon is observed in various organic devices.",
    "authors": [
      "X. Q. Wang",
      "C. B. Cai"
    ],
    "publication_date": "2012-10-30T05:09:11Z",
    "arxiv_id": "http://arxiv.org/abs/1210.7904v2",
    "download_url": "https://arxiv.org/abs/1210.7904v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simple molecules and complex chemistry in a protoplanetary disk: A JWST investigation of the highly inclined disk d216-0939",
    "abstract": "While the number of detected molecules, particularly complex organic molecules, in the solid-state in astrophysical environments is still rather limited, laboratory experiments and astrochemical models predict many potential candidates. Detection of molecules in protoplanetary disks provides a bridge between the chemical evolution of the interstellar medium and the chemistry of planets and their atmospheres. The excellent spectral sensitivity, broad wavelength coverage and high spatial resolution of the James Webb Space Telescope (JWST) allows for making progress in exploring chemical compositions of various astrophysical environments including planet-forming disks. They are a prerequisite for probing the disk content by means of sensitive absorption studies. In this paper, we present initial results of the JWST Cycle 1 GO program 1741 on d216-0939, a highly inclined TTauri disk located in the outskirts of the Orion Nebula Cluster. We utilise the NIRSpec and MIRI integral field unit spectrographs to cover its spectrum from 1.7 to 28~$μ$m. In the d216-0939 disk, we give assignments of the composition of silicate grains. We unambiguously detect solid-state features of H$_2$O, CO$_2$, $^{13}$CO$_2$, CO, OCN$^-$, and tentatively OCS; species that had been detected recently also in other circumstellar disks. For the first time in disks, we provide unique detections of ices carrying NH$_4^+$ and the complex organic molecule ammonium carbamate (NH$_4^+$NH$_2$COO$^-$). The latter detections speak for a very efficient NH$_3$ chemistry in the disk. We also show the very important role of scattering in the analysis of observational spectra of highly inclined disks.",
    "authors": [
      "Alexey Potapov",
      "Hendrik Linz",
      "Jeroen Bouwman",
      "Will Rocha",
      "Johannes Martin",
      "Sebastian Wolf",
      "Thomas Henning",
      "Hiroshi Terada"
    ],
    "publication_date": "2025-02-27T19:19:41Z",
    "arxiv_id": "http://arxiv.org/abs/2502.20472v1",
    "download_url": "https://arxiv.org/abs/2502.20472v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhanced formation of interstellar complex organic molecules on carbon monoxide ice",
    "abstract": "We investigate the role of carbon monoxide ice in the chemical evolution of prestellar cores using astrochemical rate equation models. We constrain the ratios of the binding energies on CO ice and H$_{2}$O ice for a series of adsorbates deemed important in diffusive chemistry on H$_{2}$O ices. We later include these ratios in our chemical reaction network model, where the binding and diffusion energies of icy species vary as a function of the surface composition. When the surface coverage of CO increases, the model shows an enhancement of O-bearing complex organic molecules, especially those formed from the intermediate products of CO hydrogenation (e.g. HCO) and CH$_{3}$/CH$_{2}$. Because the binding energy of CH$_{3}$/CH$_{2}$ is in the right range, its diffusion rate increases significantly with CO coverage. At $T>$14 K and with less influence, enhanced diffusion of HCO also contributes to the increase of the abundances of COM. We find, however, that chemistry is not always enhanced on CO ice and that the temperature and cosmic ray ionization rate of each astronomical object is crucial for this particular chemistry, revealing a highly non-trivial behavior that needs to be addressed on a per-case basis. Our results are highly relevant in the context of interstellar ice observations with JWST.",
    "authors": [
      "Germán Molpeceres",
      "Kenji Furuya",
      "Yuri Aikawa"
    ],
    "publication_date": "2024-05-31T09:00:43Z",
    "arxiv_id": "http://arxiv.org/abs/2405.20707v1",
    "download_url": "https://arxiv.org/abs/2405.20707v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The mixed chemistry phenomenon in Galactic Bulge PNe",
    "abstract": "We investigate the dual-dust chemistry (DDC) phenomenon in PNe and discuss reasons for its occurrence, by analyzing Spitzer/IRS spectra of a sample of 40 Galactic PNe among which 26 belong to the Galactic Bulge (GB). The mixed chemistry is derived from the simultaneous detection of PAH features in the 6-14 micron range and crystalline silicates (CS) beyond 20 microns in the Spitzer/IRS spectra. Out of the 26 PNe observed in the GB, 21 show signatures of DDC. Our observations reveal that the simultaneous presence of O- and C-rich dust features in the IR spectra of [WC]-type PNe is not restricted to late/cool [WC]-type stars, as previously suggested in the literature, but is a common feature associated with all [WC]-type PNe. Surprisingly, we found that the DDC is seen also in all observed wels, as well as in other PNe with central stars being neither [WC] nor wels. Most sources observed display CS features in their spectra, with only a few PNe exhibiting, in addition, amorphous silicate bands. We appear to detect a recent change of chemistry at the end of the AGB evolution in the low-mass, high-metallicity population of GB PNe observed. The deficit of C-rich AGB stars in this environment suggests that the process of PAH formation in PNe occurs at the very end of the AGB phase. In addition, the population of low-mass, O-rich AGB stars in the GB, do not exhibit CS features in their spectra. Thus, the high detection rate of DDC that we find cannot be explained by long-lived O-rich (primordial or circumbinary) disks. Our most plausible scenario is a final thermal pulse on the AGB (or just after), which could produce enhanced mass loss, capable of removing/mixing (sometimes completely) the remaining H-rich envelope and exposing the internal C-rich layers, and generating shocks responsible for the silicate crystallization.",
    "authors": [
      "J. V. Perea-Calderon",
      "D. A. Garcia-Hernandez",
      "P. Garcia-Lario",
      "R. Szczerba",
      "M. Bobrowsky"
    ],
    "publication_date": "2009-02-06T10:17:02Z",
    "arxiv_id": "http://arxiv.org/abs/0902.1049v1",
    "download_url": "https://arxiv.org/abs/0902.1049v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Much ado about MOFs: Metal-Organic-Frameworks as Quantum Materials",
    "abstract": "Metal-organic frameworks (MOFs) are a highly tunable class of crystalline materials where metal atoms or clusters are connected by organic linkers. They offer a versatile platform for exploring quantum phenomena such as entangled magnetism, superconductivity, and topology. Particularly for magnetism, their modular chemistry enables extensive control over magnetic interactions, spin magnitudes, lattice geometries, and even light-responsiveness, making them a uniquely adaptable platform. However, despite their promise, their low-temperature behavior and magnetic properties remain largely unexplored and represent an underappreciated opportunity in quantum materials research. With potential applications ranging from quantum computation to energy transfer, we believe that MOFs and particularly magnetic MOFs offer a vast and largely untapped frontier for transformative discoveries and high-impact quantum materials research.",
    "authors": [
      "Natalia Drichko",
      "V. Sara Thoi",
      "N. Peter Armitage"
    ],
    "publication_date": "2025-09-20T14:13:03Z",
    "arxiv_id": "http://arxiv.org/abs/2509.16703v2",
    "download_url": "https://arxiv.org/abs/2509.16703v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hall Transport in Organic Semiconductors",
    "abstract": "We establish a universal theory to understand quasiparticle Hall effects and transverse charge-carrier transport in organic semiconductors. The simulations are applied to organic crystals inspired by rubrene and cover multiple transport regimes. This includes calculations of the intrinsic Hall conductivity in pristine crystals, which are connected with a simple description of semi-classical electron transport that involves the concept of closed electronic orbits in the band structure, which can be easily calculated in density functional theory. Furthermore, this framework is employed to simulate temperature-dependent longitudinal and transverse mobilities in rubrene. These simulations are compared to experimental findings, providing insights into these results by characterizing the non-ideality of the Hall effect due to the influence of vibrational disorder. We finally investigate the conditions for the observation of Shubnikov-de Haas oscillations in the longitudinal resistivity and quantized Hall plateaus in the transverse resistivity. A clear picture why this is not observed in rubrene is developed. These insights into classical and quantum Hall effects and their intermediates in organic semiconductors establish a blueprint for future explorations in similar systems.",
    "authors": [
      "Michel Panhans",
      "Frank Ortmann"
    ],
    "publication_date": "2024-08-19T20:53:41Z",
    "arxiv_id": "http://arxiv.org/abs/2408.10412v1",
    "download_url": "https://arxiv.org/abs/2408.10412v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Software-Hardware Co-Optimization for Computational Chemistry on Superconducting Quantum Processors",
    "abstract": "Computational chemistry is the leading application to demonstrate the advantage of quantum computing in the near term. However, large-scale simulation of chemical systems on quantum computers is currently hindered due to a mismatch between the computational resource needs of the program and those available in today's technology. In this paper we argue that significant new optimizations can be discovered by co-designing the application, compiler, and hardware. We show that multiple optimization objectives can be coordinated through the key abstraction layer of Pauli strings, which are the basic building blocks of computational chemistry programs. In particular, we leverage Pauli strings to identify critical program components that can be used to compress program size with minimal loss of accuracy. We also leverage the structure of Pauli string simulation circuits to tailor a novel hardware architecture and compiler, leading to significant execution overhead reduction by up to 99%. While exploiting the high-level domain knowledge reveals significant optimization opportunities, our hardware/software framework is not tied to a particular program instance and can accommodate the full family of computational chemistry problems with such structure. We believe the co-design lessons of this study can be extended to other domains and hardware technologies to hasten the onset of quantum advantage.",
    "authors": [
      "Gushu Li",
      "Yunong Shi",
      "Ali Javadi-Abhari"
    ],
    "publication_date": "2021-05-15T03:45:26Z",
    "arxiv_id": "http://arxiv.org/abs/2105.07127v1",
    "download_url": "https://arxiv.org/abs/2105.07127v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sulfur chemistry in protoplanetary disks: CS and H2CS",
    "abstract": "The nature and abundance of sulfur chemistry in protoplanetary disks (PPDs) may impact the sulfur inventory on young planets and therefore their habitability. PPDs also present an interesting test bed for sulfur chemistry models, since each disk present a diverse set of environments. In this context, we present new sulfur molecule observations in PPDs, and new S-disk chemistry models. With ALMA we observed the CS 5-4 rotational transition toward five PPDs (DM Tau, DO Tau, CI Tau, LkCa 15, MWC 480), and the CS 6-5 transition toward three PPDs (LkCa 15, MWC 480 and V4046 Sgr). Across this sample, CS displays a range of radial distributions, from centrally peaked, to gaps and rings. We also present the first detection in PPDs of $^{13}$CS 6-5 (LkCa 15 and MWC 480), C$^{34}$S 6-5 (LkCa 15), and H$_2$CS $8_{17}-7_{16}$, $9_{19}-8_{18}$ and $9_{18}-8_{17}$ (MWC 480) transitions. Using LTE models to constrain column densities and excitation temperatures, we find that either $^{13}$C and $^{34}$S are enhanced in CS, or CS is optically thick despite its relatively low brightness temperature. Additional lines and higher spatial resolution observations are needed to distinguish between these scenarios. Assuming CS is optically thin, CS column density model predictions reproduce the observations within a factor of a few for both MWC 480 and LkCa 15. However, the model underpredicts H$_2$CS by 1-2 orders of magnitude. Finally, comparing the H$_2$CS/CS ratio observed toward the MWC~480 disk and toward different ISM sources, we find the closest match with prestellar cores.",
    "authors": [
      "Romane Le Gal",
      "Karin I. Öberg",
      "Ryan Loomis",
      "Jamila Pegues",
      "Jennifer B. Bergner"
    ],
    "publication_date": "2019-03-26T18:29:35Z",
    "arxiv_id": "http://arxiv.org/abs/1903.11105v1",
    "download_url": "https://arxiv.org/abs/1903.11105v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Augmented Reality for Human-Swarm Interaction in a Swarm-Robotic Chemistry Simulation",
    "abstract": "We present a method to register individual members of a robotic swarm in an augmented reality display while showing relevant information about swarm dynamics to the user that would be otherwise hidden. Individual swarm members and clusters of the same group are identified by their color, and by blinking at a specific time interval that is distinct from the time interval at which their neighbors blink. We show that this problem is an instance of the graph coloring problem, which can be solved in a distributed manner in O(log(n)) time. We demonstrate our approach using a swarm chemistry simulation in which robots simulate individual atoms that form molecules following the rules of chemistry. Augmented reality is then used to display information about the internal state of individual swarm members as well as their topological relationship, corresponding to molecular bonds.",
    "authors": [
      "Sumeet Batra",
      "John Klingner",
      "Nikolaus Correll"
    ],
    "publication_date": "2019-12-02T17:24:10Z",
    "arxiv_id": "http://arxiv.org/abs/1912.00951v1",
    "download_url": "https://arxiv.org/abs/1912.00951v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Review of Novel Approaches to Organic Liquid Scintillators in Neutrino Physics",
    "abstract": "Organic liquid scintillators have been used for decades in many neutrino physics experiments. They are particularly suited for the detection of low-energy neutrinos where energy and timing information is required. Organic liquid scintillators exhibit advantages such as high light yield, cost effectiveness, radio purity, and more. However, they also entail disadvantages, most prominently a lack of vertex resolution and particle identification. In recent years, various novel ideas have emerged to improve the performance of organic liquid scintillators. In this review, novel approaches to organic liquid scintillators in neutrino experiments as of 2022 are reviewed and their prospects and applications compared.",
    "authors": [
      "Stefan Schoppmann"
    ],
    "publication_date": "2022-12-21T20:23:05Z",
    "arxiv_id": "http://arxiv.org/abs/2212.11341v1",
    "download_url": "https://arxiv.org/abs/2212.11341v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ultrafast flow of interacting organic polaritons",
    "abstract": "The strong-coupling of an excitonic transition with an electromagnetic mode results in composite quasi-particles called exciton-polaritons, which have been shown to combine the best properties of their bare components in semiconductor microcavities. However, the physics and applications of polariton flows in organic materials and at room temperature are still unexplored because of the poor photon confinement in such structures. Here we demonstrate that polaritons formed by the hybridization of organic excitons with a Bloch Surface Wave are able to propagate for hundreds of microns showing remarkable third-order nonlinear interactions upon high injection density. These findings pave the way for the studies of organic nonlinear light-matter fluxes and for a technological promising route of dissipation-less on-chip polariton devices working at room temperature.",
    "authors": [
      "Giovanni Lerario",
      "Dario Ballarini",
      "Antonio Fieramosca",
      "Alessandro Cannavale",
      "Armando Genco",
      "Federica Mangione",
      "Salvatore Gambino",
      "Lorenzo Dominici",
      "Milena De Giorgi",
      "Giuseppe Gigli",
      "Daniele Sanvitto"
    ],
    "publication_date": "2015-02-02T20:06:19Z",
    "arxiv_id": "http://arxiv.org/abs/1502.00602v2",
    "download_url": "https://arxiv.org/abs/1502.00602v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The effects of atmospheric entry heating on organic matter in interplanetary dust particles",
    "abstract": "Interplanetary dust particles (IDPs) were likely major sources of extraterrestrial organics to the early Earth. However, IDPs experience heating to > 500 $°$C for up to several seconds during atmospheric entry. In this study, we aim to understand the effects of atmospheric entry heating on the dominant organic component in IDPs by conducting flash heating experiments (4 s to 400 °C, 600 °C, 800 °C, and 1000 °C) on insoluble organic matter (IOM) extracted from the meteorite Cold Bokkeveld (CM2). For each of the experimental charges, the bulk isotopic compositions of H, N, and C were analyzed using IRMS, the H isotopic heterogeneities (occurrence of hotspots) of the samples were measured by NanoSIMS, and the functional group chemistry and ordering of the IOM was evaluated using FTIR and Raman spectroscopy, respectively. IOM in particles heated to > 600 °C experienced loss of isotopically heavy, labile H and N groups, resulting in decreases in bulk $δ$D, $δ$15N, H/C and, upon heating > 800 °C, in N/C. The H heterogeneity was not greatly affected by flash heating to < 600 °C, although the hotspots tended to be less isotopically anomalous in the 600 °C sample than in the 400 °C sample. However, the hotspots all but disappeared in the 800 °C sample. Loss of C=O groups occurred at 800 °C. Based on the Raman G-band characteristics, the heating resulted in increased ordering of the polyaromatic component of the IOM. The data presented in this study show that all aspects of the composition of IOM in IDPs are affected by atmospheric entry heating. Modelling and temperature estimates from stepwise release of He has shown that most IDPs are heated to > 500°C (Love and Brownlee, 1991; Nier and Schlutter, 1993), hence, atmospheric entry heating is expected to have altered the organic matter in most IDPs.",
    "authors": [
      "My E. I. Riebe",
      "Dionysis I. Foustoukos",
      "Conel M. O'D. Alexander",
      "Andrew Steele",
      "George D. Cody",
      "Bjorn Mysen",
      "Larry R. Nittler"
    ],
    "publication_date": "2020-01-10T15:40:10Z",
    "arxiv_id": "http://arxiv.org/abs/2001.03516v1",
    "download_url": "https://arxiv.org/abs/2001.03516v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MOOSE-Chem: Large Language Models for Rediscovering Unseen Chemistry Scientific Hypotheses",
    "abstract": "Scientific discovery plays a pivotal role in advancing human society, and recent progress in large language models (LLMs) suggests their potential to accelerate this process. However, it remains unclear whether LLMs can autonomously generate novel and valid hypotheses in chemistry. In this work, we investigate whether LLMs can discover high-quality chemistry hypotheses given only a research background-comprising a question and/or a survey-without restriction on the domain of the question. We begin with the observation that hypothesis discovery is a seemingly intractable task. To address this, we propose a formal mathematical decomposition grounded in a fundamental assumption: that most chemistry hypotheses can be composed from a research background and a set of inspirations. This decomposition leads to three practical subtasks-retrieving inspirations, composing hypotheses with inspirations, and ranking hypotheses - which together constitute a sufficient set of subtasks for the overall scientific discovery task. We further develop an agentic LLM framework, MOOSE-Chem, that is a direct implementation of this mathematical decomposition. To evaluate this framework, we construct a benchmark of 51 high-impact chemistry papers published and online after January 2024, each manually annotated by PhD chemists with background, inspirations, and hypothesis. The framework is able to rediscover many hypotheses with high similarity to the groundtruth, successfully capturing the core innovations-while ensuring no data contamination since it uses an LLM with knowledge cutoff date prior to 2024. Finally, based on LLM's surprisingly high accuracy on inspiration retrieval, a task with inherently out-of-distribution nature, we propose a bold assumption: that LLMs may already encode latent scientific knowledge associations not yet recognized by humans.",
    "authors": [
      "Zonglin Yang",
      "Wanhao Liu",
      "Ben Gao",
      "Tong Xie",
      "Yuqiang Li",
      "Wanli Ouyang",
      "Soujanya Poria",
      "Erik Cambria",
      "Dongzhan Zhou"
    ],
    "publication_date": "2024-10-09T17:19:58Z",
    "arxiv_id": "http://arxiv.org/abs/2410.07076v6",
    "download_url": "https://arxiv.org/abs/2410.07076v6",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Engineering analog quantum chemistry Hamiltonians using cold atoms in optical lattices",
    "abstract": "Using quantum systems to efficiently solve quantum chemistry problems is one of the long-sought applications of near-future quantum technologies. In a recent work, ultra-cold fermionic atoms have been proposed for these purposes by showing us how to simulate in an analog way the quantum chemistry Hamiltonian projected in a lattice basis set. Here, we continue exploring this path and go beyond these first results in several ways. First, we numerically benchmark the working conditions of the analog simulator, and find less demanding experimental setups where chemistry-like behaviour in three-dimensions can still be observed. We also provide a deeper understanding of the errors of the simulation appearing due to discretization and finite size effects and provide a way to mitigate them. Finally, we benchmark the simulator characterizing the behaviour of two-electron atoms (He) and molecules (HeH$^+$) beyond the example considered in the original work.",
    "authors": [
      "Javier Argüello-Luengo",
      "Tao Shi",
      "Alejandro González-Tudela"
    ],
    "publication_date": "2020-11-28T11:23:06Z",
    "arxiv_id": "http://arxiv.org/abs/2011.14113v2",
    "download_url": "https://arxiv.org/abs/2011.14113v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Crystal chemistry search of multiferroics with the stereochemically active lone pair",
    "abstract": "On the basis of our previous studies of magnetoelectric ordering of BiFeO3, TbMnO3, TbMn2O5 and BiMn2O5 we formulate the crystal chemistry criteria for the search of multiferroics and reveal potential multiferroics Pb2Cu(OH)4Cl2, Pb5Cr3F19, Mn(SeO3){\\dot}H2O and BiPbSr2MnO6 each containing the ion with a lone pair.",
    "authors": [
      "L. M. Volkova",
      "D. V. Marinin"
    ],
    "publication_date": "2011-03-30T05:58:52Z",
    "arxiv_id": "http://arxiv.org/abs/1103.5827v1",
    "download_url": "https://arxiv.org/abs/1103.5827v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Transformation of a Metal-organic Framework for Tuned Catalytic Activity",
    "abstract": "Metal-organic frameworks (MOFs) are an attractive substrate for catalytic reactions due to the high area density of reaction sites and the ability to tailor an array of material attributes. This study focuses on a thermally stable crystalline UiO-66(Zr) MOF structure and the modulation of the electronic structure using two strategies to improve the catalytic conversion and selectivity of benzene alcohol to benzedehyate. Those two strategies include the functionalization of the organic struts with branched ligands and manually creating structural defects with unsaturated organic linkers. A combination of computational and experimental results provide evidence of improved catalytic activity of MOFs via these two approaches. Functional groups attached to the main organic strut modify the electronic environment of the photoactive aromatic carbon and thereby decrease the optical band gap by 1eV. Whereas the introduction of structural defects due to the organic linker desaturation provided a shift in the HUMO as a result of the decrease in strut coordination with the inorganic knots.",
    "authors": [
      "Jiangtian Li",
      "Terence Musho",
      "Joeseph Bright",
      "Nianqiang Wu"
    ],
    "publication_date": "2017-04-23T00:27:30Z",
    "arxiv_id": "http://arxiv.org/abs/1704.06863v1",
    "download_url": "https://arxiv.org/abs/1704.06863v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Adapting Atmospheric Chemistry Components for Efficient GPU Accelerators",
    "abstract": "Atmospheric models demand a lot of computational power and solving the chemical processes is one of its most computationally intensive components. This work shows how to improve the computational performance of the Multiscale Online Nonhydrostatic AtmospheRe CHemistry model (MONARCH), a chemical weather prediction system developed by the Barcelona Supercomputing Center. The model implements the new flexible external package Chemistry Across Multiple Phases (CAMP) for the solving of gas- and aerosol-phase chemical processes, that allows multiple chemical processes to be solved simultaneously as a single system. We introduce a novel strategy to simultaneously solve multiple instances of a chemical mechanism, represented in the model as grid-cells, obtaining a speedup up to 9x using thousands of cells. In addition, we present a GPU strategy for the most time-consuming function of CAMP. The GPU version achieves up to 1.2x speedup compared to CPU. Also, we optimize the memory access in the GPU to increase its speedup up to 1.7x.",
    "authors": [
      "Christian Guzman Ruiz",
      "Matthew Dawson",
      "Mario C. Acosta",
      "Oriol Jorba",
      "Eduardo Cesar Galobardes",
      "Carlos Pérez García-Pando",
      "Kim Serradell"
    ],
    "publication_date": "2024-12-13T18:04:18Z",
    "arxiv_id": "http://arxiv.org/abs/2501.00011v1",
    "download_url": "https://arxiv.org/abs/2501.00011v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tunneling anisotropic magnetoresistance in organic spin valves",
    "abstract": "We report the observation of tunneling anisotropic magnetoresistance (TAMR) in an organic spin-valve-like structure with only one ferromagnetic electrode. The device is based on a new high mobility perylene diimide-based n-type organic semiconductor. The effect originates from the tunneling injection from the LSMO contact and can thus occur even for organic layers which are too thick to support the assumption of tunneling through the layer. Magnetoresistance measurements show a clear spin-valve signal, with the typical two step switching pattern caused by the magnetocrystalline anisotropy of the epitaxial magnetic electrode.",
    "authors": [
      "M. Gruenewald",
      "M. Wahler",
      "M. Michelfeit",
      "C. Gould",
      "R. Schmidt",
      "F. Wuerthner",
      "G. Schmidt",
      "L. W. Molenkamp"
    ],
    "publication_date": "2009-05-28T08:34:44Z",
    "arxiv_id": "http://arxiv.org/abs/0905.4573v2",
    "download_url": "https://arxiv.org/abs/0905.4573v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mixed valency and site-preference chemistry for Cerium and its compounds: A predictive DFT study",
    "abstract": "Cerium and its technologically relevant compounds are examples of anomalous mixed valency, originating from two competing oxidation states -- itinerant Ce$^{3+}$ and localized Ce$^{4+}$. Under applied stress, anomalous transitions are observed but not well understood. Here we treat mixed valency as an \"alloy\" involving two valences with competing and numerous site-occupancy configurations, and we use density functional theory with Hubbard U ($i.e.$, DFT+U) to evaluate the effective valence and predict properties, including controlling valence by pseudo-ternary alloying. For Ce and its compounds, such as (Ce-La)$_2$(Fe-Co)$_{14}$B permanent magnets, we find a stable mixed-valent $α$-state near the spectroscopic value of $ν_s=3.53$. Ce valency in compounds depends on its steric volume and local chemistry; for La doping, Ce-valency shifts towards $γ$-like Ce$^{3+}$, as expected from steric volume; for Co doping, valency depends on local Ce-site chemistry and steric volume. Our approach captures the key origins of anomalous valency and site-preference chemistry in complex compounds.",
    "authors": [
      "Aftab Alam",
      "D D Johnson"
    ],
    "publication_date": "2013-11-05T04:11:33Z",
    "arxiv_id": "http://arxiv.org/abs/1311.0962v1",
    "download_url": "https://arxiv.org/abs/1311.0962v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Factor groups, semidirect product and quantum chemistry",
    "abstract": "In this paper we prove some general theorems about representations of finite groups arising from the inner semidirect product of groups. We show how these results can be used for standard applications of group theory in quantum chemistry through the orthogonality relations for the characters of irreducible representations. In this context, conditions for transitions between energy levels, projection operators and basis functions were determined. This approach applies to composite systems and it is illustrated by the dihedral group related to glycolate oxidase enzyme.",
    "authors": [
      "Marco A. S. Trindade"
    ],
    "publication_date": "2013-09-20T13:28:40Z",
    "arxiv_id": "http://arxiv.org/abs/1309.5265v3",
    "download_url": "https://arxiv.org/abs/1309.5265v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum computing for chemistry and physics applications from a Monte Carlo perspective",
    "abstract": "This Perspective focuses on the several overlaps between quantum algorithms and Monte Carlo methods in the domains of physics and chemistry. We will analyze the challenges and possibilities of integrating established quantum Monte Carlo solutions in quantum algorithms. These include refined energy estimators, parameter optimization, real and imaginary-time dynamics, and variational circuits. Conversely, we will review new ideas in utilizing quantum hardware to accelerate the sampling in statistical classical models, with applications in physics, chemistry, optimization, and machine learning. This review aims to be accessible to both communities and intends to foster further algorithmic developments at the intersection of quantum computing and Monte Carlo methods. Most of the works discussed in this Perspective have emerged within the last two years, indicating a rapidly growing interest in this promising area of research.",
    "authors": [
      "Guglielmo Mazzola"
    ],
    "publication_date": "2023-08-15T18:01:28Z",
    "arxiv_id": "http://arxiv.org/abs/2308.07964v3",
    "download_url": "https://arxiv.org/abs/2308.07964v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Observability of signatures of transport-induced chemistry in clear atmospheres of hot gas giant exoplanets",
    "abstract": "Transport-induced quenching, i.e., the homogenisation of chemical abundances by atmospheric advection, is thought to occur in the atmospheres of hot gas giant exoplanets. While some numerical modelling of this process exists, the three-dimensional nature of transport-induced chemistry is underexplored. Here we present results of 3D cloud- and haze-free simulations of the atmospheres of HAT-P-11b, HD 189733b, HD 209458b, and WASP-17b including coupled hydrodynamics, radiative transfer and chemistry. Our simulations were performed with two chemical schemes: a chemical kinetics scheme, which is capable of capturing transport-induced quenching, and a simpler, more widely used chemical equilibrium scheme. We find that transport-induced quenching is predicted to occur in atmospheres of all planets in our sample; however, the extent to which it affects their synthetic spectra and phase curves varies from planet to planet. This implies that there is a \"sweet spot\" for the observability of signatures of transport-induced quenching, which is controlled by the interplay between the dynamics and chemistry.",
    "authors": [
      "Maria Zamyatina",
      "Éric Hébrard",
      "Benjamin Drummond",
      "Nathan J. Mayne",
      "James Manners",
      "Duncan A. Christie",
      "Pascal Tremblin",
      "David K. Sing",
      "Krisztian Kohary"
    ],
    "publication_date": "2022-11-16T17:36:05Z",
    "arxiv_id": "http://arxiv.org/abs/2211.09071v2",
    "download_url": "https://arxiv.org/abs/2211.09071v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Morphology and thermal conductivity of model organic aerogels",
    "abstract": "The intersection volume of two independent 2-level cut Gaussian random fields is proposed to model the open-cell microstructure of organic aerogels. The experimentally measured X-ray scattering intensity, surface area and solid thermal conductivity of both polymeric and colloidal organic aerogels can be accounted for by the model.",
    "authors": [
      "Anthony P. Roberts"
    ],
    "publication_date": "1996-12-04T11:16:00Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9612044v1",
    "download_url": "https://arxiv.org/abs/cond-mat/9612044v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The imprint of clump formation at high redshift. II. The chemistry of the bulge",
    "abstract": "In Paper I we showed that clumps in high-redshift galaxies, having a high star formation rate density (Σ_SFR), produce disks with two tracks in the [Fe/H]-[α/Fe] chemical space, similar to that of the Milky Way's (MW's) thin + thick disks. Here we investigate the effect of clumps on the bulge's chemistry. The chemistry of the MW's bulge is comprised of a single track with two density peaks separated by a trough. We show that the bulge chemistry of an N-body + smoothed particle hydrodynamics clumpy simulation also has a single track. Star formation within the bulge is itself in the high-Σ_SFR clumpy mode, which ensures that the bulge's chemical track follows that of the thick disk at low [Fe/H] and then extends to high [Fe/H], where it peaks. The peak at low metallicity instead is comprised of a mixture of in-situ stars and stars accreted via clumps. As a result, the trough between the peaks occurs at the end of the thick disk track. We find that the high-metallicity peak dominates near the mid-plane and declines in relative importance with height, as in the MW. The bulge is already rapidly rotating by the end of the clump epoch, with higher rotation at low [α/Fe]. Thus clumpy star formation is able to simultaneously explain the chemodynamic trends of the MW's bulge, thin + thick disks and the Splash.",
    "authors": [
      "Victor P. Debattista",
      "David J. Liddicott",
      "Oscar A. Gonzalez",
      "Leandro Beraldo e Silva",
      "Joao A. S. Amarante",
      "Ilin Lazar",
      "Manuela Zoccali",
      "Elena Valenti",
      "Deanne B. Fisher",
      "Tigran Khachaturyants",
      "David L. Nidever",
      "Thomas R. Quinn",
      "Min Du",
      "Susan Kassin"
    ],
    "publication_date": "2023-03-14T22:38:32Z",
    "arxiv_id": "http://arxiv.org/abs/2303.08265v1",
    "download_url": "https://arxiv.org/abs/2303.08265v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pseudocontact shifts and paramagnetic susceptibility in semiempirical and quantum chemistry theories",
    "abstract": "Pseudocontact shifts are traditionally described as a function of the anisotropy of the paramagnetic susceptibility tensor, according to the semiempirical theory mainly developed by Kurland and McGarvey (R.J. Kurland and B.R. McGarvey, J. Magn. Reson. 2, 286 (1970)). The paramagnetic susceptibility tensor is required to be symmetric. Applying point-dipole approximation to the quantum chemistry theory of hyperfine shift, pseudocontact shifts are found to scale with a non-symmetric tensor that differs by a factor g/ge from the paramagnetic susceptibility tensor derived within the semiempirical framework. We analyze the foundations of the Kurland-McGarvey pseudocontact shift expression and recall that it is inherently based on the Russell-Saunders (LS) coupling approximation for the spin-orbit coupling. We show that the difference between the semiempirical and quantum chemistry pseudocontact shift expressions arises directly from the different treatment of the orbital contribution to the hyperfine coupling.",
    "authors": [
      "Giacomo Parigi",
      "Ladislav Benda",
      "Enrico Ravera",
      "Maurizio Romanelli",
      "Claudio Luchinat"
    ],
    "publication_date": "2018-04-24T14:07:08Z",
    "arxiv_id": "http://arxiv.org/abs/1804.09055v2",
    "download_url": "https://arxiv.org/abs/1804.09055v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "What the foundations of quantum computer science teach us about chemistry",
    "abstract": "With the rapid development of quantum technology, one of the leading applications is the simulation of chemistry. Interestingly, even before full scale quantum computers are available, quantum computer science has exhibited a remarkable string of results that directly impact what is possible in chemical simulation with any computer. Some of these results even impact our understanding of chemistry in the real world. In this perspective, we take the position that direct chemical simulation is best understood as a digital experiment. While on one hand this clarifies the power of quantum computers to extend our reach, it also shows us the limitations of taking such an approach too directly. Leveraging results that quantum computers cannot outpace the physical world, we build to the controversial stance that some chemical problems are best viewed as problems for which no algorithm can deliver their solution in general, known in computer science as undecidable problems. This has implications for the predictive power of thermodynamic models and topics like the ergodic hypothesis. However, we argue that this perspective is not defeatist, but rather helps shed light on the success of existing chemical models like transition state theory, molecular orbital theory, and thermodynamics as models that benefit from data. We contextualize recent results showing that data-augmented models are more powerful rote simulation. These results help us appreciate the success of traditional chemical theory and anticipate new models learned from experimental data. Not only can quantum computers provide data for such models, but they can extend the class and power of models that utilize data in fundamental ways. These discussions culminate in speculation on new ways for quantum computing and chemistry to interact and our perspective on the eventual roles of quantum computers in the future of chemistry.",
    "authors": [
      "Jarrod R. McClean",
      "Nicholas C. Rubin",
      "Joonho Lee",
      "Matthew P. Harrigan",
      "Thomas E. O'Brien",
      "Ryan Babbush",
      "William J. Huggins",
      "Hsin-Yuan Huang"
    ],
    "publication_date": "2021-06-07T22:40:11Z",
    "arxiv_id": "http://arxiv.org/abs/2106.03997v1",
    "download_url": "https://arxiv.org/abs/2106.03997v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electronic Coupling between the Unoccupied States of the Organic and Inorganic Sub-Lattices of Methylammonium Lead Iodide a Hybrid Organic-Inorganic Perovskite Single Crystal",
    "abstract": "Organic-inorganic halide perovskites have been intensively re-investigated due to their applications, yet the opto-electronic function of the organic cation remains unclear. Through organic-selective resonant Auger electron spectroscopy measurements on well-defined single crystal surfaces, we find evidence for electronic coupling in the unoccupied states between the organic and inorganic sub-lattices of the prototypical hybrid perovskite, which is contrary to the notion based on previous studies that the organic cation is electronically inert. The coupling is relevant for electron dynamics in the material and for understanding opto-electronic functionality.",
    "authors": [
      "Gabriel J. Man",
      "Cody M. Sterling",
      "Chinnathambi Kamal",
      "Konstantin A. Simonov",
      "Sebastian Svanström",
      "Joydev Acharya",
      "Fredrik O. L. Johansson",
      "Erika Giangrisostomi",
      "Ruslan Ovsyannikov",
      "Thomas Huthwelker",
      "Sergei M. Butorin",
      "Pabitra K. Nayak",
      "Michael Odelius",
      "Håkan Rensmo"
    ],
    "publication_date": "2020-11-03T21:34:35Z",
    "arxiv_id": "http://arxiv.org/abs/2011.02016v2",
    "download_url": "https://arxiv.org/abs/2011.02016v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Atomic Representations of Local and Global Chemistry in Complex Alloys",
    "abstract": "The exceptional properties observed in complex concentrated alloys (CCAs) arise from the interplay between crystalline order and chemical disorder at the atomic scale, complicating a unique determination of properties. In contrast to conventional alloys, CCA properties emerge as distributions due to varying local chemical environments and the specific scale of measurement. Currently there are few ways to quantitatively define, track, and compare local alloy compositions (versus a global label, i.e. equiatomic) contained in a CCA. Molecular dynamics is used here to build descriptive metrics that connect a global alloy composition to the diverse local alloy compositions that define it. A machine-learned interatomic potential for MoNbTaTi is developed and we use these metrics to investigate how property distributions change with excursions in global-local composition space. Short-range order is examined through the lens of local chemistry for the equiatomic composition, demonstrating stark changes in vacancy formation energy with local chemistry evolution.",
    "authors": [
      "Megan J. McCarthy",
      "Jacob Startt",
      "Rémi Dingreville",
      "Aidan P. Thompson",
      "Mitchell A. Wood"
    ],
    "publication_date": "2023-03-08T01:22:19Z",
    "arxiv_id": "http://arxiv.org/abs/2303.04311v3",
    "download_url": "https://arxiv.org/abs/2303.04311v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tensor product methods and entanglement optimization for ab initio quantum chemistry",
    "abstract": "The treatment of high-dimensional problems such as the Schrödinger equation can be approached by concepts of tensor product approximation. We present general techniques that can be used for the treatment of high-dimensional optimization tasks and time-dependent equations, and connect them to concepts already used in many-body quantum physics. Based on achievements from the past decade, entanglement-based methods, -- developed from different perspectives for different purposes in distinct communities already matured to provide a variety of tools -- can be combined to attack highly challenging problems in quantum chemistry. The aim of the present paper is to give a pedagogical introduction to the theoretical background of this novel field and demonstrate the underlying benefits through numerical applications on a text book example. Among the various optimization tasks we will discuss only those which are connected to a controlled manipulation of the entanglement which is in fact the key ingredient of the methods considered in the paper. The selected topics will be covered according to a series of lectures given on the topic \"New wavefunction methods and entanglement optimizations in quantum chemistry\" at the Workshop on Theoretical Chemistry, 18 - 21 February 2014, Mariapfarr, Austria.",
    "authors": [
      "Szilárd Szalay",
      "Max Pfeffer",
      "Valentin Murg",
      "Gergely Barcza",
      "Frank Verstraete",
      "Reinhold Schneider",
      "Örs Legeza"
    ],
    "publication_date": "2014-12-18T12:06:04Z",
    "arxiv_id": "http://arxiv.org/abs/1412.5829v1",
    "download_url": "https://arxiv.org/abs/1412.5829v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry in externally FUV irradiated disks in the outskirts of the Orion Nebula",
    "abstract": "Most stars are born in stellar clusters and their protoplanetary disks, which are the birthplaces of planets, can therefore be affected by the radiation of nearby massive stars. However, little is known about the chemistry of externally irradiated disks, including whether or not their properties are similar to the so-far better-studied isolated disks. Motivated by this question, we present ALMA Band 6 observations of two irradiated Class II protoplanetary disks in the outskirts of the Orion Nebula Cluster (ONC) to explore the chemical composition of disks exposed to (external) FUV radiation fields: the 216-0939 disk and the binary system 253-1536A/B, which are exposed to radiation fields of $10^2-10^3$ times the average interstellar radiation field. We detect lines from CO isotopologues, HCN, H$_2$CO, and C$_2$H toward both protoplanetary disks. Based on the observed disk-integrated line fluxes and flux ratios, we do not find significant differences between isolated and irradiated disks. The observed differences seem to be more closely related to the different stellar masses than to the external radiation field. This suggests that these disks are far enough away from the massive Trapezium stars, that their chemistry is no longer affected by external FUV radiation. Additional observations towards lower-mass disks and disks closer to the massive Trapezium stars are required to elucidate the level of external radiation required to make an impact on the chemistry of planet formation in different kinds of disks.",
    "authors": [
      "Javiera K. Díaz-Berríos",
      "Viviana V. Guzmán",
      "Catherine Walsh",
      "Karin I. Öberg",
      "L. Ilsedore Cleeves",
      "Elizabeth Artur de la Villarmois",
      "John Carpenter"
    ],
    "publication_date": "2024-05-01T16:35:16Z",
    "arxiv_id": "http://arxiv.org/abs/2405.00615v1",
    "download_url": "https://arxiv.org/abs/2405.00615v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]