[
  {
    "title": "Atmospheric chemistry on Uranus and Neptune",
    "abstract": "Comparatively little is known about atmospheric chemistry on Uranus and Neptune, because remote spectral observations of these cold, distant ``Ice Giants'' are challenging, and each planet has only been visited by a single spacecraft during brief flybys in the 1980s. Thermochemical equilibrium is expected to control the composition in the deeper, hotter regions of the atmosphere on both planets, but disequilibrium chemical processes such as transport-induced quenching and photochemistry alter the composition in the upper atmospheric regions that can be probed remotely. Surprising disparities in the abundance of disequilibrium chemical products between the two planets point to significant differences in atmospheric transport. The atmospheric composition of Uranus and Neptune can provide critical clues for unravelling details of planet formation and evolution, but only if it is fully understood how and why atmospheric constituents vary in a three-dimensional sense and how material coming in from outside the planet affects observed abundances. Future mission planning should take into account the key outstanding questions that remain unanswered about atmospheric chemistry on Uranus and Neptune, particularly those questions that pertain to planet formation and evolution, and those that address the complex, coupled atmospheric processes that operate on Ice Giants within our solar system and beyond.",
    "authors": [
      "J. I. Moses",
      "T. Cavalie",
      "L. N. Fletcher",
      "M. T. Roman"
    ],
    "publication_date": "2020-06-19T20:44:44Z",
    "arxiv_id": "http://arxiv.org/abs/2006.11367v1",
    "download_url": "https://arxiv.org/abs/2006.11367v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A new model of the chemistry of ionizing radiation in solids: CIRIS",
    "abstract": "The collisions between high-energy ions and solids can result in significant physical and chemical changes to the material. These effects are potentially important for better understanding the chemistry of interstellar and planetary bodies, which are exposed to cosmic radiation and the solar wind, respectively, however, modeling such collisions on a detailed microscopic basis has thus far been largely unsuccessful. To that end, a new model, entitled CIRIS: the Chemistry of Ionizing Radiation in Solids, was created to calculate the physical and chemical effects of the irradiation of solid materials. With the new code, we simulate O2 ice irradiated with 100 keV protons. Our models are able to reproduce the measured ozone abundances of a previous experimental study, as well as independently predict the approximate thickness of the ice used in that work.",
    "authors": [
      "Christopher N. Shingledecker",
      "Romane Le Gal",
      "Eric Herbst"
    ],
    "publication_date": "2017-06-16T21:02:20Z",
    "arxiv_id": "http://arxiv.org/abs/1706.05430v1",
    "download_url": "https://arxiv.org/abs/1706.05430v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling Ferro- and Antiferromagnetic Interactions in Metal-Organic Coordination Networks",
    "abstract": "Magnetization curves of two rectangular metal-organic coordination networks formed by the organic ligand TCNQ (7,7,8,8-tetracyanoquinodimethane) and two different (Mn and Ni) 3d transition metal atoms [M(3d)] show marked differences that are explained using first principles density functional theory and model calculations. We find that the existence of a weakly dispersive hybrid band with M(3d) and TCNQ character crossing the Fermi level is determinant for the appearance of ferromagnetic coupling between metal centers, as it is the case of the metallic system Ni-TCNQ but not of the insulating system Mn-TCNQ. The spin magnetic moment localized at the Ni atoms induces a significant spin polarization in the organic molecule; the corresponding spin density being delocalized along the whole system. The exchange interaction between localized spins at Ni centers and the itinerant spin density is ferromagnetic. Based on two different model Hamiltonians, we estimate the strength of exchange couplings between magnetic atoms for both Ni- and Mn-TCNQ networks that results in weak ferromagnetic and very weak antiferromagnetic correlations for Ni- and Mn-TCNQ networks, respectively.",
    "authors": [
      "Marisa N. Faraggi",
      "Vitaly N. Golovach",
      "Sebastian Stepanow",
      "Tzu-Chun Tseng",
      "Nasiba Abdurakhmanova",
      "Christopher Seiji Kley",
      "Alexander Langner",
      "Violetta Sessi",
      "Klaus Kern",
      "Andres Arnau"
    ],
    "publication_date": "2014-12-22T08:13:52Z",
    "arxiv_id": "http://arxiv.org/abs/1412.6898v1",
    "download_url": "https://arxiv.org/abs/1412.6898v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimized Dynamic Mode Decomposition for Reconstruction and Forecasting of Atmospheric Chemistry Data",
    "abstract": "We introduce the optimized dynamic mode decomposition algorithm for constructing an adaptive and computationally efficient reduced order model and forecasting tool for global atmospheric chemistry dynamics. By exploiting a low-dimensional set of global spatio-temporal modes, interpretable characterizations of the underlying spatial and temporal scales can be computed. Forecasting is also achieved with a linear model that uses a linear superposition of the dominant spatio-temporal features. The DMD method is demonstrated on three months of global chemistry dynamics data, showing its significant performance in computational speed and interpretability. We show that the presented decomposition method successfully extracts known major features of atmospheric chemistry, such as summertime surface pollution and biomass burning activities. Moreover, the DMD algorithm allows for rapid reconstruction of the underlying linear model, which can then easily accommodate non-stationary data and changes in the dynamics.",
    "authors": [
      "Meghana Velegar",
      "Christoph Keller",
      "J. Nathan Kutz"
    ],
    "publication_date": "2024-04-13T15:44:12Z",
    "arxiv_id": "http://arxiv.org/abs/2404.12396v1",
    "download_url": "https://arxiv.org/abs/2404.12396v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Foundation Models for Atomistic Simulation of Chemistry and Materials",
    "abstract": "Given the power of large language and large vision models, it is of profound and fundamental interest to ask if a foundational model based on data and parameter scaling laws and pre-training strategies is possible for learned simulations of chemistry and materials. The scaling of large and diverse datasets and highly expressive architectures for chemical and materials sciences should result in a foundation model that is more efficient and broadly transferable, robust to out-of-distribution challenges, and easily fine-tuned to a variety of downstream observables, when compared to specific training from scratch on targeted applications in atomistic simulation. In this Perspective we aim to cover the rapidly advancing field of machine learned interatomic potentials (MLIP), and to illustrate a path to create chemistry and materials MLIP foundation models at larger scale.",
    "authors": [
      "Eric C. -Y. Yuan",
      "Yunsheng Liu",
      "Junmin Chen",
      "Peichen Zhong",
      "Sanjeev Raja",
      "Tobias Kreiman",
      "Santiago Vargas",
      "Wenbin Xu",
      "Martin Head-Gordon",
      "Chao Yang",
      "Samuel M. Blau",
      "Bingqing Cheng",
      "Aditi Krishnapriyan",
      "Teresa Head-Gordon"
    ],
    "publication_date": "2025-03-13T16:52:12Z",
    "arxiv_id": "http://arxiv.org/abs/2503.10538v3",
    "download_url": "https://arxiv.org/abs/2503.10538v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Temperature-chemistry coupling in the evolution of gas giant atmospheres driven by stellar flares",
    "abstract": "The effect of enhanced UV irradiation associated with stellar flares on the atmospheric composition and temperature of gas giant exoplanets was investigated. This was done using a 1D radiative-convective-chemical model with self-consistent feedback between the temperature and the non-equilibrium chemistry.\n  It was found that flare-driven changes to chemical composition and temperature give rise to prolonged trends in evolution across a broad range of pressure levels and species. Allowing feedback between chemistry and temperature plays an important role in establishing the quiescent structure of these atmospheres, and determines their evolution due to flares. It was found that cooler planets are more susceptible to flares than warmer ones, seeing larger changes in composition and temperature, and that temperature-chemistry feedback modifies their evolution.\n  Long-term exposure to flares changes the transmission spectra of gas giant atmospheres; these changes differed when the temperature structure was allowed to evolve self-consistently with the chemistry. Changes in spectral features due to the effects of flares on these atmospheres can be associated with changes in composition. The effects of flares on the atmospheres of sufficiently cool planets will impact observations made with JWST. It is necessary to use self-consistent models of temperature and chemistry in order to accurately capture the effects of flares on features in the transmission spectra of cooler gas giants, but this depends heavily on the radiation environment of the planet.",
    "authors": [
      "Harrison Nicholls",
      "Eric Hébrard",
      "Olivia Venot",
      "Benjamin Drummond",
      "Elise Evans"
    ],
    "publication_date": "2023-06-06T13:38:18Z",
    "arxiv_id": "http://arxiv.org/abs/2306.03673v1",
    "download_url": "https://arxiv.org/abs/2306.03673v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unveiling Latent Knowledge in Chemistry Language Models through Sparse Autoencoders",
    "abstract": "Since the advent of machine learning, interpretability has remained a persistent challenge, becoming increasingly urgent as generative models support high-stakes applications in drug and material discovery. Recent advances in large language model (LLM) architectures have yielded chemistry language models (CLMs) with impressive capabilities in molecular property prediction and molecular generation. However, how these models internally represent chemical knowledge remains poorly understood. In this work, we extend sparse autoencoder techniques to uncover and examine interpretable features within CLMs. Applying our methodology to the Foundation Models for Materials (FM4M) SMI-TED chemistry foundation model, we extract semantically meaningful latent features and analyse their activation patterns across diverse molecular datasets. Our findings reveal that these models encode a rich landscape of chemical concepts. We identify correlations between specific latent features and distinct domains of chemical knowledge, including structural motifs, physicochemical properties, and pharmacological drug classes. Our approach provides a generalisable framework for uncovering latent knowledge in chemistry-focused AI systems. This work has implications for both foundational understanding and practical deployment; with the potential to accelerate computational chemistry research.",
    "authors": [
      "Jaron Cohen",
      "Alexander G. Hasson",
      "Sara Tanovic"
    ],
    "publication_date": "2025-12-08T22:20:01Z",
    "arxiv_id": "http://arxiv.org/abs/2512.08077v1",
    "download_url": "https://arxiv.org/abs/2512.08077v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "CACTUS: Chemistry Agent Connecting Tool-Usage to Science",
    "abstract": "Large language models (LLMs) have shown remarkable potential in various domains, but they often lack the ability to access and reason over domain-specific knowledge and tools. In this paper, we introduced CACTUS (Chemistry Agent Connecting Tool-Usage to Science), an LLM-based agent that integrates cheminformatics tools to enable advanced reasoning and problem-solving in chemistry and molecular discovery. We evaluate the performance of CACTUS using a diverse set of open-source LLMs, including Gemma-7b, Falcon-7b, MPT-7b, Llama2-7b, and Mistral-7b, on a benchmark of thousands of chemistry questions. Our results demonstrate that CACTUS significantly outperforms baseline LLMs, with the Gemma-7b and Mistral-7b models achieving the highest accuracy regardless of the prompting strategy used. Moreover, we explore the impact of domain-specific prompting and hardware configurations on model performance, highlighting the importance of prompt engineering and the potential for deploying smaller models on consumer-grade hardware without significant loss in accuracy. By combining the cognitive capabilities of open-source LLMs with domain-specific tools, CACTUS can assist researchers in tasks such as molecular property prediction, similarity searching, and drug-likeness assessment. Furthermore, CACTUS represents a significant milestone in the field of cheminformatics, offering an adaptable tool for researchers engaged in chemistry and molecular discovery. By integrating the strengths of open-source LLMs with domain-specific tools, CACTUS has the potential to accelerate scientific advancement and unlock new frontiers in the exploration of novel, effective, and safe therapeutic candidates, catalysts, and materials. Moreover, CACTUS's ability to integrate with automated experimentation platforms and make data-driven decisions in real time opens up new possibilities for autonomous discovery.",
    "authors": [
      "Andrew D. McNaughton",
      "Gautham Ramalaxmi",
      "Agustin Kruel",
      "Carter R. Knutson",
      "Rohith A. Varikoti",
      "Neeraj Kumar"
    ],
    "publication_date": "2024-05-02T03:20:08Z",
    "arxiv_id": "http://arxiv.org/abs/2405.00972v1",
    "download_url": "https://arxiv.org/abs/2405.00972v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A re-analysis of equilibrium chemistry in five hot Jupiters",
    "abstract": "Studying chemistry and chemical composition is fundamental to go back to formation history of planetary systems. We propose here to have another look at five targets to better determine their composition and the chemical mechanisms that take place in their atmospheres. We present a re-analysis of five Hot Jupiters, combining multiple instruments and using Bayesian retrieval methods. We compare different combinations of molecules present in the simulated atmosphere, different chemistry types as well as different clouds parametrization. As a consequence of recent studies questioning the detection of Na and K in the atmosphere of HD 209458b as being potentially contaminated by stellar lines when present, we study the impact on other retrieval parameters of misinterpreting the presence of these alkali species. We use spatially scanned observations from the grisms G102 and G141 of the WFC3 on HST, with a wavelength coverage of $\\sim$0.8 to $\\sim$1.7 microns. We analyse these data with the publicly available Iraclis pipeline. We added to our datasets STIS observations to increase our wavelength coverage from $\\sim$0.4 to $\\sim$1.7 microns. We then performed a Bayesian retrieval analysis with the open-source TauREx using a nested sampling algorithm. We explore the influence of including Na and K on the retrieval of the molecules from the atmosphere. Our data re-analysis and Bayesian retrieval are consistent with previous studies but we find small differences in the retrieved parameters. After all, Na and K has no significant impact on the properties of the planet atmospheres. Therefore, we present here our new best-fit models, taking into account molecular abundances varying freely and equilibrium chemistry. This work is a preparation for a future addition of more sophisticated representation of chemistry taking into account disequilibrium effects such as vertical mixing and photochemistry.",
    "authors": [
      "Emilie Panek",
      "Jean-Philippe Beaulieu",
      "Pierre Drossart",
      "Olivia Venot",
      "Quentin Changeat",
      "Ahmed Al-Refaie",
      "Amélie Gressier"
    ],
    "publication_date": "2023-06-19T11:57:58Z",
    "arxiv_id": "http://arxiv.org/abs/2306.10873v2",
    "download_url": "https://arxiv.org/abs/2306.10873v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Twenty Years of Auxiliary-Field Quantum Monte Carlo in Quantum Chemistry: An Overview and Assessment on Main Group Chemistry and Bond-Breaking",
    "abstract": "In this work, we present an overview of the phaseless auxiliary-field quantum Monte Carlo (ph- AFQMC) approach from a computational quantum chemistry perspective, and present a numerical assessment of its performance on main group chemistry and bond-breaking problems with a total of 1004 relative energies. While our benchmark study is somewhat limited, we make recommendations for the use of ph-AFQMC for general main-group chemistry applications. For systems where single determinant wave functions are qualitatively accurate, we expect the accuracy of ph-AFQMC in conjunction with a single determinant trial wave function to be between that of coupled-cluster with singles and doubles (CCSD) and CCSD with perturbative triples (CCSD(T)). For these applications, ph-AFQMC should be a method of choice when canonical CCSD(T) is too expensive to run. For systems where multi-reference (MR) wave functions are needed for qualitative accuracy, ph-AFQMC is far more accurate than MR perturbation theory methods and competitive with MR configuration interaction (MRCI) methods. Due to the computational efficiency of ph-AFQMC compared to MRCI, we recommended ph-AFQMC as a method of choice for handling dynamic correlation in MR problems. We conclude with a discussion of important directions for future development of the ph-AFQMC approach.",
    "authors": [
      "Joonho Lee",
      "Hung Q. Pham",
      "David R. Reichman"
    ],
    "publication_date": "2022-08-02T07:02:44Z",
    "arxiv_id": "http://arxiv.org/abs/2208.01280v2",
    "download_url": "https://arxiv.org/abs/2208.01280v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Influence of Galactic Cosmic Rays on Ion-Neutral Hydrocarbon Chemistry in the Upper Atmospheres of Free-Floating Exoplanets",
    "abstract": "Cosmic rays may be linked to the formation of volatiles necessary for prebiotic chemistry. We explore the effect of cosmic rays in a hydrogen-dominated atmosphere, as a proof-of-concept that ion-neutral chemistry may be important for modelling hydrogen-dominated atmospheres. In order to accomplish this, we utilize Monte Carlo cosmic ray transport models with particle energies of $10^6$ eV $< E < 10^{12}$ eV in order to investigate the cosmic ray enhancement of free electrons in substellar atmospheres. Ion-neutral chemistry is then applied to a Drift-Phoenix model of a free-floating giant gas planet. Our results suggest that the activation of ion-neutral chemistry in the upper atmosphere significantly enhances formation rates for various species, and we find that C$_2$H$_2$, C$_2$H$_4$, NH$_3$, C$_6$H$_6$ and possibly C$_{10}$H are enhanced in the upper atmospheres because of cosmic rays. Our results suggest a potential connection between cosmic ray chemistry and the hazes observed in the upper atmospheres of various extrasolar planets. Chemi-ionization reactions are briefly discussed, as they may enhance the degree of ionization in the cloud layer.",
    "authors": [
      "P. B. Rimmer",
      "Ch. Helling",
      "C. Bilger"
    ],
    "publication_date": "2013-12-04T12:34:34Z",
    "arxiv_id": "http://arxiv.org/abs/1312.1138v1",
    "download_url": "https://arxiv.org/abs/1312.1138v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Rich Circumstellar Chemistry of SMP LMC 11",
    "abstract": "Carbon-rich evolved stars from the asymptotic giant branch to the planetary nebula phase are characterized by a rich and complex carbon chemistry in their circumstellar envelopes. A peculiar object is the preplanetary nebula SMP LMC 11, whose Spitzer-IRS spectrum shows remarkable and diverse molecular absorption bands. To study how the molecular composition in this object compares to our current understanding of circumstellar carbon chemistry, we modeled this molecular absorption. We find high abundances for a number of molecules, perhaps most notably benzene. We also confirm the presence of propyne (CH3C2H) in this spectrum. Of all the cyanopolyynes, only HC3N is evident; we can detect at best a marginal presence of HCN. From comparisons to various chemical models, we can conclude that SMP LMC 11 must have an unusual circumstellar environment (a torus rather than an outflow).",
    "authors": [
      "Sarah E. Malek",
      "Jan Cami",
      "Jeronimo Bernard-Salas"
    ],
    "publication_date": "2011-11-10T17:42:39Z",
    "arxiv_id": "http://arxiv.org/abs/1111.2533v1",
    "download_url": "https://arxiv.org/abs/1111.2533v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding polaritonic chemistry from ab initio quantum electrodynamics",
    "abstract": "In this review we present the theoretical foundations and first principles frameworks to describe quantum matter within quantum electrodynamics (QED) in the low-energy regime. Having a rigorous and fully quantized description of interacting photons, electrons and nuclei/ions, from weak to strong light-matter coupling regimes, is pivotal for a detailed understanding of the emerging fields of polaritonic chemistry and cavity materials engineering. The use of rigorous first principles avoids ambiguities and problems stemming from using approximate models based on phenomenological descriptions of light, matter and their interactions. By starting from fundamental physical and mathematical principles, we first review in great detail non-relativistic QED, which allows to study polaritonic systems non-perturbatively by solving a Schrödinger-type equation. The resulting Pauli-Fierz quantum field theory serves as a cornerstone for the development of computational methods, such as quantum-electrodynamical density functional theory, QED coupled cluster or cavity Born-Oppenheimer molecular dynamics. These methods treat light and matter on equal footing and have the same level of accuracy and reliability as established methods of computational chemistry and electronic structure theory. After an overview of the key-ideas behind those novel ab initio QED methods, we explain their benefits for a better understanding of photon-induced changes of chemical properties and reactions. Based on results obtained by ab initio QED methods we identify the open theoretical questions and how a so far missing mechanistic understanding of polaritonic chemistry can be established. We finally give an outlook on future directions within polaritonic chemistry and first principles QED and address the open questions that need to be solved in the next years both from a theoretical as well as experimental viewpoint.",
    "authors": [
      "Michael Ruggenthaler",
      "Dominik Sidler",
      "Angel Rubio"
    ],
    "publication_date": "2022-11-08T13:38:16Z",
    "arxiv_id": "http://arxiv.org/abs/2211.04241v1",
    "download_url": "https://arxiv.org/abs/2211.04241v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Experimental quantum computational chemistry with optimised unitary coupled cluster ansatz",
    "abstract": "Quantum computational chemistry has emerged as an important application of quantum computing. Hybrid quantum-classical computing methods, such as variational quantum eigensolvers (VQE), have been designed as promising solutions to quantum chemistry problems, yet challenges due to theoretical complexity and experimental imperfections hinder progress in achieving reliable and accurate results. Experimental works for solving electronic structures are consequently still restricted to nonscalable (hardware efficient) or classically simulable (Hartree-Fock) ansatz, or limited to a few qubits with large errors. The experimental realisation of scalable and high-precision quantum chemistry simulation remains elusive. Here, we address the critical challenges {associated with} solving molecular electronic structures using noisy quantum processors. Our protocol presents significant improvements in the circuit depth and running time, key metrics for chemistry simulation. Through systematic hardware enhancements and the integration of error mitigation techniques, we push forward the limit of experimental quantum computational chemistry and successfully scale up the implementation of VQE with an optimised unitary coupled-cluster ansatz to 12 qubits. We produce high-precision results of the ground-state energy for molecules with error suppression by around two orders of magnitude. We achieve chemical accuracy for H$_2$ at all bond distances and LiH at small bond distances in the experiment, even beyond the two recent concurrent works. Our work demonstrates a feasible path towards a scalable solution to electronic structure calculation, validating the key technological features and identifying future challenges for this goal.",
    "authors": [
      "Shaojun Guo",
      "Jinzhao Sun",
      "Haoran Qian",
      "Ming Gong",
      "Yukun Zhang",
      "Fusheng Chen",
      "Yangsen Ye",
      "Yulin Wu",
      "Sirui Cao",
      "Kun Liu",
      "Chen Zha",
      "Chong Ying",
      "Qingling Zhu",
      "He-Liang Huang",
      "Youwei Zhao",
      "Shaowei Li",
      "Shiyu Wang",
      "Jiale Yu",
      "Daojin Fan",
      "Dachao Wu",
      "Hong Su",
      "Hui Deng",
      "Hao Rong",
      "Yuan Li",
      "Kaili Zhang",
      "Tung-Hsun Chung",
      "Futian Liang",
      "Jin Lin",
      "Yu Xu",
      "Lihua Sun",
      "Cheng Guo",
      "Na Li",
      "Yong-Heng Huo",
      "Cheng-Zhi Peng",
      "Chao-Yang Lu",
      "Xiao Yuan",
      "Xiaobo Zhu",
      "Jian-Wei Pan"
    ],
    "publication_date": "2022-12-15T18:04:28Z",
    "arxiv_id": "http://arxiv.org/abs/2212.08006v3",
    "download_url": "https://arxiv.org/abs/2212.08006v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dark Vibronic Polaritons and the Spectroscopy of Organic Microcavities",
    "abstract": "Organic microcavities are photonic nanostructures that strongly confine the electromagnetic field, allowing exotic quantum regimes of light-matter interaction with disordered organic semiconductors. The unambiguous interpretation of the spectra of organic microcavities has been a long-standing challenge due to several competing effects involving electrons, vibrations and cavity photons. Here we present a theoretical framework that is able to describe the main spectroscopic features of organic microcavities consistently. We introduce a class of light-matter excitations called dark vibronic polaritons, which strongly emit but only weakly absorb light in the same frequency region of the bare electronic transition. Successful comparison with experimental data demonstrates the applicability of our theory. The proposed microscopic understanding of organic microcavities paves the way for the development of optoelectronic devices enhanced by quantum optics.",
    "authors": [
      "Felipe Herrera",
      "Frank C. Spano"
    ],
    "publication_date": "2016-10-13T20:13:44Z",
    "arxiv_id": "http://arxiv.org/abs/1610.04252v2",
    "download_url": "https://arxiv.org/abs/1610.04252v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First-Principles Analysis of Molecular Conduction Using Quantum Chemistry Software",
    "abstract": "We present a rigorous and computationally efficient method to do a parameter-free analysis of molecular wires connected to contacts. The self-consistent field approach is coupled with Non-equilibrium Green's Function (NEGF) formalism to describe electronic transport under an applied bias. Standard quantum chemistry software is used to calculate the self-consistent field using density functional theory (DFT). Such close coupling to standard quantum chemistry software not only makes the procedure simple to implement but also makes the relation between the I-V characteristics and the chemistry of the molecule more obvious. We use our method to interpolate between two extreme examples of transport through a molecular wire connected to gold (111) contacts: band conduction in a metallic (gold) nanowire, and resonant conduction through broadened, quasidiscrete levels of a phenyl dithiol molecule. We obtain several quantities of interest like I-V characteristic, electron density and voltage drop along the molecule.",
    "authors": [
      "Prashant Damle",
      "Avik W. Ghosh",
      "Supriyo Datta"
    ],
    "publication_date": "2002-06-27T21:12:07Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0206551v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0206551v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ab-initio quantum chemistry with neural-network wavefunctions",
    "abstract": "Machine learning and specifically deep-learning methods have outperformed human capabilities in many pattern recognition and data processing problems, in game playing, and now also play an increasingly important role in scientific discovery. A key application of machine learning in the molecular sciences is to learn potential energy surfaces or force fields from ab-initio solutions of the electronic Schrödinger equation using datasets obtained with density functional theory, coupled cluster, or other quantum chemistry methods. Here we review a recent and complementary approach: using machine learning to aid the direct solution of quantum chemistry problems from first principles. Specifically, we focus on quantum Monte Carlo (QMC) methods that use neural network ansatz functions in order to solve the electronic Schrödinger equation, both in first and second quantization, computing ground and excited states, and generalizing over multiple nuclear configurations. Compared to existing quantum chemistry methods, these new deep QMC methods have the potential to generate highly accurate solutions of the Schrödinger equation at relatively modest computational cost.",
    "authors": [
      "Jan Hermann",
      "James Spencer",
      "Kenny Choo",
      "Antonio Mezzacapo",
      "W. M. C. Foulkes",
      "David Pfau",
      "Giuseppe Carleo",
      "Frank Noé"
    ],
    "publication_date": "2022-08-26T11:33:31Z",
    "arxiv_id": "http://arxiv.org/abs/2208.12590v1",
    "download_url": "https://arxiv.org/abs/2208.12590v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "L483: Warm Carbon-Chain Chemistry Source Harboring Hot Corino Activity",
    "abstract": "The Class 0 protostar, L483, has been observed in various molecular lines in the 1.2 mm band at a sub-arcsecond resolution with ALMA. An infalling-rotating envelope is traced by the CS line, while a very compact component with a broad velocity width is observed for the CS, SO, HNCO, NH$_2$CHO, and HCOOCH$_3$ lines. Although this source is regarded as the warm carbon-chain chemistry (WCCC) candidate source at a 1000 au scale, complex organic molecules characteristic of hot corinos such as NH$_2$CHO and HCOOCH$_3$ are detected in the vicinity of the protostar. Thus, both hot corino chemistry and WCCC are seen in L483. Although such a mixed chemical character source has been recognized as an intermediate source in previous single-dish observations, we here report the first spatially-resolved detection. A kinematic structure of the infalling-rotating envelope is roughly explained by a simple ballistic model with the protostellar mass of 0.1--0.2 $M_\\odot$ and the radius of the centrifugal barrier (a half of the centrifugal radius) of 30--200 au, assuming the inclination angle of 80\\degr\\ (0\\degr\\ for a face-on). The broad line emission observed in the above molecules most likely comes from the disk component inside the centrifugal barrier. Thus, a drastic chemical change is seen around the centrifugal barrier.",
    "authors": [
      "Yoko Oya",
      "Nami Sakai",
      "Yoshimasa Watanabe",
      "Aya E. Higuchi",
      "Tomoya Hirota",
      "Ana López-Sepulcre",
      "Takeshi Sakai",
      "Yuri Aikawa",
      "Cecilia Ceccarelli",
      "Bertrand Lefloch",
      "Emmanuel Caux",
      "Charlotte Vastel",
      "Claudine Kahane",
      "Satoshi Yamamoto"
    ],
    "publication_date": "2017-03-10T12:25:32Z",
    "arxiv_id": "http://arxiv.org/abs/1703.03653v1",
    "download_url": "https://arxiv.org/abs/1703.03653v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simulating Chemistry with Fermionic Optical Superlattices",
    "abstract": "We show that quantum number preserving Ansätze for variational optimization in quantum chemistry find an elegant mapping to ultracold fermions in optical superlattices. Using native Hubbard dynamics, trial ground states of molecular Hamiltonians can be prepared and their molecular energies measured in the lattice. The scheme requires local control over interactions and chemical potentials and global control over tunneling dynamics, but foregoes the need for optical tweezers, shuttling operations, or long-range interactions. We describe a complete compilation pipeline from the molecular Hamiltonian to the sequence of lattice operations, thus providing a concrete link between quantum simulation and chemistry. Our work enables the application of recent quantum algorithmic techniques, such as Double Factorization and quantum Tailored Coupled Cluster, to present-day fermionic optical lattice systems with significant improvements in the required number of experimental repetitions. We provide detailed quantum resource estimates for small non-trivial hardware experiments.",
    "authors": [
      "Fotios Gkritsis",
      "Daniel Dux",
      "Jin Zhang",
      "Naman Jain",
      "Christian Gogolin",
      "Philipp M. Preiss"
    ],
    "publication_date": "2024-09-09T14:35:55Z",
    "arxiv_id": "http://arxiv.org/abs/2409.05663v2",
    "download_url": "https://arxiv.org/abs/2409.05663v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Far-infrared study of tracers of oxygen chemistry in diffuse clouds",
    "abstract": "Context. The chemistry of the diffuse interstellar medium rests upon three pillars: exothermic ion-neutral reactions (\" cold chemistry \"), endothermic neutral-neutral reactions with significant activation barriers (\" warm chemistry \"), and reactions on the surfaces of dust grains. While warm chemistry becomes important in the shocks associated with turbulent dissipation regions, the main path for the formation of interstellar OH and H2O is that of cold chemistry. Aims. The aim of this study is to observationally confirm the association of atomic oxygen with both atomic and molecular gas phases, and to understand the measured abundances of OH and OH + as a function of the available reservoir of H2. Methods. We obtained absorption spectra of the ground states of OH, OH+ and OI with high-velocity resolution, with GREAT on-board SOFIA, and with the THz receiver at the APEX. We analyzed them along with ancillary spectra of HF and CH from HIFI. To deconvolve them from the hyperfine structure and to separate the blend that is due to various velocity components on the sightline, we fit model spectra consisting of an appropriate number of Gaussian profiles using a method combining simulated annealing with downhill simplex minimization. Together with HF and/or CH as a surrogate for H2, and HI $λ$21 cm data, the molecular hydrogen fraction f^N\\_H2 = N(H 2)/(N(H) + 2N(H 2)) can be determined. We then investigated abundance ratios as a function of f^N\\_H2. Results. The column density of OI is correlated at a high significance with the amount of available molecular and atomic hydrogen, with an atomic oxygen abundance of $3 \\times 10 ^{-4}$ relative to H nuclei. While the velocities of the absorption features of OH and OH+ are loosely correlated and reflect the spiral arm crossings on the sightline, upon closer inspection they display an anticorrespondence. The arm-to-interarm density contrast is found to be higher in OH than in OH+. While both species can coexist, with a higher abundance in OH than in OH+, the latter is found less frequently in absence of OH than the other way around, which is a direct consequence of the rapid destruction of OH+ by dissociative recombination when not enough H2 is available. This conjecture has been substantiated by a comparison between the OH/OH+ ratio with f^N\\_H2, showing a clear correlation. The hydrogen abstraction reaction chain OH+ (H2,H) H2O+ (H2,H)H3O+ is confirmed as the pathway for the production of OH and H 2 O. Our estimate of the branching ratio of the dissociative recombination of H3O+ to OH and H2O is confined within the interval of 84 to 91%, which matches laboratory measurements (74 to 83%). -- A correlation between the linewidths and column densities of OH+ features is found to be significant with a false-alarm probability below 5%. Such a correlation is predicted by models of interstellar MHD turbulence. For OH the same correlation is found to be insignificant because there are more narrow absorption features. Conclusions. While it is difficult to assess the contributions of warm neutral-neutral chemistry to the observed abundances, it seems fair to conclude that the predictions of cold ion-neutral chemistry match the abundance patterns we observed.",
    "authors": [
      "H. Wiesemeyer",
      "R. Güsten",
      "S. Heyminck",
      "H. W. Hübers",
      "K. M. Menten",
      "D. A. Neufeld",
      "H. Richter",
      "R. Simon",
      "J. Stutzki",
      "B. Winkel",
      "F. Wyrowski"
    ],
    "publication_date": "2016-02-10T18:18:44Z",
    "arxiv_id": "http://arxiv.org/abs/1602.03472v1",
    "download_url": "https://arxiv.org/abs/1602.03472v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Emerging Fields of Quantum Chemistry at Finite Temperature",
    "abstract": "In this article, we present an emerging field of quantum chemistry at finite temperature. We discuss its recent developments on both theoretical and experimental fronts.We describe and analyze several experimental investigations related to the temperature effects on the structure, electronic spectra,or bond rupture forces for molecules. This includes the study of the temperature impact on the pathway shifts for the protein unfolding by atomic force microscopy, the temperature dependence of the absorption spectra of electrons in solvents, and temperature influence over the intermolecular forces measured by the AFM. On the theoretical side, we review a recent advancement made by the author in the coming fields of quantum chemistry at finite temperature. Starting from Bloch equation, we have derived the sets of hierarchy equations for the reduced density operators in both canonical and grand canonical ensembles. They provide a law according to which the reduced density operators vary in temperature for the identical and interacting many-body particles. By taking the independent particle approximation, we have solved the equation in the case of a grand canonical ensemble, and obtained an eigenequation for the molecular orbitals at finite temperature. The explicit expression for the temperature-dependent Fock operator is also given. They will form a foundation for the study of the molecular electronic structures and their interplay with the finite temperature. Furthermore, we clarify the physics concerning the temperature effect on the electronic structure or processes of molecules which is crucial for both theoretical understanding and computational study.Finally,we summarize our discussion and point out the theoretical and computational issues for the future explorations in the fields of quantum chemistry at finite temperature.",
    "authors": [
      "Liqiang Wei"
    ],
    "publication_date": "2004-12-31T02:40:29Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0412180v2",
    "download_url": "https://arxiv.org/abs/physics/0412180v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Aqueous Solution Chemistry In Silico and the Role of Data Driven Approaches",
    "abstract": "The use of computer simulations to study the properties of aqueous systems is, today more than ever, an active area of research. In this context, during the last decade there has been a tremendous growth in the use of data-driven approaches to develop more accurate potentials for water as well as to characterize its complexity in chemical and biological contexts. We highlight the progress, giving a historical context, on the path to the development of many-body and reactive potentials to model aqueous chemistry, including the role of machine learning strategies. We focus specifically on conceptual and methodological challenges along the way in performing simulations that seek to tackle problems in modeling the chemistry of aqueous solutions. In conclusion, we summarize our perspectives on the use and integration of advanced data-science techniques to provide chemical insights in physical chemistry and how this will influence computer simulations of aqueous systems in the future.",
    "authors": [
      "Debarshi Banerjee",
      "Khatereh Azizi",
      "Colin K. Egan",
      "Edward Danquah Donkor",
      "Cesare Malosso",
      "Solana Di Pino",
      "Gonzalo Diaz Miron",
      "Martina Stella",
      "Giulia Sormani",
      "Germaine Neza Hozana",
      "Marta Monti",
      "Uriel N. Morzan",
      "Alex Rodriguez",
      "Giuseppe Cassone",
      "Asja Jelic",
      "Damian Scherlis",
      "Ali Hassanali"
    ],
    "publication_date": "2024-03-10T15:25:53Z",
    "arxiv_id": "http://arxiv.org/abs/2403.06236v1",
    "download_url": "https://arxiv.org/abs/2403.06236v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Chemistry Between High School Students and Computer Science",
    "abstract": "Computer science enrollments have started to rise again, but the percentage of women undergraduates in computer science is still low. Some studies indicate this might be due to a lack of awareness of computer science at the high school level. We present our experiences running a 5-year, high school outreach program that introduces information about computer science within the context of required chemistry courses. We developed interactive worksheets using Molecular Workbench that help the students learn chemistry and computer science concepts related to relevant events such as the gulf oil spill. Our evaluation of the effectiveness of this approach indicates that the students do become more aware of computer science as a discipline, but system support issues in the classroom can make the approach difficult for teachers and discouraging for the students.",
    "authors": [
      "Timothy T. Lenczycki",
      "Kelly Suto",
      "Christina Williams",
      "Michelle Mills Strout"
    ],
    "publication_date": "2014-06-09T15:44:41Z",
    "arxiv_id": "http://arxiv.org/abs/1406.2222v1",
    "download_url": "https://arxiv.org/abs/1406.2222v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spectroscopic assessment of charge mobility in organic semiconductors",
    "abstract": "Rapid progress in organic electronics demands new highly efficient organic semiconducting materials. Nevertheless, only few materials have been created so far that show reliable band-like transport with high charge mobilities, which reflects the two main obstacles in the field: the poor understanding of charge transport in organic semiconductors (OSs) and the difficulty of its quantification in devices. Here, we present a spectroscopic method for assessment of the charge transport in organic semiconductors. We show that the intensities of the low-frequency Raman spectrum allow calculation of the dynamic disorder that limits the charge carrier mobility. The spectroscopically evaluated mobility clearly correlates with the device charge mobility reported for various OSs. The proposed spectroscopic method can serve as a powerful tool for a focused search of new materials and highlights the disorder bottleneck in the intrinsic charge transport in high-mobility organic semiconductors.",
    "authors": [
      "Andrey Sosorev",
      "Dmitry Maslennikov",
      "Elizaveta Feldman",
      "Ivan Chernyshov",
      "Vladimir Bruevich",
      "George Abashev",
      "Oleg Borshchev",
      "Sergei Ponomarenko",
      "Mikhail Vener",
      "Dmitry Paraschuk"
    ],
    "publication_date": "2019-09-06T12:36:24Z",
    "arxiv_id": "http://arxiv.org/abs/1909.02858v1",
    "download_url": "https://arxiv.org/abs/1909.02858v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Swelling of acetylated wood in organic liquids",
    "abstract": "To investigate the affinity of acetylated wood for organic liquids, Yezo spruce wood specimens were acetylated with acetic anhydride, and their swelling in various liquids were compared to those of untreated specimens. The acetylated wood was rapidly and remarkably swollen in aprotic organic liquids such as benzene and toluene in which the untreated wood was swollen only slightly and/or very slowly. On the other hand, the swelling of wood in water, ethylene glycol and alcohols remained unchanged or decreased by the acetylation. Consequently the maximum volume of wood swollen in organic liquids was always larger than that in water. The effect of acetylation on the maximum swollen volume of wood was greater in liquids having smaller solubility parameters. The easier penetration of aprotic organic liquids into the acetylated wood was considered to be due to the scission of hydrogen bonds among the amorphous wood constituents by the substitution of hydroxyl groups with hydrophobic acetyl groups.",
    "authors": [
      "Eiichi Obataya",
      "Joseph Gril"
    ],
    "publication_date": "2005-03-23T06:28:25Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0503178v1",
    "download_url": "https://arxiv.org/abs/physics/0503178v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient Quantum Chemistry Calculations on Noisy Quantum Hardware",
    "abstract": "We present a hardware-efficient optimization scheme for quantum chemistry calculations, utilizing the Sampled Quantum Diagonalization (SQD) method. Our algorithm, optimized SQD (SQDOpt), combines the classical Davidson method technique with added multi-basis measurements to optimize a quantum Ansatz on hardware using a fixed number of measurements per optimization step. This addresses the key challenge associated with other quantum chemistry optimization protocols, namely Variational Quantum Eigensolver (VQE), which must measure in hundreds to thousands of bases to estimate energy on hardware, even for molecules with less than 20 qubits. Numerical results for various molecules, including hydrogen chains, water, and methane, demonstrate the efficacy of our method compared to classical and quantum variational approaches, and we confirm the performance on the IBM-Cleveland quantum hardware, where we find instances where SQDOpt either matches or exceeds the solution quality of noiseless VQE. A runtime scaling indicates that SQDOpt on quantum hardware is competitive with classical state-of-the-art methods, with a crossover point of 1.5 seconds/iteration for the SQDOpt on quantum hardware and classically simulated VQE with the 20-qubit H$_{12}$ molecule. Our findings suggest that the proposed SQDOpt framework offers a scalable and robust pathway for quantum chemistry simulations on noisy intermediate-scale quantum (NISQ) devices.",
    "authors": [
      "Nora Bauer",
      "Kübra Yeter-Aydeniz",
      "George Siopsis"
    ],
    "publication_date": "2025-03-04T16:51:54Z",
    "arxiv_id": "http://arxiv.org/abs/2503.02778v1",
    "download_url": "https://arxiv.org/abs/2503.02778v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Re-analysis of 10 Hot-Jupiter Atmospheres with disequilibrium chemistry retrieval",
    "abstract": "Constraining the chemical structure of exoplanetary atmospheres is pivotal for interpreting spectroscopic data and understanding planetary evolution. Traditional retrieval methods often assume thermochemical equilibrium or free profiles, which may fail to capture disequilibrium processes like photodissociation and vertical mixing. This study leverages the TauREx 3.1 retrieval framework coupled with FRECKLL, a disequilibrium chemistry model, to address these challenges. The study aims to (1) assess the impact of disequilibrium chemistry on constraining metallicity and C/O ratios; (2) evaluate the role of refractory species (TiO and VO) in spectral retrievals; (3) explore consistency between transit and eclipse observations for temperature and chemical profiles; and (4) determine the effects of retrieval priors and data reduction methods. Ten hot-Jupiter atmospheres were reanalyzed using Hubble Space Telescope (HST) WFC3 data in eclipse and transit. The TauREx-FRECKLL model incorporated disequilibrium chemistry calculations with a Bayesian framework to infer atmospheric properties. The disequilibrium approach significantly altered retrieved metallicity and C/O ratios compared to equilibrium models, impacting planet formation insights. Retrievals reconciled transit and eclipse temperature profiles in deeper atmospheric layers but not in upper layers. Results were highly dependent on spectral resolution and retrieval priors, emphasizing limitations of HST data and the need for broader spectral coverage from instruments like JWST. This study demonstrates the feasibility and importance of incorporating disequilibrium chemistry in atmospheric retrievals, highlighting its potential for advancing our understanding of exoplanetary atmospheres with next-generation telescopes.",
    "authors": [
      "Deborah Bardet",
      "Quentin Changeat",
      "Olivia Venot",
      "Emilie Panek"
    ],
    "publication_date": "2025-06-15T10:43:21Z",
    "arxiv_id": "http://arxiv.org/abs/2506.12806v1",
    "download_url": "https://arxiv.org/abs/2506.12806v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Two-electron reduction of ethylene carbonate: a quantum chemistry re-examination of mechanisms",
    "abstract": "Passivating solid-electrolyte interphase (SEI) films arising from electrolyte decomposition on low-voltage lithium ion battery anode surfaces are critical for battery operations. We review the recent theoretical literature on electrolyte decomposition and emphasize the modeling work on two-electron reduction of ethylene carbonate (EC, a key battery organic solvent). One of the two-electron pathways, which releases CO gas, is re-examined using simple quantum chemistry calculations. Excess electrons are shown to preferentially attack EC in the order (broken EC^-) > (intact EC^-) > EC. This confirms the viability of two electron processes and emphasizes that they need to be considered when interpreting SEI experiments. An estimate of the crossover between one- and two-electron regimes under a homogeneous reaction zone approximation is proposed.",
    "authors": [
      "Kevin Leung"
    ],
    "publication_date": "2013-07-11T16:31:03Z",
    "arxiv_id": "http://arxiv.org/abs/1307.3165v1",
    "download_url": "https://arxiv.org/abs/1307.3165v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nuclear Structure Calculations with Coupled Cluster Methods from Quantum Chemistry",
    "abstract": "We present several coupled-cluster calculations of ground and excited states of 4He and 16O employing methods from quantum chemistry. A comparison of coupled cluster results with the results of exact diagonalization of the hamiltonian in the same model space and other truncated shell-model calculations shows that the quantum chemistry inspired coupled cluster approximations provide an excellent description of ground and excited states of nuclei, with much less computational effort than traditional large-scale shell-model approaches. Unless truncations are made, for nuclei like 16O, full-fledged shell-model calculations with four or more major shells are not possible. However, these and even larger systems can be studied with the coupled cluster methods due to the polynomial rather than factorial scaling inherent in standard shell-model studies. This makes the coupled cluster approaches, developed in quantum chemistry, viable methods for describing weakly bound systems of interest for future nuclear facilities.",
    "authors": [
      "D. J. Dean J. R. Gour",
      "G. Hagen",
      "M. Hjorth-Jensen",
      "K. Kowalski",
      "T. Papenbrock",
      "P. Piecuch",
      "M. Wloch"
    ],
    "publication_date": "2004-09-27T21:05:55Z",
    "arxiv_id": "http://arxiv.org/abs/nucl-th/0409062v1",
    "download_url": "https://arxiv.org/abs/nucl-th/0409062v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spiers Memorial Lecture: How to do impactful research in artificial intelligence for chemistry and materials science",
    "abstract": "Machine learning has been pervasively touching many fields of science. Chemistry and materials science are no exception. While machine learning has been making a great impact, it is still not reaching its full potential or maturity. In this perspective, we first outline current applications across a diversity of problems in chemistry. Then, we discuss how machine learning researchers view and approach problems in the field. Finally, we provide our considerations for maximizing impact when researching machine learning for chemistry.",
    "authors": [
      "Austin Cheng",
      "Cher Tian Ser",
      "Marta Skreta",
      "Andrés Guzmán-Cordero",
      "Luca Thiede",
      "Andreas Burger",
      "Abdulrahman Aldossary",
      "Shi Xuan Leong",
      "Sergio Pablo-García",
      "Felix Strieth-Kalthoff",
      "Alán Aspuru-Guzik"
    ],
    "publication_date": "2024-09-16T14:10:38Z",
    "arxiv_id": "http://arxiv.org/abs/2409.10304v2",
    "download_url": "https://arxiv.org/abs/2409.10304v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sustainable Packaging of Quantum Chemistry Software with the Nix Package Manager",
    "abstract": "The installation of quantum chemistry software packages is commonly done manually and can be a time-consuming and complicated process. An update of the underlying Linux system requires a reinstallation in many cases and can quietly break software installed on the system. In this paper, we present an approach that allows for an easy installation of quantum chemistry software packages, which is also independent of operating system updates. The use of the Nix package manager allows building software in a reproducible manner, which allows for a reconstruction of the software for later reproduction of scientific results. The build recipes that are provided can be readily used by anyone to avoid complex installation procedures.",
    "authors": [
      "Markus Kowalewski",
      "Phillip Seeber"
    ],
    "publication_date": "2021-10-11T11:13:58Z",
    "arxiv_id": "http://arxiv.org/abs/2110.05163v2",
    "download_url": "https://arxiv.org/abs/2110.05163v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Brief Review of Ferroelectric Control of Magnetoresistance in Organic Spin Valves",
    "abstract": "Magnetoelectric coupling has been a trending research topic in both organic and inorganic materials and hybrids. The concept of controlling magnetism using an electric field is particularly appealing in energy efficient applications. In this spirit, ferroelectricity has been introduced to organic spin valves to manipulate the magneto transport, where the spin transport through the ferromagnet/organic spacer interfaces (spinterface) are under intensive study. The ferroelectric materials in the organic spin valves provide a knob to vary the interfacial energy alignment and the interfacial crystal structures, both are critical for the spin transport. In this review, we first go over the basic concepts of spin transport in organic spin valves. Then we introduce the recent efforts of controlling magnetoresistance of organic spin valves using ferroelectricity, where the ferroelectric material is either inserted as an interfacial layer or used as a spacer material. The realization of the ferroelectric control of magneto transport in organic spin valve, advances our understanding in the spin transport through the ferromagnet/organic interface and suggests more functionality of organic spintronic devices.",
    "authors": [
      "Xiaoshan Xu"
    ],
    "publication_date": "2017-10-13T03:51:44Z",
    "arxiv_id": "http://arxiv.org/abs/1710.04793v1",
    "download_url": "https://arxiv.org/abs/1710.04793v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Drift-diffusion current in organic diodes",
    "abstract": "Because the conductivity of organic semiconductors is very low, a useful model for the organic diode consists of treating the organic layer as an insulator, an approximation often referred to as the metal-insulator-metal (MIM) model. Moreover, the dominant charge carrier injection process is diffusion, so that a modified Schottky theory can be used to derive a simple analytical equation for the current voltage curve of the diode. Here, we carried out a full analysis of the MIM model for the organic diode. We show that Schottky theory is only valid when charge injection is poor, that is, for high injection barriers. When the injection barrier is lowered, the current given by Schottky theory is still valid in the weak injection regime, when the applied potential is lower than the diffusion potential. However, it becomes largely overestimated in the strong injection regime. We also show that in the strong injection regime, the current given by the MIM model merges with Mott-Gurnery space-charge-limited regime.",
    "authors": [
      "Gilles Horowitz"
    ],
    "publication_date": "2017-01-10T07:50:41Z",
    "arxiv_id": "http://arxiv.org/abs/1702.05674v1",
    "download_url": "https://arxiv.org/abs/1702.05674v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum to Classical Cavity Chemistry Electrodynamics",
    "abstract": "Polaritonic chemistry has ushered in new avenues for controlling molecular dynamics. However, two key questions remain: (i) Can classical light sources elicit the same effects as certain quantum light sources on molecular systems? (ii) Can semiclassical treatments of light-matter interaction capture nontrivial quantum effects observed in molecular dynamics? This work presents a quantum-classical approach addressing issues of realizing cavity chemistry effects without actual cavities. It also highlights the limitations of the standard semiclassical light-matter interaction. It is demonstrated that classical light sources can mimic quantum effects up to the second order of light-matter interaction, provided that the mean-field contribution, symmetrized two-time correlation function, and the linear response function are the same in both situations. Numerical simulations show that the quantum-classical method aligns more closely with exact quantum molecular-only dynamics for quantum light states such as Fock states, superpositions of Fock states, and vacuum squeezed states than the conventional semiclassical approach.",
    "authors": [
      "Leonardo F. Calderón",
      "Humberto Triviño",
      "Leonardo A. Pachón"
    ],
    "publication_date": "2023-12-11T20:04:46Z",
    "arxiv_id": "http://arxiv.org/abs/2312.06815v1",
    "download_url": "https://arxiv.org/abs/2312.06815v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sensitivity study of chemistry in AGB outflows using chemical kinetics",
    "abstract": "Asymptotic Giant Branch (AGB) stars shed a significant amount of their mass in the form of a stellar wind, creating a vast circumstellar envelope (CSE). Owing to the ideal combination of relatively high densities and cool temperatures, CSEs serve as rich astrochemical laboratories. {While the chemical structure of AGB outflows has been modelled and analysed in detail for specific physical setups, there is a lack of understanding regarding the impact of changes in the physical environment on chemical abundances. A systematic sensitivity study is necessary to comprehend the nuances in the physical parameter space, given the complexity of the chemistry. This is crucial for estimating uncertainties associated with simulations and observations. In this work, we present the first sensitivity study of the impact of varying outflow densities and temperature profiles on the chemistry. With the use of a chemical kinetics model, we report on the uncertainty in abundances, given a specific uncertainty on the physical parameters. }Additionally, we analyse the molecular envelope extent of parent species and compare our findings to observational studies. Mapping the impact of differences in physical parameters throughout the CSE on the chemistry is a strong aid to observational studies.",
    "authors": [
      "S. Maes",
      "M. Van de Sande",
      "T. Danilovich",
      "F. De Ceuster",
      "L. Decin"
    ],
    "publication_date": "2023-04-12T15:42:43Z",
    "arxiv_id": "http://arxiv.org/abs/2304.05924v2",
    "download_url": "https://arxiv.org/abs/2304.05924v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From artificial to organic: Rethinking the roots of intelligence for digital health",
    "abstract": "The term artificial implies an inherent dichotomy from the natural or organic. However, AI, as we know it, is a product of organic ingenuity: designed, implemented, and iteratively improved by human cognition. The very principles that underpin AI systems, from neural networks to decision-making algorithms, are inspired by the organic intelligence embedded in human neurobiology and evolutionary processes. The path from organic to artificial intelligence in digital health is neither mystical nor merely a matter of parameter count, it is fundamentally about organization and adaption. Thus, the boundaries between artificial and organic are far less distinct than the nomenclature suggests.",
    "authors": [
      "Prajwal Ghimire",
      "Keyoumars Ashkan"
    ],
    "publication_date": "2025-12-23T19:34:39Z",
    "arxiv_id": "http://arxiv.org/abs/2512.20723v1",
    "download_url": "https://arxiv.org/abs/2512.20723v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "JWST/MIRI detection of a carbon-rich chemistry in a solar nebula analog",
    "abstract": "It has been proposed, and confirmed by multiple observations, that disks around low mass stars display a molecule-rich emission and carbon-rich disk chemistry as compared to their hotter, more massive solar counterparts. In this work, we present JWST Disk Infrared Spectral Chemistry Survey (JDISCS) MIRI-MRS observations of the solar-mass star DoAr 33, a low-accretion rate T Tauri star showing an exceptional carbon-rich inner disk. We report detections of H$_2$O, OH, and CO$_2$, as well as the more complex hydrocarbons, C$_2$H$_2$ and C$_4$H$_2$. Through the use of thermochemical models, we explore different spatial distributions of carbon and oxygen across the inner disk and compare the column densities and temperatures obtained from LTE slab model retrievals. We find a best match to the observed column densities with models that have carbon enrichment, and the retrieved emitting temperature and area of C$_2$H$_2$ with models that have C/O $=$ 2$-$4 inside the 500 K carbon-rich dust sublimation line. This suggests that the origin of the carbon-rich chemistry is likely due to the sublimation of carbon rich grains near the soot line. This would be consistent with the presence of dust processing as indicated by the detection of crystalline silicates. We propose that this long-lived hydrocarbon rich chemistry observed around a solar-mass star is a consequence of the unusually low M-star-like accretion rate of the central star, which lengthens the radial mixing timescale of the inner disk allowing the chemistry powered by carbon grain destruction to linger.",
    "authors": [
      "Maria Jose Colmenares",
      "Edwin Bergin",
      "Colette Salyk",
      "Klaus M. Pontopiddan",
      "Nicole Arulanantham",
      "Jenny Calahan",
      "Andrea Banzatti",
      "Sean Andrews",
      "Geoffrey A. Blake",
      "Fred Ciesla",
      "Joel Green",
      "Feng Long",
      "Michiel Lambrechts",
      "Joan Najita",
      "Ilaria Pascucci",
      "Paola Pinilla",
      "Sebastiaan Krijt",
      "Leon Trapman",
      "the JDISCS Collaboration"
    ],
    "publication_date": "2024-10-23T18:00:15Z",
    "arxiv_id": "http://arxiv.org/abs/2410.18187v1",
    "download_url": "https://arxiv.org/abs/2410.18187v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A sensitivity analysis of interstellar ice chemistry in astrochemical models",
    "abstract": "Astrochemical models are essential to bridge the gap between the timescales of reactions, experiments, and observations. Ice chemistry in these models experiences a large computational complexity as a result of the many parameters required for the modeling of chemistry occurring on these ices, such as binding energies and reaction energy barriers. Many of these parameters are poorly constrained, and accurately determining all would be too costly. We aim to find out which parameters describing ice chemistry have a large effect on the calculated abundances of ices for different prestellar objects. Using Monte Carlo sampled binding energies, diffusion barriers, desorption and diffusion prefactors, and reaction energy barriers, we determined the sensitivity of the abundances of the main ice species calculated with UCLCHEM, an astrochemical modeling code, on each of these parameters. We do this for a large grid of physical conditions across temperature, density, cosmic ray ionization rate and UV field strength. We find that, regardless of the physical conditions, the main sensitivities of abundances of the main ice species are the diffusion barriers of small and relatively mobile reactive species such as H, N, O, HCO, and CH$_3$. Thus, these parameters should be determined more accurately to increase the accuracy of models, paving the way to a better understanding of observations of ices. In many cases, accurate reaction energy barriers are not essential due to the treatment of competition between reactions and diffusion.",
    "authors": [
      "Tobias M. Dijkhuis",
      "Thanja Lamberts",
      "Serena Viti",
      "Herma M. Cuppen"
    ],
    "publication_date": "2025-11-02T18:36:08Z",
    "arxiv_id": "http://arxiv.org/abs/2511.01042v2",
    "download_url": "https://arxiv.org/abs/2511.01042v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graph Self-Supervised Learning for Optoelectronic Properties of Organic Semiconductors",
    "abstract": "The search for new high-performance organic semiconducting molecules is challenging due to the vastness of the chemical space, machine learning methods, particularly deep learning models like graph neural networks (GNNs), have shown promising potential to address such challenge. However, practical applications of GNNs for chemistry are often limited by the availability of labelled data. Meanwhile, unlabelled molecular data is abundant and could potentially be utilized to alleviate the scarcity issue of labelled data. Here, we advocate the use of self-supervised learning to improve the performance of GNNs by pre-training them with unlabeled molecular data. We investigate regression problems involving ground and excited state properties, both relevant for optoelectronic properties of organic semiconductors. Additionally, we extend the self-supervised learning strategy to molecules in non-equilibrium configurations which are important for studying the effects of disorder. In all cases, we obtain considerable performance improvement over results without pre-training, in particular when labelled training data is limited, and such improvement is attributed to the capability of self-supervised learning in identifying structural similarity among unlabeled molecules.",
    "authors": [
      "Zaixi Zhang",
      "Qi Liu",
      "Shengyu Zhang",
      "Chang-Yu Hsieh",
      "Liang Shi",
      "Chee-Kong Lee"
    ],
    "publication_date": "2021-12-02T23:01:12Z",
    "arxiv_id": "http://arxiv.org/abs/2112.01633v1",
    "download_url": "https://arxiv.org/abs/2112.01633v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "3D radiative hydrodynamic simulations of protostellar collapse with H-C-O dynamical chemistry",
    "abstract": "Combining the co-evolving chemistry, hydrodynamics and radiative transfer is an important step for star formation studies. It allows both a better link to observations and a self-consistent monitoring of the magnetic dissipation in the collapsing core. Our aim is to follow a chemo-dynamical evolution of collapsing dense cores with a reduced gas-grain chemical network. We present the results of radiative hydrodynamic (RHD) simulations of 1 M$_\\odot$ isolated dense core collapse. The physical setup includes RHD and dynamical evolution of a chemical network. To perform those simulations, we merged the multi-dimensional adaptive-mesh-refinement code RAMSES and the thermo-chemistry Paris-Durham shock code. We simulate the formation of the first hydro-static core (FHSC) and the co-evolution of 56 species describing mainly H-C-O chemistry. Accurate benchmarking is performed, testing the reduced chemical network against a well-establiched complex network. We show that by using a compact set of reactions, one can match closely the CO abundances with results of a much more complex network. Our main results are: (a) We find that gas-grain chemistry post-processing can lead to one order of magnitude lower CO gas-phase abundances compared to the dynamical chemistry, with strongest effect during the isothermal phase of collapse. (b) The free-fall time has little effect on the chemical abundances for our choice of the parameters. (c) Dynamical chemical evolution is required to describe the CO gas phase abundance as well as the CO ice formation for the mean grain size larger then 1$μ$m. (d) Furthermore, dust mean size and size distribution have a strong effect on chemical abundances and hence on the ionization degree and magnetic dissipation. We conclude that dust grain growth in the collapse simulations can be as important as coupling the collapse with chemistry.",
    "authors": [
      "Natalia Dzyurkevich",
      "Benoît Commerçon",
      "Pierre Lesaffre",
      "Dimitry Semenov"
    ],
    "publication_date": "2016-05-25T05:00:51Z",
    "arxiv_id": "http://arxiv.org/abs/1605.08032v1",
    "download_url": "https://arxiv.org/abs/1605.08032v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Impact of Cometary 'impacts' on the Chemistry, Climate, and Spectra of Hot Jupiter Atmospheres",
    "abstract": "Impacts from icy and rocky bodies have helped shape the composition of solar system objects, for example the Earth-Moon system, or the recent impact of comet Shoemaker-Levy 9 with Jupiter. It is likely that such impacts also shape the composition of exoplanetary systems. Here we investigate how cometary impacts might affect the atmospheric composition/chemistry of hot Jupiters, which are prime targets for characterisation. We introduce a parametrised cometary impact model that includes thermal ablation and pressure driven breakup, which we couple with the 1D `radiative-convective' atmospheric model ATMO, including disequilibrium chemistry. We use this model to investigate a wide range of impactor masses and compositions, including those based on observations of Solar System comets, and interstellar ices (with JWST). We find that even a small impactor (R = 2.5 km) can lead to significant short-term changes in the atmospheric chemistry, including a factor $>10$ enhancement in H$_2$O, CO, CO$_2$ abundances, and atmospheric opacity more generally, and the near complete removal of observable hydrocarbons, such as CH$_4$, from the upper atmosphere. These effects scale with the change in atmospheric C/O ratio and metallicity. Potentially observable changes are possible for a body that has undergone significant/continuous bombardment, such that the global atmospheric chemistry has been impacted. Our works reveals that cometary impacts can significantly alter or pollute the atmospheric composition/chemistry of hot Jupiters. These changes have the potential to mute/break the proposed link between atmospheric C/O ratio and planet formation location relative to key snowlines in the natal protoplanetary disc.",
    "authors": [
      "Felix Sainsbury-Martinez",
      "Catherine Walsh"
    ],
    "publication_date": "2024-02-08T09:39:42Z",
    "arxiv_id": "http://arxiv.org/abs/2402.05509v1",
    "download_url": "https://arxiv.org/abs/2402.05509v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The long road to calibrated prediction uncertainty in computational chemistry",
    "abstract": "Uncertainty quantification (UQ) in computational chemistry (CC) is still in its infancy. Very few CC methods are designed to provide a confidence level on their predictions, and most users still rely improperly on the mean absolute error as an accuracy metric. The development of reliable uncertainty quantification methods is essential, notably for computational chemistry to be used confidently in industrial processes. A review of the CC-UQ literature shows that there is no common standard procedure to report nor validate prediction uncertainty. I consider here analysis tools using concepts (calibration and sharpness) developed in meteorology and machine learning for the validation of probabilistic forecasters. These tools are adapted to CC-UQ and applied to datasets of prediction uncertainties provided by composite methods, Bayesian Ensembles methods, machine learning and a posteriori statistical methods.",
    "authors": [
      "Pascal Pernot"
    ],
    "publication_date": "2022-01-05T09:31:28Z",
    "arxiv_id": "http://arxiv.org/abs/2201.01511v2",
    "download_url": "https://arxiv.org/abs/2201.01511v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Role of Charge in Microdroplet Redox Chemistry",
    "abstract": "In charged water microdroplets, which occur in nature or in the lab upon ultrasonication or in electrospray processes, the thermodynamics for reactive chemistry can be dramatically altered relative to the bulk phase. Here, we provide a theoretical basis for the observation of accelerated chemistry by simulating water droplets of increasing charge imbalance to create redox agents such as hydroxyl and hydrogen radicals and solvated electrons. We compute the hydration enthalpy of OH^- and H^+ that controls the electron transfer process, and the corresponding changes in vertical ionization energy and vertical electron affinity of the ions, to create OH* and H* reactive species. We find that at ~20-50% of the Rayleigh limit of droplet charge the hydration enthalpy of both OH^- and H^+ have decreased by >50 kcal/mol such that electron transfer becomes thermodynamically favorable, in correspondence with the more favorable vertical electron affinity of H^+ and the lowered vertical ionization energy of OH^-. We provide scaling arguments that show that the nanoscale calculations and conclusions extend to the experimental microdroplet length scale. The relevance of the droplet charge for chemical reactivity is illustrated for the formation of H2O2, and has clear implications for other redox reactions observed to occur with enhanced rates in microdroplets.",
    "authors": [
      "Joseph P. Heindel",
      "R. Allen LaCour",
      "Teresa Head-Gordon"
    ],
    "publication_date": "2024-05-03T03:59:18Z",
    "arxiv_id": "http://arxiv.org/abs/2405.01836v1",
    "download_url": "https://arxiv.org/abs/2405.01836v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "H2 ro-vibrational excitation in protoplanetary disks and its effects on the chemistry",
    "abstract": "The effect of H$_2$ ro-vibrational excitation on the chemistry of protoplanetary disks is studied using a framework that solves for the disk physical and chemical structure and includes a detailed calculation of H$_2$ level populations. Chemistry with ro-vibrationally excited H$_2$ is found to be important for the formation of several commonly observed species in disks and this work demonstrates the need to accurately treat PDR chemistry in disks if we are to make inferences on the chemical state of the disk during planet formation epochs. This is found to be even more critical for molecules like C$_2$H, CN or HCN that are commonly used to infer changes in the elemental disk C/O and N/O ratios, with implications for planetesimal formation and the composition of exoplanet atmospheres. Computed vertical column densities with the full H$_2$ population calculation are increased by $\\sim1-2$ orders of magnitude for molecules such as CN, HCN/HNC compared to calculations with no treatment of excited H$_2$. For the commonly used pseudo-level approximation, the computed columns of these molecules are overestimated by a factor of $\\sim3-5$ when compared to the full model. We further note that the computed abundance for these molecules strongly depends on the strength of the FUV photons at energies that pump H$_2$ (i.e. 11-13.6 eV), which is not well constrained in disks, and that rate constants as a function of H$_2$ ro-vibrational levels for the key reaction N + H$_2\\rightarrow $ NH are needed for a more accurate assessment of CN/HCN chemistry but are currently unavailable.",
    "authors": [
      "Maxime Ruaud"
    ],
    "publication_date": "2021-02-16T17:28:59Z",
    "arxiv_id": "http://arxiv.org/abs/2102.08295v1",
    "download_url": "https://arxiv.org/abs/2102.08295v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Haze as a Biosignature in Anoxic Earth-like Atmospheres",
    "abstract": "Early Earth may have hosted a biologically-mediated global organic haze during the Archean eon (3.8-2.5 billion years ago). This haze would have significantly impacted multiple aspects of our planet, including its potential for habitability and its spectral appearance. Here, we model worlds with Archean-like levels of carbon dioxide orbiting the ancient sun and an M4V dwarf (GJ 876) and show that organic haze formation requires methane fluxes consistent with estimated Earth-like biological production rates. On planets with high fluxes of biogenic organic sulfur gases (CS2, OCS, CH3SH, and CH3SCH3), photochemistry involving these gases can drive haze formation at lower CH4/CO2 ratios than methane photochemistry alone. For a planet orbiting the sun, at 30x the modern organic sulfur gas flux, haze forms at a CH4/CO2 ratio 20% lower than at 1x the modern organic sulfur flux. For a planet orbiting the M4V star, the impact of organic sulfur gases is more pronounced: at 1x the modern Earth organic sulfur flux, a substantial haze forms at CH4/CO2 ~ 0.2, but at 30x the organic sulfur flux, the CH4/CO2 ratio needed to form haze decreases by a full order of magnitude. Detection of haze at an anomalously low CH4/CO2 ratio could suggest the influence of these biogenic sulfur gases, and therefore imply biological activity on an exoplanet. When these organic sulfur gases are not readily detectable in the spectrum of an Earth-like exoplanet, the thick organic haze they can help produce creates a very strong absorption feature at UV-blue wavelengths detectable in reflected light at a spectral resolution as low as 10. In direct imaging, constraining CH4 and CO2 concentrations will require higher spectral resolution, and R > 170 is needed to accurately resolve the structure of the CO2 feature at 1.57 μm, likely, the most accessible CO2 feature on an Archean-like exoplanet.",
    "authors": [
      "Giada N. Arney",
      "Shawn D. Domagal-Goldman",
      "Victoria S. Meadows"
    ],
    "publication_date": "2017-11-05T23:36:18Z",
    "arxiv_id": "http://arxiv.org/abs/1711.01675v1",
    "download_url": "https://arxiv.org/abs/1711.01675v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unified views of quantum simulation algorithms for chemistry",
    "abstract": "Time evolution of quantum systems is of interest in physics, in chemistry, and, more recently, in computer science. Quantum computers are suggested as one route to propagating quantum systems far more efficiently than ordinary numerical methods. In the past few years, researchers have actively been improving quantum simulation algorithms, especially those in second quantization. This work continues to advance the state-of-the-art by unifying several diverging approaches under a common framework. In particular, it highlights the similarities and differences of the first and second quantized algorithms which are usually presented in a distinct fashion. By combining aspects of the two approaches, this work moves towards an online second quantized algorithm operating within a single-Fock space. This paper also unifies a host of approaches to algorithmic quantum measurement by removing superficial differences. The aim of the effort is not only to give a high-level understanding of quantum simulation, but to move towards experimentally realizable algorithms with practical applications in chemistry and beyond.",
    "authors": [
      "James Daniel Whitfield"
    ],
    "publication_date": "2015-02-12T19:00:04Z",
    "arxiv_id": "http://arxiv.org/abs/1502.03771v1",
    "download_url": "https://arxiv.org/abs/1502.03771v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hydroxylamine in Astrophysical Ices: IR Spectra and Cosmic Ray-Induced Radiolytic Chemistry",
    "abstract": "Gas-phase hydroxylamine (NH$_2$OH) has recently been detected within dense clouds in the interstellar medium. However, it is also likely present within interstellar ices, as well as on the icy surfaces of outer Solar System bodies, where it may react to form more complex prebiotic molecules such as amino acids. In this work, we aimed to provide IR spectra of NH$_2$OH in astrophysical ice analogues that will help in the search for this molecule in various astrophysical environments. Furthermore, we aimed to provide quantitative information on the stability of NH$_2$OH upon exposure to ionizing radiation analogous to cosmic rays, as well as on the ensuing chemistry and potential formation of complex prebiotic molecules. Ices composed of NH$_2$OH, H$_2$O, and CO were prepared by vapor deposition and IR spectra were acquired between $4000-500$~cm$^{-1}$ ($2.5-20 μ$m) prior and during irradiation using 15 keV protons. In interstellar ice analogues, the most prominent IR absorption band of NH$_2$OH is that at about 1188~cm$^{-1}$, which may be a good candidate to use in searches of this species in icy space environments. Calculated effective destruction cross-sections and G-values for the NH$_2$OH-rich ices studied show that NH$_2$OH is rapidly destroyed upon exposure to ionizing radiation (more rapidly than a number of previously studied organic molecules), and that this destruction is slightly enhanced when it is mixed with other icy species. The irradiation of a NH$_2$OH:H$_2$O:CO ternary ice mixture leads to a rich chemistry that includes the formation of simple inorganic molecules such as NH$_3$, CO$_2$, OCN$^-$, and H$_2$O$_2$, as well as ammonium salts and, possibly, complex organic molecules relevant to life such as formamide, formic acid, urea, and glycine.",
    "authors": [
      "Belén Maté",
      "Ramón J. Peláez",
      "Germán Molpeceres",
      "Richárd Rácz",
      "Duncan V. Mifsud",
      "Juan Ortigoso",
      "Víctor M. Rivilla",
      "Gergő Lakatos",
      "Béla Sulik",
      "Péter Herczku",
      "Sergio Ioppolo",
      "Sándor Biri",
      "Zoltán Juhász"
    ],
    "publication_date": "2025-01-29T11:41:15Z",
    "arxiv_id": "http://arxiv.org/abs/2501.17587v1",
    "download_url": "https://arxiv.org/abs/2501.17587v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MAGellanic Outflow and chemistry Survey (MAGOS): Hot cores in the LMC",
    "abstract": "The Large Magellanic Cloud (LMC) provides a key laboratory for exploring the diversity of star formation and interstellar chemistry under subsolar metallicity conditions. We present the results of a hot core survey toward 30 massive protostellar objects in the LMC using the Atacama Large Millimeter/submillimeter Array (ALMA) at 350 GHz. Continuum imaging reveals 36 compact sources in total, among which line analyses identify 9 hot cores and 1 hot-core candidate, including two newly identified sources. We detect CO, HCO+, H13CO+, HC15N, HC3N, SiO, SO, SO+, NS, SO2, 34SO2, 33SO2, CH3OH, 13CH3OH, HCOOH, HCOOCH3, CH3OCH3, C2H5OH, H2CCO (tentative), and hydrogen recombination lines from hot cores. CH3OCH3, a complex organic molecule larger than CH3OH, is detected for the first time in a hot core outside the LMC bar region. All hot cores show stronger emission in the high-excitation SO line compared to non-hot-core sources, suggesting that its strong detection will be useful for identifying hot-core candidates in the LMC. Chemical analysis reveals a spread of more than two orders of magnitude in CH3OH abundances, with some sources deficient in COMs. In contrast, SO2 is detected in all hot cores, and its abundance shows a good correlation with rotational temperature. The hot cores without CH3OH detections are all located outside the LMC bar region and are characterized by either high luminosity or active star formation in their surroundings. A combination of locally low metallicity, active star formation in the vicinity, and high protostellar luminosity may jointly trigger the COM-poor hot core chemistry observed in the LMC.",
    "authors": [
      "Takashi Shimonishi",
      "Kei E. I. Tanaka",
      "Yichen Zhang",
      "Kenji Furuya",
      "Yu Cheng",
      "Asako Sato"
    ],
    "publication_date": "2025-12-17T21:27:19Z",
    "arxiv_id": "http://arxiv.org/abs/2512.15983v1",
    "download_url": "https://arxiv.org/abs/2512.15983v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Luttinger to Fermi liquids in organic conductors",
    "abstract": "This chapter reviews the effects of interactions in quasi-one dimensional systems, such as the Bechgaard and Fabre salts, and in particular the Luttinger liquid physics. It discusses in details how transport measurements both d.c. and a.c. allow to probe such a physics. It also examine the dimensional crossover and deconfinement transition occurring between the one dimensional case and the higher dimensional one resulting from the hopping of electrons between chains in the quasi-one dimensional structure.",
    "authors": [
      "T. Giamarchi"
    ],
    "publication_date": "2007-02-24T02:20:39Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0702565v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0702565v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Immersive Interactive Quantum Mechanics for Teaching and Learning Chemistry",
    "abstract": "The impossibility of experiencing the molecular world with our senses hampers teaching and understanding chemistry because very abstract concepts (such as atoms, chemical bonds, molecular structure, reactivity) are required for this process. Virtual reality, especially when based on explicit physical modeling (potentially in real time), offers a solution to this dilemma. Chemistry teaching can make use of advanced technologies such as virtual-reality frameworks and haptic devices. We show how an immersive learning setting could be applied to help students understand the core concepts of typical chemical reactions by offering a much more intuitive approach than traditional learning settings. Our setting relies on an interactive exploration and manipulation of a chemical system; this system is simulated in real-time with quantum chemical methods, and therefore, behaves in a physically meaningful way.",
    "authors": [
      "Thomas Weymuth",
      "Markus Reiher"
    ],
    "publication_date": "2020-11-06T09:37:04Z",
    "arxiv_id": "http://arxiv.org/abs/2011.03256v1",
    "download_url": "https://arxiv.org/abs/2011.03256v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A survey on Big Data and Machine Learning for Chemistry",
    "abstract": "Herein we review aspects of leading-edge research and innovation in chemistry which exploits big data and machine learning (ML), two computer science fields that combine to yield machine intelligence. ML can accelerate the solution of intricate chemical problems and even solve problems that otherwise would not be tractable. But the potential benefits of ML come at the cost of big data production; that is, the algorithms, in order to learn, demand large volumes of data of various natures and from different sources, from materials properties to sensor data. In the survey, we propose a roadmap for future developments, with emphasis on materials discovery and chemical sensing, and within the context of the Internet of Things (IoT), both prominent research fields for ML in the context of big data. In addition to providing an overview of recent advances, we elaborate upon the conceptual and practical limitations of big data and ML applied to chemistry, outlining processes, discussing pitfalls, and reviewing cases of success and failure.",
    "authors": [
      "Jose F Rodrigues",
      "Larisa Florea",
      "Maria C F de Oliveira",
      "Dermot Diamond",
      "Osvaldo N Oliveira"
    ],
    "publication_date": "2019-04-23T15:11:45Z",
    "arxiv_id": "http://arxiv.org/abs/1904.10370v1",
    "download_url": "https://arxiv.org/abs/1904.10370v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry During the Gas-rich Stage of Planet Formation",
    "abstract": "In this chapter we outline some of the basic understanding of the chemistry that accompanies planet formation. We discuss the basic physical environment which dictates the dominant chemical kinetic pathways for molecule formation. We focus on three zones from both observational and theoretical perspectives: (1) the planet forming midplane and ice/vapor transition zones (snow-lines), (2) the warm disk surface that is shielded from radiation, which can be readily accessed by todays observational facilities, and (3) the surface photodissociation layers where stellar radiation dominates. We end with a discussion of how chemistry influences planet formation along with how to probe the link between formation and ultimate atmospheric composition for gas giants and terrestrial worlds.",
    "authors": [
      "Edwin A. Bergin",
      "L. Ilsedore Cleeves"
    ],
    "publication_date": "2018-07-25T14:38:06Z",
    "arxiv_id": "http://arxiv.org/abs/1807.09635v1",
    "download_url": "https://arxiv.org/abs/1807.09635v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The diverse chemistry of protoplanetary disks as revealed by JWST",
    "abstract": "Early results from the JWST-MIRI guaranteed time programs on protostars (JOYS) and disks (MINDS) are presented. Thanks to the increased sensitivity, spectral and spatial resolution of the MIRI spectrometer, the chemical inventory of the planet-forming zones in disks can be investigated with unprecedented detail across stellar mass range and age. Here data are presented for five disks, four around low-mass stars and one around a very young high-mass star. The mid-infrared spectra show some similarities but also significant diversity: some sources are rich in CO2, others in H2O or C2H2. In one disk around a very low-mass star, booming C2H2 emission provides evidence for a ``soot'' line at which carbon grains are eroded and sublimated, leading to a rich hydrocarbon chemistry in which even di-acetylene (C4H2) and benzene (C6H6) are detected (Tabone et al. 2023). Together, the data point to an active inner disk gas-phase chemistry that is closely linked to the physical structure (temperature, snowlines, presence of cavities and dust traps) of the entire disk and which may result in varying CO2/H2O abundances and high C/O ratios >1 in some cases. Ultimately, this diversity in disk chemistry will also be reflected in the diversity of the chemical composition of exoplanets.",
    "authors": [
      "Ewine F. van Dishoeck",
      "S. Grant",
      "B. Tabone",
      "M. van Gelder",
      "L. Francis",
      "L. Tychoniec",
      "G. Bettoni",
      "A. M. Arabhavi",
      "D. Gasman",
      "P. Nazari",
      "M. Vlasblom",
      "P. Kavanagh",
      "V. Christiaens",
      "P. Klaassen",
      "H. Beuther",
      "Th. Henning",
      "I. Kamp"
    ],
    "publication_date": "2023-07-21T18:00:04Z",
    "arxiv_id": "http://arxiv.org/abs/2307.11817v1",
    "download_url": "https://arxiv.org/abs/2307.11817v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Artificial Chemistry Implementation of a Gene Regulatory Network",
    "abstract": "Gene Regulatory Networks are networks of interactions in biological organisms responsible for determining the production levels of proteins and peptides. Proteins are workers of a cell factory, and their production defines the goal of a cell and its development. Various attempts have been made to model such networks both to understand these biological systems better and to use inspiration from understanding them to solve computational problems. In this work, a biologically more realistic model for gene regulatory networks is proposed, which incorporates Cellular Automata and Artificial Chemistry to model the interactions between regulatory proteins called the Transcription Factors and the regulatory sites of genes. The result of this work shows complex dynamics close to what can be observed in nature. Here, an analysis of the impact of the initial states of the system on the produced dynamics is performed, showing that such evolvable models can be directed towards producing desired protein dynamics.",
    "authors": [
      "Iliya Miralavy",
      "Wolfgang Banzhaf"
    ],
    "publication_date": "2022-09-09T04:06:39Z",
    "arxiv_id": "http://arxiv.org/abs/2209.04114v1",
    "download_url": "https://arxiv.org/abs/2209.04114v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ChemDFM-X: Towards Large Multimodal Model for Chemistry",
    "abstract": "Rapid developments of AI tools are expected to offer unprecedented assistance to the research of natural science including chemistry. However, neither existing unimodal task-specific specialist models nor emerging general large multimodal models (LMM) can cover the wide range of chemical data modality and task categories. To address the real demands of chemists, a cross-modal Chemical General Intelligence (CGI) system, which serves as a truly practical and useful research assistant utilizing the great potential of LMMs, is in great need. In this work, we introduce the first Cross-modal Dialogue Foundation Model for Chemistry (ChemDFM-X). Diverse multimodal data are generated from an initial modality by approximate calculations and task-specific model predictions. This strategy creates sufficient chemical training corpora, while significantly reducing excessive expense, resulting in an instruction-tuning dataset containing 7.6M data. After instruction finetuning, ChemDFM-X is evaluated on extensive experiments of different chemical tasks with various data modalities. The results demonstrate the capacity of ChemDFM-X for multimodal and inter-modal knowledge comprehension. ChemDFM-X marks a significant milestone toward aligning all modalities in chemistry, a step closer to CGI.",
    "authors": [
      "Zihan Zhao",
      "Bo Chen",
      "Jingpiao Li",
      "Lu Chen",
      "Liyang Wen",
      "Pengyu Wang",
      "Zichen Zhu",
      "Danyang Zhang",
      "Ziping Wan",
      "Yansi Li",
      "Zhongyang Dai",
      "Xin Chen",
      "Kai Yu"
    ],
    "publication_date": "2024-09-20T03:55:34Z",
    "arxiv_id": "http://arxiv.org/abs/2409.13194v2",
    "download_url": "https://arxiv.org/abs/2409.13194v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Electronic Classifiers for Sensing",
    "abstract": "This monograph describes nine years of research carried out at the Institute for Electronics, Micro-electronics and Nanotechnologies (IEMN), developed around defining a generic concept for detection, filling a void between metrological sensors and biological senses, sensing an environment's qualities along with their measurable properties in information generation technologies. The first chapter introduces fundamental notions of recognition for complex environments, such as for their chemistry, for which organic semiconductors can embed two new functionalities in consumer electronics. The second and third chapters mostly summarize contributions to the state-of-the-art literature on these matters: in the second chapter, on studying conducting polymers as both chemical detectors and conductimetric transducers, and the third chapter, on studying electropolymerization sensitivity to conceptualize evolutionary electronics. The fourth chapter presents several results on the conception of several \"classifiers\" exploiting both functionalities: in tasks aiming at integrating different sensitivities at a very small scale, at broadening sensing devices' receptive fields based on experience, and at physically engraving the experience data in a sensing hardware. Along with this monograph are also associated four appendices, summarizing different elements related to the context of this research.",
    "authors": [
      "Sébastien Pecqueur"
    ],
    "publication_date": "2025-07-09T08:46:26Z",
    "arxiv_id": "http://arxiv.org/abs/2507.06660v1",
    "download_url": "https://arxiv.org/abs/2507.06660v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Bayesian Flow Network Framework for Chemistry Tasks",
    "abstract": "In this work, we introduce ChemBFN, a language model that handles chemistry tasks based on Bayesian flow networks working on discrete data. A new accuracy schedule is proposed to improve the sampling quality by significantly reducing the reconstruction loss. We show evidence that our method is appropriate for generating molecules with satisfied diversity even when a smaller number of sampling steps is used. A classifier-free guidance method is adapted for conditional generation. It is also worthwhile to point out that after generative training, our model can be fine-tuned on regression and classification tasks with the state-of-the-art performance, which opens the gate of building all-in-one models in a single module style. Our model has been open sourced at https://github.com/Augus1999/bayesian-flow-network-for-chemistry.",
    "authors": [
      "Nianze Tao",
      "Minori Abe"
    ],
    "publication_date": "2024-07-28T04:46:32Z",
    "arxiv_id": "http://arxiv.org/abs/2407.20294v2",
    "download_url": "https://arxiv.org/abs/2407.20294v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Carbon-grain sublimation: a new top-down component of protostellar chemistry",
    "abstract": "Earth's carbon deficit has been an outstanding problem in our understanding of the formation of our Solar System. A possible solution would be the sublimation of carbon grains at the so-called soot line (~300 K) early in the planet-formation process. Here, we argue that the most likely signatures of this process are an excess of hydrocarbons and nitriles inside the soot line, and a higher excitation temperature for these molecules compared to oxygen-bearing complex organics that desorb around the water snowline (~100 K). Such characteristics have been reported in the literature, for example, in Orion KL, although not uniformly, potentially due to differences in observational settings and analysis methods of different studies or related to the episodic nature of protostellar accretion. If this process is active, this would mean that there is a heretofore unknown component to the carbon chemistry during the protostellar phase that is acting from the top down - starting from the destruction of larger species - instead of from the bottom up from atoms. In the presence of such a top-down component, the origin of organic molecules needs to be re-explored.",
    "authors": [
      "Merel L. R. van 't Hoff",
      "Edwin A. Bergin",
      "Jes K. Jørgensen",
      "Geoffrey A. Blake"
    ],
    "publication_date": "2020-06-22T18:00:09Z",
    "arxiv_id": "http://arxiv.org/abs/2006.12522v1",
    "download_url": "https://arxiv.org/abs/2006.12522v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ice Chemistry Modeling of Active Phase Comets: Hale-Bopp",
    "abstract": "We present a chemical kinetics model of the solid-phase chemical evolution of a comet, beginning with a long period of cold-storage in the Oort Cloud, followed by five orbits that bring the comet close to the Sun. The chemical model is based on an earlier treatment that considered only the cold-storage phase, and which was based on the interstellar ice chemical kinetics model MAGICKAL. The comet is treated as 25 chemically distinct layers. Updates to the previous model includes: (i) Time- and depth-dependent temperature profiles according to heliocentric distance; (ii) a rigorous treatment of back-diffusion for species capable of diffusing through the bulk-ice layers; (iii) adoption of recent improvements in the kinetic treatment of nondiffusive chemical reaction rates. Starting from an initially simple ice composition, interstellar UV photons drive a rapid chemistry in the upper micron of material, but diminished by absorption of the UV by the dust component. Galactic cosmic rays (GCRs) drive a much slower chemistry in the deeper ices over the long cold-storage period down to 10 m. The first solar approach drives off the upper layers of ice material via thermal desorption and/or dissociation, bringing closer to the surface the deeper material that previously underwent long-term processing by GCRs. Subsequent orbits are more uniform in their chemical behavior. Loss of molecular material leads to concentration of the dust in the upper layers. Substantial quantities of complex organic molecules are formed in the upper 10 m during the cold storage phase, with some of this material released during solar approach; however, their abundances with respect to water appear too low to account for the observed gas-phase values for comet Hale-Bopp, indicating that the majority of complex molecular material observed, at least in comet Hale-Bopp, is an inheritance of primordial material.",
    "authors": [
      "Eric R. Willis",
      "Drew A. Christianson",
      "Robin T. Garrod"
    ],
    "publication_date": "2024-08-28T03:43:36Z",
    "arxiv_id": "http://arxiv.org/abs/2408.15509v1",
    "download_url": "https://arxiv.org/abs/2408.15509v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling the gas-phase chemistry of the transitional disk around HD 141569A",
    "abstract": "Aims: The chemistry, distribution and mass of the gas in the transitional disk around the 5 Myr old B9.5 V star HD 141569A are constrained.\n  Methods: A quasi 2-dimensional (2D) chemistry code for photon dominated regions (PDR) is used to calculate the chemistry and gas temperatures in the disk. The calculations are performed for several gas distributions, PAH abundances and values of the total gas mass. The resulting CO J=2-1 and J=3-2 emission lines are computed with a 2D radiative transfer code and are compared to observations.\n  Results: The CO abundance is very sensitive to the total disk mass because the disk is in a regime where self-shielding just sets in. The observed CO emission lines are best fit by a power-law gas distribution of 80 M_earth starting at 80 AU from the central star, indicating that there is some gas in the inner hole. Predictions are made for intensities of atomic fine-structure lines. [C I], which is the dominant form of carbon in large parts of the disk, is found to be a good alternative tracer of the gas mass.",
    "authors": [
      "B. Jonkheid",
      "I. Kamp",
      "J. -C. Augereau",
      "E. F. van Dishoeck"
    ],
    "publication_date": "2006-03-19T15:58:51Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0603515v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0603515v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electronic functionalization of the surface of organic semiconductors with self-assembled monolayers",
    "abstract": "Molecular self-assembly has been extensively used for surface modification of metals and oxides for a variety of applications, including molecular and organic electronics. One of the goals of this research is to learn how the electronic properties of these surfaces can be modified by self-assembled monolayers (SAM). Here, we demonstrate a new type of molecular self-assembly: the growth of organosilane SAMs at the surface of organic semiconductors, which results in a dramatic increase of the surface conductivity of organic materials. For organosilane molecules with a large dipole moment, SAM-induced surface conductivity of organic molecular crystals approaches 10^-5 S per square, which is comparable to the highest conductivity realized in organic field-effect transistors (OFETs) at ultra-high densities of charge carriers. SAM-functionalized organic surfaces are fully accessible to the environment which makes them very attractive for sensing applications. We have observed that the interaction of vapors of polar molecules with SAM-functionalized organic semiconductors results in a fast and reversible change of the conductivity, proportional to the pressure of an analyte vapor.",
    "authors": [
      "M. F. Calhoun",
      "J. Sanchez",
      "D. Olaya",
      "M. E. Gershenson",
      "V. Podzorov*"
    ],
    "publication_date": "2007-10-09T05:33:51Z",
    "arxiv_id": "http://arxiv.org/abs/0710.1686v1",
    "download_url": "https://arxiv.org/abs/0710.1686v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Embedded Silicon-Organic Integrated Neuromorphic System",
    "abstract": "The development of artificial intelligence (AI) and robotics are both based on the tenet of \"science and technology are people-oriented\", and both need to achieve efficient communication with the human brain. Based on multi-disciplinary research in systems neuroscience, computer architecture, and functional organic materials, we proposed the concept of using AI to simulate the operating principles and materials of the brain in hardware to develop brain-inspired intelligence technology, and realized the preparation of neuromorphic computing devices and basic materials. We simulated neurons and neural networks in terms of material and morphology, using a variety of organic polymers as the base materials for neuroelectronic devices, for building neural interfaces as well as organic neural devices and silicon neural computational modules. We assemble organic artificial synapses with simulated neurons from silicon-based Field-Programmable Gate Array (FPGA) into organic artificial neurons, the basic components of neural networks, and later construct biological neural network models based on the interpreted neural circuits. Finally, we also discuss how to further build neuromorphic devices based on these organic artificial neurons, which have both a neural interface friendly to nervous tissue and interact with information from real biological neural networks.",
    "authors": [
      "Shengjie Zheng",
      "Ling Liu",
      "Junjie Yang",
      "Jianwei Zhang",
      "Tao Su",
      "Bin Yue",
      "Xiaojian Li"
    ],
    "publication_date": "2022-10-18T01:56:48Z",
    "arxiv_id": "http://arxiv.org/abs/2210.12064v2",
    "download_url": "https://arxiv.org/abs/2210.12064v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Impact of Size-dependent Grain Temperature on Gas-Grain Chemistry in Protoplanetary Disks: the case of low mass star disks",
    "abstract": "Grain surface chemistry is key to the composition of protoplanetary disks around young stars. The temperature of grains depends on their size. We evaluate the impact of this temperature dependence on the disk chemistry. We model a moderately massive disk with 16 different grain sizes. We use POLARIS to calculate the dust grain temperatures and the local UV flux. We model the chemistry using the 3-phase astrochemical code NAUTILUS. Photoprocesses are handled using frequency-dependent cross-sections, and a new method to account for self and mutual shielding. The multi-grain model outputs are compared to those of single-grain size models (0.1 $μ$m), with two different assumptions for their equivalent temperature. We find that the Langmuir-Hinshelwood (LH) mechanism at equilibrium temperature is not efficient to form H$_2$ at 3-4 scale heights ($H$), and adopt a parametric fit to a stochastic method to model H$_2$ formation instead. We find the molecular layer composition (1-3 $H$) to depend on the amount of remaining H atoms. Differences in molecular surface densities between single and multi-grain models are mostly due to what occurs above 1.5 $H$. At 100 au, models with colder grains produce H$_2$O and CH$_4$ ices in the midplane, and warmer ones produce more CO$_2$ ices, both allowing efficient depletion of C and O as soon as CO sticks on grain surfaces. Complex organic molecules (COMs) production is enhanced by the presence of warmer grains in the multi-grain models. Using a single grain model mimicking grain growth and dust settling fails to reproduce the complexity of gas-grain chemistry. Chemical models with a single grain size are sensitive to the adopted grain temperature, and cannot account for all expected effects. A spatial spread of the snowlines is expected to result from the ranges in grain temperature. The amplitude of the effects will depend on the dust disk mass.",
    "authors": [
      "S. Gavino",
      "A. Dutrey",
      "V. Wakelam",
      "S. Guilloteau",
      "J. Kobus",
      "S. Wolf",
      "W. Iqbal",
      "E. Di Folco",
      "E. Chapillon",
      "V. Piétu"
    ],
    "publication_date": "2021-06-10T16:16:17Z",
    "arxiv_id": "http://arxiv.org/abs/2106.05888v1",
    "download_url": "https://arxiv.org/abs/2106.05888v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Simulation of 2D Quantum Chemistry in Optical Lattices",
    "abstract": "Benchmarking numerical methods in quantum chemistry is one of the key opportunities that quantum simulators can offer. Here, we propose an analog simulator for discrete 2D quantum chemistry models based on cold atoms in optical lattices. We first analyze how to simulate simple models, like the discrete versions of H and H$_2^+$, using a single fermionic atom. We then show that a single bosonic atom can mediate an effective Coulomb repulsion between two fermions, leading to the analog of molecular Hydrogen in two dimensions. We extend this approach to larger systems by introducing as many mediating atoms as fermions, and derive the effective repulsion law. In all cases, we analyze how the continuous limit is approached for increasing optical lattice sizes.",
    "authors": [
      "Javier Argüello-Luengo",
      "Alejandro González-Tudela",
      "Tao Shi",
      "Peter Zoller",
      "J. Ignacio Cirac"
    ],
    "publication_date": "2020-02-21T16:00:36Z",
    "arxiv_id": "http://arxiv.org/abs/2002.09373v1",
    "download_url": "https://arxiv.org/abs/2002.09373v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Determining the effects of clumping and porosity on the chemistry in a non-uniform AGB outflow",
    "abstract": "(abridged) In the inner regions of AGB outflows, several molecules have been detected with abundances much higher than those predicted from thermodynamic equilibrium (TE) chemical models. The presence of the majority of these species can be explained by shock-induced non-TE chemical models, where shocks caused by the pulsating star take the chemistry out of TE in the inner region. Moreover, a non-uniform density structure has been detected in several AGB outflows. A detailed parameter study on the quantitative effects of a non-homogeneous outflow has so far not been performed. We implement a porosity formalism for treating the increased leakage of light associated with radiation transport through a clumpy, porous medium. The effects from the altered UV radiation field penetration on the chemistry, accounting also for the increased reaction rates of two-body processes in the overdense clumps, are examined. We present a parameter study of the effect of clumping and porosity on the chemistry throughout the outflow. Both the higher density within the clumps and the increased UV radiation field penetration have an important impact on the chemistry, as they both alter the chemical pathways. The increased amount of UV radiation in the inner region leads to photodissociation of parent species, releasing the otherwise deficient elements. We find an increased abundance in the inner region of all species not expected to be present assuming TE chemistry, such as HCN in O-rich outflows, H$_2$O in C-rich outflows, and NH$_3$ in both. Outflows whose clumps have a large overdensity and that are very porous to the interstellar UV radiation field yield abundances comparable to those observed in O- and C-rich outflows for most of the unexpected species investigated. The inner wind abundances of H$_2$O in C-rich outflows and of NH$_3$ in O- and C-rich outflows are however underpredicted.",
    "authors": [
      "M. Van de Sande",
      "J. O. Sundqvist",
      "T. J. Millar",
      "D. Keller",
      "W. Homan",
      "A. de Koter",
      "L. Decin",
      "F. De Ceuster"
    ],
    "publication_date": "2018-03-05T17:39:18Z",
    "arxiv_id": "http://arxiv.org/abs/1803.01796v2",
    "download_url": "https://arxiv.org/abs/1803.01796v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cosmic dust fertilization of glacial prebiotic chemistry on early Earth",
    "abstract": "Earth's surface is deficient in available forms of many elements considered limiting for prebiotic chemistry. In contrast, many extraterrestrial rocky objects are rich in these same elements. Limiting prebiotic ingredients may, therefore, have been delivered by exogenous material; however, the mechanisms by which exogeneous material may be reliably and non-destructively supplied to a planetary surface remains unclear. Today, the flux of extraterrestrial matter to Earth is dominated by fine-grained cosmic dust. Although this material is rarely discussed in a prebiotic context due to its delivery over a large surface area, concentrated cosmic dust deposits are known to form on Earth today due to the action of sedimentary processes. Here we combine empirical constraints on dust sedimentation with dynamical simulations of dust formation and planetary accretion to show that localized sedimentary deposits of cosmic dust could have accumulated in arid environments on early Earth, in particular glacial settings that today produce cryoconite sediments. Our results challenge the widely held assumption that cosmic dust is incapable of fertilizing prebiotic chemistry. Cosmic dust deposits may have plausibly formed on early Earth and acted to fertilize prebiotic chemistry.",
    "authors": [
      "Craig R. Walton",
      "Jessica K. Rigley",
      "Alexander Lipp",
      "Robert Law",
      "Martin D. Suttle",
      "Maria Schonbachler",
      "Mark Wyatt",
      "Oliver Shorttle"
    ],
    "publication_date": "2024-02-19T17:31:16Z",
    "arxiv_id": "http://arxiv.org/abs/2402.12310v1",
    "download_url": "https://arxiv.org/abs/2402.12310v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Chemistry at Finite Temperature",
    "abstract": "In this article, we present emerging fields of quantum chemistry at finite temperature. We discuss its recent developments on both experimental and theoretical fronts. First, we describe several experimental investigations related to the temperature effects on the structures, electronic spectra, or bond rupture forces for molecules. These include the analysis of the temperature impact on the pathway shifts for the protein unfolding by atomic force microscopy (AFM), the temperature dependence of the absorption spectra of electrons in solvents, and the temperature influence over the intermolecular forces measured by the AFM. On the theoretical side, we review advancements made by the author in the coming fields of quantum chemistry at finite temperature. Starting from the Bloch equation, we have derived the sets of hierarchy equations for the reduced density operators in both canonical and grand canonical ensembles. They provide a law according to which the reduced density operators vary in temperature for the identical and interacting many-body systems. By taking the independent particle approximation, we have solved the equations in the case of a grand canonical ensemble, and obtained an energy eigenequation for the molecular orbitals at finite temperature. The explicit expression for the temperature-dependent Fock operator is also given. They form a mathematical foundation for the examination of the molecular electronic structures and their interplay with finite temperature. Moreover, we clarify the physics concerning the temperature effects on the electronic structures or processes of the molecules, which is crucial for both theoretical understanding and computation. Finally, ....",
    "authors": [
      "Liqiang Wei"
    ],
    "publication_date": "2006-05-23T01:42:34Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0605549v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0605549v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Chemistry of Extragalactic Globular Clusters",
    "abstract": "We present preliminary results of VLT/FORS spectroscopy of globular clusters in nearby early-type galaxies. Our project aims at studying the chemistry and determine the ages of globular cluster (sub-)populations. First results indicate that the different galaxies host from little to significant intermediate-age populations, and that the latter have alpha-element over iron ratios closer to solar than the old population that show an alpha-element enhancement similar to the diffuse stellar light.",
    "authors": [
      "M. Kissler-Patig",
      "T. H. Puzia",
      "R. Bender",
      "P. Goudfrooij",
      "M. Hempel",
      "C. Maraston",
      "T. Richtler",
      "R. Saglia",
      "D. Thomas"
    ],
    "publication_date": "2002-10-18T13:40:22Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0210419v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0210419v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Advancing Surface Chemistry with Large-Scale Ab-Initio Quantum Many-Body Simulations",
    "abstract": "Predictive simulation of surface chemistry is of paramount importance for progress in fields from catalysis to electrochemistry and clean energy generation. Ab-initio quantum many-body methods should be offering deep insights into these systems at the electronic level, but are limited in their efficacy by their steep computational cost. In this work, we build upon state-of-the-art correlated wavefunctions to reliably converge to the `gold standard' accuracy in quantum chemistry for application to extended surface chemistry. Efficiently harnessing graphics processing unit acceleration along with systematically improvable multiscale resolution techniques, we achieve linear computational scaling up to 392 atoms in size. These large-scale simulations demonstrate the importance of converging to these extended system sizes, achieving a validating handshake between simulations with different boundary conditions for the interaction of water on a graphene surface. We provide a new benchmark for this water-graphene interaction that clarifies the preference for water orientations at the graphene interface. This is extended to the adsorption of carbonaceous molecules on chemically complex surfaces, including metal oxides and metal-organic frameworks, where we consistently achieve chemical accuracy compared to experimental references, and well inside the scatter of traditional density functional material modeling approaches. This pushes the state of the art for simulation of molecular adsorption on surfaces, and marks progress into a post-density functional era for more reliable and improvable approaches to first-principles modeling of surface problems at an unprecedented scale and accuracy using ab-initio quantum many-body methods.",
    "authors": [
      "Zigeng Huang",
      "Zhen Guo",
      "Changsu Cao",
      "Hung Q. Pham",
      "Xuelan Wen",
      "George H. Booth",
      "Ji Chen",
      "Dingshun Lv"
    ],
    "publication_date": "2024-12-24T17:07:18Z",
    "arxiv_id": "http://arxiv.org/abs/2412.18553v2",
    "download_url": "https://arxiv.org/abs/2412.18553v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Introduction to the Density Matrix Renormalization Group Ansatz in Quantum Chemistry",
    "abstract": "The Density Matrix Renormalisation Group (DMRG) is an electronic structure method that has recently been applied to ab-initio quantum chemistry. Even at this early stage, it has enabled the solution of many problems that would previously have been intractable with any other method, in particular, multireference problems with very large active spaces. Historically, the DMRG was not originally formulated from a wavefunction perspective, but rather in a Renormalisation Group (RG) language. However, it is now realised that a wavefunction view of the DMRG provides a more convenient, and in some cases more powerful, paradigm. Here we provide an expository introduction to the DMRG ansatz in the context of quantum chemistry.",
    "authors": [
      "Garnet Kin-Lic Chan",
      "Jonathan J. Dorando",
      "Debashree Ghosh",
      "Johannes Hachmann",
      "Eric Neuscamman",
      "Haitao Wang",
      "Takeshi Yanai"
    ],
    "publication_date": "2007-11-09T01:54:03Z",
    "arxiv_id": "http://arxiv.org/abs/0711.1398v1",
    "download_url": "https://arxiv.org/abs/0711.1398v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the chemistry of hydrides of N atoms and O$^+$ ions",
    "abstract": "Previous work by various authors has suggested that the detection by Herschel/HIFI of nitrogen hydrides along the low density lines of sight towards G10.6-0.4 (W31C) cannot be accounted for by gas-phase chemical models. In this paper we investigate the role of surface reactions on dust grains in diffuse regions, and we find that formation of the hydrides by surface reactions on dust grains with efficiency comparable to that for H$_2$ formation reconciles models with observations of nitrogen hydrides. However, similar surface reactions do not contribute significantly to the hydrides of O$^+$ ions detected by Herschel/HIFI present along many sight lines in the Galaxy. The O$^+$ hydrides can be accounted for by conventional gas-phase chemistry either in diffuse clouds of very low density with normal cosmic ray fluxes or in somewhat denser diffuse clouds with high cosmic ray fluxes. Hydride chemistry in dense dark clouds appears to be dominated by gas-phase ion-molecule reactions.",
    "authors": [
      "Zainab Awad",
      "Serena Viti",
      "David A. Williams"
    ],
    "publication_date": "2016-05-27T10:45:06Z",
    "arxiv_id": "http://arxiv.org/abs/1605.08573v2",
    "download_url": "https://arxiv.org/abs/1605.08573v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The density matrix renormalization group for ab initio quantum chemistry",
    "abstract": "During the past 15 years, the density matrix renormalization group (DMRG) has become increasingly important for ab initio quantum chemistry. Its underlying wavefunction ansatz, the matrix product state (MPS), is a low-rank decomposition of the full configuration interaction tensor. The virtual dimension of the MPS, the rank of the decomposition, controls the size of the corner of the many-body Hilbert space that can be reached with the ansatz. This parameter can be systematically increased until numerical convergence is reached. The MPS ansatz naturally captures exponentially decaying correlation functions. Therefore DMRG works extremely well for noncritical one-dimensional systems. The active orbital spaces in quantum chemistry are however often far from one-dimensional, and relatively large virtual dimensions are required to use DMRG for ab initio quantum chemistry (QC-DMRG). The QC-DMRG algorithm, its computational cost, and its properties are discussed. Two important aspects to reduce the computational cost are given special attention: the orbital choice and ordering, and the exploitation of the symmetry group of the Hamiltonian. With these considerations, the QC-DMRG algorithm allows to find numerically exact solutions in active spaces of up to 40 electrons in 40 orbitals.",
    "authors": [
      "Sebastian Wouters",
      "Dimitri Van Neck"
    ],
    "publication_date": "2014-07-08T11:25:42Z",
    "arxiv_id": "http://arxiv.org/abs/1407.2040v1",
    "download_url": "https://arxiv.org/abs/1407.2040v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Neutral-Neutral Synthesis of Organic Molecules in Cometary Comae",
    "abstract": "Remote and in-situ observations of cometary gases have revealed the presence of a wealth of complex organic molecules, including carbon chains, alcohols, imines and the amino acid glycine. Such chemical complexity in cometary material implies that impacts by comets could have supplied reagents for prebiotic chemistry to young planetary surfaces. However, the assumption that some of the molecules observed in cometary comae at millimetre wavelengths originate from ices stored inside the nucleus has not yet been proven. In fact, the comae of moderately-active comets reach sufficient densities within a few thousand kilometers of the nucleus for an active (solar radiation-driven) photochemistry to ensue. Here we present results from our latest chemical-hydrodynamic models incorporating an updated reaction network, and show that the commonly-observed HC3N (cyanoacetylene) and NH2CHO (formamide) molecules can be efficiently produced in cometary comae as a result of two-body, neutral-neutral, gas-phase reactions involving well-known coma gases. In the presence of a near-nucleus distributed source of CN (similar to that observed by the Rosetta spacecraft at comet 67P), we find that sufficient HC$_3$N and NH2CHO can be synthesized to match the abundances of these molecules in previous observations of Oort Cloud comets. The precise origin of these (and other) complex organic molecules in cometary comae can be verified through interferometric mapping observations, for example, using the Atacama Large Millimeter/submillimeter Array (ALMA).",
    "authors": [
      "M. A Cordiner",
      "S. B. Charnley"
    ],
    "publication_date": "2021-04-15T16:30:25Z",
    "arxiv_id": "http://arxiv.org/abs/2104.07577v1",
    "download_url": "https://arxiv.org/abs/2104.07577v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry in a gravitationally unstable protoplanetary disc",
    "abstract": "Until now, axisymmetric, alpha-disc models have been adopted for calculations of the chemical composition of protoplanetary discs. While this approach is reasonable for many discs, it is not appropriate when self-gravity is important. In this case, spiral waves and shocks cause temperature and density variations that affect the chemistry. We have adopted a dynamical model of a solar-mass star surrounded by a massive (0.39 Msun), self-gravitating disc, similar to those that may be found around Class 0 and early Class I protostars, in a study of disc chemistry. We find that for each of a number of species, e.g. H2O, adsorption and desorption dominate the changes in the gas-phase fractional abundance; because the desorption rates are very sensitive to temperature, maps of the emissions from such species should reveal the locations of shocks of varying strengths. The gas-phase fractional abundances of some other species, e.g. CS, are also affected by gas-phase reactions, particularly in warm shocked regions. We conclude that the dynamics of massive discs have a strong impact on how they appear when imaged in the emission lines of various molecular species.",
    "authors": [
      "J. D. Ilee",
      "A. C. Boley",
      "P. Caselli",
      "R. H. Durisen",
      "T. W. Hartquist",
      "J. M. C. Rawlings"
    ],
    "publication_date": "2011-07-15T11:00:19Z",
    "arxiv_id": "http://arxiv.org/abs/1107.3041v1",
    "download_url": "https://arxiv.org/abs/1107.3041v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Energetic disorder at the metal/organic semiconductor interface",
    "abstract": "The physics of organic semiconductors is dominated by the effects of energetic disorder. We show that image forces reduce the electrostatic component of the total energetic disorder near an interface with a metal electrode. Typically, the variance of energetic disorder is dramatically reduced at the first few layers of organic semiconductor molecules adjacent to the metal electrode. Implications for charge injection into organic semiconductors are discussed.",
    "authors": [
      "S. V. Novikov",
      "G. G. Malliaras"
    ],
    "publication_date": "2005-06-29T11:28:54Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0506762v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0506762v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards practical and massively parallel quantum computing emulation for quantum chemistry",
    "abstract": "Quantum computing is moving beyond its early stage and seeking for commercial applications in chemical and biomedical sciences. In the current noisy intermediate-scale quantum computing era, quantum resource is too scarce to support these explorations. Therefore, it is valuable to emulate quantum computing on classical computers for developing quantum algorithms and validating quantum hardware. However, existing simulators mostly suffer from the memory bottleneck so developing the approaches for large-scale quantum chemistry calculations remains challenging. Here we demonstrate a high-performance and massively parallel variational quantum eigensolver (VQE) simulator based on matrix product states, combined with embedding theory for solving large-scale quantum computing emulation for quantum chemistry on HPC platforms. We apply this method to study the torsional barrier of ethane and the quantification of the protein-ligand interactions. Our largest simulation reaches $1000$ qubits, and a performance of $216.9$ PFLOPS is achieved on a new Sunway supercomputer, which sets the state-of-the-art for quantum computing emulation for quantum chemistry",
    "authors": [
      "Honghui Shang",
      "Yi Fan",
      "Li Shen",
      "Chu Guo",
      "Jie Liu",
      "Xiaohui Duan",
      "Fang Li",
      "Zhenyu Li"
    ],
    "publication_date": "2023-03-07T06:44:18Z",
    "arxiv_id": "http://arxiv.org/abs/2303.03681v1",
    "download_url": "https://arxiv.org/abs/2303.03681v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magic State Distillation and Gate Compilation in Quantum Algorithms for Quantum Chemistry",
    "abstract": "Quantum algorithms for quantum chemistry map the dynamics of electrons in a molecule to the dynamics of a coupled spin system. To reach chemical accuracy for interesting molecules, a large number of quantum gates must be applied which implies the need for quantum error correction and fault-tolerant quantum computation. Arbitrary fault-tolerant operations can be constructed from a small, universal set of fault-tolerant operations by gate compilation. Quantum chemistry algorithms are compiled by decomposing the dynamics of the coupled spin-system using a Trotter formula, synthesizing the decomposed dynamics using Clifford operations and single-qubit rotations, and finally approximating the single-qubit rotations by a sequence of fault-tolerant single-qubit gates. Certain fault-tolerant gates rely on the preparation of specific single-qubit states referred to as magic states. As a result, gate compilation and magic state distillation are critical for solving quantum chemistry problems on a quantum computer. We review recent progress that has improved the efficiency of gate compilation and magic state distillation by orders of magnitude.",
    "authors": [
      "Colin J. Trout",
      "Kenneth R. Brown"
    ],
    "publication_date": "2015-01-06T20:57:03Z",
    "arxiv_id": "http://arxiv.org/abs/1501.01298v3",
    "download_url": "https://arxiv.org/abs/1501.01298v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "DQC: a Python program package for Differentiable Quantum Chemistry",
    "abstract": "Automatic differentiation represents a paradigm shift in scientific programming, where evaluating both functions and their derivatives is required for most applications. By removing the need to explicitly derive expressions for gradients, development times can be be shortened, and calculations simplified. For these reasons, automatic differentiation has fueled the rapid growth of a variety of sophisticated machine learning techniques over the past decade, but is now also increasingly showing its value to support {\\it ab initio} simulations of quantum systems, and enhance computational quantum chemistry. Here we present an open-source differentiable quantum chemistry simulation code, DQC, and explore applications facilitated by automatic differentiation: (1) calculating molecular perturbation properties; (2) reoptimizing a basis set for hydrocarbons; (3) checking the stability of self-consistent field wave functions; and (4) predicting molecular properties via alchemical perturbations.",
    "authors": [
      "Muhammad F. Kasim",
      "Susi Lehtola",
      "Sam M. Vinko"
    ],
    "publication_date": "2021-10-22T09:53:40Z",
    "arxiv_id": "http://arxiv.org/abs/2110.11678v1",
    "download_url": "https://arxiv.org/abs/2110.11678v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The quest for electronic ferroelectricity in organic charge-transfer crystals",
    "abstract": "Organic ferroelectric materials are in demand in the growing field of environmentally friendly, lightweight electronics. Donor-Acceptor charge transfer crystals have been recently proposed as a new class of organic ferroelectrics, which may possess a new kind of ferroelectricity, the so-called electronic ferroelectricity, larger and with faster polarity switching in comparison with conventional, inorganic or organic, ferroelectrics. The current research aimed at achieving ambient conditions electronic ferroelectricity in organic charge transfer crystals is shortly reviewed, in such a way to evidence the emerging criteria that have to be fulfilled to reach this challenging goal.",
    "authors": [
      "Alberto Girlando"
    ],
    "publication_date": "2019-04-16T17:31:27Z",
    "arxiv_id": "http://arxiv.org/abs/1904.07836v1",
    "download_url": "https://arxiv.org/abs/1904.07836v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ion exchange gels enhance organic electrochemical transistor performance in aqueous solution",
    "abstract": "Conjugated polymer-based organic electrochemical transistors (OECTs) are being studied for applications ranging from biochemical sensing to neural interfaces. While new conjugated polymers are being developed that can interface digital electronics with the aqueous chemistry of life, the vast majority of high-performance, high-mobility organic transistor materials developed over the past decades are extremely poor at taking up biologically-relevant ions. Here we incorporate an ion exchange gel into an OECT, demonstrating that this structure is capable of taking up biologically-relevant ions from solution and injecting larger, more hydrophobic ions into the underlying polymer semiconductor active layer in multiple hydrophobic conjugated polymers. Using poly[2,5-bis(3-tetradecylthiophen-2-yl) thieno[3,2-b]thiophene] (PBTTT) as a model semiconductor active layer and a blend of the ionic liquid 1-butyl-3-methylimidazolium bis(trifluoromethylsulfonyl)imide (BMIM TFSI) and poly(vinylidene fluoride-co-hexafluoropropylene) (PVDF-HFP) as the ion exchange gel, we demonstrate more than a four order of magnitude improvement in OECT device transconductance and a one hundred-fold increase in ion injection kinetics. We demonstrate the ability of the ion exchange gel OECT to record biological signals by measuring the action potentials of a Venus flytrap plant. These results show the possibility of using interface engineering to open up a wider palette of organic semiconductor materials as OECTs that can be gated by aqueous solutions.",
    "authors": [
      "Connor G. Bischak",
      "Lucas Q. Flagg",
      "David S. Ginger"
    ],
    "publication_date": "2019-09-29T23:48:08Z",
    "arxiv_id": "http://arxiv.org/abs/1909.13397v1",
    "download_url": "https://arxiv.org/abs/1909.13397v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PhD thesis - 'Electronic Processes at the Interface of Organic Semiconductors'",
    "abstract": "The thesis focuses on study of optical and photovoltaic properties of iso-type and aniso-type heterostructures based on photosensitive layers of organic semiconductors. The primary attention has been paid on determination of optimal conditions for preparation of organic thin-film structures of methyl substituted perylene pigment, hexathiopentacene and SnCl2 phthalocyanine. These structures are perspective for fabrication of photosensitive heterostructures and can be used for development of effective photoconverters of solar energy. The influence of annealing and substrate temperature during thermal deposition of the films on morphology and surface structure, optical and photovoltaic properties of thin films of methyl substituted perylene pigment, hexathiopentacene and SnCl2 phthalocyanine was studied. The surface and bulk parameters of considered films were determined from the results obtained here. The photovoltaic and optical properties of organic iso-type and aniso-type heterostructures prepared on the substrates with different temperatures were studied. The obtained data for heterostructures were analyzed using Anderson model and Van Opdorp model, respectively. This analysis showed that organic aniso-type heterostructures based on methyl substituted perylene pigment and iso-type heterostructures based on pentacene can be described by the models proposed and developed for inorganic semiconductor heterojunctions. The optimal conditions were determined for preparation of organic photosensitive heterostructures, which absorb most part of solar radiation in visible and near infrared range, as well as effectively generate and separate charge carriers on the interface of heterojunction. The aniso-type and iso-type heterostructures prepared under optimal conditions are perspective elements for development of organic photoconverters, including organic solar cells.",
    "authors": [
      "Petro Lutsyk"
    ],
    "publication_date": "2017-10-15T11:52:39Z",
    "arxiv_id": "http://arxiv.org/abs/1710.05321v1",
    "download_url": "https://arxiv.org/abs/1710.05321v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evolution of Chemistry in the envelope of HOt CorinoS (ECHOS) II. The puzzling chemistry of isomers as revealed by the HNCS/HSCN ratio",
    "abstract": "The observational detection of some metastable isomers in the interstellar medium with abundances comparable to those of the most stable isomer, or even when the stable isomer is not detected, highlights the importance of non-equilibrium chemistry. This challenges our understanding of the interstellar chemistry. We present a chemical study of isomers through the sulphur isomer pair HNCS and HSCN, since HSCN has been observed in regions where its stable isomer has not been detected, and the observed HNCS/HSCN ratio seems to significantly vary from cold to warm regions. We have used the Nautilus chemical code to model the formation and destruction paths of HNCS and HSCN in different astrochemical scenarios, and the time evolution of the HNCS/HSCN ratio. We have also analysed the influence of the environmental conditions on their chemical abundances. We present an observational detection of the metastable isomer HSCN in the Class I object B1-a, but not of the stable isomer HNCS, despite HNCS lying 3200 K lower in energy than HSCN. Our results show an HNCS/HSCN ratio sensitive to the gas temperature and the evolutionary time, with the highest values obtained at early stages (t<10^4 yr) and low (Tg<20 K) temperatures. The results suggest a different efficiency of the isomerisation processes depending on the source temperature. The progressive decrease of HNCS/HSCN with gas temperature at early evolutionary times indicates that this ratio may be used as a tracer of cold young objects. This work also demonstrates the key role of grain surface chemistry in the formation of the isomer pair HNCS and HSCN in cold regions, and the importance of the ions H2NCS+ and HNCSH+ in warm/hot regions. Since most of the interstellar regions where HSCN is detected are cold regions, a larger sample including sources characterised by high temperatures are needed to corroborate the theoretical results.",
    "authors": [
      "G. Esplugues",
      "M. Rodríguez-Baras",
      "D. Navarro-Almaida",
      "A. Fuente",
      "P. Fernández-Ruiz",
      "S. Spezzano",
      "M. N. Drozdovskaya",
      "Á. Sánchez-Monge",
      "P. Caselli",
      "P. Rivière-Marichalar",
      "L. Beitia-Antero"
    ],
    "publication_date": "2024-11-08T12:25:32Z",
    "arxiv_id": "http://arxiv.org/abs/2411.05517v2",
    "download_url": "https://arxiv.org/abs/2411.05517v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Implications of time-dependent molecular chemistry in metal-poor dwarf stars",
    "abstract": "Binary molecules such as CO, OH, CH, CN, and C$_2$ are often used as abundance indicators in stars. These species are usually assumed to be formed in chemical equilibrium. The time-dependent effects of hydrodynamics can affect the formation and dissociation of these species and may lead to deviations from chemical equilibrium. We aim to model departures from chemical equilibrium in dwarf stellar atmospheres by considering time-dependent chemical kinetics alongside hydrodynamics and radiation transfer. We examine the effects of a decreasing metallicity and an altered C/O ratio on the chemistry when compared to the equilibrium state. We used the radiation-(magneto)hydrodynamics code CO5BOLD, and its own chemical solver to solve for the chemistry of 15 species and 83 reactions. The species were treated as passive tracers and were advected by the velocity field. The steady-state chemistry was also computed to isolate the effects of hydrodynamics.\n  In most of the photospheres in the models we present, the mean deviations are smaller than $0.2$ dex, and they generally appear above $\\logτ = -2$. The deviations increase with height because the chemical timescales become longer with decreasing density and temperature. A reduced metallicity similarly results in longer chemical timescales and in a reduction in yield that is proportional to the drop in metallicity; a decrease by a factor $100$ in metallicity loosely corresponds to an increase by factor $100$ in chemical timescales. As both CH and OH are formed along reaction pathways to CO, the C/O ratio means that the more abundant element gives faster timescales to the constituent molecular species. Overall, the carbon enhancement phenomenon seen in very metal-poor stars is not a result of an improper treatment of molecular chemistry for stars up to a metallicity as low as [Fe/H] = $-3.0$.",
    "authors": [
      "S. A. Deshmukh",
      "H. -G. Ludwig"
    ],
    "publication_date": "2023-05-30T08:49:33Z",
    "arxiv_id": "http://arxiv.org/abs/2305.18854v1",
    "download_url": "https://arxiv.org/abs/2305.18854v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Size-Dependent Ideal Solution Model for Liquid-Solid Phase Equilibria Prediction in Aqueous Organic Solutions",
    "abstract": "Predictive synthesis of aqueous organic solutions with desired liquid-solid phase equilibria could drive progress in industrial chemistry, cryopreservation, and beyond, but is limited by the predictive power of current solution thermodynamics models. In particular, few analytical models enable accurate liquidus and eutectic prediction based only on bulk thermodynamic properties of the pure components, requiring instead either direct measurement or costly simulation of solution properties. In this work, we demonstrate that a simple modification to the canonical ideal solution theory accounting for the entopic effects of dissimilar molecule sizes can transform its predictive power, while offering new insight into the thermodynamic nature of aqueous organic solutions. Incorporating a Flory-style entropy of mixing term that includes both the mole and volume fractions of each component, we derive size-dependent equations for the ideal chemical potential and liquidus temperature, and use them to predict the binary phase diagrams of water and 10 organic solutes of varying sizes. We show that size-dependent prediction outperforms the ideal model in all cases, reducing average error in the predicted liquidus temperature by 59\\%, eutectic temperature by 45\\%, and eutectic composition by 43\\%, as compared to experimental data. Furthermore, by retaining the ideal assumption that the enthalpy of mixing is zero, we demonstrate that for aqueous organic solutions, much of the deviation from ideality that is typically attributed to molecular interactions may in fact be explained by simple entropic size effects. These results suggest an underappreciated dominance of mixing entropy in these solutions, and provide a simple approach to predicting their phase equilibria.",
    "authors": [
      "Spencer P. Alliston",
      "Chris Dames",
      "Matthew J. Powell-Palm"
    ],
    "publication_date": "2024-11-27T00:58:32Z",
    "arxiv_id": "http://arxiv.org/abs/2411.17968v1",
    "download_url": "https://arxiv.org/abs/2411.17968v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reducing Numerical Precision Requirements in Quantum Chemistry Calculations",
    "abstract": "The abundant demand for deep learning compute resources has created a renaissance in low precision hardware. Going forward, it will be essential for simulation software to run on this new generation of machines without sacrificing scientific fidelity. In this paper, we examine the precision requirements of a representative kernel from quantum chemistry calculations: calculation of the single particle density matrix from a given mean field Hamiltonian (i.e. Hartree-Fock or Density Functional Theory) represented in an LCAO basis. We find that double precision affords an unnecessarily high level of precision, leading to optimization opportunities. We show how an approximation built from an error-free matrix multiplication transformation can be used to potentially accelerate this kernel on future hardware. Our results provide a road map for adapting quantum chemistry software for the next generation of High Performance Computing platforms.",
    "authors": [
      "William Dawson",
      "Katsuhisa Ozaki",
      "Jens Domke",
      "Takahito Nakajima"
    ],
    "publication_date": "2024-07-18T09:02:39Z",
    "arxiv_id": "http://arxiv.org/abs/2407.13299v2",
    "download_url": "https://arxiv.org/abs/2407.13299v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optimal compound downselection to promote diversity and parallel chemistry",
    "abstract": "Early stage drug discovery and molecular design projects often follow iterative design-make-test cycles. The selection of which compounds to synthesize from all possible candidate compounds is a complex decision inherent to these design cycles that must weigh multiple factors. We build upon the algorithmic downselection framework SPARROW that considers synthetic cost, synthetic feasibility, and compound utility, extending it to address additional critical factors related to the risk of synthesis failure, molecular diversity, and parallel chemistry capabilities. These design considerations further align algorithmic compound selection with the true complexity of this decision-making process, allowing SPARROW to capture a broader set of principles typically reliant on expert chemist intuition. The application of these formulations to an exemplary case study highlights SPARROW's ability to promote the selection of diverse batches of compounds whose syntheses are amenable to parallel chemistry.",
    "authors": [
      "Jenna C. Fromer",
      "Alexandra D. Volkova",
      "Connor W. Coley"
    ],
    "publication_date": "2025-03-17T18:23:43Z",
    "arxiv_id": "http://arxiv.org/abs/2503.13627v1",
    "download_url": "https://arxiv.org/abs/2503.13627v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]