[
  {
    "title": "Comparative study of the growth of sputtered aluminum oxide films on organic and inorganic substrates",
    "abstract": "We present a comparative study of the growth of the technologically highly relevant gate dielectric and encapsulation material aluminum oxide in inorganic and also organic heterostructures. Atomic force microscopy studies indicate strong similarities in the surface morphology of aluminum oxide films grown on these chemically different substrates. In addition, from X-ray reflectivity measurements we extract the roughness exponent βof aluminum oxide growth on both substrates. By renormalising the aluminum oxide roughness by the roughness of the underlying organic film we find good agreement with βas obtained from the aluminum oxide on silicon oxide (β= 0.38 \\pm 0.02), suggesting a remarkable similarity of the aluminum oxide growth on the two substrates under the conditions employed.",
    "authors": [
      "Stefan Sellner",
      "Alexander Gerlach",
      "Stefan Kowarik",
      "Frank Schreiber",
      "Helmut Dosch",
      "Stephan Meyer",
      "Jens Pflaum",
      "Gerhard Ulbricht"
    ],
    "publication_date": "2007-11-30T19:58:39Z",
    "arxiv_id": "http://arxiv.org/abs/0711.5019v1",
    "download_url": "https://arxiv.org/abs/0711.5019v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Accelerating the prediction of inorganic surfaces with machine learning interatomic potentials",
    "abstract": "The surface properties of solid-state materials often dictate their functionality, especially for applications where nanoscale effects become important. The relevant surface(s) and their properties are determined, in large part, by the materials synthesis or operating conditions. These conditions dictate thermodynamic driving forces and kinetic rates responsible for yielding the observed surface structure and morphology. Computational surface science methods have long been applied to connect thermochemical conditions to surface phase stability, particularly in the heterogeneous catalysis and thin film growth communities. This review provides a brief introduction to first-principles approaches to compute surface phase diagrams before introducing emerging data-driven approaches. The remainder of the review focuses on the application of machine learning, predominantly in the form of learned interatomic potentials, to study complex surfaces. As machine learning algorithms and large datasets on which to train them become more commonplace in materials science, computational methods are poised to become even more predictive and powerful for modeling the complexities of inorganic surfaces at the nanoscale.",
    "authors": [
      "Kyle Noordhoek",
      "Christopher J. Bartel"
    ],
    "publication_date": "2023-12-18T21:08:13Z",
    "arxiv_id": "http://arxiv.org/abs/2312.11708v1",
    "download_url": "https://arxiv.org/abs/2312.11708v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Continuous Uniqueness and Novelty Metrics for Generative Modeling of Inorganic Crystals",
    "abstract": "To address pressing scientific challenges such as climate change, increasingly sophisticated generative artificial intelligence models are being developed that can efficiently sample the large chemical space of possible functional materials. These models can quickly sample new chemical compositions paired with crystal structures. They are typically evaluated using uniqueness and novelty metrics, which depend on a chosen crystal distance function. However, the most prevalent distance function has four limitations: it fails to quantify the degree of similarity between compounds, cannot distinguish compositional difference and structural difference, lacks Lipschitz continuity against shifts in atomic coordinates, and results in a uniqueness metric that is not invariant against the permutation of generated samples. In this work, we propose using two continuous distance functions to evaluate uniqueness and novelty, which theoretically overcome these limitations. Our experiments show that these distances reveal insights missed by traditional distance functions, providing a more reliable basis for evaluating and comparing generative models for inorganic crystals.",
    "authors": [
      "Masahiro Negishi",
      "Hyunsoo Park",
      "Kinga O. Mastej",
      "Aron Walsh"
    ],
    "publication_date": "2025-10-14T11:38:21Z",
    "arxiv_id": "http://arxiv.org/abs/2510.12405v2",
    "download_url": "https://arxiv.org/abs/2510.12405v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Immunomodulatory role of black tea in the mitigation of cancer induced by inorganic arsenic",
    "abstract": "We present a model analysis of the tumor and normal cell growth under the influence of a carcinogenic agent, an immunomdulator (IM) and variable influx of immune cells including relevant interactions. The tumor growth is facilitated by carcinogens such as inorganic arsenic while the IM considered here is black tea (Camellia sinesnsis). The model with variable influx of immune cells is observed to have considerable advantage over the constant influx model, and while the tumor cell population is greatly mitigated, normal cell population remains above healthy levels. The evolution of normal and tumor cells are computed from the proposed model and their local stabilities are investigated analytically. Numerical simulations are performed to study the long term dynamics and an estimation of the effects of various factors is made. This helps in developing a balanced strategy for tumor mitigation without the use of chemotherapeutic drugs that usually have strong side-effects.",
    "authors": [
      "Ravi Kiran",
      "Swati Tyagi",
      "Syed Abbas",
      "Madhumita Roy",
      "A. Taraphder"
    ],
    "publication_date": "2020-05-27T16:52:32Z",
    "arxiv_id": "http://arxiv.org/abs/2005.13489v2",
    "download_url": "https://arxiv.org/abs/2005.13489v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Recent advances in inorganic oxides-based resistive random-access memory devices",
    "abstract": "Memory has always been a building block element for information technology. Emerging technologies such as artificial intelligence, big data, the internet of things, etc., require a novel kind of memory technology that can be energy efficient and have an exception data retention period. Among several existing memory technologies, resistive random-access memory (RRAM) is an answer to the above question as it is necessary to possess the combination of speed of RAM and nonvolatility, thus proving to be one of the most promising candidates to replace flash memory in next-generation non-volatile RAM applications. This review discusses the existing challenges and technological advancements made with RRAM, including switching mechanism, device structure, endurance, fatigue resistance, data retention period, and mechanism of resistive switching in inorganic oxides material used as a dielectric layer. Finally, a summary and a perspective on future research are presented.",
    "authors": [
      "Anurag Pritam",
      "Ritu Gupta",
      "Prakash Chandra Mondal"
    ],
    "publication_date": "2022-05-02T06:22:06Z",
    "arxiv_id": "http://arxiv.org/abs/2205.05537v1",
    "download_url": "https://arxiv.org/abs/2205.05537v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Anharmonic lattice dynamics and thermal transport in type-I inorganic clathrates",
    "abstract": "The anharmonic phonon properties of type-I filled inorganic clathrates Ba8 Ga16 Ge30 and Sr8 Ga16 Ge30 are obtained from the first-principles calculations by considering the temperature-dependent sampling of the potential energy surface and quartic phonon renormalization. Owing to the weak binding of guest atoms with the host lattice, the obtained guest modes undergo strong renormalization with temperature and become stiffer by up to 50% at room temperature in Sr8Ga16Ge30. The calculated phonon frequencies and associated thermal mean squared displacements are comparable with experiments despite the on-centering of guest atoms at cage centers in both clathrates. Lattice thermal conductivities are obtained in the temperature range of 50- 300 K accounting for three-phonon scattering processes and multi-channel thermal transport. The contribution of coherent transport channel is significant at room temperature (13% and 22% in Ba8Ga16Ge30 and Sr8Ga16Ge30) but is insufficient to explain the experimentally observed glass-like thermal transport in Sr8Ga16Ge30.",
    "authors": [
      "Shravan Godse",
      "Yagyank Srivastava",
      "Ankit Jain"
    ],
    "publication_date": "2021-10-25T18:04:51Z",
    "arxiv_id": "http://arxiv.org/abs/2110.13183v1",
    "download_url": "https://arxiv.org/abs/2110.13183v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Scalable Gaussian Processes for Predicting the Properties of Inorganic Glasses with Large Datasets",
    "abstract": "Gaussian process regression (GPR) is a useful technique to predict composition--property relationships in glasses as the method inherently provides the standard deviation of the predictions. However, the technique remains restricted to small datasets due to the substantial computational cost associated with it. Here, using a scalable GPR algorithm, namely, kernel interpolation for scalable structured Gaussian processes (KISS-GP) along with massively scalable GP (MSGP), we develop composition--property models for inorganic glasses based on a large dataset with more than 100,000 glass compositions, 37 components, and nine important properties, namely, density, Young's, shear, and bulk moduli, thermal expansion coefficient, Vickers' hardness, refractive index, glass transition temperature, and liquidus temperature. Finally, to accelerate glass design, the models developed here are shared publicly as part of a package, namely, Python for Glass Genomics (PyGGi).",
    "authors": [
      "Suresh Bishnoi",
      "R. Ravinder",
      "Hargun Singh",
      "Hariprasad Kodamana",
      "N. M. Anoop Krishnan"
    ],
    "publication_date": "2020-07-06T14:56:48Z",
    "arxiv_id": "http://arxiv.org/abs/2007.02795v1",
    "download_url": "https://arxiv.org/abs/2007.02795v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lifetime-shortened acoustic phonons and static order at the Brillouin zone boundary in the organic-inorganic perovskite CH$_3$NH$_3$PbCl$_3$",
    "abstract": "Lead halide hybrid perovskites consist of an inorganic framework hosting a molecular cation located in the interstitial space. These compounds have been extensively studied as they have been identified as promising materials for photovoltaic applications with the interaction between the molecular cation and the inorganic framework implicated as influential for the electronic properties. CH3NH3PbCl3 undergoes two structural transitions from a high temperature cubic unit cell to a tetragonal phase at 177 K and an orthorhombic transition at 170 K. We have measured the low-frequency lattice dynamics using neutron spectroscopy and observe an energy broadening in the acoustic phonon linewidth towards the symmetry point QX =(2,1/2,0) when approaching the transitions. Concomitant with these zone boundary anomalies is a hardening of the entire acoustic phonon branch measured near the (2, 0, 0) Bragg position with decreasing temperature. Measurements of the elastic scattering at the Brillouin zone edges QX = (2,1/2,0), QM = (3/2,1/2,0), and QR = (3/2,3/2,5/2) show Bragg peaks appearing below these structural transitions. Based on selection rules of neutron scattering, we suggest that the higher 177 K transition is displacive with a distortion of the local octahedral environment and the lower transition is a rigid tilt transition of the octahedra. We do not observe any critical broadening in energy or momentum, beyond resolution, of these peaks near the transitions. We compare these results to the critical properties reported near the structural transitions in other perovskites. We suggest that the simultaneous onset of static resolution-limited Bragg peaks at the zone boundaries and the changes in acoustic phonon energies near the zone center is evidence of a coupling between the inorganic framework and the molecular cation.",
    "authors": [
      "M. Songvilay",
      "M. Bari",
      "Z. -G. Ye",
      "Guangyong Xu",
      "P. M. Gehring",
      "W. D. Ratcliff",
      "K. Schmalzl",
      "F. Bourdarot",
      "B. Roessli",
      "C. Stock"
    ],
    "publication_date": "2018-09-26T09:53:55Z",
    "arxiv_id": "http://arxiv.org/abs/1809.09878v2",
    "download_url": "https://arxiv.org/abs/1809.09878v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Machine Learning-Guided Discovery of Temperature-Induced Solid-Solid Phase Transitions in Inorganic Materials",
    "abstract": "Predicting solid-solid phase transitions remains a long-standing challenge in materials science. Solid-solid transformations underpin a wide range of functional properties critical to energy conversion, information storage, and thermal management technologies. However, their prediction is computationally intensive due to the need to account for finite-temperature effects. Here, we present an uncertainty-aware machine-learning-guided framework for high-throughput prediction of temperature-induced polymorphic phase transitions in inorganic crystals. By combining density functional theory calculations with graph-based neural networks trained to estimate vibrational free energies, we screened a curated dataset of approximately 50,000 inorganic compounds and identified over 2,000 potential solid-solid transitions within the technologically relevant temperature interval 300-600 K. Among our key findings, we uncover numerous phase transitions exhibiting large entropy changes (> 300 J K$^{-1}$ kg$^{-1}$), many of which occur near room temperature hence offering strong potential for solid-state cooling applications. We also identify $21$ compounds that exhibit substantial relative changes in lattice thermal conductivity (20-70%) across a phase transition, highlighting them as promising thermal switching materials. Validation against experimental observations and first-principles calculations supports the robustness and predictive power of our approach. Overall, this work establishes a scalable route to discover functional phase-change materials under realistic thermal conditions, and lays the foundation for future high-throughput studies leveraging generative models and expanding open-access materials databases.",
    "authors": [
      "Cibrán López",
      "Joshua Ojih",
      "Ming Hu",
      "Josep Lluis Tamarit",
      "Edgardo Saucedo",
      "Claudio Cazorla"
    ],
    "publication_date": "2025-06-02T09:07:13Z",
    "arxiv_id": "http://arxiv.org/abs/2506.01449v1",
    "download_url": "https://arxiv.org/abs/2506.01449v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Advanced Inorganic Halide Ceramic Scintillators",
    "abstract": "Research in ceramic scintillators has steadily progressed alongside the research in bulk single crystal scintillator growth. As interest in faster scintillation material production with lower cost increases, more research on scintillating ceramics is needed. Research targeting optimization of optically transparent ceramics that can rival bulk-grown crystals grown may lower cost, increase yield, increase volume, and improve energy resolution in applications and systems currently using sodium iodide and alike. Ceramic scintillators that are dense (>5 g/cm3), have high effective Z (>60), are bright (>40,000 photons/MeV), and are not sensitive to moisture as well as those that can be handled without protection are desired. Ultra-fast ceramic materials are also of interest. This paper presents an equipment design and technique to produce inorganic halide ceramic scintillators Cs2HfCl6 (CHC) and Tl2HfCl6 (THC). Improvements and optimization of CHC and THC ceramic scintillator fabrication are gauged by monitoring the energy resolution and peak position of 137Cs full energy peak at 662 keV. With a 1-inch diameter CHC ceramic scintillator, energy resolution of 5.4% (FWHM) and light yield of 20,700 ph/MeV are achieved, while with a 16-mm diameter THC ceramic scintillator, energy resolution of 5.1% (FWHM) and light yield of 27,800 ph/MeV are achieved. Decay times of 0.6 microseconds (21%) and 3.0 microseconds (79%) are measured for CHC and 0.3 microseconds (13%) and 1.0 microseconds (87%) for THC. Both ceramic CHC and THC scintillators have similarly good proportionality data when compared to their single crystal counterparts.",
    "authors": [
      "R. Hawrami",
      "E. Ariesanti",
      "H. Parkhe",
      "A. Burger"
    ],
    "publication_date": "2021-03-20T23:53:15Z",
    "arxiv_id": "http://arxiv.org/abs/2103.11267v1",
    "download_url": "https://arxiv.org/abs/2103.11267v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Performance of periodic EOM-CCSD for band gaps of inorganic semiconductors and insulators",
    "abstract": "We calculate the band gaps of 12 inorganic semiconductors and insulators composed of atoms from the first three rows of the periodic table using periodic equation-of-motion coupled-cluster theory with single and double excitations (EOM-CCSD). Our calculations are performed with atom-centered triple-zeta basis sets and up to 64 $k$-points in the Brillouin zone. We analyze the convergence behavior with respect to number of orbitals and number of $k$-points sampled, using composite corrections and extrapolations to produce our final values. When accounting for electron-phonon corrections to experimental band gaps, we find that EOM-CCSD has a mean signed error of $-0.12$ eV and a mean absolute error of $0.42$ eV; the largest outliers are C (error of $-0.93$ eV), BP ($-1.00$ eV), and LiH ($+0.78$ eV). Surprisingly, we find that the more affordable partitioned EOM-MP2 theory performs as well as EOM-CCSD.",
    "authors": [
      "Ethan A. Vo",
      "Xiao Wang",
      "Timothy C. Berkelbach"
    ],
    "publication_date": "2023-10-05T20:45:29Z",
    "arxiv_id": "http://arxiv.org/abs/2310.03887v1",
    "download_url": "https://arxiv.org/abs/2310.03887v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin Coherence and Spin Relaxation in Hybrid Organic-Inorganic Lead and Mixed Lead-Tin Perovskites",
    "abstract": "Metal halide perovskites make up a promising class of materials for semiconductor spintronics. Here we report a systematic investigation of coherent spin precession, spin dephasing and spin relaxation of electrons and holes in two hybrid organic-inorganic perovskites MA0.3FA0.7PbI3 and MA0.3FA0.7Pb0.5Sn0.5I3 using time-resolved Faraday rotation spectroscopy. With applied in-plane magnetic fields, we observe robust Larmor spin precession of electrons and holes that persists for hundreds of picoseconds. The spin dephasing and relaxation processes are likely to be sensitive to the defect levels. Temperature-dependent measurements give further insights into the spin relaxation channels. The extracted electron Landé g-factors (3.75 and 4.36) are the biggest among the reported values in inorganic or hybrid perovskites. Both the electron and hole g-factors shift dramatically with temperature, which we propose to originate from thermal lattice vibration effects on the band structure. These results lay the foundation for further design and use of lead- and tin-based perovskites for spintronic applications.",
    "authors": [
      "Haochen Zhang",
      "Zehua Zhai",
      "Zhixuan Bi",
      "Han Gao",
      "Meng Ye",
      "Yong Xu",
      "Hairen Tan",
      "Luyi Yang"
    ],
    "publication_date": "2023-08-06T08:40:10Z",
    "arxiv_id": "http://arxiv.org/abs/2308.03057v2",
    "download_url": "https://arxiv.org/abs/2308.03057v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hopping charge transport in amorphous organic and inorganic materials with spatially correlated random energy landscape",
    "abstract": "General properties of the hopping transport of charge carriers in amorphous organic and inorganic materials are discussed. We consider the case where the random energy landscape in the materials is strongly spatially correlated. This is a very typical situation in the organic materials having the Gaussian density of states (DOS) and may be realized in some materials with the exponential DOS. We demonstrate that the different type of DOS leads to a very different functional form of the mobility field dependence even in the case of the identical correlation function of random energy. We provide important arguments in favor of the significant contribution of the local orientational order to the total magnitude of the energetic disorder in organic materials. A simple but promising model of charge transport in highly anisotropic composites materials is suggested.",
    "authors": [
      "S. V. Novikov"
    ],
    "publication_date": "2020-02-20T19:36:21Z",
    "arxiv_id": "http://arxiv.org/abs/2002.08985v1",
    "download_url": "https://arxiv.org/abs/2002.08985v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New hybrid organic-inorganic ferrophotovoltaic perovskites nanoparticles with high voltage for indoor and IoT applications",
    "abstract": "The ideal band gap for a photovoltaic active layer for the solar spectrum is around 1.3 eV. However oxides with such values are rare. One of the most studied oxides to date as a photovoltaic active layer is the cuprous oxide Cu2O. Its band gap is around 2.1 eV and is therefore not ideal for the solar spectrum. Power Conversion Efficiency generally do not exceed 4%. In this paper we propose to study an emerging type of solar cell that is based on ferroelectricity. In this type of solar cell, a p-n junction is not necessarily required, unlike conventional solar cells. Interesting conversion efficiencies are beginning to be obtained with this type of cell, however the mechanisms are still not well understood and several material and engineering challenges must be addressed. The objective of this paper is to initiate an innovative photovoltaic technology based on novel inorganic with suitable bandgap widths and organic materials (biopolymer). These oxides are more stables. We synthesized ferroelectric materials that absorb a large part of the solar spectrum with reduced bandgap widths. PZN-4.5PT nanoparticles were dispersed in a biopolymer matrix. Hybrid thin films with these inorganic nanoparticles embedded in a biopolymer have been successfully fabricated by spin coating on ITO substrate. Structural, morphological and electrical properties were investigated. The best Power Conversion Efficiencies measure under a light LED illumination of 3550 lux are respectively 21.83 % and 31.62 % for 15 and 30 min light exposition with an open-circuit voltage of 5.17 and 5.86 V.",
    "authors": [
      "Rémi Ndioukane",
      "Fanta Baldé",
      "Ndéye C. Y. Fall",
      "Diouma Kobor",
      "Laurence Motte"
    ],
    "publication_date": "2022-06-16T09:35:03Z",
    "arxiv_id": "http://arxiv.org/abs/2207.03340v1",
    "download_url": "https://arxiv.org/abs/2207.03340v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fabrication and in vitro characterization of three-dimensional organic/inorganic scaffolds by robocasting",
    "abstract": "A key issue for the fabrication of scaffolds for tissue engineering is the development of processing techniques flexible enough to produce materials with a wide spectrum of solubility (bioresorption rates) and mechanical properties matching those of calcified tissues. These techniques must also have the capability of generating adequate porosity to further serve as a framework for cell penetration, new bone formation, and subsequent remodeling. In this study, we show how hybrid organic/inorganic scaffolds with controlled microstructures can be built using robotic assisted deposition at room temperature. Polylactide or polycaprolactone scaffolds with pore sizes ranging between 200-500 μm and hydroxyapatite contents up to 70 wt % were fabricated. Compressive tests revealed an anisotropic behavior of the scaffolds, strongly dependent on their chemical composition. The inclusion of an inorganic component increased their stiffness but they were not brittle and could be easily machined even for ceramic contents up to 70 wt%. The mechanical properties of hybrid scaffolds did not degrade significantly after 20 days in simulated body fluid. However, the stiffness of pure polylactide scaffolds increased drastically due to polymer densification. Scaffolds containing bioactive glasses were also printed. After 20 days in simulated body fluid they developed an apatite layer on their surface.",
    "authors": [
      "Julie Russias",
      "Eduardo Saiz",
      "Sylvain Deville",
      "Karol Gryn",
      "G. Liu",
      "Ravi K. Nalla",
      "Antoni P. Tomsia"
    ],
    "publication_date": "2018-03-28T12:10:36Z",
    "arxiv_id": "http://arxiv.org/abs/1804.02375v1",
    "download_url": "https://arxiv.org/abs/1804.02375v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molassembler: Molecular graph construction, modification and conformer generation for inorganic and organic molecules",
    "abstract": "We present the graph-based molecule software Molassembler for building organic and inorganic molecules. Molassembler provides algorithms for the construction of molecules built from any set of elements from the periodic table. In particular, poly-nuclear transition metal complexes and clusters can be considered. Structural information is encoded as a graph. Stereocenter configurations are interpretable from Cartesian coordinates into an abstract index of permutation for an extensible set of polyhedral shapes. Substituents are distinguished through a ranking algorithm. Graph and stereocenter representations are freely modifiable and chiral state is propagated where possible through incurred ranking changes. Conformers are generated with full stereoisomer control by four spatial dimension Distance Geometry with a refinement error function including dihedral terms. Molecules are comparable by an extended graph isomorphism and their representation is canonicalizeable. Molassembler is written in C++ and provides Python bindings.",
    "authors": [
      "Jan-Grimo Sobez",
      "Markus Reiher"
    ],
    "publication_date": "2020-05-09T22:38:22Z",
    "arxiv_id": "http://arxiv.org/abs/2005.04525v2",
    "download_url": "https://arxiv.org/abs/2005.04525v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Design of Lead-Free Inorganic Halide Perovskites for Solar Cells via Cation-Transmutation",
    "abstract": "Hybrid organic-inorganic halide perovskites with the prototype material of CH$_{3}$NH$_{3}$PbI$_{3}$ have recently attracted intense interest as low-cost and high-performance photovoltaic absorbers. Despite the high power conversion efficiency exceeding 20% achieved by their solar cells, two key issues -- the poor device stabilities associated with their intrinsic material instability and the toxicity due to water soluble Pb$^{2+}$ -- need to be resolved before large-scale commercialization. Here, we address these issues by exploiting the strategy of cation-transmutation to design stable inorganic Pb-free halide perovskites for solar cells. The idea is to convert two divalent Pb$^{2+}$ ions into one monovalent M$^{+}$ and one trivalent M$^{3+}$ ions, forming a rich class of quaternary halides in double-perovskite structure. We find through first-principles calculations this class of materials have good phase stability against decomposition and wide-range tunable optoelectronic properties. With photovoltaic-functionality-directed materials screening, we identify eleven optimal materials with intrinsic thermodynamic stability, suitable band gaps, small carrier effective masses, and low excitons binding energies as promising candidates to replace Pb-based photovoltaic absorbers in perovskite solar cells. The chemical trends of phase stabilities and electronic properties are also established for this class of materials, offering useful guidance for the development of perovskite solar cells fabricated with them.",
    "authors": [
      "Xin-Gang Zhao",
      "Ji-Hui Yang",
      "Yuhao Fu",
      "Dongwen Yang",
      "Qiaoling Xu",
      "Liping Yu",
      "Su-Huai Wei",
      "Lijun Zhang"
    ],
    "publication_date": "2017-05-26T09:01:53Z",
    "arxiv_id": "http://arxiv.org/abs/1705.10014v1",
    "download_url": "https://arxiv.org/abs/1705.10014v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantitative trends in 8 physical properties of 115000 inorganic compounds gained by machine learning",
    "abstract": "We applied the decision trees (random forest) machine-learning technique for the large experimental materials dataset PAULING FILE, compiled from the world's peer-reviewed literature. The training and validation data were extracted from the hundreds of thousands of publications in materials science (1891-2017). Then, for the nearly 115'000 distinct inorganic compounds we predicted 8 thermodynamic, mechanical, and electronic properties, using the only crystalline structures as an input. For the predicted physical properties we observed certain periodical patterns in all unary, binary, ternary, and quaternary compounds. We also solved a reversed task of predicting the possible crystalline structure based on a given combination of values of the 8 mentioned properties. Therefore our observations may play a role of the periodic table, formulated not for the chemical elements, but for the entire set of materials.",
    "authors": [
      "Evgeny Blokhin",
      "Pierre Villars"
    ],
    "publication_date": "2018-06-09T22:31:52Z",
    "arxiv_id": "http://arxiv.org/abs/1806.03553v2",
    "download_url": "https://arxiv.org/abs/1806.03553v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Controlled Synthesis of Organic/Inorganic van der Waals Solid for Tunable Light-matter Interactions",
    "abstract": "Van der Waals (vdW) solids, as a new type of artificial materials that consist of alternating layers bonded by weak interactions, have shed light on fascinating optoelectronic device concepts. As a result, a large variety of vdW devices have been engineered via layer-by-layer stacking of two-dimensional materials, although shadowed by the difficulties of fabrication. Alternatively, direct growth of vdW solids has proven as a scalable and swift way, highlighted by the successful synthesis of graphene/h-BN and transition metal dichalcogenides (TMDs) vertical heterostructures from controlled vapor deposition. Here, we realize high-quality organic and inorganic vdW solids, using methylammonium lead halide (CH3NH3PbI3) as the organic part (organic perovskite) and 2D inorganic monolayers as counterparts. By stacking on various 2D monolayers, the vdW solids behave dramatically different in light emission. Our studies demonstrate that h-BN monolayer is a great complement to organic perovskite for preserving its original optical properties. As a result, organic/h-BN vdW solid arrays are patterned for red light emitting. This work paves the way for designing unprecedented vdW solids with great potential for a wide spectrum of applications in optoelectronics.",
    "authors": [
      "Lin Niu",
      "Xinfeng Liu",
      "Chunxiao Cong",
      "Chunyang Wu",
      "Di Wu",
      "Tay Rong Chang",
      "Hong Wang",
      "Qingsheng Zeng",
      "Jiadong Zhou",
      "Xingli Wang",
      "Wei Fu",
      "Peng Yu",
      "Qundong Fu",
      "Sina Najmaei",
      "Zhuhua Zhang",
      "Boris I. Yakobson",
      "Beng Kang Tay",
      "Wu Zhou",
      "Horng Tay Jeng",
      "Hsin Lin",
      "Tze Chien Sum",
      "Chuanhong Jin",
      "Haiyong He",
      "Ting Yu",
      "Zheng Liu"
    ],
    "publication_date": "2015-06-10T09:57:36Z",
    "arxiv_id": "http://arxiv.org/abs/1506.03241v2",
    "download_url": "https://arxiv.org/abs/1506.03241v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Universal Fragment Descriptors for Predicting Electronic Properties of Inorganic Crystals",
    "abstract": "Historically, materials discovery has been driven by a laborious trial-and-error process. The growth of materials databases and emerging informatics approaches finally offer the opportunity to transform this practice into data- and knowledge-driven rational design. By using data from the AFLOW repository for high-throughput ab-initio calculations, we have generated Quantitative Materials Structure-Property Relationship (QMSPR) models to predict eight critical electronic and thermomechanical materials properties, such as the metal/insulator classification, band gap energy, bulk and shear moduli, Debye temperature, and heat capacity. The prediction accuracy obtained with these QMSPR models approaches training data for virtually any stoichiometric inorganic crystalline material. The success and universality of these models is attributed to the construction of new materials descriptors---referred to as the universal Property-Labeled Materials Fragments (PLMF). The representation requires only minimal structural input and affords straightforward model interpretation in terms of simple heuristic design rules that guide rational materials design. This study demonstrates the power of materials informatics to dramatically accelerate the search for new materials.",
    "authors": [
      "Olexandr Isayev",
      "Corey Oses",
      "Cormac Toher",
      "Eric Gossett",
      "Stefano Curtarolo",
      "Alexander Tropsha"
    ],
    "publication_date": "2016-08-16T21:04:45Z",
    "arxiv_id": "http://arxiv.org/abs/1608.04782v3",
    "download_url": "https://arxiv.org/abs/1608.04782v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reduced Coulomb interaction in organic solar cells by the introduction of inorganic high-k nanostructured materials",
    "abstract": "In this article a concept is introduced, which allows for reduced Coulomb interaction in organic solar cells and as such for enhanced power conversion efficiencies. The concept is based on the introduction of electrically insulating, nanostructured high-k materials into the organic matrix, which do not contribute to the charge transport, however, effectively enhance the permittivity of the organic active layer and thereby reduce the Coulomb interaction. Using an analytical model it is demonstrated that even at a distance of 20 nm to the organic / inorganic interface of the nanostructure, the Coulomb interaction can be reduced by more than 15 %. The concept is implemented using P3HT:PCBM solar cells with integrated high-k nanoparticles (strontium titanate). It could be demonstrated that in comparison to a reference cell without integrated nanoparticles, the power conversion efficiencies could be improved by ~20 %.",
    "authors": [
      "Miriam Engel",
      "David Schaefer",
      "Daniel Erni",
      "Niels Benson",
      "Roland Schmechel"
    ],
    "publication_date": "2012-12-12T12:54:12Z",
    "arxiv_id": "http://arxiv.org/abs/1212.2799v1",
    "download_url": "https://arxiv.org/abs/1212.2799v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Density Functional Leveraged Tight-binding Insights into Inorganic Halide Perovskites",
    "abstract": "Compared to first principles studies like DFT (physically accurate, computationally expensive), the TB approach allows the disentanglement of the region of interest, to wit the fermi level. This allows the creation of simplified, highly interpretable models that give chemically grounded insights. In this paper we employ a Wannierized TB approach to tune the bandgap and electronic structure via anion exchange and investigate its impact on the orbital interactives of inorganic lead halide perovskites. Further adjustment of the hopping norm and maximum distance leads to a reduced TB model which regenerates the broad features of the band structure with a fraction of the parameters, thereby making the model simpler and highly interpretable. We observe that due to the asymmetry of the unit cell and the delocalized nature of its orbitals, CsPbBrI2 follows a many-small hopping scheme different in character from the few-big strategy taken by the other perovskites. Finally we leverage the TB model to study the electronic and thermal transport properties of these materials. These insight enable the identification of optimal doping strategies that could enhance thermoelectric performance by improving carrier mobility or optimizing the Seebeck coefficient.",
    "authors": [
      "Misbah Shaheen",
      "Sheharyar Pervez"
    ],
    "publication_date": "2025-01-11T10:45:14Z",
    "arxiv_id": "http://arxiv.org/abs/2501.06503v1",
    "download_url": "https://arxiv.org/abs/2501.06503v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dataset of Solution-based Inorganic Materials Synthesis Recipes Extracted from the Scientific Literature",
    "abstract": "The development of a materials synthesis route is usually based on heuristics and experience. A possible new approach would be to apply data-driven approaches to learn the patterns of synthesis from past experience and use them to predict the syntheses of novel materials. However, this route is impeded by the lack of a large-scale database of synthesis formulations. In this work, we applied advanced machine learning and natural language processing techniques to construct a dataset of 35,675 solution-based synthesis \"recipes\" extracted from the scientific literature. Each recipe contains essential synthesis information including the precursors and target materials, their quantities, and the synthesis actions and corresponding attributes. Every recipe is also augmented with the reaction formula. Through this work, we are making freely available the first large dataset of solution-based inorganic materials synthesis recipes.",
    "authors": [
      "Zheren Wang",
      "Olga Kononova",
      "Kevin Cruse",
      "Tanjin He",
      "Haoyan Huo",
      "Yuxing Fei",
      "Yan Zeng",
      "Yingzhi Sun",
      "Zijian Cai",
      "Wenhao Sun",
      "Gerbrand Ceder"
    ],
    "publication_date": "2021-11-21T18:41:28Z",
    "arxiv_id": "http://arxiv.org/abs/2111.10874v1",
    "download_url": "https://arxiv.org/abs/2111.10874v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "GPTFF: A high-accuracy out-of-the-box universal AI force field for arbitrary inorganic materials",
    "abstract": "This study introduces a novel AI force field, namely graph-based pre-trained transformer force field (GPTFF), which can simulate arbitrary inorganic systems with good precision and generalizability. Harnessing a large trove of the data and the attention mechanism of transformer algorithms, the model can accurately predict energy, atomic forces, and stress with Mean Absolute Error (MAE) values of 32 meV/atom, 71 meV/Å, and 0.365 GPa, respectively. The dataset used to train the model includes 37.8 million single-point energies, 11.7 billion force pairs, and 340.2 million stresses. We also demonstrated that GPTFF can be universally used to simulate various physical systems, such as crystal structure optimization, phase transition simulations, and mass transport.",
    "authors": [
      "Fankai Xie",
      "Tenglong Lu",
      "Sheng Meng",
      "Miao Liu"
    ],
    "publication_date": "2024-02-29T16:30:07Z",
    "arxiv_id": "http://arxiv.org/abs/2402.19327v1",
    "download_url": "https://arxiv.org/abs/2402.19327v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electronic correlation strength of inorganic electrides from first principles",
    "abstract": "We present a systematic study clarifying an electronic correlation trend of electrides from first principles. By using the maximally localized Wannier function and the constrained random phase approximation, we calculated the electronic correlation strength $(U-U_{nn})/|t|$ of 19 inorganic electrides, where $U$, $U_{nn}$, and $t$ are the effective onsite Coulomb repulsion, nearest-neighbor Coulomb repulsion, and the nearest-neighbor transfer integrals, respectively. The electronic correlation was found to be highly correlated with the dimensionality of the Wannier-function network of anionic electrons in electrides; the correlation strength varies in the order 0D $>>$ 1D $>$ 2D $\\sim$ 3D, showing good correspondence with experimental trends, and exceeds 10 (a measure for the emergence of exotic properties) in all the 0D systems and some of the 1D materials. We also found that the electronic correlation depends on the cation species surrounding the anionic electrons; in the 1D electrides, the electronic correlation becomes stronger for cationic walls consisting of $\\mathrm{Ca^{2+}}$, $\\mathrm{Sr^{2+}}$, and $\\mathrm{Ba^{2+}}$ in this order, and the correlation strength exceeds 10 for $\\mathrm{Ba_5As_3}$. The theoretical results indicate that 0- and 1-dimensional electrides will be new research targets for studies on strongly correlated electron systems.",
    "authors": [
      "Shu Kanno",
      "Tomofumi Tada",
      "Takeru Utsumi",
      "Kazuma Nakamura",
      "Hideo Hosono"
    ],
    "publication_date": "2021-11-01T11:30:44Z",
    "arxiv_id": "http://arxiv.org/abs/2111.00849v1",
    "download_url": "https://arxiv.org/abs/2111.00849v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mixing I and Br in Inorganic Perovskites: Atomistic Insights from Reactive Molecular Dynamics Simulations",
    "abstract": "All-inorganic halide perovskites have received a lot of attention as attractive alternatives to overcome the stability issues of hybrid halide perovskites that are commonly associated with organic cations. To find a compromise between the optoelectronic properties of CsPbI$_{3}$ and CsPbBr$_{3}$, perovskites with CsPb(Br$_{\\rm{x}}$I$_{\\rm{1-x}}$)$_{3}$ mixed compositions are commonly used. An additional benefit is that, without sacrificing the optoelectronic properties for applications such as solar cells or LEDs, small amounts of Br in CsPbI$_{3}$ can prevent the inorganic perovskite from degrading to a photoinactive nonperovskite yellow phase. Despite indications that strain in the perovskite lattice plays a role in the stabilization of the material, a full understanding of such strain is lacking. Here we develop a reactive force field (ReaxFF) for perovskites starting from our previous work for CsPbI$_{3}$, we extend this force field to CsPbBr$_{3}$ and mixed CsPb(Br$_{\\rm{x}}$I$_{\\rm{1-x}}$)$_{3}$ compounds. This force field is used in large-scale molecular dynamics simulations to study perovskite phase transitions and the internal ion dynamics associated with the phase transitions. We find that an increase of the Br content lowers the temperature at which the perovskite reaches a cubic structure. Specifically, by substituting Br for I, the smaller ionic radius of Br induces a strain in the lattice that changes the internal dynamics of the octahedra. Importantly, this effect propagates through the perovskite lattice ranging up to distances of 2 nm, explaining why small concentrations of Br in CsPb(Br$_{\\rm{x}}$I$_{\\rm{1-x}}$)$_{3}$ (x $\\leq$ 1/4) have a significant impact on the phase stability of mixed halide perovskites.",
    "authors": [
      "Mike Pols",
      "Adri C. T. van Duin",
      "Sofía Calero",
      "Shuxia Tao"
    ],
    "publication_date": "2023-09-18T08:53:31Z",
    "arxiv_id": "http://arxiv.org/abs/2309.09588v2",
    "download_url": "https://arxiv.org/abs/2309.09588v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin-Orbital Coupling in All-Inorganic Metal-Halide Perovskites: the Hidden Force that Matters",
    "abstract": "Highlighted with improved long-term thermal and environmental stability, all-inorganic metal halide perovskites exhibit tunable physical properties, cost-effective synthesis, and satisfactory optoelectronic performance, attracting increasing research interests worldwide. However, a less explored feature of these materials is their strong spin-orbit coupling (SOC), which is the hidden force influencing not only band structure but also properties including magnetoresistance, spin lifetime and singlet-triplet splitting. This review provides an overview of the fundamental aspects and the latest progress of the SOC and debate regarding Rashba effects in all-inorganic metal halide perovskites, providing critical insights into the physical phenomena and potential applications. Meanwhile, crystal structures and photophysics of all-inorganic perovskite are discussed in the context of SOC, along with the related experimental and characterization techniques. Furthermore, a recent understanding of the band topology in the all-inorganic halide perovskites is introduced to push the boundary even further for the novel applications of all-inorganic halide perovskites. Finally, an outlook is given on the potential directions of breakthroughs via leveraging the SOC in halide perovskites.",
    "authors": [
      "Pradeep Raja Anandan",
      "Muhammad Nadeem",
      "Chun-Ho Lin",
      "Simrjit Singh",
      "Xinwei Guan",
      "Jiyun Kim",
      "Shamim Shahroki",
      "Md Zahidur Rahaman",
      "Xun Geng",
      "Jing-Kai Huang",
      "Hien Nguyen",
      "Hanlin Hu",
      "Pankaj Sharma",
      "Jan Seidel",
      "Xiaolin Wang",
      "Tom Wu"
    ],
    "publication_date": "2023-11-28T11:08:27Z",
    "arxiv_id": "http://arxiv.org/abs/2311.16695v1",
    "download_url": "https://arxiv.org/abs/2311.16695v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structure Prediction of Epitaxial Inorganic Interfaces by Lattice and Surface Matching with Ogre",
    "abstract": "We present a new version of the Ogre open source Python package with the capability to perform structure prediction of epitaxial inorganic interfaces by lattice and surface matching. In the lattice matching step a scan over combinations of substrate and film Miller indices is performed to identify the domain-matched interfaces with the lowest mismatch. Subsequently, surface matching is conducted by Bayesian optimization to find the optimal interfacial distance and in-plane registry between the substrate and film. For the objective function, a geometric score function is proposed, based on the overlap and empty space between atomic spheres at the interface. The score function reproduces the results of density functional theory (DFT) at a fraction of the computational cost. The optimized interfaces are pre-ranked using a score function based on the similarity of the atomic environment at the interface to the bulk environment. Final ranking of the top candidate structures is performed with DFT. Ogre streamlines DFT calculations of interface energies and electronic properties by automating the construction of interface models. The application of Ogre is demonstrated for two interfaces of interest for quantum computing and spintronics, Al/InAs and Fe/InSb.",
    "authors": [
      "Saeed Moayedpour",
      "Derek Dardzinski",
      "Shuyang Yang",
      "Andrea Hwang",
      "Noa Marom"
    ],
    "publication_date": "2021-03-25T16:09:10Z",
    "arxiv_id": "http://arxiv.org/abs/2103.13947v1",
    "download_url": "https://arxiv.org/abs/2103.13947v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrical spin injection from an organic-based ferrimagnet in a hybrid organic/inorganic heterostructure",
    "abstract": "We report the successful extraction of spin polarized current from the organic-based room temperature ferrimagnetic semiconductor V[TCNE]x (x~2, TCNE: tetracyanoethylene; TC ~ 400 K, EG ~ 0.5 eV, s ~ 10-2 S/cm) and its subsequent injection into a GaAs/AlGaAs light-emitting diode (LED). The spin current tracks the magnetization of V[TCNE]x~2, is weakly temperature dependent, and exhibits heavy hole / light hole asymmetry. This result has implications for room temperature spintronics and the use of inorganic materials to probe spin physics in organic and molecular systems.",
    "authors": [
      "Lei Fang",
      "K. Deniz Bozdag",
      "Chia-Yi Chen",
      "P. A. Truitt",
      "A. J. Epstein",
      "E. Johnston-Halperin"
    ],
    "publication_date": "2010-08-03T23:42:15Z",
    "arxiv_id": "http://arxiv.org/abs/1008.0675v2",
    "download_url": "https://arxiv.org/abs/1008.0675v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Investigation of (CsMA)NaBiX$_6$ (MA= methylammonium; X=Cl,Br, I) Organic-Inorganic Hybrid Double Perovskites for Optoelectronic Applications: A First Principles Study",
    "abstract": "Organic-inorganic hybrid double perovskites have attracted increasing interest in the commercialization of lead-free and nontoxic perovskites due to their unique optoelectronic properties compared with inorganic perovskites. In this study, the structural, electronic, optical and properties of 3 Pb-free compounds (CsMA)NaBiX$_6$ (MA= methylammonium; X= Cl, Br, I) were simulated using first-principles density functional theory (DFT). Results show that the investigated compounds are semiconductors with tunable bandgaps characteristics that can be used in devices like light emitting diodes, and predict the suitability of the (CsMA)NaBiI$_6$ organic-inorganic hybrid double perovskite in this study for optoelectronic applications owing to its high absorption coefficient (in the order of $10^6$cm$^{-1}$), dielectric constant ($\\approx 3.24$), and refractive index (2.50) as well as its stability as revealed by its high formation energy. Additionally, the high absorption coefficient, high refractive indices and dielectric constants of the investigated materials posits that they have a number of optoelectronic applications including photovoltaic cells among others.",
    "authors": [
      "A. Johnson",
      "B. A. Ikyo",
      "T. J. Ikyumbur",
      "F. Gbaorun",
      "A. A. Nathan"
    ],
    "publication_date": "2023-06-10T12:00:14Z",
    "arxiv_id": "http://arxiv.org/abs/2306.07295v1",
    "download_url": "https://arxiv.org/abs/2306.07295v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]