[
  {
    "title": "Inorganic/inorganic composites through emulsion templating",
    "abstract": "Inorganic/inorganic composites are found in multiple applications crucial for the energy transition, from nuclear reactor to energy storage devices. Their microstructures dictate a number of properties, such as mass transport or fracture resistance. There has been a multitude of process developed to control the microstructure of inorganic/inorganic composites, from powder mixing and the use of short or long fibre, to tape casting for laminates up to recently 3D printing. Here, we combined emulsions and slip casting into a simpler, broadly available, inexpensive processing platform that allow for in situ control of a composite's microstructure that also enables complex shaping. Emulsions are used to form droplets of controllable size of one inorganic phase into another, while slip casting enable 3D shaping of the final part. Our study shows that slip casting emulsions trigger a two-steps solvent removal that opens the possibility for conformal coating of porosity. By making magnetically responsive droplets, we form inorganic fibre inside an inorganic matrix during slip casting, demonstrating a simple fabrication for long-fibre reinforced composites. We exemplify the potential of this processing platform by making strong and lightweight alumina scaffolds reinforced by a confirmed zirconia coating and alumina with metallic iron fibres that displays work of fracture an order of magnitude higher than alumina.",
    "authors": [
      "Tianhui Jiang",
      "Shitong Zhou",
      "Yinglun Hong",
      "Erik Poloni",
      "Eduardo Saiz",
      "Florian Bouville"
    ],
    "publication_date": "2024-01-24T18:06:34Z",
    "arxiv_id": "http://arxiv.org/abs/2401.13638v1",
    "download_url": "https://arxiv.org/abs/2401.13638v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predicting the Inorganic Exciton Peak Position in 2D Hybrid Organic-Inorganic Perovskites from Hybrid Density Functional Theory",
    "abstract": "Modelling the inorganic exciton contribution to 2D hybrid organic-inorganic perovskites is essential to understand their properties and screen for new materials. Here, we combine hybrid density functional theory calculations including spin orbit coupling (SOC) with the experimental relationship between the inorganic band gap and exciton binding energy to predict the inorganic exciton energy. For this purpose, we determine a universal exchange parameter for the HSE06 hybrid functional with SOC for lead-based 2D hybrid organic-inorganic perovskites. We further identify a relationship that connects PBE calculations to experiment-quality optical gaps and allows us to generalize the exchange mixing parameter other SOC approximations. Our approach opens the path to screen for 2D hybrid organic-inorganic perovskites with optimized spectra, e.g., for new solar cell or light emitting materials.",
    "authors": [
      "Svenja Janke"
    ],
    "publication_date": "2024-07-02T16:01:58Z",
    "arxiv_id": "http://arxiv.org/abs/2407.02388v1",
    "download_url": "https://arxiv.org/abs/2407.02388v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inverse Design of Inorganic Electrides",
    "abstract": "Electrides are ionic solids that consist of cationic frameworks and anionic electrons trapped in the voids of lattices. Organic electrides exist in a large abundance, but the thermal instability at room temperature and sensitivity to moisture are bottlenecks that limit their practical uses. Known inorganic electrides are rare but appear to have high thermal and chemical stability and exhibit promising applications as electron-emitting materials, superior catalysts and strong reducing agents. Here, we report a developed inverse-design method that can be used to search for a large variety of inorganic electrides. Our method utilizes the intrinsic property of interstitial electron localization of electrides as the global variable function being incorporated into the swarm-intelligence based structure searches. Through screening 99 binary ionic compounds, we have designed 89 new inorganic electrides that are classified into three-, two-, and zero-dimensional species according to the way that the interstitial electrons are localized and the conductive properties of the systems. Our work reveals the rich abundance of inorganic electrides by extending them into more general forms and provides new structure types for electrides that are not thought of as before.",
    "authors": [
      "Yunwei Zhang",
      "Hui Wang",
      "Yanchao Wang",
      "Lijun Zhang",
      "Yanming Ma"
    ],
    "publication_date": "2016-03-14T08:09:23Z",
    "arxiv_id": "http://arxiv.org/abs/1603.04161v1",
    "download_url": "https://arxiv.org/abs/1603.04161v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fabrication of hydrophobic inorganic coatings on natural lotus leaves for nanoimprint stamps",
    "abstract": "Hydrophobic inorganic films were obtained by direct deposition of copper or silicon onto natural lotus leaves by ion beam sputtering deposition technique. Scanning electron microscopy observations showed a lotus-leaf-like surface structure of the deposited inorganic films. Hydrophobic nature of the inorganic films on lotus leaves had been improved compared to the inorganic films deposited on flat silicon substrates. Water contact angles measured on the lotus-leaf-like copper and silicon films were 136.3 \\pm 8° and 117.8 \\pm 4.4°, respectively. The hydrophobic lotus-leaf-like inorganic films had been repeated used as nanoimprint stamps. Negative structures of lotus-leaf-like inorganic films were obtained on the polystyrene resist layers.",
    "authors": [
      "Shuxi Dai",
      "Wanyong Ding",
      "Yang Wang",
      "Dianbo Zhang",
      "Zuliang Du"
    ],
    "publication_date": "2011-06-11T11:42:49Z",
    "arxiv_id": "http://arxiv.org/abs/1106.2228v1",
    "download_url": "https://arxiv.org/abs/1106.2228v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Charge transfer at organic-inorganic interfaces",
    "abstract": "We studied the electron transfer from excitons in adsorbed indoline dye layers across the organic-inorganic interface. The hybrids consist of indoline derivatives on the one hand and different inorganic substrates (TiO$_2$, ZnO, SiO$_2$(0001), fused silica) on the other. We reveal the electron transfer times from excitons in dye layers to the organic-inorganic interface by analyzing the photoluminescence transients of the dye layers after femtosecond excitation and applying kinetic model calculations. A correlation between the transfer times and four parameters have been found:(i) the number of anchoring groups, (ii) the distance between the dye and the organic-inorganic interface, which was varied by the alkyl-chain lengths between the carboxylate anchoring group and the dye, (iii) the thickness of the adsorbed dye layer, and (iv) the level alignment between the excited dye ($π$*-level) and the conduction band minimum of the inorganic semiconductor.",
    "authors": [
      "Ingo Meyenburg",
      "Jane Falgenhauer",
      "Nils W. Rosemann",
      "Sangam Chatterjee",
      "Derck Schlettwein",
      "Wolfram Heimbrodt"
    ],
    "publication_date": "2016-09-21T15:11:01Z",
    "arxiv_id": "http://arxiv.org/abs/1609.06593v1",
    "download_url": "https://arxiv.org/abs/1609.06593v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Progress of Inorganic Scintillators for Future HEP Experiments",
    "abstract": "The Caltech HEP Crystal Lab has been actively investigating novel inorganic scintillators along the following three directions. Fast and radiation hard inorganic scintillators to face the challenge of severe radiation environment expected by future HEP experiments at hadron colliders, such as the high luminosity LHC and FCC hh. Ultrafast inorganic scintillators to face the challenge of unprecedented event rate expected by future HEP experiments searching for rare decays, such as Mu2e II, and ultrafast time of flight system at hadron colliders. Cost effective inorganic scintillators for the homogeneous hadron calorimeter concept to face the challenge of both electromagnetic and jet mass resolutions required by the proposed Higgs factory. We report novel materials along all directions: LuAG:Ce ceramic fibers for the HL LHC, Lu2O3:Yb ceramic scintillators for ultrafast applications, and ABS:Ce and DSB:Ce glass scintillators for the proposed Higgs factory. The result of this investigation may also benefit nuclear physics experiments, GHz hard X ray imaging, medical imaging, and homeland security applications.",
    "authors": [
      "Liyuan Zhang",
      "Ren-Yuan Zhu"
    ],
    "publication_date": "2024-08-20T00:28:04Z",
    "arxiv_id": "http://arxiv.org/abs/2408.10466v1",
    "download_url": "https://arxiv.org/abs/2408.10466v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inorganic synthesis-structure maps in zeolites with machine learning and crystallographic distances",
    "abstract": "Zeolites are inorganic materials known for their diversity of applications, synthesis conditions, and resulting polymorphs. Although their synthesis is controlled both by inorganic and organic synthesis conditions, computational studies of zeolite synthesis have focused mostly on organic template design. In this work, we use a strong distance metric between crystal structures and machine learning (ML) to create inorganic synthesis maps in zeolites. Starting with 253 known zeolites, we show how the continuous distances between frameworks reproduce inorganic synthesis conditions from the literature without using labels such as building units. An unsupervised learning analysis shows that neighboring zeolites according to our metric often share similar inorganic synthesis conditions, even in template-based routes. In combination with ML classifiers, we find synthesis-structure relationships for 14 common inorganic conditions in zeolites, namely Al, B, Be, Ca, Co, F, Ga, Ge, K, Mg, Na, P, Si, and Zn. By explaining the model predictions, we demonstrate how (dis)similarities towards known structures can be used as features for the synthesis space. Finally, we show how these methods can be used to predict inorganic synthesis conditions for unrealized frameworks in hypothetical databases and interpret the outcomes by extracting local structural patterns from zeolites. In combination with template design, this work can accelerate the exploration of the space of synthesis conditions for zeolites.",
    "authors": [
      "Daniel Schwalbe-Koda",
      "Daniel E. Widdowson",
      "Tuan Anh Pham",
      "Vitaliy A. Kurlin"
    ],
    "publication_date": "2023-07-20T15:07:49Z",
    "arxiv_id": "http://arxiv.org/abs/2307.10935v1",
    "download_url": "https://arxiv.org/abs/2307.10935v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inorganic Scintillators for Future HEP Experiments",
    "abstract": "Future HEP experiments at the energy and intensity frontiers present stringent challenges to inorganic scintillators in radiation tolerance, ultrafast time response and cost. This paper reports recent progress in radiation hard, ultrafast, and cost-effective inorganic scintillators for future HEP experiments. Examples are LYSO crystals for a precision time of flight detector, LuAG ceramics for an ultracompact, radiation hard shashlik sampling calorimeter, BaF2:Y crystals for an ultrafast calorimeter, and cost-effective scintillators for a homogeneous hadron calorimeter. Applications for Gigahertz hard X-ray imaging will also be discussed.",
    "authors": [
      "Chen Hu",
      "Liyuan Zhang",
      "Ren-Yuan Zhu"
    ],
    "publication_date": "2022-03-13T18:36:06Z",
    "arxiv_id": "http://arxiv.org/abs/2203.06731v1",
    "download_url": "https://arxiv.org/abs/2203.06731v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inorganic Synthesis Reaction Condition Prediction with Generative Machine Learning",
    "abstract": "Data-driven synthesis planning with machine learning is a key step in the design and discovery of novel inorganic compounds with desirable properties. Inorganic materials synthesis is often guided by chemists' prior knowledge and experience, built upon experimental trial-and-error that is both time and resource consuming. Recent developments in natural language processing (NLP) have enabled large-scale text mining of scientific literature, providing open source databases of synthesis information of synthesized compounds, material precursors, and reaction conditions (temperatures, times). In this work, we employ a conditional variational autoencoder (CVAE) to predict suitable inorganic reaction conditions for the crucial inorganic synthesis steps of calcination and sintering. We find that the CVAE model is capable of learning subtle differences in target material composition, precursor compound identities, and choice of synthesis route (solid-state, sol-gel) that are present in the inorganic synthesis space. Moreover, the CVAE can generalize well to unseen chemical entities and shows promise for predicting reaction conditions for previously unsynthesized compounds of interest.",
    "authors": [
      "Christopher Karpovich",
      "Zach Jensen",
      "Vineeth Venugopal",
      "Elsa Olivetti"
    ],
    "publication_date": "2021-12-17T16:38:15Z",
    "arxiv_id": "http://arxiv.org/abs/2112.09612v1",
    "download_url": "https://arxiv.org/abs/2112.09612v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Room-Temperature Processing of Inorganic Perovskite Films to Enable Flexible Solar Cells",
    "abstract": "Inorganic lead halide perovskite materials have attracted great attention recently due to their potential for greater thermal stability compared to hybrid organic perovskites. However, the high processing temperature to convert from the non-perovskite phase to cubic perovskite phase in many of these systems has limited their application in flexible optoelectronic devices. Here, we report a room temperature processed inorganic PSC based on CsPbI2Br as the light harvesting layer. By combing this composition with key precursor solvents, we show that the inorganic perovskite film can be prepared by the vacuum-assist method under room temperature conditions in air. Unencapsulated devices achieved the power conversion efficiency up to 8.67% when measured under 1-sun irradiation. Exploiting this room temperature process, flexible inorganic PSCs based on an inorganic metal halide perovskite material is demonstrated.",
    "authors": [
      "Dianyi Liu",
      "Chenchen Yang",
      "Matthew Bates",
      "Richard R. Lunt"
    ],
    "publication_date": "2018-06-18T20:46:15Z",
    "arxiv_id": "http://arxiv.org/abs/1806.06855v1",
    "download_url": "https://arxiv.org/abs/1806.06855v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deep Reinforcement Learning for Inverse Inorganic Materials Design",
    "abstract": "A major obstacle to the realization of novel inorganic materials with desirable properties is the inability to perform efficient optimization across both materials properties and synthesis of those materials. In this work, we propose a reinforcement learning (RL) approach to inverse inorganic materials design, which can identify promising compounds with specified properties and synthesizability constraints. Our model learns chemical guidelines such as charge and electronegativity neutrality while maintaining chemical diversity and uniqueness. We demonstrate a multi-objective RL approach, which can generate novel compounds with targeted materials properties including formation energy and bulk/shear modulus alongside a lower sintering temperature synthesis objectives. Using this approach, the model can predict promising compounds of interest, while suggesting an optimized chemical design space for inorganic materials discovery.",
    "authors": [
      "Elton Pan",
      "Christopher Karpovich",
      "Elsa Olivetti"
    ],
    "publication_date": "2022-10-21T13:06:19Z",
    "arxiv_id": "http://arxiv.org/abs/2210.11931v1",
    "download_url": "https://arxiv.org/abs/2210.11931v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The impact of the halide cage on the electronic properties of fully inorganic caesium lead halide perovskites",
    "abstract": "Perovskite solar cells with record power conversion efficiency are fabricated by alloying both hybrid and fully inorganic compounds. While the basic electronic properties of the hybrid perovskites are now well understood, key electronic parameters for solar cell performance, such as the exciton binding energy of fully inorganic perovskites, are still unknown. By performing magneto transmission measurements, we determine with high accuracy the exciton binding energy and reduced mass of fully inorganic CsPbX$_3$ perovskites (X=I, Br, and an alloy of these). The well behaved (continuous) evolution of the band gap with temperature in the range $4-270$\\,K suggests that fully inorganic perovskites do not undergo structural phase transitions like their hybrid counterparts. The experimentally determined dielectric constants indicate that at low temperature, when the motion of the organic cation is frozen, the dielectric screening mechanism is essentially the same both for hybrid and inorganic perovskites, and is dominated by the relative motion of atoms within the lead-halide cage.",
    "authors": [
      "Z. Yang",
      "A. Surrente",
      "K. Galkowski",
      "A. Miyata",
      "O. Portugall",
      "R. J. Sutton",
      "A. A. Haghighirad",
      "H. J. Snaith",
      "D. K. Maude",
      "P. Plochocka",
      "R. J. Nicholas"
    ],
    "publication_date": "2017-06-14T13:43:08Z",
    "arxiv_id": "http://arxiv.org/abs/1706.04489v1",
    "download_url": "https://arxiv.org/abs/1706.04489v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Additive manufacturing of inorganic scintillator-based particle detectors",
    "abstract": "Inorganic scintillators are widely used for scientific, industrial and medical applications. The development of 3D printing with inorganic scintillators would allow fast creation of detector prototypes for registration of ionizing radiation, such as alpha and beta, gamma particles in thin layers of active material and soft X-ray radiation. This article reports on the technical work and scientific achievements that aimed at developing a new inorganic scintillation filament to be used for the 3D printing of composite scintillator materials: study and definition of the scintillator composition; development of the methods for the inorganic scintillator filament production and further implementation in the available 3D printing technologies; study of impact of the different 3D printing modes on the material scintillation characteristics. Also, 3D printed scintillators can be used for creation of combined detectors for high-energy physics.",
    "authors": [
      "T. Sibilieva",
      "V. Alekseev",
      "S. Barsuk",
      "S. Berns",
      "E. Boillat",
      "I. Boiaryntseva",
      "A. Boyarintsev",
      "A. Carbone",
      "A. De Roeck",
      "S. Dolan",
      "T. Driuk",
      "A. Gendotti",
      "I. Gerasymov",
      "B. Grynyov",
      "S. Hugon",
      "U. Kose",
      "O. Opolonin",
      "A. Rubbia",
      "D. Sgalaberna",
      "N. Sibilyev",
      "S. Tretyak",
      "T. Weber",
      "J. Wuthrich",
      "X. Y. Zhao"
    ],
    "publication_date": "2022-12-27T07:43:54Z",
    "arxiv_id": "http://arxiv.org/abs/2212.13394v1",
    "download_url": "https://arxiv.org/abs/2212.13394v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inorganic Crystal Structure Prototype Database based on Unsupervised Learning of Local Atomic Environments",
    "abstract": "Recognition of structure prototypes from tremendous known inorganic crystal structures has been an important subject beneficial for material science research and new materials design. The existing databases of inorganic crystal structure prototypes were mostly constructed by classifying materials in terms of the crystallographic space group information. Herein, we employed a distinct strategy to construct the inorganic crystal structure prototype database, relying on the classification of materials in terms of local atomic environments (LAE) accompanied by unsupervised machine learning method. Specifically, we adopted a hierarchical clustering approach onto all experimentally known inorganic crystal structures data to identify structure prototypes. The criterion for hierarchical clustering is the LAE represented by the state-of-the-art structure fingerprints of the improved bond-orientational order parameters and the smooth overlap of atomic positions. This allows us to build up a LAE-based Inorganic Crystal Structure Prototype Database (LAE-ICSPD) containing 15,613 structure prototypes with defined stoichiometries. In addition, we have developed a Structure Prototype Generator Infrastructure (SPGI) package, which is a useful toolkit for structure prototype generation. Our developed SPGI toolkit and LAE-ICSPD are beneficial for investigating inorganic materials in a global way as well as accelerating materials discovery process in the data-driven mode.",
    "authors": [
      "Shulin Luo",
      "Bangyu Xing",
      "Muhammad Faizan",
      "Jiahao Xie",
      "Kun Zhou",
      "Ruoting Zhao",
      "Tianshu Li",
      "Xinjiang Wang",
      "Yuhao Fu",
      "Xin He",
      "Jian Lv",
      "Lijun Zhang"
    ],
    "publication_date": "2022-06-08T13:06:45Z",
    "arxiv_id": "http://arxiv.org/abs/2206.03871v1",
    "download_url": "https://arxiv.org/abs/2206.03871v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Designing inorganic semiconductors with cold-rolling processability",
    "abstract": "While metals can be readily processed and reshaped by cold rolling, most bulk inorganic semiconductors are brittle materials that tend to fracture when plastically deformed. Manufacturing thin sheets and foils of inorganic semiconductors is therefore a bottleneck problem, severely restricting their use in flexible electronics applications. It was recently reported that a few single-crystalline two-dimensional van der Waals (vdW) semiconductors, such as InSe, are deformable under compressive stress. Here we demonstrate that intralayer fracture toughness can be tailored via compositional design to make inorganic semiconductors processable by cold rolling. We report systematic ab initio calculations covering a range of van der Waals semiconductors homologous to InSe, leading to material-property maps that forecast trends in both the susceptibility to interlayer slip and the intralayer fracture toughness against cracking. GaSe has been predicted, and experimentally confirmed, to be practically amenable to being rolled to large (three quarters) thickness reduction and length extension by a factor of three. Our findings open a new realm of possibility for alloy selection and design towards processing-friendly group-III chalcogenides for flexible electronic and thermoelectric applications.",
    "authors": [
      "Xu-Dong Wang",
      "Jieling Tan",
      "Jian Ouyang",
      "Hangming Zhang",
      "Jiang-Jing Wang",
      "Yuecun Wang",
      "Volker L. Deringer",
      "Jian Zhou",
      "Wei Zhang",
      "En Ma"
    ],
    "publication_date": "2022-06-20T01:49:44Z",
    "arxiv_id": "http://arxiv.org/abs/2207.02670v1",
    "download_url": "https://arxiv.org/abs/2207.02670v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inorganic photonic materials for lasers and biomedicine in the infrared",
    "abstract": "Inorganic photonic materials demonstrating luminescence in the infrared spectral range (> 1 um) play a vital important role in modern information, telecommunication, and biomedicine disciplines.",
    "authors": [
      "H. -T. Sun"
    ],
    "publication_date": "2013-04-02T09:35:57Z",
    "arxiv_id": "http://arxiv.org/abs/1304.0574v1",
    "download_url": "https://arxiv.org/abs/1304.0574v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Statistical Distribution of Crystallographic Groups for Inorganic Crystal Structure Database",
    "abstract": "We introduce a method that defines the species (representatives) of inorganic compounds, and studied the statistical distribution of the defined species among space groups (distribution of space groups), by using ICSD (Inorganic Crystal Structure Database). Here we show that the number of formula units in a unit cell gives a natural classification to understand the statistical distribution of crystallographic groups.",
    "authors": [
      "Miyako Fujiwara",
      "Yoshiaki Itoh",
      "Takeo Matsumoto",
      "Hiroshi Takeda"
    ],
    "publication_date": "2011-06-29T02:22:19Z",
    "arxiv_id": "http://arxiv.org/abs/1106.5833v1",
    "download_url": "https://arxiv.org/abs/1106.5833v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Accelerated Inorganic Materials Design with Generative AI Agents",
    "abstract": "Designing inorganic crystalline materials with tailored properties is critical to technological innovation, yet current generative computational methods often struggle to efficiently explore desired targets with sufficient interpretability. Here, we present MatAgent, a generative approach for inorganic materials discovery that harnesses the powerful reasoning capabilities of large language models (LLMs). By combining a diffusion-based generative model for crystal structure estimation with a predictive model for property evaluation, MatAgent uses iterative, feedback-driven guidance to steer material exploration precisely toward user-defined targets. Integrated with external cognitive tools-including short-term memory, long-term memory, the periodic table, and a comprehensive materials knowledge base-MatAgent emulates human expert reasoning to vastly expand the accessible compositional space. Our results demonstrate that MatAgent robustly directs exploration toward desired properties while consistently achieving high compositional validity, uniqueness, and material novelty. This framework thus provides a highly interpretable, practical, and versatile AI-driven solution to accelerate the discovery and design of next-generation inorganic materials.",
    "authors": [
      "Izumi Takahara",
      "Teruyasu Mizoguchi",
      "Bang Liu"
    ],
    "publication_date": "2025-04-01T12:51:07Z",
    "arxiv_id": "http://arxiv.org/abs/2504.00741v1",
    "download_url": "https://arxiv.org/abs/2504.00741v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "WyCryst: Wyckoff Inorganic Crystal Generator Framework",
    "abstract": "Generative design marks a significant data-driven advancement in the exploration of novel inorganic materials, which entails learning the symmetry equivalent to the crystal structure prediction (CSP) task and subsequent learning of their target properties. Generative models have been developed in the last few years that use custom Variational Autoencoders (VAEs), Generative Adversarial Networks (GANs), and diffusion models. While periodicity and global Euclidian symmetry in three dimensions through translations, rotations and reflections have recently been accounted for, symmetry constraints within allowed space groups have not. This is especially important because the final step involves energy relaxation on the generated crystal structures to find the relaxed crystal structure, typically using Density Functional Theory (DFT). To address this explicitly, we introduce a generative design framework (WyCryst), composed of three pivotal components: 1) a Wyckoff position based inorganic crystal representation, 2) a property-directed VAE model and 3) an automated DFT workflow for structure refinement. Our model selectively generates materials that follow the ground truth of unit cell space group symmetry by encoding the Wyckoff representation for each space group. We successfully reproduce a variety of existing materials: CaTiO3 (space group, SG No. 62 and 221), CsPbI3 (SG No. 221), BaTiO3 (SG No. 160), and CuInS2 (SG No.122) for both ground state as well as polymorphic structure predictions. We also generate several new ternary materials not found in the inorganic materials database (Materials Project), which are proved to be stable, retaining their symmetry, and we also check their phonon stability, using our automated DFT workflow highlighting the validity of our approach. We believe our symmetry-aware WyCryst takes a vital step towards AI-driven inorganic materials discovery.",
    "authors": [
      "Ruiming Zhu",
      "Wei Nong",
      "Shuya Yamazaki",
      "Kedar Hippalgaonkar"
    ],
    "publication_date": "2023-11-29T18:59:31Z",
    "arxiv_id": "http://arxiv.org/abs/2311.17916v2",
    "download_url": "https://arxiv.org/abs/2311.17916v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Advances in structure prediction of inorganic compounds",
    "abstract": "There is a huge and confusing literature about inorganic crystal structure prediction. The word \"prediction\" is used sometimes as meaning \"structure determination\" since the process described needs the knowledge of the chemical composition and of the cell parameters. Some clarifications are presented here together with a new software (GRINSP) and some of its predictions.",
    "authors": [
      "Armel Le Bail"
    ],
    "publication_date": "2006-06-01T08:31:36Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0606025v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0606025v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Model of Algal Growth Depending on Nutrients and Inorganic Carbon in a Poorly Mixed Water Column",
    "abstract": "In this paper, we establish a reaction-diffusion-advection partial differential equation model to describe the growth of algae depending on both nutrients and inorganic carbon in a poorly mixed water column. Nutrients from the water bottom and inorganic carbon from the water surface form an asymmetric resource supply mechanism on the algal growth. The existence and stability of semi-trivial steady state and coexistence steady state of the model are proved, and a threshold condition for the regime shift from extinction to survival of algae is established. The influence of environmental parameters on the vertical distribution of algae is investigated in the water column. It is shown that the vertical distribution of algae can exhibit many different profiles under the joint limitation of nutrients and inorganic carbon.",
    "authors": [
      "Jimin Zhang",
      "Junping Shi",
      "Xiaoyuan Chang"
    ],
    "publication_date": "2020-01-31T17:00:49Z",
    "arxiv_id": "http://arxiv.org/abs/2002.02803v1",
    "download_url": "https://arxiv.org/abs/2002.02803v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Machine learning-guided synthesis of advanced inorganic materials",
    "abstract": "Synthesis of advanced inorganic materials with minimum number of trials is of paramount importance towards the acceleration of inorganic materials development. The enormous complexity involved in existing multi-variable synthesis methods leads to high uncertainty, numerous trials and exorbitant cost. Recently, machine learning (ML) has demonstrated tremendous potential for material research. Here, we report the application of ML to optimize and accelerate material synthesis process in two representative multi-variable systems. A classification ML model on chemical vapor deposition-grown MoS2 is established, capable of optimizing the synthesis conditions to achieve higher success rate. While a regression model is constructed on the hydrothermal-synthesized carbon quantum dots, to enhance the process-related properties such as the photoluminescence quantum yield. Progressive adaptive model is further developed, aiming to involve ML at the beginning stage of new material synthesis. Optimization of the experimental outcome with minimized number of trials can be achieved with the effective feedback loops. This work serves as proof of concept revealing the feasibility and remarkable capability of ML to facilitate the synthesis of inorganic materials, and opens up a new window for accelerating material development.",
    "authors": [
      "Bijun Tang",
      "Yuhao Lu",
      "Jiadong Zhou",
      "Han Wang",
      "Prafful Golani",
      "Manzhang Xu",
      "Quan Xu",
      "Cuntai Guan",
      "Zheng Liu"
    ],
    "publication_date": "2019-05-10T04:53:29Z",
    "arxiv_id": "http://arxiv.org/abs/1905.03938v1",
    "download_url": "https://arxiv.org/abs/1905.03938v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling of Light Production in Inorganic Scintillators",
    "abstract": "In recent experiments, inorganic scintillators have been used to study the decays of exotic nuclei, providing an alternative to silicon detectors and enabling measurements that were previously impossible. However, proper use of these materials requires us to understand and quantify the scintillation process. In this work, we propose a framework based on that of Birks [Proc. Phys. Soc. A 64, 874] and Meyer and Murray [Phys. Rev. 128, 98] to model the light output of inorganic scintillators in response to beams of energetic heavy ions over a broad range of energies. Our model suggests that, for sufficiently heavy ions at high energies, the majority of the light output is associated with the creation of delta electrons, which are induced by the passage of the beam through the material. These delta electrons dramatically impact the response of detection systems when subject to ions with velocities typical of beams in modern fragmentation facilities. We test the accuracy of our model with data from Lutetium Yttrium Orthosilicate (LYSO:Ce), a common inorganic scintillator. We compare calculated light production and quenching factors with experimental data for heavy ions of varying mass and energy as well as make a quantitative estimate of the effects of delta rays on overall light output. The model presented herein will serve as a basic framework for further studies of scintillator response to heavy ions. Our results are crucial in planning future experiments where relativistic exotic nuclei are interacting with scintillator detectors.",
    "authors": [
      "B. Kreider",
      "I. Cox",
      "R. Grzywacz",
      "J. M. Allmond",
      "A. Augustyn",
      "N. Braukman",
      "P. Brionnet",
      "A. Esmaylzadeh",
      "J. Fischer",
      "N. Fukuda",
      "G. Garcia De Lorenzo",
      "S. Go",
      "S. Hanai",
      "D. Hoskins",
      "N. Imai",
      "T. T. King",
      "N. Kitamura",
      "K. Kolos",
      "A. Korgul",
      "C. Mazzocchi",
      "S. Nishimura",
      "K. Nishio",
      "V. Phong",
      "T. Ruland",
      "K. P. Rykaczewski",
      "A. Skruch",
      "Z. Y. Xu",
      "R. Yokoyama"
    ],
    "publication_date": "2025-08-21T12:38:53Z",
    "arxiv_id": "http://arxiv.org/abs/2508.15513v1",
    "download_url": "https://arxiv.org/abs/2508.15513v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ternary Inorganic Electrides with mixed bonding",
    "abstract": "A high-throughput screening based on first-principles calculations was performed to search for new ternary inorganic electrides. From the available materials database, we identified three new thermodynamically stable materials (Li$_{12}$Mg$_3$Si$_4$, NaBa$_2$O and Ca$_5$Ga$_2$N$_4$) as potential electrides made by main group elements, in addition to the well known mayenite based electride (C12A7:$e^-$). Different from those conventional inorganic electrides in which the excess electrons play only the role of anions, the three new materials, resembling the electrides found in simple metals under high pressure, possess mixed ionic and metallic bonding. The interplay between two competing mechanisms, together with the different crystal packing motifs, gives rise to a variety of geometries in anionic electrons, and rich physical phenomena such as ferromagnetism, superconductivity and metal-insulator transition. Our finding here bridges the gap between electrides found at ambient and high pressure conditions.",
    "authors": [
      "Junjie Wang",
      "Qiang Zhu",
      "Zhenhai Wang",
      "Hideo Hosono"
    ],
    "publication_date": "2018-11-26T20:49:21Z",
    "arxiv_id": "http://arxiv.org/abs/1811.10682v2",
    "download_url": "https://arxiv.org/abs/1811.10682v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tight-binding description of inorganic lead halide perovskites in cubic phase",
    "abstract": "Band structure of inorganic lead halide perovskites is substantially different from the band structure of group IV, III-V and II-VI semiconductors. However, the standard empirical tight-binding model with sp3d5s* basis gives nearly perfect fit of band structure calculated in the density functional theory. The tight-binding calculations of ultrathin CsPbI3 layer show good agreement with the corresponding DFT calculations. The parameters corrected for the experimental data allow for the numerically cheap atomistic calculations of inorganic perovskite nanostructures.",
    "authors": [
      "M. O. Nestoklon"
    ],
    "publication_date": "2020-12-29T11:14:11Z",
    "arxiv_id": "http://arxiv.org/abs/2012.14705v2",
    "download_url": "https://arxiv.org/abs/2012.14705v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Autonomous Inorganic Materials Discovery via Multi-Agent Physics-Aware Scientific Reasoning",
    "abstract": "Conventional machine learning approaches accelerate inorganic materials design via accurate property prediction and targeted material generation, yet they operate as single-shot models limited by the latent knowledge baked into their training data. A central challenge lies in creating an intelligent system capable of autonomously executing the full inorganic materials discovery cycle, from ideation and planning to experimentation and iterative refinement. We introduce SparksMatter, a multi-agent AI model for automated inorganic materials design that addresses user queries by generating ideas, designing and executing experimental workflows, continuously evaluating and refining results, and ultimately proposing candidate materials that meet the target objectives. SparksMatter also critiques and improves its own responses, identifies research gaps and limitations, and suggests rigorous follow-up validation steps, including DFT calculations and experimental synthesis and characterization, embedded in a well-structured final report. The model's performance is evaluated across case studies in thermoelectrics, semiconductors, and perovskite oxides materials design. The results demonstrate the capacity of SparksMatter to generate novel stable inorganic structures that target the user's needs. Benchmarking against frontier models reveals that SparksMatter consistently achieves higher scores in relevance, novelty, and scientific rigor, with a significant improvement in novelty across multiple real-world design tasks as assessed by a blinded evaluator. These results demonstrate SparksMatter's unique capacity to generate chemically valid, physically meaningful, and creative inorganic materials hypotheses beyond existing materials knowledge.",
    "authors": [
      "Alireza Ghafarollahi",
      "Markus J. Buehler"
    ],
    "publication_date": "2025-08-04T23:40:43Z",
    "arxiv_id": "http://arxiv.org/abs/2508.02956v1",
    "download_url": "https://arxiv.org/abs/2508.02956v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predicting the future applications of any stoichiometric inorganic material through learning from past literature",
    "abstract": "Through learning from past literature, artificial intelligence models have been able to predict the future applications of various stoichiometric inorganic materials in a variety of subfields of materials science. This capacity offers exciting opportunities for boosting the research and development (R&D) of new functional materials. Unfortunately, the previous models can only provide the prediction for existing materials in past literature, but cannot predict the applications of new materials. Here, we construct a model that can predict the applications of any stoichiometric inorganic material (regardless of whether it is a new material). Historical validation confirms the high reliability of our model. Key to our model is that it allows the generation of the word embedding of any stoichiometric inorganic material, which cannot be achieved by the previous models. This work constructs a powerful model, which can predict the future applications of any stoichiometric inorganic material using only a laptop, potentially revolutionizing the R&D paradigm for new functional materials",
    "authors": [
      "Yu Wu",
      "Teng Liu",
      "Haiyang Song",
      "Yinghe Zhao",
      "Jinxing Gu",
      "Kailang Liu",
      "Huiqiao Li",
      "Jinlan Wang",
      "Tianyou Zhai"
    ],
    "publication_date": "2024-04-09T08:43:24Z",
    "arxiv_id": "http://arxiv.org/abs/2404.06120v1",
    "download_url": "https://arxiv.org/abs/2404.06120v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "General Learning of the Electric Response of Inorganic Materials",
    "abstract": "We present MACE-Field, a field-aware $O(3)$-equivariant interatomic potential that provides a compact, derivative-consistent route to dielectric properties (such as polarisation $\\mathbf P$, Born effective charges $Z^*$ and polarisability $\\boldsymbolα$) and finite-field simulations across chemistry for inorganic solids. MACE-Field preserves the standard MACE readout and can inherit existing MACE foundation weights, turning pretrained models into field-aware ones with minimal change. To demonstrate, we fine-tune MACE-MP-0 on multiple heads covering BECs and polarisabilities ($\\sim$6k MP dielectrics spanning 81 elements), polarisations (2.5k MP nonpolar-to-polar polarisation branches), and energies, forces, and stresses (10,000 structure-replay set from MPtraj), resulting in a field-aware foundation model, MACE-Field-MP-0. We show that MACE-Field can evaluate polarisation branches and spontaneous polarisations, predict $Z^*$ and dielectric constants across diverse chemistries, and reproduce finite-field MD simulations, such as BaTiO$_3$ polarisation hysteresis and the IR/Raman and dielectric spectra of $α$-quartz, benchmarking against Allegro-pol and DFPT.",
    "authors": [
      "Bradley A. A. Martin",
      "Alex M. Ganose",
      "Venkat Kapil",
      "Tingwei Li",
      "Keith T. Butler"
    ],
    "publication_date": "2025-08-25T10:25:22Z",
    "arxiv_id": "http://arxiv.org/abs/2508.17870v2",
    "download_url": "https://arxiv.org/abs/2508.17870v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Assignment of Framework Types to the Zeolite Crystals in the Inorganic Crystal Structure Database",
    "abstract": "In this work the framework type was assigned to 1370 zeolite crystals included in the Inorganic Crystal Structure Database.",
    "authors": [
      "M. Lach-hab",
      "S. Yang",
      "I. Vaisman",
      "E. Blaisten-Barojas"
    ],
    "publication_date": "2009-04-16T21:42:50Z",
    "arxiv_id": "http://arxiv.org/abs/0904.2597v1",
    "download_url": "https://arxiv.org/abs/0904.2597v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interplay between organic cations and inorganic framework and incommensurability in hybrid lead-halide perovskite CH3NH3PbBr3",
    "abstract": "Organic-inorganic coupling in the hybrid lead-halide perovskite is a central issue in rationalizing the outstanding photovoltaic performance of these emerging materials. Here we compare and contrast the evolution of structure and dynamics of the hybrid CH3NH3PbBr3 and the inorganic CsPbBr3 lead-halide perovskites with temperature, using Raman spectroscopy and single-crystal X-ray diffraction. Results reveal a stark contrast between their order-disorder transitions, abrupt for the hybrid whereas smooth for the inorganic perovskite. X-ray diffraction observes an intermediate incommensurate phase between the ordered and the disordered phases in CH3NH3PbBr3. Low-frequency Raman scattering captures the appearance of a sharp soft mode in the incommensurate phase, ascribed to the theoretically predicted amplitudon mode. Our work highlights the interaction between the structural dynamics of organic cation CH3NH3+ and the lead-halide framework, and unravels the competition between tendencies of the organic and inorganic moieties to minimize energy in the incommensurate phase of the hybrid perovskite structure.",
    "authors": [
      "Yinsheng Guo",
      "Omer Yaffe",
      "Daniel W. Paley",
      "Alexander N. Beecher",
      "Trevor D. Hull",
      "Guilherme Szpak",
      "Jonathan S. Owen",
      "Louis E. Brus",
      "Marcos A. Pimenta"
    ],
    "publication_date": "2017-05-30T15:06:55Z",
    "arxiv_id": "http://arxiv.org/abs/1705.10691v2",
    "download_url": "https://arxiv.org/abs/1705.10691v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tunable Semiconductors: Control over Carrier States and Excitations in Layered Hybrid Organic-Inorganic Perovskites",
    "abstract": "For a class of 2D hybrid organic-inorganic perovskite semiconductors based on $π$-conjugated organic cations, we predict quantitatively how varying the organic and inorganic component allows control over the nature, energy and localization of carrier states in a quantum-well-like fashion. Our first-principles predictions, based on large-scale hybrid density-functional theory with spin-orbit coupling, show that the interface between the organic and inorganic parts within a single hybrid can be modulated systematically, enabling us to select between different type-I and type-II energy level alignments. Energy levels, recombination properties and transport behavior of electrons and holes thus become tunable by choosing specific organic functionalizations and juxtaposing them with suitable inorganic components.",
    "authors": [
      "Chi Liu",
      "William Huhn",
      "Ke-Zhao Du",
      "Alvaro Vazquez-Mayagoitia",
      "David Dirkes",
      "Wei You",
      "Yosuke Kanai",
      "David B. Mitzi",
      "Volker Blum"
    ],
    "publication_date": "2018-03-20T03:05:51Z",
    "arxiv_id": "http://arxiv.org/abs/1803.07230v2",
    "download_url": "https://arxiv.org/abs/1803.07230v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Aromaticity in Polyacene Analogues of Inorganic Ring Compounds",
    "abstract": "The aromaticity in the polyacene analogues of several inorganic ring compounds (BN-acenes, CN-acenes, BO-acenes and Na6-acenes) is reported here for the first time. Conceptual density functional theory based reactivity descriptors and the nucleus independent chemical shift (NICS) values are used in this analysis.",
    "authors": [
      "Pratim Kumar Chattaraj",
      "Debesh Ranjan Roy"
    ],
    "publication_date": "2006-12-17T07:09:24Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0612165v1",
    "download_url": "https://arxiv.org/abs/physics/0612165v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A universal model for the formation energy prediction of inorganic compounds",
    "abstract": "Harnessing the recent advance in data science and materials science, it is feasible today to build predictive models for materials properties. In this study, we employ the data of high-throughput quantum mechanics calculations based on 170,714 inorganic crystalline compounds to train a machine learning model for formation energy prediction. Different from the previous work, our model reaches a fairly good predictive ability (R2=0.982 and MAE=0.07 eVatom-1, DenseNet model) and meanwhile can be universally applied to the large phase space of inorganic materials. The improvement comes from several effective structure-dependent descriptors that are proposed to take the information of electronegativity and structure into account. This model can provide a useful tool to search for new materials in a vast phase space in a fast and cost-effective manner.",
    "authors": [
      "Yingzong Liang",
      "Mingwei Chen",
      "Yanan Wang",
      "Huaxian Jia",
      "Tenglong Lu",
      "Fankai Xie",
      "Sheng Meng",
      "Miao Liu"
    ],
    "publication_date": "2021-08-01T01:43:37Z",
    "arxiv_id": "http://arxiv.org/abs/2108.00349v1",
    "download_url": "https://arxiv.org/abs/2108.00349v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Study of Electron Transport in Organic and Inorganic Atomic Monolayer Based MOS/MOSFET",
    "abstract": "The wide research interest for the potential nanoelectronics applications are attracted by the organic and inorganic monolayer materials. In this work, we have studied the organic monolayer such as trichloro (1H,1H,2H,2H-perfluorooctyl)-silane (FOTS), hexamethyldisilazane (HMDS) and inorganic monolayers such as hexagonal - boron nitride (h-BN) and molybdenum disulfide (MoS2) based MOS devices. The organic monolayer based configurations are Au/FOTS/p-Si and Au/HMDS/p-Si. The inorganic monolayer based configurations are Au/MoS2/SiO2/p-Si and Au/h-BN/SiO2/p-Si. These configurations were examined and compared with Au/SiO2/p-Si MOS configuration using the Multi-dielectric Energy Band Diagram Program (MEBDP) and MOSFeT simulation software. The C-V and I-V characteristics of MOS and MOSFET of FOTS, HMDS, h-BN, MoS2 and SiO2 were reported. The results show that the above configurations are suitable for designing MOSFETs with smaller drain induced barrier lowering (DIBL) and reduced threshold voltage. We noted that the above configurations are better than 2nm thick dielectric SiO2 based MOSFET with a channel length of 10nm.",
    "authors": [
      "J. Cyril Robinson Azariah",
      "U. Satheesh",
      "D. Devaprakasam"
    ],
    "publication_date": "2014-09-23T05:52:33Z",
    "arxiv_id": "http://arxiv.org/abs/1409.6419v1",
    "download_url": "https://arxiv.org/abs/1409.6419v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Decoupled molecular and inorganic framework dynamics in CH$_3$NH$_3$PbCl$_3$",
    "abstract": "The organic-inorganic lead halide perovskites are composed of organic molecules imbedded in an inorganic framework. The compounds with general formula CH$_{3}$NH$_{3}$PbX$_{3}$ (MAPbX$_{2}$) display large photovoltaic efficiencies for halogens $X$=Cl, Br, and I in a wide variety of sample geometries and preparation methods. The organic cation and inorganic framework are bound by hydrogen bonds that tether the molecules to the halide anions, and this has been suggested to be important to the optoelectronic properties. We have studied the effects of this bonding using time-of-flight neutron spectroscopy to measure the molecular dynamics in CH$_3$NH$_3$PbCl$_3$ (MAPbCl$_3$). Low-energy/high-resolution neutron backscattering reveals thermally-activated molecular dynamics with a characteristic temperature of $\\sim$ 95\\,K. At this same temperature, higher-energy neutron spectroscopy indicates the presence of an anomalous broadening in energy (reduced lifetime) associated with the molecular vibrations. By contrast, neutron powder diffraction shows that a spatially long-range structural phase transitions occurs at 178\\,K (cubic $\\rightarrow$ tetragonal) and 173\\,K (tetragonal $\\rightarrow$ orthorhombic). The large difference between these two temperature scales suggests that the molecular and inorganic lattice dynamics in MAPbCl$_3$ are actually decoupled. With the assumption that underlying physical mechanisms do not change with differing halogens in the organic-inorganic perovskites, we speculate that the energy scale most relevant to the photovoltaic properties of the lead-halogen perovskites is set by the lead-halide bond, not by the hydrogen bond.",
    "authors": [
      "M. Songvilay",
      "Zitian Wang",
      "V. Garcia Sakai",
      "T. Guidi",
      "M. Bari",
      "Z. -G. Ye",
      "Guangyong Xu",
      "K. L. Brown",
      "P. M. Gehring",
      "C. Stock"
    ],
    "publication_date": "2019-12-17T14:19:08Z",
    "arxiv_id": "http://arxiv.org/abs/1912.08029v2",
    "download_url": "https://arxiv.org/abs/1912.08029v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]