[
  {
    "title": "QCBench: Evaluating Large Language Models on Domain-Specific\n  Quantitative Chemistry",
    "abstract": "Quantitative chemistry is central to modern chemical research, yet the\nability of large language models (LLMs) to perform its rigorous, step-by-step\ncalculations remains underexplored. To fill this blank, we propose QCBench, a\nQuantitative Chemistry oriented benchmark comprising 350 computational\nchemistry problems across 7 chemistry subfields, which contains analytical\nchemistry, bio/organic chemistry, general chemistry, inorganic chemistry,\nphysical chemistry, polymer chemistry and quantum chemistry. To systematically\nevaluate the mathematical reasoning abilities of large language models (LLMs),\nthey are categorized into three tiers: easy, medium, and difficult. Each\nproblem, rooted in realistic chemical scenarios, is structured to prevent\nheuristic shortcuts and demand explicit numerical reasoning. QCBench enables\nfine-grained diagnosis of computational weaknesses, reveals model-specific\nlimitations across difficulty levels, and lays the groundwork for future\nimprovements such as domain-adaptive fine-tuning or multi-modal integration.\nEvaluations on 24 LLMs demonstrate a consistent performance degradation with\nincreasing task complexity, highlighting the current gap between language\nfluency and scientific computation accuracy. Code for QCBench is available at\nhttps://github.com/jiaqingxie/QCBench.",
    "authors": [
      "Jiaqing Xie",
      "Weida Wang",
      "Ben Gao",
      "Zhuo Yang",
      "Haiyuan Wan",
      "Shufei Zhang",
      "Tianfan Fu",
      "Yuqiang Li"
    ],
    "publication_date": "2025-08-03T08:55:42Z",
    "arxiv_id": "http://arxiv.org/abs/2508.01670v2",
    "download_url": "http://arxiv.org/abs/2508.01670v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Statistical Automatic Summarization in Organic Chemistry",
    "abstract": "We present an oriented numerical summarizer algorithm, applied to producing\nautomatic summaries of scientific documents in Organic Chemistry. We present\nits implementation named Yachs (Yet Another Chemistry Summarizer) that combines\na specific document pre-processing with a sentence scoring method relying on\nthe statistical properties of documents. We show that Yachs achieves the best\nresults among several other summarizers on a corpus of Organic Chemistry\narticles.",
    "authors": [
      "Florian Boudin",
      "Patricia Velazquez-Morales",
      "Juan-Manuel Torres-Moreno"
    ],
    "publication_date": "2009-05-07T20:21:45Z",
    "arxiv_id": "http://arxiv.org/abs/0905.1130v1",
    "download_url": "http://arxiv.org/abs/0905.1130v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic chemistry in a CO2 rich early Earth atmosphere",
    "abstract": "The emergence of life on the Earth has required a prior organic chemistry\nleading to the formation of prebiotic molecules. The origin and the evolution\nof the organic matter on the early Earth is not yet firmly understood. Several\nhypothesis, possibly complementary, are considered. They can be divided in two\ncategories: endogenous and exogenous sources. In this work we investigate the\ncontribution of a specific endogenous source: the organic chemistry occurring\nin the ionosphere of the early Earth where the significant VUV contribution of\nthe young Sun involved an efficient formation of reactive species. We address\nthe issue whether this chemistry can lead to the formation of complex organic\ncompounds with CO2 as only source of carbon in an early atmosphere made of N2,\nCO2 and H2, by mimicking experimentally this type of chemistry using a low\npressure plasma reactor. By analyzing the gaseous phase composition, we\nstrictly identified the formation of H2O, NH3, N2O and C2N2. The formation of a\nsolid organic phase is also observed, confirming the possibility to trigger\norganic chemistry in the upper atmosphere of the early Earth. The\nidentification of Nitrogen-bearing chemical functions in the solid highlights\nthe possibility for an efficient ionospheric chemistry to provide prebiotic\nmaterial on the early Earth.",
    "authors": [
      "Benjamin Fleury",
      "Nathalie Carrasco",
      "Maeva Millan",
      "Ludovic Vettier",
      "Cyril Szopa"
    ],
    "publication_date": "2018-05-18T17:57:42Z",
    "arxiv_id": "http://arxiv.org/abs/1805.07347v1",
    "download_url": "http://arxiv.org/abs/1805.07347v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Radiation Chemistry of Organic Liquids: Saturated Hydrocarbons",
    "abstract": "In this review (124 refs), several problems in radiolysis of saturated\nhydrocarbons are examined. Special attention is paid to the chemistry of\nradical cations, high-mobility holes, excited state and spur dynamics, magnetic\nfield and spin effects, and optically detected magnetic resonance spectroscopy.",
    "authors": [
      "Ilya A. Shkrob",
      "Myran C. Sauer, Jr.",
      "Alexander D. Trifunac"
    ],
    "publication_date": "2004-05-05T00:00:18Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0405014v1",
    "download_url": "http://arxiv.org/abs/physics/0405014v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Self-immolative chemistry in nanomedicine",
    "abstract": "Self-Immolative Chemistry is based on the cascade of disassembling reactions\ntriggered by the adequate stimulation and leading to the sequential release of\nthe smaller constituent elements. This review will focus on the possibilities\nthat this type of chemistry offers to nanomedicine research, which is an area\nwhere the stimuli responsive behavior is always targeted. There are some\nexamples on the use of self-immolative chemistry for prodrugs or nanoparticles\nfor drug delivery, but there is still an exciting land of opportunities waiting\nto be explored. This review aims at revising what has been done so far, but,\nmost importantly, it aims at inspiring new research of self-immolative\nchemistry on nanomedicine.",
    "authors": [
      "M Gisbert-Garzaran",
      "M Manzano",
      "M Vallet-Regi"
    ],
    "publication_date": "2021-04-22T09:15:17Z",
    "arxiv_id": "http://arxiv.org/abs/2104.10944v1",
    "download_url": "http://arxiv.org/abs/2104.10944v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effects of grain temperature distribution on organic protostellar\n  envelope chemistry",
    "abstract": "Context. Dust grains in circumstellar envelopes are likely to have a\nspread-out temperature distribution. Aims. To investigate how trends in\ntemperature distribution between small and large grains affect the hot corino\nchemistry of complex organic molecules (COMs) and warm carbon-chain chemistry\n(WCCC). Methods. A multi-grain multi-layer astrochemical code with an\nup-to-date treatment of surface chemistry was used with three grain temperature\ntrends: grain temperature proportional to grain radius to the power -1/6 (Model\nM-1/6), to 0 (M0), and to 1/6 (M1/6). The cases of hot corino and WCCC\nchemistry were investigated, for a total of six models. The essence of these\nchanges is for the main ice reservoir - small grains - having higher (M-1/6) or\nlower (M1/6) temperature than the surrounding gas. Results. The chemistry of\nCOMs shows better agreement with observations in models M-1/6 and M1/6 than in\nModel M0. Model M-1/6 shows best agreement for WCCC because earlier\nmass-evaporation of methane ice from small grains induces the WCCC phenomenon\nat lower temperatures. Conclusions. Models considering several grain\npopulations with different temperatures can more precisely reproduce\ncircumstellar chemistry.",
    "authors": [
      "Juris Kalvans",
      "Juris Freimanis"
    ],
    "publication_date": "2024-10-03T09:58:04Z",
    "arxiv_id": "http://arxiv.org/abs/2410.02346v2",
    "download_url": "http://arxiv.org/abs/2410.02346v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SynAsk: Unleashing the Power of Large Language Models in Organic\n  Synthesis",
    "abstract": "The field of natural language processing (NLP) has witnessed a transformative\nshift with the emergence of large language models (LLMs), revolutionizing\nvarious language tasks and applications, and the integration of LLM into\nspecialized domains enhances their capabilities for domain-specific\napplications. Notably, NLP has made significant strides in organic chemistry,\nparticularly in predicting synthetic tasks, paving the way for the development\nof LLMs tailored to the organic chemistry field. In this work, we introduce\nSynAsk, a comprehensive organic chemistry domain-specific LLM platform\ndeveloped by AIChemEco Inc. By finetuning an LLM with domain-specific data and\nintegrating it with a chain of thought approach, SynAsk seamlessly accesses our\nknowledge base and advanced chemistry tools in a question-and-answer format.\nThis includes functionalities such as a basic chemistry knowledge base,\nmolecular information retrieval, reaction performance prediction,\nretrosynthesis prediction, chemical literature acquisition, and more. This\nnovel methodology synergizes fine-tuning techniques with external resource\nintegration, resulting in an organic chemistry-specific model poised to\nfacilitate research and discovery in the field. Accessible via\nhttp://synask.aichemeco.com, SynAsk represents a significant advancement in\nleveraging NLP for synthetic applications.",
    "authors": [
      "Chonghuan Zhang",
      "Qianghua Lin",
      "Biwei Zhu",
      "Haopeng Yang",
      "Xiao Lian",
      "Hao Deng",
      "Jiajun Zheng",
      "Kuangbiao Liao"
    ],
    "publication_date": "2024-06-07T02:58:12Z",
    "arxiv_id": "http://arxiv.org/abs/2406.04593v2",
    "download_url": "http://arxiv.org/abs/2406.04593v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic compounds in metallic hydrogen",
    "abstract": "Metallic hydrogen is the most common condensed material in the universe,\ncomprising the centre of gas giant planets. However, experimental studies are\nextremely challenging, and most of our understanding of this material has been\nled by theory. Chemistry in this environment has not been probed\nexperimentally, so here we examine hydrocarbon chemistry in metallic hydrogen\nusing density functional theory calculations. We find that carbon and oxygen\nreact with metallic hydrogen to produce an entirely new type of hydrocarbon\nchemistry based on sixfold coordinated carbon with organic-style molecules CH6,\nC2H8, C3H10 OH3 NH4 and CH4OH. These are charged molecules stabilised by the\nmetallic environment. Their associated electric fields are screened, giving\noscillation in the surrounding electron and proton densities. In view of the\nexcess hydrogen we refer to them as hypermethane, hyperethane etc. The\nrelationship to traditional chemistry is that the metallic background acts as\nan electron donor and stabilizes negatively charged ions. This enables the\nformation of six covalent bonds per carbon atom, or three per oxygen atom. This\ndemonstrates that organic chemistry may take place in very different\nenvironments from those found on earth, and may be common throughout the\nuniverse.",
    "authors": [
      "Jakkapat Seeyangnok",
      "Udomsilp Pinsook",
      "Graeme John Ackland"
    ],
    "publication_date": "2024-10-29T06:15:46Z",
    "arxiv_id": "http://arxiv.org/abs/2410.21772v1",
    "download_url": "http://arxiv.org/abs/2410.21772v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Neural networks for the prediction organic chemistry reactions",
    "abstract": "Reaction prediction remains one of the major challenges for organic\nchemistry, and is a pre-requisite for efficient synthetic planning. It is\ndesirable to develop algorithms that, like humans, \"learn\" from being exposed\nto examples of the application of the rules of organic chemistry. We explore\nthe use of neural networks for predicting reaction types, using a new reaction\nfingerprinting method. We combine this predictor with SMARTS transformations to\nbuild a system which, given a set of reagents and re- actants, predicts the\nlikely products. We test this method on problems from a popular organic\nchemistry textbook.",
    "authors": [
      "Jennifer N. Wei",
      "David Duvenaud",
      "Alán Aspuru-Guzik"
    ],
    "publication_date": "2016-08-22T20:01:05Z",
    "arxiv_id": "http://arxiv.org/abs/1608.06296v2",
    "download_url": "http://arxiv.org/abs/1608.06296v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "CHEMSMART: Chemistry Simulation and Modeling Automation Toolkit for\n  High-Efficiency Computational Chemistry Workflows",
    "abstract": "CHEMSMART (Chemistry Simulation and Modeling Automation Toolkit) is an\nopen-source, Python-based framework designed to streamline quantum chemistry\nworkflows for homogeneous catalysis and molecular modeling. By integrating job\npreparation, submission, execution, results analysis, and visualization,\nCHEMSMART addresses the inefficiencies of manual workflow management in\ncomputational chemistry by ensuring seamless interoperability with quantum\nchemistry packages and cheminformatics platforms. Its modular architecture\nsupports automated job submission and execution tasks for geometry\noptimization, transition state searches, thermochemical analysis, and\nnon-covalent interaction plotting, while auxiliary scripts facilitate file\nconversion, data organization, and electronic structure analysis. Future\ndevelopments aim to expand compatibility with additional software, incorporate\nQM/MM and classical MD, and align with FAIR data principles for enhanced\nreproducibility and data reuse. Available on GitHub, CHEMSMART empowers\nresearchers with a robust, user-friendly platform for efficient and\nreproducible computational chemistry.",
    "authors": [
      "Xinglong Zhang",
      "Huiwen Tan",
      "Jingyi Liu",
      "Zihan Li",
      "Lewen Wang",
      "Benjamin W. J. Chen"
    ],
    "publication_date": "2025-08-27T16:50:38Z",
    "arxiv_id": "http://arxiv.org/abs/2508.20042v1",
    "download_url": "http://arxiv.org/abs/2508.20042v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Barry Carpenter. Pioneering Physical Organic Chemist, Teacher, Mentor\n  and Friend",
    "abstract": "This is the preface to a special issue of the Journal of Physical Organic\nChemistry dedicated to an outstanding physical organic chemist, mentor and\nfriend, Barry Carpenter on the occasion of his official retirement.",
    "authors": [
      "Stephanie R. Hare",
      "Allan R. Pinhas",
      "Julia Rehbein",
      "Dean J. Tantillo",
      "Stephen Wiggins"
    ],
    "publication_date": "2022-08-31T22:34:32Z",
    "arxiv_id": "http://arxiv.org/abs/2209.00145v1",
    "download_url": "http://arxiv.org/abs/2209.00145v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Information and Computation for Chemistry",
    "abstract": "The NSF Workshop in Quantum Information and Computation for Chemistry\nassembled experts from directly quantum-oriented fields such as algorithms,\nchemistry, machine learning, optics, simulation, and metrology, as well as\nexperts in related fields such as condensed matter physics, biochemistry,\nphysical chemistry, inorganic and organic chemistry, and spectroscopy. The goal\nof the workshop was to summarize recent progress in research at the interface\nof quantum information science and chemistry as well as to discuss the\npromising research challenges and opportunities in the field. Furthermore, the\nworkshop hoped to identify target areas where cross fertilization among these\nfields would result in the largest payoff for developments in theory,\nalgorithms, and experimental techniques. The ideas can be broadly categorized\nin two distinct areas of research that obviously have interactions and are not\nseparated cleanly. The first area is quantum information for chemistry, or how\nquantum information tools, both experimental and theoretical can aid in our\nunderstanding of a wide range of problems pertaining to chemistry. The second\narea is chemistry for quantum information, which aims to discuss the several\naspects where research in the chemical sciences can aid progress in quantum\ninformation science and technology. The results of the workshop are summarized\nin this report.",
    "authors": [
      "Jonathan Olson",
      "Yudong Cao",
      "Jonathan Romero",
      "Peter Johnson",
      "Pierre-Luc Dallaire-Demers",
      "Nicolas Sawaya",
      "Prineha Narang",
      "Ian Kivlichan",
      "Michael Wasielewski",
      "Alán Aspuru-Guzik"
    ],
    "publication_date": "2017-06-16T19:41:20Z",
    "arxiv_id": "http://arxiv.org/abs/1706.05413v2",
    "download_url": "http://arxiv.org/abs/1706.05413v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Influence of surface chemistry on the electronic properties of graphene\n  related carbon materials",
    "abstract": "A theoretical study on the influence of organic functional groups on the\nelectronic properties of graphene related carbon materials was carried out.\nHere we report, using density functional theory and tight-binding approach,\nthat the best candidates for conducting supramolecular devices can be obtained\nby engineering the surface chemistry and stacking conformation of these\nmaterials.",
    "authors": [
      "Arunabhirm Chutia",
      "Fanica Cimpoesu",
      "Hideyuki Tsuboi",
      "Akira Miyamotob"
    ],
    "publication_date": "2010-05-28T01:23:49Z",
    "arxiv_id": "http://arxiv.org/abs/1005.5199v1",
    "download_url": "http://arxiv.org/abs/1005.5199v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Islands of Electromagnetic Tranquility in Our Galactic core and Little\n  Red Dots that Shelter Molecules and Prebiotic Chemistry",
    "abstract": "Both the Galactic center and LRDs host million-solar-mass black holes within\ndense, cold reservoirs of molecular gas, and are electromagnetically tranquil.\nThese conditions enable complex molecular chemistry and may serve as natural\nlaboratories for prebiotic genetic evolution by allowing the synthesis of\norganic molecules essential for life.",
    "authors": [
      "Remo Ruffini",
      "Yu Wang"
    ],
    "publication_date": "2025-09-22T08:17:16Z",
    "arxiv_id": "http://arxiv.org/abs/2509.17484v1",
    "download_url": "http://arxiv.org/abs/2509.17484v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cavity Click Chemistry: Cavity-Catalyzed Azide-Alkyne Cycloaddition",
    "abstract": "Click chemistry, which refers to chemical reactions that are fast, selective,\nand with high product yields, has become a powerful approach in organic\nsynthesis and chemical biology. Due to the cytotoxicity of the transition\nmetals employed in click chemistry reactions, a search for novel metal-free\nalternatives continues. Herein we demonstrate that an optical cavity can be\nutilized as a metal-free alternative in click chemistry cycloaddition reaction\nbetween cyanoacetylene and formylazide using the quantum electrodynamics\ncoupled cluster (QED-CC) method. We show that by changing the molecular\norientation with respect to the polarization of the cavity mode(s), the\nreaction can be selectively catalyzed to form a major 1,4-disubstituted or\n1,5-disubstituted product. This work highlights that a cavity has the same\neffect on the investigated cycloaddition as the transition metal catalysts\ntraditionally employed in click chemistry reactions. We expect our findings to\nfurther stimulate research in cavity-assisted click chemistry reactions.",
    "authors": [
      "Fabijan Pavosevic",
      "Robert L. Smith",
      "Angel Rubio"
    ],
    "publication_date": "2023-05-16T14:48:07Z",
    "arxiv_id": "http://arxiv.org/abs/2305.09496v1",
    "download_url": "http://arxiv.org/abs/2305.09496v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Protoplanetary Disk Chemistry",
    "abstract": "Planets form in disks of gas and dust around young stars. The disk molecular\nreservoirs and their chemical evolution affect all aspects of planet formation,\nfrom the coagulation of dust grains into pebbles, to the elemental and\nmolecular compositions of the mature planet. Disk chemistry also enables unique\nprobes of disk structures and dynamics, including those directly linked to\nongoing planet formation. Here we review the protoplanetary disk chemistry of\nthe volatile elements HOCNSP, the associated observational and theoretical\nmethods, and the links between disk and planet chemical compositions. Three\ntakeaways from this review are: (1) The disk chemical composition, including\nthe organic reservoirs, is set by both inheritance and in situ chemistry. (2)\nDisk gas and solid O/C/N/H elemental ratios often deviate from stellar values\ndue to a combination of condensation of molecular carriers, chemistry, and\ndynamics. (3) Chemical, physical, and dynamical processes in disks are closely\nlinked, which complicates disk chemistry modeling, but these links also present\nan opportunity to develop chemical probes of different aspects of disk\nevolution and planet formation.",
    "authors": [
      "Karin I. Öberg",
      "Stefano Facchini",
      "Dana E. Anderson"
    ],
    "publication_date": "2023-09-11T09:45:12Z",
    "arxiv_id": "http://arxiv.org/abs/2309.05685v1",
    "download_url": "http://arxiv.org/abs/2309.05685v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Linking the Neural Machine Translation and the Prediction of Organic\n  Chemistry Reactions",
    "abstract": "Finding the main product of a chemical reaction is one of the important\nproblems of organic chemistry. This paper describes a method of applying a\nneural machine translation model to the prediction of organic chemical\nreactions. In order to translate 'reactants and reagents' to 'products', a\ngated recurrent unit based sequence-to-sequence model and a parser to generate\ninput tokens for model from reaction SMILES strings were built. Training sets\nare composed of reactions from the patent databases, and reactions manually\ngenerated applying the elementary reactions in an organic chemistry textbook of\nWade. The trained models were tested by examples and problems in the textbook.\nThe prediction process does not need manual encoding of rules (e.g., SMARTS\ntransformations) to predict products, hence it only needs sufficient training\nreaction sets to learn new types of reactions.",
    "authors": [
      "Juno Nam",
      "Jurae Kim"
    ],
    "publication_date": "2016-12-29T05:55:34Z",
    "arxiv_id": "http://arxiv.org/abs/1612.09529v1",
    "download_url": "http://arxiv.org/abs/1612.09529v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Carbon Cycle in the Atmosphere of Venus",
    "abstract": "The community commonly assumes that the Venusian atmosphere lacks organic\n(reduced) carbon. This is reflected in the literature, which now for almost a\nhalf a century does not mention organic carbon in connection with the Venus\natmosphere. This assumption persists despite the failure of models that exclude\norganic carbon to account for many well-established observed features of the\nVenusian atmosphere. Here is presented a model summarizing reactions that\nalmost certainly are occurring in the Venusian atmosphere. The model relies on\nreactions of reduced carbon compounds known to occur in concentrated sulfuric\nacid (CSA), under high pressure and high temperature, many used in industrial\nprocesses. Inclusion of this known chemistry into a model for the Venus\natmosphere accounts for several as yet unexplained observations. These include\nthe upper haze, the lower haze, and the \"mysterious\" UV-blue absorber. This\narticle also suggests, as a historical perspective, that a long-forgotten\ndispute is responsible for the persistent assumption of absence of interesting\norganic chemistry in the clouds of Venus.",
    "authors": [
      "Jan Spacek"
    ],
    "publication_date": "2021-08-04T21:13:58Z",
    "arxiv_id": "http://arxiv.org/abs/2108.02286v1",
    "download_url": "http://arxiv.org/abs/2108.02286v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient simulations of gas-grain chemistry in interstellar clouds",
    "abstract": "Chemical reactions on dust grains are of crucial importance in interstellar\nchemistry because they produce molecular hydrogen and various organic\nmolecules. Due to the submicron size of the grains and the low flux, the\nsurface populations of reactive species are small and strongly fluctuate. Under\nthese conditions rate equations fail and the master equation is needed for\nmodeling these reactions. However, the number of equations in the master\nequation grows exponentially with the number of reactive species, severely\nlimiting its feasibility. Here we present a method which dramatically reduces\nthe number of equations, thus enabling the incorporation of the master equation\nin models of interstellar chemistry.",
    "authors": [
      "Azi Lipshtat",
      "Ofer Biham"
    ],
    "publication_date": "2004-05-30T14:30:50Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0405609v1",
    "download_url": "http://arxiv.org/abs/astro-ph/0405609v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Recent advances in the computational chemistry of soft porous crystals",
    "abstract": "Here we highlight recent progress in the field of computational chemistry of\nnanoporous materials, focusing on methods and studies that address the\nextraordinary dynamic nature of these systems: the high flexibility of their\nframeworks, the large-scale structural changes upon external physical or\nchemical stimulation, and the presence of defects and disorder. The wide\nvariety of behavior demonstrated in soft porous crystals, including the topical\nclass of metal-organic frameworks, opens new challenges for computational\nchemistry methods at all scales.",
    "authors": [
      "Guillaume Fraux",
      "François-Xavier Coudert"
    ],
    "publication_date": "2018-06-28T14:45:45Z",
    "arxiv_id": "http://arxiv.org/abs/1806.11017v1",
    "download_url": "http://arxiv.org/abs/1806.11017v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Titan Atmospheric Chemistry Revealed by Low-temperature N2-CH4 Plasma\n  Discharge Experiments",
    "abstract": "Chemistry in Titan's N2-CH4 atmosphere produces complex organic aerosols. The\nchemical processes and the resulting organic compounds are still far from\nunderstood, although extensive observations, laboratory, and theoretical\nsimulations have greatly improved physical and chemical constraints on Titan's\natmosphere. Here, we conduct a series of Titan atmosphere simulation\nexperiments with N2-CH4 gas mixtures and investigate the effect of initial CH4\nratio, pressure, and flow rate on the production rates and composition of the\ngas and solid products at a Titan relevant temperature (100 K) for the first\ntime. We find that the production rate of the gas and solid products increases\nwith increasing CH4 ratio. The nitrogen-containing species have much higher\nyield than hydrocarbons in the gas products, and the N-to-C ratio of the solid\nproducts appears to be the highest compared to previous plasma simulations with\nthe same CH4 ratio. The greater degree of nitrogen incorporation in the low\ntemperature simulation experiments suggests temperature may play an important\nrole in nitrogen incorporation in Titan's cold atmosphere. We also find that H2\nis the dominant gas product and serves as an indicator of the production rate\nof new organic molecules in the experiment, and that CH2NH may greatly\ncontribute to the incorporation of both carbon and nitrogen into the solid\nparticles. The pressure and flow rate affect the amount of time of the gas\nmixture exposed to the energy source and therefore impact the N2-CH4 chemistry\ninitiated by the plasma discharge, emphasizing the influence of the energy flux\nin Titan atmospheric chemistry.",
    "authors": [
      "Chao He",
      "Joseph Serigano",
      "Sarah M. Horst",
      "Michael Radke",
      "Joshua A. Sebree"
    ],
    "publication_date": "2022-09-22T18:21:55Z",
    "arxiv_id": "http://arxiv.org/abs/2209.11264v1",
    "download_url": "http://arxiv.org/abs/2209.11264v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Unified Monte Carlo Treatment of Gas-Grain Chemistry for Large\n  Reaction Networks. II. A Multiphase Gas-Surface-Layered Bulk Model",
    "abstract": "The observed gas-phase molecular inventory of hot cores is believed to be\nsignificantly impacted by the products of chemistry in interstellar ices. In\nthis study, we report the construction of a full macroscopic Monte Carlo model\nof both the gas-phase chemistry and the chemistry occurring in the icy mantles\nof interstellar grains. Our model treats icy grain mantles in a layer-by-layer\nmanner, which incorporates laboratory data on ice desorption correctly. The ice\ntreatment includes a distinction between a reactive ice surface and an inert\nbulk. The treatment also distinguishes between zeroth and first order\ndesorption, and includes the entrapment of volatile species in more refractory\nice mantles. We apply the model to the investigation of the chemistry in hot\ncores, in which a thick ice mantle built up during the previous cold phase of\nprotostellar evolution undergoes surface reactions and is eventually\nevaporated. For the first time, the impact of a detailed multilayer approach to\ngrain mantle formation on the warm-up chemistry is explored. The use of a\nmultilayer ice structure has a mixed impact on the abundances of organic\nspecies formed during the warm-up phase. For example, the abundance of gaseous\nHCOOCH3 is lower in the multilayer model than in previous grain models that do\nnot distinguish between layers (so-called \"two phase\" models). Other gaseous\norganic species formed in the warm-up phase are affected slightly. Finally, we\nfind that the entrapment of volatile species in water ice can explain the\ntwo-jump behavior of H2CO previously found in observations of protostars.",
    "authors": [
      "A. I. Vasyunin",
      "E. Herbst"
    ],
    "publication_date": "2012-11-13T15:45:45Z",
    "arxiv_id": "http://arxiv.org/abs/1211.3025v2",
    "download_url": "http://arxiv.org/abs/1211.3025v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Computational Studies of Ruthenium and Iridium Complexes for Energy\n  Sciences and Progress on Greener Alternatives",
    "abstract": "The energy sciences attempt to meet the increasing world-wide need for\nenergy, as well as sustainability goals, by cleaner sources of energy, by new\nalternative sources of energy, and by more efficient uses of available energy.\nThese goals are entirely consistent with the principles of green chemistry.\nThis chapter concerns devices for creating electricity from light and for\ncreating light from electricity. The major focus is on the photoproperties of\nruthenium and iridium complexes, which have been proven to be a rich source of\ninspiration for conceiving photoactivated devices, including organic\nphotovoltaic (OPV) cells and organic light emitting diodes (OLEDs). The chapter\nreviews important already-in-use and potential applications of ruthenium and\niridium complex-based photodevices, including the underlying mechanism behind\ntheir functioning and its investigation through computational chemistry\napproaches. It highlights the role of the information obtained from\ncomputational studies for the design of more efficient photodevices. The final\npart complements the discourse with a review of the progress on greener\nalternatives for OPVs and OLEDs.",
    "authors": [
      "Denis Magero",
      "Tarek Mestiri",
      "Kamel Alimi",
      "Mark Earl Casida"
    ],
    "publication_date": "2020-03-08T17:19:14Z",
    "arxiv_id": "http://arxiv.org/abs/2004.03345v1",
    "download_url": "http://arxiv.org/abs/2004.03345v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Synthesis and conformational analysis of new derivatives of\n  7-chloro-1,3-dihydro-5-phenyl-2h-1,4-benzodiazepine-2-one",
    "abstract": "1,4-benzodiazepine-2-ones and their derivatives are prominent structures in\nmedicinal chemistry. These biomolecules have wide biological activities and\nposses therapeutic applications. In this works, we introduce new derivatives of\n1,4-benzodiazepine-2-ones which are synthesized using michael addition reaction\nof 7-chloro- 1,3-dihydro-5-phenyl-2H-1,4-benzodiazepine-2-ones with fumaric\nesters that matches with green chemistry protocols. The structures of all\nproducts are confirmed by FT-IR, 1H-NMR, 13C-NMR and MASS spectroscopy. Since\nthe stereochemistry of 1,4-benzo diazepine-2-ones is important, we study the\nmost stable conformer of one of the products as a model for conformational\nanalysis by hyper chem soft ware and semi empirical AM1 program. Also, using\nthe 1H-NMR spectrum, we investigate the produced diastereomers of one of\nproducts as a model.",
    "authors": [
      "Gholamhassan Imanzadeh",
      "Zahra ArastehFard",
      "Yaser Sadra"
    ],
    "publication_date": "2011-12-23T08:53:54Z",
    "arxiv_id": "http://arxiv.org/abs/1112.5533v2",
    "download_url": "http://arxiv.org/abs/1112.5533v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Large Language Models to Accelerate Organic Chemistry Synthesis",
    "abstract": "Chemical synthesis, as a foundational methodology in the creation of\ntransformative molecules, exerts substantial influence across diverse sectors\nfrom life sciences to materials and energy. Current chemical synthesis\npractices emphasize laborious and costly trial-and-error workflows,\nunderscoring the urgent need for advanced AI assistants. Nowadays, large\nlanguage models (LLMs), typified by GPT-4, have been introduced as an efficient\ntool to facilitate scientific research. Here, we present Chemma, a fully\nfine-tuned LLM with 1.28 million pairs of Q&A about reactions, as an assistant\nto accelerate organic chemistry synthesis. Chemma surpasses the best-known\nresults in multiple chemical tasks, e.g., single-step retrosynthesis and yield\nprediction, which highlights the potential of general AI for organic chemistry.\nVia predicting yields across the experimental reaction space, Chemma\nsignificantly improves the reaction exploration capability of Bayesian\noptimization. More importantly, integrated in an active learning framework,\nChemma exhibits advanced potential for autonomous experimental exploration and\noptimization in open reaction spaces. For an unreported Suzuki-Miyaura\ncross-coupling reaction of cyclic aminoboronates and aryl halides for the\nsynthesis of $\\alpha$-Aryl N-heterocycles, the human-AI collaboration\nsuccessfully explored suitable ligand and solvent (1,4-dioxane) within only 15\nruns, achieving an isolated yield of 67%. These results reveal that, without\nquantum-chemical calculations, Chemma can comprehend and extract chemical\ninsights from reaction data, in a manner akin to human experts. This work opens\navenues for accelerating organic chemistry synthesis with adapted large\nlanguage models.",
    "authors": [
      "Yu Zhang",
      "Yang Han",
      "Shuai Chen",
      "Ruijie Yu",
      "Xin Zhao",
      "Xianbin Liu",
      "Kaipeng Zeng",
      "Mengdi Yu",
      "Jidong Tian",
      "Feng Zhu",
      "Xiaokang Yang",
      "Yaohui Jin",
      "Yanyan Xu"
    ],
    "publication_date": "2025-04-25T13:30:07Z",
    "arxiv_id": "http://arxiv.org/abs/2504.18340v1",
    "download_url": "http://arxiv.org/abs/2504.18340v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The nanoscale molecular chemistry of outer solar system organic matter\n  in asteroid Ryugu",
    "abstract": "The analysis of biorelevant molecules in returned mission samples such as\nfrom the carbonaceous asteroid (162173) Ryugu is key to unravelling the role of\nextraterrestrial organics in the evolution of life. Coordinated analyses using\nminimally destructive techniques at the finest length-scales on pristine\nsamples are particularly important. Here, we identify the chemical signature of\nunique globular and nitrogen-containing diffuse organic matter in asteroid\nRyugu and map the distribution of these biorelevant molecules with\nunprecedented detail. Using a novel electron-microscopy-based combination of\nvibrational and core-level spectroscopy, we disentangle the chemistry and\nnanoscale petrography of these organics. We show that some of these organics\ncontain soluble and highly aliphatic components as well as NHx functional\ngroups, that must have formed in outer solar nebula environments before parent\nbody incorporation. These novel coordinated analyses will open up new avenues\nof research on these types of precious and rare asteroidal dust samples.",
    "authors": [
      "Christian Vollmer",
      "Demie Kepaptsoglou",
      "Johannes Lier",
      "Aleksander B. Mosberg",
      "Quentin M. Ramasse"
    ],
    "publication_date": "2025-06-20T07:30:12Z",
    "arxiv_id": "http://arxiv.org/abs/2506.16798v1",
    "download_url": "http://arxiv.org/abs/2506.16798v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The cometary composition of a protoplanetary disk as revealed by complex\n  cyanides",
    "abstract": "Observations of comets and asteroids show that the Solar Nebula that spawned\nour planetary system was rich in water and organic molecules. Bombardment\nbrought these organics to the young Earth's surface, seeding its early\nchemistry. Unlike asteroids, comets preserve a nearly pristine record of the\nSolar Nebula composition. The presence of cyanides in comets, including 0.01%\nof methyl cyanide (CH3CN) with respect to water, is of special interest because\nof the importance of C-N bonds for abiotic amino acid synthesis. Comet-like\ncompositions of simple and complex volatiles are found in protostars, and can\nbe readily explained by a combination of gas-phase chemistry to form e.g. HCN\nand an active ice-phase chemistry on grain surfaces that advances\ncomplexity[3]. Simple volatiles, including water and HCN, have been detected\npreviously in Solar Nebula analogues - protoplanetary disks around young stars\n- indicating that they survive disk formation or are reformed in situ. It has\nbeen hitherto unclear whether the same holds for more complex organic molecules\noutside of the Solar Nebula, since recent observations show a dramatic change\nin the chemistry at the boundary between nascent envelopes and young disks due\nto accretion shocks[8]. Here we report the detection of CH3CN (and HCN and\nHC3N) in the protoplanetary disk around the young star MWC 480. We find\nabundance ratios of these N-bearing organics in the gas-phase similar to\ncomets, which suggests an even higher relative abundance of complex cyanides in\nthe disk ice. This implies that complex organics accompany simpler volatiles in\nprotoplanetary disks, and that the rich organic chemistry of the Solar Nebula\nwas not unique.",
    "authors": [
      "Karin I. Oberg",
      "Viviana V. Guzman",
      "Kenji Furuya",
      "Chunhua Qi",
      "Yuri Aikawa",
      "Sean M. Andrews",
      "Ryan Loomis",
      "David J. Wilner"
    ],
    "publication_date": "2015-05-23T15:54:45Z",
    "arxiv_id": "http://arxiv.org/abs/1505.06347v1",
    "download_url": "http://arxiv.org/abs/1505.06347v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Lunn-Senior's Mathematical Model of Isomerism in Organic Chemistry.\n  Part II",
    "abstract": "The second part of this paper is devoted to the following important question\nin organic chemistry: given two isomers of a molecule, how to identify them\nwith their structural formulae using only type properties of that molecule? A\nclassical answer of this question is given for benzene by the identification of\nits di-substituted (para, ortho, and meta), and tri-substituted (asymmetric,\nvicinal, and symmetric) derivatives via the Korner substitution reactions among\nthem. Here we develop a machinery within the framework of the Lunn-Senior's\nmathematical model of isomerism in organic chemistry, which, in principle,\nanswers this question. In particular, it is shown that the members of a chiral\npair cannot be distinguished via substitution reactions. The examples of\nethene, benzene, and cyclopropane are discussed.",
    "authors": [
      "Valentin Vankov Iliev"
    ],
    "publication_date": "2003-06-30T16:21:34Z",
    "arxiv_id": "http://arxiv.org/abs/math/0306407v1",
    "download_url": "http://arxiv.org/abs/math/0306407v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Photochemistry and astrochemistry: photochemical pathways to\n  interstellar complex organic molecules",
    "abstract": "The interstellar medium is characterized by a rich and diverse chemistry.\nMany of its complex organic molecules are proposed to form through radical\nchemistry in icy grain mantles. Radicals form readily when interstellar ices\n(composed of water and other volatiles) are exposed to UV photons and other\nsources of dissociative radiation, and, if sufficiently mobile, the radicals\ncan react to form larger, more complex molecules. The resulting complex organic\nmolecules (COMs) accompany star and planet formation, and may eventually seed\nthe origins of life on nascent planets. Experiments of increasing\nsophistication have demonstrated that known interstellar COMs as well as the\nprebiotically interesting amino acids can form through ice photochemistry. We\nreview these experiments and discuss the qualitative and quantitative kinetic\nand mechanistic constraints they have provided. We finally compare the effects\nof UV radiation with those of three other potential sources of radical\nproduction and chemistry in interstellar ices: electrons, ions and X-rays.",
    "authors": [
      "Karin I. Oberg"
    ],
    "publication_date": "2016-09-11T03:16:54Z",
    "arxiv_id": "http://arxiv.org/abs/1609.03112v1",
    "download_url": "http://arxiv.org/abs/1609.03112v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Transforming organic chemistry research paradigms: moving from manual\n  efforts to the intersection of automation and artificial intelligence",
    "abstract": "Organic chemistry is undergoing a major paradigm shift, moving from a\nlabor-intensive approach to a new era dominated by automation and artificial\nintelligence (AI). This transformative shift is being driven by technological\nadvances, the ever-increasing demand for greater research efficiency and\naccuracy, and the burgeoning growth of interdisciplinary research. AI models,\nsupported by computational power and algorithms, are drastically reshaping\nsynthetic planning and introducing groundbreaking ways to tackle complex\nmolecular synthesis. In addition, autonomous robotic systems are rapidly\naccelerating the pace of discovery by performing tedious tasks with\nunprecedented speed and precision. This article examines the multiple\nopportunities and challenges presented by this paradigm shift and explores its\nfar-reaching implications. It provides valuable insights into the future\ntrajectory of organic chemistry research, which is increasingly defined by the\nsynergistic interaction of automation and AI.",
    "authors": [
      "Chengchun Liu",
      "Yuntian Chen",
      "Fanyang Mo"
    ],
    "publication_date": "2023-11-26T09:46:03Z",
    "arxiv_id": "http://arxiv.org/abs/2312.00808v1",
    "download_url": "http://arxiv.org/abs/2312.00808v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An Open Quantum Chemistry Property Database of 120 Kilo Molecules with\n  20 Million Conformers",
    "abstract": "Artificial intelligence is revolutionizing computational chemistry, bringing\nunprecedented innovation and efficiency to the field. To further advance\nresearch and expedite progress, we introduce the Quantum Open Organic Molecular\n(QO2Mol) database -- a large-scale quantum chemistry dataset designed for\nprofessional and transformative research in organic molecular sciences under an\nopen-source license. The database comprises 120,000 organic molecules and\napproximately 20 million conformers, encompassing 10 different elements (C, H,\nO, N, S, P, F, Cl, Br, I), with heavy atom counts exceeding 40. Utilizing the\nhigh-precision B3LYP/def2-SVP quantum mechanical level, each conformation was\nmeticulously computed for quantum mechanical properties, including potential\nenergy and forces. These molecules are derived from fragments of compounds in\nChEMBL, ensuring their structural relevance to real-world compounds. Its\nextensive coverage of molecular structures and diverse elemental composition\nenables comprehensive studies of structure-property relationships, enhancing\nthe accuracy and applicability of machine learning models in predicting\nmolecular behaviors. The QO2Mol database and benchmark codes are available at\nhttps://github.com/saiscn/QO2Mol/ .",
    "authors": [
      "Weiqi Liu",
      "Xi Ai",
      "Zhijian Zhou",
      "Chao Qu",
      "Junyi An",
      "Zhipeng Zhou",
      "Yuan Cheng",
      "Yinghui Xu",
      "Fenglei Cao",
      "Alan Qi"
    ],
    "publication_date": "2024-10-25T06:01:25Z",
    "arxiv_id": "http://arxiv.org/abs/2410.19316v1",
    "download_url": "http://arxiv.org/abs/2410.19316v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ChemCloud: Chemical e-Science Information Cloud",
    "abstract": "Our Chemical e-Science Information Cloud (ChemCloud) - a Semantic Web based\neScience infrastructure - integrates and automates a multitude of databases,\ntools and services in the domain of chemistry, pharmacy and bio-chemistry\navailable at the Fachinformationszentrum Chemie (FIZ Chemie), at the Freie\nUniversitaet Berlin (FUB), and on the public Web. Based on the approach of the\nW3C Linked Open Data initiative and the W3C Semantic Web technologies for\nontologies and rules it semantically links and integrates knowledge from our\nW3C HCLS knowledge base hosted at the FUB, our multi-domain knowledge base\nDBpedia (Deutschland) implemented at FUB, which is extracted from Wikipedia\n(De) providing a public semantic resource for chemistry, and our\nwell-established databases at FIZ Chemie such as ChemInform for organic\nreaction data, InfoTherm the leading source for thermophysical data, Chemisches\nZentralblatt, the complete chemistry knowledge from 1830 to 1969, and\nChemgaPedia the largest and most frequented e-Learning platform for Chemistry\nand related sciences in German language.",
    "authors": [
      "Alexandru Todor",
      "Adrian Paschke",
      "Stephan Heineke"
    ],
    "publication_date": "2010-12-07T23:52:54Z",
    "arxiv_id": "http://arxiv.org/abs/1012.1645v1",
    "download_url": "http://arxiv.org/abs/1012.1645v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "QCDGE database, Quantum Chemistry Database with Ground- and\n  Excited-state Properties of 450 Kilo Molecules",
    "abstract": "Due to rapid advancements in deep learning techniques, the demand for\nlarge-volume high-quality databases grows significantly in chemical research.\nWe developed a quantum-chemistry database that includes 443,106 small organic\nmolecules with sizes up to 10 heavy atoms including carbon (C), nitrogen (N),\noxygen (O), and fluorine (F). Ground-state geometry optimizations and frequency\ncalculations of all compounds were performed at the B3LYP/6-31G* level with the\nBJD3 dispersion correction, while the excited-state single-point calculations\nwere conducted at the $\\omega$B97X-D/6-31G* level. Totally twenty seven\nmolecular properties, such as geometric, thermodynamic, electronic and\nenergetic properties, were gathered from these calculations. Meanwhile, we also\nestablished a comprehensive protocol for the construction of a high-volume\nquantum-chemistry database. Our QCDGE (Quantum Chemistry Database with Ground-\nand Excited-State Properties) database contains a substantial volume of data,\nexhibits high chemical diversity, and most importantly includes excited-state\ninformation. This database, along with its construction protocol, is expected\nto have a significant impact on the broad applications of machine learning\nstudies across different fields of chemistry, especially in the area of\nexcited-state research.",
    "authors": [
      "Yifei Zhu",
      "Mengge Li",
      "Chao Xu",
      "Zhenggang Lan"
    ],
    "publication_date": "2024-06-04T14:18:01Z",
    "arxiv_id": "http://arxiv.org/abs/2406.02341v1",
    "download_url": "http://arxiv.org/abs/2406.02341v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cross Learning between Electronic Structure Theories for Unifying\n  Molecular, Surface, and Inorganic Crystal Foundation Force Fields",
    "abstract": "Creating a single unified interatomic potential capable of attaining ab\ninitio accuracy across all chemistry remains a long-standing challenge in\ncomputational chemistry and materials science. This work introduces a training\nprotocol for foundation machine-learning interatomic potentials (MLIPs) that\nbridge molecular, surface, and materials chemistry through cross-domain\nlearning. First, we introduce enhancements to the MACE architecture that\nimprove its performance on chemically diverse databases by increasing weight\nsharing across chemical elements and introducing non-linear factors into the\ntensor decomposition of the product basis. Second, we develop a multi-head\nreplay post-training methodology that enables efficient knowledge transfer\nacross diverse chemical domains. By fine-tuning on datasets at different levels\nof electronic structure theory, including inorganic crystals, molecular\nsystems, surface chemistry, and reactive organic chemistry, we demonstrate that\na single unified model achieves state-of-the-art performance across several\nchemical domains. Comprehensive benchmarking reveals superior cross-domain\ntransferability compared with existing specialised and multi-task models, with\nnotable improvements in molecular and surface properties while maintaining\nstate-of-the-art performance in materials-property prediction.",
    "authors": [
      "Ilyes Batatia",
      "Chen Lin",
      "Joseph Hart",
      "Elliott Kasoar",
      "Alin M. Elena",
      "Sam Walton Norwood",
      "Thomas Wolf",
      "Gábor Csányi"
    ],
    "publication_date": "2025-10-29T10:53:03Z",
    "arxiv_id": "http://arxiv.org/abs/2510.25380v1",
    "download_url": "http://arxiv.org/abs/2510.25380v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring the Origins of Carbon in Terrestrial Worlds",
    "abstract": "Given the central role of carbon in the chemistry of life, it is a\nfundamental question as to how carbon is supplied to the Earth, in what form\nand when. We provide an accounting of carbon found in solar system bodies, in\nparticular a comparison between the organic content of meteorites and that in\nidentified organics in the dense interstellar medium (ISM). Based on this\naccounting identified organics created by the chemistry of star formation could\ncontain at most ~15% of the organic carbon content in primitive meteorites and\nsignificantly less for cometary organics, which represent the putative\ncontributors to starting materials for the Earth. In the ISM ~30% of the\nelemental carbon is found in CO, either in the gas or ices, with a typical\nabundance of ~10^-4 (relative to H2). Recent observations of the TW Hya disk\nfind that the gas phase abundance of CO is reduced by an order of magnitude\ncompared to this value. We explore a solution where the volatile CO is\ndestroyed via a gas phase processes, providing an additional source of carbon\nfor organic material to be incorporated into planetesimals and cometesimals.\nThis chemical processing mechanism requires warm grains (> 20 K), partially\nionized gas, and sufficiently small <10 micron grains, i.e. a larger total\ngrain surface area, such that freeze-out is efficient. Under these conditions\nstatic (non-turbulent) chemical models predict that a large fraction of the\ncarbon nominally sequestered in CO can be the source of carbon for a wide\nvariety of organics that are present as ice coatings on the surfaces of warm\npre-planetesimal dust grains.",
    "authors": [
      "Edwin A. Bergin",
      "L. Ilsedore Cleeves",
      "Nathan Crockett",
      "Geoffrey Blake"
    ],
    "publication_date": "2014-05-28T21:01:29Z",
    "arxiv_id": "http://arxiv.org/abs/1405.7394v1",
    "download_url": "http://arxiv.org/abs/1405.7394v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "UV photolysis, organic molecules in young disks, and the origin of\n  meteoritic amino acids",
    "abstract": "The origin of complex organic molecules such as amino acids and their\nprecursors found in meteorites and comets is unknown. Previous studies have\naccounted for the complex organic inventory of the Solar System by aqueous\nchemistry on warm meteoritic parent bodies, or by accretion of organics formed\nin the interstellar medium. This paper proposes a third possibility: that\ncomplex organics were created in situ by ultraviolet light from nearby O/B\nstars irradiating ices already in the Sun's protoplanetary disk. If the Sun was\nborn in a dense cluster near UV-bright stars, the flux hitting the disk from\nexternal stars could be many orders of magnitude higher than that from the Sun\nalone. Such photolysis of ices in the laboratory can rapidly produce amino acid\nprecursors and other complex organic molecules. I present a simple model\ncoupling grain growth and UV exposure in a young circumstellar disk. It is\nshown that the production may be sufficient to create the Solar System's entire\ncomplex organic inventory within 10^6 years. Subsequent aqueous alteration on\nmeteoritic parent bodies is not ruled out.",
    "authors": [
      "Henry Throop"
    ],
    "publication_date": "2011-12-14T03:30:36Z",
    "arxiv_id": "http://arxiv.org/abs/1112.3107v1",
    "download_url": "http://arxiv.org/abs/1112.3107v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dust evolution, a global view: III. Core/mantle grains, organic\n  nano-globules, comets and surface chemistry",
    "abstract": "Within the framework of The Heterogeneous dust Evolution Model at the IaS\n(THEMIS) this work investigates in detail the surface processes and chemistry\nrelating to core/mantle interstellar and cometary grain structures and its\ninfluence on the nature of these fascinating particles. It appears that a\nrealistic consideration of the nature and chemical reactivity of interstellar\ngrain surfaces could self-consistently and within a coherent framework explain:\nthe anomalous oxygen depletion, the nature of the CO dark gas, the formation of\n'polar ice' mantles, the red wing on the 3 um water ice band, the basis for the\nO-rich chemistry observed in hot cores, the origin of organic nano-globules and\nthe \\sim 3.2 um 'carbonyl' absorption band observed in comet reflectance\nspectra. It is proposed that the reaction of gas phase species with\ncarbonaceous a- C(:H) grain surfaces in the interstellar medium, in particular\nthe incorporation of atomic oxygen into grain surfaces in epoxide functional\ngroups, is the key to explaining these observations. Thus, the chemistry of\ncosmic dust is much more intimately related with that of the interstellar gas\nthan has previously been considered. The current models for interstellar gas\nand dust chemistry will therefore most likely need to be fundamentally modified\nto include these new grain surface processes.",
    "authors": [
      "A. P. Jones"
    ],
    "publication_date": "2021-11-08T14:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/2111.04516v1",
    "download_url": "http://arxiv.org/abs/2111.04516v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A new study of the chemical structure of the Horsehead nebula: the\n  influence of grain-surface chemistry",
    "abstract": "A wide variety of molecules have recently been detected in the Horsehead\nnebula photodissociation region (PDR) suggesting that: (i) gas-phase and grain\nchemistries should both contribute to the formation of organic molecules, and\n(ii) far-ultraviolet (FUV) photodesorption may explain the release into the gas\nphase of grain surface species. In order to tackle these specific problems and\nmore generally in order to better constrain the chemical structure of these\ntypes of environments we present a study of the Horsehead nebula gas-grain\nchemistry. To do so we used the 1D astrochemical gas-grain code Nautilus with\nan appropriate physical structure computed with the Meudon PDR Code and\ncompared our modeled outcomes with published observations and with previously\nmodeled results when available. The use of a large set of chemical reactions\ncoupled with the time-dependent code Nautilus allows us to reproduce most of\nthe observations well, including those of the first detections in a PDR of the\norganic molecules HCOOH, CH2CO, CH3CHO and CH3CCH, which are mostly associated\nwith hot cores. We also provide some abundance predictions for other molecules\nof interest. Understanding the chemistry behind the detection of these organic\nmolecules is crucial to better constrain the environments these molecules can\nprobe.",
    "authors": [
      "Romane Le Gal",
      "Eric Herbst",
      "Gwenaelle Dufour",
      "Pierre Gratier",
      "Maxime Ruaud",
      "Thomas Vidal",
      "Valentine Wakelam"
    ],
    "publication_date": "2017-06-01T18:46:32Z",
    "arxiv_id": "http://arxiv.org/abs/1706.00454v2",
    "download_url": "http://arxiv.org/abs/1706.00454v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Charge migration in organic materials: Can propagating charges affect\n  the key physical quantities controlling their motion?",
    "abstract": "Charge migration is a ubiquitous phenomenon with profound implications\nthroughout many areas of chemistry, physics, biology and materials science. The\nlong-term vision of designing functional materials with tailored molecular\nscale properties has triggered an increasing quest to identify prototypical\nsystems where truly molecular conduction pathways play a fundamental role. Such\npathways can be formed due to the molecular organization of various organic\nmaterials and are widely used to discuss electronic properties at the nanometer\nscale. Here, we present a computational methodology to study charge propagation\nin organic molecular stacks at nano and sub-nanoscales and exploit this\nmethodology to demonstrate that moving charge carriers strongly affect the\nvalues of the physical quantities controlling their motion. The approach is\nalso expected to find broad application in the field of charge migration in\nsoft matter systems.",
    "authors": [
      "C. Gollub",
      "S. Avdoshenko",
      "R. Gutierrez",
      "Y. Berlin",
      "G. Cuniberti"
    ],
    "publication_date": "2012-01-23T09:16:51Z",
    "arxiv_id": "http://arxiv.org/abs/1201.4652v1",
    "download_url": "http://arxiv.org/abs/1201.4652v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Iron-based trinuclear metal-organic nanostructures on a surface with\n  local charge accumulation",
    "abstract": "Coordination chemistry relies on harnessing active metal sites within organic\nmatrices. Polynuclear complexes - consisting of organic ligands binding to\nclusters of several metal atoms are of particular interest, owing to their\nelectronic/magnetic properties and potential for functional reactivity\npathways. However, their synthesis remains challenging; only a limited number\nof geometries and configurations have been achieved. Here, we synthesise - via\nsupramolecular chemistry on a noble metal surface - one-dimensional\nmetal-organic nanostructures composed of terpyridine (tpy)-based molecules\ncoordinated with well-defined polynuclear iron clusters. By a combination of\nlow-temperature scanning probe microscopy techniques and density functional\ntheory, we demonstrate that the coordination motif consists of coplanar tpy's\nlinked via a linear tri-iron node in a mixed (positive) valence, metal-metal\nbond configuration. This unusual linkage is stabilized by a local accumulation\nof electrons at the interface between cations, ligand and surface. The latter,\nenabled by the bottom-up on-surface synthesis, hints at a chemically active\nmetal centre, and opens the door to the engineering of nanomaterials with novel\ncatalytic and magnetic functionalities.",
    "authors": [
      "Cornelius Krull",
      "Marina Castelli",
      "Prokop Hapala",
      "Dhaneesh Kumar",
      "Pavel Jelinek",
      "Agustin Schiffrin"
    ],
    "publication_date": "2018-02-26T03:17:00Z",
    "arxiv_id": "http://arxiv.org/abs/1802.09146v1",
    "download_url": "http://arxiv.org/abs/1802.09146v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Rapid Computational Optimization of Molecular Properties using Genetic\n  Algorithms: Searching Across Millions of Compounds for Organic Photovoltaic\n  Materials",
    "abstract": "Conjugated organic molecules represent an important area of materials\nchemistry for both fundamental scientific exploration and technological\napplications. Using a genetic algorithm to computationally screen up to ~25-50\nmillion molecules for organic photovoltaic properties, we find that our methods\nfind top monomers 6,000-8,000 times faster than brute force search. By testing\nmultiple runs and establishing convergence criteria, we show the computational\nscaling with search space size, common molecular motifs, and discuss the\nreliability to choose the same molecules independent of initial data set size.\nWe outline remaining areas of difficulty in growing to larger search spaces,\npotential solutions, and filtering criteria for potential organic photovoltaic\nmaterials. Efficient genetic algorithm searches promise to address a wide range\nof property-driven inverse design problems in chemistry.",
    "authors": [
      "Ilana Y. Kanal",
      "Geoffrey R. Hutchison"
    ],
    "publication_date": "2017-07-10T17:06:32Z",
    "arxiv_id": "http://arxiv.org/abs/1707.02949v2",
    "download_url": "http://arxiv.org/abs/1707.02949v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Advances in Prebiotic Chemistry: the potential of Analog Computing and\n  Navier-Stokes Nernst-Planck (NPNS) Modeling in Organic Electronics\n  Technologies (OECTs)",
    "abstract": "In this article, we attempt to make a conceptual bridge between the research\nin biology, pre-biotic chemistry, biomimetics, and the tools used in organic\nbioelectronics in terms of materials and devices. The goal is discussing how\nmaterials and devices of organic bioelectronics can be exploited and used at\nthe interface with biology, but also how, and at what extent, they can be\nadapted to mimicking nature-inspired properties, herein including\nunconventional computing strategies. The idea is to provide new hints and solid\nhypotheses for designing niche experiments that could benefit from a proper\ninteraction, even at a basic communicative level, between materials science and\nbiotechnology. The finale long-term vision goal being the vision of collecting\nexperimental data that may help to made a step forward toward the\nimplementation of the transition from inanimate objects to animated beings. The\nmathematical model canonically considered in this work is the\nNavier-Stokes-Nernst-Planck (NPNS) Model which is often used to model a charged\ncontinuum system such as the organic electrochemical transistors.",
    "authors": [
      "Giuseppe De Giorgio",
      "Pasquale D'Angelo",
      "Giuseppe Tarabella",
      "Saksham Sharma"
    ],
    "publication_date": "2025-04-15T17:17:45Z",
    "arxiv_id": "http://arxiv.org/abs/2504.11401v1",
    "download_url": "http://arxiv.org/abs/2504.11401v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Network Species Model",
    "abstract": "We propose a theoretical model for species that is focused on intrinsic\norganization and processes. Specifically, we regard species to be networks of\norganisms integrated by reproductive mechanisms (e.g., conjugation, meiosis,\nsyngamy) regardless of degree or type of divergence, longevity, size, fate, or\nother criteria. Ramifications of viewing units of diversity in terms of\ninherent organization include the following: (1) Species, subspecies,\npopulation, deme, Evolutionary Significant Unit (ESU), and related terms cannot\nbe distinguished on the basis of inherent organization and, consequently, do\nnot reflect a hierarchy of organization. In other words, only one model is\nrequired to explain systems composed of organisms. (2) Temporarily isolated\nnetworks of organisms possess the same intrinsic organization and, therefore,\nthe same ontological status as permanently isolated systems. (3) Units of\ndiversity are recognized regardless of kind or degree of divergence. (4) Fate\nis not an intrinsic property of systems and is an inappropriate consideration\nin species models. (5) Networks are recognized at the moment they become\nisolated; therefore, resultant classifications reflect the causal events that\ngenerate diversity (e.g., vicariance) rather than post-vicariance events such\nas character evolution and, consequently, have greater historical relevance\n(e.g., biogeography). (6) Because the proposed model is based on organization,\nit is similar to models in other disciplines (e.g., astronomy, chemistry, and\nphysics) and should lead to greater unification of thought within biology and\namong scientific disciplines. (7) Lineage concepts are problematic because they\ndo not describe a unique level of biological organization and because\nancestor-descendant relationships are not unique to living systems.",
    "authors": [
      "David Kizirian",
      "Maureen A. Donnelly"
    ],
    "publication_date": "2008-08-11T21:52:34Z",
    "arxiv_id": "http://arxiv.org/abs/0808.1590v1",
    "download_url": "http://arxiv.org/abs/0808.1590v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ChemCrow: Augmenting large-language models with chemistry tools",
    "abstract": "Over the last decades, excellent computational chemistry tools have been\ndeveloped. Integrating them into a single platform with enhanced accessibility\ncould help reaching their full potential by overcoming steep learning curves.\nRecently, large-language models (LLMs) have shown strong performance in tasks\nacross domains, but struggle with chemistry-related problems. Moreover, these\nmodels lack access to external knowledge sources, limiting their usefulness in\nscientific applications. In this study, we introduce ChemCrow, an LLM chemistry\nagent designed to accomplish tasks across organic synthesis, drug discovery,\nand materials design. By integrating 18 expert-designed tools, ChemCrow\naugments the LLM performance in chemistry, and new capabilities emerge. Our\nagent autonomously planned and executed the syntheses of an insect repellent,\nthree organocatalysts, and guided the discovery of a novel chromophore. Our\nevaluation, including both LLM and expert assessments, demonstrates ChemCrow's\neffectiveness in automating a diverse set of chemical tasks. Surprisingly, we\nfind that GPT-4 as an evaluator cannot distinguish between clearly wrong GPT-4\ncompletions and Chemcrow's performance. Our work not only aids expert chemists\nand lowers barriers for non-experts, but also fosters scientific advancement by\nbridging the gap between experimental and computational chemistry.",
    "authors": [
      "Andres M Bran",
      "Sam Cox",
      "Oliver Schilter",
      "Carlo Baldassari",
      "Andrew D White",
      "Philippe Schwaller"
    ],
    "publication_date": "2023-04-11T17:41:13Z",
    "arxiv_id": "http://arxiv.org/abs/2304.05376v5",
    "download_url": "http://arxiv.org/abs/2304.05376v5",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modelling predicts a molecule-rich disk around the AGB star L2 Puppis",
    "abstract": "The nearby oxygen-rich AGB star L2 Pup hosts a well-studied nearly edge-on\ndisk. To date, disks around AGB stars have not been chemically studied in\ndetail. By combining a parameterisation commonly used for protoplanetary disks\nand archival ALMA observations, we retrieved an updated density and temperature\nstructure of this disk. This physical model was then used as input to the first\nchemical model of an AGB disk. The model shows that the physical structure of\nthe disk has a large impact on its chemistry, with certain species showing\nlarge changes in column density relative to a radial outflow, indicating that\nchemistry could be used as a tracer of disks that cannot be directly imaged.\nDespite its oxygen-rich nature, the daughter species formed within the disk are\nsurprisingly carbon-rich. Two chemical regimes can be distinguished: cosmic-ray\ninduced chemistry in the midplane and photochemistry induced by the\ninterstellar radiation field in the outer regions. Certain complex organic\nmolecules are formed in the midplane. This occurs via gas-phase chemistry only,\nas the disk is too warm for dust-gas chemistry. The photochemistry in the outer\nregions leads to the efficient formation of (long) carbon-chains. The\npredictions of the model allow us to tentatively put the disk's age $\\lesssim\n10^5$ yr. Additional observations are necessary to better constrain the\nphysical structure of L2 Pup's disk and are essential to test the predictions\nmade by the chemical model. Our exploratory work paves the way for a more\ngeneral study of the chemistry of AGB disks.",
    "authors": [
      "M. Van de Sande",
      "C. Walsh",
      "T. Danilovich",
      "F. De Ceuster",
      "T. Ceulemans"
    ],
    "publication_date": "2024-06-18T16:37:37Z",
    "arxiv_id": "http://arxiv.org/abs/2406.12768v1",
    "download_url": "http://arxiv.org/abs/2406.12768v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The reaction-diffusion approach to morphogenesis",
    "abstract": "Morphogenesis is the ensemble of processes that determines form, shape and\npatterns in organisms. Based on a reaction-diffusion theoretical setting and\nsome prototype reaction schemes, we make a review of the models and experiments\nthat support possible mechanisms of morphogenesis. We present specific case\nstudies from chemistry (Belousov-Zhabotinsky reaction) and biology (formation\nof wing eyespots patterns in butterflies). We show the importance of\nconservation laws in the establishment of patterning in biological systems, and\ntheir relevance to explain phenotypic plasticity in living organisms. Mass\nconservation introduces a memory effect in biological development and\nphenotypic plasticity in patterns of living organisms can be explained by\ndifferences on the initial conditions occurring during development.",
    "authors": [
      "Rui Dilao"
    ],
    "publication_date": "2005-02-25T22:28:36Z",
    "arxiv_id": "http://arxiv.org/abs/q-bio/0502041v1",
    "download_url": "http://arxiv.org/abs/q-bio/0502041v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electron-phonon and electron-electron interactions in organic field\n  effect transistors",
    "abstract": "Recent experiments have demonstrated that the performances of organic FETs\nstrongly depend on the dielectric properties of the gate insulator. In\nparticular, it has been shown that the temperature dependence of the mobility\nevolves from a metallic-like to an insulating behavior upon increasing the\ndielectric constant of the gate material. This phenomenon can be explained in\nterms of the formation of small polarons, due to the polar interaction of the\ncharge carriers with the phonons at the organic/dielectric interface. Building\non this model, the possible consequences of the Coulomb repulsion between the\ncarriers at high concentrations are analyzed.",
    "authors": [
      "S. Fratini",
      "A. F. Morpurgo",
      "S. Ciuchi"
    ],
    "publication_date": "2007-06-13T17:14:16Z",
    "arxiv_id": "http://arxiv.org/abs/0706.1950v1",
    "download_url": "http://arxiv.org/abs/0706.1950v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Romancing Mathematics with Chemistry - How Mathematical Trees Can Be\n  Used to Synthesize Molecular Structures",
    "abstract": "Structures of chemical compounds can be synthesized and categorized through\nmathematical means. Organic compounds are suitable targets because of their\nsimple valences. Acyclic organic compounds made of hydrogen and second-row\nelements C, N, O, and F are presented as an example. In five categories of\norganic compounds, chemical structures can be generated exclusively and\nexhaustively using ab initio methods. It is shown that mathematical variables\ncan serve as chemical symbols and mathematical equations are chemical structure\ngenerators.",
    "authors": [
      "Chin-yah Yeh"
    ],
    "publication_date": "2013-01-04T21:08:04Z",
    "arxiv_id": "http://arxiv.org/abs/1301.0833v1",
    "download_url": "http://arxiv.org/abs/1301.0833v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Complex Artificial Life",
    "abstract": "An object-oriented combinator chemistry was used to construct an artificial\norganism with a system architecture possessing characteristics necessary for\norganisms to evolve into more complex forms. This architecture supports\nmodularity by providing a mechanism for the construction of executable modules\ncalled $methods$ that can be duplicated and specialized to increase complexity.\nAt the same time, its support for concurrency provides the flexibility in\nexecution order necessary for redundancy, degeneracy and parallelism to\nmitigate increased replication costs. The organism is a moving,\nself-replicating, spatially distributed assembly of elemental combinators\ncalled a $roving \\: pile.$ The pile hosts an asynchronous message passing\ncomputation implemented by parallel subprocesses encoded by genes distributed\nthrough out the pile like the plasmids of a bacterial cell.",
    "authors": [
      "Lance R. Williams"
    ],
    "publication_date": "2018-05-16T15:20:30Z",
    "arxiv_id": "http://arxiv.org/abs/1805.06366v1",
    "download_url": "http://arxiv.org/abs/1805.06366v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A major asymmetric ice trap in a planet-forming disk: I. Formaldehyde\n  and methanol",
    "abstract": "The chemistry of planet-forming disks sets the exoplanet atmosphere\ncomposition and the prebiotic molecular content. Dust traps are of particular\nimportance as pebble growth and transport are crucial for setting the chemistry\nwhere giant planets are forming. The asymmetric Oph~IRS~48 dust trap located at\n60 au radius provides a unique laboratory for studying chemistry in\npebble-concentrated environments in warm Herbig disks with low gas-to-dust\nratios down to 0.01. We use deep ALMA Band~7 line observations to search the\nIRS~48 disk for H$_2$CO and CH$_3$OH line emission, the first steps of complex\norganic chemistry. We report the detection of 7 H$_2$CO and 6 CH$_3$OH lines\nwith energy levels between 17 and 260 K. The line emission shows a crescent\nmorphology, similar to the dust continuum, suggesting that the icy pebbles play\nan important role in the delivery of these molecules. Rotational diagrams and\nline ratios indicate that both molecules originate from warm molecular regions\nin the disk with temperatures $>$100 K and column densities $\\sim10^{14}$\ncm$^{-2}$ or a fractional abundance of $\\sim10^{-8}$ and with\nH$_2$CO/CH$_3$OH$\\sim$0.2, indicative of ice chemistry. Based on arguments from\na physical-chemical model with low gas-to-dust ratios, we propose a scenario\nwhere the dust trap provides a huge icy grain reservoir in the disk midplane or\nan `ice trap', which can result in high gas-phase abundances of warm COMs\nthrough efficient vertical mixing. This is the first time that complex organic\nmolecules have been clearly linked to the presence of a dust trap. These\nresults demonstrate the importance of including dust evolution and vertical\ntransport in chemical disk models, as icy dust concentrations provide important\nreservoirs for complex organic chemistry in disks.",
    "authors": [
      "N. van der Marel",
      "A. S. Booth",
      "M. Leemker",
      "E. F. van Dishoeck",
      "S. Ohashi"
    ],
    "publication_date": "2021-04-18T16:49:20Z",
    "arxiv_id": "http://arxiv.org/abs/2104.08906v2",
    "download_url": "http://arxiv.org/abs/2104.08906v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]