[
  {
    "title": "Giant Rashba Splitting in CH3NH3PbBr3 Organic-Inorganic Perovskite",
    "abstract": "As they combine decent mobilities with extremely long carrier lifetimes, organic-inorganic perovskites have opened a whole new field in opto\\-electronics. Measurements of their underlying electronic structure, however, are still lacking. Using angle-resolved photoelectron spectroscopy, we measure the valence band dispersion of single-crystal CH$_3$NH$_3$PbBr$_3$. The dispersion of the highest energy band is extracted applying a modified leading edge method, which accounts for the particular density of states of organic-inorganic perovskites. The surface Brillouin zone is consistent with bulk-terminated surfaces both in the low-temperature orthorhombic and the high-temperature cubic phase. In the low-temperature phase, we find a ring-shaped valence band maximum with a radius of 0.043 Å$^{-1}$, centered around a 0.16 eV deep local minimum in the dispersion of the valence band at the high-symmetry point. Intense circular dichroism is observed. This dispersion is the result of strong spin-orbit coupling. Spin-orbit coupling is also present in the room-temperature phase. The coupling strength is one of the largest reported so far.",
    "authors": [
      "Daniel Niesner",
      "Max Wilhelm",
      "Ievgen Levchuk",
      "Andres Osvet",
      "Shreetu Shrestha",
      "Miroslaw Batentschuk",
      "Christoph Brabec",
      "Thomas Fauster"
    ],
    "publication_date": "2016-06-19T13:27:24Z",
    "arxiv_id": "http://arxiv.org/abs/1606.05867v3",
    "download_url": "https://arxiv.org/abs/1606.05867v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mixtures of quasi-two and three dimensional hybrid organic-inorganic semiconducting perovskites for single layer LED",
    "abstract": "New blends of simply synthesized quasi two-dimensional (quasi-2D) hydrophobic perovskite semiconductors, employed in high performance light emitting diodes (LEDs) which function due to excitonic energy transfer effects, are reported. These materials are self-assembled blends of 2D, quasi-2D and three-dimensional (3D) hybrid organic-inorganic semiconductors (HOIS). Moreover, shown for the first time, crude mixing of 3D perovskite and unprotonated amines provides similar semiconductors. HOIS reported here are based on the organic cations CH3NH3+, CH3(CH2)7CH=CH(CH2)8NH3+ or C6H5CH2CH2NH3+ and inorganic networks formed out of PbX42- anions (X=I, Br, Cl). HOIS exhibit strong bound excitonic states with increased oscillator strength at room temperature, tunable via simple halide substitution. HOIS blends manifest energy transfer effects, where adjacent nanoparticles of different band gap energies (Eg) transfer optical energy to those with the lowest Eg; the suggested light emission mechanism here. LED fabrication is attained via a single deposition of the hydrophobic mixture, reducing device complexity, cost and degradability. LED's diodic behavior is observed even under light albeit its photovoltaic and photoconductive quasi-2D and 3D components. LED devices exposed for over than four months under adverse laboratory conditions, showed stable light emission. Further research on this class of quasi-2D/3D HOIS mixtures is expected to lead to novel quantum electronic devices.",
    "authors": [
      "Anastasia Vassilakopoulou",
      "Dionysios Papadatos",
      "Ioannis Zakouras",
      "Ioannis Koutselas"
    ],
    "publication_date": "2016-02-16T19:39:54Z",
    "arxiv_id": "http://arxiv.org/abs/1602.05148v2",
    "download_url": "https://arxiv.org/abs/1602.05148v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inorganic photovoltaic cells based on BiFeO3: spontaneous polarization, lattice matching, light polarization and their relationship to photovoltaic performance",
    "abstract": "Inorganic ferroelectric perovskite oxides are more stable than hybrid perovskites. However, their solar energy harvest efficiency is not so good. Here, by constructing a series of BiFeO3 based devices (solar cells), we investigated three factors that influence the photovoltaic performance, including spontaneous polarization, terminated ions species in the interface between BiFeO3 and the electrode, and polarized light irradiation. This work was carried out in the framework of density functional theory combined with non-equilibrium Green's function theory under built in electric field or finite bias. The results showed that 1. the photocurrent is larger only under a suitable electronic band gap rather than larger spontaneous polarization; 2. the photocurrent reaches the largest in Bi ions terminated interface than in the case of Fe ion or O ion with SrTiO3 electrode; 3. the photocurrent could be largely enhanced if the polarized direction of the monochromatic light is perpendicular to the spontaneous polarization direction. The results would deepen the understanding of some experimental results of BiFeO3 based solar cells.",
    "authors": [
      "Chao He",
      "Guocai Liu",
      "Huiyan Zhao",
      "Kun Zhao",
      "Zuju Ma",
      "Xingtao An"
    ],
    "publication_date": "2019-06-09T00:03:22Z",
    "arxiv_id": "http://arxiv.org/abs/1906.03545v5",
    "download_url": "https://arxiv.org/abs/1906.03545v5",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Defect Passivation and Förster-Type Energy Exchange in H2Pc-TMD Organic-Inorganic Heterostructures",
    "abstract": "Organic - inorganic heterostructures (HS) combine the strong light absorption and exciton generation capabilities of organic molecules with the unique excitonic properties of layered transition metal dichalcogenides (TMDs), where the interfacial band alignment dictates the optical response. In this work, we investigate the influence of H2Pc molecules on CVD-grown MoS2 and WS2 monolayers using correlative microscopy techniques - Kelvin probe force microscopy (KPFM), photoluminescence (PL), and Raman spectroscopy. Comprehensive analysis of both electronic and optical properties provides detailed insights into the energy band alignment in these two HS. Despite their similar band alignments, the heterostructures exhibit strikingly different optical signatures. In the case of H2Pc/MoS2 HS, the effect of defect healing is more pronounced, while for the H2Pc/WS2 HS, strong indications of Förster energy transfer are observed. These findings highlight the critical role of transition dipole moment in addition to spectral overlap between donor emission and acceptor absorption in the design of optoelectronic devices.",
    "authors": [
      "Šimun Mandić",
      "Ana Senkić",
      "Nataša Vujičić"
    ],
    "publication_date": "2025-10-14T12:17:03Z",
    "arxiv_id": "http://arxiv.org/abs/2510.12437v1",
    "download_url": "https://arxiv.org/abs/2510.12437v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "One-photon absorption by inorganic perovskite nanocrystals: A theoretical study",
    "abstract": "The one-photon absorption cross section of nanocrystals (NCs) of the inorganic perovskite CsPbBr$_{3}$ is studied theoretically using a multiband $\\mathbf{k}\\cdot\\mathbf{p}$ envelope-function model combined with a treatment of intercarrier correlation by many-body perturbation theory. A confined exciton is described first within the Hartree-Fock (HF) approximation, and correlation between the electron and hole is then included in leading order by computing the first-order vertex correction to the electron-photon interaction. The vertex correction is found to give an enhancement of the near-threshold absorption cross section by a factor of up to 4 relative to the HF (mean-field) value of the cross section, for NCs with an edge length $L=9$-12 nm (regime of intermediate confinement). The vertex-correction enhancement factors are found to decrease with increasing exciton energy; the absorption cross section for photons of energy $ω=3.1$ eV (about 0.7 eV above threshold) is enhanced by a factor of only 1.4-1.5 relative to the HF value. The $\\mathbf{k}\\cdot\\mathbf{p}$ corrections to the absorption cross section are also significant; they are found to increase the cross section at an energy $ω=3.1$ eV by about 30% relative to the value found in the effective-mass approximation. The theoretical absorption cross section at $ω=3.1$ eV, assuming a Kane parameter $E_{P}=20$ eV, is found to be intermediate among the set of measured values (which vary among themselves by nearly an order of magnitude) and to obey a power-law dependence $σ^{(1)}(ω)\\propto L^{2.9}$ on the NC edge length $L$, in good agreement with experiment. The dominant contribution to the theoretical exponent 2.9 is shown to be the density of final-state excitons. The main theoretical uncertainty in these calculations is in the value of the Kane parameter $E_{P}$.",
    "authors": [
      "T. P. T. Nguyen",
      "S. A. Blundell",
      "C. Guet"
    ],
    "publication_date": "2020-04-10T16:18:04Z",
    "arxiv_id": "http://arxiv.org/abs/2004.05093v1",
    "download_url": "https://arxiv.org/abs/2004.05093v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "CMOS based high-resolution dynamic X-ray imaging with inorganic perovskite",
    "abstract": "High-resolution dynamic X-ray detector is crucial for time-resolved digital radiography (DR) imaging and fast 3D medical computed tomography (CT) imaging. Recently, perovskites have become promising alternatives to conventional semi-conductor materials, e.g., Si, a-Se and CdTe, for direct X-ray detection. However, the feasibility of their combination with high-speed pixelated complementary metal-oxide-semiconductor (CMOS) arrays remains unknown. This work originally reports an innovative direct-conversion X-ray detector fabricated with 300 micrometer thick inorganic perovskite film printed on a tailored CMOS array. In-house measurements demonstrate that the CsPbBr3 film has excellent optoelectric properties of an electron mobility-lifetime product of 3.40x10$^{-5}$ cm$^2$ V$^{-1}$, and the X-ray detector exhibits high sensitivity of 9341uC Gy$_{\\rm air}^{-1}$ cm$^{-2}$, and low detection limit of 588 nGy$_{\\rm air}^{-1}$. This CMOS X-ray imaging detector achieves a high spatial resolution up to 5.5 lp/mm (close to the resolution limit of 6.0 lp/mm), and >300 frame per second (fps) readout speed. DR image of a resolution pattern phantom and a anesthesia mice, CT images of a biological specimen are acquired for the first time.",
    "authors": [
      "Yanliang Liu",
      "Chaosong Gao",
      "Jiongtao Zhu",
      "Xin Zhang",
      "Meng Wu",
      "Ting Su",
      "Jiahong Wang",
      "Zonghai Sheng",
      "Wenjun Liu",
      "Tongyu Shi",
      "Xingchen He",
      "Dong Liang",
      "Hairong Zheng",
      "Xue-Feng Yu",
      "Xiangming Sun",
      "Yongshuai Ge"
    ],
    "publication_date": "2022-10-05T07:52:42Z",
    "arxiv_id": "http://arxiv.org/abs/2210.02073v1",
    "download_url": "https://arxiv.org/abs/2210.02073v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The speed of sound and elastic properties of single crystals of inorganic and hybrid lead-free iodide perovskites obtained by femtosecond transient optical reflectivity",
    "abstract": "Optoelectronic devices operate under continuous thermal stress that may influence both long-term stability and optical properties of the active material. It is therefore useful to know the elastic properties of the active materials. In general, the elastic constants of a material may be deduced by the measurement of the speed of sound in that material. In this work, we report on the measurements of the speed of sound in three lead-free halide perovskites, namely the inorganic Cs3Bi2I9 and the hybrid MA3Bi2I9 and MA3Sb2I9, by means of femtosecond transient optical reflectivity that shows oscillations of the signal intensity that are related to the strain field caused by the photoexcitation of electron-hole pairs. The values of the speed of sound thus obtained have allowed us to extract the elastic constant, c11, along the propagation direction of the light. The c11 values indicate a lower stiffness of the hybrid materials, an important aspect when designing optoelectronic devices.",
    "authors": [
      "Giuseppe Ammirati",
      "Patrick O Keeffe",
      "Stefano Turchini",
      "Daniele Catone",
      "Alessandra Paladini",
      "Francesco Toschi",
      "Stevan Gavranovic",
      "Jan Pospisil",
      "Giovanni Mannino",
      "Salvatore Valastro",
      "Faustino Martelli"
    ],
    "publication_date": "2025-02-14T11:06:06Z",
    "arxiv_id": "http://arxiv.org/abs/2502.10082v1",
    "download_url": "https://arxiv.org/abs/2502.10082v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magnetic properties of layered hybrid organic-inorganic metal-halide perovskites: transition metal, organic cation and perovskite phase effects",
    "abstract": "Understanding the structural and magnetic properties in layered hybrid organic-inorganic metal halide perovskites (HOIPs) is key for their design and integration in spin-electronic devices. Here, we have conducted a systematic study on ten compounds to understand the effect of the transition metal (Cu$^{2+}$, Mn$^{2+}$, Co$^{2+}$), organic spacer (alkyl- and aryl-ammonium) and perovskite phase (Ruddlesden-Popper and Dion-Jacobson) on the properties of these materials. Temperature-dependent Raman measurements show that the crystals' structural phase transitions are triggered by the motional freedom of the organic cations as well as by the flexibility of the inorganic metal-halide lattice. In the case of Cu$^{2+}$ HOIPs, an increase of the in-plane anisotropy and a reduction of the octahedra interlayer distance is found to change the behavior of the HOIP from that of a 2D ferromagnet to that of a quasi-3D antiferromagnet. Mn$^{2+}$ HOIPs show inherent antiferromagnetic octahedra intralayer interactions and a phenomenologically rich magnetism, presenting spin-canting, spin-flop transitions and metamagnetism controlled by the crystal anisotropy. Co$^{2+}$ crystals with non-linked tetrahedra show a dominant paramagnetic behavior irrespective of the organic spacer and the perovskite phase. This work demonstrates that the chemical flexibility of HOIPs can be exploited to develop novel layered magnetic materials with tailored magnetic properties.",
    "authors": [
      "Yaiza Asensio",
      "Sergio Marras",
      "Davide Spirito",
      "Marco Gobbi",
      "Mihail Ipatov",
      "Fèlix Casanova",
      "Aurelio Mateo-Alonso",
      "Luis E. Hueso",
      "Beatriz Martín-García"
    ],
    "publication_date": "2024-04-20T15:06:49Z",
    "arxiv_id": "http://arxiv.org/abs/2404.13403v1",
    "download_url": "https://arxiv.org/abs/2404.13403v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Design and Analysis of Plasmonic-Nanorod-Enhanced Lead-Free Inorganic Perovskite/Silicon Heterojunction Tandem Solar Cell Exceeding the Shockley-Queisser Limit",
    "abstract": "The pursuit of sustainable and highly efficient energy conversion necessitates a transition from toxic and unstable materials to environmentally friendly alternatives. This work presents a simulation-based numerical investigation of a fully inorganic, lead-free tandem solar cell that employs cesium tin-germanium tri-iodide (CsSnGeI3) as the top cell absorber and crystalline silicon (c-Si) as the bottom cell absorber, configured in a silicon heterojunction (SHJ) arrangement. Utilizing CsSnGeI3 as a lead-free perovskite presents a promising solution to the toxicity concerns associated with conventional lead-based perovskites. To further increase near-infrared absorption and reduce the required thickness of the c-Si layer, an ultra-thin gallium antimonide auxiliary absorber is integrated into the SHJ bottom cell. Optical and electrical simulations, conducted using finite-difference time-domain and drift-diffusion modelling, demonstrate that the optimized tandem structure attains a power conversion efficiency of 34.93%, surpassing the Shockley-Queisser limit established for single-junction Si cells. Furthermore, the optimized device showcases an open-circuit voltage of 1.93 V, a short-circuit current density of 21.30 mA/cm2, and a fill factor of 84.74%. Performance is additionally enhanced by incorporating cylindrical gold nanorods within a Si3N4 dielectric medium positioned at the rear of the bottom cell, thus amplifying light absorption through plasmonic effects. Notably, the tandem cell sustains high efficiency even without the plasmonic structure, thereby providing flexibility for cost-effective fabrication. This work underscores the viability of all-inorganic, lead-free tandem cells for next-generation photovoltaics, guided by simulated results that pave the way for high-efficiency, non-toxic solar energy solutions and further experimental validation.",
    "authors": [
      "Md. Sad Abdullah Sami",
      "Arpan Sur",
      "Ehsanur Rahman"
    ],
    "publication_date": "2025-07-30T16:12:15Z",
    "arxiv_id": "http://arxiv.org/abs/2507.22803v1",
    "download_url": "https://arxiv.org/abs/2507.22803v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Homogenization of Halide Distribution and Carrier Dynamics in Alloyed Organic-Inorganic Perovskites",
    "abstract": "Perovskite solar cells have shown remarkable efficiencies beyond 22%, through organic and inorganic cation alloying. However, the role of alkali-metal cations is not well-understood. By using synchrotron-based nano-X-ray fluorescence and complementary measurements, we show that when adding RbI and/or CsI the halide distribution becomes homogenous. This homogenization translates into long-lived charge carrier decays, spatially homogenous carrier dynamics visualized by ultrafast microscopy, as well as improved photovoltaic device performance. We find that Rb and K phase-segregate in highly concentrated aggregates. Synchrotron-based X-ray-beam-induced current and electron-beam-induced current of solar cells show that Rb clusters do not contribute to the current and are recombination active. Our findings bring light to the beneficial effects of alkali metal halides in perovskites, and point at areas of weakness in the elemental composition of these complex perovskites, paving the way to improved performance in this rapidly growing family of materials for solar cell applications.",
    "authors": [
      "Juan-Pablo Correa-Baena",
      "Yanqi Luo",
      "Thomas M. Brenner",
      "Jordan Snaider",
      "Shijing Sun",
      "Xueying Li",
      "Mallory A. Jensen",
      "Lea Nienhaus",
      "Sarah Wieghold",
      "Jeremy R. Poindexter",
      "Shen Wang",
      "Ying Shirley Meng",
      "Ti Wang",
      "Barry Lai",
      "Moungi G. Bawendi",
      "Libai Huang",
      "David P. Fenning",
      "Tonio Buonassisi"
    ],
    "publication_date": "2018-04-23T20:26:08Z",
    "arxiv_id": "http://arxiv.org/abs/1804.08722v2",
    "download_url": "https://arxiv.org/abs/1804.08722v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tunable spin textures in polar antiferromagnetic hybrid organic inorganic perovskites by electric and magnetic fields",
    "abstract": "The hybrid organic inorganic perovskites (HOIPs) have attracted much attention for their potential applications as novel optoelectronic devices. Remarkably, the Rashba band splitting, together with specific spin orientations in k space (i.e., spin texture), has been found to be relevant for the optoelectronic performances. In this work, by using first principles calculations and symmetry analyses, we study the electric polarization, magnetism, and spin texture properties of the antiferromagnetic (AFM) HOIP ferroelectric TMCM_MnCl3 (TMCM = (CH3)3NCH2Cl, trimethylchloromethyl ammonium). This recently synthesized compound is a prototype of order disorder and displacement-type ferroelectric with a large piezoelectric response, high ferroelectric transition temperature, and excellent photoluminescence properties [You et al., Science 357, 306 (2017)]. The most interesting result is that the inversion symmetry breaking coupled to the spin orbit coupling gives rise to a Rashba-like band splitting and a related robust persistent spin texture (PST) and/or typical spiral spin texture, which can be manipulated by tuning the ferroelectric or, surprisingly, also by the AFM magnetic order parameter. The tunability of spin texture upon switching of AFM order parameter is largely unexplored and our findings not only provide a platform to understand the physics of AFM spin texture but also support the AFM HOIP ferroelectrics as a promising class of optoelectronic materials.",
    "authors": [
      "Feng Lou",
      "Teng Gu",
      "Junyi Ji",
      "Junsheng Feng",
      "Hongjun Xiang",
      "Alessandro Stroppa"
    ],
    "publication_date": "2020-07-20T11:46:50Z",
    "arxiv_id": "http://arxiv.org/abs/2007.10016v1",
    "download_url": "https://arxiv.org/abs/2007.10016v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ChemVTS-Bench: Evaluating Visual-Textual-Symbolic Reasoning of Multimodal Large Language Models in Chemistry",
    "abstract": "Chemical reasoning inherently integrates visual, textual, and symbolic modalities, yet existing benchmarks rarely capture this complexity, often relying on simple image-text pairs with limited chemical semantics. As a result, the actual ability of Multimodal Large Language Models (MLLMs) to process and integrate chemically meaningful information across modalities remains unclear. We introduce \\textbf{ChemVTS-Bench}, a domain-authentic benchmark designed to systematically evaluate the Visual-Textual-Symbolic (VTS) reasoning abilities of MLLMs. ChemVTS-Bench contains diverse and challenging chemical problems spanning organic molecules, inorganic materials, and 3D crystal structures, with each task presented in three complementary input modes: (1) visual-only, (2) visual-text hybrid, and (3) SMILES-based symbolic input. This design enables fine-grained analysis of modality-dependent reasoning behaviors and cross-modal integration. To ensure rigorous and reproducible evaluation, we further develop an automated agent-based workflow that standardizes inference, verifies answers, and diagnoses failure modes. Extensive experiments on state-of-the-art MLLMs reveal that visual-only inputs remain challenging, structural chemistry is the hardest domain, and multimodal fusion mitigates but does not eliminate visual, knowledge-based, or logical errors, highlighting ChemVTS-Bench as a rigorous, domain-faithful testbed for advancing multimodal chemical reasoning. All data and code will be released to support future research.",
    "authors": [
      "Zhiyuan Huang",
      "Baichuan Yang",
      "Zikun He",
      "Yanhong Wu",
      "Fang Hongyu",
      "Zhenhe Liu",
      "Lin Dongsheng",
      "Bing Su"
    ],
    "publication_date": "2025-11-22T04:24:24Z",
    "arxiv_id": "http://arxiv.org/abs/2511.17909v1",
    "download_url": "https://arxiv.org/abs/2511.17909v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "All-Inorganic Spin-Cast Nanoparticle Solar Cells with Non-Selective Electrodes",
    "abstract": "Spin-cast all-inorganic nanoparticle solutions have been used to make a CdTe/CdSe solar cell with an efficiency of up to 2.8% without alumina or calcium buffer layers. The type of junction and non-selective nature of the contacts made to these devices is explored.",
    "authors": [
      "I. E. Anderson",
      "J. D. Olson",
      "L. Yang",
      "S. A. Carter"
    ],
    "publication_date": "2008-08-29T00:14:18Z",
    "arxiv_id": "http://arxiv.org/abs/0808.4007v3",
    "download_url": "https://arxiv.org/abs/0808.4007v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Probing of Excitonic Transitions in All Inorganic Perovskite Quantum Dots (CsPbX$_3$: X= Cl, Br, I) by Magnetic Circular Dichroism Spectroscopy",
    "abstract": "Higher-order electronic transitions of all inorganic lead halide perovskite quantum dots (QDs) (CsPbX$_3$: X = Cl, Br, I) are hardly detected by traditional spectroscopic techniques due to the condensed electronic level of QDs. This work assigned the various excitonic transitions in undoped CsPbX$_3$ QDs through a high-resolution absorption spectroscopic technique - magnetic circular dichroism (MCD). Moreover, we investigated the nature of these transitions through sensitive Zeeman responses to the electronic states, likely involving the interaction of spins with the applied external magnetic field. The study unveiled multiple excitonic transitions in the QDs, showing unusual temperature dependence and shedding light on the role of spin-orbit interactions in the presence of a magnetic field. This study offers a comprehensive insight into excitonic transitions, and the potential manipulation of their spin through thermal means holds the promise of advancing electronic and photonic devices based on these materials.",
    "authors": [
      "Prasenjit Mandal",
      "Ranjani Viswanatha"
    ],
    "publication_date": "2023-11-21T12:28:32Z",
    "arxiv_id": "http://arxiv.org/abs/2311.12567v1",
    "download_url": "https://arxiv.org/abs/2311.12567v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]