[
  {
    "title": "Perspective: Multi-configurational methods in bio-inorganic chemistry",
    "abstract": "Transition metal ions play crucial roles in the structure and function of\nnumerous proteins, contributing to essential biological processes such as\ncatalysis, electron transfer, and oxygen binding. However, accurately modeling\nthe electronic structure and properties of metalloproteins poses significant\nchallenges due to the complex nature of their electronic configurations and\nstrong correlation effects. Multiconfigurational quantum chemistry methods are,\nin principle, the most appropriate tools for addressing these challenges,\noffering the capability to capture the inherent multi-reference character and\nstrong electron correlation present in bio-inorganic systems. Yet their\ncomputational cost has long hindered wider adoption, making methods such as\nDensity Functional Theory (DFT) the method of choice. However, advancements\nover the past decade have substantially alleviated this limitation, rendering\nmulticonfigurational quantum chemistry methods more accessible and applicable\nto a wider range of bio-inorganic systems. In this perspective, we discuss some\nof these developments and how they have already been used to answer some of the\nmost important questions in bio-inorganic chemistry. We also comment on ongoing\ndevelopments in the field and how the future of the field may evolve.",
    "authors": [
      "Frederik K. Jørgensen",
      "Mickaël G. Delcey",
      "Erik D. Hedegård"
    ],
    "publication_date": "2024-05-19T14:06:24Z",
    "arxiv_id": "http://arxiv.org/abs/2405.11553v1",
    "download_url": "http://arxiv.org/abs/2405.11553v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Charting Lattice Thermal Conductivity of Inorganic Crystals",
    "abstract": "Thermal conductivity is a fundamental material property but challenging to\npredict, with less than 5% out of about $10^5$ synthesized inorganic materials\nbeing documented. In this work, we extract the structural chemistry that\ngoverns lattice thermal conductivity, by combining graph neural networks and\nrandom forest approaches. We show that both mean and variation of unit-cell\nconfigurational properties, such as atomic volume and bond length, are the most\nimportant features, followed by mass and elemental electronegativity. We chart\nthe structural chemistry of lattice thermal conductivity into extended\nvan-Arkel triangles, and predict the thermal conductivity of all known\ninorganic materials in the Inorganic Crystal Structure Database. For the\nlatter, we develop a transfer learning framework extendable for other\napplications.",
    "authors": [
      "Taishan Zhu",
      "Sheng Gong",
      "Tian Xie",
      "Prashun Gorai",
      "Jeffrey C. Grossman"
    ],
    "publication_date": "2020-06-21T04:45:22Z",
    "arxiv_id": "http://arxiv.org/abs/2006.11712v1",
    "download_url": "http://arxiv.org/abs/2006.11712v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hybrid organic-inorganic two-dimensional metal carbide MXenes with\n  amido- and imido-terminated surfaces",
    "abstract": "Two-dimensional (2D) transition-metal carbides and nitrides (MXenes) show\nimpressive performance in applications, such as supercapacitors, batteries,\nelectromagnetic interference shielding, or electrocatalysis. These materials\ncombine the electronic and mechanical properties of 2D inorganic crystals with\nchemically modifiable surfaces, and surface-engineered MXenes represent an\nideal platform for fundamental and applied studies of interfaces in 2D\nfunctional materials. A natural step in structural engineering of MXene\ncompounds is the development and understanding of MXenes with various organic\nfunctional groups covalently bound to inorganic 2D sheets. Such hybrid\nstructures have the potential to unite the tailorability of organic molecules\nwith the unique electronic properties of inorganic 2D solids. Here, we\nintroduce a new family of hybrid MXenes (h-MXenes) with amido- and\nimido-bonding between organic and inorganic parts. The description of h-MXene\nstructure requires an intricate mix of concepts from the fields of coordination\nchemistry, self-assembled monolayers (SAMs) and surface science. The optical\nproperties of h-MXenes reveal coherent coupling between the organic and\ninorganic components. h-MXenes also show superior stability against hydrolysis\nin aqueous solutions.",
    "authors": [
      "Chenkun Zhou",
      "Di Wang",
      "Francisco Lagunas",
      "Benjamin Atterberry",
      "Ming Lei",
      "Huicheng Hu",
      "Zirui Zhou",
      "Alexander S. Filatov",
      "De-en Jiang",
      "Aaron J. Rossini",
      "Robert F. Klie",
      "Dmitri V. Talapin"
    ],
    "publication_date": "2023-05-27T20:06:03Z",
    "arxiv_id": "http://arxiv.org/abs/2305.17566v1",
    "download_url": "http://arxiv.org/abs/2305.17566v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mathematical crystal chemistry II: Random search for ionic crystals and\n  analysis on oxide crystals registered in ICSD",
    "abstract": "Mathematical crystal chemistry views crystal structures as the optimal\nsolutions of mathematical optimization problem formalizing inorganic structural\nchemistry. This paper introduces the minimum and maximum atomic radii depending\non the types of geometrical constraints, extending the concept of effective\natomic sizes. These radii define permissible interatomic distances instead of\ninteratomic forces, constraining feasible types and connections of coordination\npolyhedra. The definition shows the aspect that crystal structures are packings\nof atomic spheres. Additionally, creatability functions for geometrical\nconstraints, which give a choice of creatable types of geometrical constraints\ndepending on the spatial order of atoms, are implemented to guide randomly\ngenerated structures toward optimal solutions. The framework identifies unique\noptimal solutions corresponding to the structures of spinel, pyrochlore\n($\\alpha$ and $\\beta$), pyroxene, quadruple perovskite, cuprate superconductor\n$\\mathrm{YBa}_2 \\mathrm{Cu}_3 \\mathrm{O}_{7-x}$, and iron-based superconductor\n$\\mathrm{LaFeAsO}$. Notably, up to $95\\%$ of oxide crystal structure types in\nInorganic Crystal Structure Database align with the optimal solutions\npreserving experimental structures despite the discretized feasible atomic\nradii. These findings highlight the role of mathematical optimization problem\nas a theoretical foundation for mathematical crystal chemistry, enabling\nefficient structure prediction.",
    "authors": [
      "Ryotaro Koshoji"
    ],
    "publication_date": "2025-03-26T06:42:41Z",
    "arxiv_id": "http://arxiv.org/abs/2503.20273v2",
    "download_url": "http://arxiv.org/abs/2503.20273v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "General Learning of the Electric Response of Inorganic Materials",
    "abstract": "We present MACE-Field, a field-aware $O(3)$-equivariant interatomic potential\nthat provides a compact, derivative-consistent route to dielectric properties\n(such as polarisation $\\mathbf P$, Born effective charges $Z^*$ and\npolarisability $\\boldsymbol\\alpha$) and finite-field simulations across\nchemistry for inorganic solids. A uniform electric field is injected within\neach message-passing layer via a Clebsch-Gordan tensor-product which couples\nthe field to latent spherical-tensor features, and perturbs them via an\nequivariant residual mixing. This plug-in design preserves the standard MACE\nreadout and can inherit existing MACE foundation weights, turning pretrained\nmodels into field-aware ones with minimal change. To demonstrate, we train: (i)\na cross-chemistry ferroelectric polarisation model (2.5k nonpolar$\\!\\to$polar\npolarisation branches), (ii) a cross-chemistry BECs/polarisability model\n($\\sim$6k Materials Project dielectrics spanning 81 elements), and (iii-iv)\nsingle-material molecular dynamics on BaTiO$_3$ and $\\alpha$-SiO$_2$. The\nmodels recover polarisation branches and spontaneous polarisation, predict\n$Z^*$ and $\\boldsymbol\\alpha$ (hence $\\varepsilon_\\infty$) across diverse\nchemistries, and reproduce BaTiO$_3$ hysteresis and the IR/Raman and dielectric\nspectra of $\\alpha$-quartz, benchmarking comparatively with Allegro-pol.",
    "authors": [
      "Bradley A. A. Martin",
      "Alex M. Ganose",
      "Venkat Kapil",
      "Keith T. Butler"
    ],
    "publication_date": "2025-08-25T10:25:22Z",
    "arxiv_id": "http://arxiv.org/abs/2508.17870v1",
    "download_url": "http://arxiv.org/abs/2508.17870v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploration of H2 binding to the [NiFe]-hydrogenase active site with\n  multiconfigurational density functional theory",
    "abstract": "The combination of density functional theory (DFT) with a\nmulticonfigurational wave function is an efficient way to include dynamical\ncorrelation in calculations with multiconfiguration self-consistent field wave\nfunctions. These methods can potentially be employed to elucidate reaction\nmechanisms in bio-inorganic chemistry, where many other methods become either\ntoo computationally expensive or too inaccurate. In this paper, a complete\nactive space (CAS) short-range DFT (CAS-srDFT) hybrid was employed to\ninvestigate a bio-inorganic system, namely H2 binding to the active site of\n[NiFe] hydrogenase. This system was previously investigated with\ncoupled-cluster (CC) and multiconfigurational methods in form of\ncumulant-approximated second-order perturbation theory, based on the density\nmatrix renormalization group (DMRG). We find that it is more favorable for H2\nto bind to Ni than to Fe, in agreement with previous CC and DMRG calculations.\nThe accuracy of CAS-srDFT is comparable to both CC and DMRG, despite that much\nsmaller active spaces were employed. This enhanced efficiency at smaller active\nspaces shows that CAS-srDFT can become a useful method for bio-inorganic\nchemistry.",
    "authors": [
      "Geng Dong",
      "Ulf Ryde",
      "Hans Jørgen Aa. Jensen",
      "Erik D. Hedegård"
    ],
    "publication_date": "2017-10-05T08:54:07Z",
    "arxiv_id": "http://arxiv.org/abs/1710.01922v1",
    "download_url": "http://arxiv.org/abs/1710.01922v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Saturation Magnetization of Inorganic/polymer Nanocomposites Higher than\n  That of Their Inorganic Magnetic Component",
    "abstract": "Herein, some magnetic nanoparticles (MNP)/clay/polymer nanocomposites have\nbeen prepared, whose saturation magnetization is higher than that of pure oleic\nacid coated MNP component. The existence of unique 'nano-network' structure and\ntight three-phase nano-interface in the nanocomposites contribute to the\nsurprising saturation magnetization.",
    "authors": [
      "Yang Liu",
      "Makoto Takafuji",
      "Hirotaka Ihara",
      "Takeshi Wakiya"
    ],
    "publication_date": "2012-06-13T13:44:28Z",
    "arxiv_id": "http://arxiv.org/abs/1206.2805v1",
    "download_url": "http://arxiv.org/abs/1206.2805v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-Throughput Identification of Electrides from all Known Inorganic\n  Materials",
    "abstract": "In this paper, we present the results of a large-scale, high-throughput\ncomputational search for electrides among all known inorganic materials.\nAnalyzing a database of density functional theory results on more than 60,000\ncompounds, we identify 69 new electride candidates. We report on all these\ncandidates and discuss the structural and chemical factors leading to electride\nformation. Among these candidates, our work identifies the first\npartially-filled 3d transition metal containing electrides Ba3CrN3 and Sr3CrN3;\nan unexpected finding that contravenes conventional chemistry.",
    "authors": [
      "Lee A. Burton",
      "Francesco Ricci",
      "Gian-Marco Rignanese",
      "Geoffroy Hautier"
    ],
    "publication_date": "2018-01-09T14:30:29Z",
    "arxiv_id": "http://arxiv.org/abs/1801.02948v1",
    "download_url": "http://arxiv.org/abs/1801.02948v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data-Mining Element Charges in Inorganic Materials",
    "abstract": "Oxidation states are well-established in chemical science teaching and\nresearch. We data-mine more than 168,000 crystallographic reports to find an\noptimal allocation of oxidation states to each element. In doing so we uncover\ndiscrepancies between text-book chemistry and reported charge states observed\nin materials. We go on to show how the oxidation states we recommend can\nsignificantly facilitate materials discovery and heuristic design of novel\ninorganic compounds.",
    "authors": [
      "Yu Ding",
      "Yu Kumagai",
      "Fumiyasu Oba",
      "Lee A. Burton"
    ],
    "publication_date": "2020-07-04T12:29:14Z",
    "arxiv_id": "http://arxiv.org/abs/2007.02085v1",
    "download_url": "http://arxiv.org/abs/2007.02085v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Physical descriptor for the Gibbs energy of inorganic crystalline solids\n  and temperature-dependent materials chemistry",
    "abstract": "The Gibbs energy, G, determines the equilibrium conditions of chemical\nreactions and materials stability. Despite this fundamental and ubiquitous\nrole, G has been tabulated for only a small fraction of known inorganic\ncompounds, impeding a comprehensive perspective on the effects of temperature\nand composition on materials stability and synthesizability. Here, we use the\nSISSO (sure independence screening and sparsifying operator) approach to\nidentify a simple and accurate descriptor to predict G for stoichiometric\ninorganic compounds with ~50 meV/atom (~1 kcal/mol) resolution, and with\nminimal computational cost, for temperatures ranging from 300-1800 K. We then\napply this descriptor to ~30,000 known materials curated from the Inorganic\nCrystal Structure Database (ICSD). Using the resulting predicted thermochemical\ndata, we generate thousands of temperature-dependent phase diagrams to provide\ninsights into the effects of temperature and composition on materials\nsynthesizability and stability and to establish the temperature-dependent scale\nof metastability for inorganic compounds.",
    "authors": [
      "Christopher J. Bartel",
      "Samantha L. Millican",
      "Ann M. Deml",
      "John R. Rumptz",
      "William Tumas",
      "Alan W. Weimer",
      "Stephan Lany",
      "Vladan Stevanović",
      "Charles B. Musgrave",
      "Aaron M. Holder"
    ],
    "publication_date": "2018-05-21T16:18:55Z",
    "arxiv_id": "http://arxiv.org/abs/1805.08155v2",
    "download_url": "http://arxiv.org/abs/1805.08155v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coherent Exciton-Lattice Dynamics in a 2D Metal Organochalcogenolate\n  Semiconductor",
    "abstract": "Hybrid organic-inorganic nanomaterials can exhibit transitional behavior that\ndeviates from models developed for all-organic or all-inorganic materials\nsystems. Here, we reveal the complexity of exciton-phonon interactions in a\nrecently discovered 2D layered hybrid organic-inorganic semiconductor, silver\nphenylselenolate (AgSePh). Using femtosecond resonant impulsive vibrational\nspectroscopy and non-resonant Raman scattering, we measure multiple hybrid\norganic-inorganic vibrational modes and identify a subset of these modes that\nstrongly couple to the electronic excited state. Calculations by density\nfunctional perturbation theory show that these strongly coupled modes exhibit\nlarge out-of-plane silver atomic motions and silver-selenium spacing\ndisplacements. Moreover, analysis of photoluminescence fine-structure splitting\nand temperature-dependent peak-shifting/linewidth-broadening suggests that\nlight emission in AgSePh is most strongly affected by a compound 100 cm-1 mode\ninvolving the wagging motion of phenylselenolate ligands and accompanying\nmetal-chalcogen stretching. Finally, red-shifting of vibrational modes with\nincreasing temperature reveals a high degree of anharmonicity arising from\nnon-covalent interactions between phenyl rings. These findings reveal the\nunique effects of hybrid vibrational modes in organic-inorganic semiconductors\nand motivate future work aimed at specifically engineering such interactions\nthrough chemical and structural modification.",
    "authors": [
      "Eric R. Powers",
      "Watcharaphol Paritmongkol",
      "Dillon C. Yost",
      "Woo Seok Lee",
      "Jeffrey C. Grossman",
      "William A. Tisdale"
    ],
    "publication_date": "2023-10-12T15:06:19Z",
    "arxiv_id": "http://arxiv.org/abs/2310.08393v1",
    "download_url": "http://arxiv.org/abs/2310.08393v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Retro-Rank-In: A Ranking-Based Approach for Inorganic Materials\n  Synthesis Planning",
    "abstract": "Retrosynthesis strategically plans the synthesis of a chemical target\ncompound from simpler, readily available precursor compounds. This process is\ncritical for synthesizing novel inorganic materials, yet traditional methods in\ninorganic chemistry continue to rely on trial-and-error experimentation.\nEmerging machine-learning approaches struggle to generalize to entirely new\nreactions due to their reliance on known precursors, as they frame\nretrosynthesis as a multi-label classification task. To address these\nlimitations, we propose Retro-Rank-In, a novel framework that reformulates the\nretrosynthesis problem by embedding target and precursor materials into a\nshared latent space and learning a pairwise ranker on a bipartite graph of\ninorganic compounds. We evaluate Retro-Rank-In's generalizability on\nchallenging retrosynthesis dataset splits designed to mitigate data duplicates\nand overlaps. For instance, for Cr2AlB2, it correctly predicts the verified\nprecursor pair CrB + Al despite never seeing them in training, a capability\nabsent in prior work. Extensive experiments show that Retro-Rank-In sets a new\nstate-of-the-art, particularly in out-of-distribution generalization and\ncandidate set ranking, offering a powerful tool for accelerating inorganic\nmaterial synthesis.",
    "authors": [
      "Thorben Prein",
      "Elton Pan",
      "Sami Haddouti",
      "Marco Lorenz",
      "Janik Jehkul",
      "Tymoteusz Wilk",
      "Cansu Moran",
      "Menelaos Panagiotis Fotiadis",
      "Artur P. Toshev",
      "Elsa Olivetti",
      "Jennifer L. M. Rupp"
    ],
    "publication_date": "2025-02-06T18:34:37Z",
    "arxiv_id": "http://arxiv.org/abs/2502.04289v2",
    "download_url": "http://arxiv.org/abs/2502.04289v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New phases in the Ba-Ce(M)-O systems (M = Ga, In)",
    "abstract": "A new and known barium cerates doped by In and Ga were synthesized in air at\n1700 K. The synthesis was performed by solid state reactions from BaCO3, CeO2,\nIn2O3 or Ga2O3. X-ray diffraction profiles of the powdered samples were\nobtained with DRON-UM-1 and STADI-P diffractometers using monochromatized CuKa\nradiation. The following compositions of new phases were obtained:\nBaCe1-xGaxO3-d (x = 0.05; 0.1) and BaCe1-xInxO3-d (x = 0.25, 0.5). They\ncrystallize in the orthorhombic space group Pnma. The lattice parameters were\ncalculated by full profile Rietveld method. Based on analysis of literature\ndata it was possible to assume that increasing of tolerance factors from BaCeO3\nup to BaCe1-xGaxO3-d (BaCe1-xInxO3-d) led to the increasing of stability and\ntransport properties of Ga and In doped barium cerates.",
    "authors": [
      "N. I. Matskevich",
      "T. I. Chupahina",
      "G. V. Bazuev",
      "F. A. Kuznetsov"
    ],
    "publication_date": "2005-07-25T04:22:36Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0507563v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0507563v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magnetic properties of bismuth-cobalt oxides doped by erbium",
    "abstract": "We synthesized bismuth - cobalt oxide doped by erbium with general formula\nBi3-xErxCoO3-y. Compound has structure of delta-form bismuth oxide. Magnetic\nproperties of the compound were measured by Faraday's method using quartz\nscales in the temperature range of 80-500 K. The magnetic susceptibility and\neffective magnetic moment were calculated.",
    "authors": [
      "N. I. Matskevich",
      "E. V. Korotaev"
    ],
    "publication_date": "2015-12-06T12:23:16Z",
    "arxiv_id": "http://arxiv.org/abs/1512.01782v1",
    "download_url": "http://arxiv.org/abs/1512.01782v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Automatically Extracting Action Graphs from Materials Science Synthesis\n  Procedures",
    "abstract": "Computational synthesis planning approaches have achieved recent success in\norganic chemistry, where tabulated synthesis procedures are readily available\nfor supervised learning. The syntheses of inorganic materials, however, exist\nprimarily as natural language narratives contained within scientific journal\narticles. This synthesis information must first be extracted from the text in\norder to enable analogous synthesis planning methods for inorganic materials.\nIn this work, we present a system for automatically extracting structured\nrepresentations of synthesis procedures from the texts of materials science\njournal articles that describe explicit, experimental syntheses of inorganic\ncompounds. We define the structured representation as a set of linked events\nmade up of extracted scientific entities and evaluate two unsupervised\napproaches for extracting these structures on expert-annotated articles: a\nstrong heuristic baseline and a generative model of procedural text. We also\nevaluate a variety of supervised models for extracting scientific entities. Our\nresults provide insight into the nature of the data and directions for further\nwork in this exciting new area of research.",
    "authors": [
      "Sheshera Mysore",
      "Edward Kim",
      "Emma Strubell",
      "Ao Liu",
      "Haw-Shiuan Chang",
      "Srikrishna Kompella",
      "Kevin Huang",
      "Andrew McCallum",
      "Elsa Olivetti"
    ],
    "publication_date": "2017-11-18T15:28:17Z",
    "arxiv_id": "http://arxiv.org/abs/1711.06872v2",
    "download_url": "http://arxiv.org/abs/1711.06872v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deep Learning Accelerated Gold Nanocluster Synthesis",
    "abstract": "The understanding of inorganic reactions, especially those far from the\nequilibrium state, is relatively limited due to their inherent complexity. Poor\nunderstandings on the underlying synthetic chemistry have constrained the\ndesign of efficient synthesis routes towards desired final products, especially\nthose inorganic materials at atomic precision. In this work, using the\nsynthesis of atomically precise gold nanoclusters as a demonstration platform,\nwe have successfully developed a deep learning framework for guiding material\nsynthesis and accelerating the whole workflow. With only 54 examples, the\nproposed Graph Convolutional Neural Networks (GCNN) plus Siamese Neural\nNetworks (SNN) classification model with the basic descriptors have been\ntrained. The capability of predicting the target synthesis results has been\ndemonstrated with a successful experimental validation. In addition,\nunderstandings in the synthesis process can be acquired from a decision tree\ntrained by a large amount of generated data from the well-trained\nclassification model. This study not only provides a data-driven method\naccelerating gold nanocluster synthesis, but also sheds light on understanding\ncomplex inorganic materials synthesis with low data amount.",
    "authors": [
      "Jiali Li",
      "Tiankai Chen",
      "Kaizhuo Lim",
      "Lingtong Chen",
      "Saif A. Khan",
      "Jianping Xie",
      "Xiaonan Wang"
    ],
    "publication_date": "2018-11-07T05:56:07Z",
    "arxiv_id": "http://arxiv.org/abs/1811.02771v2",
    "download_url": "http://arxiv.org/abs/1811.02771v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effect of heterostructure engineering on electronic structure and\n  transport properties of two-dimensional halide perovskites",
    "abstract": "Organic-inorganic halide perovskite solar cells have attracted much attention\ndue to their low-cost fabrication, flexibility, and high-power conversion\nefficiency. More recent efforts show that the reduction from three- to\ntwo-dimensions (2D) of organic-inorganic halide perovskites promises an\nexciting opportunity to tune their electronic properties. Here, we explore the\neffect of reduced dimensionality and heterostructure engineering on the\nintrinsic material properties, such as energy stability, bandgap and transport\nproperties of 2D hybrid organic-inorganic halide perovskites using\nfirst-principles density functional theory. We show that the energetic\nstability is significantly enhanced by engineered perovskite heterostructures\nthat also possess excellent transport properties similar to their bulk\ncounterparts. These layered chemistries also demonstrate the advantage of a\nbroad range of tunable bandgaps and high-absorption coefficient in the visible\nspectrum. The proposed 2D heterostructured material holds potential for\nnano-optoelectronic devices as well as for effective photovoltaics.",
    "authors": [
      "Rahul Singh",
      "Prashant Singh",
      "Ganesh Balasubramania"
    ],
    "publication_date": "2021-08-17T03:46:35Z",
    "arxiv_id": "http://arxiv.org/abs/2108.07426v1",
    "download_url": "http://arxiv.org/abs/2108.07426v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Synthesis and Characterization of Superparamagnetic Iron Oxide\n  Nanoparticles: A Series of Laboratory Experiments",
    "abstract": "The following laboratory procedure provides students with a hands-on\nexperience in nanomaterials chemistry and characterization. This three-day\nprotocol is easy to follow for undergraduates with basic chemistry or materials\nscience backgrounds and is suitable for inclusion in upper division courses in\ninorganic chemistry or materials science. Students use air-free chemistry\nprocedures to synthesize and separate iron oxide magnetic nanoparticles and\nsubsequently modify the nanoparticle surface using a chemical stripping agent.\nThe morphology and chemical composition of the nanoparticles are characterized\nusing electron microscopy and dynamic light scattering measurements.\nAdditionally, magnetic characterization of the particles is performed using an\nopen-source (3D-printed), inexpensive magnetophotometer. Possible modifications\nto the synthesis procedure including the incorporation of dopants to modify the\nmagnetic response and alternative characterization techniques are discussed.\nThe three-day synthesis, purification, and characterization laboratory will\nprepare students with crucial skills for advanced technology industries such as\nsemiconductor manufacturing, nanomedicine, and green chemistry.",
    "authors": [
      "Armando D. Urbina",
      "Hari Sridhara",
      "Alexis Scholtz",
      "Andrea M. Armani"
    ],
    "publication_date": "2024-03-29T04:31:46Z",
    "arxiv_id": "http://arxiv.org/abs/2403.19970v1",
    "download_url": "http://arxiv.org/abs/2403.19970v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pentacene and Tetracene Molecules and Films on H/Si(111): Level\n  Alignment from Hybrid Density Functional Theory",
    "abstract": "The electronic properties of hybrid organic-inorganic semiconductor\ninterfaces depend strongly on the alignment of the electronic carrier levels in\nthe organic/inorganic components. In the present work, we address this energy\nlevel alignment from first principles theory for two paradigmatic\norganic-inorganic semiconductor interfaces, the singlet fission materials\ntetracene and pentacene on H/Si(111), using all-electron hybrid density\nfunctional theory. For isolated tetracene on H/Si(111), a type I-like\nheterojunction (lowest-energy electron and hole states on Si) is found. For\nisolated pentacene, the molecular and semiconductor valence band edges are\ndegenerate. For monolayer films, we show how to construct supercell geometries\nwith up to 1,192 atoms, which minimize the strain between the inorganic surface\nand an organic monolayer film. Based on these models, we predict the formation\nof type II heterojunctions (electron states on Si, hole-like states on the\norganic species) for both acenes, indicating that charge separation at the\ninterface between the organic and inorganic components is favored. The paper\ndiscusses the steps needed to find appropriate low-energy interface geometries\nfor weakly bonded organic molecules and films on inorganic substrates from\nfirst principles, a necessary prerequisite for any computational level\nalignment prediction.",
    "authors": [
      "Svenja M. Janke",
      "Mariana Rossi",
      "Sergey V. Levchenko",
      "Sebastian Kokott",
      "Matthias Scheffler",
      "Volker Blum"
    ],
    "publication_date": "2020-04-06T12:40:54Z",
    "arxiv_id": "http://arxiv.org/abs/2004.02617v2",
    "download_url": "http://arxiv.org/abs/2004.02617v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin-unrestricted self-energy embedding theory",
    "abstract": "We present a new theoretical approach, unrestricted self-energy embedding\ntheory (USEET) that is a Green's function embedding theory used to study\nproblems in which an open, embedded system exchanges electrons with the\nenvironment. USEET has a high potential to be used in studies of strongly\ncorrelated systems with odd number of electrons and open shell systems such as\ntransition metal complexes important in inorganic chemistry. In this paper, we\nshow that USEET results agree very well with common quantum chemistry methods\nwhile avoiding typical bottlenecks present in these method.",
    "authors": [
      "Tran Nguyen Lan",
      "Sergei Iskakov",
      "Dominika Zgid"
    ],
    "publication_date": "2018-06-05T22:11:23Z",
    "arxiv_id": "http://arxiv.org/abs/1806.01950v1",
    "download_url": "http://arxiv.org/abs/1806.01950v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Crystal Chemistry at High Pressure",
    "abstract": "An overview of the behavior of materials at high pressure is presented,\nstarting from the effects on single atoms driving electronic transitions and\nchanges in periodic trends. A range of high-pressure-induced phenomena in the\nsolid state are then discussed building on the atomic changes, including\nbizarre electronic structures, electrides, compounds of noble gases, changes in\nelemental miscibility, and strange structural and bonding configurations. In\nthe final section, the field of high pressure superconductivity is discussed,\nas high pressure phases have generated immense study and excitement as some of\ntheir critical superconducting temperatures approach room temperature.",
    "authors": [
      "Katerina P. Hilleke",
      "Eva Zurek"
    ],
    "publication_date": "2023-01-03T15:03:18Z",
    "arxiv_id": "http://arxiv.org/abs/2301.01139v1",
    "download_url": "http://arxiv.org/abs/2301.01139v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inorganic Catalyst Efficiency Prediction Based on EAPCR Model: A Deep\n  Learning Solution for Multi-Source Heterogeneous Data",
    "abstract": "The design of inorganic catalysts and the prediction of their catalytic\nefficiency are fundamental challenges in chemistry and materials science.\nTraditional catalyst evaluation methods primarily rely on machine learning\ntechniques; however, these methods often struggle to process multi-source\nheterogeneous data, limiting both predictive accuracy and generalization. To\naddress these limitations, this study introduces the\nEmbedding-Attention-Permutated CNN-Residual (EAPCR) deep learning model. EAPCR\nconstructs a feature association matrix using embedding and attention\nmechanisms and enhances predictive performance through permutated CNN\narchitectures and residual connections. This approach enables the model to\naccurately capture complex feature interactions across various catalytic\nconditions, leading to precise efficiency predictions. EAPCR serves as a\npowerful tool for computational researchers while also assisting domain experts\nin optimizing catalyst design, effectively bridging the gap between data-driven\nmodeling and experimental applications. We evaluate EAPCR on datasets from TiO2\nphotocatalysis, thermal catalysis, and electrocatalysis, demonstrating its\nsuperiority over traditional machine learning methods (e.g., linear regression,\nrandom forest) as well as conventional deep learning models (e.g., ANN, NNs).\nAcross multiple evaluation metrics (MAE, MSE, R2, and RMSE), EAPCR consistently\noutperforms existing approaches. These findings highlight the strong potential\nof EAPCR in inorganic catalytic efficiency prediction. As a versatile deep\nlearning framework, EAPCR not only improves predictive accuracy but also\nestablishes a solid foundation for future large-scale model development in\ninorganic catalysis.",
    "authors": [
      "Zhangdi Liu",
      "Ling An",
      "Mengke Song",
      "Zhuohang Yu",
      "Shan Wang",
      "Kezhen Qi",
      "Zhenyu Zhang",
      "Chichun Zhou"
    ],
    "publication_date": "2025-03-10T15:10:22Z",
    "arxiv_id": "http://arxiv.org/abs/2503.07424v1",
    "download_url": "http://arxiv.org/abs/2503.07424v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The intercalation chemistry of layered iron chalcogenide superconductors",
    "abstract": "The iron chalcogenides FeSe and FeS are superconductors composed of\ntwo-dimensional sheets held together by van der Waals interactions, which makes\nthem prime candidates for the intercalation of various guest species. We review\nthe intercalation chemistry of FeSe and FeS superconductors and discuss their\nsynthesis, structure, and physical properties. Before we review the latest work\nin this area, we provide a brief background on the intercalation chemistry of\nother inorganic materials that exhibit enhanced superconducting properties upon\nintercalation, which include the transition metal dichalcogenides, fullerenes,\nand layered cobalt oxides. From past studies of these intercalated\nsuperconductors, we discuss the role of the intercalates in terms of charge\ndoping, structural distortions, and Fermi surface reconstruction. We also\nbriefly review the physical and chemical properties of the host\nmaterials---mackinawite-type FeS and $\\beta$-FeSe. The three types of\nintercalates for the iron chalcogenides can be placed in three categories: 1.)\nalkali and alkaline earth cations intercalated through the liquid ammonia\ntechnique; 2.) cations intercalated with organic amines such as\nethylenediamine; and 3.) layered hydroxides intercalated during hydrothermal\nconditions. A recurring theme in these studies is the role of the intercalated\nguest in electron doping the chalcogenide host and in enhancing the\ntwo-dimensionality of the electronic structure by spacing the FeSe layers\napart. We end this review discussing possible new avenues in the intercalation\nchemistry of transition metal monochalcogenides, and the promise of these\nmaterials as a unique set of new inorganic two-dimensional systems.",
    "authors": [
      "Hector K. Vivanco",
      "Efrain E. Rodriguez"
    ],
    "publication_date": "2016-03-07T22:53:18Z",
    "arxiv_id": "http://arxiv.org/abs/1603.02334v1",
    "download_url": "http://arxiv.org/abs/1603.02334v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predicting Electronic Structure Properties of Transition Metal Complexes\n  with Neural Networks",
    "abstract": "High-throughput computational screening has emerged as a critical component\nof materials discovery. Direct density functional theory (DFT) simulation of\ninorganic materials and molecular transition metal complexes is often used to\ndescribe subtle trends in inorganic bonding and spin-state ordering, but these\ncalculations are computationally costly and properties are sensitive to the\nexchange-correlation functional employed. To begin to overcome these\nchallenges, we trained artificial neural networks (ANNs) to predict\nquantum-mechanically-derived properties, including spin-state ordering,\nsensitivity to Hartree-Fock exchange, and spin- state specific bond lengths in\ntransition metal complexes. Our ANN is trained on a small set of\ninorganic-chemistry-appropriate empirical inputs that are both maximally\ntransferable and do not require precise three-dimensional structural\ninformation for prediction. Using these descriptors, our ANN predicts\nspin-state splittings of single-site transition metal complexes (i.e., Cr-Ni)\nat arbitrary amounts of Hartree-Fock exchange to within 3 kcal/mol accuracy of\nDFT calculations. Our exchange-sensitivity ANN enables improved predictions on\na diverse test set of experimentally-characterized transition metal complexes\nby extrapolation from semi-local DFT to hybrid DFT. The ANN also outperforms\nother machine learning models (i.e., support vector regression and kernel ridge\nregression), demonstrating particularly improved performance in\ntransferability, as measured by prediction errors on the diverse test set. We\nestablish the value of new uncertainty quantification tools to estimate ANN\nprediction uncertainty in computational chemistry, and we provide additional\nheuristics for identification of when a compound of interest is likely to be\npoorly predicted by the ANN.",
    "authors": [
      "Jon Paul Janet",
      "Heather J. Kulik"
    ],
    "publication_date": "2017-02-19T17:33:22Z",
    "arxiv_id": "http://arxiv.org/abs/1702.05771v1",
    "download_url": "http://arxiv.org/abs/1702.05771v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The thermodynamic stability and hydration enthalpy of strontium cerate\n  doped by yttrium",
    "abstract": "The standard molar enthalpy of formation of SrY0.05Ce0.95O2.975 has been\nderived by combining the enthalpy of solution of this compound in 1 M HCl + 0.1\nKI obtained by us and auxiliary literature data. The following value has been\nderived: DfH (SrY0.05Ce0.95O2.975, s, 298.15 K) = -1720.4 (3.4) kJ/mol. The\nobtained value has been used to obtain the formation enthalpy of\nSrY0.05Ce0.95O2.975 from the mixture of binary oxides (DoxH (298.15 K) = -45.9\n(3.4) kJ/mol) and formation enthalpy of reaction of SrY0.05Ce0.95O2.975 with\nwater forming Sr(OH)2, CeO2, Y2O3 (DrH (298.15 K) = -85.5 (3.4) kJ/mol). Data\nobtained by solution calorimetry and additional information on the entropies of\ndifferent substances have shown that SrY0.05Ce0.95O2.975 is thermodynamically\nstable with respect to a mixture of SrO, Y2O3, CeO2 and that the reaction of\nSrY0.05Ce0.95O2.975 with water is thermodynamically favourable.",
    "authors": [
      "N. I. Matskevich",
      "Th. Wolf",
      "M. Yu. Matskevich"
    ],
    "publication_date": "2005-08-27T10:03:51Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0508654v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0508654v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effect of ligand substitution on the exchange interactions in\n  {Mn12}-type single-molecule magnets",
    "abstract": "We investigate how the ligand substitution affects the intra-molecular spin\nexchange interactions, studying a prototypal family of single-molecule magnets\ncomprising dodecanuclear cluster molecules [Mn12O12(COOR)16]. We identify a\nsimple scheme based on accumulated Pauling electronegativity numbers (a.e.n.)\nof the carboxylate ligand groups (R). The redistribution of the electron\ndensity, controlled by a.e.n. of a ligand, changes the degree of hybridization\nbetween 3d electrons of manganese and 2p electrons of oxygen atoms, thus\nchanging the exchange interactions. This scheme, despite its conceptual\nsimplicity, provides a strong correlation with the exchange energies associated\nwith carboxylate bridges, and is confirmed by the electronic structure\ncalculations taking into account the Coulomb correlations in magnetic\nmolecules.",
    "authors": [
      "D. W. Boukhvalov",
      "V. V. Dobrovitski",
      "P. Kögerler",
      "M. Al-Saqer",
      "M. I. Katsnelson",
      "A. I. Lichtenstein",
      "B. N. Harmon"
    ],
    "publication_date": "2010-10-07T03:35:09Z",
    "arxiv_id": "http://arxiv.org/abs/1010.1319v1",
    "download_url": "http://arxiv.org/abs/1010.1319v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spectroscopic, Structural, and Theoretical Studies of Halide Complexes\n  with a Urea-based Tripodal Receptor",
    "abstract": "A urea-based tripodal receptor L substituted with p-cyanophenyl groups has\nbeen studied for halide anions by $^1$H NMR spectroscopy, density functional\ntheory (DFT) calculations and X-ray crystallography. The $^1$H NMR titration\nstudies suggest that the receptor forms a 1:1 complex with an anion, showing\nthe binding trend in the order of fluoride > chloride > bromide > iodide. The\ninteraction of fluoride anion with the receptor was further confirmed by 2D\nNOESY and $^{19}$F NMR spectroscopy in DMSO-d$_6$. DFT calculations indicate\nthat the internal halide anion is held by six NH...X interactions with L,\nshowing the highest binding energy for the fluoride complex. Structural\ncharacterization of the chloride, bromide, and silicon hexafluoride complexes\nof $[LH^+]$ reveals that the anion is externally located via hydrogen bonding\ninteractions. For the bromide or chloride complex, two anions are bridged with\ntwo receptors to form a centrosymmetric dimer, while for the silicon\nhexafluoride complex, the anion is located within a cage formed by six ligands\nand two water molecules.",
    "authors": [
      "Avijit Pramanik",
      "Douglas R. Powell",
      "Bryan M. Wong",
      "Md. Alamgir Hossain"
    ],
    "publication_date": "2013-12-21T21:32:45Z",
    "arxiv_id": "http://arxiv.org/abs/1312.6306v1",
    "download_url": "http://arxiv.org/abs/1312.6306v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Synthesis and properties of SmO0.5F0.5BiS2 and enhancement in Tc in\n  La1-ySmyO0.5F0.5BiS2",
    "abstract": "Crystal structure and properties of a new member of oxy-bismuth-sulfide\nSmO1-xFxBiS2 are reported here. The compounds SmO1-xFxBiS2 (x = 0.0 and 0.5)\nare found to be isostructural with LaOBiS2 and crystallize in the CeOBiS2 type\nstructure (P4/nmm). Sm substitution in LaO0.5F0.5BiS2, (La1-ySmyO0.5F0.5BiS2),\nleads to a gradual decrease in a-lattice constant however the c-lattice\nconstant does not show such a gradual trend. Enhancement in Tc is achieved upon\npartially substituting La by smaller Sm ion. Maximum Tc ~ 4.6 K was observed\nfor composition with y = 0.8. Disobeying this trend Tc disappears unexpectedly\nin composition SmO0.5F0.5BiS2 (y = 1.0). Both the undoped and F-doped (x = 0.0\nand 0.5) compounds are paramagnetic exhibiting semiconducting behavior down to\n2 K.",
    "authors": [
      "Gohil S. Thakur",
      "G. Kalai Selvan",
      "Zeba Haque",
      "L. C. Gupta",
      "S. L. Samal",
      "S. Arumugam",
      "Ashok K. Ganguli"
    ],
    "publication_date": "2014-10-03T04:59:19Z",
    "arxiv_id": "http://arxiv.org/abs/1410.0751v2",
    "download_url": "http://arxiv.org/abs/1410.0751v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Map of the Inorganic Ternary Metal Nitrides",
    "abstract": "Exploratory synthesis in novel chemical spaces is the essence of solid-state\nchemistry. However, uncharted chemical spaces can be difficult to navigate,\nespecially when materials synthesis is challenging. Nitrides represent one such\nspace, where stringent synthesis constraints have limited the exploration of\nthis important class of functional materials. Here, we employ a suite of\ncomputational materials discovery and informatics tools to construct a large\nstability map of the inorganic ternary metal nitrides. Our map clusters the\nternary nitrides into chemical families with distinct stability and\nmetastability, and highlights hundreds of promising new ternary nitride spaces\nfor experimental investigation--from which we experimentally realized 7 new Zn-\nand Mg-based ternary nitrides. By extracting the mixed metallicity, ionicity,\nand covalency of solid-state bonding from the DFT-computed electron density, we\nreveal the complex interplay between chemistry, composition, and electronic\nstructure in governing large-scale stability trends in ternary nitride\nmaterials.",
    "authors": [
      "Wenhao Sun",
      "Christopher Bartel",
      "Elisabetta Arca",
      "Sage Bauers",
      "Bethany Matthews",
      "Bernardo Orvañanos",
      "Bor-Rong Chen",
      "Michael F. Toney",
      "Laura T. Schelhas",
      "William Tumas",
      "Janet Tate",
      "Andriy Zakutayev",
      "Stephan Lany",
      "Aaron Holder",
      "Gerbrand Ceder"
    ],
    "publication_date": "2018-09-24T20:14:33Z",
    "arxiv_id": "http://arxiv.org/abs/1809.09202v1",
    "download_url": "http://arxiv.org/abs/1809.09202v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An appraisal of Understanding Pressure Effects on Structural, Optical,\n  and Magnetic Properties of CsMnF_{4} and Other 3d^{n} Compounds",
    "abstract": "A recently published article in Inorganic Chemistry (DOI:\n10.1021/acs.inorgchem.4c00599) offers theoretical calculations on the effects\nof pressure on the structural, optical, and magnetic behavior of CsMnF_{4}.\nAlthough a thorough theoretical and experimental understanding of this material\nis certainly warranted, there are previously published experimental results on\nCsMnF_{4}, as well as on other Mn^{3+} fluorides, under pressure that have not\nbeen considered in the aforementioned article. These findings raise questions\nabout the accuracy of the theoretical estimates and the validity of the\nmethodology used to determine the reported structural, optical, and magnetic\nproperties. This paper intends to provide the readers of Inorganic Chemistry\nand the broader scientific community with a perspective on a publication that\ndirectly contradicts interpretations presented in prior research.",
    "authors": [
      "Fernando Rodriguez"
    ],
    "publication_date": "2025-03-27T12:41:59Z",
    "arxiv_id": "http://arxiv.org/abs/2503.21451v1",
    "download_url": "http://arxiv.org/abs/2503.21451v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "CHILI: Chemically-Informed Large-scale Inorganic Nanomaterials Dataset\n  for Advancing Graph Machine Learning",
    "abstract": "Advances in graph machine learning (ML) have been driven by applications in\nchemistry as graphs have remained the most expressive representations of\nmolecules. While early graph ML methods focused primarily on small organic\nmolecules, recently, the scope of graph ML has expanded to include inorganic\nmaterials. Modelling the periodicity and symmetry of inorganic crystalline\nmaterials poses unique challenges, which existing graph ML methods are unable\nto address. Moving to inorganic nanomaterials increases complexity as the scale\nof number of nodes within each graph can be broad ($10$ to $10^5$). The bulk of\nexisting graph ML focuses on characterising molecules and materials by\npredicting target properties with graphs as input. However, the most exciting\napplications of graph ML will be in their generative capabilities, which is\ncurrently not at par with other domains such as images or text.\n  We invite the graph ML community to address these open challenges by\npresenting two new chemically-informed large-scale inorganic (CHILI)\nnanomaterials datasets: A medium-scale dataset (with overall >6M nodes, >49M\nedges) of mono-metallic oxide nanomaterials generated from 12 selected crystal\ntypes (CHILI-3K) and a large-scale dataset (with overall >183M nodes, >1.2B\nedges) of nanomaterials generated from experimentally determined crystal\nstructures (CHILI-100K). We define 11 property prediction tasks and 6 structure\nprediction tasks, which are of special interest for nanomaterial research. We\nbenchmark the performance of a wide array of baseline methods and use these\nbenchmarking results to highlight areas which need future work. To the best of\nour knowledge, CHILI-3K and CHILI-100K are the first open-source nanomaterial\ndatasets of this scale -- both on the individual graph level and of the dataset\nas a whole -- and the only nanomaterials datasets with high structural and\nelemental diversity.",
    "authors": [
      "Ulrik Friis-Jensen",
      "Frederik L. Johansen",
      "Andy S. Anker",
      "Erik B. Dam",
      "Kirsten M. Ø. Jensen",
      "Raghavendra Selvan"
    ],
    "publication_date": "2024-02-20T18:32:27Z",
    "arxiv_id": "http://arxiv.org/abs/2402.13221v2",
    "download_url": "http://arxiv.org/abs/2402.13221v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Resolving transition metal chemical space: feature selection for machine\n  learning and structure-property relationships",
    "abstract": "Machine learning (ML) of quantum mechanical properties shows promise for\naccelerating chemical discovery. For transition metal chemistry where accurate\ncalculations are computationally costly and available training data sets are\nsmall, the molecular representation becomes a critical ingredient in ML model\npredictive accuracy. We introduce a series of revised autocorrelation functions\n(RACs) that encode relationships between the heuristic atomic properties (e.g.,\nsize, connectivity, and electronegativity) on a molecular graph. We alter the\nstarting point, scope, and nature of the quantities evaluated in standard ACs\nto make these RACs amenable to inorganic chemistry. On an organic molecule set,\nwe first demonstrate superior standard AC performance to other\npresently-available topological descriptors for ML model training, with mean\nunsigned errors (MUEs) for atomization energies on set-aside test molecules as\nlow as 6 kcal/mol. For inorganic chemistry, our RACs yield 1 kcal/mol ML MUEs\non set-aside test molecules in spin-state splitting in comparison to 15-20x\nhigher errors from feature sets that encode whole-molecule structural\ninformation. Systematic feature selection methods including univariate\nfiltering, recursive feature elimination, and direct optimization (e.g., random\nforest and LASSO) are compared. Random-forest- or LASSO-selected subsets 4-5x\nsmaller than RAC-155 produce sub- to 1-kcal/mol spin-splitting MUEs, with good\ntransferability to metal-ligand bond length prediction (0.004-5 {\\AA} MUE) and\nredox potential on a smaller data set (0.2-0.3 eV MUE). Evaluation of feature\nselection results across property sets reveals the relative importance of\nlocal, electronic descriptors (e.g., electronegativity, atomic number) in\nspin-splitting and distal, steric effects in redox potential and bond lengths.",
    "authors": [
      "Jon Paul Janet",
      "Heather J. Kulik"
    ],
    "publication_date": "2017-08-20T20:48:54Z",
    "arxiv_id": "http://arxiv.org/abs/1708.06017v1",
    "download_url": "http://arxiv.org/abs/1708.06017v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dominant aerosol processes during high-pollution episodes over Greater\n  Tokyo",
    "abstract": "This paper studies two high-pollution episodes over Greater Tokyo: 9 and 10\nDecember 1999, and 31 July and 1 August 2001. Results obtained with the\nchemistry-transport model (CTM) Polair3D are compared to measurements of\ninorganic PM2.5. To understand to which extent the aerosol processes modeled in\nPolair3D impact simulated inorganic PM2.5, Polair3D is run with different\noptions in the aerosol module, e.g. with/without heterogeneous reactions. To\nquantify the impact of processes outside the aerosol module, simulations are\nalso done with another CTM (CMAQ). In the winter episode, sulfate is mostly\nimpacted by condensation, coagulation, long-range transport, and deposition to\na lesser extent. In the summer episode, the effect of long-range transport\nlargely dominates. The impact of condensation/evaporation is dominant for\nammonium, nitrate and chloride in both episodes. However, the impact of the\nthermodynamic equilibrium assumption is limited. The impact of heterogeneous\nreactions is large for nitrate and ammonium, and taking heterogeneous reactions\ninto account appears to be crucial in predicting the peaks of nitrate and\nammonium. The impact of deposition is the same for all inorganic PM2.5. It is\nsmall compared to the impact of other processes although it is not negligible.\nThe impact of nucleation is negligible in the summer episode, and small in the\nwinter episode. The impact of coagulation is larger in the winter episode than\nin the summer episode, because the number of small particles is higher in the\nwinter episode as a consequence of nucleation.",
    "authors": [
      "Karine Sartelet",
      "Hiroshi Hayami",
      "Bruno Sportisse"
    ],
    "publication_date": "2007-05-15T15:34:54Z",
    "arxiv_id": "http://arxiv.org/abs/0705.2172v1",
    "download_url": "http://arxiv.org/abs/0705.2172v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular-Level Switching of Polymer/Nanocrystal Non-Covalent\n  Interactions and Application in Hybrid Solar Cells",
    "abstract": "Hy brid composites obtained upon blending conjugated polymers and colloidal\ninorganic semiconductor nanocrystals are regarded as attractive photo-active\nmaterials for optoelectronic applications. Here we demonstrate that tailoring\nnanocrystal surface chemistry permits to exert control on non-covalent bonding\nand electronic interactions between organic and inorganic components. The\npendant moieties of organic ligands at the nanocrystal surface do not merely\nconfer colloidal stability while hindering charge separation and transport, but\ndrastically impact morphology of hybrid composites during formation from blend\nsolutions. The relevance of our approach to photovoltaic applications is\ndemonstrated for composites based on poly(3-hexylthiophene) and Pbs\nnanocrystals, considered as inadequate before the submission of this\nmanuscript, which enable the fabrication of hybrid solar cells displaying a\npower conversion efficiency that reaches 3 %. Upon (quasi)steady-state and\ntime-resolved analisys of the photo-induced processes in the nanocomposites and\ntheir organic and inorganic components, we ascertained that electron transfer\noccurs at the hybrid interface yielding long-lived separated charge carriers,\nwhereas interfacial hole transfer appears slow. Here we provide a reliable\nalternative aiming at gaining control over macroscopic optoelectronic\nproperties of polymer/nanocrystal composites by acting at the molecular-level\nvia ligands' pendant moieties, thus opening new possibilities towards efficient\nsolution-processed hybrid solar cells.",
    "authors": [
      "Carlo Giansante",
      "Rosanna Mastria",
      "Giovanni Lerario",
      "Luca Moretti",
      "Ilka Kriegel",
      "Francesco Scotognella",
      "Guglielmo Lanzani",
      "Sonia Carallo",
      "Marco Esposito",
      "Mariano Biasiucci",
      "Aurora Rizzo",
      "Giuseppe Gigli"
    ],
    "publication_date": "2013-12-21T11:16:52Z",
    "arxiv_id": "http://arxiv.org/abs/1312.6240v2",
    "download_url": "http://arxiv.org/abs/1312.6240v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structural chirality and related properties in the periodic inorganic\n  solids: Review and perspectives",
    "abstract": "Chirality refers to the asymmetry of objects that cannot be superimposed on\ntheir mirror image. It is a concept that exists in various scientific fields\nand has profound consequences. Although these are perhaps most widely\nrecognized within biology, chemistry, and pharmacology, recent advances in\nchiral phonons, topological systems, crystal enantiomorphic materials, and\nmagneto-chiral materials have brought this topic to the forefront of condensed\nmatter physics research. Our review discusses the symmetry requirements and the\nfeatures associated with structural chirality in inorganic materials. This\nallows us to explore the nature of phase transitions in these systems, the\ncoupling between order parameters, and their impact on the material's physical\nproperties. We highlight essential contributions to the field, particularly\nrecent progress in the study of chiral phonons, altermagnetism,\nmagnetochirality between others. Despite the rarity of naturally occurring\ninorganic chiral crystals, this review also highlights a significant knowledge\ngap, presenting challenges and opportunities for structural chirality mostly at\nthe fundamental level, e.g., chiral displacive phase transitions and\nferrochirality, possibilities of tuning and switching structural chirality by\nexternal means (electric, magnetic, or strain fields), whether chirality could\nbe an independent order parameter, and whether structural chirality could be\nquantified, etc. Beyond simply summarising this field of research, this review\naims to inspire further research in materials science by addressing future\nchallenges, encouraging the exploration of chirality beyond traditional\nboundaries, and seeking the development of innovative materials with superior\nor new properties.",
    "authors": [
      "Eric Bousquet",
      "Mauro Fava",
      "Zachary Romestan",
      "Fernando Gómez-Ortiz",
      "Emma E. McCabe",
      "Aldo H. Romero"
    ],
    "publication_date": "2024-06-20T19:17:50Z",
    "arxiv_id": "http://arxiv.org/abs/2406.14684v1",
    "download_url": "http://arxiv.org/abs/2406.14684v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Polar octahedral rotations: a path to new multifunctional materials",
    "abstract": "Perovskite ABO$_3$ oxides display an amazing variety of phenomena that can be\naltered by subtle changes in the chemistry and internal structure, making them\na favorite class of materials to explore the rational design of novel\nproperties. Here we highlight a recent advance in which rotations of the BO$_6$\noctahedra give rise to a novel form of ferroelectricity -- hybrid improper\nferroelectricity. Octahedral rotations also strongly influence other\nstructural, magnetic, orbital, and electronic degrees of freedom in perovskites\nand related materials. Octahedral rotation-driven ferroelectricity consequently\nhas the potential to robustly control emergent phenomena with an applied\nelectric field. The concept of `functional' octahedral rotations is introduced\nand the challenges for materials chemistry and the possibilities for new\nrotation-driven phenomena in multifunctional materials are explored.",
    "authors": [
      "Nicole A. Benedek",
      "Andrew T. Mulder",
      "Craig J. Fennie"
    ],
    "publication_date": "2011-08-15T01:44:10Z",
    "arxiv_id": "http://arxiv.org/abs/1108.2915v2",
    "download_url": "http://arxiv.org/abs/1108.2915v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "There's Plenty of Surface at the Bottom: Surface Chemistry Enhances\n  Light Absorption by Colloidal Semiconductor Nanocrystals",
    "abstract": "The paraphrasis of Feynman's statement is used to highlight the inherent\nrelevance of surfaces -- and interfaces -- at the nanoscale. Here, the marked\nimpact of the surface chemistry on the light absorption by colloidal inorganic\nsemiconductor nanocrystals is discussed and demonstrated as general. Chemical\nspecies at the surface (ligands) of colloidal metal chalcogenide quantum dots\n(QDs) are shown to induce broadband absorption enhancement and band gap\nreduction. A comprehensive library of chalcogenol(ate) ligands is exploited to\ninfer the role of surface chemistry on the QD optical absorption properties:\nligand chalcogen binding atoms mainly determine band gap reduction, related to\nnp occupied orbital contribution to the valence band edge, and mediates\nbroadband absorption enhancement, fostered by the conjugation of the ligand\npendant moiety, with further contribution from electron donor substituents.\nThese findings point to a description of colloidal QDs that may conceive\nligands as part of the overall QD electronic structure, beyond common models\nderived from analogies with core/shell heterostructures depicting ligands as\nmere perturbation to the core properties.",
    "authors": [
      "Carlo Giansante"
    ],
    "publication_date": "2018-12-17T08:51:09Z",
    "arxiv_id": "http://arxiv.org/abs/1812.06652v1",
    "download_url": "http://arxiv.org/abs/1812.06652v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Las ondas viajeras son los ojos nuevos de la resonancia en medicina",
    "abstract": "Magnetic Resonance Imaging is one of the most versatile experimental\ntechniques in chemistry, physics and biology, providing insight into the\nstructure and dynamics of matter at the molecular scale. A group led by Klaas\nPruessmann at ETH Zurich (Brunner, D.O. et al. Travelling-wave nuclear magnetic\nresonance. Nature 457;994:2009) has now demonstrated an alternative approach\nthat radically departs from the conventional view of MRI as a near-field,\ninductive technique. This approach also required that radiofre-quency wave is\npropagated from an antenna positioned at one end of the cylindrical magnet;\nthis wave travels through the specimen within the bore of the magnet, producing\nsignals that are received either by the same antenna or by another one\npositioned at the opposite end. The resulting instrument considerably extends\nthe scale of imaging possible with Magnetic Resonance Imaging, and initial\ntests demonstrated uniform high-field imaging of a variety of samples, both\ninorganic and inorganic.",
    "authors": [
      "A. O. Rodriguez",
      "S. S. Hidalgo"
    ],
    "publication_date": "2009-07-14T23:12:44Z",
    "arxiv_id": "http://arxiv.org/abs/0907.2446v1",
    "download_url": "http://arxiv.org/abs/0907.2446v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structural characterization of APPJ treated Bismaleimide coatings and\n  heat treated Titania-BMI",
    "abstract": "Bismaleimide (BMI) are thermosetting polymers mainly used in aerospace\napplications having properties of dimensional stability, low shrinkage,\nchemical resistance, fire resistance, good mechanical properties and high\nresistance against various solvents, acids, and water. BMI is commercially\navailable as Homide 250. BMI coating has also been used for the corrosion\nprotection. Metallization (AL) of BMI using vacuum evaporation was done which\nserves the purpose of prevention of space charge accumulation in aircraft\nbodies. Addition of inorganic materials like metal oxides can influence the\nproperties of the polymer as an inorganic-organic composite. The\norganic-ionorganic composites have wide applications in electronics, optics,\nchemistry and medicine. Titanium dioxide (TiO2, Titania) has a wide range of\napplications starting from photocatalysis, dye-sensitized solar cells to\noptical coatings and electronics. A BMI-TiO2 composite was prepared by chemical\nroute. Atmospheric Plasma Jet (APPJ) using Helium gas was also treated on BMI.\nXRD and FTIR studies of the composite system prepared at different temperatures\nshowed its crystalline and structural configuration.",
    "authors": [
      "S. Shrinidhi",
      "S. Suman",
      "A. Shah",
      "P. Prabhakar",
      "A. Chaurasia A. Kumar",
      "K. G. Chauhan",
      "A. S. Bhattacharyya"
    ],
    "publication_date": "2016-04-06T07:33:29Z",
    "arxiv_id": "http://arxiv.org/abs/1604.07297v1",
    "download_url": "http://arxiv.org/abs/1604.07297v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Discovering Inorganic Electrides from an Automated Computational\n  Screening",
    "abstract": "Electrides, with their excess electrons distributed in crystal cavities\nplaying the role of anions, exhibit a variety of unique properties which make\nthese materials desirable for many applications in catalysis, nonlinear optics\nand electron emission. While the first electride was discovered almost four\ndecades ago, only few electride materials are known today, which limits our\nfundamental understanding as well as the practical use of these exotic\nmaterials. In this work, we propose an automated computational screening scheme\nto search for interstitial electrons and quantify their distributions inside\nthe crystal cavities and energy space. Applying this scheme to all candidate\nmaterials in the Inorganic Crystal Structure Database (ICSD), we report the\nidentification of 167 potential electride materials. This work significantly\nincreases the current library of electride materials, which enables an in-depth\ninvestigation of their chemistry-structure-property relations and opens new\navenues for future electride design.",
    "authors": [
      "Qiang Zhu",
      "Timofey Frolov",
      "Kamal Choudhary"
    ],
    "publication_date": "2018-12-15T02:25:52Z",
    "arxiv_id": "http://arxiv.org/abs/1812.06222v3",
    "download_url": "http://arxiv.org/abs/1812.06222v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Learning formation energy of inorganic compounds using matrix variate\n  deep Gaussian process",
    "abstract": "Future advancement of engineering applications is dependent on design of\nnovel materials with desired properties. Enormous size of known chemical space\nnecessitates use of automated high throughput screening to search the desired\nmaterial. The high throughput screening uses quantum chemistry calculations to\npredict material properties, however, computational complexity of these\ncalculations often imposes prohibitively high cost on the search for desired\nmaterial. This critical bottleneck is resolved by using deep machine learning\nto emulate the quantum computations. However, the deep learning algorithms\nrequire a large training dataset to ensure an acceptable generalization, which\nis often unavailable a-priory. In this paper, we propose a deep Gaussian\nprocess based approach to develop an emulator for quantum calculations. We\nfurther propose a novel molecular descriptor that enables implementation of the\nproposed approach. As demonstrated in this paper, the proposed approach can be\nimplemented using a small dataset. We demonstrate efficacy of our approach for\nprediction of formation energy of inorganic molecules.",
    "authors": [
      "Saket Mishra",
      "Piyush Tagade"
    ],
    "publication_date": "2018-12-22T17:08:42Z",
    "arxiv_id": "http://arxiv.org/abs/1901.06016v2",
    "download_url": "http://arxiv.org/abs/1901.06016v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Water Adsorption in Soft and Heterogeneous Nanopores",
    "abstract": "Liquids under confinement differ in behavior from their bulk counterparts and\ncan acquire properties that are specific to the confined phase and linked to\nthe nature and structure of the host matrix. While confined liquid water is not\na new topic of research, the past few years have seen a series of intriguing\nnovel features for water inside nanoscale pores. These unusual properties arise\nfrom the very specific nature of nanoporous materials: termed \"soft porous\ncrystals\", they combine large-scale flexibility with a heterogeneous internal\nsurface. This creates a rich diversity of behavior for the adsorbed water, and\nthe combination of different experimental characterization techniques along\nwith computational chemistry at various scales is necessary to understand the\nphenomena observed, and their microscopic origins. The range of systems of\ninterest span the whole chemical range, from the inorganic (zeolites,\nimogolites) to the organic (microporous carbons, graphene and its derivatives)\nand even encompass the hybrid organic--inorganic systems (such as\nmetal--organic frameworks).",
    "authors": [
      "François-Xavier Coudert"
    ],
    "publication_date": "2020-04-17T11:58:57Z",
    "arxiv_id": "http://arxiv.org/abs/2004.08192v2",
    "download_url": "http://arxiv.org/abs/2004.08192v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hydrogen-bond-mediated structural variation of metal guanidinium formate\n  hybrid perovskites with unit cell volume",
    "abstract": "The hybrid perovskites are coordination frameworks with the same topology as\nthe inorganic perovskites, but with properties driven by different chemistry,\nincluding host-framework hydrogen bonding. Like the inorganic perovskites,\nthese materials exhibit many different phases, including structures with\npotentially exploitable functionality. However, far less is known about their\nbehaviour under pressure. We have studied the structures of of manganese and\ncobalt guanidinium formate under pressure using single-crystal X-ray and powder\nneutron diffraction. Remarkably, when pressure reduces these materials' volume,\nthey transform to a phase isostructural to cadmium guanidinium formate, which\nhas an larger volume. Using DFT calculations, we show that this\ncounterintuitive behaviour depends on the hydrogen-bonded network of\nguanidinium ions, which act as struts protecting the metal formate framework\nagainst compression. Our results demonstrate more generally that engineering\ndesirable crystal structures in the hybrid perovskites will depend on achieving\nsuitable host-guest hydrogen-bonding geometries.",
    "authors": [
      "Zhengqiang Yang",
      "Guanqun Cai",
      "Craig L. Bull",
      "Matthew G. Tucker",
      "Martin T. Dove",
      "Alexandra Friedrich",
      "Anthony E. Phillips"
    ],
    "publication_date": "2018-08-22T12:08:45Z",
    "arxiv_id": "http://arxiv.org/abs/1808.07326v1",
    "download_url": "http://arxiv.org/abs/1808.07326v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Assembling Inorganic Nanocrystal Gels",
    "abstract": "Inorganic nanocrystal gels retain distinct properties of individual\nnanocrystals while offering tunable, network structure-dependent\ncharacteristics. We review different mechanisms for assembling gels from\ncolloidal nanocrystals including (1) controlled destabilization, (2) direct\nbridging, (3) depletion, as well as linking mediated by (4) coordination\nbonding or (5) dynamic covalent bonding, and we highlight how each impacts gel\nproperties. These approaches use nanocrystal surface chemistry or the addition\nof small molecules to mediate inter-nanocrystal attractions. Each method offers\nadvantages in terms of gel stability, reversibility, or tunability and presents\nnew opportunities for design of reconfigurable materials and fueled assemblies.",
    "authors": [
      "Allison M. Green",
      "Charles K. Ofosu",
      "Jiho Kang",
      "Eric V. Anslyn",
      "Thomas M. Truskett",
      "Delia J. Milliron"
    ],
    "publication_date": "2021-12-10T19:05:06Z",
    "arxiv_id": "http://arxiv.org/abs/2112.05778v1",
    "download_url": "http://arxiv.org/abs/2112.05778v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]