[
  {
    "title": "Static and Dynamic Disorder in Formamidinium Lead Bromide Single\n  Crystals",
    "abstract": "We show that formamidinium lead bromide is unique among the halide perovskite\ncrystals because its inorganic sub-lattice exhibits intrinsic local static\ndisorder that co-exists with a well-defined average crystal structure. Our\nstudy combines THz-range Raman-scattering with single-crystal X-ray diffraction\nand first-principles calculations to probe the inorganic sub-lattice dynamics\nevolution with temperature in the range of 10-300 K. The temperature evolution\nof the Raman spectra shows that low-temperature, local static disorder strongly\naffects the crystal's structural dynamics and phase transitions at higher\ntemperatures.",
    "authors": [
      "Guy Reuveni",
      "Yael Diskin-Posner",
      "Christian Gehrmann",
      "Shravan Godse",
      "Giannis G. Gkikas",
      "Isaac Buchine",
      "Sigalit Aharon",
      "Roman Korobko",
      "Constantinos C. Stoumpos",
      "David A. Egger",
      "Omer Yaffe"
    ],
    "publication_date": "2022-11-13T13:40:25Z",
    "arxiv_id": "http://arxiv.org/abs/2211.06904v1",
    "download_url": "http://arxiv.org/abs/2211.06904v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Navigating phase diagram complexity to guide robotic inorganic materials\n  synthesis",
    "abstract": "Efficient synthesis recipes are needed both to streamline the manufacturing\nof complex materials and to accelerate the realization of theoretically\npredicted materials. Oftentimes the solid-state synthesis of multicomponent\noxides is impeded by undesired byproduct phases, which can kinetically trap\nreactions in an incomplete non-equilibrium state. We present a thermodynamic\nstrategy to navigate high-dimensional phase diagrams in search of precursors\nthat circumvent low-energy competing byproducts, while maximizing the reaction\nenergy to drive fast phase transformation kinetics. Using a robotic inorganic\nmaterials synthesis laboratory, we perform a large-scale experimental\nvalidation of our precursor selection principles. For a set of 35 target\nquaternary oxides with chemistries representative of intercalation battery\ncathodes and solid-state electrolytes, we perform 224 reactions spanning 27\nelements with 28 unique precursors. Our predicted precursors frequently yield\ntarget materials with higher phase purity than when starting from traditional\nprecursors. Robotic laboratories offer an exciting new platform for data-driven\nexperimental science, from which we can develop new insights into materials\nsynthesis for both robot and human chemists.",
    "authors": [
      "Jiadong Chen",
      "Samuel R. Cross",
      "Lincoln J. Miara",
      "Jeong-Ju Cho",
      "Yan Wang",
      "Wenhao Sun"
    ],
    "publication_date": "2023-04-03T06:33:40Z",
    "arxiv_id": "http://arxiv.org/abs/2304.00743v2",
    "download_url": "http://arxiv.org/abs/2304.00743v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Kernel Learning Assisted Synthesis Condition Exploration for Ternary\n  Spinel",
    "abstract": "Machine learning and high-throughput experimentation have greatly accelerated\nthe discovery of mixed metal oxide catalysts by leveraging their compositional\nflexibility. However, the lack of established synthesis routes for solid-state\nmaterials remains a significant challenge in inorganic chemistry. An\ninterpretable machine learning model is therefore essential, as it provides\ninsights into the key factors governing phase formation. Here, we focus on the\nformation of single-phase Fe$_2$(ZnCo)O$_4$, synthesized via a high-throughput\nco-precipitation method. We combined a kernel classification model with a novel\napplication of global SHAP analysis to pinpoint the experimental features most\ncritical to single phase synthesizability by interpreting the contributions of\neach feature. Global SHAP analysis reveals that precursor and precipitating\nagent contributions to single-phase spinel formation align closely with\nestablished crystal growth theories. These results not only underscore the\nimportance of interpretable machine learning in refining synthesis protocols\nbut also establish a framework for data-informed experimental design in\ninorganic synthesis.",
    "authors": [
      "Yutong Liu",
      "Mehrad Ansari",
      "Robert Black",
      "Jason Hattrick-Simpers"
    ],
    "publication_date": "2025-03-25T13:28:10Z",
    "arxiv_id": "http://arxiv.org/abs/2503.19637v1",
    "download_url": "http://arxiv.org/abs/2503.19637v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tuning Nonradiative Recombination via Cation Substitution in Inorganic\n  Antiperovskite Nitrides",
    "abstract": "Inorganic antiperovskite nitrides have recently emerged as promising\nmaterials for photovoltaic applications, yet their nonradiative recombination\ndynamics remain largely unexplored. Here, we examine the influence of X-site\ncation substitution on the nonradiative electron-hole recombination in\n$\\mathrm{X_{3}NSb}$ ($X = \\mathrm{Ca}, \\mathrm{Sr}, \\mathrm{Ba}$). Ca- and\nSr-based compounds adopt a cubic phase, whereas Ba stabilizes in a hexagonal\nstructure, introducing pronounced symmetry-driven effects. Substituting Ca with\nSr narrows the band gap, suppresses octahedral and band-edge fluctuations,\nreduces nonadiabatic (NA) coupling by $\\sim 54\\%$, and extends carrier\nlifetimes by a factor of $2.5$. In contrast, Ba substitution increases lattice\ndistortion, widens the band gap, and enhances NA coupling beyond that of\n$\\mathrm{Sr_{3}NSb}$, thereby accelerating recombination through stronger\nlattice fluctuations. The resulting band gap fluctuations in\n$\\mathrm{Ba_{3}NSb}$ also shorten decoherence times, following the trend\n$\\mathrm{Ba_{3}NSb} < \\mathrm{Ca_{3}NSb} < \\mathrm{Sr_{3}NSb}$. Our results\ndemonstrate how the interplay between band gap, NA coupling, and decoherence\ntime governs recombination lifetimes, with $\\mathrm{Sr_{3}NSb}$ exhibiting the\nlongest lifetime. These findings highlight the coupled influence of cation\nchemistry and crystal symmetry in tailoring carrier dynamics for\nhigh-performance antiperovskite-based optoelectronics materials.",
    "authors": [
      "Sanchi Monga",
      "Saswata Bhattacharya"
    ],
    "publication_date": "2025-09-04T18:51:06Z",
    "arxiv_id": "http://arxiv.org/abs/2509.04611v1",
    "download_url": "http://arxiv.org/abs/2509.04611v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Monte Carlo study of temperature-programmed desorption spectra with\n  attractive lateral interactions",
    "abstract": "We present results of a Monte Carlo study of temperature-programmed\ndesorption in a model system with attractive lateral interactions. It is shown\nthat even for weak interactions there are large shifts of the peak maximum\ntemperatures with initial coverage. The system has a transition temperature\nbelow which the desorption has a negative order. An analytical expression for\nthis temperature is derived. The relation between the model and real systems is\ndiscussed.",
    "authors": [
      "A. P. J. Jansen"
    ],
    "publication_date": "1995-02-20T11:48:35Z",
    "arxiv_id": "http://arxiv.org/abs/chem-ph/9502009v2",
    "download_url": "http://arxiv.org/abs/chem-ph/9502009v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Variation of Fractal Properties of Two-Component Systems in Their\n  Evolution Process",
    "abstract": "Analysis of experimental kinetic dependences and results of the computer\nmodeling of pairwise interactions in the heterogeneous system have shown that a\ncharacter of its fractal property variation in the evolution process would be\ndifferent at distinguished temperature ranges and dependent on the proportion\nof reagent concentrations and their initial distribution type.",
    "authors": [
      "K. S. Baktybekov",
      "S. G. Karstina",
      "E. N. Vertyagina",
      "A. A. Baratova"
    ],
    "publication_date": "2006-06-03T10:45:10Z",
    "arxiv_id": "http://arxiv.org/abs/nlin/0606013v1",
    "download_url": "http://arxiv.org/abs/nlin/0606013v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "`Soft-Oxo-Metalates' (SOMs): A Very Short Introduction",
    "abstract": "The field of polyoxometalates (POMs), in recent times, has entered a new\narena of 'soft'-supramolecular interactions, crossing the molecular regime of\ncovalent bonds. The structures resulting from such 'soft'-supramolecular\ninteractions are much larger (~10-500 nm in diameter) showing soft-matter\nproperties. This comment proposes to name them 'Soft' Oxometalates. The comment\nafter introducing and archiving seminal examples of Soft Oxometalates, gives\nfew examples from the author's work where Soft Oxometalates are generated\nspontaneously and those designed by deliberate chemical reactions (also\nfollowed by very few selected examples from the literature). The comment ends\nwith an open question: are all POMs soft?",
    "authors": [
      "Soumyajit Roy"
    ],
    "publication_date": "2012-07-09T04:17:15Z",
    "arxiv_id": "http://arxiv.org/abs/1207.1941v1",
    "download_url": "http://arxiv.org/abs/1207.1941v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lamellar Lα Mesophases Doped with Inorganic Nanoparticles",
    "abstract": "The development of nanostructured hybrid systems is a flourishing area of\nresearch, which brings together chemistry, physics and materials science. These\nsystems are composed of nanoparticles with interesting properties (e.g.\noptical, magnetic, catalytic) dispersed within an organic matrix. Control of\nboth the position and orientation of the particles in a precise and\nreproducible way is an important goal. Towards this goal, the use of lyotropic\nliquid crystals as host phases is a promising strategy that has prompted\nsustained experimental work over the last decade. Here we briefly review this\nfield, with an emphasis on the structure and the physical characterization of\nthese novel materials.",
    "authors": [
      "Doru Constantin",
      "Patrick Davidson"
    ],
    "publication_date": "2014-05-17T11:56:34Z",
    "arxiv_id": "http://arxiv.org/abs/1405.4385v1",
    "download_url": "http://arxiv.org/abs/1405.4385v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Synthesis and structure of tetragonal Bi12.5Nd1.5ReO24.5",
    "abstract": "The Bi12.5Nd1.5ReO24.5 tetragonal phase has been synthesized and lattice cell\nparameters have been determined. According to X-ray data the phase has I4/m\nsym-metry with lattice parameters a = 0.86742 (12) nm, c =1.7408 (3) nm.",
    "authors": [
      "N. I. Matskevich",
      "Th. Wolf",
      "P. Adelmann",
      "O. I. Ahyfrieva",
      "M. Yu. Matskevich"
    ],
    "publication_date": "2015-11-26T08:02:44Z",
    "arxiv_id": "http://arxiv.org/abs/1511.08314v1",
    "download_url": "http://arxiv.org/abs/1511.08314v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Solution enthalpies of barium cerates co-doped by rare-earth elements\n  and indium",
    "abstract": "The dissolution enthalpies of BaCe0.7Ho0.2In0.1O2.85 and\nBaCe0.7Sm0.2In0.1O2.85 were measured by method of solution calorimetry in 1M\nhydrochloric acid with adding 0.1 M KI. The obtained data were compared with\nearlier measured data on dissolution enthalpies of BaCe0.7Nd0.2In0.1O2.85,\nBaCe0.7Gd0.2In0.1O2.85. The dependence of dissolution enthalpies from\nlanthanide radius was constructed. As was shown the relationship is not linear.",
    "authors": [
      "N. I. Matskevich",
      "Th. Wolf",
      "A. N. Semerikova",
      "O. I. Anyfrieva",
      "M. Yu. Matskevich",
      "I. V. Vyazovkin"
    ],
    "publication_date": "2016-12-13T05:40:43Z",
    "arxiv_id": "http://arxiv.org/abs/1612.04036v1",
    "download_url": "http://arxiv.org/abs/1612.04036v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Giant thermoelectric power factor anisotropy in PtSb$_{1.4}$Sn$_{0.6}$",
    "abstract": "We report giant anisotropy in thermoelectric power factor ($S^2\\sigma$) of\nmarcasite structure-type PtSb$_{1.4}$Sn$_{0.6}$. PtSb$_{1.4}$Sn$_{0.6}$,\nsynthesized using ambient pressure flux growth method upon mixing Sb and Sn on\nthe same atomic site, is a new phase different from both PtSb$_2$ and PtSn$_2$\nthat crystallize in the cubic $Pa\\bar{3}$ pyrite and $Fm\\bar{3}m$ fluorite unit\ncell symmetry, respectively. Giant difference in $S^2\\sigma$ for heat flow\napplied along different principal directions of the orthorhombic unit cell\nmostly stems from anisotropic Seebeck coefficients.",
    "authors": [
      "Yu Liu",
      "Zhixiang Hu",
      "Michael O. Ogunbunmi",
      "Eli Stavitski",
      "Klaus Attenkofer",
      "Svilen Bobev",
      "Cedomir Petrovic"
    ],
    "publication_date": "2022-08-18T06:05:00Z",
    "arxiv_id": "http://arxiv.org/abs/2208.08647v1",
    "download_url": "http://arxiv.org/abs/2208.08647v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cd3As2 is Centrosymmetric",
    "abstract": "This is a revised version of a manuscript that was originally posted here in\nFebruary of 2014. It has been accepted at the journal Inorganic Chemistry after\nreviews that included those of two crystallographers who made sure all the t's\nwere crossed and the i's were dotted. The old work (from 1968) that said that\nCd3As2 was noncentrosymmetric was mistaken, with the authors of that study\nmaking a type of error that in the 1980s became infamous in crystallography. As\na result of the increased scrutiny of the issue of centrosymmetricity of the\n1980's, there are now much better analysis tools to resolve the issue fully,\nand its important to understand that not just our crystals are centrosymmetric,\neven the old guy's crystals were centrosymmetric (and by implication everyone's\nare). There is no shame in having made that error back in the day and those\nauthors would not find the current centrosymmetric result controversial; their\npaper is excellent in all other aspects. This manuscript describes how the\nstructure is determined, explains the structure schematically, calculates the\nelectronic structure based on the correct centrosymmetric crystal structure,\nand gives the structural details that should be used for future analysis and\nmodeling.",
    "authors": [
      "Mazhar N. Ali",
      "Quinn Gibson",
      "Sangjun Jeon",
      "Brian B. Zhou",
      "Ali Yazdani",
      "R. J. Cava"
    ],
    "publication_date": "2013-12-29T19:19:33Z",
    "arxiv_id": "http://arxiv.org/abs/1312.7576v2",
    "download_url": "http://arxiv.org/abs/1312.7576v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structural Chemistry of Layered Lead Halide Perovskites Containing\n  Single Octahedral Layers",
    "abstract": "We present a comprehensive review of the structural chemistry of hybrid lead\nhalides of stoichiometry APbX4, A2PbX4 or AAPbX4, where A and A are organic\nammonium cations and X = Cl, Br or I. These compounds may be considered as\nlayered perovskites, containing isolated, infinite layers of corner-sharing\nPbX4 octahedra separated by the organic species. We first extract over 250\ncrystal structures from the CCDC and classify them in terms of unit cell\nmetrics and crystal symmetry. Symmetry mode analysis is then used to identify\nthe nature of key structural distortions of the [PbX4] layers. Two generic\ntypes of distortion are prevalent in this family: tilting of the octahedral\nunits and shifts of the inorganic layers relative to each other. Although the\noctahedral tilting modes are well-known in the crystallography of purely\ninorganic perovskites, the additional layer shift modes are shown to enrich\nenormously the structural options available in layered hybrid perovskites. Some\nexamples and trends are discussed in more detail in order to show how the\nnature of the interlayer organic species can influence the overall structural\narchitecture, although the main aim of the paper is to encourage workers in the\nfield to make use of the systematic crystallographic methods used here to\nfurther understand and rationalise their own compounds, and perhaps to be able\nto design-in particular structural features in future work.",
    "authors": [
      "Philip Lightfoot",
      "Jason A. McNulty"
    ],
    "publication_date": "2021-01-23T11:40:47Z",
    "arxiv_id": "http://arxiv.org/abs/2101.09489v1",
    "download_url": "http://arxiv.org/abs/2101.09489v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$La_3Pd_2NaO_9$: A High-Valent Insulating Palladate",
    "abstract": "A high-valent palladate, $La_3Pd_2NaO_9$, has been synthesized for the first\ntime. Single crystals with dimensions of 20 ${\\mu}$m on edge were successfully\ngrown using the flux method at 420 $^o$C and 70 bar oxygen pressure. Energy\ndispersive spectroscopy (EDS) and inductively coupled plasma mass spectroscopy\n(ICP) measurements show that the atomic ratio of La: (Pd+Na) is 3: 3 and Pd: Na\nis 2: 1. X-ray photoelectron spectroscopy (XPS) measurements show that the\noxidation state of Pd is dominated by +4. Synchrotron X-ray single-crystal\ndiffraction measurements revealed that this material crystallizes in the\nmonoclinic $P2_1/c$ space group with charge ordering of Na and Pd. Real-space\nimaging via scanning transmission electron microscopy (STEM) confirmed the\ncrystal structure and revealed excellent sample homogeneity. Electrical\nresistivity measurements show an insulating behavior. Magnetic measurements\nshow an unexpected paramagnetic behavior, which probably originate from a small\nfraction of high-spin Pd$^{2+}$ evidenced by XPS. The successful growth of\n$La_3Pd_2NaO_9$ single crystals with a high-valent oxidation state of Pd offers\nan approach for exploring interesting palladates, including potential bilayer\nRuddlesden-Popper palladates analogous to the high temperature superconducting\n$La_3Ni_2O_7$.",
    "authors": [
      "Qingqing Yang",
      "Ning Guo",
      "Tieyan Chang",
      "Zheng Guo",
      "Xiaoli Wang",
      "Chuanyan Fan",
      "Chao Liu",
      "Lu Han",
      "Feiyu Li",
      "Tao He",
      "Qiang Zheng",
      "Yu-Sheng Chen",
      "Junjie Zhang"
    ],
    "publication_date": "2025-06-19T02:21:15Z",
    "arxiv_id": "http://arxiv.org/abs/2506.15966v1",
    "download_url": "http://arxiv.org/abs/2506.15966v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Encoding Complexity within Supramolecular Analogues of Frustrated\n  Magnets",
    "abstract": "At the heart of systems chemistry lies the idea that supramolecular\ninteractions can give rise to complex and unexpected collective states that\nemerge on a fundamentally different lengthscale to that of the interactions\nthemselves. While in certain cases - e.g. the self-assembly of virus-like\npolyhedral cages from coordination building blocks - it is possible to control\nemergence in a systematic manner, the development of general approaches remains\na fundamental challenge in the field. In the conceptually-related domain of\nfrustrated magnetism - where collective states give rise to exotic physics of\nrelevance to data storage and spintronics - the task of predicting emergent\nbehaviour is simplified through control over the geometry and form of the\nmagnetic interactions from which complexity arises. Seeking to combine\napproaches from these two fields, we study here the solid phases of inorganic\npolymer chains assembled from non-magnetic gold(I)/silver(I) cations and\ncyanide anions. We show the periodic inter-chain potential encodes a\nsupramolecular interaction that can be tuned to mimic different magnetic\ninteractions between XY spins (\"spin rotors\"). Because the chains pack on a\ntriangular lattice, the crystal structures of gold(I)/silver(I) cyanides can be\ninterpreted in terms of the phase behaviour of triangular XY magnets. Complex\nmagnetic states predicted for this family - including hidden quadrupolar order\nand emergent spin-vortex quasiparticles - are realised for the first time in\nthe structural chemistry of these cyanide polymers. In this way we demonstrate\nboth how simple inorganic materials might behave as structural analogues of\notherwise-unrealisable \"toy\" spin models, and also how a theoretical\nunderstanding of those models might be used to predict and control emergent\nphenomena in chemical systems.",
    "authors": [
      "Andrew B. Cairns",
      "Matthew J. Cliffe",
      "Joseph A. M. Paddison",
      "Dominik Daisenberger",
      "Matthew G. Tucker",
      "François-Xavier Coudert",
      "Andrew L. Goodwin"
    ],
    "publication_date": "2016-01-07T20:52:26Z",
    "arxiv_id": "http://arxiv.org/abs/1601.01664v1",
    "download_url": "http://arxiv.org/abs/1601.01664v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Database of 2D hybrid perovskite materials: open-access collection of\n  crystal structures, band gaps and atomic partial charges predicted by machine\n  learning",
    "abstract": "We describe a first open-access database of experimentally investigated\nhybrid organic-inorganic materials with two-dimensional (2D) perovskite-like\ncrystal structure. The database includes 515 compounds, containing 180\ndifferent organic cations, 10 metals (Pb, Sn, Bi, Cd, Cu, Fe, Ge, Mn, Pd, Sb)\nand 3 halogens (I, Br, Cl) known so far and will be regularly updated. The\ndatabase contains a geometrical and crystal chemical analysis of the\nstructures, which are useful to reveal quantitative structure-property\nrelationships for this class of compounds. We show that the penetration depth\nof spacer organic cation into the inorganic layer and M-X-M bond angles\nincrease in the number of inorganic layers (n). The machine learning model is\ndeveloped and trained on the database, for the prediction of a band gap with\naccuracy within 0.1 eV. Another machine learning model is trained for the\nprediction of atomic partial charges with accuracy within 0.01 e. We show that\nthe predicted values of band gaps decrease with an increase of the n and with\nan increase of M-X-M angles for single-layered perovskites. In general, the\nproposed database and machine learning models are shown to be useful tools for\nthe rational design of new 2D hybrid perovskite materials.",
    "authors": [
      "Ekaterina I. Marchenko",
      "Sergey A. Fateev",
      "Andrey A. Petrov",
      "Vadim V. Korolev",
      "Artem A. Mi-trofanov",
      "Andrey V. Petrov",
      "Eugene A. Goodilin",
      "Alexey B. Tarasov"
    ],
    "publication_date": "2020-06-25T10:45:04Z",
    "arxiv_id": "http://arxiv.org/abs/2006.14302v1",
    "download_url": "http://arxiv.org/abs/2006.14302v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry research in India in a global perspective- A scientometrics\n  profile",
    "abstract": "Papers from India are cited 14.68 times on average compared to cites per\npaper of 45.34 for Singapore, 30.47 for USA, 23.12 for China, 26.51 for the UK,\n21.77 for South Korea and 24.77 for Germany. Less than 39% of papers from India\nare found in quartile 1 (high impact factor) journals, compared to 53.6% for\nChina and 53.8% for South Korea. Percent share of papers in quartile 1 journals\nfrom India is lower than that for the world for all of chemistry and for each\none of the eight categories, viz. analytical, applied, inorganic & nuclear,\nmedicinal, multidisciplinary, organic, physical and electrochemistry whether\none considers data for the entire five-year period or for 2015 alone. About 20%\nof Indian chemistry papers are in collaboration with international coauthors.\nResearchers from only 160 Indian institutions have published at least 100\npapers (compared to 362 in USA and 399 in China) and these include 67 state, 14\ncentral and 11 private universities, 27 institutions under the Ministry of\nHuman Resource Development, 20 CSIR laboratories, seven Department of Atomic\nEnergy institutions, and seven Department of Science & Technology institutions.\nAbout 40% of all Indian chemistry papers have come from public universities.\nOnly three Indian institutions, viz Bhabha Atomic Research Centre, Indian\nInstitute of Science and Indian Institute of Chemical Technology, have\npublished more than 2,000 papers. None of the Indian universities has performed\nas well as leading Asian universities. Amrita Vishwa Vidyapeetham, a small\ninstitution with less than 200 papers, has performed reasonably well.",
    "authors": [
      "Muthu Madhan",
      "Subbiah Gunasekaran",
      "Rani M T",
      "Subbiah Arunachalam",
      "T A Abinandanan"
    ],
    "publication_date": "2020-02-08T05:38:35Z",
    "arxiv_id": "http://arxiv.org/abs/2002.03093v2",
    "download_url": "http://arxiv.org/abs/2002.03093v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Decomposition of solid solutions in the Nd-Ba-Cu-O system and its\n  influence on changing transport characteristics",
    "abstract": "Thermochemical characteristics of Nd1+xBa2-xCu3Oy solid solutions were\nstudied by solution calorimetry. Dependences of formation enthalpies from Nd\ncontent were constructed. It was established that decomposition of solid\nsolution on the basis of Nd123 phase took place both in inert and in oxygen\natmosphere. As a result of decomposition the different mixtures such as solid\nsolutions with increasing and decreasing Nd content and BaCuO2 were formed.\nObtained thermochemical data were compared with results of measurements of\ntransport characteristics. It was established that treatment of samples at\n550-600 C led to increasing critical current and decreasing Tc.",
    "authors": [
      "N. I. Matskevich",
      "O. I. Anyfrieva",
      "T. D. Karpova",
      "Th. Wolf",
      "Eu. A. Trofimenko",
      "Yu. D. Tretyakov"
    ],
    "publication_date": "2004-03-21T10:24:26Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0403538v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0403538v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Density functional theory in transition-metal chemistry: a\n  self-consistent Hubbard U approach",
    "abstract": "Transition-metal centers are the active sites for many biological and\ninorganic chemical reactions. Notwithstanding this central importance,\ndensity-functional theory calculations based on generalized-gradient\napproximations often fail to describe energetics, multiplet structures,\nreaction barriers, and geometries around the active sites. We suggest here an\nalternative approach, derived from the Hubbard U correction to solid-state\nproblems, that provides an excellent agreement with correlated-electron quantum\nchemistry calculations in test cases that range from the ground state of Fe$_2$\nand Fe$_2^-$ to the addition-elimination of molecular hydrogen on FeO$^+$. The\nHubbard U is determined with a novel self-consistent procedure based on a\nlinear-response approach.",
    "authors": [
      "Heather J. Kulik",
      "Matteo Cococcioni",
      "Damian A. Scherlis",
      "Nicola Marzari"
    ],
    "publication_date": "2006-08-12T13:46:58Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0608285v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0608285v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantifying the Stacking Registry Matching in Layered Materials",
    "abstract": "A detailed account of a recently developed method [Marom et al., Phys. Rev.\nLett. 105, 046801 (2010)] to quantify the registry mismatch in layered\nmaterials is presented. The registry index, which was originally defined for\nplanar hexagonal boron-nitride, is extended to treat graphitic systems and\ngeneralized to describe multi-layered nanotubes. It is shown that using simple\ngeometric considerations it is possible to capture the complex physical\nfeatures of interlayer sliding in layered materials. The intuitive nature of\nthe presented model and the efficiency of the related computations suggest that\nthe method can be used as a powerful characterization tool for interlayer\ninteractions in complex layered systems.",
    "authors": [
      "Oded Hod"
    ],
    "publication_date": "2010-09-28T17:37:53Z",
    "arxiv_id": "http://arxiv.org/abs/1009.5639v1",
    "download_url": "http://arxiv.org/abs/1009.5639v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spontaneous Octahedral Tilting in the Cubic Inorganic Caesium Halide\n  Perovskites CsSnX$_3$ and CsPbX$_3$ (X = F, Cl, Br, I)",
    "abstract": "The local crystal structures of many perovskite-structured materials deviate\nfrom the average space group symmetry. We demonstrate, from lattice-dynamics\ncalculations based on quantum chemical force constants, that all the\ncaesium-lead and caesium-tin halide perovskites exhibit vibrational\ninstabilities associated with octahedral titling in their high-temperature\ncubic phase. Anharmonic double-well potentials are found for zone-boundary\nphonon modes in all compounds with barriers ranging from 108 to 512 meV. The\nwell depth is correlated with the tolerance factor and the chemistry of the\ncomposition, but is not proportional to the imaginary harmonic phonon\nfrequency. We provide quantitative insights into the thermodynamic driving\nforces and distinguish between dynamic and static disorder based on the\npotential-energy landscape. A positive band gap deformation (spectral\nblueshift) accompanies the structural distortion, with implications for\nunderstanding the performance of these materials in applications areas\nincluding solar cells and light-emitting diodes.",
    "authors": [
      "Ruo Xi Yang",
      "Jonathan M. Skelton",
      "E. Lora da Silva",
      "Jarvist M. Frost",
      "Aron Walsh"
    ],
    "publication_date": "2017-08-01T20:24:35Z",
    "arxiv_id": "http://arxiv.org/abs/1708.00499v2",
    "download_url": "http://arxiv.org/abs/1708.00499v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effect of surface chemistry on incorporation of nanoparticles within\n  calcite single crystals",
    "abstract": "Inclusion of additives into calcite crystals allows one to embed non-native\nproprieties into the inorganic matrix and obtain new functional materials. Up\nto now, few parameters have been taken into account to evaluate the efficiency\nof inclusion of an additive. Taking inspiration from Nature, we grew calcite\ncrystals in the presence of fluorescent silica nanoparticles carrying different\nfunctional groups (PluS-X) to investigate the effect of surface chemistry on\nthe inclusion of the additives. PluS-X allowed us to keep constant all the\nparticle characteristics, including size, while changing exposed functional\ngroups and thus Zeta-potential. The effect on crystal morphology, the loading\nand distribution of PluS-X within the crystals have been evaluated with\ndifferent microscopy techniques. Our data indicate that hydroxyl functionalized\nparticles are entrapped more efficiently inside calcite single crystals without\ndistortion of the crystal structure and inhibition of the growth.",
    "authors": [
      "Giulia Magnabosco",
      "Iryna Polishchuk",
      "Francesco Palomba",
      "Enrico Rampazzo",
      "Luca Prodi",
      "Joanna Aizenberg",
      "Boaz Pokroy",
      "Giuseppe Falini"
    ],
    "publication_date": "2019-12-29T14:45:34Z",
    "arxiv_id": "http://arxiv.org/abs/2001.02063v1",
    "download_url": "http://arxiv.org/abs/2001.02063v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Autonomous discovery in the chemical sciences part I: Progress",
    "abstract": "This two-part review examines how automation has contributed to different\naspects of discovery in the chemical sciences. In this first part, we describe\na classification for discoveries of physical matter (molecules, materials,\ndevices), processes, and models and how they are unified as search problems. We\nthen introduce a set of questions and considerations relevant to assessing the\nextent of autonomy. Finally, we describe many case studies of discoveries\naccelerated by or resulting from computer assistance and automation from the\ndomains of synthetic chemistry, drug discovery, inorganic chemistry, and\nmaterials science. These illustrate how rapid advancements in hardware\nautomation and machine learning continue to transform the nature of\nexperimentation and modelling.\n  Part two reflects on these case studies and identifies a set of open\nchallenges for the field.",
    "authors": [
      "Connor W. Coley",
      "Natalie S. Eyke",
      "Klavs F. Jensen"
    ],
    "publication_date": "2020-03-30T19:11:31Z",
    "arxiv_id": "http://arxiv.org/abs/2003.13754v1",
    "download_url": "http://arxiv.org/abs/2003.13754v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entangled Electrons Drive a non-Superexchange Mechanism in a Cobalt\n  Quinoid Dimer Complex",
    "abstract": "A central theme in chemistry is the understanding of the mechanisms that\ndrive chemical transformations. A well-known, highly cited mechanism in\norganometallic chemistry is the superexchange mechanism in which unpaired\nelectrons on two or more metal centers interact through an electron pair of the\nbridging ligand. We use a combination of novel synthesis and computation to\nshow that such interactions may in fact occur by a more direct mechanism than\nsuperexchange that is based on direct quantum entanglement of the two metal\ncenters. Specifically, we synthesize and experimentally characterize a novel\ncobalt dimer complex with benzoquinoid bridging ligands and investigate its\nelectronic structure with the variational two-electron reduced density matrix\nmethod using large active spaces. The result draws novel connections between\ninorganic mechanisms and quantum entanglement, thereby opening new\npossibilities for the design of strongly correlated organometallic compounds\nwhose magnetic and spin properties have applications in superconductors, energy\nstorage, thermoelectrics, and spintronics.",
    "authors": [
      "Jan-Niklas Boyn",
      "Jiaze Xie",
      "John S. Anderson",
      "David A. Mazziotti"
    ],
    "publication_date": "2020-05-07T17:40:56Z",
    "arxiv_id": "http://arxiv.org/abs/2005.03637v1",
    "download_url": "http://arxiv.org/abs/2005.03637v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ternary Nitride Materials: Fundamentals and Emerging Device Applications",
    "abstract": "Interest in inorganic ternary nitride materials has grown rapidly over the\npast few decades, as their diversity of chemistries and structures make them\nappealing for a variety of applications. Due to synthetic challenges posed by\nthe stability of N2, the number of predicted nitride compounds dwarfs those\nthat have been synthesized, offering a breadth of opportunity for exploration.\nThis review summarizes the fundamental properties and structural chemistry of\nternary nitrides, leveraging metastability and the impact of nitrogen chemical\npotential. A discussion of prevalent defects, both detrimental and beneficial,\nis followed by a survey of synthesis techniques and their interplay with\nmetastability. Throughout the review, we highlight applications (such as\nsolid-state lighting, electrochemical energy storage, and electronic devices)\nin which ternary nitrides show particular promise.",
    "authors": [
      "Ann L. Greenaway",
      "Celeste L. Melamed",
      "M. Brooks Tellekamp",
      "Rachel Woods-Robinson",
      "Eric S. Toberer",
      "James R. Neilson",
      "Adele C. Tamboli"
    ],
    "publication_date": "2020-10-15T22:48:59Z",
    "arxiv_id": "http://arxiv.org/abs/2010.08058v1",
    "download_url": "http://arxiv.org/abs/2010.08058v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From anti-perovskite to double anti-perovskite: lattice chemistry basis\n  for super-fast transportation of Li+ ions in cubic solid lithium\n  halogen-chalcogenides",
    "abstract": "Using a materials genome approach on the basis of the density functional\ntheory, we have formulated a new class of inorganic electrolytes for fast\ndiffusion of Li+ ions, through fine-tuning of lattice chemistry of\nanti-perovskite structures. Systematic modelling has been carried out to\nelaborate the structural stability and ion transportation characteristics in\nLi3AX based cubic anti-perovskite, through alloying on the chalcogen lattice\nsite (A) and alternative occupancy of the halogen site (X). In addition to\nidentifying effective ways for reduction of diffusion barriers for Li+ ions in\nanti-perovskite phases via suitable designation of lattice occupancy, the\ncurrent theoretical study leads to discovery and synthesis of a new phase with\na double-anti-perovskite structure, Li6OSI2 (or Li3O0.5S0.5I). Such a new\ncompound is of fairly low activation barrier for Li+ diffusion, together with a\nwide energy band gap to hinder conduction of electrons.",
    "authors": [
      "Zhuo Wang",
      "Hongjie Xu",
      "Minjie Xuan",
      "Guosheng Shao"
    ],
    "publication_date": "2017-07-18T21:32:45Z",
    "arxiv_id": "http://arxiv.org/abs/1707.05868v1",
    "download_url": "http://arxiv.org/abs/1707.05868v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Robust magnetic anisotropy of a monolayer of hexacoordinate Fe( ii )\n  complexes assembled on Cu(111)",
    "abstract": "The tris pyrazolyl borate ligand imposes a rigid scaffold around Fe( ii )\nensuring a robust magnetic anisotropy when the molecules assembled as\nmonolayers suffer from the dissymmetric environment of the substrate/vacuum\ninterface.",
    "authors": [
      "Massine Kelai",
      "Benjamin Cahier",
      "Mihail Atanasov",
      "Frank Neese",
      "Yongfeng Tong",
      "Luqiong Zhang",
      "Amandine Bellec",
      "Olga Iasco",
      "Eric Rivière",
      "Régis Guillot",
      "Cyril Chacon",
      "Yann Girard",
      "Jérôme Lagoute",
      "Sylvie Rousset",
      "Vincent Repain",
      "Edwige Otero",
      "Marie-Anne Arrio",
      "Philippe Sainctavit",
      "Anne-Laure Barra",
      "Marie-Laure Boillot",
      "Talal Mallah"
    ],
    "publication_date": "2021-05-10T08:46:11Z",
    "arxiv_id": "http://arxiv.org/abs/2105.04199v1",
    "download_url": "http://arxiv.org/abs/2105.04199v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First-principle investigation of boron nitride nanobelt",
    "abstract": "In this paper, we report a new boron nitride molecular structure called\nBN-nanobelt, an inorganic analog of (12) cyclophenacene synthesized in 2017. An\nextensive investigation using Density Functional Theory (DFT) and Quantum\nMolecular Dynamics (QMD) calculations showed that BN-nanobelt is a structurally\nand thermally stable molecule with all positive vibrational frequencies.\nBN-nanobelt behaves as an insulator, and it absorbs in the ultraviolet region,\nsuggesting a potential application as a UV detector. All results presented in\nthis paper indicate structural stability and the possibility of its synthesis.\nWe hope that the proposed BN-nanobelt structure could stimulate further\nexperimental investigations on its synthesis and bring potential novel\ntechnological applications.",
    "authors": [
      "Leonardo S. Barbosa",
      "Bruna",
      "C. C. de Almeida",
      "Edvan Moreira",
      "David L. Azevedo"
    ],
    "publication_date": "2021-12-30T18:50:02Z",
    "arxiv_id": "http://arxiv.org/abs/2112.15168v1",
    "download_url": "http://arxiv.org/abs/2112.15168v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mathematical Crystal Chemistry",
    "abstract": "Efficient heuristics have predicted many functional materials such as\nhigh-temperature superconducting hydrides, while inorganic structural chemistry\nexplains why and how the crystal structures are stabilized. Here we develop the\npaired mathematical programming formalism for searching and systematizing the\nstructural prototypes of crystals. The first is the minimization of the volume\nof the unit cell under the constraints of only the minimum and maximum\ndistances between pairs of atoms. We show the capabilities of linear\nrelaxations of inequality constraints to optimize structures by the\nsteepest-descent method, which is computationally very efficient. The second is\nthe discrete optimization to assign five kinds of geometrical constraints\nincluding chemical bonds for pairs of atoms. Under the constraints, the two\nobject functions, formulated as mathematical programming, are alternately\noptimized to realize the given coordination numbers of atoms. This approach\nsuccessfully generates a wide variety of crystal structures of oxides such as\nspinel, pyrochlore-$\\alpha$, and $\\mathrm{K}_2 \\mathrm{NiF}_4$ structures.",
    "authors": [
      "Ryotaro Koshoji",
      "Taisuke Ozaki"
    ],
    "publication_date": "2024-04-22T13:54:26Z",
    "arxiv_id": "http://arxiv.org/abs/2404.14181v3",
    "download_url": "http://arxiv.org/abs/2404.14181v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effect of nano Co reinforcements on the structure of the Sn-3.0Ag-0.5Cu\n  solder in liquid and after reflow solid states",
    "abstract": "Sn-Ag-Cu (SAC) alloys are commonly recognized as lead-free solders employed\nin the electronics industry. However, some disadvantages in mechanical\nproperties and their higher melting temperatures compared to Pb-Sn solders\nprompt new research relating to reinforcement of existing SAC solders. One of\nthe ways to reinforce these solder materials is the formation of composites\nwith nanoparticles as filler materials. Accordingly, this study presents\nstructural features of nanocomposite (Sn-3.0Ag-0.5Cu)100-x(nanoCo)x solders\nwith up to 0.8 wt.% nano Co. The effect of nano-sized Co particles was\ninvestigated by means of differential thermal analysis (DTA), X-ray diffraction\n(XRD) in both liquid and solid states, and scanning electron microscopy (SEM).\nThe experimental data of DTA are compared with available literature data for\nbulk Sn 3.0Ag-0.5Cu alloy to check the capability of minor nano-inclusions to\ndecrease the melting temperature of the SAC solder. The combination of\nstructural data in liquid and solid states provides important information about\nthe structural transformations of liquid Sn 3.0Ag 0.5Cu alloys caused by minor\nCo additions and the phase formation during crystallization. Furthermore,\nscanning electron microscopy has shown the mutual substitution of Co and Cu\natoms in the Cu6Sn5 and CoSn3 phases, respectively.",
    "authors": [
      "Andriy Yakymovych",
      "Stepan Mudry",
      "Ihor Shtablavyi",
      "Herbert Ipser"
    ],
    "publication_date": "2018-06-09T07:29:32Z",
    "arxiv_id": "http://arxiv.org/abs/1806.06935v1",
    "download_url": "http://arxiv.org/abs/1806.06935v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Combined Density Functional Theory and X-ray Photoelectron\n  Spectroscopy Study of the Aromatic Amino Acids",
    "abstract": "Amino acids are essential to all life. However, our understanding of some\naspects of their intrinsic structure, molecular chemistry, and electronic\nstructure is still limited. In particular the nature of amino acids in their\ncrystalline form, often essential to biological and medical processes, faces a\nlack of knowledge both from experimental and theoretical approaches. An\nimportant experimental technique that has provided a multitude of crucial\ninsights into the chemistry and electronic structure of materials is X-ray\nphotoelectron spectroscopy. Whilst the interpretation of spectra of simple bulk\ninorganic materials is often routine, interpreting core level spectra of\ncomplex molecular systems is complicated to impossible without the help of\ntheory. We have previously demonstrated the ability of density functional\ntheory to calculate binding energies of simple amino acids, using $\\Delta$SCF\nimplemented in a systematic basis set for both gas phase (multiwavelets) and\nsolid state (plane waves) calculations. In this study, we use the same approach\nto successfully predict and rationalise the experimental core level spectra of\nphenylalanine (Phe), tyrosine (Tyr), tryptophan (Trp), and histidine (His) and\ngain an in-depth understanding of their chemistry and electronic structure\nwithin the broader context of more than 20 related molecular systems. The\ninsights gained from this study provide significant information on the nature\nof the aromatic amino acids and their conjugated side chains.",
    "authors": [
      "Anna Regoutz",
      "Marta S. Wolinska",
      "Nathalie K. Fernando",
      "Laura E. Ratcliff"
    ],
    "publication_date": "2020-10-30T12:25:17Z",
    "arxiv_id": "http://arxiv.org/abs/2010.16220v1",
    "download_url": "http://arxiv.org/abs/2010.16220v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Taming Multi-Domain, -Fidelity Data: Towards Foundation Models for\n  Atomistic Scale Simulations",
    "abstract": "Machine learning interatomic potentials (MLIPs) are changing atomistic\nsimulations in chemistry and materials science. Yet, building a single,\nuniversal MLIP -- capable of accurately modeling both molecular and crystalline\nsystems -- remains challenging. A central obstacle lies in integrating the\ndiverse datasets generated under different computational conditions. This\ndifficulty creates an accessibility barrier, allowing only institutions with\nsubstantial computational resources -- those able to perform costly\nrecalculations to standardize data -- to contribute meaningfully to the\nadvancement of universal MLIPs. Here, we present Total Energy Alignment (TEA),\nan approach that enables the seamless integration of heterogeneous quantum\nchemical datasets almost without redundant calculations. Using TEA, we have\ntrained MACE-Osaka24, the first open-source neural network potential model\nbased on a unified dataset covering both molecular and crystalline systems,\nutilizing the MACE architecture developed by Batatia et al. This universal\nmodel shows strong performance across diverse chemical systems, exhibiting\ncomparable or improved accuracy in predicting organic reaction barriers\ncompared to specialized models, while effectively maintaining state-of-the-art\naccuracy for inorganic systems. Our method democratizes the development of\nuniversal MLIPs, enabling researchers across academia and industry to\ncontribute to and benefit from high-accuracy potential energy surface models,\nregardless of their computational resources. This advancement paves the way for\naccelerated discovery in chemistry and materials science through genuinely\nfoundation models for chemistry.",
    "authors": [
      "Tomoya Shiota",
      "Kenji Ishihara",
      "Tuan Minh Do",
      "Toshio Mori",
      "Wataru Mizukami"
    ],
    "publication_date": "2024-12-17T16:59:03Z",
    "arxiv_id": "http://arxiv.org/abs/2412.13088v1",
    "download_url": "http://arxiv.org/abs/2412.13088v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrochemical CO2 capture with pH-independent redox chemistry",
    "abstract": "Capture of anthropogenic CO2 is critical for mitigating climate change, and\nreducing the energy cost is essential for wide-scale deployment. Solubility of\ninorganic carbon in aqueous solutions depends on the pH, and electrochemical\nmodulation of the pH has been investigated as a means of CO2 capture and\nrelease. However, reported methods incur unavoidable energy costs due to\nthermodynamic penalties. In this study, we introduce a pH-independent redox\nchemistry that greatly lowers the thermodynamic energy costs by changing the pH\nwithout directly changing the [H+]. We show that the redox reaction of TEMPO\nmolecules modulates the pH for capture and release of CO2 in a flow cell with\nan energy cost as low as 2.6 kJ/mol of CO2 corresponding to 0.027 eV/molecule.\nA molecular model, supported by MD and DFT simulations, is proposed of how the\npH is decreased by 7.6 while largely avoiding the entropic energy cost\nassociated with increasing the [H+]. We believe that this work showcases the\npotential of pH-independent redox chemistries for practical and cost-effective\nCO2 capture.",
    "authors": [
      "Sang Cheol Kim",
      "Marco Gigantino",
      "John Holoubek",
      "Jesse E. Matthews",
      "Junjie Chen",
      "Yaereen Dho",
      "Thomas F. Jaramillo",
      "Yi Cui",
      "Arun Majumdar",
      "Yan-Kai Tzeng",
      "Steven Chu"
    ],
    "publication_date": "2025-02-03T03:48:04Z",
    "arxiv_id": "http://arxiv.org/abs/2502.01028v1",
    "download_url": "http://arxiv.org/abs/2502.01028v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Selection of Arginine-Rich Anti-Gold Antibodies Engineered for Plasmonic\n  Colloid Self-Assembly",
    "abstract": "Antibodies are affinity proteins with a wide spectrum of applications in\nanalytical and therapeutic biology. Proteins showing specific recognition for a\nchosen molecular target can be isolated and their encoding sequence identified\nin vitro from a large and diverse library by phage display selection. In this\nwork, we show that this standard biochemical technique rapidly yields a\ncollection of antibody protein binders for an inorganic target of major\ntechnological importance: crystalline metallic gold surfaces. 21 distinct\nanti-gold antibody proteins emerged from a large random library of antibodies\nand were sequenced. The systematic statistical analysis of all the protein\nsequences reveals a strong occurrence of arginine in anti-gold antibodies,\nwhich corroborates recent molecular dynamics predictions on the crucial role of\narginine in protein/gold interactions. Once tethered to small gold\nnanoparticles using histidine tag chemistry, the selected antibodies could\ndrive the self-assembly of the colloids onto the surface of single crystalline\ngold platelets as a first step towards programmable protein-driven construction\nof complex plasmonic architectures. Electrodynamic simulations based on the\nGreen Dyadic Method suggest that the antibody-driven assembly demonstrated here\ncould be exploited to significantly modify the plasmonic modal properties of\nthe gold platelets. Our work shows that molecular biology tools can be used to\ndesign the interaction between fully folded proteins and inorganic surfaces\nwith potential applications in the bottom-up construction of plasmonic hybrid\nnanomaterials.",
    "authors": [
      "Purvi Jain",
      "Anandakumar Soshee",
      "S Shankara Narayanan",
      "Jadab Sharma",
      "Christian Girard",
      "Erik Dujardin",
      "Clément Nizak"
    ],
    "publication_date": "2014-05-13T12:21:11Z",
    "arxiv_id": "http://arxiv.org/abs/1405.3122v1",
    "download_url": "http://arxiv.org/abs/1405.3122v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Crystal Transformer: Self-learning neural language model for Generative\n  and Tinkering Design of Materials",
    "abstract": "Self-supervised neural language models have recently achieved unprecedented\nsuccess, from natural language processing to learning the languages of\nbiological sequences and organic molecules. These models have demonstrated\nsuperior performance in the generation, structure classification, and\nfunctional predictions for proteins and molecules with learned representations.\nHowever, most of the masking-based pre-trained language models are not designed\nfor generative design, and their black-box nature makes it difficult to\ninterpret their design logic. Here we propose BLMM Crystal Transformer, a\nneural network based probabilistic generative model for generative and\ntinkering design of inorganic materials. Our model is built on the blank\nfilling language model for text generation and has demonstrated unique\nadvantages in learning the \"materials grammars\" together with high-quality\ngeneration, interpretability, and data efficiency. It can generate chemically\nvalid materials compositions with as high as 89.7\\% charge neutrality and\n84.8\\% balanced electronegativity, which are more than 4 and 8 times higher\ncompared to a pseudo random sampling baseline. The probabilistic generation\nprocess of BLMM allows it to recommend tinkering operations based on learned\nmaterials chemistry and makes it useful for materials doping. Combined with the\nTCSP crysal structure prediction algorithm, We have applied our model to\ndiscover a set of new materials as validated using DFT calculations. Our work\nthus brings the unsupervised transformer language models based generative\nartificial intelligence to inorganic materials. A user-friendly web app has\nbeen developed for computational materials doping and can be accessed freely at\n\\url{www.materialsatlas.org/blmtinker}.",
    "authors": [
      "Lai Wei",
      "Qinyang Li",
      "Yuqi Song",
      "Stanislav Stefanov",
      "Edirisuriya M. D. Siriwardane",
      "Fanglin Chen",
      "Jianjun Hu"
    ],
    "publication_date": "2022-04-25T20:20:26Z",
    "arxiv_id": "http://arxiv.org/abs/2204.11953v1",
    "download_url": "http://arxiv.org/abs/2204.11953v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrocatalytic CO$_2$ Reduction: Role of the Cross-Talk at\n  Organic-Inorganic Interfaces",
    "abstract": "Electrocatalytic CO$_2$RR is an interfacial process, involving a minimum of\nthree phases at the contact point of gaseous CO$_2$ with the electrodic surface\nand the liquid electrolyte. As a consequence, surface chemistry at composite\ninterfaces plays a central role for CO$_2$RR selectivity and catalysis. Each\ninterface defines a functional boundary, where active sites are exposed to a\nunique environment with respect to distal sites in the bulk or organic and\ninorganic materials. While the individual role of each component-type is hardly\npredictable a-solo, the interface ensemble works via a strategic interplay of\nindividual effects, including: (i) enhanced electrical conductivity, (ii) high\nsurface area and exposure of the interfacial catalytic sites, (iii) favorable\ntransport and feeding of reactants, (iv) complementary interactions for the\non/off stabilization of cascade intermediates, (v) a secondary sphere\nassistance to lower the activation energy of bottleneck steps, (vi) a\nreinforced robustness and long-term operation stability by mutual protection\nand/or healing mechanisms. Selected CO$_2$RR case studies are compared and\ncontrasted to highlight how the organic domains of carbon nanostructures merge\nwith metal and metal-oxide active sites to separate tasks but also to turn them\ninto a cooperative asset of mutual interactions, thus going beyond the classic\nDivide et Impera rule.",
    "authors": [
      "Michele Melchionna",
      "Paolo Fornasiero",
      "Maurizio Prato",
      "Marcella Bonchio"
    ],
    "publication_date": "2022-12-07T09:08:14Z",
    "arxiv_id": "http://arxiv.org/abs/2212.04410v1",
    "download_url": "http://arxiv.org/abs/2212.04410v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Phase transitions in inorganic halide perovskites from machine learning\n  potentials",
    "abstract": "The atomic scale dynamics of halide perovskites have a direct impact not only\non their thermal stability but their optoelectronic properties. Progress in\nmachine learned potentials has only recently enabled modeling the finite\ntemperature behavior of these material using fully atomistic methods with near\nfirst-principles accuracy. Here, we systematically analyze the impact of\nheating and cooling rate, simulation size, model uncertainty, and the role of\nthe underlying exchange-correlation functional on the phase behavior of CsPbX3\nwith X=Cl, Br, and I, including both the perovskite and the delta-phases. We\nshow that rates below approximately 30 K/ns and system sizes of at least a few\nten thousand atoms are indicated to achieve convergence with regard to these\nparameters. By controlling these factors and constructing models that are\nspecific for different exchange-correlation functionals we then show that the\nsemi-local functionals considered in this work (SCAN, vdW-DF-cx, PBEsol, and\nPBE) systematically underestimate the transition temperatures separating the\nperovskite phases while overestimating the lattice parameters. Among the\nconsidered functionals the vdW-DF-cx functional yields the closest agreement\nwith experiment, followed by SCAN, PBEsol, and PBE. Our work provides\nguidelines for the systematic analysis of dynamics and phase transitions in\ninorganic halide perovskites and similar systems. It also serves as a benchmark\nfor the further development of machine-learned potentials as well as\nexchange-correlation functionals.",
    "authors": [
      "Erik Fransson",
      "Julia Wiktor",
      "Paul Erhart"
    ],
    "publication_date": "2023-01-09T16:36:46Z",
    "arxiv_id": "http://arxiv.org/abs/2301.03497v1",
    "download_url": "http://arxiv.org/abs/2301.03497v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Syntheses and evaluation of Fe$^{2+}$, Co$^{2+}$ and Ni$^{2+}$ complexes\n  with derivatives of Vanillin-Tryptophan schiff base ligand",
    "abstract": "This research focused on synthesis, characterization and determination of\nbiological activities of Fe$^{2+}$ Co$^{2+}$ and Ni$^{2+}$ complexes of a novel\nL- Tryptophan-Vanillin Schiff base ligand. They were synthesized and\ncharacterized by determination of their Purity, Solubility, Elemental analyses\nusing phase match XRD data, FT-IR spectra, Molar conductivities, Magnetic\nsusceptibilities, PXRD and Biological activities. Results from the analyses\nrevealed that, mpt of Schiff base ligand (SL)84 85 oC, Fe$^{2+}$ SL 245 - 246\noC, Co$^{2+}$-SL 271 - 272 oC while Ni$^{2+}$ - SL is >350 oC. Molar\nconductivities were found to be 10300, 5000, 17300 and 52900 Sm2 mol-1 for the\nSchiff base and the complexes respectively. It indicates that, the complexes\nare non-electrolytic in nature. Magnetic susceptibilities of the complexes\nfound to be higher than the spin only values due to unpaired electrons\n(Fe$^{2+}$ = 5.73 B.M, Co$^{2+}$= 4.52 B.M while for Ni$^{2+}$ = 3.46 B.M,\nsuggesting an octahedral geometry. Electronic absorption ({\\lambda}max) for\nFe$^{2+}$ = 480, Co$^{2+}$ = 520nm while Ni$^{2+}$ shows two bands at 480 and\n570 which signifies, n-{\\pi}* and {\\pi}-{\\pi}* transition respectively. Their\ncrystallinity index was also assessed using xrd technique, it shows that\ncomplexes are 75, 80 and 85 % crystalline with average crystallite size of\n21.63 nm. Antimicrobial test results revealed that, Co$^{2+}$ and Fe$^{2+}$\ncomplexes have excellent activities against gram negative bacteria (E. coli, F.\nShigella. and S. Typi).",
    "authors": [
      "Salisu Abubakar",
      "G. A. Shallangwa",
      "Abdulkadir Ibrahim"
    ],
    "publication_date": "2022-12-26T22:40:28Z",
    "arxiv_id": "http://arxiv.org/abs/2301.05021v1",
    "download_url": "http://arxiv.org/abs/2301.05021v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Bond polarizability as a probe of local crystal fields in hybrid\n  lead-halide perovskites",
    "abstract": "A rotating organic cation and a dynamically disordered soft inorganic cage\nare the hallmark features of hybrid organic-inorganic lead-halide perovskites.\nUnderstanding the interplay between these two subsystems is a challenging\nproblem but it is this coupling that is widely conjectured to be responsible\nfor the unique behavior of photo-carriers in these materials. In this work, we\nuse the fact that the polarizability of the organic cation strongly depends on\nthe ambient electrostatic environment to put the molecule forward as a\nsensitive probe of local crystal fields inside the lattice cell. We measure the\naverage polarizability of the C/N--H bond stretching mode by means of infrared\nspectroscopy, which allows us to deduce the character of the motion of the\ncation molecule, find the magnitude of the local crystal field and place an\nestimate on the strength of the hydrogen bond between the hydrogen and halide\natoms. Our results pave the way for understanding electric fields in\nlead-halide perovskites using infrared bond spectroscopy.",
    "authors": [
      "Yujing Wei",
      "Artem G. Volosniev",
      "Dusan Lorenc",
      "Ayan A. Zhumekenov",
      "Osman M. Bakr",
      "Mikhail Lemeshko",
      "Zhanybek Alpichshev"
    ],
    "publication_date": "2023-04-27T14:04:30Z",
    "arxiv_id": "http://arxiv.org/abs/2304.14198v3",
    "download_url": "http://arxiv.org/abs/2304.14198v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Crystal Structure Generation with Autoregressive Large Language Modeling",
    "abstract": "The generation of plausible crystal structures is often the first step in\npredicting the structure and properties of a material from its chemical\ncomposition. Quickly generating and predicting inorganic crystal structures is\nimportant for the discovery of new materials, which can target applications\nsuch as energy or electronic devices. However, most current methods for crystal\nstructure prediction are computationally expensive, slowing the pace of\ninnovation. Seeding structure prediction algorithms with quality generated\ncandidates can overcome a major bottleneck. Here, we introduce CrystaLLM, a\nmethodology for the versatile generation of crystal structures, based on the\nautoregressive large language modeling (LLM) of the Crystallographic\nInformation File (CIF) format. Trained on millions of CIF files, CrystaLLM\nfocuses on modeling crystal structures through text. CrystaLLM can produce\nplausible crystal structures for a wide range of inorganic compounds unseen in\ntraining, as demonstrated by ab initio simulations. The integration with\npredictors of formation energy permits the use of a Monte Carlo Tree Search\nalgorithm to improve the generation of meaningful structures. Our approach\nchallenges conventional representations of crystals, and demonstrates the\npotential of LLMs for learning effective 'world models' of crystal chemistry,\nwhich will lead to accelerated discovery and innovation in materials science.",
    "authors": [
      "Luis M. Antunes",
      "Keith T. Butler",
      "Ricardo Grau-Crespo"
    ],
    "publication_date": "2023-07-10T04:48:40Z",
    "arxiv_id": "http://arxiv.org/abs/2307.04340v3",
    "download_url": "http://arxiv.org/abs/2307.04340v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The structure and topology of an amorphous metal-organic framework",
    "abstract": "Amorphous metal-organic frameworks are an important emerging materials class\nthat combine the attractive physical properties of the amorphous state with the\nversatility of metal-organic framework (MOF) chemistry. The structures of\namorphous MOFs have largely been inferred by drawing analogies to crystalline\npolymorphs and inorganic glasses, but ultimately the validity of such\nstructural models has been challenging to establish either experimentally or\ncomputationally. Here we use a unified data-driven approach, combining\nexperimental scattering data and active machine learning for interatomic\npotentials, to determine the structure of an amorphous zeolitic imidazolate\nframework (a-ZIF) -- the canonical amorphous MOF. Our results reveal clear\ndifferences between the structure of a-ZIF and that of other amorphous\ntetrahedral networks, allowing us to invalidate the long-standing assumption\nthat these inorganic and hybrid glasses are topologically equivalent. To this\nend, we introduce a systematic notation for the network topology of amorphous\nsolids, building a bridge to the successful use of topology analysis in\ncrystalline MOFs and to materials informatics. Our work provides insights into\nthe structure and topology of the archetypal amorphous MOF and opens up new\navenues for modelling and understanding amorphous framework materials more\ngenerally.",
    "authors": [
      "Thomas C. Nicholas",
      "Daniel F. Thomas du Toit",
      "Louise A. M. Rosset",
      "Davide M. Proserpio",
      "Andrew L. Goodwin",
      "Volker L. Deringer"
    ],
    "publication_date": "2025-03-31T17:46:37Z",
    "arxiv_id": "http://arxiv.org/abs/2503.24367v1",
    "download_url": "http://arxiv.org/abs/2503.24367v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-throughput computational framework for lattice dynamics and thermal\n  transport including high-order anharmonicity: an application to cubic and\n  tetragonal inorganic compounds",
    "abstract": "Accurately predicting lattice thermal conductivity (kL) from first principles\nremains a challenge in identifying materials with extreme thermal behavior.\nWhile modern lattice dynamics methods enable routine predictions of kL within\nthe harmonic approximation and three-phonon scattering framework (HA+3ph),\nreliable results, especially for low-kL compounds, require higher-order\nanharmonic effects, including self-consistent phonon renormalization,\nfour-phonon scattering, and off-diagonal heat flux (SCPH+3,4ph+OD). We present\na high-throughput workflow integrating these effects into a unified framework.\nUsing this, we compute kL for 773 cubic and tetragonal inorganic compounds\nacross diverse chemistries and structures. From 562 dynamically stable\ncompounds, we assess the hierarchical effects of higher-order anharmonicity.\nFor about 60% of materials, HA+3ph predictions closely match those from\nSCPH+3,4ph+OD. However, SCPH corrections often increase kL, sometimes by over 8\ntimes, while four-phonon scattering universally reduces it, occasionally to 15%\nof the HA+3ph value. Off-diagonal contributions are minor in high-kL systems\nbut can be comparable to the diagonal ones in highly anharmonic, low-kL\ncompounds. We highlight four cases-Rb2TlAlH6, Cu3VS4, CuBr, and\nKTlCl4-exhibiting distinct anharmonic behaviors. This work delivers not only a\nrobust workflow for high-fidelity kL dataset but also a quantitative framework\nto determine when higher-order effects are essential. The hierarchy of kL\nresults, from the HA+3ph to SCPH+3,4ph+OD level, offers a scalable,\ninterpretable route to discovering next-generation extreme thermal materials.",
    "authors": [
      "Zhi Li",
      "Huiju Lee",
      "Chris Wolverton",
      "Yi Xia"
    ],
    "publication_date": "2025-07-15T21:30:09Z",
    "arxiv_id": "http://arxiv.org/abs/2507.11750v2",
    "download_url": "http://arxiv.org/abs/2507.11750v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MACE Foundation Models for Lattice Dynamics: A Benchmark Study on Double\n  Halide Perovskites",
    "abstract": "Recent developments in materials informatics and artificial intelligence has\nled to the emergence of foundational energy models for material chemistry, as\nrepresented by the suite of MACE-based foundation models, bringing a\nsignificant breakthrough in universal potentials for inorganic solids. As to\nall method developments in computational materials science, performance\nbenchmarking against existing high-level data with focusing on specific\napplications, is critically needed to understand the limitations in the models,\nthus facilitating the ongoing improvements in the model development process,\nand occasionally, leading to significant conceptual leaps in materials theory.\nHere, using our own published DFT (Density Functional Theory) database of\nroom-temperature dynamic stability and vibrational anharmonicity for $\\sim2000$\ncubic halide double perovskites, we benchmarked the performances of four\ndifferent variants of the MACE foundation models for screening the dynamic\nstabilities of inorganic solids. Our analysis shows that, as anticipated, the\nmodel accuracy improves with more training data. The dynamic stabilities of\nweakly anharmonic materials (as predicted by DFT) are more accurately\nreproduced by the foundation model, than those highly anharmonic and\ndynamically unstable ones. The predominant source of error in predicting the\ndynamic stability arises predominantly from the amplification of errors in\natomic forces when predicting the harmonic phonon properties through the\ncomputation of the Hessian matrix, less so is the contribution from possible\ndifferences in the range of the configurational spaces that are sampled by DFT\nand the foundation model in molecular dynamics. We hope that our present\nfindings will stimulate future works towards more physics-inspired approaches\nin assessing the accuracy of foundation models for atomistic modelling.",
    "authors": [
      "Jack Yang",
      "Ziqi Yin",
      "Lei Ao",
      "Sean Li"
    ],
    "publication_date": "2025-10-21T00:05:41Z",
    "arxiv_id": "http://arxiv.org/abs/2510.18178v1",
    "download_url": "http://arxiv.org/abs/2510.18178v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Assessing Thermodynamic Selectivity of Solid-State Reactions for the\n  Predictive Synthesis of Inorganic Materials",
    "abstract": "Synthesis is a major challenge in the discovery of new inorganic materials.\nCurrently, there is limited theoretical guidance for identifying optimal\nsolid-state synthesis procedures. We introduce two selectivity metrics, primary\nand secondary competition, to assess the favorability of target/impurity phase\nformation in solid-state reactions. We used these metrics to analyze 3,520\nsolid-state reactions in the literature, ranking existing approaches to popular\ntarget materials. Additionally, we implemented these metrics in a data-driven\nsynthesis planning workflow and demonstrated its application in the synthesis\nof barium titanate (BaTiO$_3$). Using an 18-element chemical reaction network\nwith first-principles thermodynamic data from the Materials Project, we\nidentified 82,985 possible BaTiO$_3$ synthesis reactions and selected nine for\nexperimental testing. Characterization of reaction pathways via synchrotron\npowder X-ray diffraction reveals that our selectivity metrics correlate with\nobserved target/impurity formation. We discovered two efficient reactions using\nunconventional precursors (BaS/BaCl$_2$ and Na$_2$TiO$_3$) that produce\nBaTiO$_3$ faster and with fewer impurities than conventional methods,\nhighlighting the importance of considering complex chemistries with additional\nelements during precursor selection. Our framework provides a foundation for\npredictive inorganic synthesis, facilitating the optimization of existing\nrecipes and the discovery of new materials, including those not easily\nattainable with conventional precursors.",
    "authors": [
      "Matthew J. McDermott",
      "Brennan C. McBride",
      "Corlyn Regier",
      "Gia Thinh Tran",
      "Yu Chen",
      "Adam A. Corrao",
      "Max C. Gallant",
      "Gabrielle E. Kamm",
      "Christopher J. Bartel",
      "Karena W. Chapman",
      "Peter G. Khalifah",
      "Gerbrand Ceder",
      "James R. Neilson",
      "Kristin A. Persson"
    ],
    "publication_date": "2023-08-22T22:40:10Z",
    "arxiv_id": "http://arxiv.org/abs/2308.11816v2",
    "download_url": "http://arxiv.org/abs/2308.11816v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling the Physical Properties of Environmentally-Friendly Optical\n  Magnetic Switches: DFT and TD-DFT",
    "abstract": "The dominant majority of the hundreds of available spin-crossover compounds,\nincluding the technologically most promising ones, are based on the\nEarth-abundant metal iron, making these switches particularly appealing in\nterms of sustainable technology. Furthermore, it has recently been established\nthat these materials may be synthesized using the techniques of Green\nChemistry. Spin crossover in transition metal complexes can be induced by a\nchange of temperature, by the application of an external pressure, or a\nmagnetic field, and also by photoexcitation. Given the wide variety of\nfunctionalities to which these bistable photomagnetic systems could give\naccess, they may be viewed as the prototypes of molecular-scale optomagnetic\nswitches. Hence, in response to the growing demand for storing and treating\nincreasingly-dense information, much effort has been devoted over several\ndecades to the design of transition metal materials exhibiting spin crossover\nin technologically-accessible temperature ranges. The cornerstone for designing\nnew efficient photoactive spin-crossover materials remains the ability to\npredict the magnetic behaviour and the photoresponse of any first-row\ntransition complex, and the manner in which its properties are influenced by\nits environment. This is a challenge for the inorganic chemist and also, most\nnotably, for the theoretical and the computational chemist. This chapter gives\nan overview of the issues tied to the application of DFT and TD-DFT to the\ncharacterisation of transition metal complexes in the framework of\nspin-crossover and related phenomena.",
    "authors": [
      "Latévi Max Lawson Daku",
      "Mark Earl Casida"
    ],
    "publication_date": "2012-01-11T20:36:17Z",
    "arxiv_id": "http://arxiv.org/abs/1201.2398v2",
    "download_url": "http://arxiv.org/abs/1201.2398v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New quantum number for the many-electron Dirac-Coulomb Hamiltonian",
    "abstract": "By breaking the spin symmetry in the relativistic domain, a powerful tool in\nphysical sciences was lost. In this work, we examine an alternative of spin\nsymmetry for systems described by the many-electron Dirac-Coulomb Hamiltonian.\nWe show that the square of many-electron operator $\\mathcal{K}_+$, defined as a\nsum of individual single-electron time-reversal (TR) operators, is a linear\nHermitian operator which commutes with the Dirac-Coulomb Hamiltonian in a\nfinite Fock subspace. In contrast to the square of a standard unitary\nmany-electron TR operator $\\mathcal{K}$, the $\\mathcal{K}^2_+$ has a rich\neigenspectrum having potential to substitute spin symmetry in the relativistic\ndomain. We demonstrate that $\\mathcal{K}_+$ is connected to $\\mathcal{K}$\nthrough an exponential mapping, in the same way as spin operators are mapped to\nthe spin rotational group. Consequently, we call $\\mathcal{K}_+$ the generator\nof the many-electron TR symmetry. By diagonalizing the operator\n$\\mathcal{K}^2_+$ in the basis of Kramers-restricted Slater determinants, we\nintroduce the relativistic variant of configuration state functions (CSF),\ndenoted as Kramers CSF. A new quantum number associated with $\\mathcal{K}^2_+$\nhas potential to be used in many areas, for instance, (a) to design effective\nspin Hamiltonians for electron spin resonance spectroscopy of heavy-element\ncontaining systems; (b) to increase efficiency of methods for the solution of\nmany-electron problems in relativistic computational chemistry and physics; (c)\nto define Kramers contamination in unrestricted density functional and\nHartree--Fock theory as a relativistic analog of the spin contamination in the\nnonrelativistic domain.",
    "authors": [
      "Stanislav Komorovsky",
      "Michal Repisky",
      "Lukáš Bučinský"
    ],
    "publication_date": "2016-07-06T09:17:09Z",
    "arxiv_id": "http://arxiv.org/abs/1607.01528v2",
    "download_url": "http://arxiv.org/abs/1607.01528v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hydrogen bonding to the cysteine ligand of superoxide reductase:\n  acid--base control of the reaction intermediates",
    "abstract": "Superoxide reductase SOR is a non-heme iron metalloenzyme that detoxifies\nsuperoxide radical in microorganisms. Its active site consists of an unusual\nnon-heme Fe2+ center in a [His4 Cys1] square pyramidal pentacoordination, with\nthe axial cysteine ligand proposed to be an essential feature in catalysis. Two\nNH peptide groups from isoleucine 118 and histidine 119 establish H-bondings\nwith the sulfur ligand (Desulfoarculus baarsii SOR numbering). In order to\ninvestigate the catalytic role of these H-bonds, the isoleucine 118 residue of\nthe SOR from Desulfoarculus baarsii was mutated into alanine, aspartate or\nserine residues. Resonance Raman spectroscopy showed that the mutations\nspecifically induced an increase of the strength of the Fe3+-S(Cys) and\nS-C$\\beta$(Cys) bonds as well as a change in conformation of the cysteinyl side\nchain, which was associated with the alteration of the NH hydrogen bonding to\nthe sulfur ligand. The effects of the isoleucine mutations on the reactivity of\nSOR with $O2\\bullet$- were investigated by pulse radiolysis. These studies\nshowed that the mutations induced a specific increase of the pKa of the first\nreaction intermediate, recently proposed to be an $Fe2+-O2\\bullet-$ species.\nThese data were supported by DFT calculations carried out on three models of\nthe $Fe2+-O2\\bullet-$ intermediate, with one, two or no H-bonds on the sulfur\nligand. Our results demonstrated that the hydrogen bonds between the NH\n(peptide) and the cysteine ligand tightly control the rate of protonation of\nthe $Fe2+-O2\\bullet-$ reaction intermediate to form an Fe3+-OOH species.",
    "authors": [
      "Emilie Tremey",
      "Florence Bonnot",
      "Yohann Moreau",
      "Catherine Berthomieu",
      "Alain Desbois",
      "Vincent Favaudon",
      "Geneviève Blondin",
      "Chantal Houée-Levin",
      "Vincent Nivière"
    ],
    "publication_date": "2015-01-07T10:56:18Z",
    "arxiv_id": "http://arxiv.org/abs/1501.01440v1",
    "download_url": "http://arxiv.org/abs/1501.01440v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sample Dependence of Magnetism in the Next Generation Cathode Material\n  LiNi$_{0.8}$Mn$_{0.1}$Co$_{0.1}$O$_2$",
    "abstract": "We present a structural and magnetic study on two batches of polycrystalline\nLiNi$_{0.8}$Mn$_{0.1}$Co$_{0.1}$O$_2$ (commonly known as Li NMC 811), a Ni-rich\nLi ion battery cathode material, using elemental analysis, X-ray and neutron\ndiffraction, magnetometry, and polarised neutron scattering measurements. We\nfind that the samples, labelled S1 and S2, have the composition\nLi$_{1-x}$Ni$_{0.9+x-y}$Mn$_y$Co$_{0.1}$O$_2$, with $x = 0.025(2)$, $y =\n0.120(2)$ for S1 and $x = 0.002(2)$, $y = 0.094(2)$ for S2, corresponding to\ndifferent concentrations of magnetic ions and excess Ni$^{2+}$ in the\nLi$^+$layers. Both samples show a peak in the zero-field cooled (ZFC) dc\nsusceptibility at 8.0(2) K but the temperature at which the ZFC and FC\n(field-cooled) curves deviate is substantially different: 64(2) K for S1 and\n122(2) K for S2. Ac susceptibility measurements show that the transition for S1\nshifts with frequency whereas no such shift is observed for S2 within the\nresolution of our measurements. Our results demonstrate the sample dependence\nof magnetic properties in Li NMC 811, consistent with previous reports on the\nparent material LiNiO$_2$. We further establish that a combination of\nexperimental techniques are necessary to accurately determine the chemical\ncomposition of next generation battery materials with multiple cations.",
    "authors": [
      "P. Mukherjee",
      "J. A. M. Paddison",
      "C. Xu",
      "Z. Ruff",
      "A. R. Wildes",
      "D. A. Keen",
      "R. I. Smith",
      "C. P. Grey",
      "S. E. Dutton"
    ],
    "publication_date": "2020-04-21T20:51:15Z",
    "arxiv_id": "http://arxiv.org/abs/2004.10297v2",
    "download_url": "http://arxiv.org/abs/2004.10297v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "$\\rm Li_x(C_5H_5N)_yFe_{2-z}Se_2$: a defect resilient expanded-lattice\n  high-temperature superconductor",
    "abstract": "Two-dimensional iron-chalcogenide intercalates display a remarkable\ncorrelation of the interlayer spacing with the enhancement of the\nsuperconducting critical temperature ($T_c$). In this work, synchrotron x-ray\nabsorption ($XAS$, at Fe and Se K edges) and emission ($XES$) spectroscopies,\nallow to discuss how the important rise of $T_c$ (44 K) in the molecule\nintercalated $\\rm Li_x(C_5H_5N)_yFe_{2-z}Se_2$ relates to the electronic and\nlocal structure changes felt by the inorganic host upon doping ($x$). $XES$\nshows that widely-separated layers of edge-sharing $\\rm FeSe_4$ tetrahedra,\ncarry low-spin moieties with a local Fe magnetic moment slightly reduced\ncompared to the parent $\\beta$-$\\rm Fe_{2-z}Se_2$. Pre-edge $XAS$ advises on\nthe progressively reduced mixing of metal $3d-4p$ states upon lithiation.\nDoping-mediated local lattice modifications, probed by conventional\n$T_c$-optimization measures (cf. anion height and $FeSe_4$ tetrahedra\nregularity), become less relevant when layers are spaced far away. On the basis\nof extended x-ray absorption fine structure, such distortions are compensated\nby a softer Fe-network that relates to Fe-site vacancies, alleviating\nelectron-lattice correlations and superconductivity. Density functional theory\n($DFT$) guided modification of isolated $\\rm Fe_{2-z}Se_2$ ($z$, vacant sites)\nplanes, resembling the host layers, identify that Fe-site deficiency occurs at\nlow energy cost, giving rise to stretched Fe-sheets, in accord with\nexperiments. The robust high-$T_c$ in $\\rm Li_x(C_5H_5N)_yFe_{2-z}Se_2$, arises\nfrom the interplay of electron donating spacers and the iron-selenide layers\ntolerance to defect chemistry, a tool to favorably tune its Fermi surface\nproperties.",
    "authors": [
      "Alexandros Deltsidis",
      "Laura Simonelli",
      "Georgios Vailakis",
      "Izar Capel Berdiell",
      "Georgios Kopidakis",
      "Anna Krzton-Maziopa",
      "Emil S. Bozin",
      "Alexandros Lappas"
    ],
    "publication_date": "2023-03-19T16:57:12Z",
    "arxiv_id": "http://arxiv.org/abs/2303.10716v1",
    "download_url": "http://arxiv.org/abs/2303.10716v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]