[
  {
    "title": "Relationships between distortions of inorganic framework and band gap of layered hybrid halide perovskites",
    "abstract": "The unprecedented structural flexibility and diversity of inorganic frameworks of layered hybrid halide perovskites (LHHPs) rise up a wide range of useful optoelectronic properties thus predetermining the extraordinary high interest to this family of materials. Nevertheless, the influence of different types of distortions of their inorganic framework on key physical properties such as band gap has not yet been quantitatively identified. We provided a systematic study of the relationships between LHHPs' band gaps and six main structural descriptors of inorganic framework, including interlayer distances (dint), in-plane and out-of-plane distortion angles in layers of octahedra (θin,θout), layer shift factor (LSF), axial and equatorial Pb-I bond distances (dax,deq). Using the set on the selected structural distortions we realized the inverse materials design based on multi-step DFT and machine learning approach to search LHHPs with target values of the band gap. The analysis of calculated descriptors band gap dependences for the wide range of generated model structures of (100) single-layered LHHPs results in the following descending order of their importance:dint > θin > dax > LSFmin > θout > deq > LSFmax, and also implies a strong interaction value for some pairs of structural descriptors. Moreover,we found that the structures with completely different distortions of inorganic framework can have similar band gap, as illustrated by a number of both experimental and model structures.",
    "authors": [
      "Ekaterina I. Marchenko",
      "Vadim V. Korolev",
      "Sergey A. Fateev",
      "Artem Mitrofanov",
      "Nickolay N. Eremin",
      "Eugene A. Goodilin",
      "Alexey B. Tarasov"
    ],
    "publication_date": "2021-05-11T14:35:42Z",
    "arxiv_id": "http://arxiv.org/abs/2105.05078v1",
    "download_url": "https://arxiv.org/abs/2105.05078v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ultrafast Inorganic Crystals with Mass Production Capability for Future High-Rate Experiments",
    "abstract": "Future HEP experiments present stringent challenges to inorganic scintillators in both fast timing response and radiation tolerance. This paper reports recent progress in developing ultrafast inorganic scintillators with sub-ns decay time for future precision timing detectors and high-rate experiments. Performance of fast and ultrafast crystals with mass production capability are compared to CsI crystals which are used for the Mu2e calorimeter. Examples are LYSO:Ce, BaF2 and BaF2:Y, which are considered for Mu2e-II. Crystal radiation hardness against gamma-rays and hadrons is reported. Current status and development effort for the BaF2:Y crystals are discussed.",
    "authors": [
      "Chen Hu",
      "Liyuan Zhang",
      "Ren-Yuan Zhu"
    ],
    "publication_date": "2022-03-13T23:57:27Z",
    "arxiv_id": "http://arxiv.org/abs/2203.06788v1",
    "download_url": "https://arxiv.org/abs/2203.06788v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Kolmogorov-Arnold Graph Neural Networks Applied to Inorganic Nanomaterials Dataset",
    "abstract": "The recent development of Kolmogorov-Arnold Networks (KANs) introduced new discoveries in the field of Graph Neural Networks (GNNs), expanding the existing set of models with KAN-based versions of GNNs, which often surpass the accuracy of MultiLayer Perceptron (MLP)-based GNNs. These models were widely tested on the graph datasets consisting of organic molecules; however, those studies disregarded the inorganic nanomaterials datasets. In this work, we close this gap by applying Kolmogorov-Arnold Graph Neural Networks (KAGNNs) to a recently published large inorganic nanomaterials dataset called CHILI. For this, we adapt and test KAGNNs appropriate for this dataset. Our experiments reveal that on the CHILI datasets, particularly on the CHILI-3K, KAGNNs substantially surpass conventional GNNs in classification, achieving state-of-the-art results.",
    "authors": [
      "Nikita Volzhin",
      "Soowhan Yoon"
    ],
    "publication_date": "2025-12-22T15:49:24Z",
    "arxiv_id": "http://arxiv.org/abs/2512.19494v1",
    "download_url": "https://arxiv.org/abs/2512.19494v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hybrid exciton-polaritons in a bad microcavity containing the organic and inorganic quantum wells",
    "abstract": "We study the hybrid exciton-polaritons in a bad microcavity containing the organic and inorganic quantum wells. The corresponding polariton states are given. The analytical solution and the numerical result of the stationary spectrum for the cavity field are finished",
    "authors": [
      "Yu-Xi Liu",
      "Chang-pu Sun"
    ],
    "publication_date": "2000-01-12T07:34:01Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0001037v1",
    "download_url": "https://arxiv.org/abs/quant-ph/0001037v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effect of inorganic cation mixing on hybrid halide perovskites using density functional theory for application in single and multi junction photovoltaics",
    "abstract": "This work is aimed to study mixed-cation (hybrid methyl ammonium plus inorganic cations) halide perovskites using first principles Density Functional Theory (DFT) formalism in order to find their potential applications in perovskite based photovoltaics. This is an addition to the two previous studies performed by the author on high-throughput screening of hybrid halide and inorganic halide perovskites. This work involves mixing certain amounts of the inorganic cation to the organic site (methyl ammonium) and study the electronic structure of the resultant. 63 perovskites have been simulated in their calculated stable phases and their band gaps have been predicted. Band gaps are important parameters to predict as these indicate their potential to be used as opto-electronic devices. From the calculated band gaps, 37 perovskites are predicted to be suitable for single junction as well as multi junction solar cell application, 7 are not suitable for either single or multi junction solar cells, and the rest 21 are suitable for multi junction but not for single junction solar cells. The study also shows interesting transition in the nature of the band gaps from indirect to direct and vice-versa caused at about 50% of inorganic cation mixing.",
    "authors": [
      "Manaswita Kar"
    ],
    "publication_date": "2021-10-18T15:54:43Z",
    "arxiv_id": "http://arxiv.org/abs/2110.09426v1",
    "download_url": "https://arxiv.org/abs/2110.09426v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Design of a Plastic Inorganic Semiconductor GaPS4-Based Gas Sensor for Conformal Monitoring of Gas Lines",
    "abstract": "This paper reports the first gas sensor based on the plastic inorganic semiconductor GaPS4, pioneering the application of plastic inorganic semiconductors in the field of gas sensing. Unlike traditional rigid sensors, this device leverages the unique layered structure and ultra-wide bandgap of GaPS4 to achieve high sensitivity and selectivity in detecting NO2. The intrinsic plastic deformability of the material enables it to conform tightly to complex curved pipelines like an \"electronic bandage,\" completely eliminating monitoring blind spots. Nanoindentation tests reveal that its extremely low hardness (0.20 GPa) confers exceptional flexibility while maintaining stable electrical characteristics even under bent states. The device exhibits a linear response to NO2 concentrations ranging from 1 to 10 ppm at room temperature. Although the limited defects in the single-crystal material result in pA-level response currents, defect engineering offers a viable pathway for performance enhancement. This study breaks through the conventional boundaries of plastic inorganic semiconductors confined to photoelectric and thermoelectric applications, opening new avenues for their use in gas sensing and advancing gas monitoring technology toward \"conformal integration.\"",
    "authors": [
      "Qiao Wang"
    ],
    "publication_date": "2025-11-26T12:56:14Z",
    "arxiv_id": "http://arxiv.org/abs/2511.21348v1",
    "download_url": "https://arxiv.org/abs/2511.21348v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Retrieval-Retro: Retrieval-based Inorganic Retrosynthesis with Expert Knowledge",
    "abstract": "While inorganic retrosynthesis planning is essential in the field of chemical science, the application of machine learning in this area has been notably less explored compared to organic retrosynthesis planning. In this paper, we propose Retrieval-Retro for inorganic retrosynthesis planning, which implicitly extracts the precursor information of reference materials that are retrieved from the knowledge base regarding domain expertise in the field. Specifically, instead of directly employing the precursor information of reference materials, we propose implicitly extracting it with various attention layers, which enables the model to learn novel synthesis recipes more effectively. Moreover, during retrieval, we consider the thermodynamic relationship between target material and precursors, which is essential domain expertise in identifying the most probable precursor set among various options. Extensive experiments demonstrate the superiority of Retrieval-Retro in retrosynthesis planning, especially in discovering novel synthesis recipes, which is crucial for materials discovery. The source code for Retrieval-Retro is available at https://github.com/HeewoongNoh/Retrieval-Retro.",
    "authors": [
      "Heewoong Noh",
      "Namkyeong Lee",
      "Gyoung S. Na",
      "Chanyoung Park"
    ],
    "publication_date": "2024-10-28T04:37:08Z",
    "arxiv_id": "http://arxiv.org/abs/2410.21341v3",
    "download_url": "https://arxiv.org/abs/2410.21341v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multinary Alloying Suppresses Defect Formation in Emerging Inorganic Solar Cells",
    "abstract": "The Cu2ZnSn(S, Se)4 (CZTSSe) emerging inorganic solar cell is highly promising for accelerating the large-scale and low-cost applications of thin-film photovoltaics. It possesses distinct advantages such as abundant and non-toxic constituent elements, high material stability, and excellent compatibility with industrial processes. However, CZTSSe solar cells still face challenges related to complex defects and charge losses. To overcome these limitations and improve the efficiency of CZTSSe solar cells, it is crucial to experimentally identify and mitigate deep defects. In this study, we reveal that the dominant deep defect in CZTSSe materials exhibits donor characteristics. We propose that incomplete cation exchange during the multi-step crystallization reactions of CZTSSe is the kinetics mechanism responsible for the defect formation. To address this issue, we introduce an elemental synergistic alloying approach aimed at weakening the metal-chalcogen bond strength and the stability of intermediate phases. This alloying strategy has facilitated the kinetics of cation exchange, leading to a significant reduction in charge losses within the CZTSSe absorber. As a result, we have achieved a cell efficiency of over 14.5%. These results represent a significant advancement for emerging inorganic solar cells and additionally bring more opportunities for the precise identification and regulation of defects in a wider range of multinary inorganic compounds.",
    "authors": [
      "Jiangjian Shi",
      "Jinlin Wang",
      "Fanqi Meng",
      "Jiazheng Zhou",
      "Xiao Xu",
      "Kang Yin",
      "Licheng Lou",
      "Menghan Jiao",
      "Bowen Zhang",
      "Huijue Wu",
      "Yanhong Luo",
      "Dongmei Li",
      "Qingbo Meng"
    ],
    "publication_date": "2023-06-26T12:07:22Z",
    "arxiv_id": "http://arxiv.org/abs/2306.14629v1",
    "download_url": "https://arxiv.org/abs/2306.14629v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Atomic structure of metal-halide perovskites from first principles: The chicken-and-egg paradox of the organic-inorganic interaction",
    "abstract": "We have studied the prototype hybrid organic-inorganic perovskite CH3NH3PbI3 and its three close relatives, CH3NH3SnI3, CH3NH3PbCl3 and CsPbI3, using relativistic density function theory. The long-range van der Waals (vdW) interactions were incorporated into the Perdew-Burke-Ernzerhof (PBE) exchange-correlation functional using the Tkatchenko-Scheffler pairwise scheme. Our results reveal that hydrogen bonding, which is well described by the PBE functional, plays a decisive role for the structural parameters of these systems, including the position and orientation of the organic cation as well as the deformation of the inorganic framework. The magnitude of the inorganic-framework deformation depends sensitively on the orientation of the organic cation, and directly influences the stability of the hybrid perovskites. Our results suggest that the organic and the inorganic components complement each other: The low symmetry of the organic cation is the origin of the inorganic-framework deformation, which then aids the overall stabilization of the hybrid perovskite structure. This stabilization is indirectly affected by vdW interactions, which lead to smaller unit-cell volumes than in PBE and therefore modulate the interaction between the organic cation and the inorganic framework. The vdW-induced lattice-constant corrections are system dependent and lead to PBE+vdW lattice constants in good agreement with experiment. Further insight is gained by analysing the vdW contributions. In all iodide-based hybrid perovskites the interaction between the organic cation and the iodide anions provides the largest lattice-constant change, followed by iodine-iodine and the organic cation - heavy-metal cation interaction. These corrections follow an almost linear dependence on the lattice constant within the range considered in our study, and are therefore approximately additive.",
    "authors": [
      "Jingrui Li",
      "Patrick Rinke"
    ],
    "publication_date": "2016-02-29T12:29:29Z",
    "arxiv_id": "http://arxiv.org/abs/1602.08935v2",
    "download_url": "https://arxiv.org/abs/1602.08935v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Charge transfer at hybrid inorganic-organic interfaces",
    "abstract": "Organic dopants are frequently used to surface-dope inorganic semiconductors. The resulted hybrid inorganic-organic materials have a crucial role in advanced functional materials and semiconductor devices. In this article, we study charge transfer at hybrid silicon-molecule interfaces theoretically. The idea is to filter out the best molecular acceptors to dope silicon with hole densities as high as 1013 cm-2. Here, we use a combinatorial algorithm merging chemical hardness method and first-principles DFT and GW calculations. We start by using the chemical hardness method which is simple and fast to narrow down our search for molecular dopants. Then, for the most optimistic candidates, we perform first-principles DFT calculations and discuss the necessity of GW corrections. This screening approach is quite general and applicable to other hybrid interfaces.",
    "authors": [
      "Xiaoming Wang",
      "Keivan Esfarjani",
      "Mona Zebarjadi"
    ],
    "publication_date": "2016-10-19T23:55:48Z",
    "arxiv_id": "http://arxiv.org/abs/1610.06247v1",
    "download_url": "https://arxiv.org/abs/1610.06247v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Implications and consequences of ferromagnetism universally exhibited by inorganic nanoparticles",
    "abstract": "Occurrence of surface ferromagnetism in inorganic nanoprticles as a universal property not only explains many of the unusual magnetic features of oxidic thin films, but also suggests its possible use in creating new materials, as exemplified by multiferroic BaTiO3 nanoparticles. While the use of Mn-doped ZnO and such materials in spintronics appears doubtful, it is possible to have materials exhibiting coexistence of (bulk) superconductivity with (surface) ferromagnetism.",
    "authors": [
      "A. Sundaresan",
      "C. N. R. Rao"
    ],
    "publication_date": "2009-05-02T07:51:11Z",
    "arxiv_id": "http://arxiv.org/abs/0905.0183v1",
    "download_url": "https://arxiv.org/abs/0905.0183v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Synthesis of organic-inorganic perovskite and all-inorganic lead-free double perovskite nanocrystals by femtosecond laser pulses",
    "abstract": "Perovskite materials are at the forefront of modern materials science due to their exceptional structural, electronic, and optical properties. The controlled fabrication of perovskite nanostructures is crucial for enhancing their performance, stability, and scalability, directly impacting their applications in next-generation devices such as solar cells, LEDs, and sensors. Here, we present a novel, ligand-free approach to synthesize perovskite nanocrystals (NCs) with average sizes up to 100 nm, using femtosecond pulsed laser ablation (PLA) in ambient air without additional liquid media. We demonstrate this method for both organic-inorganic (methylamino lead) hybrid perovskites (MAPbX3, X = Cl, Br, I) and fully inorganic lead-free double perovskites (Cs2AgBiX6, X = Cl, Br), achieving high-purity NCs without stabilizing ligands - a critical advancement over conventional chemical synthesis methods. By tailoring laser parameters, we systematically elucidate the influence of perovskite composition (halide type, organic vs. inorganic cation, single versus double perovskite structure) on the ablation process and the resulting nanocrystal properties. Transmission electron microscopy and X-ray diffraction confirm the preservation of crystallinity, with MAPbX3 forming larger (approximately 90 nm) cubic NCs and Cs2AgBiX6 forming smaller (approximately 10 nm) rounded NCs. Photoluminescence spectroscopy reveals pronounced size-dependent blue shifts (17-40 nm) due to quantum confinement, particularly for Br and I containing perovskites. This clean, scalable, and versatile PLA approach not only provides direct access to high-purity, ligand-free perovskite NCs with tunable optical properties but also represents a significant advance in the fabrication of nanostructures, enabling the exploration of new perovskite-based optoelectronic and quantum devices.",
    "authors": [
      "Volodymyr Vasylkovskyi",
      "Andrey Evlyukhin",
      "Elena Schlein",
      "Mykola Slipchenko",
      "Roman Kiyan",
      "Kestutis Kurselis",
      "Vladimir Dyakonov",
      "Boris Chichkov"
    ],
    "publication_date": "2025-10-31T15:45:19Z",
    "arxiv_id": "http://arxiv.org/abs/2510.27563v1",
    "download_url": "https://arxiv.org/abs/2510.27563v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A FLUKA study towards predicting hadron-specific damage due to high-energy hadrons in inorganic crystals for calorimetry",
    "abstract": "Hadrons emerging from high-energy collisions, as it is the case for protons and pions at the CERN Large Hadron Collider, can produce a damage to inorganic crystals that is specific and cumulative. The mechanism is well understood as due to bulk damage from fragments caused by fission. In this paper, the existing experimental evidence for lead tungstate, LYSO and cerium fluoride is summarised, a study using FLUKA simulations is described and its results are discussed and compared to measurements. The outcome corroborates the confidence in the predictive power of such simulations applied to inorganic scintillators, which are relevant to their adoption as scintillators for calorimetry.",
    "authors": [
      "G. Dissertori",
      "C. Martin Perez",
      "F. Nessi-Tedaldi"
    ],
    "publication_date": "2020-01-15T11:41:56Z",
    "arxiv_id": "http://arxiv.org/abs/2001.05491v1",
    "download_url": "https://arxiv.org/abs/2001.05491v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Low energy paths for octahedral tilting in inorganic halide perovskites",
    "abstract": "Instabilities relating to cooperative octahedral tilting is common in materials with perovskite structures, and in particular in the sub class of halide perovskites. In this work, the energetics of octahedral tilting in the inorganic metal halide perovskites CsPbI$_3$ and CsSnI$_3$ are investigated using first-principles density functional theory calculations. Several low energy paths between symmetry equivalent variants of the stable orthorhombic (\\textit{Pnma}) perovskite variant are identified and investigated. The results are in favor of the presence of dynamic disorder in the octahedral tilting phase transitions of inorganic halide perovskites. In particular, one specific type of path, corresponding to an out-of-phase \"tilt switch\", is found to have significantly lower energy barrier than the others, which indicates the existence of a temperature range where the dynamic fluctuations of the octahedra follow only this type of path. This could produce a time averaged structure corresponding to the intermediate tetragonal (\\textit{P4/mbm}) structure observed in experiments. Deficiencies of the commonly employed simple one-dimensional \"double well\" potentials in describing the dynamics of the octahedra are pointed out and discussed.",
    "authors": [
      "Johan Klarbring"
    ],
    "publication_date": "2018-02-26T22:28:54Z",
    "arxiv_id": "http://arxiv.org/abs/1802.09632v3",
    "download_url": "https://arxiv.org/abs/1802.09632v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ergodicity breaking of an inorganic glass in aging near ${T_g}$ probed by elasticity relaxation",
    "abstract": "We performed a series of aging experiments of an inorganic glass (As${_2}$Se${_3}$) at a temperature ${T_2}$ near the glass transition point ${T_g}$ by first relaxing it at ${T_1}$. The relaxation of Young's modulus was monitored, which was(almost if not ideally) exponential with a ${T_1}$-dependent relaxation time ${τ(T_1)}$. We demostrate the Kovacs' paradox for the first time in an inorganic glasses. Associated with the divergence of $τ$, the quasi-equilibrated Young's modulus ${E_\\infty}$ does not converge either. An elastic model of relaxation time and a Mori-Tanaka analysis of ${E_\\infty}$ lead to a similar estimate of the persistent memory of the history, ergodicity breaking within the accessible experimental time. Experiments with different ${T_2}$ exhibits a critical temperature ${T_p \\sim T_g}$, i.e., when ${T_2 > T_p}$, both $τ$ and ${E_\\infty}$ converge.",
    "authors": [
      "Jianbiao Wang",
      "Xu Wang",
      "Haihui Ruan"
    ],
    "publication_date": "2020-06-08T09:42:58Z",
    "arxiv_id": "http://arxiv.org/abs/2006.04434v2",
    "download_url": "https://arxiv.org/abs/2006.04434v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First-principles study on the electronic and optical properties of inorganic perovskite Rb1-xCsxPbI3 for solar cell applications",
    "abstract": "Recently, replacing or mixing organic molecules in the hybrid halide perovskites with the inorganic Cs or Rb cations has been reported to increase the material stability with the comparable solar cell performance. In this work, we systematically investigate the electronic and optical properties of all-inorganic alkali iodide perovskites Rb1-xCsxPbI3 using the first-principles virtual crystal approximation calculations. Our calculations show that as increasing the Cs content x, lattice constants, band gaps, exciton binding energies, and effective masses of charge carriers decrease following the quadratic (linear for effective masses) functions, while static dielectric constants increase following the quadratic function, indicating an enhancement of solar cell performance upon the Rb addition to CsPbI3. When including the many-body interaction within the GW approximation and incorporating the spin-orbit coupling (SOC), we obtain more reliable band gap compared with experiment for CsPbI3, highlighting the importance of using GW+SOC approach for the all-inorganic as well as organic-inorganic hybrid halide perovskite materials.",
    "authors": [
      "Un-Gi Jong",
      "Chol-Jun Yu",
      "Yun-Sim Kim",
      "Yun-Hyok Kye",
      "Chol-Ho Kim"
    ],
    "publication_date": "2018-05-09T01:29:42Z",
    "arxiv_id": "http://arxiv.org/abs/1805.03341v1",
    "download_url": "https://arxiv.org/abs/1805.03341v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Room Temperature Polariton Lasing in All-Inorganic Perovskites",
    "abstract": "Polariton lasing is the coherent emission arising from a macroscopic polariton condensate first proposed in 1996. Over the past two decades, polariton lasing has been demonstrated in a few inorganic and organic semiconductors in both low and room temperatures. Polariton lasing in inorganic materials significantly relies on sophisticated epitaxial growth of crystalline gain medium layers sandwiched by two distributed Bragg reflectors in which combating the built-in strain and mismatched thermal properties is nontrivial. On the other hand, organic active media usually suffer from large threshold density and weak nonlinearity due to the Frenkel exciton nature. Further development of polariton lasing towards technologically significant applications demand more accessible materials, ease of device fabrication and broadly tunable emission at room temperature. Herein, we report the experimental realization of room-temperature polariton lasing based on an epitaxy-free all-inorganic cesium lead chloride perovskite microcavity. Polariton lasing is unambiguously evidenced by a superlinear power dependence, macroscopic ground state occupation, blueshift of ground state emission, narrowing of the linewidth and the build-up of long-range spatial coherence. Our work suggests considerable promise of lead halide perovskites towards large-area, low-cost, high performance room temperature polariton devices and coherent light sources extending from the ultraviolet to near infrared range.",
    "authors": [
      "Rui Su",
      "Carole Diederichs",
      "Jun Wang",
      "Timothy C. H. Liew",
      "Jiaxin Zhao",
      "Sheng Liu",
      "Weigao Xu",
      "Zhanghai Chen",
      "Qihua Xiong"
    ],
    "publication_date": "2017-04-24T03:42:49Z",
    "arxiv_id": "http://arxiv.org/abs/1704.07030v1",
    "download_url": "https://arxiv.org/abs/1704.07030v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First-principles study on the chemical decomposition of inorganic perovskites \\ce{CsPbI3} and \\ce{RbPbI3} at finite temperature and pressure",
    "abstract": "Inorganic halide perovskite \\ce{Cs(Rb)PbI3} has attracted significant research interest in the application of light-absorbing material of perovskite solar cells (PSCs). Although there have been extensive studies on structural and electronic properties of inorganic halide perovskites, the investigation on their thermodynamic stability is lack. Thus, we investigate the effect of substituting Rb for Cs in \\ce{CsPbI3} on the chemical decomposition and thermodynamic stability using first-principles thermodynamics. By calculating the formation energies of solid solutions \\ce{Cs$_{1-x}$Rb$_x$PbI3} from their ingredients \\ce{Cs$_{1-x}$Rb$_x$I} and \\ce{PbI2}, we find that the best match between efficiency and stability can be achieved at the Rb content $x\\approx$ 0.7. The calculated Helmholtz free energy of solid solutions indicates that \\ce{Cs$_{1-x}$Rb$_x$PbI3} has a good thermodynamic stability at room temperature due to a good miscibility of \\ce{CsPbI3} and \\ce{RbPbI3}. Through lattice-dynamics calculations, we further highlight that \\ce{RbPbI3} never stabilize in cubic phase at any temperature and pressure due to the chemical decomposition into its ingredients \\ce{RbI} and \\ce{PbI2}, while \\ce{CsPbI3} can be stabilized in the cubic phase at the temperature range of 0$-$600 K and the pressure range of 0$-$4 GPa. Our work reasonably explains the experimental observations, and paves the way for understanding material stability of the inorganic halide perovskites and designing efficient inorganic halide PSCs.",
    "authors": [
      "Un-Gi Jong",
      "Chol-Jun Yu",
      "Yun-Hyok Kye",
      "Chol-Ho Kim",
      "Son-Guk Ri",
      "Yue Chen"
    ],
    "publication_date": "2018-07-06T06:35:45Z",
    "arxiv_id": "http://arxiv.org/abs/1807.02277v1",
    "download_url": "https://arxiv.org/abs/1807.02277v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding the Geometric Diversity of Inorganic and Hybrid Frameworks through Structural Coarse-Graining",
    "abstract": "Much of our understanding of complex structures is based on simplification: for example, metal-organic frameworks are often discussed in the context of \"nodes\" and \"linkers\", allowing for a qualitative comparison with simpler inorganic structures. Here we show how such an understanding can be obtained in a systematic and quantitative framework, by combining atom-density based similarity (kernel) functions and unsupervised machine learning with the long-standing idea of \"coarse-graining\" atomic structure. We demonstrate how the latter enables a comparison of vastly different chemical systems, and use it to create a unified, two-dimensional structure map of experimentally known tetrahedral AB2 networks - including clathrate hydrates, zeolitic imidazolate frameworks (ZIFs), and diverse inorganic phases. The structural relationships that emerge can then be linked to microscopic properties of interest, which we exemplify for structural heterogeneity and tetrahedral density.",
    "authors": [
      "Thomas C. Nicholas",
      "Andrew L. Goodwin",
      "Volker L. Deringer"
    ],
    "publication_date": "2020-05-20T09:52:37Z",
    "arxiv_id": "http://arxiv.org/abs/2005.09939v1",
    "download_url": "https://arxiv.org/abs/2005.09939v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Matrix- and tensor-based recommender systems for the discovery of currently unknown inorganic compounds",
    "abstract": "Chemically relevant compositions (CRCs) and atomic arrangements of inorganic compounds have been collected as inorganic crystal structure databases. Machine-learning is a unique approach to search for currently unknown CRCs from vast candidates. Herein we propose matrix- and tensor-based recommender system approaches to predict currently unknown CRCs from database entries of CRCs. Firstly, the performance of the recommender system approaches to discover currently unknown CRCs is examined. A Tucker decomposition recommender system shows the best discovery rate of CRCs as the majority of the top 100 recommended ternary and quaternary compositions correspond to CRCs. Secondly, systematic density functional theory (DFT) calculations are performed to investigate the phase stability of the recommended currently unknown CRCs. The phase stability of the 27 compositions reveals that 23 currently unknown compounds are stable. These results indicate that the recommender system has great potential to accelerate the discovery of new compounds.",
    "authors": [
      "Atsuto Seko",
      "Hiroyuki Hayashi",
      "Hisashi Kashima",
      "Isao Tanaka"
    ],
    "publication_date": "2017-09-20T07:35:05Z",
    "arxiv_id": "http://arxiv.org/abs/1710.00659v1",
    "download_url": "https://arxiv.org/abs/1710.00659v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Machine Learning Models for the Lattice Thermal Conductivity Prediction of Inorganic Materials",
    "abstract": "The lattice thermal conductivity ($κ_{\\rm L} $) is a critical property of thermoelectrics, thermal barrier coating materials and semiconductors. While accurate empirical measurements of $κ_{\\rm L} $ are extremely challenging, it is usually approximated through computational approaches, such as semi-empirical models, Green-Kubo formalism coupled with molecular dynamics simulations, and first-principles based methods. However, these theoretical methods are not only limited in terms of their accuracy, but sometimes become computationally intractable owing to their cost. Thus, in this work, we build a machine learning (ML)-based model to accurately and instantly predict $κ_{\\rm L}$ of inorganic materials, using a benchmark data set of experimentally measured $κ_{\\rm L} $ of about 100 inorganic solids. We use advanced and universal feature engineering techniques along with the Gaussian process regression algorithm, and compare the performance of our ML model with past theoretical works. The trained ML model is not only helpful for rational design and screening of novel materials, but we also identify key features governing the thermal transport behavior in non-metals.",
    "authors": [
      "Lihua Chen",
      "Huan Tran",
      "Rohit Batra",
      "Chiho Kim",
      "Rampi Ramprasad"
    ],
    "publication_date": "2019-06-14T19:43:18Z",
    "arxiv_id": "http://arxiv.org/abs/1906.06378v3",
    "download_url": "https://arxiv.org/abs/1906.06378v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predicting second virial coefficients of organic and inorganic compounds using Gaussian Process Regression",
    "abstract": "We show that by using intuitive and accessible molecular features it is possible to predict the temperature-dependent second virial coefficient of organic and inorganic compounds using Gaussian process regression. In particular, we built a low dimensional representation of features based on intrinsic molecular properties, topology and physical properties relevant for the characterization of molecule-molecule interactions. The featurization was used to predict second virial coefficients in the interpolative regime with a relative error $\\lesssim 1\\% $ and to extrapolate the prediction to temperatures outside of the training range for each compound in the dataset with a relative error of 2.14\\%. Additionally, the model's predictive abilities were extended to organic molecules unseen in the training process, yielding a prediction with a relative error of 2.66\\%. Therefore, apart from being robust, the present Gaussian process regression model is extensible to a variety of organic and inorganic compounds.",
    "authors": [
      "Miruna T. Cretu",
      "Jesús Pérez-Ríos"
    ],
    "publication_date": "2020-09-07T12:58:17Z",
    "arxiv_id": "http://arxiv.org/abs/2009.03073v2",
    "download_url": "https://arxiv.org/abs/2009.03073v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Physics-informed Neural Network (PINN) to Predict Vibrational Stability of Inorganic Semiconductors",
    "abstract": "We tackle the challenge of predicting vibrational stability in inorganic semiconductors for high-throughput screening, an essential attribute for evaluating synthesizability alongside thermodynamic stability, frequently missing in prominent materials databases. We create a physics-informed neural network (PINN) that incorporates the Born stability requirements directly into its loss function. This integration is a key learning constraint since it only allows the model to make predictions that do not violate fundamental physics. The model shows consistent and improved performance, having been trained on a dataset of 2112 inorganic materials with validated phonon spectra, and getting an F1-score of 0.83 for both stable and unstable classes. The model shows an AUC-ROC of 0.82 on a benchmark dataset of 1296 materials. Our PINN surpasses the best models in comparative tests, especially when it comes to accurately identifying unstable materials, which is crucial for a stability filter. This work offers a comprehensive screening tool for identifying materials and a methodology for incorporating domain knowledge to enhance predictive accuracy in materials informatics.",
    "authors": [
      "M. H. Zeb",
      "M. Z. Kabir"
    ],
    "publication_date": "2025-12-26T02:18:10Z",
    "arxiv_id": "http://arxiv.org/abs/2512.21830v1",
    "download_url": "https://arxiv.org/abs/2512.21830v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Integrating electronic structure into generative modeling of inorganic materials",
    "abstract": "Recent advances in generative models have introduced a new paradigm for the inverse design of inorganic materials, enabling the discovery of new crystalline structures with desired properties. However, existing generative models focus solely on structural aspects of materials during generation, while overlooking the underlying electronic behavior that fundamentally governs materials' stability and functionality. In this work, we present ChargeDIFF, the first generative model for inorganic materials that explicitly incorporates electronic structure into the generation process. Specifically, ChargeDIFF leverages charge density, a direct spatial representation of a material's electronic structure, as an additional modality for generation. ChargeDIFF demonstrates exceptional performance in both unconditional and conditional generation tasks compared to baseline models, with ablation studies revealing that this improvement is directly due to its ability to capture the material's electronic structure during generation. Moreover, the ability to control charge density during generation allows ChargeDIFF to introduce a novel inverse design method based on three-dimensional charge density, illustrating the potential to generate lithium-ion battery cathode materials with desired ion migration pathways, as validated by physics-based simulations. By highlighting the importance of accounting for electronic characteristics during material generation, ChargeDIFF offers new possibilities in the generative design of stable and functional materials.",
    "authors": [
      "Junkil Park",
      "Junyoung Choi",
      "Yousung Jung"
    ],
    "publication_date": "2025-11-18T08:03:01Z",
    "arxiv_id": "http://arxiv.org/abs/2511.14228v1",
    "download_url": "https://arxiv.org/abs/2511.14228v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structural and chemical mechanisms governing stability of inorganic Janus nanotubes",
    "abstract": "One-dimensional inorganic nanotubes hold promise for technological applications due to their distinct physical/chemical properties, but so far advancements have been hampered by difficulties in producing single-wall nanotubes with a well-defined radius. In this work we investigate, based on Density Functional Theory (DFT), the formation mechanism of 135 different inorganic nanotubes formed by the intrinsic self-rolling driving force found in asymmetric 2D Janus sheets. We show that for isovalent Janus sheets, the lattice mismatch between inner and outer atomic layers is the driving force behind the nanotube formation, while in the non-isovalent case it is governed by the difference in chemical bond strength of the inner and outer layer leading to steric effects. From our pool of candidate structures we have identified more than 100 tubes with a preferred radius below 35 Å, which we hypothesize can display unique properties compared to their parent 2D monolayers. Simple descriptors have been identified to accelerate the discovery of small-radius tubes and a Bayesian regression approach has been implemented to assess the uncertainty in our predictions on the radius.",
    "authors": [
      "Felix Tim Bölle",
      "August E. G. Mikkelsen",
      "Kristian S. Thygesen",
      "Tejs Vegge",
      "Ivano E. Castelli"
    ],
    "publication_date": "2020-11-30T11:37:55Z",
    "arxiv_id": "http://arxiv.org/abs/2011.14708v1",
    "download_url": "https://arxiv.org/abs/2011.14708v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Excellent magnetocaloric effect exhibited in the dense inorganic framework material Gd(OH)CO3",
    "abstract": "The excellent magnetocaloric effect of a dense inorganic framework, orthorhombic Gd(OH)CO3, is evaluated by isothermal magnetization and heat capacity measurements. The large -ΔSm, both in gravimetric and volumetric units, place it as a great candidate for cryogenic magnetic cooler.",
    "authors": [
      "Yan-Cong Chen",
      "Zhao-Sha Meng",
      "Lei Qin",
      "Yan-Zhen Zheng",
      "Jun-Liang Liu",
      "Fu-Sheng Guo",
      "Róbert Tarasenko",
      "Martin Orendáč",
      "Jan Prokleška",
      "Vladimír Sechovský",
      "Ming-Liang Tong"
    ],
    "publication_date": "2013-09-14T12:24:47Z",
    "arxiv_id": "http://arxiv.org/abs/1309.3653v1",
    "download_url": "https://arxiv.org/abs/1309.3653v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Metric-driven search for structurally stable inorganic compounds",
    "abstract": "We report a facile `metric' for the identification of structurally and dynamically (positive definite phonon structure) stable inorganic compounds. The metric considers charge-imbalance within the local substructures in crystalline compounds calculated using first-principles density-functional theory. To exemplify, we chose carbon-based nitrides as it provides a large pool of structurally stable and unstable phases. We showcase how local structural information related to Wyckoff symmetry uniquely identifies four new carbon-nitride phases. The metric predicts three new structurally stable phases of 4 (C)$:$3 (N) stoichiometry, i.e., C$_{4}$N$_{3}$, which is further confirmed by direct phonon calculations. The structurally stable phases also satisfy the thermodynamic stability and mechanical stability criteria. New phases possess extraordinary mechanical properties, similar to diamond, and show insulating bandgap ranging from optimal, 1.45 eV (optimal) to 5.5 eV (large gap). The structural, electronic, and optical properties of Pm(1)-C$_{4}$N$_{3}$, discussed in detail, indicate possible application in optoelectronic and photovoltaic technologies. The way metric is design, it can be used to predict stability of any material with three-dimensional bonding network. The metric was also able to predict structural stability of other nitride polymorphs with 100$\\%$ accuracy. We believe that the proposed `Metric' will accelerate the search of unknown and unexplored inorganic compounds by quick filtering of dynamically stable phases without expensive density-functional theory calculations.",
    "authors": [
      "R. Villarreal",
      "P. Singh",
      "R. Arroyave"
    ],
    "publication_date": "2020-11-17T21:06:15Z",
    "arxiv_id": "http://arxiv.org/abs/2011.08947v1",
    "download_url": "https://arxiv.org/abs/2011.08947v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Positively Charged Additives Facilitate Incorporation in Inorganic Single Crystals",
    "abstract": "Incorporation of guest additives within inorganic single crystals offers a unique strategy for creating nanocomposites with tailored properties. While anionic additives have been widely used to control the properties of crystals, their effective incorporation remains a key challenge. Here, we show that cationic additives are an excellent alterative for the synthesis of nanocomposites, where they are shown to deliver exceptional levels of incorporation of up to 70 wt% of positively charged amino acids, polymer particles, gold nanoparticles, and silver nanoclusters within inorganic single crystals. This high additive loading endows the nanocomposites with new functional properties including plasmon coupling, bright fluorescence, and surface-enhanced Raman scattering (SERS). Cationic additives are also shown to outperform their acidic counterparts, where they are highly active in a wider range of crystal systems, owing to their outstanding colloidal stability in the crystallization media and strong affinity for the crystal surfaces. This work demonstrates that although often overlooked, cationic additives can make valuable crystallization additives to create composite materials with tailored composition-structure-property relationships. This versatile and straightforward approach advances the field of single-crystal composites and provides exciting prospects for the design and fabrication of new hybrid materials with tunable functional properties.",
    "authors": [
      "Ouassef Nahi",
      "Alexander Broad",
      "Alexander N. Kulak",
      "Helen M. Freeman",
      "Shuheng Zhang",
      "Thomas D. Turner",
      "Lucien Roach",
      "Robert Darkins",
      "Ian J. Ford",
      "Fiona C. Meldrum"
    ],
    "publication_date": "2022-01-10T11:53:12Z",
    "arxiv_id": "http://arxiv.org/abs/2201.03298v1",
    "download_url": "https://arxiv.org/abs/2201.03298v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Accurate Crystal Structure Prediction of New 2D Hybrid Organic Inorganic Perovskites",
    "abstract": "Low dimensional hybrid organic-inorganic perovskites (HOIPs) represent a promising class of electronically active materials for both light absorption and emission. The design space of HOIPs is extremely large, since a diverse space of organic cations can be combined with different inorganic frameworks. This immense design space allows for tunable electronic and mechanical properties, but also necessitates the development of new tools for in silico high throughput analysis of candidate structures. In this work, we present an accurate, efficient, transferable and widely applicable machine learning interatomic potential (MLIP) for predicting the structure of new 2D HOIPs. Using the MACE architecture, an MLIP is trained on 86 diverse experimentally reported HOIP structures. The model is tested on 73 unseen perovskite compositions, and achieves chemical accuracy with respect to the reference electronic structure method. Our model is then combined with a simple random structure search algorithm to predict the structure of hypothetical HOIPs given only the proposed composition. Success is demonstrated by correctly and reliably recovering the crystal structure of a set of experimentally known 2D perovskites. Such a random structure search is impossible with ab initio methods due to the associated computational cost, but is relatively inexpensive with the MACE potential. Finally, the procedure is used to predict the structure formed by a new organic cation with no previously known corresponding perovskite. Laboratory synthesis of the new hybrid perovskite confirms the accuracy of our prediction. This capability, applied at scale, enables efficient screening of thousands of combinations of organic cations and inorganic layers.",
    "authors": [
      "Nima Karimitari",
      "William J. Baldwin",
      "Evan W. Muller",
      "Zachary J. L. Bare",
      "W. Joshua Kennedy",
      "Gábor Csányi",
      "Christopher Sutton"
    ],
    "publication_date": "2024-03-11T17:39:08Z",
    "arxiv_id": "http://arxiv.org/abs/2403.06955v1",
    "download_url": "https://arxiv.org/abs/2403.06955v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Representation of Inorganic Synthesis Reactions and Prediction: Graphical Framework and Datasets",
    "abstract": "While machine learning has enabled the rapid prediction of inorganic materials with novel properties, the challenge of determining how to synthesize these materials remains largely unsolved. Previous work has largely focused on predicting precursors or reaction conditions, but only rarely on full synthesis pathways. We introduce the ActionGraph, a directed acyclic graph framework that encodes both the chemical and procedural structure, in terms of synthesis operations, of inorganic synthesis reactions. Using 13,017 text-mined solid-state synthesis reactions from the Materials Project, we show that incorporating PCA-reduced ActionGraph adjacency matrices into a $k$-nearest neighbors retrieval model significantly improves synthesis pathway prediction. While the ActionGraph framework only results in a 1.34% and 2.76% increase in precursor and operation F1 scores (average over varying numbers of PCA components) respectively, the operation length matching accuracy rises 3.4 times (from 15.8% to 53.3%). We observe an interesting trade-off where precursor prediction performance peaks at 10-11 PCA components while operation prediction continues improving up to 30 components. This suggests composition information dominates precursor selection while structural information is critical for operation sequencing. Overall, the ActionGraph framework demonstrates strong potential, and with further adoption, its full range of benefits can be effectively realized.",
    "authors": [
      "Samuel Andrello",
      "Daniel Alabi",
      "Simon J. L. Billinge"
    ],
    "publication_date": "2025-12-02T17:19:05Z",
    "arxiv_id": "http://arxiv.org/abs/2512.02947v1",
    "download_url": "https://arxiv.org/abs/2512.02947v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Common acoustic phonon lifetimes in inorganic and hybrid lead halide perovskites",
    "abstract": "The acoustic phonons in the organic-inorganic lead halide perovskites have been reported to have anomalously short lifetimes over a large part of the Brillouin zone. The resulting shortened mean free paths of the phonons have been implicated as the origin of the low thermal conductivity. We apply neutron spectroscopy to show that the same acoustic phonon energy linewidth broadening (corresponding to shortened lifetimes) occurs in the fully inorganic CsPbBr$_{3}$ by comparing the results on the organic-inorganic CH$_{3}$NH$_{3}$PbCl$_{3}$. We investigate the critical dynamics near the three zone boundaries of the cubic $Pm\\overline{3}m$ Brillouin zone of CsPbBr$_{3}$ and find energy and momentum broadened dynamics at momentum points where the Cs-site ($A$-site) motions contribute to the cross section. Neutron diffraction is used to confirm that both the Cs and Br sites have unusually large thermal displacements with an anisotropy that mirrors the low temperature structural distortions. The presence of an organic molecule is not necessary to disrupt the low-energy acoustic phonons at momentum transfers located away from the zone center in the lead halide perovskites and such damping may be driven by the large displacements or possibly disorder on the $A$ site.",
    "authors": [
      "M. Songvilay",
      "N. Giles-Donovan",
      "M. Bari",
      "Z. -G. Ye",
      "J. L. Minns",
      "M. A. Green",
      "Guangyong Xu",
      "P. M. Gehring",
      "K. Schmalzl",
      "W. D. Ratcliff",
      "C. M. Brown",
      "D. Chernyshov",
      "W. van Beek",
      "S. Cochran",
      "C. Stock"
    ],
    "publication_date": "2019-08-27T09:15:31Z",
    "arxiv_id": "http://arxiv.org/abs/1908.10093v2",
    "download_url": "https://arxiv.org/abs/1908.10093v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Validation of the effective masses calculated using finite difference method on a five-point stencil for inorganic and organic semiconductors",
    "abstract": "We present a code to calculate effective masses from energy dispersion relation using finite difference method on a five-point stencil. We validate our code against inorganic (GaAs and InP) and organic (pentacene and rubrene) crystals.",
    "authors": [
      "Alexandr Fonari",
      "Christopher Sutton"
    ],
    "publication_date": "2013-02-20T15:32:24Z",
    "arxiv_id": "http://arxiv.org/abs/1302.4996v2",
    "download_url": "https://arxiv.org/abs/1302.4996v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Inorganic arrangement crystal beryllium, lithium, selenium and silicon",
    "abstract": "The use of inorganic crystals technology has been widely date. Since quartz crystals for watches in the nineteenth century, and common way radio in the early twentieth century, to computer chips with new semiconductor materials. Chemical elements such as beryllium, lithium, selenium and silicon, are widely used in technology. The development of new crystals arising from that arrangement can bring technological advances in several areas of knowledge. The likely difficulty of finding such crystals in nature or synthesized, suggest an advanced study of the subject. A study using computer programs with ab initio method was applied. As a result of the likely molecular structure of the arrangement of a crystal was obtained.",
    "authors": [
      "Ricardo Gobato",
      "Alekssander Gobato",
      "Desire Francine Gobato Fedrigo"
    ],
    "publication_date": "2015-08-01T23:37:36Z",
    "arxiv_id": "http://arxiv.org/abs/1508.00175v2",
    "download_url": "https://arxiv.org/abs/1508.00175v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Stabilization and Controlled Association of Inorganic Nanoparticles using Block Copolymers",
    "abstract": "We report on the structural properties of mixed aggregates made from rare-earth inorganic nanoparticles (radius 20 Angstroms) and polyelectrolyte-neutral block copolymers in aqueous solutions. Using scattering experiments and Monte Carlo simulations, we show that these mixed aggregates have a hierarchical core-shell microstructure. The core is made of densely packed nanoparticles and it is surrounded by a corona of neutral chains. This microstructure results from a process of controlled association and confers to the hybrid aggregates a remarkable colloidal stability.",
    "authors": [
      "K. Yokota",
      "M. Morvan",
      "J. -F. Berret",
      "J. Oberdisse"
    ],
    "publication_date": "2004-11-26T10:22:35Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0411668v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0411668v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unified Theory of Thermal Quenching in Inorganic Phosphors",
    "abstract": "We unify two prevailing theories of thermal quenching (TQ) in rare-earth-activated inorganic phosphors - the cross-over and auto-ionization mechanisms - into a single predictive model. Crucially, we have developed computable descriptors for activator environment stability from ab initio molecular dynamics simulations to predict TQ under the cross-over mechanism, which can be augmented by a band gap calculation to account for auto-ionization. The resulting TQ model predicts the experimental TQ in 29 known phosphors to within ~ 3-8%. Finally, we have developed an efficient topological approach to rapidly screen vast chemical spaces for the discovery of novel, thermally robust phosphors.",
    "authors": [
      "Mahdi Amachraa",
      "Zhenbin Wang",
      "Hanmei Tang",
      "Shruti Hariyani",
      "Chi Chen",
      "Jakoah Brgoch",
      "Shyue Ping Ong"
    ],
    "publication_date": "2019-10-28T03:20:01Z",
    "arxiv_id": "http://arxiv.org/abs/1910.12420v2",
    "download_url": "https://arxiv.org/abs/1910.12420v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemically reversible isomerization of inorganic clusters",
    "abstract": "Structural transformations in molecules and solids have generally been studied in isolation, while intermediate systems have eluded characterization. We show that a pair of CdS cluster isomers provides an advantageous experimental platform to study isomerization in well-defined atomically precise systems. The clusters coherently interconvert over an est. 1 eV energy barrier with a 140 meV shift in their excitonic energy gaps. There is a diffusionless, displacive reconfiguration of the inorganic core (solid-solid transformation) with first order (isomerization-like) transformation kinetics. Driven by a distortion of the ligand binding motifs, the presence of hydroxyl species changes the surface energy via physisorption, which determines phase stability in this system. This reaction possesses essential characteristics of both solid-solid transformations and molecular isomerizations, and bridges these disparate length scales.",
    "authors": [
      "Curtis B. Williamson",
      "Douglas R. Nevers",
      "Andrew Nelson",
      "Ido Hadar",
      "Uri Banin",
      "Tobias Hanrath",
      "Richard D. Robinson"
    ],
    "publication_date": "2019-06-26T11:37:56Z",
    "arxiv_id": "http://arxiv.org/abs/1906.10984v1",
    "download_url": "https://arxiv.org/abs/1906.10984v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Repulsion Between Inorganic Particles Inserted Within Surfactant Bilayers",
    "abstract": "We study by synchrotron small-angle x-ray scattering highly aligned lamellar phases of a zwitterionic surfactant, doped with monodisperse and spherical hydrophobic inorganic particles as a function of particle concentration. Analysis of the structure factor of the two-dimensional fluid formed by the particles in the plane of the bilayer gives access to their membrane-mediated interaction, which is repulsive, with a contact value of about 4k$_{\\text{B}}$T and a range of 14 Å. Systematic application of this technique should lead to a better understanding of the interaction between membrane inclusions.",
    "authors": [
      "Doru Constantin",
      "Brigitte Pansu",
      "Marianne Impéror",
      "Patrick Davidson",
      "François Ribot"
    ],
    "publication_date": "2015-04-05T11:14:42Z",
    "arxiv_id": "http://arxiv.org/abs/1504.01113v1",
    "download_url": "https://arxiv.org/abs/1504.01113v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structure motif centric learning framework for inorganic crystalline systems",
    "abstract": "Incorporation of physical principles in a network-based machine learning (ML) architecture is a fundamental step toward the continued development of artificial intelligence for materials science and condensed matter physics. In this work, as inspired by the Pauling rule, we propose that structure motifs (polyhedral formed by cations and surrounding anions) in inorganic crystals can serve as a central input to a machine learning framework for crystalline inorganic materials. Taking metal oxides as examples, we demonstrated that, an unsupervised learning algorithm Motif2Vec is able to convert the presence of structure motifs and their connections in a large set of crystalline compounds into unique vector representations. The connections among complex materials can be largely determined by the presence of different structure motifs and their clustering information are identified by our Motif2Vec algorithm. To demonstrate the novel use of structure motif information, we show that a motif-centric learning framework can be effectively created by combining motif information with the recently developed atom-based graph neural networks to form an atom-motif dual graph network (AMDNet). Taking advantage of node and edge information on both atomic and motif level, the AMDNet is more accurate than an atom graph network in predicting electronic structure related material properties of metal oxides such as band gaps. The work illustrates the route toward fundamental design of graph neural network learning architecture for complex material properties by incorporating beyond-atom physical principles.",
    "authors": [
      "Huta R. Banjade",
      "Sandro Hauri",
      "Shanshan Zhang",
      "Francesco Ricci",
      "Geoffroy Hautier",
      "Slobodan Vucetic",
      "Qimin Yan"
    ],
    "publication_date": "2020-07-08T14:18:22Z",
    "arxiv_id": "http://arxiv.org/abs/2007.04145v1",
    "download_url": "https://arxiv.org/abs/2007.04145v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Proof-of-principle of a new geometry for sampling calorimetry using inorganic scintillator plates",
    "abstract": "A novel geometry for a sampling calorimeter employing inorganic scintillators as an active medium is presented. To overcome the mechanical challenges of construction, an innovative light collection geometry has been pioneered, that minimises the complexity of construction. First test results are presented, demonstrating a successful signal extraction. The geometry consists of a sampling calorimeter with passive absorber layers interleaved with layers of an active medium made of inorganic scintillating crystals. Wavelength-shifting (WLS) fibres run along the four long, chamfered edges of the stack, transporting the light to photodetectors at the rear. To maximise the amount of scintillation light reaching the WLS fibres, the scintillator chamfers are depolished. It is shown herein that this concept is working for cerium fluoride (CeF$_3$) as a scintillator. Coupled to it, several different types of materials have been tested as WLS medium. In particular, materials that might be sufficiently resistant to the High-Luminosity Large Hadron Collider radiation environment, such as cerium-doped Lutetium-Yttrium Orthosilicate (LYSO) and cerium-doped quartz, are compared to conventional plastic WLS fibres. Finally, an outlook is presented on the possible optimisation of the different components, and the construction and commissioning of a full calorimeter cell prototype is presented.",
    "authors": [
      "R. Becker",
      "G. Dissertori",
      "A. Gendotti",
      "Q. Huang",
      "D. Luckey",
      "W. Lustermann",
      "S. Lutterer",
      "F. Nessi-Tedaldi",
      "F. Pandolfi",
      "F. Pauss",
      "M. Peruzzi",
      "M. Quittnat",
      "R. Wallny"
    ],
    "publication_date": "2014-05-23T12:34:33Z",
    "arxiv_id": "http://arxiv.org/abs/1405.6202v1",
    "download_url": "https://arxiv.org/abs/1405.6202v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shadow evaporation of epitaxial Al/Al2O3/Al tunnel junctions on sapphire utilizing an inorganic bilayer mask",
    "abstract": "This letter describes a new inorganic shadow mask that has been employed for the evaporation of all-epitaxial Al/Al2O3/Al superconducting tunnel junctions. Organic resists that are commonly used for shadow masks and other lift-off processes are not compatible with ultra-high vacuum deposition systems, and they can break down at even moderately elevated temperatures. The inorganic mask described herein does not suffer these same shortcomings. It was fabricated from a Ge/Nb bilayer, comprising suspended Nb bridges supported by an undercut Ge sacrificial layer. Utilizing such a bilayer mask on C-plane sapphire, the growth of epitaxial Al tunnel junctions was achieved using molecular beam epitaxy. Crystalline Al2O3 was grown diffusively at 300 C in a molecular oxygen background of 2.0 utorr, while amorphous oxide was grown at room temperature and 25 mtorr. A variety of analysis techniques were employed to evaluate the materials, and tunnel junction current-voltage characteristics were measured at millikelvin temperatures.",
    "authors": [
      "Paul B. Welander",
      "Vladimir Bolkhovsky",
      "Terence J. Weir",
      "Mark A. Gouker",
      "William D. Oliver"
    ],
    "publication_date": "2012-03-27T16:02:04Z",
    "arxiv_id": "http://arxiv.org/abs/1203.6007v1",
    "download_url": "https://arxiv.org/abs/1203.6007v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effects of inorganic seed promoters on MoS2 few-layers grown via chemical vapor deposition",
    "abstract": "In the last years, transition metal dichalcogenides (TMDs), especially at the two-dimensional (2D) limit, gained a large interest due to their unique optical and electronic properties. Among them, MoS2 received great attention from the scientific community due to its versatility, workability, and applicability in a large number of fields such as electronics, optoelectronics and electrocatalysis. To open the possibility of 2D-MoS2 exploitation, its synthesis over large macroscopic areas using cost-effective methods is fundamental. In this study, we report a method for the synthesis of large-area (~ cm2) few-layers MoS2 via liquid precursor CVD (L-CVD), where the Mo precursor (i.e. ammonium heptamolybdate AHM) is provided via a solution that is spin-coated over the substrate. Given the capability of organic and inorganic molecules, such as alkaline salts, to enhance MoS2 growth, we investigated the action of different inorganic salts as seed promoters. In particular, by using visible Raman spectroscopy, we focused on the effect of Na(OH), KCl, KI, and Li(OH) on the thickness, morphology, uniformity and degree of coverage of the grown MoS2. We optimized the process tuning parameters such as the volume of spin-coated solution, the growth temperature, and the seed promoter concentration, to synthesise the lowest possible thickness which resulted to be 2 layers (2L) of the highest quality. We witnessed that the addition of an inorganic seed promoter in the solution improves the extension of the grown MoS2 promoting lateral growth front, and therefore the degree of coverage. From this study, we conclude that, amongst the investigated seed promoters, K-based salts proved to grant the growth of high-quality two-layer MoS2 with optimal and uniform coverage of the SiO2/Si substrate surface.",
    "authors": [
      "Alessandro Cataldo",
      "Pinaka Pani Tummala",
      "Christian Martella",
      "Carlo Spartaco Casari",
      "Alessandro Molle",
      "Alessio Lamperti"
    ],
    "publication_date": "2023-10-23T13:28:37Z",
    "arxiv_id": "http://arxiv.org/abs/2310.14923v1",
    "download_url": "https://arxiv.org/abs/2310.14923v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Study of Deep Generative Models for Inorganic Chemical Compositions",
    "abstract": "Generative models based on generative adversarial networks (GANs) and variational autoencoders (VAEs) have been widely studied in the fields of image generation, speech generation, and drug discovery, but, only a few studies have focused on the generation of inorganic materials. Such studies use the crystal structures of materials, but material researchers rarely store this information. Thus, we generate chemical compositions without using crystal information. We use a conditional VAE (CondVAE) and a conditional GAN (CondGAN) and show that CondGAN using the bag-of-atom representation with physical descriptors generates better compositions than other generative models. Also, we evaluate the effectiveness of the Metropolis-Hastings-based atomic valency modification and the extrapolation performance, which is important to material discovery.",
    "authors": [
      "Yoshihide Sawada",
      "Koji Morikawa",
      "Mikiya Fujii"
    ],
    "publication_date": "2019-10-25T02:44:42Z",
    "arxiv_id": "http://arxiv.org/abs/1910.11499v1",
    "download_url": "https://arxiv.org/abs/1910.11499v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Are Mobilities in Hybrid Organic-Inorganic Halide Perovskites Actually 'High'?",
    "abstract": "We present an experimental and theoretical viewpoint on the electronic carrier mobilities of typical hybrid organic-inorganic perovskites (HOIPs). While these mobilities are often quoted as high, a review of them shows that although otherwise the semiconducting properties of HOIPs are impressively good, mobilities of HOIPs used in most solar cells are actually not that high. This is especially apparent if they are compared to those of inorganic semiconductors used in other high efficiency solar cells. We critically examine possible causes and focus on electron-lattice coupling mechanisms that are active at room temperature, and can lead to carrier scattering. From this, we propose scattering due to acoustic phonons or polarons as possible causes, but also point out the difficulties with each of these in view of additional experimental and theoretical findings in the literature. Further research in this direction will contribute to making HOIP solar cells even more efficient than they already are.",
    "authors": [
      "Thomas M. Brenner",
      "David A. Egger",
      "Andrew M. Rappe",
      "Leeor Kronik",
      "Gary Hodes",
      "David Cahen"
    ],
    "publication_date": "2015-10-29T22:10:52Z",
    "arxiv_id": "http://arxiv.org/abs/1510.08927v1",
    "download_url": "https://arxiv.org/abs/1510.08927v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Language Models Enable Data-Augmented Synthesis Planning for Inorganic Materials",
    "abstract": "Inorganic synthesis planning currently relies primarily on heuristic approaches or machine-learning models trained on limited datasets, which constrains its generality. We demonstrate that language models, without task-specific fine-tuning, can recall synthesis conditions. Off-the-shelf models, such as GPT-4.1, Gemini 2.0 Flash and Llama 4 Maverick, achieve a Top-1 precursor-prediction accuracy of up to 53.8 % and a Top-5 performance of 66.1 % on a held-out set of 1,000 reactions. They also predict calcination and sintering temperatures with mean absolute errors below 126 °C, matching specialized regression methods. Ensembling these language models further enhances predictive accuracy and reduces inference cost per prediction by up to 70 %. We subsequently employ language models to generate 28,548 synthetic reaction recipes, which we combine with literature-mined examples to pretrain a transformer-based model, SyntMTE. After fine-tuning on the combined dataset, SyntMTE reduces mean-absolute error in sintering temperature prediction to 73 °C and in calcination temperature to 98 °C. This strategy improves models by up to 8.7 % compared with baselines trained exclusively on experimental data. Finally, in a case study on Li7La3Zr2O12 solid-state electrolytes, we demonstrate that SyntMTE reproduces the experimentally observed dopant-dependent sintering trends. Our hybrid workflow enables scalable, data-efficient inorganic synthesis planning.",
    "authors": [
      "Thorben Prein",
      "Elton Pan",
      "Janik Jehkul",
      "Steffen Weinmann",
      "Elsa A. Olivetti",
      "Jennifer L. M. Rupp"
    ],
    "publication_date": "2025-06-14T15:55:05Z",
    "arxiv_id": "http://arxiv.org/abs/2506.12557v1",
    "download_url": "https://arxiv.org/abs/2506.12557v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electronic and Optical Properties of Zinc based Hybrid Organic-Inorganic Compounds for Ultraviolet Applications",
    "abstract": "Hybrid organic-inorganic (HOI) compounds are excellent candidates for a wide spectrum of applications in diverse fields such as optics, electronics, energy and biotechnology. Their broad range of versatility is achieved by combining the functionalities of organic and inorganic materials to generate unique properties. Current research has mostly focused on perovskite HOIs due to their wide range of uses in solar cells, photo detectors and memory devices. However, drawbacks such as instability and lead toxicity limit further implementation into other new areas. Thus, there is a need to develop stable and non-toxic HOI perovskite materials. Zinc is an attractive substitute for Pb in HOIs. Here, we apply a functionality based materials selection approach to screen for Zn-based HOI compounds from two crystallographic repositories; Inorganic Crystal Structure Database and American Mineralogist Crystal Structure Database. We successfully identify thirteen Zn-based HOI compounds. The electronic structure and optical properties of these compounds are investigated using density functional theory. The calculated optical absorbance fall within the far ultra-violet (FUV) region of 200-112 nm wavelength. We selected four of these compounds and calculated their band gaps; they were found to range between 4.9-5.7 eV. Considering that the UV absorbance is three times larger than average tissue absorbance and the refractive index (> 1.49) is greater than typical tissue materials, one could consider these Zn-based HOI compounds for selective photothermolysis treatment and UV protectant coating for electronic devices.",
    "authors": [
      "Trilochan Sahoo",
      "Uchenna A. Anene",
      "S. Pamir Alpay",
      "Sanjeev K. Nayak"
    ],
    "publication_date": "2019-07-12T17:32:23Z",
    "arxiv_id": "http://arxiv.org/abs/1907.05865v1",
    "download_url": "https://arxiv.org/abs/1907.05865v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optical orientation and alignment of excitons in ensembles of inorganic perovskite nanocrystals",
    "abstract": "We demonstrate the optical orientation and alignment of excitons in a two-dimensional layer of CsPbI$_3$ perovskite nanocrystals prepared by colloidal synthesis and measure the anisotropic exchange splitting of exciton levels in the nanocrystals. From the experimental data at low temperature (2K), we obtain the average value of anisotropic splitting of bright exciton states of the order of 120μeV. Our calculations demonstrate that there is a significant contribution to the splitting due to the nanocrystal shape anisotropy for all inorganic perovskite nanocrystrals.",
    "authors": [
      "M. O. Nestoklon",
      "S. V. Goupalov",
      "R. I. Dzhioev",
      "O. S. Ken",
      "V. L. Korenev",
      "Yu. G. Kusrayev",
      "V. F. Sapega",
      "C. de Weerd",
      "L. Gomez",
      "T. Gregorkiewicz",
      "Junhao Lin",
      "Kazutomo Suenaga",
      "Yasufumi Fujiwara",
      "L. B. Matyushkin",
      "I. N. Yassievich"
    ],
    "publication_date": "2018-02-02T15:18:37Z",
    "arxiv_id": "http://arxiv.org/abs/1802.00726v1",
    "download_url": "https://arxiv.org/abs/1802.00726v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Problematic zeolite records and bibliographic reference link for normal zeolite records in the Inorganic Crystal Structure Database",
    "abstract": "In this work we provide a list of 200 crystal entries in the Inorganic Crystal Structure Database (ICSD) that have errors, incomplete information, or are given a generic name of zeolite when they may belong to a different family of crystals. We also provide a table containing the ICSD code number of 1473 zeolite entries and the correspondence to the original bibliographic reference.",
    "authors": [
      "S. Yang",
      "M. Lach-hab",
      "I. I. Vaisman",
      "X. Li",
      "E. Blaisten-Barojas"
    ],
    "publication_date": "2009-08-28T00:04:28Z",
    "arxiv_id": "http://arxiv.org/abs/0908.4115v4",
    "download_url": "https://arxiv.org/abs/0908.4115v4",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "NEP89: Universal neuroevolution potential for inorganic and organic materials across 89 elements",
    "abstract": "While machine-learned interatomic potentials offer near-quantum-mechanical accuracy for atomistic simulations, many are material-specific or computationally intensive, limiting their broader use. Here we introduce NEP89, a foundation model based on neuroevolution potential architecture, delivering empirical-potential-like speed and high accuracy across 89 elements. A compact yet comprehensive training dataset covering inorganic and organic materials was curated through descriptor-space subsampling and iterative refinement across multiple datasets. NEP89 achieves competitive accuracy compared to representative foundation models while being three to four orders of magnitude more computationally efficient, enabling previously impractical large-scale atomistic simulations of inorganic and organic systems. In addition to its out-of-the-box applicability to diverse scenarios, including million-atom-scale compression of compositionally complex alloys, ion diffusion in solid-state electrolytes and water, rocksalt dissolution, methane combustion, and protein-ligand dynamics, NEP89 also supports fine-tuning for rapid adaptation to user-specific applications, such as mechanical, thermal, structural, and spectral properties of two-dimensional materials, metallic glasses, and organic crystals.",
    "authors": [
      "Ting Liang",
      "Ke Xu",
      "Eric Lindgren",
      "Zherui Chen",
      "Rui Zhao",
      "Jiahui Liu",
      "Esmée Berger",
      "Benrui Tang",
      "Bohan Zhang",
      "Yanzhou Wang",
      "Keke Song",
      "Penghua Ying",
      "Nan Xu",
      "Haikuan Dong",
      "Shunda Chen",
      "Paul Erhart",
      "Zheyong Fan",
      "Tapio Ala-Nissila",
      "Jianbin Xu"
    ],
    "publication_date": "2025-04-30T03:36:50Z",
    "arxiv_id": "http://arxiv.org/abs/2504.21286v2",
    "download_url": "https://arxiv.org/abs/2504.21286v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Many-body hybrid Excitons in Organic-Inorganic van der Waals Heterostructures",
    "abstract": "The coherent many-body interaction at the organic-inorganic interface can give rise to intriguing hybrid excitons that combine the advantages of the Wannier-Mott and Frenkel excitons simultaneously. Unlike the 2D inorganic heterostructures that suffer from moment mismatch, the hybrid excitons formed at the organic-inorganic interface have a momentum-direct nature, which have yet to be explored. Here, we report hybrid excitons at the copper phthalocyanine/molybdenum diselenide (CuPc/MoSe2) interface with strong molecular orientation dependence using low-temperature photoluminescence spectroscopy. The new emission peaks observed in the CuPc/MoSe2 heterostructure indicate the formation of interfacial hybrid excitons. The density functional theory (DFT) calculation confirms the strong hybridization between the lowest unoccupied molecular orbital (LUMO) of CuPc and the conduction band minimum (CBM) of MoSe2, suggesting that the hybrid excitons consist of electrons extended in both layers and holes confined in individual layers. The temperature-dependent measurements show that the hybrid excitons can gain the signatures of the Frenkel excitons of CuPc and the Wannier-Mott excitons of MoSe2 simultaneously. The out-of-plane molecular orientation is used to tailor the interfacial hybrid exciton states. Our results reveal the hybrid excitons at the CuPc/MoSe2 interface with tunability by molecular orientation, which suggests that the emerging organic-inorganic heterostructure can be a promising platform for many-body exciton physics.",
    "authors": [
      "Shaohua Fu",
      "Jianwei Ding",
      "Haifeng Lv",
      "Shuangyan Liu",
      "Kun Zhao",
      "Zhiying Bai",
      "Dawei He",
      "Rui Wang",
      "Jimin Zhao",
      "Xiaojun Wu",
      "Dongsheng Tang",
      "Xiaohui Qiu",
      "Yongsheng Wang",
      "Xiaoxian Zhang"
    ],
    "publication_date": "2023-01-06T14:29:08Z",
    "arxiv_id": "http://arxiv.org/abs/2301.02523v2",
    "download_url": "https://arxiv.org/abs/2301.02523v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Precise phase control of large-scale inorganic perovskites via vapor-phase anion-exchange strategy",
    "abstract": "Anion exchange offers great flexibility and high precision in phase control, compositional engineering and optoelectronic property tuning. Different from previous successful anion exchange process in liquid solution, herein, we develop a vapor-phase anion-exchange strategy to realize the precise phase and bandgap control of large-scale inorganic perovskites by using gas injection cycle, produing some perovskites such as CsPbCl3 which has never been reported in thin film morphology. Ab-initio calculations also provide the insightful mechanism to understand the impact of anion exchange on tuning the electronic properties and optimizing the structural stability. Furthermore, because of precise control of specific atomic concentrations, intriguing tunable photoluminsecence is observed and photodetectors with tunable photoresponse edge from green to ultraviolet light can be realized accurately with an ultrahigh spectral resolution of 1 nm. Therefore, we offer a new, universal vapor-phase anion exchange method for inorganic perovskite with fine-tunable optoelectronic properties.",
    "authors": [
      "Guobiao Cen",
      "Yufan Xia",
      "Chuanxi Zhao",
      "Yong Fu",
      "Yipeng An",
      "Ye Yuan",
      "Tingting Shi",
      "Wenjie Mai"
    ],
    "publication_date": "2020-09-30T00:04:25Z",
    "arxiv_id": "http://arxiv.org/abs/2009.14350v1",
    "download_url": "https://arxiv.org/abs/2009.14350v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generative adversarial networks (GAN) based efficient sampling of chemical space for inverse design of inorganic materials",
    "abstract": "A major challenge in materials design is how to efficiently search the vast chemical design space to find the materials with desired properties. One effective strategy is to develop sampling algorithms that can exploit both explicit chemical knowledge and implicit composition rules embodied in the large materials database. Here, we propose a generative machine learning model (MatGAN) based on a generative adversarial network (GAN) for efficient generation of new hypothetical inorganic materials. Trained with materials from the ICSD database, our GAN model can generate hypothetical materials not existing in the training dataset, reaching a novelty of 92.53% when generating 2 million samples. The percentage of chemically valid (charge neutral and electronegativity balanced) samples out of all generated ones reaches 84.5% by our GAN when trained with materials from ICSD even though no such chemical rules are explicitly enforced in our GAN model, indicating its capability to learn implicit chemical composition rules. Our algorithm could be used to speed up inverse design or computational screening of inorganic materials.",
    "authors": [
      "Yabo Dan",
      "Yong Zhao",
      "Xiang Li",
      "Shaobo Li",
      "Ming Hu",
      "Jianjun Hu"
    ],
    "publication_date": "2019-11-12T17:31:37Z",
    "arxiv_id": "http://arxiv.org/abs/1911.05020v1",
    "download_url": "https://arxiv.org/abs/1911.05020v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]