[
  {
    "title": "Analytical Framework for Credit Portfolios. Part I: Systematic Risk",
    "abstract": "Analytical, free of time consuming Monte Carlo simulations, framework for credit portfolio systematic risk metrics calculations is presented. Techniques are described that allow calculation of portfolio-level systematic risk measures (standard deviation, VaR and Expected Shortfall) as well as allocation of risk down to individual transactions. The underlying model is the industry standard multi-factor Merton-type model with arbitrary valuation function at horizon (in contrast to the simplistic default-only case). High accuracy of the proposed analytical technique is demonstrated by benchmarking against Monte Carlo simulations.",
    "authors": [
      "Mikhail Voropaev"
    ],
    "publication_date": "2009-11-02T01:26:06Z",
    "arxiv_id": "http://arxiv.org/abs/0911.0223v3",
    "download_url": "https://arxiv.org/abs/0911.0223v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graph Neural Net using Analytical Graph Filters and Topology Optimization for Image Denoising",
    "abstract": "While convolutional neural nets (CNNs) have achieved remarkable performance for a wide range of inverse imaging applications, the filter coefficients are computed in a purely data-driven manner and are not explainable. Inspired by an analytically derived CNN by Hadji et al., in this paper we construct a new layered graph neural net (GNN) using GraphBio as our graph filter. Unlike convolutional filters in previous GNNs, our employed GraphBio is analytically defined and requires no training, and we optimize the end-to-end system only via learning of appropriate graph topology at each layer. In signal filtering terms, it means that our linear graph filter at each layer is always intrepretable as low-pass with known biorthogonal conditions, while the graph spectrum itself is optimized via data training. As an example application, we show that our analytical GNN achieves image denoising performance comparable to a state-of-the-art CNN-based scheme when the training and testing data share the same statistics, and when they differ, our analytical GNN outperforms it by more than 1dB in PSNR.",
    "authors": [
      "Weng-tai Su",
      "Gene Cheung",
      "Richard Wildes",
      "Chia-Wen Lin"
    ],
    "publication_date": "2019-11-10T18:45:54Z",
    "arxiv_id": "http://arxiv.org/abs/1911.03975v2",
    "download_url": "https://arxiv.org/abs/1911.03975v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Versatile Capillary Cells for Handling Concentrated Samples in Analytical Ultracentrifugation",
    "abstract": "In concentrated macromolecular dispersions, far-from-ideal intermolecular interactions determine the dispersion behaviors including phase transition, crystallization, and liquid-liquid phase separation. Here, we present a novel versatile capillary-cell design for analytical ultracentrifugation-sedimentation equilibrium (AUC-SE), ideal for studying samples at high concentrations. Current setups for such studies are difficult and unreliable to handle, leading to a low experimental success rate. The design presented here is easy to use, robust, and reusable for samples in both aqueous and organic solvents while requiring no special tools or chemical modification of AUC cells. The key and unique feature is the fabrication of liquid reservoirs directly on the bottom window of AUC cells, which can be easily realized by laser ablation or mechanical drilling. The channel length and optical path length are therefore tunable. The success rate for assembling this new cell is close to 100%. We demonstrate the practicality of this cell by studying: 1) the equation of state and second virial coefficients of concentrated gold nanoparticle dispersions in water and bovine serum albumin (BSA) as well as lysozyme solution in aqueous buffers, 2) the gelation phase transition of DNA and BSA solutions, and 3) liquid-liquid phase separation of concentrated BSA/polyethylene glycol (PEG) droplets.",
    "authors": [
      "Quy Ong",
      "Xufeng Xu",
      "Francesco Stellacci"
    ],
    "publication_date": "2024-03-15T15:54:45Z",
    "arxiv_id": "http://arxiv.org/abs/2403.10418v1",
    "download_url": "https://arxiv.org/abs/2403.10418v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical solution of the Gross-Neveu model at finite density",
    "abstract": "Recent numerical calculations have shown that the ground state of the Gross-Neveu model at finite density is a crystal. Guided by these results, we can now present the analytical solution to this problem in terms of elliptic functions. The scalar potential is the superpotential of the non-relativistic Lame Hamiltonian. This model can also serve as analytically solvable toy model for a relativistic superconductor in the Larkin-Ovchinnikov-Fulde-Ferrell phase.",
    "authors": [
      "Michael Thies"
    ],
    "publication_date": "2003-08-25T08:33:43Z",
    "arxiv_id": "http://arxiv.org/abs/hep-th/0308164v2",
    "download_url": "https://arxiv.org/abs/hep-th/0308164v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards An Analytical Framework for Dynamic Potential Games",
    "abstract": "Potential game is an emerging notion and framework for studying N-player games, especially with heterogeneous players. In this paper, we build an analytical framework for dynamic potential games. We prove that a game is a dynamic potential game if and only if each player's value function can be decomposed as a potential function and a residual term which is solely dependent on other players' policies. This decomposition is consistent with the result in the static setting and enables us to identify and analyze an important and new class of dynamic potential games called the distributed game. Moreover, we prove that a game is a dynamic potential game if the value function has a symmetric Jacobian. This generalizes the differential characterization for static potential games by replacing the classical derivative with a new notation of functional derivative with respect to Markov policies. For a general class of continuous-time stochastic games, we explicitly characterize their potential functions. In particular, we show that the potential function of linear-quadratic games can be studied through a system of linear ODEs. Furthermore, under a rank condition on control coefficients, we prove a linear-quadratic game is a Markov potential game if and only if all players have identical cost functions.",
    "authors": [
      "Xin Guo",
      "Yufei Zhang"
    ],
    "publication_date": "2023-10-03T17:58:53Z",
    "arxiv_id": "http://arxiv.org/abs/2310.02259v3",
    "download_url": "https://arxiv.org/abs/2310.02259v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Influence of personal values and the adoption of analytical tools using laddering methodology",
    "abstract": "Analytical tools in business management are understood as a combination of information technologies and quantitative methods used to assist stakeholders to make better decisions. The contemporary business environment is dramatically changing by the massive accumulation of data. Now, as never before, the use of analytical tools must be expanded to take advantage of this growing digital universe. This article will apply the laddering technique to see how personal values (or managerial functions) influence a companys adoption of analytical tools. A set of ten in-depth interviews are conducted with CEOs, analytics consultants, academics and businessmen in order to establish quantitative relations among attributes, consequences and personal values. Two easy-to-read outputs are provided to interpret our results. The most important links are quantitatively associated through an implication matrix, and then visually represented on a hierarchical value map. Guidelines for improving the use of analytical tools are provided in the last section",
    "authors": [
      "Igor Barahona",
      "Alex Riba",
      "James Freeman"
    ],
    "publication_date": "2016-02-05T17:40:45Z",
    "arxiv_id": "http://arxiv.org/abs/1607.07796v1",
    "download_url": "https://arxiv.org/abs/1607.07796v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-equilibrium quantum transport and analytical conductance formula in spin-textured diffusive superconducting heterostructures",
    "abstract": "We study non-equilibrium quantum transport of spin, heat, and charge in diffusive heterostructures including both superconductors and materials with spin-dependent fields, such as textured ferromagnets and spin-orbit coupled materials. Using the quasiclassical theory of superconductivity, we derive a general analytical formula for the zero-temperature charge conductance valid in the non-linear regime. The analytical results are in excellent agreement with previous numerical calculations at small but finite temperatures. We predict a strong deviation between the conductance spectra and local density of states in certain junctions, which is important to correctly identify spectroscopic fingerprints of unconventional superconductivity.",
    "authors": [
      "Tom Doekle Vethaak",
      "Jabir Ali Ouassou",
      "Jacob Linder"
    ],
    "publication_date": "2017-06-09T18:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/1706.03069v2",
    "download_url": "https://arxiv.org/abs/1706.03069v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical solution of thermal magnetization on memory stabilizer structures",
    "abstract": "We return to the question of how the choice of stabilizer generators affects the preservation of information on structures whose degenerate ground state encodes a classical redundancy code. Controlled-not gates are used to transform the stabilizer Hamiltonian into a Hamiltonian consisting of uncoupled single spins and/or pairs of spins. This transformation allows us to obtain an analytical partition function and derive closed form equations for the relative magnetization and susceptibility. These equations are in agreement with the numerical results presented in [arXiv:0907.0394v1] for finite size systems. Analytical solutions show that there is no finite critical temperature, Tc=0, for all of the memory structures in the thermodynamic limit. This is in contrast to the previously predicted finite critical temperatures based on extrapolation. The mismatch is a result of the infinite system being a poor approximation even for astronomically large finite size systems, where spontaneous magnetization still arises below an apparent finite critical temperature. We extend our analysis to the canonical stabilizer Hamiltonian. Interestingly, Hamiltonians with two-body interactions have a higher apparent critical temperature than the many-body Hamiltonian.",
    "authors": [
      "Yu Tomita",
      "C. Ricardo Viteri",
      "Kenneth R. Brown"
    ],
    "publication_date": "2010-06-23T16:19:01Z",
    "arxiv_id": "http://arxiv.org/abs/1006.4581v2",
    "download_url": "https://arxiv.org/abs/1006.4581v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modelling the level of adoption of analytical tools; An implementation of multi-criteria evidential reasoning",
    "abstract": "In the future, competitive advantages will be given to organisations that can extract valuable information from massive data and make better decisions. In most cases, this data comes from multiple sources. Therefore, the challenge is to aggregate them into a common framework in order to make them meaningful and useful. This paper will first review the most important multi-criteria decision analysis methods (MCDA) existing in current literature. We will offer a novel, practical and consistent methodology based on a type of MCDA, to aggregate data from two different sources into a common framework. Two datasets that are different in nature but related to the same topic are aggregated to a common scale by implementing a set of transformation rules. This allows us to generate appropriate evidence for assessing and finally prioritising the level of adoption of analytical tools in four types of companies. A numerical example is provided to clarify the form for implementing this methodology. A six-step process is offered as a guideline to assist engineers, researchers or practitioners interested in replicating this methodology in any situation where there is a need to aggregate and transform multiple source data.",
    "authors": [
      "Igor Barahona",
      "Judith Cavazos",
      "Jian-Bo Yang"
    ],
    "publication_date": "2016-02-11T23:02:10Z",
    "arxiv_id": "http://arxiv.org/abs/1602.03926v1",
    "download_url": "https://arxiv.org/abs/1602.03926v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dialogue on analytical and ab initio methods in attoscience",
    "abstract": "The perceived dichotomy between analytical and ab initio approaches to theory in attosecond science is often seen as a source of tension and misconceptions. This Topical Review compiles the discussions held during a round-table panel at the 'Quantum Battles in Attoscience' CECAM virtual workshop, to explore the sources of tension and attempt to dispel them. We survey the main theoretical tools of attoscience -- covering both analytical and numerical methods -- and we examine common misconceptions, including the relationship between ab initio approaches and the broader numerical methods, as well as the role of numerical methods in 'analytical' techniques. We also evaluate the relative advantages and disadvantages of analytical as well as numerical and ab initio methods, together with their role in scientific discovery, told through the case studies of two representative attosecond processes: non-sequential double ionisation and resonant high-harmonic generation. We present the discussion in the form of a dialogue between two hypothetical theoreticians, a numericist and an analytician, who introduce and challenge the broader opinions expressed in the attoscience community.",
    "authors": [
      "Gregory S. J. Armstrong",
      "Margarita A. Khokhlova",
      "Marie Labeye",
      "Andrew S. Maxwell",
      "Emilio Pisanty",
      "Marco Ruberti"
    ],
    "publication_date": "2021-01-22T21:13:35Z",
    "arxiv_id": "http://arxiv.org/abs/2101.09335v3",
    "download_url": "https://arxiv.org/abs/2101.09335v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data-driven Analytical Models of COVID-2019 for Epidemic Prediction, Clinical Diagnosis, Policy Effectiveness and Contact Tracing: A Survey",
    "abstract": "The widely spread CoronaVirus Disease (COVID)-19 is one of the worst infectious disease outbreaks in history and has become an emergency of primary international concern. As the pandemic evolves, academic communities have been actively involved in various capacities, including accurate epidemic estimation, fast clinical diagnosis, policy effectiveness evaluation and development of contract tracing technologies. There are more than 23,000 academic papers on the COVID-19 outbreak, and this number is doubling every 20 days while the pandemic is still on-going [1]. The literature, however, at its early stage, lacks a comprehensive survey from a data analytics perspective. In this paper, we review the latest models for analyzing COVID19 related data, conduct post-publication model evaluations and cross-model comparisons, and collect data sources from different projects.",
    "authors": [
      "Ying Mao",
      "Susiyan Jiang",
      "Daniel Nametz",
      "Yuxin Lin",
      "Jake Hack",
      "John Hensley",
      "Ryan Monaghan",
      "Tess Gutenbrunner"
    ],
    "publication_date": "2020-06-24T18:50:26Z",
    "arxiv_id": "http://arxiv.org/abs/2006.13994v2",
    "download_url": "https://arxiv.org/abs/2006.13994v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical computation of bifurcation of orbits near collinear libration point in the restricted three-body problem",
    "abstract": "A unified analytical solution is presented for constructing the phase space near collinear libration points in the Circular Restricted Three-body Problem (CRTBP), encompassing Lissajous orbits and quasihalo orbits, their invariant manifolds, as well as transit and non-transit orbits. Traditional methods could only derive separate analytical solutions for the invariant manifolds of Lissajous orbits and halo orbits, falling short for the invariant manifolds of quasihalo orbits. By introducing a coupling coefficient η and a bifurcation equation, a unified series solution for these orbits is systematically developed using a coupling-induced bifurcation mechanism and Lindstedt-Poincaré method. Analyzing the third-order bifurcation equation reveals bifurcation conditions for halo orbits, quasihalo orbits, and their invariant manifolds. Furthermore, new families of periodic orbits similar to halo orbits are discovered, and non-periodic/quasi-periodic orbits, such as transit orbits and non-transit orbits, are found to undergo bifurcations. When η = 0, the series solution describes Lissajous orbits and their invariant manifolds, transit, and non-transit orbits. As η varies from zero to non-zero values, the solution seamlessly transitions to describe quasihalo orbits and their invariant manifolds, as well as newly bifurcated transit and non-transit orbits. This unified analytical framework provides a more comprehensive understanding of the complex phase space structures near collinear libration points in the CRTBP.",
    "authors": [
      "Mingpei Lin",
      "Tong Luo",
      "Hayato Chiba"
    ],
    "publication_date": "2024-03-27T03:56:14Z",
    "arxiv_id": "http://arxiv.org/abs/2403.18237v1",
    "download_url": "https://arxiv.org/abs/2403.18237v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A review of analytical performance modeling and its role in computer engineering and science",
    "abstract": "This article is a review of analytical performance modeling for computer systems. It discusses the motivation for this area of research, examines key issues, introduces some ideas, illustrates how it is applied, and points out a role that it can play in developing Computer Science.",
    "authors": [
      "Y. C. Tay"
    ],
    "publication_date": "2020-05-27T03:53:41Z",
    "arxiv_id": "http://arxiv.org/abs/2005.13144v1",
    "download_url": "https://arxiv.org/abs/2005.13144v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical Solution of Magnetically Dominated Astrophysical Jets and Winds: Jet Launching, Acceleration, and Collimation",
    "abstract": "We present an analytical solution of a highly magnetized jet/wind flow. The left side of the general force-free jet/wind equation (the \"pulsar\" equation) is separated into a rotating and a nonrotating term. The two equations with either term can be solved analytically, and the two solutions match each other very well. Therefore, we obtain a general approximate solution of a magnetically dominated jet/wind, which covers from the nonrelativistic to relativistic regimes, with the drift velocity well matching the cold plasma velocity. The acceleration of a jet includes three stages. (1) The jet flow is located within the Alfvén critical surface (i.e. the light cylinder), has a nonrelativistic speed, and is dominated by toroidal motion. (2) The jet is beyond the Alfvén critical surface where the flow is dominated by poloidal motion and becomes relativistic. The total velocity in these two stages follows the same law $vΓ=ΩR$. (3) The evolution law is replaced by $vΓ\\approx1/\\left(θ\\sqrt{2-ν}\\right)$, where $θ$ is the half-opening angle of the jet and $0\\leqν\\leq2$ is a free parameter determined by the magnetic field configuration. This is because the earlier efficient acceleration finally breaks the causality connection between different parts in the jet, preventing a global solution. The jet has to carry local charges and currents to support an electromagnetic balance. This approximate solution is consistent with known theoretical results and numerical simulations, and it is more convenient to directly compare with observations. This theory may be used to constrain the spin of black holes in astrophysical jets.",
    "authors": [
      "Liang Chen",
      "Bing Zhang"
    ],
    "publication_date": "2020-10-27T17:28:50Z",
    "arxiv_id": "http://arxiv.org/abs/2010.14470v3",
    "download_url": "https://arxiv.org/abs/2010.14470v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The luminosity-redshift relation in brane-worlds: I. Analytical results",
    "abstract": "The luminosity distance - redshift relation is analytically given for generalized Randall-Sundrum type II brane-world models containing dark radiation. The derived expressions contain both elementary functions and elliptic integrals of the first and second kind. First we derive the relation for models with the Randall-Sundrum fine-tuning. Then we generalize the method for models with cosmological constant. The analytical results are suitable for testing brane-world models when future supernova data at higher redshifts will be available.",
    "authors": [
      "Zoltán Keresztes",
      "László Á. Gergely",
      "Botond Nagy",
      "Gyula M. Szabó"
    ],
    "publication_date": "2006-06-28T21:17:22Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0606698v3",
    "download_url": "https://arxiv.org/abs/astro-ph/0606698v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exact analytical solution for an Israel-Stewart Cosmology",
    "abstract": "In this article we report a novel analytic solution for a cosmological model with a matter content described by a one component dissipative fluid, in the framework of the causal Israel-Stewart theory. Some physically well motivated analytical relations for the bulk viscous coefficient, the relaxation time and a bariotropic equation of state are postulated. We study within the parameter space, which label the solution, a suited region compatible with an accelerated expansion of the universe for late times, as well as stability properties of the solution at the critical parameter values $ γ= 1$ and for $ s = 1/2 $. We study as well the consequences that arise from the positiveness of the entropy production along the time evolution. In general, the accelerated expansion at late times is only possible when $ε\\geq 1/18$, which implies a very large non-adiabatic contribution the speed of sound.",
    "authors": [
      "Norman Cruz",
      "Esteban González",
      "Guillermo Palma"
    ],
    "publication_date": "2018-12-12T16:33:33Z",
    "arxiv_id": "http://arxiv.org/abs/1812.05009v3",
    "download_url": "https://arxiv.org/abs/1812.05009v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Benchmarking Analytical Query Processing in Intel SGXv2",
    "abstract": "Trusted Execution Environments (TEEs), such as Intel's Software Guard Extensions (SGX), are increasingly being adopted to address trust and compliance issues in the public cloud. Intel SGX's second generation (SGXv2) addresses many limitations of its predecessor (SGXv1), offering the potential for secure and efficient analytical cloud DBMSs. We assess this potential and conduct the first in-depth evaluation study of analytical query processing algorithms inside SGXv2. Our study reveals that, unlike SGXv1, state-of-the-art algorithms like radix joins and SIMD-based scans are a good starting point for achieving high-performance query processing inside SGXv2. However, subtle hardware and software differences still influence code execution inside SGX enclaves and cause substantial overheads. We investigate these differences and propose new optimizations to bring the performance inside enclaves on par with native code execution outside enclaves.",
    "authors": [
      "Adrian Lutsch",
      "Muhammad El-Hindi",
      "Matthias Heinrich",
      "Daniel Ritter",
      "Zsolt István",
      "Carsten Binnig"
    ],
    "publication_date": "2024-03-18T15:27:35Z",
    "arxiv_id": "http://arxiv.org/abs/2403.11874v3",
    "download_url": "https://arxiv.org/abs/2403.11874v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reviewing Data Visualization: an Analytical Taxonomical Study",
    "abstract": "This paper presents an analytical taxonomy that can suitably describe, rather than simply classify, techniques for data presentation. Unlike previous works, we do not consider particular aspects of visualization techniques, but their mechanisms and foundational vision perception. Instead of just adjusting visualization research to a classification system, our aim is to better understand its process. For doing so, we depart from elementary concepts to reach a model that can describe how visualization techniques work and how they convey meaning.",
    "authors": [
      "Jose F. Rodrigues",
      "Agma J. M. Traina",
      "Maria Cristina F. de Oliveira",
      "Caetano Traina"
    ],
    "publication_date": "2015-06-09T16:08:19Z",
    "arxiv_id": "http://arxiv.org/abs/1506.02976v1",
    "download_url": "https://arxiv.org/abs/1506.02976v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analytical modelling of temperature effects on synapses",
    "abstract": "It was previously reported, that temperature may significantly influence neural dynamics on different levels of brain modelling. Due to this fact, while creating the model in computational neuroscience we would like to make it scalable for wide-range of various brain temperatures. However currently, because of a lack of experimental data and an absence of analytical model describing temperature influence on synapses, it is not possible to include temperature effects on multi-neuron modelling level. In this paper, we propose first step to deal with this problem: new analytical model of AMPA-type synaptic conductance, which is able to include temperature effects in low-frequency stimulations. It was constructed on basis of Markov model description of AMPA receptor kinetics and few simplifications motivated both experimentally and from Monte Carlo simulation of synaptic transmission. The model may be used for efficient and accurate implementation of temperature effects on AMPA receptor conductance in large scale neural network simulations. This in fact, opens wide-range of new possibilities for researching an influence of temperature on brain functioning.",
    "authors": [
      "Dominik S. Kufel",
      "Grzegorz M. Wojcik"
    ],
    "publication_date": "2016-10-03T16:12:27Z",
    "arxiv_id": "http://arxiv.org/abs/1610.00611v1",
    "download_url": "https://arxiv.org/abs/1610.00611v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ram Pressure Stripping Made Easy: An Analytical Approach",
    "abstract": "The removal of gas by ram pressure stripping of galaxies is treated by a purely kinematic description. The solution has two asymptotic limits: if the duration of the ram pressure pulse exceeds the period of vertical oscillations perpendicular to the galactic plane, the commonly used quasi-static criterion of Gunn & Gott is obtained which uses the maximum ram pressure that the galaxy has experienced along its orbit. For shorter pulses the outcome depends on the time-integrated ram pressure. This parameter pair fully describes the gas mass fraction that is stripped from a given galaxy. This approach closely reproduces results from SPH simulations. We show that typical galaxies follow a very tight relation in this parameter space corresponding to a pressure pulse length of about 300 Myr. Thus, the Gunn & Gott criterion provides a good description for galaxies in larger clusters. Applying the analytic description to a sample of 232 Virgo galaxies from the GoldMine database, we show that the ICM provides indeed the ram pressures needed to explain the deficiencies. We also can distinguish current and past strippers, including objects whose stripping state was unknown.",
    "authors": [
      "J. Koppen",
      "P. Jachym",
      "R. Taylor",
      "J. Palous"
    ],
    "publication_date": "2018-06-15T10:19:22Z",
    "arxiv_id": "http://arxiv.org/abs/1806.05887v1",
    "download_url": "https://arxiv.org/abs/1806.05887v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]