[
  {
    "title": "Analytical Modelling of the Spread of Disease in Confined and Crowded Spaces",
    "abstract": "Since 1927, until recently, models describing the spread of disease have mostly been of the SIR-compartmental type, based on the assumption that populations are homogeneous and well-mixed. The focus of these models have typically been on large-scale analysis of scenarios such as cities, nations or even world scale. SIR models are appealing because of their simplicity, but their parameters, especially the transmission rate, are complex and depend on a number of factors, which makes it hard to predict how a change of a single environmental, demographic, or epidemiological factor will affect the population. Therefore, in this contribution we start to unpick the transmission-rate parameter. Analysing the implications that arise when taking crowd behaviour explicitly into account, we show how both the rate of infection as well as the walking speed depend on the local crowd density around an infected individual. The combined effect is that the rate of infection at a population scale has an analytically tractable non-linear dependency on crowd density. We model the spread of a hypothetical disease in a corridor and compare our new model with a typical compartmental model, which highlights the regime in which current models may not produce credible results.",
    "authors": [
      "Lara Goscé",
      "David A W Barton",
      "Anders Johansson"
    ],
    "publication_date": "2013-08-15T11:11:41Z",
    "arxiv_id": "http://arxiv.org/abs/1308.3361v2",
    "download_url": "https://arxiv.org/abs/1308.3361v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantitative Analytical Model for Scattering-type Scanning Near-field Optical Spectroscopy",
    "abstract": "Scattering-type scanning near-field optical microscopy (s-SNOM) is a versatile technique in nanooptics, enabling local probing of optical responses beyond the diffraction limit from vis to THz frequencies. Its theoretical modeling based on tip-sample interactions typically relies on computationally intensive numerical methods or phenomenological models with empiric fitting parameters, complicating spectral analysis and interpretation. Developing a rigorous quantitative analytical model remains a significant challenge in near-field microscopy. Here, we introduce an accurate analytical solution for the prolate spheroid model of s-SNOM in the quasi-electrostatic limit. We validate our solution through comparisons with numerical simulations and experimental spectra. Due to its higher computational efficiency compared to numerical simulation and higher accuracy compared to phenomenological solutions, our solution for spheroid model facilitates spectrum prediction and interpretation for homogeneous bulk samples, enables systematic exploration of parameter effects, and supports data generation for machine learning applications. Furthermore, the generality of our approach allows straightforward extension to more complex nanostructures.",
    "authors": [
      "Kirill V. Voronin",
      "Iker Herrero León",
      "Rainer Hillenbrand",
      "Alexey Y. Nikitin"
    ],
    "publication_date": "2025-08-22T13:16:52Z",
    "arxiv_id": "http://arxiv.org/abs/2508.16365v2",
    "download_url": "https://arxiv.org/abs/2508.16365v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]