[
  {
    "title": "Controlled and Continuous Patterning of Organic and Inorganic Materials by Induced Nucleation in an Optical Tweezers",
    "abstract": "We demonstrate for the first time controlled patterning by inducing nucleation of material from a dense aqueous dispersion or solution in an optical tweezers. A hot spot is formed on a glass surface by the trapping laser due to which a water vapor bubble is formed causing Gibbs-Marangoni convection of material around the bubble. This results in accretion of material around the bubble, which eventually nucleates into a crystalline state of the material. The nucleation site, when moved by translating the microscope stage of the optical tweezers apparatus, forms a pattern. We have demonstrated the technique using exotic inorganic materials such as soft oxometalates, and organic materials such as glycine, paracetamol, and a fluorescent dye such as perylene. We have written patterns over lengths of nearly 1 mm at the rate of 1 Hz, with best resolution of about 1 micron. The technique has potential for a wide range of applications ranging from solution processed printable electronics to controlled catalysis.",
    "authors": [
      "Basudev Roy",
      "Manish Arya",
      "Preethi Thomas",
      "Julius Konstantin Jürgschat",
      "Venkat Rao",
      "Ayan Banerjee",
      "Chilla Malla Reddy",
      "Soumyajit Roy"
    ],
    "publication_date": "2013-03-08T10:21:36Z",
    "arxiv_id": "http://arxiv.org/abs/1303.1934v2",
    "download_url": "https://arxiv.org/abs/1303.1934v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Aggregation of dipolar molecules in SiO$_2$ hybrid organic inorganic films: use of silver nanoparticles as inhibitors of molecular aggregation",
    "abstract": "The technological implementation of hybrid organic-inorganic materials in second order nonlinear optical photonic devices depends strongly on the ability of the host matrixes to contain high loads of dipolar molecules without aggregation. Some organic molecules are often used to diminish the attracting interactions between dipolar molecules in such kind of materials, but their efficiency as inhibitors of molecular aggregation is limited by their polarizability. In this work, we report the use of silver nanoparticles as inhibitors of molecular aggregation in hybrid organic-inorganic films doped with dipolar molecules. The large polarizability of the silver nanoparticles makes them ideal moieties for the inhibition of the electrostatic interactions between dipolar nonlinear optical molecules. The average size of the silver nanoparticles in this work was 70.5 nm in diameter, they were synthesized using silver nitrate (AgNO$_3$) as precursor and aminoethylaminopropyltrimethoxysilane as reducing agent. These nanoparticles were immersed in SiO$_2$ hybrid organic-inorganic sol-gel films doped with dipolar chromophores to study their effect as inhibitors of dipolar chromophores aggregation. The presence of the silver nanoparticles in the solid films was confirmed by transmission electronic microscopy and UV-Visible spectroscopy. UV-Visible spectroscopy was also used to monitor the dipolar chromophores aggregation in the SiO$_2$ films. We found that, at room temperature, silver nanoparticles are good inhibiting chromophores aggregation in comparison with the performance of organic inhibitors.",
    "authors": [
      "Alfredo Franco",
      "Jorge García-Macedo",
      "Giovanna Brusatin",
      "Massimo Guglielmi"
    ],
    "publication_date": "2025-01-31T10:18:26Z",
    "arxiv_id": "http://arxiv.org/abs/2501.19006v1",
    "download_url": "https://arxiv.org/abs/2501.19006v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ultrafast charge transfer and vibronic coupling in a laser-excited hybrid inorganic/organic interface",
    "abstract": "Hybrid interfaces formed by inorganic semiconductors and organic molecules are intriguing materials for opto-electronics. Interfacial charge transfer is primarily responsible for their peculiar electronic structure and optical response. Hence, it is essential to gain insight into this fundamental process also beyond the static picture. Ab initio methods based on real-time time-dependent density-functional theory coupled to the Ehrenfest molecular dynamics scheme are ideally suited for this problem. We investigate a laser-excited hybrid inorganic/organic interface formed by the electron acceptor molecule 2,3,5,6-tetrafluoro-7,7,8,8-tetracyano-quinodimethane (F4TCNQ) physisorbed on a hydrogenated silicon cluster, and we discuss the fundamental mechanisms of charge transfer in the ultrashort time window following the impulsive excitation. The considered interface is $p$-doped and exhibits charge transfer in the ground state. When it is excited by a resonant laser pulse, the charge transfer across the interface is additionally increased, but contrary to previous observations in all-organic donor/acceptor complexes, it is not further promoted by vibronic coupling. In the considered time window of 100~fs, the molecular vibrations are coupled to the electron dynamics and enhance intramolecular charge transfer. Our results highlight the complexity of the physics involved and demonstrate the ability of the adopted formalism to achieve a comprehensive understanding of ultrafast charge transfer in hybrid materials.",
    "authors": [
      "Matheus Jacobs",
      "Jannis Krumland",
      "Ana M. Valencia",
      "Haiyuan Wang",
      "Mariana Rossi",
      "Caterina Cocchi"
    ],
    "publication_date": "2020-03-27T10:54:56Z",
    "arxiv_id": "http://arxiv.org/abs/2003.12325v1",
    "download_url": "https://arxiv.org/abs/2003.12325v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Precursor recommendation for inorganic synthesis by machine learning materials similarity from scientific literature",
    "abstract": "Synthesis prediction is a key accelerator for the rapid design of advanced materials. However, determining synthesis variables such as the choice of precursor materials is challenging for inorganic materials because the sequence of reactions during heating is not well understood. In this work, we use a knowledge base of 29,900 solid-state synthesis recipes, text-mined from the scientific literature, to automatically learn which precursors to recommend for the synthesis of a novel target material. The data-driven approach learns chemical similarity of materials and refers the synthesis of a new target to precedent synthesis procedures of similar materials, mimicking human synthesis design. When proposing five precursor sets for each of 2,654 unseen test target materials, the recommendation strategy achieves a success rate of at least 82%. Our approach captures decades of heuristic synthesis data in a mathematical form, making it accessible for use in recommendation engines and autonomous laboratories.",
    "authors": [
      "Tanjin He",
      "Haoyan Huo",
      "Christopher J. Bartel",
      "Zheren Wang",
      "Kevin Cruse",
      "Gerbrand Ceder"
    ],
    "publication_date": "2023-02-05T04:57:59Z",
    "arxiv_id": "http://arxiv.org/abs/2302.02303v2",
    "download_url": "https://arxiv.org/abs/2302.02303v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhanced stability of 2D organic-inorganic halide perovskites by doping and heterostructure engineering",
    "abstract": "Organic-inorganic halide perovskite solar cells have recently attracted much attention due to their low-cost fabrication, flexibility, and high-power conversion efficiency. The reduction from three- to two-dimension (2D) promises an exciting opportunity to tune the electronic properties of organic-inorganic halide perovskites. Here, we propose first-principles density-functional theory based route to study the effect of reduced dimensionality, impurity doping, and heterostructure engineering on energy stability, band-gap and transport properties of 2D hybrid organic-inorganic halide perovskites. We show that the energetic stability of two-dimensional organic-inorganic halide perovskites can be significantly enhanced by chemically depositing MoS2 monolayer as a precursor in the system by heterostructure engineering. While on one hand, the structures have similar and excellent transport properties as their bulk counterparts, on the other, they possess the advantage of a broad range of tunable band gaps. Our predictions will expedite future efforts (both theoretical and experimental) in the synthesis, measurements and applications of high performance perovskites.",
    "authors": [
      "Rahul Singh",
      "Prashant Singh",
      "Ganesh Balasubramanian"
    ],
    "publication_date": "2018-07-03T14:54:44Z",
    "arxiv_id": "http://arxiv.org/abs/1807.01221v2",
    "download_url": "https://arxiv.org/abs/1807.01221v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structure, biomineralization and biodegradation of Ca-Mg oxyfluorosilicates synthesized by inorganic salt coprecipitation",
    "abstract": "In this research, a novel group of Ca-Mg oxyfluorosilicates containing different levels of fluoride substituting for oxide was synthesized by an inorganic salt coprecipitation process followed by calcination/sintering. The effects of the incorporation of fluoride on the resultant structural characteristics, apatite-forming ability and biodegradability were evaluated by X-ray diffraction, transmission electron microscopy, scanning electron microscopy/energy-dispersive X-ray spectroscopy, Fourier transform infrared spectroscopy, inductively coupled plasma spectroscopy and pH measurements. According to the results, the samples containing up to 2 mol% F present a single-phase structure of diopside (MgCaSi2O6) doped with F. It was also found that to meet the most biomineralization characteristic, the optimal value of fluoride in the homogeneous samples is 1 mol%. In this regard, on the one hand, the partial incorporation of fluoride into apatite (via forming fluorohydroxyapatite) and, on the other hand, the absence of fluorite (CaF2) as a consumer of Ca in the deposits are responsible for achieving the most apatite-forming ability circumstance controlled by an ion-exchange reaction mechanism. In conclusion, this study reflects the merit of the optimization of fluoride-doping into Ca-Mg silicates for development in biomedicine.",
    "authors": [
      "E. Salahinejad",
      "M. Jafari Baghjeghaz"
    ],
    "publication_date": "2025-12-24T03:34:24Z",
    "arxiv_id": "http://arxiv.org/abs/2512.21369v1",
    "download_url": "https://arxiv.org/abs/2512.21369v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrically tunable organic-inorganic hybrid polaritons with monolayer WS2",
    "abstract": "Exciton-polaritons are quasiparticles consisting of a linear superposition of photonic and excitonic states, offering potential for nonlinear optical devices. The excitonic component of the polariton provides a finite Coulomb scattering cross section, such that the different types of exciton found in organic materials (Frenkel) and inorganic materials (Wannier-Mott) produce polaritons with different interparticle interaction strength. A hybrid polariton state with distinct excitons provides a potential technological route towards in-situ control of nonlinear behaviour. Here we demonstrate a device in which hybrid polaritons are displayed at ambient temperatures, the excitonic component of which is part Frenkel and part Wannier-Mott, and in which the dominant exciton type can be switched with an applied voltage. The device consists of an open microcavity containing both organic dye and a monolayer of the transition metal dichalcogenide WS$_2$. Our findings offer a perspective for electrically controlled nonlinear polariton devices at room temperature.",
    "authors": [
      "Lucas C. Flatten",
      "David M. Coles",
      "Zhengyu He",
      "David. G. Lidzey",
      "Robert A. Taylor",
      "Jamie H. Warner",
      "Jason M. Smith"
    ],
    "publication_date": "2016-08-18T14:27:32Z",
    "arxiv_id": "http://arxiv.org/abs/1608.05274v2",
    "download_url": "https://arxiv.org/abs/1608.05274v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structural disorder by octahedral tilting in inorganic halide perovskites: New insight with Bayesian optimization",
    "abstract": "Structural disorder is common in metal-halide perovskites and important for understanding the functional properties of these materials. First-principles methods can address structure variation on the atomistic scale, but they are often limited by the lack of structure-sampling schemes required to characterize the disorder. In this work, structural disorder in the benchmark inorganic halide perovskites CsPbI$_3^{}$ and CsPbBr$_3^{}$ is computationally studied in terms of the three octahedral-tilting angles. The consequent variation in energetics and properties are described by three-dimensional potential-energy surfaces (PESs) and property landscapes, delivered by Bayesian Optimization Structure Search method with integrated density-functional-theory (DFT) calculations. The rapid convergence of the PES with about 200 DFT data points in three-dimensional searches demonstrates the power of active learning and strategic sampling with Bayesian optimization. Further analysis indicates that disorder grows with increasing temperature, and reveals that the materials band gap at finite temperatures is a statistical mean over disordered structures.",
    "authors": [
      "Jingrui Li",
      "Fang Pan",
      "Guo-Xu Zhang",
      "Zenghui Liu",
      "Hua Dong",
      "Dawei Wang",
      "Zhuangde Jiang",
      "Wei Ren",
      "Zuo-Guang Ye",
      "Milica Todorović",
      "Patrick Rinke"
    ],
    "publication_date": "2023-03-15T07:56:41Z",
    "arxiv_id": "http://arxiv.org/abs/2303.08426v1",
    "download_url": "https://arxiv.org/abs/2303.08426v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lone-Pair Stereochemistry Induces Ferroelectric Distortion and the Rashba Effect in Inorganic Halide Perovskites",
    "abstract": "The lone-pair s states of germanium, tin, and lead underlie many of the unconventional properties of the inorganic metal halide perovskites. Dynamic stereochemical expression of the lone pairs is well established for perovskites based on all three metals, but previously only the germanium perovskites were thought to express the lone pair crystallographically. In this work, we use advanced first-principles calculations with a hybrid functional and spin-orbit coupling to predict stable monoclinic polar phases of $\\mathrm{CsSnI}_3$ and $\\mathrm{CsSnBr}_3$, which exhibit a ferroelectric distortion driven by stereochemical expression of the tin lone pair. We also predict similar metastable ferroelectric phases of $\\mathrm{CsPbI}_3$ and $\\mathrm{CsPbBr}_3$. In addition to ferroelectricity, these phases exhibit the Rashba effect. Spin splitting in both the conduction and valence bands suggests that nanostructures based on these phases could host bright ground-state excitons. Finally, we discuss paths toward experimental realization of these phases via electric fields and tensile strain.",
    "authors": [
      "Michael W. Swift",
      "John L. Lyons"
    ],
    "publication_date": "2023-08-04T17:51:10Z",
    "arxiv_id": "http://arxiv.org/abs/2308.02481v1",
    "download_url": "https://arxiv.org/abs/2308.02481v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Linking quantum mechanical features to structural phase-transformation in inorganic solids",
    "abstract": "We present a new descriptor, i.e., local lattice distortion, to predict structural phase transformation in inorganic compounds containing lanthanides and transition metals. The descriptor utilizes local lattice and angular distortions obtained from structural optimization of experimentally known crystalline phases within state-of-the-art density-functional theory method. The predictive power of the descriptor was tested on lanthanide based RE2In (RE=rare-earth) compounds known for a variety of phase transformations. We show that the inclusion of quantum-mechanical effects through local-charge, bonding, symmetry, and electronic-structure enhances the robustness of the descriptor in predicting structural phase transformation. To gain further insights, we analyzed phononic and electronic behavior of Y2In, and show that experimentally observed phase transformation can only be predicted when atomic strains are included. The descriptor was used to predict structural phase change in couple of new compounds, i.e., (Yb1-xErx)2In and Gd2(In1-xAlx), which was validated by X-ray powder diffraction measurements. Finally, we demonstrated the generality of the proposed descriptor by predicting phase transformation behavior in different classes of compounds indicating the usefulness of our approach in mapping desired phase changes in novel functional materials.",
    "authors": [
      "Prashant Singh",
      "Anis Biswas",
      "Alexander Thayer",
      "Yaroslav Mudryk"
    ],
    "publication_date": "2025-03-05T02:36:33Z",
    "arxiv_id": "http://arxiv.org/abs/2503.03120v1",
    "download_url": "https://arxiv.org/abs/2503.03120v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Direct evidence and atomic-scale mechanisms of reduced dislocation mobility in an inorganic semiconductor under illumination",
    "abstract": "Photo-plasticity in semiconductors, wherein their mechanical properties such as strength, hardness and ductility are influenced by light exposure, has been reported for several decades. Although such phenomena have drawn significant attention for the manufacturability and usage of deformable semiconductor devices, their underlying mechanisms are not well understood due to the lack of direct evidence. Here we provide experimental observation and atomic insights into the reduced mobility of dislocations in zinc sulfide, as a model material, under light. Using photo-nanoindentation and transmission electron microscopy, we observe that dislocations glide shorter distances under light than those in darkness and there are no apparent deformation twins in both conditions. By atomic-scale simulations, we demonstrate that the decreased dislocation mobility is attributed to the increased Peierls stress for dislocation motion and enhanced stress fields around dislocation cores due to photoexcitation. This study improves the understanding of photo-plastic effects in inorganic semiconductors, offering the opportunities for modulating their mechanical properties using light.",
    "authors": [
      "Mingqiang Li",
      "Kun Luo",
      "Xiumei Ma",
      "Boran Kumral",
      "Peng Gao",
      "Tobin Filleter",
      "Qi An",
      "Yu Zou"
    ],
    "publication_date": "2025-03-24T22:27:11Z",
    "arxiv_id": "http://arxiv.org/abs/2503.19189v1",
    "download_url": "https://arxiv.org/abs/2503.19189v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Study and suppression of anomalous fast events in inorganic scintillators for dark matter searches",
    "abstract": "The status of dark matter searches with inorganic scintillator detectors at Boulby mine is reviewed and the results of tests with a CsI(Tl) crystal are presented. The objectives of the latter experiment were to study anomalous fast events previously observed and to identify ways to remove this background. Clear indications were found that these events were due to surface contamination of crystals by alphas, probably from radon decay. A new array of unencapsulated NaI(Tl) crystals immersed either in liquid paraffin or pure nitrogen atmosphere is under construction at Boulby. Such an approach allows complete control of the surface of the crystals and the ability to remove any surface contamination. First data from the unencapsulated NaI(Tl) do not show the presence of anomalous fast events.",
    "authors": [
      "V. A. Kudryavtsev",
      "N. J. C. Spooner",
      "P. K. Lightfoot",
      "J. W. Roberts",
      "M. J. Lehner",
      "T. Gamble",
      "M. J. Carson",
      "T. B. Lawson",
      "R. Luscher",
      "J. E. McMillan",
      "B. Morgan",
      "S. M. Paling",
      "M. Robinson",
      "D. R. Tovey",
      "N. J. T. Smith",
      "P. F. Smith",
      "G. J. Alner",
      "S. P. Hart",
      "J. D. Lewin",
      "R. M. Preece",
      "T. J. Sumner",
      "W. G. Jones",
      "J. J. Quenby",
      "B. Ahmed",
      "A. Bewick",
      "D. Davidge",
      "J. V. Dawson",
      "A. S. Howard",
      "I. Ivaniouchenkov",
      "M. K. Joshi",
      "V. Lebedenko",
      "I. Liubarsky",
      "J. C. Barton",
      "G. Gerbier",
      "J. Mallet",
      "L. Mosca",
      "C. Tao"
    ],
    "publication_date": "2001-09-12T14:34:04Z",
    "arxiv_id": "http://arxiv.org/abs/hep-ex/0109013v1",
    "download_url": "https://arxiv.org/abs/hep-ex/0109013v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Probing the Limit of Heat Transfer in Inorganic Crystals with Deep Learning",
    "abstract": "Heat transfer is a fundamental property of matter. Research spanning decades has attempted to discover materials with exceptional thermal conductivity, yet the upper limit remains unknown. Using deep learning accelerated crystal structure prediction and first-principles calculation, we systematically explore the thermal conductivity landscape of inorganic crystals. We brute-force over half a million ordered crystalline structures, encompassing an extensive coverage of local energy minima in binary compounds with up to four atoms per primitive cell. We confirm diamond sets the upper bound of thermal conductivity within our search space, very likely also among all stable crystalline solids at ambient conditions. We also identify over 20 novel crystals surpassing silicon in thermal conductivity, validated by density functional theory. These include a semiconductor TaN with ultrahigh thermal conductivity (~900 $\\mathrm{W\\cdot m^{-1}\\cdot K^{-1}}$), and metallic compounds such as MnV that exhibit high lattice and electronic thermal conductivity simultaneously, a distinctive feature not observed before. These results as well as the deep learning-driven screening method, redefine the landscape of thermal transport and establish a large open-access database for future materials discovery.",
    "authors": [
      "Jielan Li",
      "Zekun Chen",
      "Qian Wang",
      "Han Yang",
      "Ziheng Lu",
      "Guanzhi Li",
      "Shuizhou Chen",
      "Yu Zhu",
      "Xixian Liu",
      "Junfu Tan",
      "Mingfa Tang",
      "Yichi Zhou",
      "Claudio Zeni",
      "Andrew Fowler",
      "Daniel Zügner",
      "Robert Pinsler",
      "Matthew Horton",
      "Tian Xie",
      "Tie-Yan Liu",
      "Haiguang Liu",
      "Tao Qin",
      "Bing Lv",
      "Davide Donadio",
      "Hongxia Hao"
    ],
    "publication_date": "2025-03-14T16:37:23Z",
    "arxiv_id": "http://arxiv.org/abs/2503.11568v2",
    "download_url": "https://arxiv.org/abs/2503.11568v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Autonomous decision making for solid-state synthesis of inorganic materials",
    "abstract": "To aid in the automation of inorganic materials synthesis, we introduce an algorithm (ARROWS3) that guides the selection of precursors used in solid-state reactions. Given a target phase, ARROWS3 iteratively proposes experiments and learns from their outcomes to identify an optimal set of precursors that leads to maximal yield of that target. Initial experiments are selected based on thermochemical data collected from first principles calculations, which enable the identification of precursors exhibiting large thermodynamic force to form the desired target. Should the initial experiments fail, their associated reaction paths are determined by sampling a range of synthesis temperatures and identifying their products. ARROWS3 then uses this information to pinpoint which intermediate reactions consume most of the available free energy associated with the starting materials. In subsequent experimental iterations, precursors are selected to avoid such unfavorable reactions and therefore maintain a strong driving force to form the target. We validate this approach on three experimental datasets containing results from more than 200 distinct synthesis procedures. When compared to several black-box optimization algorithms, ARROWS3 identifies the most effective set of precursors for each target while requiring substantially fewer experimental iterations. These findings highlight the importance of using domain knowledge in the design of optimization algorithms for materials synthesis, which are critical for the development of fully autonomous research platforms.",
    "authors": [
      "Nathan J. Szymanski",
      "Pragnay Nevatia",
      "Christopher J. Bartel",
      "Yan Zeng",
      "Gerbrand Ceder"
    ],
    "publication_date": "2023-04-19T00:23:42Z",
    "arxiv_id": "http://arxiv.org/abs/2304.09353v2",
    "download_url": "https://arxiv.org/abs/2304.09353v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tunable electronic energy level alignment and exciton diversity in organic-inorganic van der Waals heterostructures",
    "abstract": "van der Waals stacking of two-dimensional (2D) materials offers a powerful platform for engineering material interfaces with tailored electronic and optical properties. While most van der Waals multilayers have featured inorganic monolayers, incorporating molecular monolayers introduces new degrees of tunability and functionality. Here, we investigate hybrid bilayers composed of atomically thin perylene-based molecular crystals interfaced with monolayer transition metal dichalcogenides (TMDs), specifically MoS2 and WS2. Using ab initio many-body perturbation theory within the GW approximation and the Bethe-Salpeter equation approach, we predict emergent properties beyond those of the isolated constituent systems. Notably, we find substantial renormalization of monolayer molecular crystal band gap due to TMD-induced polarization. Furthermore, by varying the TMD monolayer, we demonstrate tuning of the energy level alignment of the bilayer and subsequent control over a diversity of lowest-energy excitons, which include strongly bound hybrid excitons and long-lived charge-transfer excitons. These findings establish organic-inorganic van der Waals heterostructures as a promising class of materials for tunable optoelectronic devices and quantum excitonic phenomena, expanding the design space for low-dimensional systems.",
    "authors": [
      "Aurélie Champagne",
      "Olugbenga Adeniran",
      "Jonah B. Haber",
      "Antonios M. Alvertis",
      "Zhen-Fei Liu",
      "Jeffrey B. Neaton"
    ],
    "publication_date": "2025-10-06T18:36:06Z",
    "arxiv_id": "http://arxiv.org/abs/2510.05267v1",
    "download_url": "https://arxiv.org/abs/2510.05267v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Phonon-Mediated Chirality Transfer from Organic Cation to Inorganic lattice in Hybrid Perovskites",
    "abstract": "Two-dimensional hybrid metal halide perovskites combine strong spin-orbit coupling, soft lattice dynamics and molecular tunability, making them promising platforms for chiral optoelectronics and spin dependent phenomena. While chiral organic spacers are known to induce optical activity, the microscopic mechanism by which molecular chirality couples to the inorganic lattice remains unclear. Here, we investigate coherent vibrational dynamics in the chiral perovskite ($R$-MBA)$_2$PbI$_4$ and its racemic analogue using transient absorption spectroscopy, complemented by Raman spectroscopy and ab-initio calculations. We identify a coherent phonon at ~5.7 meV that couples strongly to excitons in the chiral material but is absent in the racemic counterpart. This mode is assigned to lattice vibrations involving coupled motion of the chiral spacer and Pb-I framework, including rotational displacement patterns. These results establish coherent lattice motion as a pathway for mediating chiral responses in hybrid materials.",
    "authors": [
      "Sankaran Ramesh",
      "Prasenjit Mandal",
      "Rafael Araujo",
      "Jakob Thyr",
      "Pratik Bhagwat",
      "Yong Li",
      "Tomas Edvinsson",
      "Tönu Pullerits",
      "Dmitry Baranov"
    ],
    "publication_date": "2025-07-14T08:14:08Z",
    "arxiv_id": "http://arxiv.org/abs/2507.10036v2",
    "download_url": "https://arxiv.org/abs/2507.10036v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]