[
  {
    "title": "Numerical study of nitrogen oxides chemistry during plasma assisted combustion in a sequential combustor",
    "abstract": "Plasma Assisted Combustion (PAC) is a promising technology to enhance the combustion of lean mixtures prone to instabilities and flame blow-off. Although many PAC experiments demonstrated combustion enhancement, several studies report an increase in NOx emissions. The aim of this study is to determine the kinetic pathways leading to NOx formation in the second stage of a sequential combustor assisted by Nanosecond Repetitively Pulsed Discharges (NRPDs). For this purpose, Large Eddy Simulation (LES) associated with an accurate description of the combustion/NOx chemistry and a phenomenological model of the plasma kinetics is used. Detailed kinetics 0-Dimensional reactors complement the study. First, the LES setup is validated by comparison with experiments. Then, the NOx chemistry is analyzed. For the conditions of operation studied, it is shown that the production of atomic nitrogen in the plasma by direct electron impact on nitrogen molecules increases the formation of NO. Then, the NO molecules are transported through the turbulent flame without being strongly affected. This study illustrates the need to limit the diatomic nitrogen dissociation process in order to mitigate harmful emissions. More generally, the very good agreement with experimental measurements demonstrates the capability of LES combined with accurate models to predict the NRPD effects on both turbulent combustion and NOx emissions.",
    "authors": [
      "Quentin Malé",
      "Nicolas Barléon",
      "Sergey Shcherbanev",
      "Bayu Dharmaputra",
      "Nicolas Noiray"
    ],
    "publication_date": "2023-06-27T15:08:42Z",
    "arxiv_id": "http://arxiv.org/abs/2306.15539v1",
    "download_url": "https://arxiv.org/abs/2306.15539v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formation of S-bearing complex organic molecules in interstellar clouds via ice reactions with C2H2, HS, and atomic H",
    "abstract": "The chemical network governing interstellar sulfur has been the topic of unrelenting discussion for the past decades due to the conspicuous discrepancy between its expected and observed abundances in different interstellar environments. More recently, the astronomical detections of CH3CH2SH and CH2CS highlighted the importance of interstellar formation routes for sulfur-bearing organic molecules with two carbon atoms. In this work, we perform a laboratory investigation of the solid-state chemistry resulting from the interaction between C2H2 molecules and SH radicals -- both thought to be present in interstellar icy mantles -- at 10 K. Reflection absorption infrared spectroscopy and quadrupole mass spectrometry combined with temperature-programmed desorption experiments are employed as analytical techniques. We confirm that SH radicals can kick-start a sulfur reaction network under interstellar cloud conditions and identify at least six sulfurated products: CH3CH2SH, CH2CHSH, HSCH2CH2SH, H2S2, and tentatively CH3CHS and CH2CS. Complementarily, we utilize computational calculations to pinpoint the reaction routes that play a role in the chemical network behind our experimental results. The main sulfur-bearing organic molecule formed under our experimental conditions is CH3CH2SH and its formation yield increases with the ratios of H to other reactants. It serves as a sink to the sulfur budget within the network, being formed at the expense of the other unsaturated products. The astrophysical implications of the chemical network proposed here are discussed.",
    "authors": [
      "Julia C. Santos",
      "Joan Enrique-Romero",
      "Thanja Lamberts",
      "Harold Linnartz",
      "Ko-Ju Chuang"
    ],
    "publication_date": "2024-07-13T00:28:00Z",
    "arxiv_id": "http://arxiv.org/abs/2407.09730v1",
    "download_url": "https://arxiv.org/abs/2407.09730v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reconstructing biochemical cluster networks",
    "abstract": "Motivated by fundamental problems in chemistry and biology we study cluster graphs arising from a set of initial states $S\\subseteq\\Z^n_+$ and a set of transitions/reactions $M\\subseteq\\Z^n_+\\times\\Z^n_+$. The clusters are formed out of states that can be mutually transformed into each other by a sequence of reversible transitions. We provide a solution method from computational commutative algebra that allows for deciding whether two given states belong to the same cluster as well as for the reconstruction of the full cluster graph. Using the cluster graph approach we provide solutions to two fundamental questions: 1) Deciding whether two states are connected, e.g., if the initial state can be turned into the final state by a sequence of transition and 2) listing concisely all reactions processes that can accomplish that. As a computational example, we apply the framework to the permanganate/oxalic acid reaction.",
    "authors": [
      "Utz-Uwe Haus",
      "Raymond Hemmecke",
      "Sebastian Pokutta"
    ],
    "publication_date": "2009-06-07T09:47:37Z",
    "arxiv_id": "http://arxiv.org/abs/0906.1342v3",
    "download_url": "https://arxiv.org/abs/0906.1342v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Comment on \"Investigation of the anisotropic distribution of microdosimetric quantities in the vicinity of X-ray-irradiated gold nanoparticles\" by Derrien et al. [Radiation Physics and Chemistry 213, 111232 (2023)]",
    "abstract": "In their recent article, Derrien et al. (Derrien et al., 2023) study the anisotropy of microdosimetric quantities for spherical sites of several sizes placed around spherical gold nanoparticles of several diameters irradiated by monoenergetic photons. This comment points out that (1) the reported single event distributions of specific energy may be biased due to overcounting. (2) by considering only energy imparted by electrons produced in photon interactions in the nanoparticle, the magnitude of the anisotropy is overestimated by up to orders of magnitude with respect to an irradiation under conditions of secondary particle equilibrium.",
    "authors": [
      "Hans Rabus"
    ],
    "publication_date": "2023-12-11T19:04:47Z",
    "arxiv_id": "http://arxiv.org/abs/2312.06785v1",
    "download_url": "https://arxiv.org/abs/2312.06785v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A new multi-beam apparatus for the study of surface chemistry routes to formation of complex organic molecules in space",
    "abstract": "A multi-beam ultra-high vacuum apparatus is presented. In this article we describe the design and construction of a new laboratory astrophysics experiment -- VErs de NoUvelles Synthèses (VENUS) -- that recreates the solid-state non-energetic formation conditions of complex organic molecules in dark clouds and circumstellar environments. The novel implementation of four operational differentially-pumped beam lines will be used to determine the feasibility and the rates for the various reactions that contribute to formation of molecules containing more than six atoms. Data are collected by means of Fourier transform infrared spectroscopy and quadrupole mass spectrometry. The gold-coated sample holder reaches temperatures between 7 and 400 K. The apparatus was carefully calibrated and the acquisition system was developed to ensure that experimental parameters are recorded as accurately as possible. A great effort has been made to have the beam lines converge towards the sample. Experiments have been developed to check the beam alignment using reacting systems of neutral species (NH$_3$, H$_2$CO). Preliminary original results were obtained for the NO+H system, which shows that chemistry occurs only in the very first outer layer of the deposited species, that is the chemical layer and the physical layer coincide. This article illustrates the characteristics, performance, and future potential of the new apparatus in view of the forthcoming launch of the James Webb Space Telescope. We show that VENUS will have a major impact through its contributions to surface science and astrochemistry.",
    "authors": [
      "Emanuele Congiu",
      "Abdellahi Sow",
      "Thanh Nguyen",
      "Saoud Baouche",
      "François Dulieu"
    ],
    "publication_date": "2020-04-22T16:02:46Z",
    "arxiv_id": "http://arxiv.org/abs/2004.10668v2",
    "download_url": "https://arxiv.org/abs/2004.10668v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhanced Self-organized Dewetting of Ultrathin Polymer Films under Water-organic Solutions: Fabrication of Sub-micron Spherical Lens Arrays",
    "abstract": "Field-induced self-organized patterning in ultrathin (< 100 nm) polymer films produces resolutions of the order of 10 μm or more because of the high energy penalty for the surface deformations on small scales. We propose here a very simple but versatile method to fabricate sub-micron (~100 nm) ordered and tunable polymeric structures by self-organized room temperature dewetting of ultrathin polystyrene films by minimizing the surface tension limitation. We illustrate this technique by fabricating sub-micron lens arrays of tunable curvature. This is achieved by switching to controlled room temperature dewetting under an optimal mix of water, acetone and methyl-ethyl ketone (MEK). Organic solvents used decrease the glass transition temperature, greatly decrease the interfacial tension, intensify the field and increase the contact angle/aspect ratio of the resulting tunable nano-structures, without a concurrent solubilization of PS owing to water being the majority phase in the outside mixture.",
    "authors": [
      "Ankur Verma",
      "Ashutosh Sharma"
    ],
    "publication_date": "2010-09-25T07:35:42Z",
    "arxiv_id": "http://arxiv.org/abs/1009.4989v1",
    "download_url": "https://arxiv.org/abs/1009.4989v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic chemistry of low-mass star-forming cores I: 7 mm spectroscopy of Chamaeleon MMS1",
    "abstract": "Observations are presented of emission lines from organic molecules at frequencies 32 - 50 GHz in the vicinity of Chamaeleon MMS1. This chemically-rich dense cloud core habours an extremely young, very low-luminosity protostellar object and is a candidate first hydrostatic core. Column densities are derived and emission maps are presented for species including polyynes, cyanopolyynes, sulphuretted carbon-chains and methanol. The polyyne emission peak lies about 5000 AU from the protostar, whereas methanol peaks about 15,000 AU away. Averaged over the telescope beam, the molecular hydrogen number density is calculated to be 10^6 cm^-3 and the gas kinetic temperature is in the range 5 - 7 K. The abundances of long carbon chains are very large, and are indicative of a non-equilibrium carbon chemistry; C6H and HC7N column densities are 5.9 (+2.9 -1.3) \\times 10^11 cm^-2 and 3.3 (+8.0 -1.5) \\times 10^12 cm^-2, respectively, which are similar to the values found in the most carbon-chain-rich protostars and prestellar cores known, and are unusually large for star-forming gas. Column density upper limits were obtained for the carbon-chain anions C4H- and C6H-, with anion-to-neutral ratios [C4H-]/[C4H] < 0.02% and [C6H-]/[C6H] < 10%, consistent with previous observations in interstellar clouds and low-mass protostars. Deuterated HC3N and c-C3H2 were detected. The [DC3N]/[HC3N] ratio of approximately 4% is consistent with the value typically found in cold interstellar gas.",
    "authors": [
      "Martin A. Cordiner",
      "Steven B. Charnley",
      "Eva S. Wirström",
      "Robert G. Smith"
    ],
    "publication_date": "2011-09-19T16:33:41Z",
    "arxiv_id": "http://arxiv.org/abs/1109.4081v1",
    "download_url": "https://arxiv.org/abs/1109.4081v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nearly Exclusive Growth of Small Diameter Semiconducting Single-Wall Carbon Nanotubes from Organic Chemistry Synthetic End-Cap Molecules",
    "abstract": "The inability to synthesize single-wall carbon nanotubes (SWCNTs) possessing uniform electronic properties and chirality represents the major impediment to their widespread applications. Recently, there is growing interest to explore and synthesize well-defined carbon nanostructures, including fullerenes, short nanotubes, and sidewalls of nanotubes, aiming for controlled synthesis of SWCNTs. One noticeable advantage of such processes is that no metal catalysts are used, and the produced nanotubes will be free of metal contamination. Many of these methods, however, suffer shortcomings of either low yield or poor controllability of nanotube uniformity. Here, we report a brand new approach to achieve high efficiency metal-free growth of nearly pure SWCNT semiconductors, as supported by extensive spectroscopic characterization, electrical transport measurements, and density functional theory calculations. Our strategy combines bottom-up organic chemistry synthesis with vapour phase epitaxy elongation. We identify a strong correlation between the electronic properties of SWCNTs and their diameters in nanotube growth. This study not only provides material platforms for electronic applications of semiconducting SWCNTs, but also contributes to fundamental understanding of the growth mechanism and controlled synthesis of SWCNTs.",
    "authors": [
      "Bilu Liu",
      "Jia Liu",
      "Hai-Bei Li",
      "Radha Bhola",
      "Edward A. Jackson",
      "Lawrence T. Scott",
      "Alister Page",
      "Stephan Irle",
      "Keiji Morokuma",
      "Chongwu Zhou"
    ],
    "publication_date": "2014-12-18T17:57:50Z",
    "arxiv_id": "http://arxiv.org/abs/1412.5974v1",
    "download_url": "https://arxiv.org/abs/1412.5974v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Quantum Chemistry to Networks in Biology: A Graph Spectral Approach to Protein Structure Analyses",
    "abstract": "In this perspective article, we present a multidisciplinary approach for characterizing protein structure networks. We first place our approach in its historical context and describe the manner in which it synthesizes concepts from quantum chemistry, biology of polymer conformations, matrix mathematics, and percolation theory. We then explicitly provide the method for constructing the protein structure network in terms of non-covalently interacting amino acid side chains and show how a mine of information can be obtained from the graph spectra of these networks. Employing suitable mathematical approaches, such as the use of a weighted, Laplacian matrix to generate the spectra, enables us to develop rigorous methods for network comparison and to identify crucial nodes responsible for the network integrity through a perturbation approach. Our scoring methods have several applications in structural biology that are elusive to conventional methods of analyses. Here, we discuss the instances of: (a) Protein structure comparison that include the details of side chain connectivity, (b) The contribution to node clustering as a function of bound ligand, explaining the global effect of local changes in phenomena such as allostery and (c) The identification of crucial amino acids for structural integrity, derived purely from the spectra of the graph. We demonstrate how our method enables us to obtain valuable information on key proteins involved in cellular functions and diseases such as GPCR and HIV protease, and discuss the biological implications. We then briefly describe how concepts from percolation theory further augment our analyses. In our concluding perspective for future developments, we suggest a further unifying approach to protein structure analyses and a judicious choice of questions to employ our methods for larger, more complex networks, such as metabolic and disease networks.",
    "authors": [
      "Vasundhara Gadiyaram",
      "Smitha Vishveshwara",
      "Saraswathi Vishveshwara"
    ],
    "publication_date": "2019-12-25T06:52:05Z",
    "arxiv_id": "http://arxiv.org/abs/1912.11609v1",
    "download_url": "https://arxiv.org/abs/1912.11609v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formation of complex organic molecules on interstellar CO ices? Insights from computational chemistry simulations",
    "abstract": "Carbon ($^3$P) atom is a reactive species that, according to laboratory experiments and theoretical calculations, condensates with interstellar ice components. This fact is of uttermost importance for the chemistry in the interstellar medium (ISM) because the condensation reaction is barrierless and the subsequent species formed are still reactive given their open-shell character. Carbon condensation on CO-rich ices forms the \\ch{C=C=O} ($^3$$Σ$$^-$) species, which can be easily hydrogenated twice to form ketene (H$_2$CCO). Ketene is very reactive in terrestrial conditions, usually found as an intermediate hard to be isolated in chemical synthesis laboratories. These characteristics suggest that ketene can be a good candidate to form interstellar complex organic molecules (iCOMs) via a two-step process, i.e., its activation followed by a radical-radical coupling. In this work, reactions between ketene and atomic H, and the OH and NH$_2$ radicals on a CO-rich ice model have been explored by means of quantum chemical calculations complemented by kinetic calculations to evaluate if they are favourable in the ISM. Results indicate that H addition to ketene (helped by tunneling) to form the acetyl radical (CH$_3$CO) is the most preferred path, as the reactions with OH and NH$_2$ possess activation energies ($\\geq$ 9kJ/mol) hard to surmount in the ISM conditions, unless external processes provide energy to the system. Thus, acetaldehyde (CH$_3$CHO) and, probably, ethanol (CH$_3$CH$_2$OH) formation via further hydrogenations are the possible unique operating synthetic routes. Moreover, from the computed relatively large binding energies of OH and NH$_2$ on CO ice, slow diffusion is expected, hampering possible radical-radical couplings with CH$_3$CO. The astrophysical implications of these findings are discussed considering the incoming James Webb Space Telescope observations.",
    "authors": [
      "Stefano Ferrero",
      "Cecilia Ceccarelli",
      "Piero Ugliengo",
      "Mariona Sodupe",
      "Albert Rimola"
    ],
    "publication_date": "2023-05-25T14:48:24Z",
    "arxiv_id": "http://arxiv.org/abs/2305.16116v1",
    "download_url": "https://arxiv.org/abs/2305.16116v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Heterometallic Metal-Organic Frameworks of MOF-5 and UiO-66 Families: Insight from Computational Chemistry",
    "abstract": "We study the energetic stability and structural features of bimetallic metal-organic frameworks. Such heterometallic MOFs, which can result from partial substitutions between two types of cations, can have specific physical or chemical properties used for example in catalysis or gas adsorption. We work here to provide through computational chemistry a microscopic understanding of bimetallic MOFs and the distribution of cations within their structure. We develop a methodology based on a systematic study of possible cation distributions at all cation ratios by means of quantum chemistry calculations at the density functional theory level. We analyze the energies of the resulting bimetallic frameworks and correlate them with various disorder descriptors (functions of the bimetallic framework topology, regardless of exact atomic positions). We apply our methodology to two families of MOFs known for heterometallicity: MOF-5 (with divalent metal ions) and UiO-66 (with tetravalent metal ions). We observe that bimetallicity is overall more favorable for pairs of cations with sizes very close to each other, owing to a charge transfer mechanism inside secondary building units. For cation pairs with significant mutual size difference, metal mixing is globally less favorable, and the energy signifantly correlates with the coordination environment of linkers, determining their ability to adapt the mixing-induced strains. This effect is particularly strong in the UiO-66 family because of high cluster coordination number.",
    "authors": [
      "Fabien Trousselet",
      "Aurélien Archereau",
      "Anne Boutin",
      "François-Xavier Coudert"
    ],
    "publication_date": "2019-04-19T10:23:16Z",
    "arxiv_id": "http://arxiv.org/abs/1904.09138v1",
    "download_url": "https://arxiv.org/abs/1904.09138v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hidden aspects of the Structural Theory of chemistry: The MC-QTAIM analysis reveals \"alchemical\" transformation from a triatomic to a diatomic structure",
    "abstract": "The Structural theory of chemistry introduces chemical/molecular structure as a combination of relative arrangement and bonding patterns of atoms in molecule. Nowadays, the structure of atoms in molecules is derived from the topological analysis of the quantum theory of atoms in molecules (QTAIM). In this context a molecular structure is varied by large geometrical variations and concomitant reorganization of electronic structure that are usually taking place in chemical reactions or under extreme hydrostatic pressure. In this report a new mode of structural variation is introduced within the context of the newly proposed multi-component QTAIM (MC-QTAIM) that originates from mass variation of nuclei. Accordingly, XCN and CNX series of species are introduced where X stands for a quantum particle with a unit of positive charge and a variable mass that is varied in discrete steps between the masses of proton and positron. Ab initio non-Born-Oppenheimer (non-BO) calculations are done on both series of species and the resulting non-BO wavefunctions are used for the MC-QTAIM analysis revealing a triatomic structure for the proton mass and a diatomic structure for the positron mass. In both series of species a critical mass between that of proton and positron mass is discovered where the transition from triatomic to diatomic structure takes place. This abrupt structural transformation has a topological nature resembling the usual phase transitions in thermodynamics. The discovered mass induced structural transformation is a hidden aspect of the Structural theory which is revealed only beyond the BO paradigm when nuclei are treated as quantum waves instead of clamped point charges.",
    "authors": [
      "Mohammad Goli",
      "Shant Shahbazian"
    ],
    "publication_date": "2014-08-19T21:04:13Z",
    "arxiv_id": "http://arxiv.org/abs/1408.4482v2",
    "download_url": "https://arxiv.org/abs/1408.4482v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin covalent chemistry of carbon",
    "abstract": "This review presents the covalent chemistry of carbon within the spin-radical concept of electron interaction. Using the language of valence bond trimodality, the regions of classical spinless covalence and its spin counterpart are defined. Carbon is the only element exhibiting spin covalent chemistry. Classical covalent chemistry of carbon concerns molecular substances whose valence bond structure includes segregate or chained single sp3C-C bonds. Substances with double sp2C-C and triple sp1C-C bonds are the subject of spin covalent chemistry of carbon. The mathematical apparatus of spin covalence forms the basis of algorithms governing the chemical modification of carbon substances, polymerization processes, and catalysis involving them, making it possible to supplement the empirical spin covalent chemistry of carbon with its virtual analog.",
    "authors": [
      "E. F. Sheka"
    ],
    "publication_date": "2025-11-07T15:06:02Z",
    "arxiv_id": "http://arxiv.org/abs/2511.05305v1",
    "download_url": "https://arxiv.org/abs/2511.05305v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "An interferometric study of the low-mass protostar IRAS 16293-2422: small scale organic chemistry",
    "abstract": "Aims: To investigate the chemical relations between complex organics based on their spatial distributions and excitation conditions in the low-mass young stellar objects IRAS 16293-2422 A and B. Methods: Interferometric observations with the Submillimeter Array have been performed at 5''x3'' resolution revealing emission lines of HNCO, CH3CN, CH2CO, CH3CHO and C2H5OH. Rotational temperatures are determined from rotational diagrams when a sufficient number of lines are detected. Results: Compact emission is detected for all species studied here. For HNCO and CH3CN it mostly arises from source A, CH2CO and C2H5OH have comparable strength for both sources and CH3CHO arises exclusively from source B. HNCO, CH3CN and CH3CHO have rotational temperatures >200 K. The (u,v)-visibility data reveal that HNCO also has extended cold emission. Conclusions: The abundances of the molecules studied here are very similar within factors of a few to those found in high-mass YSOs. Thus the chemistry between high- and low-mass objects appears to be independent of luminosity and cloud mass. Bigger abundance differences are seen between the A and B source. The HNCO abundance relative to CH3OH is ~4 times higher toward A, which may be due to a higher initial OCN- ice abundances in source A compared to B. Furthermore, not all oxygen-bearing species are co-existent. The different spatial behavior of CH2CO and C2H5OH compared with CH3CHO suggests that hydrogenation reactions on grain-surfaces are not sufficient to explain the observed gas phase abundances. Selective destruction of CH3CHO may result in the anti-coincidence of these species in source A. These results illustrate the power of interferometric compared with single dish data in terms of testing chemical models.",
    "authors": [
      "S. E. Bisschop",
      "J. K. Jorgensen",
      "T. L. Bourke",
      "S. Bottinelli",
      "E. F. van Dishoeck"
    ],
    "publication_date": "2008-07-09T13:42:33Z",
    "arxiv_id": "http://arxiv.org/abs/0807.1447v1",
    "download_url": "https://arxiv.org/abs/0807.1447v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Understanding the chemistry of temperate exoplanets atmospheres through experimental and numerical simulations",
    "abstract": "Characterizing temperate exoplanet atmospheres remains challenging due to their small size and low temperatures. Recent JWST observations provide valuable data, but their interpretation has led to diverging conclusions. Complementary approaches combining laboratory experiments and photochemical modeling are essential for constraining atmospheric chemistry and interpreting observations. We aim to identify chemical pathways governing the formation and evolution of neutral species and to assess their sensitivity to key parameters such as C/O ratio and metallicity. Our approach combines experimental and numerical simulations on H2-rich gas mixtures representative of sub-Neptune atmospheres, spanning a wide range of CH4, CO, and CO2 mixing ratios. A cold plasma reactor simulates out-of-equilibrium upper-atmospheric chemistry. A 0D photochemical model reproduces reactor conditions, guiding interpretation of key pathways and abundance trends. We observe the formation of both reduced and oxidized organic compounds. In CH4-rich mixtures, hydrocarbons form efficiently through methane chemistry, correlating with CH4 concentration and agreeing with models. In more oxidizing environments, particularly CO2-rich mixtures, hydrocarbon formation is inhibited by complex reaction networks and oxidative losses. Oxygen incorporation enhances chemical diversity and promotes formation of oxidized organic compounds of prebiotic interest (H2CO, CH3OH, CH3CHO), especially in atmospheres containing both CH4 and CO2. Atmospheres containing CH4 and CO, which balance carbon and oxygen supply without excessive oxidative destruction, favor efficient production of hydrocarbons and oxidized compounds. Out-of-equilibrium chemistry plays a key role in the diversification and organic complexification of temperate exoplanet atmospheres.",
    "authors": [
      "O. Sohier",
      "A. Y. Jaziri",
      "L. Vettier",
      "A. Chatain",
      "T. Drant",
      "N. Carrasco"
    ],
    "publication_date": "2025-12-18T11:16:13Z",
    "arxiv_id": "http://arxiv.org/abs/2512.16421v1",
    "download_url": "https://arxiv.org/abs/2512.16421v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formation of Complex Organic Molecules in Cold Interstellar Environments through non-diffusive grain-surface and ice-mantle chemistry",
    "abstract": "A prevailing theory for the interstellar production of complex organic molecules (COMs) involves formation on warm dust-grain surfaces, via the diffusion and reaction of radicals produced through grain-surface photodissociation of stable molecules. However, some gas-phase O-bearing COMs, notably acetaldehyde(CH$_3$CHO), methyl formate(CH$_3$OCHO), and dimethyl ether(CH$_3$OCH$_3$), are now observed at very low temperatures, challenging the warm scenario. Here, we introduce a selection of new non-diffusive mechanisms into an astrochemical model, to account for the failure of the standard diffusive picture and to provide a more generalized scenario of COM formation on interstellar grains. New generic rate formulations are provided for cases where: (i) radicals are formed by reactions occurring close to another reactant, producing an immediate follow-on reaction; (ii) radicals are formed in an excited state, allowing them to overcome activation barriers to react with nearby stable molecules; (iii) radicals are formed through photo-dissociation close to a reaction partner, followed by immediate reaction. Each process occurs without the diffusion of large radicals. The new mechanisms significantly enhance cold COM abundances, successfully reproducing key observational results for prestellar core L1544. H-abstraction from grain-surface COMs, followed by recombination, plays a crucial role in amplifying chemical desorption into the gas phase. The UV-induced chemistry produces significant COM abundances in the bulk ices, which are retained on the grains and may persist to later stages. O$_2$ is also formed strongly in the mantle though photolysis, suggesting cometary O$_2$ could indeed be interstellar.",
    "authors": [
      "Mihwa Jin",
      "Robin T. Garrod"
    ],
    "publication_date": "2020-06-19T13:37:41Z",
    "arxiv_id": "http://arxiv.org/abs/2006.11127v1",
    "download_url": "https://arxiv.org/abs/2006.11127v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "OrbNet Denali: A machine learning potential for biological and organic chemistry with semi-empirical cost and DFT accuracy",
    "abstract": "We present OrbNet Denali, a machine learning model for electronic structure that is designed as a drop-in replacement for ground-state density functional theory (DFT) energy calculations. The model is a message-passing neural network that uses symmetry-adapted atomic orbital features from a low-cost quantum calculation to predict the energy of a molecule. OrbNet Denali is trained on a vast dataset of 2.3 million DFT calculations on molecules and geometries. This dataset covers the most common elements in bio- and organic chemistry (H, Li, B, C, N, O, F, Na, Mg, Si, P, S, Cl, K, Ca, Br, I) as well as charged molecules. OrbNet Denali is demonstrated on several well-established benchmark datasets, and we find that it provides accuracy that is on par with modern DFT methods while offering a speedup of up to three orders of magnitude. For the GMTKN55 benchmark set, OrbNet Denali achieves WTMAD-1 and WTMAD-2 scores of 7.19 and 9.84, on par with modern DFT functionals. For several GMTKN55 subsets, which contain chemical problems that are not present in the training set, OrbNet Denali produces a mean absolute error comparable to those of DFT methods. For the Hutchison conformers benchmark set, OrbNet Denali has a median correlation coefficient of R^2=0.90 compared to the reference DLPNO-CCSD(T) calculation, and R^2=0.97 compared to the method used to generate the training data (wB97X-D3/def2-TZVP), exceeding the performance of any other method with a similar cost. Similarly, the model reaches chemical accuracy for non-covalent interactions in the S66x10 dataset. For torsional profiles, OrbNet Denali reproduces the torsion profiles of wB97X-D3/def2-TZVP with an average MAE of 0.12 kcal/mol for the potential energy surfaces of the diverse fragments in the TorsionNet500 dataset.",
    "authors": [
      "Anders S. Christensen",
      "Sai Krishna Sirumalla",
      "Zhuoran Qiao",
      "Michael B. O'Connor",
      "Daniel G. A. Smith",
      "Feizhi Ding",
      "Peter J. Bygrave",
      "Animashree Anandkumar",
      "Matthew Welborn",
      "Frederick R. Manby",
      "Thomas F. Miller"
    ],
    "publication_date": "2021-07-01T08:37:23Z",
    "arxiv_id": "http://arxiv.org/abs/2107.00299v2",
    "download_url": "https://arxiv.org/abs/2107.00299v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Centre-of-mass separation in quantum mechanics: Implications for the many-body treatment in quantum chemistry and solid state physics",
    "abstract": "We address the question to what extent the centre-of-mass (COM) separation can change our view of the many-body problem in quantum chemistry and solid state physics. It was shown that the many-body treatment based on the electron-vibrational Hamiltonian is fundamentally inconsistent with the Born-Handy ansatz so that such a treatment can never respect the COM problem. Born-Oppenheimer (B-O) approximation reveals some secret: it is a limit case where the degrees of freedom can be treated in a classical way. Beyond the B-O approximation they are inseparable in principle. The unique covariant description of all equations with respect to individual degrees of freedom leads to new types of interaction: besides the known vibronic (electron-phonon) one the rotonic (electron-roton) and translonic (electron-translon) interactions arise. We have proved that due to the COM problem only the hypervibrations (hyperphonons, i.e. phonons + rotons + translons) have true physical meaning in molecules and crystals; nevertheless, the use of pure vibrations (phonons) is justified only in the adiabatic systems. This fact calls for the total revision of our contemporary knowledge of all non-adiabatic effects, especially the Jahn-Teller effect and superconductivity. The vibronic coupling is responsible only for removing of electron (quasi)degeneracies but for the explanation of symmetry breaking and forming of structure the rotonic and translonic coupling is necessary.",
    "authors": [
      "Michal Svrcek"
    ],
    "publication_date": "2010-08-24T06:34:28Z",
    "arxiv_id": "http://arxiv.org/abs/1008.3968v1",
    "download_url": "https://arxiv.org/abs/1008.3968v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Geant4 modeling of the bremsstrahlung converter optimal thickness for studying the radiation damage processes in organic dyes solutions",
    "abstract": "This work is dedicated to computer modeling of the parameters of a tungsten converter for studying the processes of radiation damage during the interaction of ionizing radiation with solutions of organic dyes. Simulation was carried out in order to determine the optimal thickness of the converter under predetermined experimental conditions. Experimental conditions include: energies and type of primary particles, radiation intensity, target dimensions, relative position of the radiation source and target. Experimental studies of the processes of radiation damage occurring in solutions of organic dyes are planned to be carried out using the linear electron. The tungsten converter is used to generate a flux of bremsstrahlung gamma rays. One modeling problem is determination of the converter thickness at which the flux of bremsstrahlung gamma will be maximal in front of the target. At the same time, the flow of electrons and positrons in front of the target should be as low as possible. Another important task of the work is to identify the possibility of determining the relative amount of radiation damage in the target material by the Geant4 modeling method. Computational experiments were carried out for various values of the converter thickness - from 0 mm (converter is absent) to 8 mm with a step of 1 mm. The developed program operates in a multithreaded mode. The G4EmStandardPhysics_option3 model of the PhysicsList was used in the calculations. A detailed analysis of the obtained data has been performed. As a result of the data analysis, the optimal value of the tungsten converter thickness was obtained.",
    "authors": [
      "Tetiana Malykhina",
      "Vladimir Kovtun",
      "Valentin Kasilov",
      "Sergey Gokov"
    ],
    "publication_date": "2021-12-14T14:52:40Z",
    "arxiv_id": "http://arxiv.org/abs/2112.07440v1",
    "download_url": "https://arxiv.org/abs/2112.07440v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From the Mendeleev periodic table to particle physics and back to the periodic table",
    "abstract": "We briefly describe in this paper the passage from Mendeleev's chemistry (1869) to atomic physics (in the 1900's), nuclear physics (in the 1932's) and particle physics (from 1953 to 2006). We show how the consideration of symmetries, largely used in physics since the end of the 1920's, gave rise to a new format of the periodic table in the 1970's. More specifically, this paper is concerned with the application of the group SO(4,2)xSU(2) to the periodic table of chemical elements. It is shown how the Madelung rule of the atomic shell model can be used for setting up a periodic table that can be further rationalized via the group SO(4,2)xSU(2) and some of its subgroups. Qualitative results are obtained from this nonstandard table.",
    "authors": [
      "M. R. Kibler"
    ],
    "publication_date": "2006-11-30T01:37:41Z",
    "arxiv_id": "http://arxiv.org/abs/quant-ph/0611287v2",
    "download_url": "https://arxiv.org/abs/quant-ph/0611287v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deuterium chemistry in the Orion Bar PDR - \"warm\" chemistry starring CH2D+",
    "abstract": "High levels of deuterium fractionation in gas-phase molecules are usually associated with cold regions, such as prestellar cores. Significant fractionation ratios are also observed in hot environments such as hot cores or hot corinos, where they are believed to be produced by the evaporation of the icy mantles surrounding dust grains, and thus are remnants of a previous cold (either gas-phase or grain surface) chemistry. The recent detection of DCN towards the Orion Bar, in a clump at a characteristic temperature of 70K, has shown that high deuterium fractionation can also be detected in PDRs. The Orion Bar clumps thus appear as a good environment for the observational study of deuterium fractionation in luke-warm gas, allowing to validate chemistry models in a different temperature range, where dominating fractionation processes are predicted to be different than in cold gas (< 20K). We aimed at studying observationally in detail the chemistry at work in the Orion Bar PDR, to understand if DCN is produced by ice mantle evaporation, or is the result of warm gas-phase chemistry, involving the CH2D+ precursor ion (which survives higher temperatures than the usual H2D+ precursor). Using the APEX and the IRAM 30m telescopes, we targetted selected deuterated species towards two clumps in the Orion Bar. We confirmed the detection of DCN and detected two new deuterated molecules (DCO+ and HDCO) towards one clump in the Orion Bar PDR. Significant deuterium fractionations are found for HCN and H2CO, but a low fractionation in HCO+. We also give upper limits for other molecules relevant for the deuterium chemistry. (...)\n  We show evidence that warm deuterium chemistry driven by CH2D+ is at work in the clumps.",
    "authors": [
      "B. Parise",
      "S. Leurini",
      "P. Schilke",
      "E. Roueff",
      "S. Thorwirth",
      "D. C. Lis"
    ],
    "publication_date": "2009-09-25T12:50:38Z",
    "arxiv_id": "http://arxiv.org/abs/0909.4683v1",
    "download_url": "https://arxiv.org/abs/0909.4683v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Simulations of ice chemistry in cometary nuclei",
    "abstract": "The first computational model of solid-phase chemistry in cometary nuclear ices is presented. An astrochemical kinetics model, MAGICKAL, is adapted to trace the chemical evolution in multiple layers of cometary ice, over a representative period of 5 Gyr. Physical conditions are chosen appropriate for \"cold storage\" of the cometary nucleus in the outer Solar System, prior to any active phase. The chemistry is simulated at a selection of static temperatures in the range 5 - 60 K, while the ice is exposed to the interstellar radiation field, inducing a photochemistry in the outer ice layers that produces significant formation of complex organic molecules. A treatment for the chemistry resulting from cosmic-ray bombardment of the ices is also introduced into the model, along with a new formulation for low-temperature photochemistry. Production of simple and complex molecules to depth on the order of 10~m or more is achieved, with local fractional abundances comparable to observed values in many cases. The production of substantial amounts of O$_2$ (and H$_2$O$_2$) is found, suggesting that long-term processing by high-energy cosmic rays of cometary ices in situ, over a period on the order of 1 Gyr, may be sufficient to explain the large observed abundances of O$_2$, if the overall loss of material from the comet is limited to a depth on the order of 10 m. Entry into the inner solar system could produce a further enhancement in the molecular content of the nuclear ices that may be quantifiable using this modeling approach.",
    "authors": [
      "Robin T. Garrod"
    ],
    "publication_date": "2019-09-08T01:53:09Z",
    "arxiv_id": "http://arxiv.org/abs/1909.03366v2",
    "download_url": "https://arxiv.org/abs/1909.03366v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin-Frustrated Pyrochlore Chains in the Volcanic Mineral Kamchatkite (KCu3OCl(SO4)2)",
    "abstract": "Search of new frustrated magnetic systems is of a significant importance for physics studying the condensed matter. The platform for geometric frustration of magnetic systems can be provided by copper oxocentric tetrahedra (OCu4) forming the base of crystalline structures of copper minerals from Tolbachik volcanos in Kamchatka. The present work was devoted to a new frustrated antiferromagnetic - kamchatkite (KCu3OCl(SO4)2). The calculation of the sign and strength of magnetic couplings in KCu3OCl(SO4)2 has been performed on the basis of structural data by the phenomenological crystal chemistry method with taking into account corrections on the Jahn-Teller orbital degeneracy of Cu2. It has been established that kamchatkite (KCu3OCl(SO4)2) contains AFM spin-frustrated chains of the pyrochlore type composed of cone-sharing Cu4 tetrahedra. Strong AFM intrachain and interchain couplings compete with each other. Frustration of magnetic couplings in tetrahedral chains is combined with the presence of electric polarization.",
    "authors": [
      "L. M. Volkova",
      "D. V. Marinin"
    ],
    "publication_date": "2017-04-05T09:28:16Z",
    "arxiv_id": "http://arxiv.org/abs/1704.01324v3",
    "download_url": "https://arxiv.org/abs/1704.01324v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "UV-driven Chemistry as a Signpost for Late-stage Planet Formation",
    "abstract": "The chemical reservoir within protoplanetary disks has a direct impact on planetary compositions and the potential for life. A long-lived carbon-and nitrogen-rich chemistry at cold temperatures (<=50K) is observed within cold and evolved planet-forming disks. This is evidenced by bright emission from small organic radicals in 1-10 Myr aged systems that would otherwise have frozen out onto grains within 1 Myr. We explain how the chemistry of a planet-forming disk evolves from a cosmic-ray/X-ray-dominated regime to an ultraviolet-dominated chemical equilibrium. This, in turn, will bring about a temporal transition in the chemical reservoir from which planets will accrete. This photochemical dominated gas phase chemistry develops as dust evolves via growth, settling and drift, and the small grain population is depleted from the disk atmosphere. A higher gas-to-dust mass ratio allows for deeper penetration of ultraviolet photons is coupled with a carbon-rich gas (C/O > 1) to form carbon-bearing radicals and ions. This further results in gas phase formation of organic molecules, which then would be accreted by any actively forming planets present in the evolved disk.",
    "authors": [
      "Jenny K. Calahan",
      "Edwin A. Bergin",
      "Arthur D. Bosman",
      "Evan Rich",
      "Sean M. Andrews",
      "Jennifer B. Bergner",
      "L. Ilsedore Cleeves",
      "Viviana V. Guzman",
      "Jane Huang",
      "John D. Ilee",
      "Charles J. Law",
      "Romane Le Gal",
      "Karin I. Oberg",
      "Richard Teague",
      "Catherine Walsh",
      "David J. Wilner",
      "Ke Zhang"
    ],
    "publication_date": "2022-12-11T16:41:24Z",
    "arxiv_id": "http://arxiv.org/abs/2212.05539v1",
    "download_url": "https://arxiv.org/abs/2212.05539v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry in Protoplanetary Disks",
    "abstract": "Planets are formed inside disks around young stars. The gas, dust, and ice in these natal disks are the building materials of planets, and therefore their compositions fundamentally shape the final chemical compositions of planets. In this review, we summarize current observations of molecular lines in protoplanetary disks, from near-infrared to millimeter wavelengths. We discuss the basic types of chemical reactions in disks and the current development of chemical modeling. In particular, we highlight the progress made in understanding snowline locations, abundances of main carriers of carbon, oxygen, and nitrogen, and complex organic molecules in disks. Finally, we discuss efforts to trace planet formation history by combining the understanding of disk chemistry and planet formation processes.",
    "authors": [
      "Ke Zhang"
    ],
    "publication_date": "2024-04-23T18:18:37Z",
    "arxiv_id": "http://arxiv.org/abs/2404.15423v1",
    "download_url": "https://arxiv.org/abs/2404.15423v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "QuantumChem-200K: A Large-Scale Open Organic Molecular Dataset for Quantum-Chemistry Property Screening and Language Model Benchmarking",
    "abstract": "The discovery of next-generation photoinitiators for two-photon polymerization (TPP) is hindered by the absence of large, open datasets containing the quantum-chemical and photophysical properties required to model photodissociation and excited-state behavior. Existing molecular datasets typically provide only basic physicochemical descriptors and therefore cannot support data-driven screening or AI-assisted design of photoinitiators. To address this gap, we introduce QuantumChem-200K, a large-scale dataset of over 200,000 organic molecules annotated with eleven quantum-chemical properties, including two-photon absorption (TPA) cross sections, TPA spectral ranges, singlet-triplet intersystem crossing (ISC) energies, toxicity and synthetic accessibility scores, hydrophilicity, solubility, boiling point, molecular weight, and aromaticity. These values are computed using a hybrid workflow that integrates density function theory (DFT), semi-empirical excited-state methods, atomistic quantum solvers, and neural-network predictors. Using QuantumChem-200K, we fine tune the open-source Qwen2.5-32B large language model to create a chemistry AI assistant capable of forward property prediction from SMILES. Benchmarking on 3000 unseen molecules from VQM24 and ZINC20 demonstrates that domain-specific fine-tuning significantly improves accuracy over GPT-4o, Llama-3.1-70B, and the base Qwen2.5-32B model, particularly for TPA and ISC predictions central to photoinitiator design. QuantumChem-200K and the corresponding AI assistant together provide the first scalable platform for high-throughput, LLM-driven photoinitiator screening and accelerated discovery of photosensitive materials.",
    "authors": [
      "Yinqi Zeng",
      "Renjie Li"
    ],
    "publication_date": "2025-11-23T02:33:06Z",
    "arxiv_id": "http://arxiv.org/abs/2511.21747v1",
    "download_url": "https://arxiv.org/abs/2511.21747v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Atmospheric Chemistry of GJ 1214b: Photochemistry and Clouds",
    "abstract": "Recent observations of the transiting super-Earth GJ 1214b reveal that its atmosphere may be hydrogen-rich or water-rich in nature, with clouds or hazes potentially affecting its transmission spectrum in the optical and very-near-IR. Here we further examine the possibility that GJ 1214b does indeed possess a hydrogen-dominated atmosphere, which is the hypothesis that is favored by models of the bulk composition of the planet. We study the effects of non-equilibrium chemistry (photochemistry, thermal chemistry, and mixing) on the planet's transmission spectrum. We furthermore examine the possibility that clouds could play a significant role in attenuating GJ 1214b's transmission spectrum at short wavelengths. We find that non-equilibrium chemistry can have a large effect on the overall chemical composition of GJ 1214b's atmosphere, however these changes mostly take place above the height in the atmosphere that is probed by transmission spectroscopy. The effects of non-equilibrium chemistry on GJ 1214b's transmission spectrum are therefore minimal, with the largest effects taking place if the planet's atmosphere has super-solar metallicity and a low rate of vertical mixing. Interestingly, we find that the best fit to the observations of GJ 1214b's atmosphere in transmission occur if the planet's atmosphere is deficient in CH4, and possesses a cloud layer at a pressure of ~200 mbar. This is consistent with a picture of efficient methane photolysis, accompanied by formation of organic haze that obscures the lower atmosphere of GJ 1214b at optical wavelengths. However, for methane to be absent from GJ 1214b's transmission spectrum, UV photolysis of this molecule must be efficient at pressures of greater than ~1 mbar, whereas we find that methane only photolyzes to pressures less than 0.1 mbar, even under the most optimistic assumptions. (Abridged)",
    "authors": [
      "Eliza Miller-Ricci Kempton",
      "Kevin Zahnle",
      "Jonathan J. Fortney"
    ],
    "publication_date": "2011-04-28T19:20:17Z",
    "arxiv_id": "http://arxiv.org/abs/1104.5477v2",
    "download_url": "https://arxiv.org/abs/1104.5477v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum computational chemistry",
    "abstract": "One of the most promising suggested applications of quantum computing is solving classically intractable chemistry problems. This may help to answer unresolved questions about phenomena like: high temperature superconductivity, solid-state physics, transition metal catalysis, or certain biochemical reactions. In turn, this increased understanding may help us to refine, and perhaps even one day design, new compounds of scientific and industrial importance. However, building a sufficiently large quantum computer will be a difficult scientific challenge. As a result, developments that enable these problems to be tackled with fewer quantum resources should be considered very important. Driven by this potential utility, quantum computational chemistry is rapidly emerging as an interdisciplinary field requiring knowledge of both quantum computing and computational chemistry. This review provides a comprehensive introduction to both computational chemistry and quantum computing, bridging the current knowledge gap. We review the major developments in this area, with a particular focus on near-term quantum computation. Illustrations of key methods are provided, explicitly demonstrating how to map chemical problems onto a quantum computer, and solve them. We conclude with an outlook for this nascent field.",
    "authors": [
      "Sam McArdle",
      "Suguru Endo",
      "Alan Aspuru-Guzik",
      "Simon Benjamin",
      "Xiao Yuan"
    ],
    "publication_date": "2018-08-30T17:11:45Z",
    "arxiv_id": "http://arxiv.org/abs/1808.10402v3",
    "download_url": "https://arxiv.org/abs/1808.10402v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Gas Chemistry in Starbursts and AGN",
    "abstract": "We present the main results of an extragalactic survey aiming to study the chemistry of molecular gas in a limited sample of starburst galaxies (SB) and AGN hosts. Observations have been carried out with the IRAM 30m telescope and the Plateau de Bure Interferometer (PdBI). The high resolution/sensitivity of the PdBI has made possible to obtain high quality images of the galaxies using specific molecular gas tracers of Shock Chemistry, Photon Dominated Regions (PDR) and X-ray Dominated Regions (XDR). The occurrence of large-scale shocks and the propagation of PDR chemistry in starbursts can be studied. We also discuss the onset of XDR chemistry in AGN.",
    "authors": [
      "S. Garcia-Burillo",
      "A. Fuente",
      "A. Usero",
      "J. Martin-Pintado"
    ],
    "publication_date": "2003-10-20T15:50:06Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0310554v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0310554v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deuterium chemistry in the primordial gas",
    "abstract": "We review and update some aspects of deuterium chemistry in the post-recombination Universe with particular emphasis on the formation and destruction of HD. We examine in detail the available theoretical and experimental data for the leading reactions of deuterium chemistry and we highlight the areas where improvements in the determination of rate coefficients are necessary to reduce the remaining uncertainties. We discuss the cooling properties of HD and the modifications to the standard cooling function introduced by the presence of the cosmological radiation field. Finally, we consider the effects of deuterium chemistry on the dynamical collapse of primordial clouds in a simple ``top-hat'' scenario, and we speculate on the minimum mass a cloud must have in order to be able to cool in a Hubble time.",
    "authors": [
      "D. Galli",
      "F. Palla"
    ],
    "publication_date": "2002-02-18T13:17:49Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0202329v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0202329v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dust-gas chemistry in AGB outflows: Chemical modelling of dust-gas chemistry within AGB outflows I. Effect on the gas-phase chemistry",
    "abstract": "Chemical modelling of AGB outflows is typically focused on either non-thermodynamic equilibrium chemistry in the inner region or photon-driven chemistry in the outer region. We include, for the first time, a comprehensive dust-gas chemistry in our AGB outflow chemical kinetics model, including both dust-gas interactions and grain-surface chemistry. The dust is assumed to have formed in the inner region, and follows an interstellar-like dust-size distribution. Using radiative transfer modelling, we obtain dust temperature profiles for different dust types in an O-rich and a C-rich outflow. We calculate a grid of models, sampling different outflow densities, drift velocities between the dust and gas, and dust types. Dust-gas chemistry can significantly affect the gas-phase composition, depleting parent and daughter species and increasing the abundance of certain daughter species via grain-surface formation followed by desorption/sputtering. Its influence depends on four factors: outflow density, dust temperature, initial composition, and drift velocity. The largest effects are for higher density outflows with cold dust and O-rich parent species, as these species generally have a larger binding energy. At drift velocities larger than $\\sim 10$ km s$^{-1}$, ice mantles undergo sputtering; however, they are not fully destroyed. Models with dust-gas chemistry can better reproduce the observed depletion of species in O-rich outflows. When including colder dust in the C-rich outflows and adjusting the binding energy of CS, the depletion in C-rich outflows is also better reproduced. To best interpret high-resolution molecular line observations from AGB outflows, dust-gas interactions are needed in chemical kinetics models.",
    "authors": [
      "M. Van de Sande",
      "C. Walsh",
      "T. P. Mangan",
      "L. Decin"
    ],
    "publication_date": "2019-09-23T15:05:21Z",
    "arxiv_id": "http://arxiv.org/abs/1909.10410v2",
    "download_url": "https://arxiv.org/abs/1909.10410v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Player Chemistry: Striving for a Perfectly Balanced Soccer Team",
    "abstract": "Soccer scouts typically ignore the team balance and team chemistry when evaluating potential signings for their teams. Instead, they focus on the individual qualities of the players in isolation. To overcome this limitation of their recruitment process, this paper takes a first step towards objectively providing insight into the question: How well does a team of soccer players gel? We address that question in both an observational and a predictive setting. In the former setting, we observe the chemistry between players who have actually played together, which is relevant when selecting the best possible line-up for a match. In the latter setting, we predict the chemistry between players who have never played together before, which is particularly relevant to assess the fit of a potential signing with the players who are already on the team.\n  We introduce two chemistry metrics that measure the offensive and defensive chemistry for a pair of players, respectively. The offensive chemistry metric measures the pair's joint performance in terms of scoring goals, whereas the defensive chemistry metric measures their joint performance in preventing their opponents from scoring goals. We compute our metrics for 361 seasons in 106 different competitions and present a number of concrete use cases. For instance, we show that the partnership between Mohamed Salah and Roberto Firmino in Liverpool's 2017/2018 Champions League campaign exhibited the highest mutual chemistry between two players. Furthermore, we show that Mesut Özil's chemistry has rapidly started declining following Alexis Sánchez' departure to Manchester United in 2018.",
    "authors": [
      "Lotte Bransen",
      "Jan Van Haaren"
    ],
    "publication_date": "2020-02-28T07:25:32Z",
    "arxiv_id": "http://arxiv.org/abs/2003.01712v1",
    "download_url": "https://arxiv.org/abs/2003.01712v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extending physical chemistry to populations of living organisms. First step: measuring coupling strength",
    "abstract": "For any system, whether physical or non-physical, knowledge of the form and strength of inter-individual interactions is a key-information. In an approach based on statistical physics one needs to know the interaction Hamiltonian. For non-physical systems, based on qualitative arguments similar to those used in physical chemistry, interaction strength gives useful clues about the macroscopic properties of the system. Even though our ultimate objective is the understanding of social phenomena, we found that systems composed of insects (or other living organisms) are of great convenience for investigating group effects. In this paper we show how to design experiments that enable us to estimate the strength of interaction in groups of insects. By repeating the same experiments with increasing numbers of insects, ranging from less than 10 to several hundreds, one is able to explore key-properties of the interaction. The data turn out to be consistent with a global correlation that is independent of distance (at least within a range of a few centimetres). Estimates of this average cross-correlation will be given for ants, beetles and fruit flies. The experimental results clearly exclude an Ising-like interaction, that is to say one that would be restricted to nearest neighbours. In the case of fruit flies the average cross-correlation appears to be negative which means that instead of an inter-individual attraction there is a (weak) repulsive effect. In our conclusion we insist on the fact that such \"physics-like experiments\" on insect populations provide a valuable alternative to computer simulations. When testable group effects are predicted by a model, the required experiments can be set up, thus permitting to confirm or disprove the model.",
    "authors": [
      "Zengru Di",
      "Bertrand M. Roehner"
    ],
    "publication_date": "2012-12-27T11:24:02Z",
    "arxiv_id": "http://arxiv.org/abs/1212.6349v1",
    "download_url": "https://arxiv.org/abs/1212.6349v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The chemistry of planet-forming regions is not interstellar",
    "abstract": "Advances in infrared and submillimeter technology have allowed for detailed observations of the molecular content of the planet-forming regions of protoplanetary disks. In particular, disks around solar-type stars now have growing molecular inventories that can be directly compared with both prestellar chemistry and that inferred for the early solar nebula. The data directly address the old question whether the chemistry of planet-forming matter is similar or different and unique relative to the chemistry of dense clouds and protostellar envelopes. The answer to this question may have profound consequences for the structure and composition of planetary systems. The practical challenge is that observations of emission lines from disks do not easily translate into chemical concentrations. Here, we present a two-dimensional radiative transfer model of RNO 90, a classical protoplanetary disk around a solar-mass star, and retrieve the concentrations of dominant molecular carriers of carbon, oxygen and nitrogen in the terrestrial region around 1 AU. We compare our results to the chemical inventory of dense clouds and protostellar envelopes, and argue that inner disk chemistry is, as expected, fundamentally different from prestellar chemistry. We find that the clearest discriminant may be the concentration of CO$_2$, which is extremely low in disks, but one of the most abundant constituents of dense clouds and protostellar envelopes.",
    "authors": [
      "Klaus M. Pontoppidan",
      "Sandra M. Blevins"
    ],
    "publication_date": "2014-06-05T17:39:52Z",
    "arxiv_id": "http://arxiv.org/abs/1406.1457v1",
    "download_url": "https://arxiv.org/abs/1406.1457v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "TARMAC: A Taxonomy for Robot Manipulation in Chemistry",
    "abstract": "Chemistry laboratory automation aims to increase throughput, reproducibility, and safety, yet many existing systems still depend on frequent human intervention. Advances in robotics have reduced this dependency, but without a structured representation of the required skills, autonomy remains limited to bespoke, task-specific solutions with little capacity to transfer beyond their initial design. Current experiment abstractions typically describe protocol-level steps without specifying the robotic actions needed to execute them. This highlights the lack of a systematic account of the manipulation skills required for robots in chemistry laboratories. To address this gap, we introduce TARMAC - a Taxonomy for Robot Manipulation in Chemistry - a domain-specific framework that defines and organizes the core manipulations needed in laboratory practice. Based on annotated teaching-lab demonstrations and supported by experimental validation, TARMAC categorizes actions according to their functional role and physical execution requirements. Beyond serving as a descriptive vocabulary, TARMAC can be instantiated as robot-executable primitives and composed into higher-level macros, enabling skill reuse and supporting scalable integration into long-horizon workflows. These contributions provide a structured foundation for more flexible and autonomous laboratory automation. More information is available at https://tarmac-paper.github.io/",
    "authors": [
      "Kefeng Huang",
      "Jonathon Pipe",
      "Alice E. Martin",
      "Tianyuan Wang",
      "Barnabas A. Franklin",
      "Andy M. Tyrrell",
      "Ian J. S. Fairlamb",
      "Jihong Zhu"
    ],
    "publication_date": "2025-10-22T06:46:46Z",
    "arxiv_id": "http://arxiv.org/abs/2510.19289v1",
    "download_url": "https://arxiv.org/abs/2510.19289v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Statistical Mechanical Approach to Combinatorial Chemistry",
    "abstract": "An analogy between combinatorial chemistry and Monte Carlo computer simulation is pursued. Examples of how to design libraries for both materials discovery and protein molecular evolution are given. For materials discovery, the concept of library redesign, or the use previous experiments to guide the design of new experiments, is introduced. For molecular evolution, examples of how to use ``biased'' Monte Carlo to search the protein sequence space are given. Chemical information, whether intuition, theoretical calculations, or database statistics, can be naturally incorporated as an a priori bias in the Monte Carlo approach to library design in combinatorial chemistry. In this sense, combinatorial chemistry can be viewed as an extension of traditional chemical synthesis.",
    "authors": [
      "Michael W. Deem"
    ],
    "publication_date": "2000-09-16T02:09:48Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0009243v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0009243v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry of Low Mass Substellar Objects",
    "abstract": "\"Brown dwarfs\" is the collective name for objects more massive than giant planets such as Jupiter but less massive than M dwarf stars. This review gives a brief description of the classification and chemistry of low mass dwarfs. The current spectral classification of stars includes L and T dwarfs that encompass the coolest known stars and substellar objects. The relatively low atmospheric temperatures and high total pressures in substellar dwarfs lead to molecular gas and condensate chemistry. The chemistry of elements such as C, N, O, Ti, V, Fe, Cr, and the alkali elements play a dominant role in shaping the optical and infrared spectra of the \"failed\" stars. Chemical diagnostics for the subclassifications are described.",
    "authors": [
      "Katharina Lodders",
      "Bruce Fegley,"
    ],
    "publication_date": "2006-01-17T23:44:48Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0601381v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0601381v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Carbon Monoxide Affecting Planetary Atmospheric Chemistry",
    "abstract": "CO is an important component in many N2/CH4 atmospheres including Titan, Triton, and Pluto, and has also been detected in the atmosphere of a number of exoplanets. Numerous experimental simulations have been carried out in the laboratory to understand the chemistry in N2/CH4 atmospheres, but very few simulations have included CO in the initial gas mixtures. The effect of CO on the chemistry occurring in these atmospheres is still poorly understood. We have investigated the effect of CO on both gas and solid phase chemistry in a series of planetary atmosphere simulation experiments using gas mixtures of CO, CH4, and N2 with a range of CO mixing ratios from 0.05% to 5% at low temperature (~100 K). We find that CO affects the gas phase chemistry, the density, and the composition of the solids. Specifically, with the increase of CO in the initial gases, there is less H2 but more H2O, HCN, C2H5N/HCNO and CO2 produced in the gas phase, while the density, oxygen content, and degree of unsaturation of the solids increase. The results indicate that CO has an important impact on the chemistry occurring in our experiments and accordingly in planetary atmospheres.",
    "authors": [
      "Chao He",
      "Sarah M. Horst",
      "Sydney Riemer",
      "Joshua A. Sebree",
      "Nicholas Pauley",
      "Veronique Vuitton"
    ],
    "publication_date": "2017-05-23T18:26:22Z",
    "arxiv_id": "http://arxiv.org/abs/1705.08468v1",
    "download_url": "https://arxiv.org/abs/1705.08468v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry and line emission of outer protoplanetary disks",
    "abstract": "The structure and chemistry of protoplanetary disks depends strongly on the nature of the central star around which it has formed. The dust temperature is mainly set by the stellar luminosity, while the chemistry of the upper disk layers depends on the amount of intercepted UV and X-ray flux. We will study the differences in chemistry, thermal sturcture and line emission around Herbig Ae/Be, T Tauri stars and low mass M dwarfs. Predictions will be made for future observations with SOFIA and Herschel.",
    "authors": [
      "Inga Kamp",
      "Cornelis P. Dullemond",
      "Michiel Hogerheijde",
      "Jesus Emilio Enriquez"
    ],
    "publication_date": "2005-09-21T18:15:30Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0509643v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0509643v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Molecules in the Galactic Center. Hot Core Chemistry without Hot Cores",
    "abstract": "We study the origin of large abundances of complex organic molecules in the Galactic center (GC). We carried out a systematic study of the complex organic molecules CH3OH, C2H5OH, (CH3)2O, HCOOCH3, HCOOH, CH3COOH, H2CO, and CS toward 40 GC molecular clouds. Using the LTE approximation, we derived the physical properties of GC molecular clouds and the abundances of the complex molecules.The CH3OH abundance between clouds varies by nearly two orders of magnitude from 2.4x10^{-8} to 1.1x10^{-6}. The abundance of the other complex organic molecules relative to that of CH3OH is basically independent of the CH3OH abundance, with variations of only a factor 4-8. The abundances of complex organic molecules in the GC are compared with those measured in hot cores and hot corinos, in which these complex molecules are also abundant. We find that both the abundance and the abundance ratios of the complex molecules relative to CH3OH in hot cores are similar to those found in the GC clouds. However, hot corinos show different abundance ratios than observed in hot cores and in GC clouds. The rather constant abundance of all the complex molecules relative to CH3OH suggests that all complex molecules are ejected from grain mantles by shocks. Frequent (similar 10^{5}years) shocks with velocities >6km/s are required to explain the high abundances in gas phase of complex organic molecules in the GC molecular clouds. The rather uniform abundance ratios in the GC clouds and in Galactic hot cores indicate a similar average composition of grain mantles in both kinds of regions. The Sickle and the Thermal Radio Arches, affected by UV radiation, show different relative abundances in the complex organic molecules due to the differentially photodissociation of these molecules.",
    "authors": [
      "M. A. Requena-Torres",
      "J. Martín-Pintado",
      "A. Rodríguez-Franco",
      "S. Martín",
      "N. J. Rodríguez-Fernández",
      "P. de Vicente"
    ],
    "publication_date": "2006-05-01T19:22:31Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0605031v2",
    "download_url": "https://arxiv.org/abs/astro-ph/0605031v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Spintronics",
    "abstract": "In this paper we review the recent field of organic spintronics, where organic materials are applied as a medium to transport and control spin-polarized signals. The contacts for injecting and detecting spins are formed by metals, oxides, or inorganic semiconductors. First, the basic concepts of spintronics and organic electronics are addressed and phenomena which are in particular relevant for organic spintronics are highlighted. Experiments using different organic materials, including carbon nanotubes, organic thin films, self-assembled monolayers and single molecules are then reviewed. Observed magnetoresistance points toward successful spin injection and detection, but spurious magnetoresitance effects can easily be confused with spin accumulation. A few studies report long spin relaxation times and lengths, which forms a promising basis for further research. We conclude with discussing outstanding questions and problems.",
    "authors": [
      "W. J. M. Naber",
      "S. Faez",
      "W. G. van der Wiel"
    ],
    "publication_date": "2007-03-19T11:48:06Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0703455v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0703455v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "New Bistable Solutions in Molecular Cloud Chemistry: Nitrogen and Carbon Autocatalysis",
    "abstract": "We have investigated the chemistry of dense interstellar clouds and found new bistable solutions in the nitrogen and carbon chemistries. We identify the autocatalytic processes that are present in the pure, reduced, chemical networks and, as previously found for oxygen chemistry, that He$^+$ plays an important role.\n  The applicability of these results to astronomical environments is briefly discussed. The bistable solutions found for carbon chemistry occur for low densities and high ionization fractions that are not compatible with that found cold, dense clouds. Bistability in the pure nitrogen chemistry occurs for conditions that are relevant for prestellar cores in which significant CO depletion has taken place. We conclude that several autocatalyses are embedded in gas-phase interstellar chemistry and that many more are potentially present.",
    "authors": [
      "Dufour Gwenaëlle",
      "Steven B. Charnley"
    ],
    "publication_date": "2023-04-27T19:31:21Z",
    "arxiv_id": "http://arxiv.org/abs/2304.14477v1",
    "download_url": "https://arxiv.org/abs/2304.14477v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry and clumpiness in planetary nebulae",
    "abstract": "We study the chemistry in the slow wind during the transition from AGB star to pre-planetary nebula (PPN) and planetary nebula (PN). We show that there is a very rich chemistry of degradation products created by photoprocessing, driven by the gradually hardening radiation field of the central star. Most of these products are, however, photodissociated during the PPN phase if the wind is smooth. By contrast, if the wind is clumpy, possibly because of clumpiness in the AGB atmosphere, then many of these degradation products survive into the PN phase. Thus, chemistry may be used to infer the existence of clumpiness in the AGB phase. We identify potential molecular tracers, and we note that, in the case of clumpiness, large molecules may survive the transport from the stellar atmosphere to the interstellar medium. We compare between our model results with observations of three objects at differing evolutionary stages: CRL618, NGC 7027 and the Helix nebula (NGC 7293).",
    "authors": [
      "M. P. Redman",
      "S. Viti",
      "P. Cau",
      "D. A. Williams"
    ],
    "publication_date": "2003-08-06T15:54:53Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0308098v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0308098v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predictive Chemistry Augmented with Text Retrieval",
    "abstract": "This paper focuses on using natural language descriptions to enhance predictive models in the chemistry field. Conventionally, chemoinformatics models are trained with extensive structured data manually extracted from the literature. In this paper, we introduce TextReact, a novel method that directly augments predictive chemistry with texts retrieved from the literature. TextReact retrieves text descriptions relevant for a given chemical reaction, and then aligns them with the molecular representation of the reaction. This alignment is enhanced via an auxiliary masked LM objective incorporated in the predictor training. We empirically validate the framework on two chemistry tasks: reaction condition recommendation and one-step retrosynthesis. By leveraging text retrieval, TextReact significantly outperforms state-of-the-art chemoinformatics models trained solely on molecular data.",
    "authors": [
      "Yujie Qian",
      "Zhening Li",
      "Zhengkai Tu",
      "Connor W. Coley",
      "Regina Barzilay"
    ],
    "publication_date": "2023-12-08T07:40:59Z",
    "arxiv_id": "http://arxiv.org/abs/2312.04881v1",
    "download_url": "https://arxiv.org/abs/2312.04881v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analog quantum chemistry simulation",
    "abstract": "Computing the electronic structure of molecules with high precision is a central challenge in the field of quantum chemistry. Despite the enormous success of approximate methods, tackling this problem exactly with conventional computers is still a formidable task. This has triggered several theoretical and experimental efforts to use quantum computers to solve chemistry problems, with first proof-of-principle realizations done in a digital manner. An appealing alternative to the digital approach is analog quantum simulation, which does not require a scalable quantum computer, and has already been successfully applied in condensed matter physics problems. However, all available or planned setups cannot be used in quantum chemistry problems, since it is not known how to engineer the required Coulomb interactions with them. Here, we present a new approach to the simulation of quantum chemistry problems in an analog way. Our method relies on the careful combination of two technologies: ultra-cold atoms in optical lattices and cavity QED. In the proposed simulator, fermionic atoms hopping in an optical potential play the role of electrons, additional optical potentials provide the nuclear attraction, and a single spin excitation over a Mott insulator mediates the electronic Coulomb repulsion with the help of a cavity mode. We also provide the operational conditions of the simulator and benchmark it with a simple molecule. Our work opens up the possibility of efficiently computing electronic structures of molecules with analog quantum simulation.",
    "authors": [
      "J. Argüello-Luengo",
      "A. González-Tudela",
      "T. Shi",
      "P. Zoller",
      "J. I. Cirac"
    ],
    "publication_date": "2018-07-24T16:47:44Z",
    "arxiv_id": "http://arxiv.org/abs/1807.09228v2",
    "download_url": "https://arxiv.org/abs/1807.09228v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]