[
  {
    "title": "Library Design in Combinatorial Chemistry by Monte Carlo Methods",
    "abstract": "Strategies for searching the space of variables in combinatorial chemistry experiments are presented, and a random energy model of combinatorial chemistry experiments is introduced. The search strategies, derived by analogy with the computer modeling technique of Monte Carlo, effectively search the variable space even in combinatorial chemistry experiments of modest size. Efficient implementations of the library design and redesign strategies are feasible with current experimental capabilities.",
    "authors": [
      "Marco Falcioni",
      "Michael W. Deem"
    ],
    "publication_date": "2000-07-06T22:03:18Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0007114v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0007114v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ideograms for Physics and Chemistry",
    "abstract": "Ideograms (symbols that represent a word or idea) have great communicative value. They refer to concepts in a simple manner, easing the understanding of related ideas. Moreover, ideograms can simplify the often cumbersome notation used in the fields of Physics and physical Chemistry. Nonetheless only a few specific ideograms for these fields have been defined to date. In this work we propose that the scientific community follows the example of Mathematics -as well as that of oriental languages- and bestows a more important role upon ideograms. To support this thesis we propose ideograms for essential concepts in Physics and Chemistry. They are designed to be intuitive, and their goal is to make equations easier to read and understand. Our symbols are included in a publicly available Latex package (svrsymbols).",
    "authors": [
      "Pablo García-Risueño",
      "Apostolos Syropoulos",
      "Natalia Verges"
    ],
    "publication_date": "2016-10-07T16:44:01Z",
    "arxiv_id": "http://arxiv.org/abs/1610.02968v1",
    "download_url": "https://arxiv.org/abs/1610.02968v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ab initio methods for polariton chemistry",
    "abstract": "Polariton chemistry exploits the strong interaction between quantized excitations in molecules and quantized photon states in optical cavities to affect chemical reactivity. Molecular polaritons have been experimentally realized by the coupling of electronic, vibrational, and rovibrational transitions to photon modes, which has spurred tremendous theoretical effort to model and explain how polariton formation can influence chemistry. This tutorial review focuses on computational approaches for the electronic strong coupling problem through the combination of familiar techniques from ab initio electronic structure theory and cavity quantum electrodynamics, toward the goal of supplying predictive theories for polariton chemistry. Our aim is to emphasize the relevant theoretical details with enough clarity for newcomers to the field to follow, and to present simple and practical code examples to catalyze further development work.",
    "authors": [
      "Jonathan J. Foley",
      "Jonathan F. McTague",
      "A. Eugene DePrince"
    ],
    "publication_date": "2023-07-10T20:03:17Z",
    "arxiv_id": "http://arxiv.org/abs/2307.04881v2",
    "download_url": "https://arxiv.org/abs/2307.04881v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Chemistry of Quantum Spin Liquids",
    "abstract": "Quantum spin liquids are an exciting playground for exotic physical phenomena and emergent many-body quantum states. The realization and discovery of quantum spin liquid candidate materials and associated phenomena lie at the intersection of solid-state chemistry, condensed matter physics and materials science and engineering. In this review, we provide the current status of the crystal chemistry, synthetic techniques, physical properties, and research methods in the field of quantum spin liquids. We also highlight a number of specific quantum spin liquid candidate materials and their structure-property relationships, elucidating their fascinating behavior and connecting it to the intricacies of their structures. Furthermore, we share our thoughts on defects and their inevitable presence in materials, of which quantum spin liquids are no exception, which can complicate the interpretation of characterization of these materials, and urge the community to extend their attention to materials preparation and data analysis, cognizant of the impact of defects. This review was written with the intention of providing guidance on improving the materials design and growth of quantum spin liquids, and painting a picture of the beauty of the underlying chemistry of this exciting class of materials.",
    "authors": [
      "J. R. Chamorro",
      "T. T. Tran",
      "T. M. McQueen"
    ],
    "publication_date": "2020-06-18T22:39:22Z",
    "arxiv_id": "http://arxiv.org/abs/2006.10882v1",
    "download_url": "https://arxiv.org/abs/2006.10882v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "LLM Chemistry Estimation for Multi-LLM Recommendation",
    "abstract": "Multi-LLM collaboration promises accurate, robust, and context-aware solutions, yet existing approaches rely on implicit selection and output assessment without analyzing whether collaborating models truly complement or conflict. We introduce LLM Chemistry -- a framework that measures when LLM combinations exhibit synergistic or antagonistic behaviors that shape collective performance beyond individual capabilities. We formalize the notion of chemistry among LLMs, propose algorithms that quantify it by analyzing interaction dependencies, and recommend optimal model ensembles accordingly. Our theoretical analysis shows that chemistry among collaborating LLMs is most evident under heterogeneous model profiles, with its outcome impact shaped by task type, group size, and complexity. Evaluation on classification, summarization, and program repair tasks provides initial evidence for these task-dependent effects, thereby reinforcing our theoretical results. This establishes LLM Chemistry as both a diagnostic factor in multi-LLM systems and a foundation for ensemble recommendation.",
    "authors": [
      "Huascar Sanchez",
      "Briland Hitaj"
    ],
    "publication_date": "2025-10-04T20:21:39Z",
    "arxiv_id": "http://arxiv.org/abs/2510.03930v1",
    "download_url": "https://arxiv.org/abs/2510.03930v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry of the Earth's Earliest Atmosphere",
    "abstract": "In this chapter we describe chemistry of the early atmosphere of the Earth during and shortly after its formation where there is little if any geological record. We review the arguments for a secondary origin of the terrestrial atmosphere, that is by outgassing during and/or after accretion rather than by capture of solar nebula gas. Then we discuss sources of volatiles accreted by the Earth using meteorites as analogs for the material present in the solar nebula. The next section reviews heating during accretion of the Earth. Subsequently we describe chemistry of the silicate vapor, steam, and gaseous stages of atmospheric evolution on the early Earth. We close with a summary of the key questions that remain unresolved.",
    "authors": [
      "Bruce Fegley",
      "Laura Schaefer"
    ],
    "publication_date": "2012-10-01T01:05:30Z",
    "arxiv_id": "http://arxiv.org/abs/1210.0270v1",
    "download_url": "https://arxiv.org/abs/1210.0270v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nonlinear organic plasmonics",
    "abstract": "Purely organic materials with negative and near-zero dielectric permittivity can be easily fabricated. Here we develop a theory of nonlinear non-steady-state organic plasmonics with strong laser pulses. The bistability response of the electron-vibrational model of organic materials in the condensed phase has been demonstrated. Non-steady-state organic plasmonics enable us to obtain near-zero dielectric permittivity during a short time. We have proposed to use non-steady-state organic plasmonics for the enhancement of intersite dipolar energy-transfer interaction in the quantum dot wire that influences on electron transport through nanojunctions. Such interactions can compensate Coulomb repulsions for particular conditions. We propose the exciton control of Coulomb blocking in the quantum dot wire based on the non-steady-state near-zero dielectric permittivity of the organic host medium.",
    "authors": [
      "B. D. Fainberg",
      "G. Li"
    ],
    "publication_date": "2015-10-01T12:52:12Z",
    "arxiv_id": "http://arxiv.org/abs/1510.00205v1",
    "download_url": "https://arxiv.org/abs/1510.00205v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Chemistry of the Early Universe",
    "abstract": "The chemistry of the early Universe is a fascinating field of study. Even in the absence of any elements heavier than lithium, a surprising degree of chemical complexity proves to be possible, giving the topic considerable interest in its own right. In addition, the fact that molecular hydrogen plays a key role in the formation of the first stars and galaxies means that if we want to understand the formation of these objects, we must first develop a good understanding of the chemical evolution of the gas. In this review, I first give a brief introduction to the chemistry occurring in the gas prior to the formation of the first stars and galaxies, and then go on to discuss in more detail the main chemical processes occurring during the gravitational collapse of gas from intergalactic to protostellar densities, and how these processes influence the final outcome of the collapse.",
    "authors": [
      "S. C. O. Glover"
    ],
    "publication_date": "2011-07-17T16:46:14Z",
    "arxiv_id": "http://arxiv.org/abs/1107.3314v1",
    "download_url": "https://arxiv.org/abs/1107.3314v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-energy astrochemistry in the molecular interstellar medium",
    "abstract": "In the past decade, there has been a significant shift in astrochemistry with a renewed focus on the role of non-thermal processes on the molecular interstellar medium, in particular energetic particles (such as cosmic ray particles and fast electrons) and X-ray radiation. This has been brought about in large part due to new observations of interstellar complex organic molecules (iCOMS) in environments that would inhibit their formation, such as cold, dense gas in prestellar cores or in the highly energetic environments in galactic centers. In parallel, there has been a plethora of new laboratory investigations on the role of high-energy radiation and electrons on the chemistry of astrophysical ices, demonstrating the ability of this radiation to induce complex chemistry. In recent years, theoretical models have also begun to include newer cosmic-ray-driven processes in both the gas and ice phases. In this review, we unify aspects of the chemistry driven by X-ray radiation and energetic particles into a ``high-energy astrochemistry'', defining this term and reviewing the underlying chemical processes. We conclude by examining various laboratories where high-energy astrochemistry is at play and identify future issues to be tackled.",
    "authors": [
      "Brandt A. L. Gaches",
      "Serena Viti"
    ],
    "publication_date": "2025-12-10T20:28:28Z",
    "arxiv_id": "http://arxiv.org/abs/2512.10060v2",
    "download_url": "https://arxiv.org/abs/2512.10060v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Framework for Combustion Chemistry Acceleration with DeepONets",
    "abstract": "A combustion chemistry acceleration scheme is developed based on deep operator networks (DeepONets). The scheme is based on the identification of combustion reaction dynamics through a modified DeepOnet architecture such that the solutions of thermochemical scalars are projected to new solutions in small and flexible time increments. The approach is designed to efficiently implement chemistry acceleration without the need for computationally expensive integration of stiff chemistry. An additional framework of latent-space dynamics identification with modified DeepOnet is also proposed which enhances the computational efficiency and widens the applicability of the proposed scheme. The scheme is demonstrated on simple chemical kinetics of hydrogen oxidation to more complex chemical kinetics of n-dodecane high- and low-temperature oxidations. The proposed framework accurately learns the chemical kinetics and efficiently reproduces species and temperature temporal profiles corresponding to each application. In addition, a very large speed-up with a great extrapolation capability is also observed with the proposed scheme.",
    "authors": [
      "Anuj Kumar",
      "Tarek Echekki"
    ],
    "publication_date": "2023-04-06T16:12:15Z",
    "arxiv_id": "http://arxiv.org/abs/2304.12188v1",
    "download_url": "https://arxiv.org/abs/2304.12188v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Chemistry in the Age of Quantum Computing",
    "abstract": "Practical challenges in simulating quantum systems on classical computers have been widely recognized in the quantum physics and quantum chemistry communities over the past century. Although many approximation methods have been introduced, the complexity of quantum mechanics remains hard to appease. The advent of quantum computation brings new pathways to navigate this challenging complexity landscape. By manipulating quantum states of matter and taking advantage of their unique features such as superposition and entanglement, quantum computers promise to efficiently deliver accurate results for many important problems in quantum chemistry such as the electronic structure of molecules. In the past two decades significant advances have been made in developing algorithms and physical hardware for quantum computing, heralding a revolution in simulation of quantum systems. This article is an overview of the algorithms and results that are relevant for quantum chemistry. The intended audience is both quantum chemists who seek to learn more about quantum computing, and quantum computing researchers who would like to explore applications in quantum chemistry.",
    "authors": [
      "Yudong Cao",
      "Jonathan Romero",
      "Jonathan P. Olson",
      "Matthias Degroote",
      "Peter D. Johnson",
      "Mária Kieferová",
      "Ian D. Kivlichan",
      "Tim Menke",
      "Borja Peropadre",
      "Nicolas P. D. Sawaya",
      "Sukin Sim",
      "Libor Veis",
      "Alán Aspuru-Guzik"
    ],
    "publication_date": "2018-12-24T19:49:51Z",
    "arxiv_id": "http://arxiv.org/abs/1812.09976v2",
    "download_url": "https://arxiv.org/abs/1812.09976v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "MetaChem: An Algebraic Framework for Artificial Chemistries",
    "abstract": "We introduce MetaChem, a language for representing and implementing Artificial Chemistries. We motivate the need for modularisation and standardisation in representation of artificial chemistries. We describe a mathematical formalism for Static Graph MetaChem, a static graph based system. MetaChem supports different levels of description, and has a formal description; we illustrate these using StringCatChem, a toy artificial chemistry. We describe two existing Artificial Chemistries -- Jordan Algebra AChem and Swarm Chemistries -- in MetaChem, and demonstrate how they can be combined in several different configurations by using a MetaChem environmental link. MetaChem provides a route to standardisation, reuse, and composition of Artificial Chemistries and their tools.",
    "authors": [
      "Penelope Faulkner Rainford",
      "Angelika Sebald",
      "Susan Stepney"
    ],
    "publication_date": "2019-05-29T15:42:24Z",
    "arxiv_id": "http://arxiv.org/abs/1905.12541v3",
    "download_url": "https://arxiv.org/abs/1905.12541v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The chemistry of high-mass star formation",
    "abstract": "This paper reviews the chemistry of star-forming regions, with an emphasis on the formation of high-mass stars. We first outline the basic molecular processes in dense clouds, their implementation in chemical models, and techniques to measure molecular abundances. Then, recent observational, theoretical and laboratory developments are reviewed on the subjects of hot molecular cores, cosmic-ray ionization, depletion and deuteration, and oxygen chemistry. The paper concludes with a summary of outstanding problems and future opportunities.",
    "authors": [
      "Floris F. S. van der Tak"
    ],
    "publication_date": "2005-06-07T15:23:59Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0506146v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0506146v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Carbon chemistry in Galactic Bulge Planetary Nebulae",
    "abstract": "Galactic Bulge Planetary Nebulae show evidence of mixed chemistry with emission from both silicate dust and PAHs. This mixed chemistry is unlikely to be related to carbon dredge up, as third dredge-up is not expected to occur in the low mass Bulge stars. We show that the phenomenon is widespread, and is seen in 30 nebulae out of 40 of our sample, selected on the basis of their infrared flux. HST images and UVES spectra show that the mixed chemistry is not related to the presence of emission-line stars, as it is in the Galactic disk population. We also rule out interaction with the ISM as origin of the PAHs. Instead, a strong correlation is found with morphology, and the presence of a dense torus. A chemical model is presented which shows that hydrocarbon chains can form within oxygen-rich gas through gas-phase chemical reactions. The model predicts two layers, one at $A_V\\sim 1.5$ where small hydrocarbons form from reactions with C$^+$, and one at $A_V\\sim 4$, where larger chains (and by implication, PAHs) form from reactions with neutral, atomic carbon. These reactions take place in a mini-PDR. We conclude that the mixed chemistry phenomenon occurring in the Galactic Bulge Planetary Nebulae is best explained through hydrocarbon chemistry in an UV-irradiated, dense torus.",
    "authors": [
      "L. Guzman-Ramirez",
      "A. A. Zijlstra",
      "R. Ni Chuimin",
      "K. Gesicki",
      "E. Lagadec",
      "T. J. Millar",
      "Paul M. Woods"
    ],
    "publication_date": "2011-02-22T19:00:21Z",
    "arxiv_id": "http://arxiv.org/abs/1102.4581v1",
    "download_url": "https://arxiv.org/abs/1102.4581v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring the chemistry induced by energetic processing of the H2-bearing, CO-rich apolar ice layer",
    "abstract": "Interstellar ice mantles on the surfaces of dust grains are thought to have a bi-layered structure, with a H2O-rich polar layer, covered by a CO-rich apolar layer that probably harbors H2 and other volatiles such as N2. In this work, we explore the chemistry induced by 2 keV electrons and Ly-alpha photons in H2:CO:15N2 ice analogs of the CO-rich layer when exposed to similar fluences to those expected from the cosmic-ray-induced secondary electrons and UV photons during the typical lifetime of dense clouds. Six products were identified upon 2 keV electron irradiation: CO2, C2O (and other carbon chainoxides), CH4, H2CO, H2C2O, and H15NCO. The total product abundances corresponded to 5-10% of the initial CO molecules exposed to the electron irradiation. Ly-alpha photon irradiation delivered 1-2 orders of magnitude lower yields with a similar product branching ratio, which may be due to the low UV-photon absorption cross-section of the ice sample at this wavelength. Formation of additional N-bearing species, namely C215N2 and 15NH3, was only observed in the absence of H2 and CO molecules, respectively, suggesting that reactants derived from H2 and CO molecules preferentially react with each other instead of with 15N2 and its dissociation products. In summary, ice chemistry induced by energetic processing of the CO-rich apolar ice layer provides alternative formation pathways for several species detected in the interstellar medium, including some related to the complex organic molecule chemistry. Further quantification of these pathways will help astrochemical models to constrain their relative contribution to the interstellar budget of, especially, the organic species H2CO and HNCO.",
    "authors": [
      "Rafael Martin-Domenech",
      "Pavlo Maksiutenko",
      "Karin I. Oberg",
      "Mahesh Rajappan"
    ],
    "publication_date": "2020-09-02T20:45:17Z",
    "arxiv_id": "http://arxiv.org/abs/2009.01335v1",
    "download_url": "https://arxiv.org/abs/2009.01335v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PAH chemistry at eV internal energies. 1. H-shifted isomers",
    "abstract": "The PAH family of organic compounds (polycyclic aromatic hydrocarbons), involved in several fields of chemistry, has received particular attention in astrochemistry, where their vibrational spectroscopy, thermodynamic, dynamic, and fragmentation properties are now abundantly documented. This survey aims at drawing trends for low spin-multiplicity surfaces of PAHs bearing internal energies in the range 1-10 eV. It addresses some typical alternatives to the ground-state regular structures of PAHs, making explicit possible intramolecular rearrangements leading to high-lying minima. These isomerisations should be taken into consideration when addressing PAH processing in astrophysical conditions. The first part of this double-entry study focuses on the hydrogen-shifted forms, which bear both a carbene center and a saturated carbon. It rests upon DFT calculations mainly performed on two emblematic PAH representatives, coronene and pyrene, in their neutral and mono and multi-cationic states. Systematically searched for in neutral species, these H-shifted minima are lying 4-5 eV above the regular all-conjugated forms, and are separated by barriers of about one eV. General hydrogen-shifting is found to be easier for cationic species as the relative energies of their H-shifted minima are 1-1.5 eV lower than those for neutral species. As much as possible, classical knowledge and concepts of organic chemistry such as aromaticity and Clar's rules are invoked for result interpretation.",
    "authors": [
      "Georges Trinquier",
      "Aude Simon",
      "Mathias Rapacioli",
      "Florent Xavier Gadéa"
    ],
    "publication_date": "2017-02-14T13:05:14Z",
    "arxiv_id": "http://arxiv.org/abs/1702.04186v1",
    "download_url": "https://arxiv.org/abs/1702.04186v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular shape as a (useful) bias in chemistry",
    "abstract": "One of the molecular properties most intuitive to the human perception is the geometrical shape. However, when exploring a large chemical space the determination of shape needs to be automated. We present a fast and simple approach to identify a molecule as linear, planar, cube, cuboid, disk, elliptical disk, spheroid and sphere which is more fine grained than existing approaches. The method is applied to more than one billion molecules ranging from small organic molecules to whole proteins. The results show that current chemistry research is biased towards planar geometries. Moreover, we demonstrate that our molecular shape classification correlates with sought-after properties like the band gap, dipole moment, and heat capacity. This allows to increase the efficiency of molecular design studies by driving high-throughput-screening efforts towards desired values of molecular properties.",
    "authors": [
      "Guido Falk von Rudorff"
    ],
    "publication_date": "2019-04-15T13:36:27Z",
    "arxiv_id": "http://arxiv.org/abs/1904.07035v1",
    "download_url": "https://arxiv.org/abs/1904.07035v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graph Neural Networks for the Prediction of Substrate-Specific Organic Reaction Conditions",
    "abstract": "We present a systematic investigation using graph neural networks (GNNs) to model organic chemical reactions. To do so, we prepared a dataset collection of four ubiquitous reactions from the organic chemistry literature. We evaluate seven different GNN architectures for classification tasks pertaining to the identification of experimental reagents and conditions. We find that models are able to identify specific graph features that affect reaction conditions and lead to accurate predictions. The results herein show great promise in advancing molecular machine learning.",
    "authors": [
      "Serim Ryou",
      "Michael R. Maser",
      "Alexander Y. Cui",
      "Travis J. DeLano",
      "Yisong Yue",
      "Sarah E. Reisman"
    ],
    "publication_date": "2020-07-08T17:21:00Z",
    "arxiv_id": "http://arxiv.org/abs/2007.04275v2",
    "download_url": "https://arxiv.org/abs/2007.04275v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "GAUCHE: A Library for Gaussian Processes in Chemistry",
    "abstract": "We introduce GAUCHE, a library for GAUssian processes in CHEmistry. Gaussian processes have long been a cornerstone of probabilistic machine learning, affording particular advantages for uncertainty quantification and Bayesian optimisation. Extending Gaussian processes to chemical representations, however, is nontrivial, necessitating kernels defined over structured inputs such as graphs, strings and bit vectors. By defining such kernels in GAUCHE, we seek to open the door to powerful tools for uncertainty quantification and Bayesian optimisation in chemistry. Motivated by scenarios frequently encountered in experimental chemistry, we showcase applications for GAUCHE in molecular discovery and chemical reaction optimisation. The codebase is made available at https://github.com/leojklarner/gauche",
    "authors": [
      "Ryan-Rhys Griffiths",
      "Leo Klarner",
      "Henry B. Moss",
      "Aditya Ravuri",
      "Sang Truong",
      "Samuel Stanton",
      "Gary Tom",
      "Bojana Rankovic",
      "Yuanqi Du",
      "Arian Jamasb",
      "Aryan Deshwal",
      "Julius Schwartz",
      "Austin Tripp",
      "Gregory Kell",
      "Simon Frieder",
      "Anthony Bourached",
      "Alex Chan",
      "Jacob Moss",
      "Chengzhi Guo",
      "Johannes Durholt",
      "Saudamini Chaurasia",
      "Felix Strieth-Kalthoff",
      "Alpha A. Lee",
      "Bingqing Cheng",
      "Alán Aspuru-Guzik",
      "Philippe Schwaller",
      "Jian Tang"
    ],
    "publication_date": "2022-12-06T08:28:21Z",
    "arxiv_id": "http://arxiv.org/abs/2212.04450v2",
    "download_url": "https://arxiv.org/abs/2212.04450v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Reactive processing of formaldehyde and acetaldehyde in aqueous aerosol mimics: Surface tension depression and secondary organic products",
    "abstract": "The reactive uptake of carbonyl-containing volatile organic compounds (cVOCs) by aqueous atmospheric aerosols is a likely source of particulate organic material. The aqueous-phase secondary organic products of some cVOCs are surface-active. Therefore, cVOC uptake can lead to organic film formation at the gas-aerosol interface and changes in aerosol surface tension. We examined the chemical reactions of two abundant cVOCs, formaldehyde and acetaldehyde, in water and aqueous ammonium sulfate (AS) solutions mimicking tropospheric aerosols. Secondary organic products were identified using Aerosol Chemical Ionization Mass Spectrometry (Aerosol-CIMS), and changes in surface tension were monitored using pendant drop tensiometry. Hemiacetal oligomers and aldol condensation products were identified using Aerosol-CIMS. Acetaldehyde depresses surface tension to 65(\\pm2) dyn/cm in pure water (a 10% surface tension reduction from that of pure water) and 62(\\pm1) dyn/cm in AS solutions (a 20.6% reduction from that of a 3.1 M AS solution). Surface tension depression by formaldehyde in pure water is negligible; in AS solutions, a 9% reduction in surface tension is observed. Mixtures of these species were also studied in combination with methylglyoxal in order to evaluate the influence of cross-reactions on surface tension depression and product formation in these systems. We find that surface tension depression in the solutions containing mixed cVOCs exceeds that predicted by an additive model based on the single-species isotherms.",
    "authors": [
      "Zhi Li",
      "Allison N. Schwier",
      "Neha Sareen",
      "V. Faye McNeill"
    ],
    "publication_date": "2011-06-15T16:12:40Z",
    "arxiv_id": "http://arxiv.org/abs/1106.3015v3",
    "download_url": "https://arxiv.org/abs/1106.3015v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Accurate Chemistry Collection: Coupled cluster atomization energies for broad chemical space",
    "abstract": "Accurate thermochemical data with sub-chemical accuracy (i.e., within $\\pm$1 kcal mol$^{-1}$ from sufficiently accurate experimental or theoretical reference data) is essential for the development and improvement of computational chemistry methods. Challenging thermochemical properties such as heats of formation and total atomization energies (TAEs) are of particular interest because they rigorously test the ability of computational chemistry methods to accurately describe complex chemical transformations involving multiple bond rearrangements. Yet, existing thermochemical datasets that confidently reach this level of accuracy are limited in either size or scope. Datasets with highly accurate reference values include a small number of data points, and larger datasets provide less accurate data or only cover a narrow portion of the chemical space. The existing datasets are therefore insufficient for developing data-driven methods with predictive accuracy over a large chemical space. The Microsoft Research Accurate Chemistry Collection (MSR-ACC) will address this challenge. Here, it offers the MSR-ACC/TAE25 dataset of 76,879 total atomization energies obtained at the CCSD(T)/CBS level via the W1-F12 thermochemical protocol. The dataset is constructed to exhaustively cover chemical space for all elements up to argon by enumerating and sampling chemical graphs, thus avoiding bias towards any particular subspace of the chemical space (such as drug-like, organic, or experimentally observed molecules). With this first dataset in MSR-ACC, we enable data-driven approaches for developing predictive computational chemistry methods with unprecedented accuracy and scope.",
    "authors": [
      "Sebastian Ehlert",
      "Jan Hermann",
      "Thijs Vogels",
      "Victor Garcia Satorras",
      "Stephanie Lanius",
      "Marwin Segler",
      "Derk P. Kooi",
      "Kenji Takeda",
      "Chin-Wei Huang",
      "Giulia Luise",
      "Rianne van den Berg",
      "Paola Gori-Giorgi",
      "Amir Karton"
    ],
    "publication_date": "2025-06-17T13:12:43Z",
    "arxiv_id": "http://arxiv.org/abs/2506.14492v3",
    "download_url": "https://arxiv.org/abs/2506.14492v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Advantage in Computational Chemistry?",
    "abstract": "For decades, computational chemistry has been posited as one of the areas in which quantum computing would revolutionize. However, the algorithmic advantages that fault-tolerant quantum computers have for chemistry can be overwhelmed by other disadvantages, such as error correction, processor speed, etc. To assess when quantum computing will be disruptive to computational chemistry, we compare a wide range of classical methods to quantum computational methods by extending the framework proposed by Choi, Moses, and Thompson. Our approach accounts for the characteristics of classical and quantum algorithms, and hardware, both today and as they improve.\n  We find that in many cases, classical computational chemistry methods will likely remain superior to quantum algorithms for at least the next couple of decades. Nevertheless, quantum computers are likely to make important contributions in two important areas. First, for simulations with tens or hundreds of atoms, highly accurate methods such as Full Configuration Interaction are likely to be surpassed by quantum phase estimation in the coming decade. Secondly, in cases where quantum phase estimation is most efficient less accurate methods like Couple Cluster and Moller-Plesset, could be surpassed in fifteen to twenty years if the technical advancements for quantum computers are favorable. Overall, we find that in the next decade or so, quantum computing will be most impactful for highly accurate computations with small to medium-sized molecules, whereas classical computers will likely remain the typical choice for calculations of larger molecules.",
    "authors": [
      "Hans Gundlach",
      "Keeper Sharkey",
      "Jayson Lynch",
      "Victoria Hazoglou",
      "Kung-Chuan Hsu",
      "Carl Dukatz",
      "Eleanor Crane",
      "Karin Walczyk",
      "Marcin Bodziak",
      "Johannes Galatsanos-Dueck",
      "Neil Thompson"
    ],
    "publication_date": "2025-08-28T16:26:09Z",
    "arxiv_id": "http://arxiv.org/abs/2508.20972v1",
    "download_url": "https://arxiv.org/abs/2508.20972v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Structural Cellular Hash Chemistry",
    "abstract": "Hash Chemistry, a minimalistic artificial chemistry model of open-ended evolution, has recently been extended to non-spatial and cellular versions. The non-spatial version successfully demonstrated continuous adaptation and unbounded growth of complexity of self-replicating entities, but it did not simulate multiscale ecological interactions among the entities. On the contrary, the cellular version explicitly represented multiscale spatial ecological interactions among evolving patterns, yet it failed to show meaningful adaptive evolution or complexity growth. It remains an open question whether it is possible to create a similar minimalistic evolutionary system that can exhibit all of those desired properties at once within a computationally efficient framework. Here we propose an improved version called Structural Cellular Hash Chemistry (SCHC). In SCHC, individual identities of evolving patterns are explicitly represented and processed as the connected components of the nearest neighbor graph of active cells. The neighborhood connections are established by connecting active cells with other active cells in their Moore neighborhoods in a 2D cellular grid. Evolutionary dynamics in SCHC are simulated via pairwise competitions of two randomly selected patterns, following the approach used in the non-spatial Hash Chemistry. SCHC's computational cost was significantly less than the original and non-spatial versions. Numerical simulations showed that these model modifications achieved spontaneous movement, self-replication and unbounded growth of complexity of spatial evolving patterns, which were clearly visible in space in a highly intuitive manner. Detailed analysis of simulation results showed that there were spatial ecological interactions among self-replicating patterns and their diversity was also substantially promoted in SCHC, neither of which was present in the non-spatial version.",
    "authors": [
      "Hiroki Sayama"
    ],
    "publication_date": "2024-12-17T10:51:01Z",
    "arxiv_id": "http://arxiv.org/abs/2412.12790v1",
    "download_url": "https://arxiv.org/abs/2412.12790v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Effects of Subsurface Chemistry in the Grain Mantles on the Deuterium Chemistry in Molecular Clouds",
    "abstract": "The deuterium enrichment in molecules in dark molecular cloud cores and starforming regions is usually attributed to gas-phase chemistry. Here we examine the effects of surface and mantle chemical reactions on the deuteration of species. We use a simple kinetic chemistry model that includes gas, surface and mantle pore phase reactions of deuterated species. The mantle is assumed to be partially reactive due to pores with sufficient surface area for chemical reactions, that are continuously transformed by cosmic-rays. Calculation results show that surface reactions generally enhance the deuteration for at least several molecules. However, once they are buried and become mantle molecules, they lose their deuteration over a timescale of 10 million years due to processes in the mantle. If deuterated species in young star-forming regions come from grain mantles, a cautious conclusion is that the freeze-out of molecules, perhaps, should not occur more than 10 Myr before the mantle evaporates to the gas phase.",
    "authors": [
      "Juris Kalvans",
      "Ivar Shmeld"
    ],
    "publication_date": "2018-03-15T13:21:53Z",
    "arxiv_id": "http://arxiv.org/abs/1803.05731v1",
    "download_url": "https://arxiv.org/abs/1803.05731v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electronic Visualisation in Chemistry: From Alchemy to Art",
    "abstract": "Chemists now routinely use software as part of their work. For example, virtual chemistry allows chemical reactions to be simulated. In particular, a selection of software is available for the visualisation of complex 3-dimensional molecular structures. Many of these are very beautiful in their own right. As well as being included as illustrations in academic papers, such visualisations are often used on the covers of chemistry journals as artistically decorative and attractive motifs. Chemical images have also been used as the basis of artworks in exhibitions. This paper explores the development of the relationship of chemistry, art, and IT. It covers some of the increasingly sophisticated software used to generate these projections (e.g., UCSF Chimera) and their progressive use as a visual art form.",
    "authors": [
      "Karl Harrison",
      "Jonathan P. Bowen",
      "Alice M. Bowen"
    ],
    "publication_date": "2013-07-24T09:54:22Z",
    "arxiv_id": "http://arxiv.org/abs/1307.6360v1",
    "download_url": "https://arxiv.org/abs/1307.6360v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Theoretical Challenges in Polaritonic Chemistry",
    "abstract": "Polaritonic chemistry exploits strong light-matter coupling between molecules and confined electromagnetic field modes to enable new chemical reactivities. In systems displaying this functionality, the choice of the cavity determines both the confinement of the electromagnetic field and the number of molecules that are involved in the process, whereas in wavelength-scale optical cavities light-matter interaction is ruled by collective effects, plasmonic subwavelength nanocavities allow even single molecules to reach strong coupling. Due to these very distinct situations, a multiscale theoretical toolbox is then required to explore the rich phenomenology of polaritonic chemistry. Within this framework, each component of the system (molecules and electromagnetic modes) needs to be treated in sufficient detail to obtain reliable results. Starting from the very general aspects of light-molecule interactions in typical experimental setups, we underline the basic concepts that should be taken into account when operating in this new area of research. Building on these considerations, we then provide a map of the theoretical tools already available to tackle chemical applications of molecular polaritons at different scales. Throughout the discussion, we draw attention to both the successes and the challenges still ahead in the theoretical description of polaritonic chemistry.",
    "authors": [
      "Jacopo Fregoni",
      "Francisco J. García-Vidal",
      "Johannes Feist"
    ],
    "publication_date": "2021-11-16T11:50:19Z",
    "arxiv_id": "http://arxiv.org/abs/2111.08394v1",
    "download_url": "https://arxiv.org/abs/2111.08394v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Is there evidence for exponential quantum advantage in quantum chemistry?",
    "abstract": "The idea to use quantum mechanical devices to simulate other quantum systems is commonly ascribed to Feynman. Since the original suggestion, concrete proposals have appeared for simulating molecular and materials chemistry through quantum computation, as a potential ``killer application''. Indications of potential exponential quantum advantage in artificial tasks have increased interest in this application, thus, it is critical to understand the basis for potential exponential quantum advantage in quantum chemistry. Here we gather the evidence for this case in the most common task in quantum chemistry, namely, ground-state energy estimation. We conclude that evidence for such an exponential advantage across chemical space has yet to be found. While quantum computers may still prove useful for quantum chemistry, it may be prudent to assume exponential speedups are not generically available for this problem.",
    "authors": [
      "Seunghoon Lee",
      "Joonho Lee",
      "Huanchen Zhai",
      "Yu Tong",
      "Alexander M. Dalzell",
      "Ashutosh Kumar",
      "Phillip Helms",
      "Johnnie Gray",
      "Zhi-Hao Cui",
      "Wenyuan Liu",
      "Michael Kastoryano",
      "Ryan Babbush",
      "John Preskill",
      "David R. Reichman",
      "Earl T. Campbell",
      "Edward F. Valeev",
      "Lin Lin",
      "Garnet Kin-Lic Chan"
    ],
    "publication_date": "2022-08-03T16:33:57Z",
    "arxiv_id": "http://arxiv.org/abs/2208.02199v3",
    "download_url": "https://arxiv.org/abs/2208.02199v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Surface chemistry in photodissociation regions",
    "abstract": "The presence of dust can strongly affect the chemical composition of the interstellar medium. We model the chemistry in photodissociation regions (PDRs) using both gas-phase and dust-phase chemical reactions. Our aim is to determine the chemical compositions of the interstellar medium (gas/dust/ice) in regions with distinct (molecular) gas densities that are exposed to radiation fields with different intensities. We have significantly improved the Meijerink PDR code by including 3050 new gas-phase chemical reactions and also by implementing surface chemistry. In particular, we have included 117 chemical reactions occurring on grain surfaces covering different processes, such as adsorption, thermal desorption, chemical desorption, two-body reactions, photo processes, and cosmic-ray processes on dust grains. We obtain abundances for different gas and solid species as a function of visual extinction, depending on the density and radiation field. We also analyse the rates of the formation of CO2 and H2O ices in different environments. In addition, we study how chemistry is affected by the presence/absence of ice mantles (bare dust or icy dust) and the impact of considering different desorption probabilities. The type of substrate (bare dust or icy dust) and the probability of desorption can significantly alter the chemistry occurring on grain surfaces, leading to differences of several orders of magnitude in the abundances of gas-phase species, such as CO, H2CO, and CH3OH. The type of substrate, together with the density and intensity of the radiation field, also determine the threshold extinction to form ices of CO2 and H2O. We also conclude that H2CO and CH3OH are mainly released into the gas phase of low, far-ultraviolet illuminated PDRs through chemical desorption upon two-body surface reactions, rather than through photodesorption.",
    "authors": [
      "G. B. Esplugues",
      "S. Cazaux",
      "R. Meijerink",
      "M. Spaans",
      "P. Caselli"
    ],
    "publication_date": "2016-04-22T15:24:59Z",
    "arxiv_id": "http://arxiv.org/abs/1604.06797v1",
    "download_url": "https://arxiv.org/abs/1604.06797v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nitrogen isotopic fractionation during abiotic synthesis of organic solid particles",
    "abstract": "The formation of organic compounds is generally assumed to result from abiotic processes in the Solar System, with the exception of biogenic organics on Earth. Nitrogen-bearing organics are of particular interest, notably for prebiotic perspectives but also for overall comprehension of organic formation in the young solar system and in planetary atmospheres. We have investigated abiotic synthesis of organics upon plasma discharge, with special attention to N isotope fractionation. Organic aerosols were synthesized from N2-CH4 and N2-CO gaseous mixtures using low-pressure plasma discharge experiments, aimed at simulating chemistry occurring in Titan s atmosphere and in the protosolar nebula, respectively. Nitrogen is efficiently incorporated into the synthesized solids, independently of the oxidation degree, of the N2 content of the starting gas mixture, and of the nitrogen speciation in the aerosols. The aerosols are depleted in 15N by 15-25 permil relative to the initial N2 gas, whatever the experimental setup is. Such an isotopic fractionation is attributed to mass-dependent kinetic effect(s). Nitrogen isotope fractionation upon electric discharge cannot account for the large N isotope variations observed among solar system objects and reservoirs. Extreme N isotope signatures in the solar system are more likely the result of self-shielding during N2 photodissociation, exotic effect during photodissociation of N2 and/or low temperature ion-molecule isotope exchange. Kinetic N isotope fractionation may play a significant role in the Titan s atmosphere. We also suggest that the low delta15N values of Archaean organic matter are partly the result of abiotic synthesis of organics that occurred at that time.",
    "authors": [
      "Maïa Kuga",
      "Nathalie Carrasco",
      "Bernard Marty",
      "Yves Marrocchi",
      "Sylvain Bernard",
      "Thomas Rigaudier",
      "Benjamin Fleury",
      "Laurent Tissandier"
    ],
    "publication_date": "2014-07-01T14:27:40Z",
    "arxiv_id": "http://arxiv.org/abs/1407.0254v1",
    "download_url": "https://arxiv.org/abs/1407.0254v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Benchmarking Retrieval-Augmented Generation for Chemistry",
    "abstract": "Retrieval-augmented generation (RAG) has emerged as a powerful framework for enhancing large language models (LLMs) with external knowledge, particularly in scientific domains that demand specialized and dynamic information. Despite its promise, the application of RAG in the chemistry domain remains underexplored, primarily due to the lack of high-quality, domain-specific corpora and well-curated evaluation benchmarks. In this work, we introduce ChemRAG-Bench, a comprehensive benchmark designed to systematically assess the effectiveness of RAG across a diverse set of chemistry-related tasks. The accompanying chemistry corpus integrates heterogeneous knowledge sources, including scientific literature, the PubChem database, PubMed abstracts, textbooks, and Wikipedia entries. In addition, we present ChemRAG-Toolkit, a modular and extensible RAG toolkit that supports five retrieval algorithms and eight LLMs. Using ChemRAG-Toolkit, we demonstrate that RAG yields a substantial performance gain -- achieving an average relative improvement of 17.4% over direct inference methods. We further conduct in-depth analyses on retriever architectures, corpus selection, and the number of retrieved passages, culminating in practical recommendations to guide future research and deployment of RAG systems in the chemistry domain. The code and data is available at https://chemrag.github.io.",
    "authors": [
      "Xianrui Zhong",
      "Bowen Jin",
      "Siru Ouyang",
      "Yanzhen Shen",
      "Qiao Jin",
      "Yin Fang",
      "Zhiyong Lu",
      "Jiawei Han"
    ],
    "publication_date": "2025-05-12T15:34:45Z",
    "arxiv_id": "http://arxiv.org/abs/2505.07671v1",
    "download_url": "https://arxiv.org/abs/2505.07671v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ALMA observations of the kinematics and chemistry of disc formation",
    "abstract": "Context: The R CrA cloud hosts a handful of Class 0/I low-mass young stellar objects. The chemistry and physics at scales $>500$ AU in this cloud are dominated by the irradiation from the nearby Herbig Be star R CrA. The luminous large-scale emission makes it necessary to use high-resolution spectral imaging to study the chemistry and dynamics of the inner envelopes and discs of the protostars.\n  Aims: We aim to better understand the structure of the inner regions of these protostars and, in particular, the interplay between the chemistry and the presence of discs.\n  Methods: Using Atacama Large Millimeter/submillimeter Array (ALMA) high-resolution spectral imaging interferometry observations, we study the molecular line and dust continuum emission at submillimetre wavelengths.\n  Results: We detect dust continuum emission from four circumstellar discs around Class 0/I objects within the R CrA cloud. Towards IRS7B we detect C$^{17}$O emission showing a rotation curve consistent with a Keplerian disc with a well-defined edge that gives a good estimate for the disc radius at 50 AU. We derive the central object mass to $2.3M_{\\odot}$ and the disc mass to $0.024M_{\\odot}$. The observations are also consistent with a model of material infalling under conservation of angular momentum; however, this model provides a worse fit to the data. We also report a likely detection of faint CH$_3$OH emission towards this point source, as well as more luminous CH$_3$OH emission in an outflow orthogonal to the major axis of the C$^{17}$O emission.\n  Conclusions: The faint CH$_3$OH emission seen towards IRS7B can be explained by a flat density profile of the inner envelope caused by the disc with a radius $\\lesssim50$ AU. We propose that the regions of the envelopes where complex organic molecules are present in Class 0/I young stellar objects can become quenched as the disc grows.",
    "authors": [
      "Johan E. Lindberg",
      "Jes K. Jørgensen",
      "Christian Brinch",
      "Troels Haugbølle",
      "Edwin A. Bergin",
      "Daniel Harsono",
      "Magnus V. Persson",
      "Ruud Visser",
      "Satoshi Yamamoto"
    ],
    "publication_date": "2014-05-06T20:00:19Z",
    "arxiv_id": "http://arxiv.org/abs/1405.1416v2",
    "download_url": "https://arxiv.org/abs/1405.1416v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ChemiQ: A Chemistry Simulator for Quantum Computer",
    "abstract": "Quantum computing, an innovative computing system carrying prominent processing rate, is meant to be the solutions to problems in many fields. Among these realms, the most intuitive application is to help chemical researchers correctly de-scribe strong correlation and complex systems, which are the great challenge in current chemistry simulation. In this paper, we will present a standalone quantum simulation tool for chemistry, ChemiQ, which is designed to assist people carry out chemical research or molecular calculation on real or virtual quantum computers. Under the idea of modular programming in C++ language, the software is designed as a full-stack tool without third-party physics or chemistry application packages. It provides services as follow: visually construct molecular structure, quickly simulate ground-state energy, scan molecular potential energy curve by distance or angle, study chemical reaction, and return calculation results graphically after analysis.",
    "authors": [
      "Qingchun Wang",
      "Huan-Yu Liu",
      "Qing-Song Li",
      "Jianyu Zhao",
      "Qiankun Gong",
      "Ye Li",
      "Yu-Chun Wu",
      "Guo-Ping Guo"
    ],
    "publication_date": "2021-06-18T14:57:03Z",
    "arxiv_id": "http://arxiv.org/abs/2106.10162v3",
    "download_url": "https://arxiv.org/abs/2106.10162v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Computing in the Spotlight",
    "abstract": "Organic Computing is an initiative in the field of systems engineering that proposed to make use of concepts such as self-adaptation and self-organisation to increase the robustness of technical systems. Based on the observation that traditional design and operation concepts reach their limits, transferring more autonomy to the systems themselves should result in a reduction of complexity for users, administrators, and developers. However, there seems to be a need for an updated definition of the term \"Organic Computing\", of desired properties of technical, organic systems, and the objectives of the Organic Computing initiative. With this article, we will address these points.",
    "authors": [
      "Sven Tomforde",
      "Bernhard Sick",
      "Christian Müller-Schloer"
    ],
    "publication_date": "2017-01-27T17:35:56Z",
    "arxiv_id": "http://arxiv.org/abs/1701.08125v1",
    "download_url": "https://arxiv.org/abs/1701.08125v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Signatures of Nitrogen Chemistry in Hot Jupiter Atmospheres",
    "abstract": "Inferences of molecular compositions of exoplanetary atmospheres have generally focused on C, H, and O-bearing molecules. Recently, additional absorption in HST WFC3 transmission spectra around 1.55$μ$m has been attributed to nitrogen-bearing chemical species: NH$_3$ or HCN. These species, if present in significant abundance, would be strong indicators of disequilibrium chemical processes -- e.g. vertical mixing and photochemistry. The derived N abundance, in turn, could also place important constraints on planetary formation mechanisms. Here, we examine the detectability of nitrogen chemistry in exoplanetary atmospheres. In addition to the WFC3 bandpass (1.1-1.7$μ$m), we find that observations in K-band at $\\sim$2.2$μ$m, achievable with present ground-based telescopes, sample a strong NH$_3$ feature, whilst observations at $\\sim$3.1$μ$m and $\\sim$4.0$μ$m sample strong HCN features. In anticipation of such observations, we predict absorption feature amplitudes due to nitrogen chemistry in the 1-5$μ$m spectral range possible for a typical hot Jupiter. Finally, we conduct atmospheric retrievals of 9 hot Jupiter transmission spectra in search of near-infrared absorption features suggestive of nitrogen chemistry. We report weak detections of NH$_3$ in WASP-31b (2.2$σ$), HCN in WASP-63b (2.3$σ$), and excess absorption that could be attributed to NH$_3$ in HD 209458b. High-precision observations from 1-5$μ$m (e.g., with the James Webb Space Telescope), will enable definitive detections of nitrogen chemistry, in turn serving as powerful diagnostics of disequilibrium atmospheric chemistry and planetary formation processes.",
    "authors": [
      "Ryan J. MacDonald",
      "Nikku Madhusudhan"
    ],
    "publication_date": "2017-11-01T18:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/1711.00467v1",
    "download_url": "https://arxiv.org/abs/1711.00467v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unified Microscopic-Macroscopic Monte Carlo Simulations of Complex Organic Molecule Chemistry in Cold Cores",
    "abstract": "The recent discovery of methyl formate and dimethyl ether in the gas phase of cold cores with temperatures as cold as 10 K challenges our previous astrochemical models concerning the formation of complex organic molecules. The strong correlation between the abundances and distributions of methyl formate and dimethyl ether further shows that current astrochemical models may be missing important chemical processes in cold astronomical sources. We investigate a scenario in which complex organic molecules and the methoxy radical can be formed on dust grains via a so-called \"chain reaction\" mechanism, in a similar manner to CO$_2$. A unified gas-grain microscopic-macroscopic Monte Carlo approach with both normal and interstitial sites for icy grain mantles is used to perform the chemical simulations. Reactive desorption with varying degrees of efficiency is included to enhance the non-thermal desorption of species formed on cold dust grains. In addition, varying degrees of efficiency for the surface formation of methoxy are also included. The observed abundances of a variety of organic molecules in cold cores can be reproduced in our models. The strong correlation between the abundances of methyl formate and dimethyl ether in cold cores can also be explained. Non-diffusive chemical reactions on dust grain surfaces may play a key role in the formation of some complex organic molecules.",
    "authors": [
      "Qiang Chang",
      "Eric Herbst"
    ],
    "publication_date": "2016-03-13T09:05:02Z",
    "arxiv_id": "http://arxiv.org/abs/1603.04011v1",
    "download_url": "https://arxiv.org/abs/1603.04011v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Determining the density of in-gap states in organic semiconductors: A pitfall of photoelectron yield spectroscopy",
    "abstract": "Accurate determination of low-density electronic states in the bandgap (in-gap states) is crucial for optimizing the performance of organic optoelectronic devices. Derivative photoelectron yield spectroscopy (PYS) is employed to estimate the density of states (DOS) of in-gap states. However, low-energy photons in PYS can generate excitons and anions in organic semiconductors, raising questions about whether derivative PYS spectra truly represent the DOS. We revealed that PYS signals originate from the single-quantum external photoelectron effect (SQEPE) of in-gap states, SQEPE of the singly occupied molecular orbital (SOMO) of anions, and the biphotonic electron emission (BEE) effect via exciton fusion. Because BEE signals mask the DOS contribution, derivative PYS misestimates the DOS of in-gap states. In contrast, constant final state yield spectroscopy (CFS-YS) reliably determines the DOS by separating these components. For a tris(8-hydroxyquinoline) aluminum (Alq3) film, CFS-YS revealed the DOS of in-gap and SOMO states over six orders of magnitude, clarifying why the Alq3 layer works effectively in organic light-emitting diodes. In the devices, BEE can act as carrier-generation and degradation processes, and CFS-YS can also probe it. We provide the practical guidelines of low-energy photon measurements for DOS determination, such as measurements of photon-flux dependency.",
    "authors": [
      "Ryotaro Nakazawa",
      "Masaya Kitaoka",
      "Ryota Kaimori",
      "Manato Tateno",
      "Runa Hoshikawa",
      "Yuya Tanaka",
      "Hisao Ishii"
    ],
    "publication_date": "2025-10-01T13:14:52Z",
    "arxiv_id": "http://arxiv.org/abs/2510.00865v2",
    "download_url": "https://arxiv.org/abs/2510.00865v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Developing an AI Course for Synthetic Chemistry Students",
    "abstract": "Artificial intelligence (AI) and data science are transforming chemical research, yet few formal courses are tailored to synthetic and experimental chemists, who often face steep entry barriers due to limited coding experience and lack of chemistry-specific examples. We present the design and implementation of AI4CHEM, an introductory data-driven chem-istry course created for students on the synthetic chemistry track with no prior programming background. The curricu-lum emphasizes chemical context over abstract algorithms, using an accessible web-based platform to ensure zero-install machine learning (ML) workflow development practice and in-class active learning. Assessment combines code-guided homework, literature-based mini-reviews, and collaborative projects in which students build AI-assisted workflows for real experimental problems. Learning gains include increased confidence with Python, molecular property prediction, reaction optimization, and data mining, and improved skills in evaluating AI tools in chemistry. All course materials are openly available, offering a discipline-specific, beginner-accessible framework for integrating AI into synthetic chemistry training.",
    "authors": [
      "Zhiling Zheng"
    ],
    "publication_date": "2025-11-23T01:39:11Z",
    "arxiv_id": "http://arxiv.org/abs/2511.18244v1",
    "download_url": "https://arxiv.org/abs/2511.18244v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "TREXIO: A File Format and Library for Quantum Chemistry",
    "abstract": "TREXIO is an open-source file format and library developed for the storage and manipulation of data produced by quantum chemistry calculations. It is designed with the goal of providing a reliable and efficient method of storing and exchanging wave function parameters and matrix elements, making it an important tool for researchers in the field of quantum chemistry. In this work, we present an overview of the TREXIO file format and library. The library consists of a front-end implemented in the C programming language and two different back-ends: a text back-end and a binary back-end utilizing the HDF5 library which enables fast read and write operations. It is compatible with a variety of platforms and has interfaces for the Fortran, Python, and OCaml programming languages. In addition, a suite of tools has been developed to facilitate the use of the TREXIO format and library, including converters for popular quantum chemistry codes and utilities for validating and manipulating data stored in TREXIO files. The simplicity, versatility, and ease of use of TREXIO make it a valuable resource for researchers working with quantum chemistry data.",
    "authors": [
      "Evgeny Posenitskiy",
      "Vijay Gopal Chilkuri",
      "Abdallah Ammar",
      "Michał Hapka",
      "Katarzyna Pernal",
      "Ravindra Shinde",
      "Edgar Josué Landinez Borda",
      "Claudia Filippi",
      "Kosuke Nakano",
      "Otto Kohulák",
      "Sandro Sorella",
      "Pablo de Oliveira Castro",
      "William Jalby",
      "Pablo López Rıós",
      "Ali Alavi",
      "Anthony Scemama"
    ],
    "publication_date": "2023-02-28T17:44:54Z",
    "arxiv_id": "http://arxiv.org/abs/2302.14793v2",
    "download_url": "https://arxiv.org/abs/2302.14793v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On the stability of nonisothermal Bonnor-Ebert spheres. III. The role of chemistry in core stabilization",
    "abstract": "Aims. We investigate the effect of chemistry on the stability of starless cores against gravitational collapse.\n  Methods. We combine chemical and radiative transfer simulations in the context of a modified Bonnor-Ebert sphere to model the effect of chemistry on the gas temperature, and study the effect of temperature changes on core stability.\n  Results. We find that chemistry has in general very little effect on the nondimensional radius $ξ_{\\rm out}$ which parametrizes the core stability. Cores that are initially stable or unstable tend to stay near their initial states, in terms of stability (i.e., $ξ_{\\rm out} \\sim$ constant), as the chemistry develops. This result is independent of the initial conditions. We can however find solutions where $ξ_{\\rm out}$ decreases at late times ($t \\gtrsim 10^6 \\, \\rm yr$) which correspond to increased stabilization caused by the chemistry. Even though the core stability is unchanged by the chemistry in most of the models considered here, we cannot rule out the possibility that a core can evolve from an unstable to a stable state owing to chemical evolution. The reverse case, where an initially stable core becomes ultimately unstable, seems highly unlikely.\n  Conclusions. Our results indicate that chemistry should be properly accounted for in studies of star-forming regions, and that further investigations of core stability especially with hydrodynamical models are warranted.",
    "authors": [
      "O. Sipilä",
      "P. Caselli",
      "M. Juvela"
    ],
    "publication_date": "2017-03-21T12:57:17Z",
    "arxiv_id": "http://arxiv.org/abs/1703.07193v1",
    "download_url": "https://arxiv.org/abs/1703.07193v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "State-to-state chemistry at ultra-low temperature",
    "abstract": "Fully understanding a chemical reaction on the quantum level is a long-standing goal in physics and chemistry. Experimental investigation of such state-to-state chemistry requires both the preparation of the reactants and the detection of the products in a quantum state resolved way, which has been a long term challenge. Using the high level control in the ultracold domain, we prepare a few-body quantum state of reactants and demonstrate state-to-state chemistry with unprecedented resolution. We present measurements and accompanying theoretical analysis for the recombination of three spin-polarized ultracold Rb atoms forming a weakly bound Rb$_2$ dimer. Detailed insights of the reaction process are obtained that suggest propensity rules for the distribution of reaction products. The scheme can readily be adapted to other species and opens a door to detailed investigations of inelastic or reactive processes in domains never before accessible.",
    "authors": [
      "Joschka Wolf",
      "Markus Deiß",
      "Artjom Krükow",
      "Eberhard Tiemann",
      "Brandon P. Ruzic",
      "Yujun Wang",
      "José P. D'Incao",
      "Paul S. Julienne",
      "Johannes Hecker Denschlag"
    ],
    "publication_date": "2017-05-08T14:30:24Z",
    "arxiv_id": "http://arxiv.org/abs/1705.02892v2",
    "download_url": "https://arxiv.org/abs/1705.02892v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lattice Density-Functional Theory for Quantum Chemistry",
    "abstract": "We propose a lattice density-functional theory for {\\it ab initio} quantum chemistry or physics as a route to an efficient approach that approximates the full configuration interaction energy and orbital occupations for molecules with strongly-correlated electrons. We build on lattice density-functional theory for the Hubbard model by deriving Kohn-Sham equations for a reduced then full quantum chemistry Hamiltonian, and demonstrate the method on the potential energy curves for the challenging problem of modelling elongating bonds in a linear chain of six hydrogen atoms. Here the accuracy of the Bethe-ansatz local-density approximation is tested for this quantum chemistry system and we find that, despite this approximate functional being designed for the Hubbard model, the shapes of the potential curves generally agree with the full configuration interaction results. Although there is a discrepancy for very stretched bonds, this is lower than when using standard density-functional theory with the local-density approximation.",
    "authors": [
      "J. P. Coe"
    ],
    "publication_date": "2019-02-22T14:57:21Z",
    "arxiv_id": "http://arxiv.org/abs/1902.08516v3",
    "download_url": "https://arxiv.org/abs/1902.08516v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dust temperature and time-dependent effects in the chemistry of photodissociation regions",
    "abstract": "When studying the chemistry of PDRs, time dependence becomes important as visual extinction increases, since certain chemical timescales are comparable to the cloud lifetime. Dust temperature is also a key factor, since it significantly influences gas temperature and mobility on dust grains, determining the chemistry occurring on grain surfaces. We present a study of the dust temperature impact and time effects on the chemistry of different PDRs, using an updated version of the Meijerink PDR code and combining it with the time-dependent code Nahoon. We find the largest temperature effects in the inner regions of high $G$$_{\\mathrm{0}}$ PDRs, where high dust temperatures favour the formation of simple oxygen-bearing molecules (especially that of O$_2$), while the formation of complex organic molecules is much more efficient at low dust temperatures. We also find that time-dependent effects strongly depend on the PDR type, since long timescales promote the destruction of oxygen-bearing molecules in the inner parts of low $G$$_{\\mathrm{0}}$ PDRs, while favouring their formation and that of carbon-bearing molecules in high $G$$_{\\mathrm{0}}$ PDRs. From the chemical evolution, we also conclude that, in dense PDRs, CO$_2$ is a late-forming ice compared to water ice, and confirm a layered ice structure on dust grains, with H$_2$O in lower layers than CO$_2$. Regarding steady state, the PDR edge reaches chemical equilibrium at early times ($\\lesssim$10$^5$ yr). This time is even shorter ($<$10$^4$ yr) for high $G$$_{\\mathrm{0}}$ PDRs. By contrast, inner regions reach equilibrium much later, especially low $G$$_{\\mathrm{0}}$ PDRs, where steady state is reached at $\\sim$10$^6$-10$^7$ yr.",
    "authors": [
      "Gisela Esplugues",
      "Stephanie Cazaux",
      "Paola Caselli",
      "Seyit Hocuk",
      "Marco Spaans"
    ],
    "publication_date": "2019-04-06T11:42:58Z",
    "arxiv_id": "http://arxiv.org/abs/1904.03420v1",
    "download_url": "https://arxiv.org/abs/1904.03420v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ChemHAS: Hierarchical Agent Stacking for Enhancing Chemistry Tools",
    "abstract": "Large Language Model (LLM)-based agents have demonstrated the ability to improve performance in chemistry-related tasks by selecting appropriate tools. However, their effectiveness remains limited by the inherent prediction errors of chemistry tools. In this paper, we take a step further by exploring how LLMbased agents can, in turn, be leveraged to reduce prediction errors of the tools. To this end, we propose ChemHAS (Chemical Hierarchical Agent Stacking), a simple yet effective method that enhances chemistry tools through optimizing agent-stacking structures from limited data. ChemHAS achieves state-of-the-art performance across four fundamental chemistry tasks, demonstrating that our method can effectively compensate for prediction errors of the tools. Furthermore, we identify and characterize four distinct agent-stacking behaviors, potentially improving interpretability and revealing new possibilities for AI agent applications in scientific research. Our code and dataset are publicly available at https: //anonymous.4open.science/r/ChemHAS-01E4/README.md.",
    "authors": [
      "Zhucong Li",
      "Bowei Zhang",
      "Jin Xiao",
      "Zhijian Zhou",
      "Fenglei Cao",
      "Jiaqing Liang",
      "Yuan Qi"
    ],
    "publication_date": "2025-05-27T06:22:57Z",
    "arxiv_id": "http://arxiv.org/abs/2505.21569v2",
    "download_url": "https://arxiv.org/abs/2505.21569v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First Detection of the Simplest Organic Acid in a Protoplanetary Disk",
    "abstract": "The formation of asteroids, comets and planets occurs in the interior of protoplanetary disks during the early phase of star formation. Consequently, the chemical composition of the disk might shape the properties of the emerging planetary system. In this context, it is crucial to understand whether and what organic molecules are synthesized in the disk. In this Letter, we report the first detection of formic acid (HCOOH) towards the TW Hydrae protoplanetary disk. The observations of the trans-HCOOH 6$_{(1,6)-5(1,5)}$ transition were carried out at 129~GHz with ALMA. We measured a disk-averaged gas-phase t-HCOOH column density of $\\sim$ (2-4)$\\times$10$^{12}$~cm$^{-2}$, namely as large as that of methanol. HCOOH is the first organic molecules containing two oxygen atoms detected in a protoplanetary disk, a proof that organic chemistry is very active even though difficult to observe in these objects. Specifically, this simplest acid stands as the basis for synthesis of more complex carboxylic acids used by life on Earth.",
    "authors": [
      "Cécile Favre",
      "Davide Fedele",
      "Dmitry Semenov",
      "Sergey Parfenov",
      "Claudio Codella",
      "Cecilia Ceccarelli",
      "Edwin A. Bergin",
      "Edwige Chapillon",
      "Leonardo Testi",
      "Franck Hersant",
      "Bertrand Lefloch",
      "Francesco Fontani",
      "Geoffrey A. Blake",
      "L. Ilsedore Cleeves",
      "Chunhua Qi",
      "Kamber R. Schwarz",
      "Vianney Taquet"
    ],
    "publication_date": "2018-07-16T10:15:18Z",
    "arxiv_id": "http://arxiv.org/abs/1807.05768v1",
    "download_url": "https://arxiv.org/abs/1807.05768v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Prebiotic Functional Programs: Endogenous Selection in an Artificial Chemistry",
    "abstract": "Artificial chemistry simulations produce many intriguing emergent behaviors, but they are often difficult to steer or control. This paper proposes a method for steering the dynamics of a classic artificial chemistry model, known as AlChemy (Algorithmic Chemistry), which is based on untyped lambda calculus. Our approach leverages features that are endogenous to AlChemy without constructing an explicit external fitness function or building learning into the dynamics. We demonstrate the approach by synthesizing non-trivial lambda functions, such as Church addition and succession, from simple primitives. The results provide insight into the possibility of endogenous selection in diverse systems such as autocatalytic chemical networks and software systems.",
    "authors": [
      "Devansh Vimal",
      "Cole Mathis",
      "Westley Weimer",
      "Stephanie Forrest"
    ],
    "publication_date": "2025-08-27T00:01:42Z",
    "arxiv_id": "http://arxiv.org/abs/2509.03534v1",
    "download_url": "https://arxiv.org/abs/2509.03534v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum chemistry on quantum annealers",
    "abstract": "Quantum chemistry calculations for small molecules on quantum hardware have been demonstrated to date only on universal-gate quantum computers, not quantum annealers. The latter devices are limited to finding the lowest eigenstate of the Ising Hamiltonian whereas the electronic Hamiltonian could not be mapped to the Ising form without exponential growth of the Ising Hamiltonian with the size of the system [J. Phys. Chem. B 122, 3384 (2018)]. Here we propose a novel mixed discrete-continuous optimization algorithm, which finds the lowest eigenstate of the qubit coupled cluster (QCC) method using a quantum annealer for solving a discrete part of the problem. The QCC method is a potentially exact approach for constructing the electronic wave function in the qubit space. Therefore, our methodology allows for systematically improvable quantum chemistry calculations using quantum annealears. We illustrate capabilities of our approach by calculating QCC ground electronic states for the LiH, H$_2$O, and C$_6$H$_6$ molecules. C$_6$H$_6$ calculations involve 36 qubits and are the largest quantum chemistry calculations made on a quantum annealer (the D-Wave 2000Q system) to date. Our findings opens up a new perspective for use quantum annealers in high-throughput material discovery.",
    "authors": [
      "Scott N. Genin",
      "Ilya G. Ryabinkin",
      "Artur F. Izmaylov"
    ],
    "publication_date": "2019-01-15T08:59:08Z",
    "arxiv_id": "http://arxiv.org/abs/1901.04715v1",
    "download_url": "https://arxiv.org/abs/1901.04715v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Design of a P System based Artificial Graph Chemistry",
    "abstract": "Artificial Chemistries (ACs) are symbolic chemical metaphors for the exploration of Artificial Life, with specific focus on the origin of life. In this work we define a P system based artificial graph chemistry to understand the principles leading to the evolution of life-like structures in an AC set up and to develop a unified framework to characterize and classify symbolic artificial chemistries by devising appropriate formalism to capture semantic and organizational information. An extension of P system is considered by associating probabilities with the rules providing the topological framework for the evolution of a labeled undirected graph based molecular reaction semantics.",
    "authors": [
      "Janardan Misra"
    ],
    "publication_date": "2009-01-03T17:35:49Z",
    "arxiv_id": "http://arxiv.org/abs/0901.0317v1",
    "download_url": "https://arxiv.org/abs/0901.0317v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Taking the Heat Off of Plasmonic Chemistry",
    "abstract": "Several chemical reactions catalyzed by plasmonic nanoparticles show enhanced rates under visible-light-excitation of the localized surface plasmon resonance of the nanoparticles. But it has been argued that there is an associated photothermal effect that can complicate the analysis and/or interpretation of the nature of the role played by plasmon excitation. This Viewpoint discusses this dilemma and provides some best practices for accounting for photothermal contributions in plasmon-excitation-driven chemistry. A classification of plasmonic chemistry into plasmonic photocatalysis and plasmonic photosynthesis is also proposed. It is argued that photosynthetic reactions, which require a Gibb's free energy input, constitute an ultimate test of the non-thermal, photochemical action of plasmon excitation.",
    "authors": [
      "Prashant K. Jain"
    ],
    "publication_date": "2019-08-26T00:34:47Z",
    "arxiv_id": "http://arxiv.org/abs/1908.09415v3",
    "download_url": "https://arxiv.org/abs/1908.09415v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Error Assessment of Computational Models in Chemistry",
    "abstract": "Computational models in chemistry rely on a number of approximations. The effect of such approximations on observables derived from them is often unpredictable. Therefore, it is challenging to quantify the uncertainty of a computational result, which, however, is necessary to assess the suitability of a computational model. Common performance statistics such as the mean absolute error are prone to failure as they do not distinguish the explainable (systematic) part of the errors from their unexplainable (random) part. In this paper, we discuss problems and solutions for performance assessment of computational models based on several examples from the quantum chemistry literature. For this purpose, we elucidate the different sources of uncertainty, the elimination of systematic errors, and the combination of individual uncertainty components to the uncertainty of a prediction.",
    "authors": [
      "Gregor N. Simm",
      "Jonny Proppe",
      "Markus Reiher"
    ],
    "publication_date": "2017-02-02T23:21:42Z",
    "arxiv_id": "http://arxiv.org/abs/1702.00867v1",
    "download_url": "https://arxiv.org/abs/1702.00867v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pushing the Limits of Quantum Computing for Simulating PFAS Chemistry",
    "abstract": "Accurate and scalable methods for computational quantum chemistry can accelerate research and development in many fields, ranging from drug discovery to advanced material design. Solving the electronic Schrodinger equation is the core problem of computational chemistry. However, the combinatorial complexity of this problem makes it intractable to find exact solutions, except for very small systems. The idea of quantum computing originated from this computational challenge in simulating quantum-mechanics. We propose an end-to-end quantum chemistry pipeline based on the variational quantum eigensolver (VQE) algorithm and integrated with both HPC-based simulators and a trapped-ion quantum computer. Our platform orchestrates hundreds of simulation jobs on compute resources to efficiently complete a set of ab initio chemistry experiments with a wide range of parameterization. Per- and poly-fluoroalkyl substances (PFAS) are a large family of human-made chemicals that pose a major environmental and health issue globally. Our simulations includes breaking a Carbon-Fluorine bond in trifluoroacetic acid (TFA), a common PFAS chemical. This is a common pathway towards destruction and removal of PFAS. Molecules are modeled on both a quantum simulator and a trapped-ion quantum computer, specifically IonQ Aria. Using basic error mitigation techniques, the 11-qubit TFA model (56 entangling gates) on IonQ Aria yields near-quantitative results with milli-Hartree accuracy. Our novel results show the current state and future projections for quantum computing in solving the electronic structure problem, push the boundaries for the VQE algorithm and quantum computers, and facilitates development of quantum chemistry workflows.",
    "authors": [
      "Emil Dimitrov",
      "Goar Sanchez-Sanz",
      "James Nelson",
      "Lee O'Riordan",
      "Myles Doyle",
      "Sean Courtney",
      "Venkatesh Kannan",
      "Hassan Naseri",
      "Alberto Garcia Garcia",
      "James Tricker",
      "Marisa Faraggi",
      "Joshua Goings",
      "Luning Zhao"
    ],
    "publication_date": "2023-11-02T13:58:02Z",
    "arxiv_id": "http://arxiv.org/abs/2311.01242v1",
    "download_url": "https://arxiv.org/abs/2311.01242v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hydrocarbon chemistry in inner regions of planet forming disks",
    "abstract": "The analysis of the mid-infrared spectra helps understanding the composition of the gas in the inner, dense and warm terrestrial planet forming region of disks around young stars. ALMA has detected hydrocarbons in the outer regions of the planet forming disk and Spitzer detected \\ce{C2H2} in the inner regions. JWST- MIRI provides high spectral resolution observations of \\ce{C2H2} and a suite of more complex hydrocarbons are now reported. Interpreting the fluxes observed in the spectra is challenging and radiation thermo-chemical codes are needed to properly take into account the disk structure, radiative transfer, chemistry and thermal balance. Various disk physical parameters like the gas-to-dust ratio, dust evolution including radial drift, dust growth and settling can affect the fluxes observed in the mid-IR. Still, thermo-chemical disk models were not always successful in matching all observed molecular emission bands simultaneously. The goal of this project is two-fold. We analyse the warm carbon chemistry in the inner regions of the disk, i.e. within 10 au to find pathways forming \\ce{C2H2} potentially missing from the existing chemical networks. Second, we analyse the effect of the new chemistry on the line fluxes of acetylene. We use radiative thermo-chemical disk code {P{\\small RO}D{\\small I}M{\\small O}} to expand the hydrocarbon chemistry that occurs in a typical standard T Tauri disks. We used the UMIST and the KIDA rate databases for collecting reactions for the species. We include a number of three-body and thermal decomposition reactions from STAND2020 network. We included isotopomers for the species that were present in the databases. The chemistry is then analysed in the regions that produce observable features in the mid-infrared spectra. The effect of expanding the hydrocarbon chemistry on the mid-infrared spectra is studied. Acetylene is formed via two ....",
    "authors": [
      "Jayatee Kanwar",
      "Inga Kamp",
      "Peter Woitke",
      "Christian Rab",
      "Wing-Fai Thi",
      "Michiel Min"
    ],
    "publication_date": "2023-10-06T18:00:27Z",
    "arxiv_id": "http://arxiv.org/abs/2310.04505v1",
    "download_url": "https://arxiv.org/abs/2310.04505v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Full Quantum Eigensolver for Quantum Chemistry Simulations",
    "abstract": "Quantum simulation of quantum chemistry is one of the most compelling applications of quantum computing. It is of particular importance in areas ranging from materials science, biochemistry and condensed matter physics. Here, we propose a full quantum eigensolver (FQE) algorithm to calculate the molecular ground energies and electronic structures using quantum gradient descent. Compared to existing classical-quantum hybrid methods such as variational quantum eigensolver (VQE), our method removes the classical optimizer and performs all the calculations on a quantum computer with faster convergence. The gradient descent iteration depth has a favorable complexity that is logarithmically dependent on the system size and inverse of the precision. Moreover, the FQE can be further simplified by exploiting perturbation theory for the calculations of intermediate matrix elements, and obtain results with a precision that satisfies the requirement of chemistry application. The full quantum eigensolver can be implemented on a near-term quantum computer. With the rapid development of quantum computing hardware, FQE provides an efficient and powerful tool to solve quantum chemistry problems.",
    "authors": [
      "Shijie Wei",
      "Hang Li",
      "GuiLu Long"
    ],
    "publication_date": "2019-08-21T15:32:48Z",
    "arxiv_id": "http://arxiv.org/abs/1908.07927v2",
    "download_url": "https://arxiv.org/abs/1908.07927v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Graph neural networks for materials science and chemistry",
    "abstract": "Machine learning plays an increasingly important role in many areas of chemistry and materials science, e.g. to predict materials properties, to accelerate simulations, to design new materials, and to predict synthesis routes of new materials. Graph neural networks (GNNs) are one of the fastest growing classes of machine learning models. They are of particular relevance for chemistry and materials science, as they directly work on a graph or structural representation of molecules and materials and therefore have full access to all relevant information required to characterize materials. In this review article, we provide an overview of the basic principles of GNNs, widely used datasets, and state-of-the-art architectures, followed by a discussion of a wide range of recent applications of GNNs in chemistry and materials science, and concluding with a road-map for the further development and application of GNNs.",
    "authors": [
      "Patrick Reiser",
      "Marlen Neubert",
      "André Eberhard",
      "Luca Torresi",
      "Chen Zhou",
      "Chen Shao",
      "Houssam Metni",
      "Clint van Hoesel",
      "Henrik Schopmans",
      "Timo Sommer",
      "Pascal Friederich"
    ],
    "publication_date": "2022-08-05T13:38:34Z",
    "arxiv_id": "http://arxiv.org/abs/2208.09481v1",
    "download_url": "https://arxiv.org/abs/2208.09481v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Role of Internal Photons on the Chemistry of the Circumstellar Envelopes of AGB Stars",
    "abstract": "Recent high spatial resolution observations of gas and dust in the circumstellar envelopes (CSEs) of AGB stars indicate morphologies much more complex than the smooth density distributions generated by spherically symmetric, constant mass loss rates. In particular, the observation of spiral arcs and disks indicate the likely presence of a binary companion which in some cases give rise to the UV photons detected by GALEX. In this Article, we extend our recent model of the chemistry in a clumpy, porous CSE around an AGB star to include the influence of stellar blackbody photons on the CSE chemistry. Our results indicate that internal photons, in a clumpy, porous CSE, can alter chemistry within a few stellar radii and, for some molecules, alter abundances out to several hundred stellar radii. They further suggest that harder radiation from companion stars or accretion disks will have a substantial impact on chemistry in the dust formation zones and inner CSEs of AGB stars.",
    "authors": [
      "M Van de Sande",
      "T J Millar"
    ],
    "publication_date": "2019-02-01T15:51:48Z",
    "arxiv_id": "http://arxiv.org/abs/1902.00416v2",
    "download_url": "https://arxiv.org/abs/1902.00416v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Impact of an accurate modeling of primordial chemistry in high resolution studies",
    "abstract": "The formation of the first stars in the Universe is regulated by a sensitive interplay of chemistry and cooling with the dynamics of a self-gravitating system. As the outcome of the collapse and the final stellar masses depend sensitively on the thermal evolution, it is necessary to accurately model the thermal evolution in high resolution simulations. As previous investigations raised doubts regarding the convergence of the temperature at high resolution, we investigate the role of the numerical method employed to model the chemistry and the thermodynamics. Here we compare the standard implementation in the adaptive-mesh refinement code \\verb|ENZO|, employing a first order backward differentiation formula (BDF), with the 5th order accurate BDF solver \\verb|DLSODES|. While the standard implementation in \\verb|ENZO| shows a strong dependence on the employed resolution, the results obtained with \\verb|DLSODES| are considerably more robust, both with respect to the chemistry and thermodynamics, but also for dynamical quantities such as density, total energy or the accretion rate. We conclude that an accurate modeling of the chemistry and thermodynamics is central for primordial star formation.",
    "authors": [
      "S. Bovino",
      "T. Grassi",
      "M. A. Latif",
      "D. R. G. Schleicher"
    ],
    "publication_date": "2013-05-07T11:52:05Z",
    "arxiv_id": "http://arxiv.org/abs/1305.1480v2",
    "download_url": "https://arxiv.org/abs/1305.1480v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Screening the organic materials database for superconducting metal-organic frameworks",
    "abstract": "The increasing financial and environmental cost of many inorganic materials has motivated study into organic and \"green\" alternatives. However, most organic compounds contain a large number of atoms in the primitive unit cell, posing a significant barrier to high-throughput screening for functional properties. In this work, we attempt to overcome this challenge and identify superconducting candidates among the metal-organic-frameworks in the organic materials database using a recently proposed proxy for the electron-phonon coupling. We then isolate the most promising candidate for in-depth analysis, C$_{9}$H$_{8}$Mn$_{2}$O$_{11}$, providing evidence for superconductivity below $100$mK.",
    "authors": [
      "Alexander C. Tyner",
      "Alexander V. Balatsky"
    ],
    "publication_date": "2024-05-13T10:39:29Z",
    "arxiv_id": "http://arxiv.org/abs/2405.07632v1",
    "download_url": "https://arxiv.org/abs/2405.07632v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The chemistry of extragalactic carbon stars",
    "abstract": "Prompted by the ongoing interest in Spitzer Infrared Spectrometer spectra of carbon stars in the Large Magellanic Cloud, we have investigated the circumstellar chemistry of carbon stars in low-metallicity environments. Consistent with observations, our models show that acetylene is particularly abundant in the inner regions of low metallicity carbon-rich AGB stars -- more abundant than carbon monoxide. As a consequence, larger hydrocarbons have higher abundances at the metallicities of the Magellanic Clouds than in stars with solar metallicity. We also find the oxygen and nitrogen chemistry is suppressed at lower metallicity, as expected. Finally, we calculate molecular line emission from carbon stars in the Large and Small Magellanic Cloud and find that several molecules should be readily detectable with the Atacama Large Millimeter Array at Full Science operations.",
    "authors": [
      "Paul M. Woods",
      "Catherine Walsh",
      "Martin A. Cordiner",
      "Francisca Kemper"
    ],
    "publication_date": "2012-07-23T20:04:39Z",
    "arxiv_id": "http://arxiv.org/abs/1207.5519v2",
    "download_url": "https://arxiv.org/abs/1207.5519v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "KROME - a package to embed chemistry in astrophysical simulations",
    "abstract": "Chemistry plays a key role in many astrophysical situations regulating the cooling and the thermal properties of the gas, which are relevant during gravitational collapse, the evolution of disks and the fragmentation process.\n  In order to simplify the usage of chemical networks in large numerical simulations, we present the chemistry package KROME, consisting of a Python pre-processor which generates a subroutine for the solution of chemical networks which can be embedded in any numerical code. For the solution of the rate equations, we make use of the high-order solver DLSODES, which was shown to be both accurate and efficient for sparse networks, which are typical in astrophysical applications. KROME also provides a large set of physical processes connected to chemistry, including photochemistry, cooling, heating, dust treatment, and reverse kinetics.\n  The package presented here already contains a network for primordial chemistry, a small metal network appropriate for the modelling of low metallicities environments, a detailed network for the modelling of molecular clouds, a network for planetary atmospheres, as well as a framework for the modelling of the dust grain population. In this paper, we present an extended test suite ranging from one-zone and 1D-models to first applications including cosmological simulations with ENZO and RAMSES and 3D collapse simulations with the FLASH code. The package presented here is publicly available at http://kromepackage.org/ and https://bitbucket.org/krome/krome_stable",
    "authors": [
      "T. Grassi",
      "S. Bovino",
      "D. R. G. Schleicher",
      "J. Prieto",
      "D. Seifried",
      "E. Simoncini",
      "F. A. Gianturco"
    ],
    "publication_date": "2013-11-05T14:37:35Z",
    "arxiv_id": "http://arxiv.org/abs/1311.1070v2",
    "download_url": "https://arxiv.org/abs/1311.1070v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "From Words to Molecules: A Survey of Large Language Models in Chemistry",
    "abstract": "In recent years, Large Language Models (LLMs) have achieved significant success in natural language processing (NLP) and various interdisciplinary areas. However, applying LLMs to chemistry is a complex task that requires specialized domain knowledge. This paper provides a thorough exploration of the nuanced methodologies employed in integrating LLMs into the field of chemistry, delving into the complexities and innovations at this interdisciplinary juncture. Specifically, our analysis begins with examining how molecular information is fed into LLMs through various representation and tokenization methods. We then categorize chemical LLMs into three distinct groups based on the domain and modality of their input data, and discuss approaches for integrating these inputs for LLMs. Furthermore, this paper delves into the pretraining objectives with adaptations to chemical LLMs. After that, we explore the diverse applications of LLMs in chemistry, including novel paradigms for their application in chemistry tasks. Finally, we identify promising research directions, including further integration with chemical knowledge, advancements in continual learning, and improvements in model interpretability, paving the way for groundbreaking developments in the field.",
    "authors": [
      "Chang Liao",
      "Yemin Yu",
      "Yu Mei",
      "Ying Wei"
    ],
    "publication_date": "2024-02-02T14:30:48Z",
    "arxiv_id": "http://arxiv.org/abs/2402.01439v1",
    "download_url": "https://arxiv.org/abs/2402.01439v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Developing ChemDFM as a large language foundation model for chemistry",
    "abstract": "Artificial intelligence (AI) has played an increasingly important role in chemical research. However, most models currently used in chemistry are specialist models that require training and tuning for specific tasks. A more generic and efficient solution would be an AI model that could address many tasks and support free-form dialogue in the broad field of chemistry. In its utmost form, such a generalist AI chemist could be referred to as Chemical General Intelligence. Large language models (LLMs) have recently logged tremendous success in the general domain of natural language processing, showing emerging task generalization and free-form dialogue capabilities. However, domain knowledge of chemistry is largely missing when training general-domain LLMs. The lack of such knowledge greatly hinders the performance of generalist LLMs in the field of chemistry. To this end, we develop ChemDFM, a pioneering LLM for chemistry trained on 34B tokens from chemical literature and textbooks, and fine-tuned using 2.7M instructions. As a result, it can understand and reason with chemical knowledge in free-form dialogue. Quantitative evaluations show that ChemDFM significantly surpasses most representative open-source LLMs. It outperforms GPT-4 on a great portion of chemical tasks, despite the substantial size difference. We have open-sourced the inference codes, evaluation datasets, and model weights of ChemDFM on Huggingface (https://huggingface.co/OpenDFM/ChemDFM-v1.0-13B).",
    "authors": [
      "Zihan Zhao",
      "Da Ma",
      "Lu Chen",
      "Liangtai Sun",
      "Zihao Li",
      "Yi Xia",
      "Bo Chen",
      "Hongshen Xu",
      "Zichen Zhu",
      "Su Zhu",
      "Shuai Fan",
      "Guodong Shen",
      "Kai Yu",
      "Xin Chen"
    ],
    "publication_date": "2024-01-26T12:45:55Z",
    "arxiv_id": "http://arxiv.org/abs/2401.14818v6",
    "download_url": "https://arxiv.org/abs/2401.14818v6",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "What can Large Language Models do in chemistry? A comprehensive benchmark on eight tasks",
    "abstract": "Large Language Models (LLMs) with strong abilities in natural language processing tasks have emerged and have been applied in various kinds of areas such as science, finance and software engineering. However, the capability of LLMs to advance the field of chemistry remains unclear. In this paper, rather than pursuing state-of-the-art performance, we aim to evaluate capabilities of LLMs in a wide range of tasks across the chemistry domain. We identify three key chemistry-related capabilities including understanding, reasoning and explaining to explore in LLMs and establish a benchmark containing eight chemistry tasks. Our analysis draws on widely recognized datasets facilitating a broad exploration of the capacities of LLMs within the context of practical chemistry. Five LLMs (GPT-4, GPT-3.5, Davinci-003, Llama and Galactica) are evaluated for each chemistry task in zero-shot and few-shot in-context learning settings with carefully selected demonstration examples and specially crafted prompts. Our investigation found that GPT-4 outperformed other models and LLMs exhibit different competitive levels in eight chemistry tasks. In addition to the key findings from the comprehensive benchmark analysis, our work provides insights into the limitation of current LLMs and the impact of in-context learning settings on LLMs' performance across various chemistry tasks. The code and datasets used in this study are available at https://github.com/ChemFoundationModels/ChemLLMBench.",
    "authors": [
      "Taicheng Guo",
      "Kehan Guo",
      "Bozhao Nan",
      "Zhenwen Liang",
      "Zhichun Guo",
      "Nitesh V. Chawla",
      "Olaf Wiest",
      "Xiangliang Zhang"
    ],
    "publication_date": "2023-05-27T14:17:33Z",
    "arxiv_id": "http://arxiv.org/abs/2305.18365v3",
    "download_url": "https://arxiv.org/abs/2305.18365v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Development of a robotic system for automatic organic chemistry synthesis",
    "abstract": "Automated chemical synthesis carries great promises of safety, efficiency and reproducibility for both research and industry laboratories. Current approaches are based on specifically-designed automation systems, which present two major drawbacks: (i) existing apparatus must be modified to be integrated into the automation systems; (ii) such systems are not flexible and would require substantial re-design to handle new reactions or procedures. In this paper, we propose a system based on a robot arm which, by mimicking the motions of human chemists, is able to perform complex chemical reactions without any modifications to the existing setup used by humans. The system is capable of precise liquid handling, mixing, filtering, and is flexible: new skills and procedures could be added with minimum effort. We show that the robot is able to perform a Michael reaction, reaching a yield of 34%, which is comparable to that obtained by a junior chemist (undergraduate student in Chemistry).",
    "authors": [
      "Joyce Xin-Yan Lim",
      "Dasheng Leow",
      "Quang-Cuong Pham",
      "Choon-Hong Tan"
    ],
    "publication_date": "2019-06-19T06:51:34Z",
    "arxiv_id": "http://arxiv.org/abs/1906.07939v1",
    "download_url": "https://arxiv.org/abs/1906.07939v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling Atmospheric Alteration on Titan: Hydrodynamics and Shock-Induced Chemistry of Meteoroid Entry",
    "abstract": "Meteoroid entry into planetary atmospheres generates bow shocks, resulting in high-temperature gas conditions that drive chemical reactions. In this paper, we perform three-dimensional hydrodynamic simulations of meteoroid entry using the Athena++ code, coupled with chemistry calculations via Cantera to model the non-equilibrium chemistry triggered by atmospheric entry. Our aerodynamical simulations reveal the formation of complex shock structures, including secondary shock waves, which influence the thermodynamic evolution of the gas medium. By tracking thermodynamic parameters along streamlines, we analyze the effects of shock heating and subsequent expansion cooling on chemical reaction pathways. Our results demonstrate that chemical quenching occurs when the cooling timescale surpasses reaction rates, leading to the formation of distinct chemical products that deviate from equilibrium predictions. We show that the efficiency of molecular synthesis depends on the object\\textquotesingle s size and velocity, influencing the composition of the post-entry gas mixture. Applying our model to Titan, we demonstrate that organic matter can be synthesized in the present environment of Titan. Also, we find that nitrogen, the dominant atmospheric component, remains stable, while water vapor is efficiently removed, a result inconsistent with equilibrium chemistry assumptions. Moreover, we compare our simulation results with laser experiments and find good agreement in chemical yields. Finally, we also evaluate the impact on Titan\\textquotesingle s atmosphere as a whole, showing that meteoroid entry events could have played a significant role in supplying molecules such as HCN during early Titan\\textquotesingle s history.",
    "authors": [
      "Ryushi Miyayama",
      "Laura Kay Schaefer",
      "Hiroshi Kobayashi",
      "Andrea Zorzi"
    ],
    "publication_date": "2025-07-14T15:10:31Z",
    "arxiv_id": "http://arxiv.org/abs/2507.10369v1",
    "download_url": "https://arxiv.org/abs/2507.10369v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Polycylcic Aromatic Hydrocarbons (PAH's) in dense cloud chemistry",
    "abstract": "Virtually all detailed gas-phase models of the chemistry of dense interstellar clouds exclude polycyclic aromatic hydrocarbons (PAH's). This omission is unfortunate because from the few studies that have been done on the subject, it is known that the inclusion of PAH's can affect the gas-phase chemistry strongly. We have added PAH's to our network to determine the role they play in the chemistry of cold dense cores. In the models presented here, we include radiative attachment to form PAH-, mutual neutralization between PAH anions and small positively-charged ions, and photodetachment. We also test the sensitivity of our results to changes in the size and abundance of the PAH's. Our results confirm that the inclusion of PAH's changes many of the calculated abundances of smaller species considerably. In TMC-1, the general agreement with observations is significantly improved contrary to L134N. This may indicate a difference in PAH properties between the two regions. With the inclusion of PAH's in dense cloud chemistry, high-metal elemental abundances give a satisfactory agreement with observations. As a result, we do not need to decrease the observed elemental abundances of all metals and we do not need to vary the elemental C/O ratio in order to produce large abundances of carbon species in TMC-1 (CP).",
    "authors": [
      "Valentine Wakelam",
      "Eric Herbst"
    ],
    "publication_date": "2008-02-26T07:17:19Z",
    "arxiv_id": "http://arxiv.org/abs/0802.3757v1",
    "download_url": "https://arxiv.org/abs/0802.3757v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry in a forming protoplanetary disk: main accretion phase",
    "abstract": "We investigate the chemistry in a radiation-hydrodynamics model of star-forming core which evolves from a cold ($\\sim 10$ K) prestellar core to the main accretion phase in $\\sim 10^5$ yr. A rotationally-supported gravitationally unstable disk is formed around a protostar. We extract the temporal variation of physical parameters in $\\sim 1.5 \\times 10^3$ SPH particles which end up in the disk, and perform post-processing calculations of the gas-grain chemistry adopting a three-phase model. Inside the disk, the SPH particles migrate both inward and outward. Since a significant fraction of volatiles such as CO can be trapped in the water-dominant ice in the three-phase model, the ice mantle composition depends not only on the current position in the disk but also on whether the dust grain has ever experienced higher temperatures than the water sublimation temperature. Stable molecules such as H$_2$O, CH$_4$, NH$_3$ and CH$_3$OH are already abundant at the onset of gravitational collapse and simply sublimated as the fluid parcels migrate inside the water snow line. On the other hand, various molecules such as carbon chains and complex organic molecules (COMs) are formed in the disk. COMs abundance sensitively depends on the outcomes of photodissociation and diffusion rates of photofragments in bulk ice mantle. As for S-bearing species, H$_2$S ice is abundant in the collapse phase. In the warm regions in the disk, H$_2$S is sublimated to be destroyed, while SO, H$_2$CS, OCS and SO$_2$ become abundant.",
    "authors": [
      "Haruaki Yoneda",
      "Yusuke Tsukamoto",
      "Kenji Furuya",
      "Yuri Aikawa"
    ],
    "publication_date": "2016-11-11T05:14:52Z",
    "arxiv_id": "http://arxiv.org/abs/1611.03587v1",
    "download_url": "https://arxiv.org/abs/1611.03587v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry and cooling in metal-free and metal-poor gas",
    "abstract": "I summarize four of the most important areas of uncertainty in the study of the chemistry and cooling of gas with zero or very low metallicity. These are: i) the importance and effects of HD cooling in primordial gas; ii) the importance of metal-line and dust cooling in low metallicity gas; iii) the impact of the large uncertainties that exist in the rate coefficients of several key reactions involved in the formation of H2; and iv) the effectiveness of grain surface chemistry at high redshifts.",
    "authors": [
      "S. C. O. Glover"
    ],
    "publication_date": "2007-08-22T20:19:20Z",
    "arxiv_id": "http://arxiv.org/abs/0708.3086v2",
    "download_url": "https://arxiv.org/abs/0708.3086v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Chemistry, Magnetism and Lasers",
    "abstract": "Using highly correlational quantum chemistry we compute from first principles the contributions of the electric dipoles and quadupoles, and magnetic dipoles to the nonlinear optics of NiO. The material is modeled as a doubly embedded cluster and all magnetic intragap d-character states are calculated, thus explaining the experimental results.",
    "authors": [
      "Georgios Lefkidis"
    ],
    "publication_date": "2007-03-23T13:32:57Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0703601v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0703601v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-resolution gas phase spectroscopy of molecules desorbed from an ice surface: a proof-of-principle study",
    "abstract": "High-resolution gas phase spectroscopy techniques in the microwave, millimeter-wave and terahertz spectral ranges can be used to study complex organic molecules desorbed from interstellar ice analogues surface with a high sensitivity. High-resolution gas phase spectroscopy gives unambiguous information about the molecular composition, the molecular structure, and transition frequencies needed for their detection by radio telescopes in various interstellar and circumstellar environments. The results will be useful not only for interpreting astronomical spectra and understanding astrophysical processes, but also for more general studies of gas-surface chemistry. This paper presents a new experimental approach based on a combination of a chirped-pulse Fourier transform microwave spectrometer detection and a low temperature surface desorption experiment. The experimental set-up is benchmarked on the desorption of ammonia ice detected by high-resolution gas phase microwave spectroscopy.",
    "authors": [
      "Patrice Theulé",
      "Christian Endres",
      "Marius Hermanns",
      "Jean-Baptiste Bossa",
      "Alexey Potapov"
    ],
    "publication_date": "2019-12-20T14:20:48Z",
    "arxiv_id": "http://arxiv.org/abs/1912.09839v1",
    "download_url": "https://arxiv.org/abs/1912.09839v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]