[
  {
    "title": "Organic chemistry in the H2-bearing, CO-rich interstellar ice layer at\n  temperatures relevant to dense cloud interiors",
    "abstract": "Ice chemistry in the dense, cold interstellar medium (ISM) is probably\nresponsible for the formation of interstellar complex organic molecules (COMs).\nRecent laboratory experiments performed at T=4 K have shown that irradiation of\nCO:N2 ice samples analog to the CO-rich interstellar ice layer can contribute\nto the formation of COMs when H2 molecules are present. We have tested this\norganic chemistry under a broader range of conditions relevant to the interior\nof dense clouds by irradiating CO:15N2:H2 ice samples with 2 keV electrons in\nthe 4-15 K temperature range. The H2 ice abundance depended on both, the ice\nformation temperature and the thermal evolution of the samples. Formation of\nH-bearing organics such as formaldehyde (H2CO), ketene (C2H2O), and isocyanic\nacid (H15NCO) was observed upon irradiation of ice samples formed at\ntemperatures up to 10 K, and also in ices formed at 6 K and subsequently warmed\nup and irradiated at temperatures up to 15 K. These results suggest that a\nfraction of the H2 molecules in dense cloud interiors might be entrapped in the\nCO-rich layer of interstellar ice mantles, and that energetic processing of\nthis layer could entail an additional contribution to the formation of COMs in\nthe coldest regions of the ISM.",
    "authors": [
      "Rafael Martín-Doménech",
      "Alexander DelFranco",
      "Karin I. Öberg",
      "Mahesh Rajappan"
    ],
    "publication_date": "2024-01-08T17:02:39Z",
    "arxiv_id": "http://arxiv.org/abs/2401.04024v1",
    "download_url": "http://arxiv.org/abs/2401.04024v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complex molecules toward low-mass protostars: the Serpens core",
    "abstract": "Gas-phase complex organic molecules are commonly detected toward high-mass\nprotostellar hot cores. Detections toward low-mass protostars and outflows are\ncomparatively rare, and a larger sample is key to investigate how the chemistry\nresponds to its environment. Guided by the prediction that complex organic\nmolecules form in CH3OH-rich ices and thermally or non-thermally evaporate with\nCH3OH, we have identified three sight-lines in the Serpens core - SMM1, SMM4\nand SMM4-W - which are likely to be rich in complex organics. Using the IRAM\n30m telescope, narrow lines (FWHM of 1-2 km s-1) of CH3CHO and CH3OCH3 are\ndetected toward all sources, HCOOCH3 toward SMM1 and SMM4-W, and C2H5OH not at\nall. Beam-averaged abundances of individual complex organics range between 0.6\nand 10% with respect to CH3OH when the CH3OH rotational temperature is applied.\nThe summed complex organic abundances also vary by an order of magnitude, with\nthe richest chemistry toward the most luminous protostar SMM1. The range of\nabundances compare well with other beam-averaged observations of low-mass\nsources. Complex organic abundances are of the same order of magnitude toward\nlow-mass protostars and high-mass hot cores, but HCOOCH3 is relatively more\nimportant toward low-mass protostars. This is consistent with a sequential ice\nphotochemistry, dominated by CHO-containing products at low temperatures and\nearly times.",
    "authors": [
      "Karin I. Oberg",
      "Nienke van der Marel",
      "Lars E. Kristensen",
      "Ewine F. van Dishoeck"
    ],
    "publication_date": "2011-07-28T20:23:55Z",
    "arxiv_id": "http://arxiv.org/abs/1107.5824v1",
    "download_url": "http://arxiv.org/abs/1107.5824v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strategies for the Simulation of Sea Ice Organic Chemistry: Arctic Tests\n  and Development",
    "abstract": "A mechanism connecting ice algal ecodynamics with the buildup of organic\nmacromolecules in brine channels is tested offline in a reduced model of pack\ngeochemistry. Driver physical quantities are extracted from the global sea ice\ndynamics code CICE, including snow height, column thickness and internal\ntemperature. The variables are averaged at the regional scale over ten Arctic\nbiogeographic zones and treated as input matrices at four vertical habitat\nlevels. Nutrient-light-salt limited ice algal growth is computed along with the\nassociated grazing plus mortality. Vertical transport is diffusive but responds\nto pore structure. Simulated bottom layer chlorophyll maxima are reasonable,\nthough delayed by about a month relative to observations. This highlights major\nuncertainties deriving from snow thickness variability. Upper level biota are\ngenerated intermittently through flooding. Macromolecular injections are\nrepresented by the compound classes humics, proteins, polysaccharides and\nlipids. The fresh biopolymers behave in a successional manner and are removed\nby bacteria. In baseline runs, organics are introduced solely through cell\ndisruption, and internal carbon is biased low. Continuous exudation is\ntherefore appended, and agreement with dissolved organic or individual\nbiopolymer measurements is achieved when strong release is coupled to light\navailability. Detrital carbon then reaches hundreds of micromolar, sufficient\nto support physical changes to the ice matrix. Through this optimized model\nversion we address the question, are high molecular weight organics added to\nthe brine network over and above background spillage? The mechanism is\nconfigured for ready extension to the Antarctic, so that global ice organic\nchemistry issues can be targeted.",
    "authors": [
      "S. Elliott",
      "N. Jeffery",
      "E. Hunke",
      "C. Deal",
      "M. Jin",
      "S. Wang",
      "E. Elliott Smith",
      "S. Oestreicher"
    ],
    "publication_date": "2016-09-25T21:00:59Z",
    "arxiv_id": "http://arxiv.org/abs/1609.07799v1",
    "download_url": "http://arxiv.org/abs/1609.07799v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Solvation of Nonionic Poly(Ethylene Oxide) Surfactant Brij 35 in Organic\n  and Aqueous-Organic Solvents",
    "abstract": "Hypothesis: By combining the experimental small- and wide-angle x-ray\nscattering (SWAXS) method with molecular dynamics simulations and the\ntheoretical 'complemented-system approach' it is possible to obtain detailed\ninformation about the intra- and inter-molecular structure and dynamics of the\nsolvation and hydration of the surfactant in organic and mixed solvents, e.g.,\nof the nonionic surfactant Brij 35 (C12E23) in alcohols and aqueous\nalcohol-rich ternary systems. This first application of the complemented-system\napproach to the surfactant system will promote the use of this powerful\nmethodology that is based on experimental and calculated SWAXS data in studies\nof colloidal systems. By applying high-performance computing systems, such an\napproach is readily available for studies in the colloidal domain.\n  Experiments: SWAXS experiments and MD simulations were performed for binary\nBrij 35/alcohol and ternary Brij 35/water/alcohol systems with ethanol,\nn-butanol and n-hexanol as the organic solvent component at 25 {\\deg}C.\n  Findings: We confirmed the presence of solvated Brij 35 monomers in the\nstudied organic media, revealed their preferential hydration and discussed\ntheir structural and dynamic features at the intra- and inter-molecular levels.\nAnisotropic effective surfactant molecular conformations were found. The\ninfluence of the hydrophobicity of the organic solvent on the hydration\nphenomena of surfactant molecules was explained.",
    "authors": [
      "Jure Cerar",
      "Andrej Jamnik",
      "István Szilágyi",
      "Matija Tomšič"
    ],
    "publication_date": "2021-02-22T16:10:31Z",
    "arxiv_id": "http://arxiv.org/abs/2102.11141v3",
    "download_url": "http://arxiv.org/abs/2102.11141v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Entropy and spontaneity in an introductory physics course for life\n  science students",
    "abstract": "In an Introductory Physics for Life Science (IPLS) course that leverages\nauthentic biological examples, student ideas about entropy as \"disorder\" or\n\"chaos\" come into contact with their ideas about the spontaneous formation of\norganized biological structure. It is possible to reconcile the \"natural\ntendency to disorder\" with the organized clustering of macromolecules, but\ndoing so in a way that will be meaningful to students requires that we take\nseriously the ideas about entropy and spontaneity that students bring to IPLS\ncourses from their prior experiences in biology and chemistry. We draw on case\nstudy interviews to argue that an approach that emphasizes the interplay of\nenergy and entropy in determining spontaneity (one that involves a central role\nfor free energy) is one that draws on students' resources from biology and\nchemistry in particularly effective ways. We see the positioning of entropic\narguments alongside energetic arguments in the determination of spontaneity as\nan important step toward making our life science students' biology, chemistry,\nand physics experiences more coherent.",
    "authors": [
      "Benjamin D. Geller",
      "Benjamin W. Dreyfus",
      "Julia Gouvea",
      "Vashti Sawtelle",
      "Chandra Turpen",
      "Edward F. Redish"
    ],
    "publication_date": "2013-08-25T18:36:04Z",
    "arxiv_id": "http://arxiv.org/abs/1308.5433v1",
    "download_url": "http://arxiv.org/abs/1308.5433v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Genome-inspired molecular identification in organic matter via Raman\n  spectroscopy",
    "abstract": "Rapid, non-destructive characterization of molecular level chemistry for\norganic matter (OM) is experimentally challenging. Raman spectroscopy is one of\nthe most widely used techniques for non-destructive chemical characterization,\nalthough it currently does not provide detailed identification of molecular\ncomponents in OM, due to the combination of diffraction-limited spatial\nresolution and poor applicability of peak-fitting algorithms. Here, we develop\na genome-inspired collective molecular structure fingerprinting approach, which\nutilizes ab initio calculations and data mining techniques to extract molecular\nlevel chemistry from the Raman spectra of OM. We illustrate the power of such\nan approach by identifying representative molecular fingerprints in OM, for\nwhich the molecular chemistry is to date inaccessible using non-destructive\ncharacterization techniques. Chemical properties such as aromatic cluster size\ndistribution and H/C ratio can now be quantified directly using the identified\nmolecular fingerprints. Our approach will enable non-destructive identification\nof chemical signatures with their correlation to the preservation of\nbiosignatures in OM, accurate detection and quantification of environmental\ncontamination, as well as objective assessment of OM with respect to their\nchemical contents.",
    "authors": [
      "Yun Liu",
      "Nicola Ferralis",
      "L. Taras Bryndzia",
      "Jeffrey C. Grossman"
    ],
    "publication_date": "2016-02-05T16:26:31Z",
    "arxiv_id": "http://arxiv.org/abs/1602.02083v1",
    "download_url": "http://arxiv.org/abs/1602.02083v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Silabenzene Incorporated Covalent Organic Frameworks",
    "abstract": "Covalent organic frameworks (COFs) are a promising material for various\napplications such as gas storage/separation, catalysis, and energy storage,\nbesides offering a confined space for chemical reaction. The introduction of\nunconventional elements into their frame structures and expanding their\nstructural scope remains a major challenge in COF chemistry. Here, we present\nsyntheses of two-dimensional and liner COFs substructures linked with\n1,4-disilabenzene (C4Si2) by co-depositing silicon atoms and bromo-substituted\npoly aromatic hydrocarbons on Au(111). A combination of high-resolution\nscanning tunneling microscopy, photoelectron spectroscopy and density\nfunctional theory calculations reveal the detailed structures of the\nSi-incorporated COF, as well as its chemical properties. We find that each Si\nin a hexagonal C4Si2 ring is terminated by one Br atom. Furthermore, the C4Si2\nring can be transformed to the C4Si pentagonal ring by annealing. Silabenzene\nincorporated COFs may open up new possibilities in organosilicon chemistry and\na wide range of practical applications.",
    "authors": [
      "Kewei Sun",
      "Orlando J. Silveira",
      "Yujing Ma",
      "Yuri Hasegawa",
      "Michio Matsumoto",
      "Satoshi Kera",
      "Ondřej Krejčí",
      "Adam S. Foster",
      "Shigeki Kawai"
    ],
    "publication_date": "2021-11-19T09:47:45Z",
    "arxiv_id": "http://arxiv.org/abs/2111.10124v1",
    "download_url": "http://arxiv.org/abs/2111.10124v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Use of semantic technologies for the development of a dynamic\n  trajectories generator in a Semantic Chemistry eLearning platform",
    "abstract": "ChemgaPedia is a multimedia, webbased eLearning service platform that\ncurrently contains about 18.000 pages organized in 1.700 chapters covering the\ncomplete bachelor studies in chemistry and related topics of chemistry,\npharmacy, and life sciences. The eLearning encyclopedia contains some 25.000\nmedia objects and the eLearning platform provides services such as virtual and\nremote labs for experiments. With up to 350.000 users per month the platform is\nthe most frequently used scientific educational service in the German spoken\nInternet. In this demo we show the benefit of mapping the static eLearning\ncontents of ChemgaPedia to a Linked Data representation for Semantic Chemistry\nwhich allows for generating dynamic eLearning paths tailored to the semantic\nprofiles of the users.",
    "authors": [
      "Richard Huber",
      "Kirsten Hantelmann",
      "Alexandru Todor",
      "Sebastian Krebs",
      "Ralf Heese",
      "Adrian Paschke"
    ],
    "publication_date": "2010-12-07T23:55:47Z",
    "arxiv_id": "http://arxiv.org/abs/1012.1646v1",
    "download_url": "http://arxiv.org/abs/1012.1646v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Conformer-specific Chemistry Imaged in Real Space and Time",
    "abstract": "Conformational isomers or conformers of molecules play a decisive role in\nchemistry and biology. However, experimental methods to investigate chemical\nreaction dynamics are typically not conformer-sensitive. Here, we report on a\ngas-phase megaelectronvolt ultrafast electron diffraction investigation of\n{\\alpha}-phellandrene undergoing an electrocyclic ring-opening reaction. We\ndirectly image the evolution of a specific set of {\\alpha}-phellandrene\nconformers into the product isomer predicted by the Woodward-Hoffmann rules in\nreal space and time. Our experimental results are in quantitative agreement\nwith nonadiabatic quantum molecular dynamics simulations, which provide\nunprecedented detail of how conformation influences time scale and quantum\nefficiency of photoinduced ring-opening reactions. Due to the prevalence of\nlarge numbers of conformers in organic chemistry, our findings impact our\ngeneral understanding of reaction dynamics in chemistry and biology.",
    "authors": [
      "E. G. Champenois",
      "D. M. Sanchez",
      "J. Yang",
      "J. P. F. Nunes",
      "A. Attar",
      "M. Centurion",
      "R. Forbes",
      "M. Gühr",
      "K. Hegazy",
      "F. Ji",
      "S. K. Saha",
      "Y. Liu",
      "M. -F. Lin",
      "D. Luo",
      "B. Moore",
      "X. Shen",
      "M. R. Ware",
      "X. J. Wang",
      "T. J. Martínez",
      "T. J. A. Wolf"
    ],
    "publication_date": "2021-07-08T04:07:16Z",
    "arxiv_id": "http://arxiv.org/abs/2107.03592v1",
    "download_url": "http://arxiv.org/abs/2107.03592v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry in the Galactic Center",
    "abstract": "Gas and dust in the Galactic Center are subjected to energetic processing by\nintense UV radiation fields, widespread shocks, enhanced rates of cosmic-rays\nand X-rays, and strong magnetic fields. The Giant Molecular Clouds in the\nGalactic Center present a rich chemistry in a wide variety of chemical\ncompounds, some of which are prebiotic. We have conducted unbiased,\nultrasensitive and broadband spectral surveys toward the G+0.693-0.027\nmolecular cloud located in the Galactic Center, which have yielded the\ndiscovery of new complex organic molecules proposed as precursors of the\n\"building blocks\" of life. I will review our current understanding of the\nchemistry in Galactic Center molecular clouds, and summarize the recent\ndetections toward G+0.693-0.027 of key precursors of prebiotic chemistry. All\nthis suggests that the ISM is an important source of prebiotic material that\ncould have contributed to the process of the origin of life on Earth and\nelsewhere in the Universe.",
    "authors": [
      "Izaskun Jimenez-Serra"
    ],
    "publication_date": "2025-01-03T12:31:24Z",
    "arxiv_id": "http://arxiv.org/abs/2501.01782v1",
    "download_url": "http://arxiv.org/abs/2501.01782v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Increase of Organization in Complex Systems",
    "abstract": "Measures of complexity and entropy have not converged to a single\nquantitative description of levels of organization of complex systems. The need\nfor such a measure is increasingly necessary in all disciplines studying\ncomplex systems. To address this problem, starting from the most fundamental\nprinciple in Physics, here a new measure for quantity of organization and rate\nof self-organization in complex systems based on the principle of least\n(stationary) action is applied to a model system - the central processing unit\n(CPU) of computers. The quantity of organization for several generations of\nCPUs shows a double exponential rate of change of organization with time. The\nexact functional dependence has a fine, S-shaped structure, revealing some of\nthe mechanisms of self-organization. The principle of least action helps to\nexplain the mechanism of increase of organization through quantity accumulation\nand constraint and curvature minimization with an attractor, the least average\nsum of actions of all elements and for all motions. This approach can help\ndescribe, quantify, measure, manage, design and predict future behavior of\ncomplex systems to achieve the highest rates of self organization to improve\ntheir quality. It can be applied to other complex systems from Physics,\nChemistry, Biology, Ecology, Economics, Cities, network theory and others where\ncomplex systems are present.",
    "authors": [
      "Georgi Yordanov Georgiev",
      "Michael Daly",
      "Erin Gombos",
      "Amrit Vinod",
      "Gajinder Hoonjan"
    ],
    "publication_date": "2013-01-26T21:18:16Z",
    "arxiv_id": "http://arxiv.org/abs/1301.6288v1",
    "download_url": "http://arxiv.org/abs/1301.6288v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemical Processes in Cometary Comae",
    "abstract": "Recent developments in the chemical modelling of cometary comae are\ndescribed. We discuss the cyanide chemistry and present new HCN observations of\nthe recent comet C/2002 C1 (Ikeya-Zhang). The connection between interstellar\nand cometary organic molecules is discussed from the perspective of recent\ntheories of interstellar gas-grain chemistry.",
    "authors": [
      "S. B. Charnley",
      "S. D. Rodgers",
      "H. M. Butner",
      "P. Ehrenfreund"
    ],
    "publication_date": "2002-04-23T09:40:21Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0204381v1",
    "download_url": "http://arxiv.org/abs/astro-ph/0204381v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry in Protoplanetary Disks",
    "abstract": "This comprehensive review summarizes our current understanding of the\nevolution of gas, solids and molecular ices in protoplanetary disks. Key\nfindings related to disk physics and chemistry, both observationally and\ntheoretically, are highlighted. We discuss which molecular probes are used to\nderive gas temperature, density, ionization state, kinematics, deuterium\nfractionation, and study organic matter in protoplanetary disks.",
    "authors": [
      "Thomas Henning",
      "Dmitry Semenov"
    ],
    "publication_date": "2013-10-11T14:57:28Z",
    "arxiv_id": "http://arxiv.org/abs/1310.3151v1",
    "download_url": "http://arxiv.org/abs/1310.3151v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fibonacci Numbers and the Golden Ratio in Biology, Physics,\n  Astrophysics, Chemistry and Technology: A Non-Exhaustive Review",
    "abstract": "Fibonacci numbers and the golden ratio can be found in nearly all domains of\nScience, appearing when self-organization processes are at play and/or\nexpressing minimum energy configurations. Several non-exhaustive examples are\ngiven in biology (natural and artificial phyllotaxis, genetic code and DNA),\nphysics (hydrogen bonds, chaos, superconductivity), astrophysics (pulsating\nstars, black holes), chemistry (quasicrystals, protein AB models), and\ntechnology (tribology, resistors, quantum computing, quantum phase transitions,\nphotonics).",
    "authors": [
      "Vladimir Pletser"
    ],
    "publication_date": "2017-12-29T03:10:47Z",
    "arxiv_id": "http://arxiv.org/abs/1801.01369v1",
    "download_url": "http://arxiv.org/abs/1801.01369v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Research status of the Mendeleev Periodic Table: a bibliometric analysis",
    "abstract": "In this paper, we present a bibliometric analysis of the Mendeleev Periodic\nTable. We have conducted a comprehensive analysis of the Scopus-based database\nusing the keyword \"Mendeleev Periodic Table\". Our findings suggest that the\nMendeleev Periodic Table is an influential topic in the field of Inorganic as\nwell as Organic Chemistry. Future researchers may focus on expanding our\nanalysis to include other bibliometric indicators to gain a more comprehensive\nunderstanding of the impact of the Mendeleev Periodic Table in chemistry-based\nscientific investigations and even in the field of astrochemistry.",
    "authors": [
      "Kamna Sharma",
      "Deepak Kumar Das",
      "Saibal Ray"
    ],
    "publication_date": "2024-02-18T07:42:58Z",
    "arxiv_id": "http://arxiv.org/abs/2402.11490v1",
    "download_url": "http://arxiv.org/abs/2402.11490v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "300th anniversary of the birth of Father Eliseo della Concezione: the\n  scientific contribution in the Royal Academy of Studies of Palermo",
    "abstract": "2025 marks the 300th birthday of Father Eliseo della Concezione, professor of\nExperimental Physics at the Royal Academy of Studies of Palermo. To celebrate\nthis anniversary, the Physics and Chemistry Library of the University Library\nSystem and the Department of Physics and Chemistry - Emilio Segre' have\norganized several cultural activities. In the article, after a brief\nbiographical description of Father Eliseo della Concezione, we will present the\nactivities carried out and discuss the historical and educational aspects of\nFather Eliseo's work carried out during his stay at the Royal Academy of\nPalermo at the end of 18th century.",
    "authors": [
      "Aurelio Agliolo Gallitto"
    ],
    "publication_date": "2025-05-14T06:55:27Z",
    "arxiv_id": "http://arxiv.org/abs/2505.09192v1",
    "download_url": "http://arxiv.org/abs/2505.09192v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hydrogen storage in MOF-5: A van der Waals density functional theory\n  study",
    "abstract": "Physisorption of hydrogen molecules in metal-organic frameworks (MOFs)\nprovides a promising way for hydrogen storage, in which the van der Waals (vdW)\ninteraction plays an important role but cannot described by the density\nfunctional theory (DFT). By using the vdW density functional (vdW-DF) method,\nwe investigate systematically the binding energies of hydrogen molecules in\nMOF-5 crystal. We first examine the accuracy of this methodology by comparing\nits results with those from the correlated quantum chemistry methods for\nseveral fragment models cut out from the crystal. Good comparable accuracy is\nfound. By performing calculations for the true crystal structure adsorbing one\nor multiple H$_2$ in the primitive cell, we show that these fragment models\nwhich have been focused previously cannot represent well the property of the\ncrystal which cannot, however, be dealt with by the quantum chemistry methods.\nIt is found that the binding energy with the organic linker is much smaller\nthan with the metal oxide corner, which limits the H$_2$ loading. We show that\nthis can be improved significantly (from 5.50 to 10.39 kJ/mol) by replacing the\nH atoms of the organic linker with F atoms which cause extra electrostatic\ninteraction.",
    "authors": [
      "Yue Huang",
      "San-Huang Ke"
    ],
    "publication_date": "2012-10-16T07:12:21Z",
    "arxiv_id": "http://arxiv.org/abs/1210.4271v1",
    "download_url": "http://arxiv.org/abs/1210.4271v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "\"Found in Translation\": Predicting Outcomes of Complex Organic Chemistry\n  Reactions using Neural Sequence-to-Sequence Models",
    "abstract": "There is an intuitive analogy of an organic chemist's understanding of a\ncompound and a language speaker's understanding of a word. Consequently, it is\npossible to introduce the basic concepts and analyze potential impacts of\nlinguistic analysis to the world of organic chemistry. In this work, we cast\nthe reaction prediction task as a translation problem by introducing a\ntemplate-free sequence-to-sequence model, trained end-to-end and fully\ndata-driven. We propose a novel way of tokenization, which is arbitrarily\nextensible with reaction information. With this approach, we demonstrate\nresults superior to the state-of-the-art solution by a significant margin on\nthe top-1 accuracy. Specifically, our approach achieves an accuracy of 80.1%\nwithout relying on auxiliary knowledge such as reaction templates. Also, 66.4%\naccuracy is reached on a larger and noisier dataset.",
    "authors": [
      "Philippe Schwaller",
      "Theophile Gaudin",
      "David Lanyi",
      "Costas Bekas",
      "Teodoro Laino"
    ],
    "publication_date": "2017-11-13T19:38:14Z",
    "arxiv_id": "http://arxiv.org/abs/1711.04810v2",
    "download_url": "http://arxiv.org/abs/1711.04810v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "All-optical switching in dye-doped DNA nanofibers",
    "abstract": "All-optical switches are introduced which are based on deoxyribonucleic acid\n(DNA) in the form of electrospun fibers, where DNA is semi-intercalated with a\npush-pull, luminescent nonlinear pyrazoline derivative. Optical birefringence\nis found in the organic nanofibers, with fully reversible switching controlled\nthrough continuous-wave laser irradiation. The photoinduced signal is\nremarkably large, with birefringence highlighted by optically-driven refractive\nindex anisotropy approaching 0.001. Sub-millisecond characteristic switching\ntimes are found. Integrating dye-intercalated DNA complex systems in organic\nnanofibers, as convenient and efficient approach to template molecular\norganization and controlling it by external stimuli, might open new routes for\nrealizing optical logic gates, reconfigurable photonic networks and sensors\nthrough physically-transient biopolymer components.",
    "authors": [
      "Adam Szukalski",
      "Maria Moffa",
      "Andrea Camposeo",
      "Dario Pisignano",
      "Jaroslaw Mysliwiec"
    ],
    "publication_date": "2018-12-17T15:49:19Z",
    "arxiv_id": "http://arxiv.org/abs/1812.06853v1",
    "download_url": "http://arxiv.org/abs/1812.06853v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interplay between Defects, Disorder and Flexibility in Metal-Organic\n  Frameworks",
    "abstract": "Metal-organic frameworks are a novel family of chemically diverse materials,\nwhich are of interest across engineering, physics, chemistry, biology, and\nmedicine-based disciplines. Since the development of the field in its current\nform more than two decades ago, priority has been placed on the synthesis of\nnew structures. However, more recently, a clear trend has emerged in shifting\nthe emphasis from material design to exploring the chemical and physical\nproperties of those already known. In particular --- while such nanoporous\nmaterials were traditionally seen as rigid crystalline structures --- there is\ngrowing evidence that large-scale flexibility, the presence of defects and\nlong-range disorder, are not the exception, but rather the norm, in\nmetal-organic frameworks. Here we offer some perspective into how these\nconcepts are perhaps inescapably intertwined, highlight recent advances in our\nunderstanding, and discuss how a consideration of the interfaces between them\nmay lead to enhancements of the materials' functionalities.",
    "authors": [
      "Thomas D. Bennett",
      "Anthony K. Cheetham",
      "Alain H. Fuchs",
      "François-Xavier Coudert"
    ],
    "publication_date": "2019-04-20T20:57:33Z",
    "arxiv_id": "http://arxiv.org/abs/1904.09497v1",
    "download_url": "http://arxiv.org/abs/1904.09497v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pathways of organic micropollutants degradation in atmospheric pressure\n  plasma processing",
    "abstract": "Concern of toxic compounds and their, potentially more harmful degradation\nproducts, present in aquatic environment alarmed scientific community and\nresearch on the development of novel technologies for wastewater treatment had\nbecome of great interest. Up to this date, many papers pointed out the\nchallenges and limitations of conventional wastewater treatment and of some\nadvanced oxidation processes. Advanced technologies based on the use of\nnon-equilibrium or non-thermal plasma had been recognized as a possible\nsolution for, not only degradation, but for complete removal of recalcitrant\norganic micropollutants. While previous review papers have been focused on\nplasma physics and chemistry of different types of discharges for few organic\nmicropollutants, this paper brings comprehensive review of current knowledge on\nthe chemistry and degradation pathways by using different non-thermal plasma\ntypes for several micropollutants classes, such as pharmaceuticals,\nperfluorinated compounds, pesticides, phenols and dyes and points out some\nmajor research gaps.",
    "authors": [
      "Barbara Topolovec",
      "Nikola Skoro",
      "Nevena Puac",
      "Mira Petrovic"
    ],
    "publication_date": "2022-03-21T10:15:10Z",
    "arxiv_id": "http://arxiv.org/abs/2203.10849v1",
    "download_url": "http://arxiv.org/abs/2203.10849v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complex organic molecules in the Galactic Centre: the N-bearing family",
    "abstract": "We present an unbiased spectral line survey toward the Galactic Centre (GC)\nquiescent giant molecular cloud (QGMC), G+0.693 using the GBT and IRAM 30$\\,$\ntelescopes. Our study highlights an extremely rich organic inventory of\nabundant amounts of nitrogen (N)-bearing species in a source without signatures\nof star formation. We report the detection of 17 N-bearing species in this\nsource, of which 8 are complex organic molecules (COMs). A comparison of the\nderived abundances relative to H$_2$ is made across various galactic and\nextragalactic environments. We conclude that the unique chemistry in this\nsource is likely to be dominated by low-velocity shocks with X-rays/cosmic rays\nalso playing an important role in the chemistry. Like previous findings\nobtained for O-bearing molecules, our results for N-bearing species suggest a\nmore efficient hydrogenation of these species on dust grains in G+0.693 than in\nhot cores in the Galactic disk, as a consequence of the low dust temperatures\ncoupled with energetic processing by X-ray/cosmic ray radiation in the GC.",
    "authors": [
      "S. Zeng",
      "I. Jiménez-Serra",
      "V. M. Rivilla",
      "S. Martín",
      "J. Martín-Pintado",
      "M. A. Requena-Torres",
      "J. Armijos-Abendaño",
      "D. Riquelme",
      "R. Aladro"
    ],
    "publication_date": "2018-04-30T16:49:46Z",
    "arxiv_id": "http://arxiv.org/abs/1804.11321v2",
    "download_url": "http://arxiv.org/abs/1804.11321v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chirality induced spin selectivity in chiral crystals",
    "abstract": "Chirality is a fundamental property of great importance in physics,\nchemistry, and biology, and has recently been found to generate unexpected spin\npolarization for electrons passing through organic molecules, known as\nchirality-induced spin selectivity (CISS). CISS shows promising application\npotential in spintronic devices, spin-controlled chemistry, and enantiomer\nseparation. It focuses on organic molecules that exhibit poor electronic\nconductivity and inherent complexities, such as the debated role of SOC at the\nmolecule-metal interface. In this work, we go beyond organic molecules and\nstudy chiral solids with excellent electrical conductivity, intrinsic SOC, and\ntopological electronic structures. We demonstrate that electrons exhibit both\nspin and orbital polarization as they pass through chiral crystals. Both\npolarization increases with material thickness before saturating to the bulk\nvalues. The spin polarization is proportional to intrinsic SOC while the\norbital polarization is insensitive to SOC. The large spin polarization comes\nwith strong electrical magnetochiral anisotropy in the magneto-transport of\nthese chiral crystals (e.g., RhSi). Our work reveals the interplay of\nchirality, electron spin, and orbital in chiral crystals, paving the way for\ndeveloping chiral solids for chirality-induced phenomena.",
    "authors": [
      "Qun Yang",
      "Yongkang Li",
      "Claudia Felser",
      "Binghai Yan"
    ],
    "publication_date": "2023-12-07T15:36:27Z",
    "arxiv_id": "http://arxiv.org/abs/2312.04366v2",
    "download_url": "http://arxiv.org/abs/2312.04366v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spatial Patterning and Selection: How the Environment Shapes Molecular\n  Complexity",
    "abstract": "Assembly theory predicts that a distinguishing signature of life is its\nability to produce complex molecules in abundance, opening new possibilities\nfor life detection. Experimental validation of this approach has so far relied\non abiotic controls like meteoritic material, or simple, well-mixed chemical\nsystems. However, decades of research in self-organization have shown that\nspatial patterning can foster dynamical self-organization. This raises the\npossibility that systems with nontrivial spatial patterns might promote abiotic\nformation of molecules with higher than expected assembly indices, potentially\nleading to false positives in life detection approaches based on assembly\ntheory. To explore this, we used a model of artificial chemistry to investigate\nhow spatial organization can influence the development of molecular assembly\nindices. Our findings reveal that transport factors, such as diffusion,\nsignificantly affect the distribution of chemical species within a system.\nAdditionally, system topology critically impacts the distribution of assembly\nindices: while it does not enable arbitrary complexity, ordered lattices can\nshift the threshold for abiotic chemistry upward. Moreover, we demonstrate that\ndiffusion can impede the formation and detection of these high assembly index\nmolecules, bearing important implications for life detection experiments and\nastrobiological missions.",
    "authors": [
      "Alexandre Champagne-Ruel",
      "Christopher P. Kempes",
      "Cole Mathis"
    ],
    "publication_date": "2025-09-04T16:59:30Z",
    "arxiv_id": "http://arxiv.org/abs/2509.04547v1",
    "download_url": "http://arxiv.org/abs/2509.04547v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complex Chemistry in Star-Forming Regions: An Expanded Gas-Grain Warm-up\n  Chemical Model",
    "abstract": "Gas-phase processes were long thought to be the key formation mechanisms for\ncomplex organic molecules in star-forming regions. However, recent experimental\nand theoretical evidence has cast doubt on the efficiency of such processes.\nGrain-surface chemistry is frequently invoked as a solution, but until now\nthere have been no quantitative models taking into account both the high degree\nof chemical complexity and the evolving physical conditions of star-forming\nregions. Here, we introduce a new gas-grain chemical network, wherein a wide\narray of complex species may be formed by reactions involving radicals. The\nradicals we consider (H, OH, CO, HCO, CH3, CH3O, CH2OH, NH and NH2) are\nproduced primarily by cosmic ray-induced photodissociation of the granular ices\nformed during the colder, earlier stages of evolution. The gradual warm-up of\nthe hot core is crucial to the formation of complex molecules, allowing the\nmore strongly-bound radicals to become mobile on grain surfaces. This type of\nchemistry is capable of reproducing the high degree of complexity seen in Sgr\nB2(N), and can explain the observed abundances and temperatures of a variety of\npreviously detected complex organic molecules, including structural isomers.\nMany other complex species are predicted by this model, and several of these\nspecies may be detectable in hot cores. Differences in the chemistry of high-\nand low-mass star-formation are also addressed; greater chemical complexity is\nexpected where evolution timescales are longer.",
    "authors": [
      "Robin T. Garrod",
      "Susanna L. Widicus Weaver",
      "Eric Herbst"
    ],
    "publication_date": "2008-03-08T04:38:25Z",
    "arxiv_id": "http://arxiv.org/abs/0803.1214v1",
    "download_url": "http://arxiv.org/abs/0803.1214v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formation of complex organic molecules in cold objects: the role of gas\n  phase reactions",
    "abstract": "While astrochemical models are successful in reproducing many of the observed\ninterstellar species, they have been struggling to explain the observed\nabundances of complex organic molecules. Current models tend to privilege grain\nsurface over gas phase chemistry in their formation. One key assumption of\nthose models is that radicals trapped in the grain mantles gain mobility and\nreact on lukewarm (>30 K) dust grains. Thus, the recent detections of methyl\nformate (MF) and dimethyl ether (DME) in cold objects represent a challenge and\nmay clarify the respective role of grain surface and gas phase chemistry. We\npropose here a new model to form DME and MF with gas phase reactions in cold\nenvironments, where DME is the precursor of MF via an efficient reaction\noverlooked by previous models. Furthermore, methoxy, a precursor of DME, is\nalso synthetized in the gas phase from methanol, which is desorbed by a\nnon-thermal process from the ices. Our new model reproduces fairy well the\nobservations towards L1544. It also explains, in a natural way, the observed\ncorrelation between DME and MF. We conclude that gas phase reactions are major\nactors in the formation of MF, DME and methoxy in cold gas. This challenges the\nexclusive role of grain-surface chemistry and favours a combined grain-gas\nchemistry.",
    "authors": [
      "Nadia Balucani",
      "Cecilia Ceccarelli",
      "Vianney Taquet"
    ],
    "publication_date": "2015-01-15T13:20:59Z",
    "arxiv_id": "http://arxiv.org/abs/1501.03668v1",
    "download_url": "http://arxiv.org/abs/1501.03668v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complex Organic Molecules in Hot Molecular Cores/Corinos: Physics and\n  Chemistry",
    "abstract": "Hot molecular cores (HMCs), the cradles of massive stars, are the most\nchemically rich sources in the Galaxy. The typical masses of these cores (few\nhundreds of solar masses) make them the most important reservoirs of complex\norganic molecules (COMs), including key species for prebiotic processes. This\nrich chemistry is thought to be the result of the evaporation of dust grain\nmantles by the strong radiation of the deeply embedded early-type star(s). Our\nown Sun may have been born in a high-mass star-forming region, so our Earth may\nhave inherited the primordial chemical composition of its parental hot core\nregion, as suggested by recent studies of oxygen and sulfur chemistry in\ncomets. In this chapter, we discuss how the next generation Very Large Array\n(ngVLA) can help us to study the emission of heavy COMs in both low- and\nhigh-mass star-forming regions. The emission of COMs is important not only\nbecause it allows us to understand how chemistry may have developed to\neventually form life in our Earth, but also because COMs are a powerful tool\nfor studying the physical properties and kinematics of the dense regions very\nclose to the central protostars.",
    "authors": [
      "Maria T. Beltrán",
      "Víctor M. Rivilla"
    ],
    "publication_date": "2018-06-21T09:37:22Z",
    "arxiv_id": "http://arxiv.org/abs/1806.08137v1",
    "download_url": "http://arxiv.org/abs/1806.08137v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cryo-EM structures of atomic surfaces and host-guest chemistry in\n  metal-organic frameworks",
    "abstract": "Host-guest interactions govern the chemistry of a broad range of functional\nmaterials. However, the weak bonding between host and guest prevents\natomic-resolution studies of their structure and chemistry using transmission\nelectron microscopy (TEM). This problem is exacerbated in metal-organic\nframeworks (MOF), in which the host framework is easily damaged by the electron\nbeam. Here, we use cryogenic-electron microscopy (cryo-EM) to simultaneously\naddress these two challenges and resolve the atomic surface structure of\nzeolitic imidazolate framework (ZIF-8) and its interaction with guest CO2\nmolecules. We image atomic step-edge sites on the ZIF-8 surface that provides\npossible insight to its growth behavior. Furthermore, we observe two distinct\nbinding sites for CO2 within the ZIF-8 pore, which are both predicted by\ndensity functional theory (DFT) to be energetically favorable. This CO2\ninsertion induces an apparent ~3% lattice expansion along the <002> and <011>\ndirections of the ZIF-8 unit cell. The ability to stabilize MOFs and preserve\ntheir host-guest chemistry opens a rich materials space for scientific\nexploration and discovery using cryo-EM.",
    "authors": [
      "Yuzhang Li",
      "Kecheng Wang",
      "Weijiang Zhou",
      "Yanbin Li",
      "Rafael Vila",
      "William Huang",
      "Hongxia Wang",
      "Guangxu Chen",
      "Gong-Her Wu",
      "Yuchi Tsao",
      "Hansen Wang",
      "Robert Sinclair",
      "Wah Chiu",
      "Yi Cui"
    ],
    "publication_date": "2019-04-08T16:28:57Z",
    "arxiv_id": "http://arxiv.org/abs/1904.04173v1",
    "download_url": "http://arxiv.org/abs/1904.04173v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Astrochemistry During the Formation of Stars",
    "abstract": "Star-forming regions show a rich and varied chemistry, including the presence\nof complex organic molecules - both in the cold gas distributed on large\nscales, and in the hot regions close to young stars where protoplanetary disks\narise. Recent advances in observational techniques have opened new\npossibilities for studying this chemistry. In particular, the Atacama Large\nMillimeter/submillimeter Array (ALMA) has made it possible to study\nastrochemistry down to Solar System size scales, while also revealing molecules\nof increasing variety and complexity. In this review, we discuss recent\nobservations of the chemistry of star-forming environments, with a particular\nfocus on complex organic molecules, taking context from the laboratory\nexperiments and chemical models that they have stimulated. The key takeaway\npoints are: The physical evolution of individual sources plays a crucial role\nin their inferred chemical signatures, and remains an important area for\nobservations and models to elucidate. Comparisons of the abundances measured\ntoward different star-forming environments (high-mass versus low-mass, Galactic\ncenter versus Galactic disk) reveal a remarkable similarity, an indication that\nthe underlying chemistry is relatively independent of variations in their\nphysical conditions. Studies of molecular isotopologs in star-forming regions\nprovide a link with measurements in our own Solar System, and thus may shed\nlight on the chemical similarities and differences expected in other planetary\nsystems.",
    "authors": [
      "Jes K. Jorgensen",
      "Arnaud Belloche",
      "Robin T. Garrod"
    ],
    "publication_date": "2020-06-12T10:52:13Z",
    "arxiv_id": "http://arxiv.org/abs/2006.07071v1",
    "download_url": "http://arxiv.org/abs/2006.07071v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient Photon Upconversion Enabled by Strong Coupling Between Organic\n  Molecules and Quantum Dots",
    "abstract": "Hybrid structures formed between organic molecules and inorganic quantum dots\ncan accomplish unique photophysical transformations by taking advantage of\ntheir disparate properties. The electronic coupling between these materials is\ntypically weak, leading photoexcited charge carriers to spatially localize to a\ndot or a molecule at its surface. However, we show that by converting a\nchemical linker that covalently binds anthracene molecules to silicon quantum\ndots from a carbon-carbon single bond to a double bond, we access a\nstrong-coupling regime where excited carriers spatially delocalize across both\nanthracene and silicon. By pushing the system to delocalize, we design a photon\nupconversion system with a higher efficiency (17.2%) and lower threshold\nintensity (0.5 W/cm^2) than that of a corresponding weakly-coupled system. Our\nresults show that strong coupling between molecules and nanostructures achieved\nthrough targeted linking chemistry provides a new route for tailoring\nproperties in materials for light-driven applications.",
    "authors": [
      "Kefu Wang",
      "R. Peyton Cline",
      "Joseph Schwan",
      "Jacob M. Strain",
      "Sean T. Roberts",
      "Lorenzo Mangolini",
      "Joel D. Eaves",
      "Ming Lee Tang"
    ],
    "publication_date": "2022-06-29T02:31:20Z",
    "arxiv_id": "http://arxiv.org/abs/2206.14370v1",
    "download_url": "http://arxiv.org/abs/2206.14370v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formation of c-C6H5CN ice using the SPACE TIGER experimental setup",
    "abstract": "Benzonitrile (c-C6H5CN) has been recently detected in cold and dense regions\nof the interstellar medium (ISM), where it has been used as a signpost of a\nrich aromatic organic chemistry that might lead to the production of polycyclic\naromatic hydrocarbons (PAHs). One possible origin of this benzonitrile is\ninterstellar ice chemistry involving benzene (c-C6H6) and nitrile molecules\n(organic molecules containing the -CN group). We have addressed the\nplausibility of this c-C6H5CN formation pathway through laboratory experiments\nusing our new setup SPACE TIGER. The SPACE TIGER experimental setup is designed\nto explore the physics and chemistry of interstellar ice mantles using\nlaser-based ice processing and product detection methods. We have found that\nc-C6H5CN is formed upon irradiation of c-C6H6$:CH3CN binary ice mixtures with 2\nkeV electrons and Lyman-alpha photons at low temperatures (4-10 K). Formation\nof c-C6H5CN was also observed when c-C6H6 and CH3CN were embedded in a CO ice\nmatrix, but it was efficiently quenched in a H2O ice matrix. The results\npresented in this work imply that interstellar ice chemistry involving benzene\nand nitrile molecules could contribute to the formation of the observed\nbenzonitrile only if these species are present on top of the ice mantles or\nembedded in the CO-rich ice layer, instead of being mixed into the H2O-rich ice\nlayer.",
    "authors": [
      "Pavlo Maksyutenko",
      "Rafael Martin-Domenech",
      "Elettra Piacentino",
      "Karin I. Oberg",
      "Mahesh Rajappan"
    ],
    "publication_date": "2022-10-07T21:33:48Z",
    "arxiv_id": "http://arxiv.org/abs/2210.03827v2",
    "download_url": "http://arxiv.org/abs/2210.03827v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nanoscale mineralogy and organic structure in Orgueil (CI) and EET 92042\n  (CR) carbonaceous chondrites studied with AFM-IR spectroscopy",
    "abstract": "Meteorite matrices from primitive chondrites are an interplay of ingredients\nat the sub-micron scale, which requires analytical techniques with the\nnanometer spatial resolution to decipher the composition of individual\ncomponents in their petrographic context. Infrared spectroscopy is an effective\nmethod that enables to probe of vibrations at the molecule-atomic scale of\norganic and inorganic compounds but is often limited to a few micrometers in\nspatial resolution. To efficiently distinguish spectral signatures of the\ndifferent constituents, we apply here nano-IR spectroscopy (AFM-IR), based on\nthe combination of infrared and atomic force microscopy, having a spatial\nresolution beyond the diffraction limits. Our study aims to characterize two\nchosen meteorite samples to investigate primitive material in terms of bulk\nchemistry (the CI chondrite Orgueil) and organic composition (the CR chondrite\nEET 92042). We confirm that this technique allows unmixing the IR signatures of\norganics and minerals to assess the variability of organic structure within\nthese samples. We report an investigation of the impact of the widely used\nchemical HF/HCl (Hydrogen Fluoride/Hydrochloric) extraction on the nature of\nrefractory organics (Insoluble Organic Matter, IOM) and provide insights on the\nmineralogy of meteorites matrices from these two samples by comparing to\nreference (extra)terrestrial materials. These findings are discussed with a\nperspective toward understanding the impact of post-accretional aqueous\nalteration and thermal metamorphism on the composition of chondrites. Last, we\nhighlight that the heterogeneity of organic matter within meteoritic materials\nextends down to the nanoscale, and by comparison with IOMs, oxygenated chemical\ngroups are not affected by acid extractions.",
    "authors": [
      "Van T. H. Phan",
      "Rolando Rebois",
      "Pierre Beck",
      "Eric Quirico",
      "Lydie Bonal",
      "Takaaki Noguchi"
    ],
    "publication_date": "2022-06-20T18:19:40Z",
    "arxiv_id": "http://arxiv.org/abs/2206.09953v1",
    "download_url": "http://arxiv.org/abs/2206.09953v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Spatial Distribution of Organics toward the High-Mass YSO NGC 7538\n  IRS9",
    "abstract": "Based on astrochemical theory, the complex molecular composition around\nhigh-mass YSOs should evolve from the outer envelope in toward the central hot\nregion as a sequence of temperature dependent chemical pathways are activated\nin ices and in the gas-phase. The resulting complex molecules have been broadly\nclassified into three generations dependent on the temperature (<25, >25, and\n>100 K) required for formation. We combine IRAM 30m and Submillimeter Array\nobservations to explore the spatial distribution of organic molecules around\nthe high-mass young stellar object NGC 7538 IRS9, whose weak complex molecule\nemission previously escaped detection, quantifying the emission and abundance\nprofiles of key organic molecules as a function of distance from the central\nprotostar. We find that emission from N-bearing organics and saturated\nO-bearing organics present large increases in emission around 8000 AU and\nR<3000 AU, while O-bearing molecules and hydrocarbons do not. The increase in\nflux from some complex molecules in the envelope, around 8000 AU or 25 K, is\nconsistent with recent model predictions of an onset of complex ice chemistry\nat 20-30 K. The emission increase for some molecules at R<3000 AU suggests the\npresence of a weak hot core, where thermal ice evaporation and hot gas-phase\nchemistry drives the chemistry. Complex organics thus form at all radii and\ntemperatures around this protostar, but the composition changes dramatically as\nthe temperature increases, which is used to constrain the chemical\ngeneration(s) to which different classes of molecule belong.",
    "authors": [
      "Karin I. Oberg",
      "Mavis Dufie Boamah",
      "Edith C. Fayolle",
      "Robin T. Garrod",
      "Claudia Cyganowski",
      "Floris van der Tak"
    ],
    "publication_date": "2013-05-14T13:27:33Z",
    "arxiv_id": "http://arxiv.org/abs/1305.3151v1",
    "download_url": "http://arxiv.org/abs/1305.3151v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The organic chemistry in the innermost, infalling envelope of the Class\n  0 protostar L483",
    "abstract": "Context: The protostellar envelopes, outflow and large-scale chemistry of\nClass~0 and Class~I objects have been well-studied, but while previous works\nhave hinted at or found a few Keplerian disks at the Class~0 stage, it remains\nto be seen if their presence in this early stage is the norm. Likewise, while\ncomplex organics have been detected toward some Class~0 objects, their\ndistribution is unknown as they could reside in the hottest parts of the\nenvelope, in the emerging disk itself or in other components of the\nprotostellar system, such as shocked regions related to outflows.\n  Aims: In this work, we aim to address two related issues regarding\nprotostars: when rotationally supported disks form around deeply embedded\nprotostars and where complex organic molecules reside in such objects.\n  Methods: We observed the deeply embedded protostar, L483, using Atacama Large\nMillimeter/submillimeter Array (ALMA) Band~7 data from Cycles~1 and 3 with a\nhigh angular resolution down to $\\sim$~0.1$^{\\prime\\prime}$ (20~au) scales.\n  Results: We find that the kinematics of CS~$J=7$--$6$ and\nH$^{13}$CN~$J=4$--$3$ are best fitted by the velocity profile from infall under\nconservation of angular momentum and not by a Keplerian profile. The spatial\nextents of the observed complex organics are consistent with an estimated ice\nsublimation radius of the envelope at $\\sim$~50~au, suggesting that the complex\norganics exist in the hot corino of L483.\n  Conclusions: We find that L483 does not harbor a Keplerian disk down to at\nleast $15$~au in radius. Instead, the innermost regions of L483 are undergoing\na rotating collapse. This result highlights that some Class~0 objects contain\nonly very small disks, or none at all, with the complex organic chemistry\ntaking place on scales inside the hot corino of the envelope, in a region\nlarger than the emerging disk.",
    "authors": [
      "Steffen K. Jacobsen",
      "Jes K. Jørgensen",
      "James Di Francesco",
      "Neal J. Evans II",
      "Minho Choi",
      "Jeong-Eun Lee"
    ],
    "publication_date": "2018-09-02T20:55:15Z",
    "arxiv_id": "http://arxiv.org/abs/1809.00390v2",
    "download_url": "http://arxiv.org/abs/1809.00390v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Influence of C/O Ratio on Hot Jupiter Atmospheric Chemistry",
    "abstract": "We have conducted laboratory experiments to study the chemistry in hot\nJupiter atmospheres with C/O ratio of 0.35. We have compared our results with\nthe ones obtained previously for atmospheres with a C/O ratio of 1 to\ninvestigate the influence of the C/O ratio on the chemistry and formation of\nphotochemical organic aerosol. We found that the C/O ratio and the gas mixture\ncompositions strongly influence the pathways responsible for the formation of\nCO2. Thermochemical reactions are primarily responsible for the formation of\nCO2 in low C/O ratio atmospheres, while photochemistry is the dominant process\nin high C/O ratio atmospheres even if the final CO2 concentration is the same\nin both cases. Our results show that low C/O atmospheres at the thermochemical\nequilibrium contain a higher water abundance, while high C/O atmospheres are\nsignificantly depleted in water. However, in low C/O atmospheres, the water\nabundance is not affected by UV photolysis, while our previous work\ndemonstrated that significant amount of water can be produced in high C/O ratio\natmospheres. This contrast in water production suggests that photochemistry\nshould be considered when interpreting exoplanet transit spectra. Finally, we\ndid not observe the formation of a detectable amount of non-volatile\nphotochemical aerosols in low C/O atmospheres, in contrast to our previous\nstudy. We infer that for C/O ratio < 1, water likely inhibits organic growth\nand aerosol formation, suggesting that photochemical organic aerosols are\nlikely to be observed in planets presenting a carbon enrichment compared to\ntheir host stars.",
    "authors": [
      "Benjamin Fleury",
      "Murthy S. Gudipati",
      "Bryana L. Henderson",
      "Mark Swain"
    ],
    "publication_date": "2022-04-14T11:14:15Z",
    "arxiv_id": "http://arxiv.org/abs/2204.06884v1",
    "download_url": "http://arxiv.org/abs/2204.06884v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Surface Diffusion of Carbon Atoms as a Driver of Interstellar Organic\n  Chemistry",
    "abstract": "Many interstellar complex organic molecules (COMs) are believed to be\nproduced on the surfaces of icy grains at low temperatures. Atomic carbon is\nconsidered responsible for the skeletal evolution processes, such as C-C bond\nformation, via insertion or addition reactions. Before reactions, C atoms must\ndiffuse on the surface to encounter reaction partners; therefore, information\non their diffusion process is critically important for evaluating the role of C\natoms in the formation of COMs. In situ detection of C atoms on ice was\nachieved by a combination of photostimulated desorption and resonance enhanced\nmultiphoton ionization methods. We found that C atoms weakly bound to the ice\nsurface diffused approximately above 30 K and produced C2 molecules. The\nactivation energy for C-atom surface diffusion was experimentally determined to\nbe 88 meV (1,020 K), indicating that the diffusive reaction of C atoms is\nactivated at approximately 22 K on interstellar ice. The facile diffusion of C\nat T > 22 K atoms on interstellar ice opens a previously overlooked chemical\nregime where the increase in complexity of COMs as driven by C atoms. Carbon\naddition chemistry can be an alternative source of chemical complexity in\ntranslucent clouds and protoplanetary disks with crucial implications in our\ncurrent understanding on the origin and evolution of organic chemistry in our\nUniverse.",
    "authors": [
      "Masashi Tsuge",
      "Germán Molpeceres",
      "Yuri Aikawa",
      "Naoki Watanabe"
    ],
    "publication_date": "2023-08-04T07:54:16Z",
    "arxiv_id": "http://arxiv.org/abs/2308.02181v1",
    "download_url": "http://arxiv.org/abs/2308.02181v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Specialising and Analysing Instruction-Tuned and Byte-Level Language\n  Models for Organic Reaction Prediction",
    "abstract": "Transformer-based encoder-decoder models have demonstrated impressive results\nin chemical reaction prediction tasks. However, these models typically rely on\npretraining using tens of millions of unlabelled molecules, which can be\ntime-consuming and GPU-intensive. One of the central questions we aim to answer\nin this work is: Can FlanT5 and ByT5, the encode-decoder models pretrained\nsolely on language data, be effectively specialised for organic reaction\nprediction through task-specific fine-tuning? We conduct a systematic empirical\nstudy on several key issues of the process, including tokenisation, the impact\nof (SMILES-oriented) pretraining, fine-tuning sample efficiency, and decoding\nalgorithms at inference. Our key findings indicate that although being\npretrained only on language tasks, FlanT5 and ByT5 provide a solid foundation\nto fine-tune for reaction prediction, and thus become `chemistry domain\ncompatible' in the process. This suggests that GPU-intensive and expensive\npretraining on a large dataset of unlabelled molecules may be useful yet not\nessential to leverage the power of language models for chemistry. All our\nmodels achieve comparable Top-1 and Top-5 accuracy although some variation\nacross different models does exist. Notably, tokenisation and vocabulary\ntrimming slightly affect final performance but can speed up training and\ninference; The most efficient greedy decoding strategy is very competitive\nwhile only marginal gains can be achieved from more sophisticated decoding\nalgorithms. In summary, we evaluate FlanT5 and ByT5 across several dimensions\nand benchmark their impact on organic reaction prediction, which may guide more\neffective use of these state-of-the-art language models for chemistry-related\ntasks in the future.",
    "authors": [
      "Jiayun Pang",
      "Ivan Vulić"
    ],
    "publication_date": "2024-05-17T08:39:56Z",
    "arxiv_id": "http://arxiv.org/abs/2405.10625v1",
    "download_url": "http://arxiv.org/abs/2405.10625v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ice chemistry in starless molecular cores",
    "abstract": "Starless molecular cores are natural laboratories for interstellar molecular\nchemistry research. The chemistry of ices in such objects was investigated with\na three-phase (gas, surface, and mantle) model. We considered the center part\nof five starless cores, with their physical conditions derived from\nobservations. The ice chemistry of oxygen, nitrogen, sulfur, and complex\norganic molecules (COMs) was analyzed. We found that an ice-depth dimension,\nmeasured, e.g., in monolayers, is essential for modeling of chemistry in\ninterstellar ices. Particularly, the H2O:CO:CO2:N2:NH3 ice abundance ratio\nregulates the production and destruction of minor species. It is suggested that\nphotodesorption during core collapse period is responsible for high abundance\nof interstellar H2O2 and O2H, and other species synthesized on the surface. The\ncalculated abundances of COMs in ice were compared to observed gas-phase\nvalues. Smaller activation barriers for CO and H2CO hydrogenation may help\nexplain the production of a number of COMs. The observed abundance of methyl\nformate HCOOCH3 could be reproduced with a 1kyr, 20K temperature spike.\nPossible desorption mechanisms, relevant for COMs, are gas turbulence (ice\nexposure to interstellar photons) or a weak shock within the cloud core (grain\ncollisions). To reproduce the observed COM abundances with the present 0D\nmodel, 1-10% of ice mass needs to be sublimated. We estimate that the lifetime\nfor starless cores likely does not exceed 1Myr. Taurus cores are likely to be\nyounger than their counterparts in most other clouds.",
    "authors": [
      "Juris Kalvans"
    ],
    "publication_date": "2015-04-23T07:14:13Z",
    "arxiv_id": "http://arxiv.org/abs/1504.06065v1",
    "download_url": "http://arxiv.org/abs/1504.06065v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Distribution and Chemistry of H$_2$CO in the DM Tau Protoplanetary\n  Disk",
    "abstract": "H$_2$CO ice on dust grains is an important precursor of complex organic\nmolecules (COMs). H$_2$CO gas can be readily observed in protoplanetary disks\nand may be used to trace COM chemistry. However, its utility as a COM probe is\ncurrently limited by a lack of constraints on the relative contributions of two\ndifferent formation pathways: on icy grain-surfaces and in the gas-phase. We\nuse archival ALMA observations of the resolved distribution of H$_2$CO emission\nin the disk around the young low-mass star DM Tau to assess the relative\nimportance of these formation routes. The observed H$_2$CO emission has a\ncentrally peaked and radially broad brightness profile (extending out to 500\nAU). We compare these observations with disk chemistry models with and without\ngrain-surface formation reactions, and find that both gas and grain-surface\nchemistry are necessary to explain the spatial distribution of the emission.\nGas-phase H$_2$CO production is responsible for the observed central peak,\nwhile grain-surface chemistry is required to reproduce the emission exterior to\nthe CO snowline (where H$_2$CO mainly forms through the hydrogenation of CO ice\nbefore being non-thermally desorbed). These observations demonstrate that both\ngas and grain-surface pathways contribute to the observed H$_2$CO in disks, and\nthat their relative contributions depend strongly on distance from the host\nstar.",
    "authors": [
      "Ryan A. Loomis",
      "L. Ilsedore Cleeves",
      "Karin I. Öberg",
      "Viviana V. Guzman",
      "Sean M. Andrews"
    ],
    "publication_date": "2015-08-27T20:10:54Z",
    "arxiv_id": "http://arxiv.org/abs/1508.07004v1",
    "download_url": "http://arxiv.org/abs/1508.07004v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Cosmic Ray-Driven Grain Chemistry in Cold Core Models",
    "abstract": "In this paper, we present preliminary results illustrating the effect of\ncosmic rays on solid-phase chemistry in models of both TMC-1 and several\nsources with physical conditions identical to TMC-1 except for hypothetically\nenhanced ionization rates. Using a recent theory for the addition of cosmic\nray-induced reactions to astrochemical models, we calculated the radiochemical\nyields, called $G$ values, for the primary dust grain ice-mantle constituents.\nWe show that the inclusion of this non-thermal chemistry can lead to the\nformation of complex organic molecules from simpler ice-mantle constituents,\neven under cold core conditions. In addition to enriching ice-mantles, we find\nthat these new radiation-chemical processes can lead to increased gas-phase\nabundances as well, particularly for HOCO, NO$_2$, HC$_2$O, methyl formate\n(HCOOCH$_3$), and ethanol (CH$_3$CH$_2$OH). These model results imply that HOCO\n- and perhaps NO$_2$ - might be observable in TMC-1. Future detections of\neither of these two species in cold interstellar environments could provide\nstrong support for the importance of cosmic ray-driven radiation chemistry. The\nincreased gas-phase abundance of methyl formate can be compared with abundances\nachieved through other formation mechanisms such as pure gas-phase chemistry\nand three-body surface reactions.",
    "authors": [
      "Christopher N. Shingledecker",
      "Jessica D. Tennis",
      "Romane Le Gal",
      "Eric Herbst"
    ],
    "publication_date": "2018-05-15T13:42:46Z",
    "arxiv_id": "http://arxiv.org/abs/1805.05764v1",
    "download_url": "http://arxiv.org/abs/1805.05764v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Diverse Chemistry of Stable Hydronitrogens, and Implications for\n  Planetary and Materials Sciences",
    "abstract": "Nitrogen hydrides, including ammonia (NH3), hydrazine (N2H4), hydrazoic acid\n(HN3) and etc, are compounds of great fundamental and applied importance. Their\nhigh-pressure behavior is important because of their abundance in giant planets\nand because of the hopes of discoverying high-energy-density materials. Here,\nwe have performed a systematic investi- gation on the structural stability of\nN-H system in a pressure range up to 800 GPa through evolutionary structure\nprediction simulations. Surprisingly, we found that high pressure stabilizes a\nseries of previously unreported compounds with peculiar structural and\nelectronic properties, such as the N4H, N3H, N2H and NH phases composed of\nnitrogen backbones, the N9H4 phase containing two dimensional metallic nitrogen\nplanes and novel N8H, NH2, N3H7, NH4 and NH5 molecular phases. Another surprise\nis that NH3 becomes thermodynamically unstable above ~460 GPa. We found that\nhigh-pressure chemistry is much more diverse that hydrocarbon chemistry at\nnormal conditions, leading to expectations that N-H-O and N-H-O-S systems under\npressure are likely to possess richer chemistry than the known organic\nchemistry. This, in turn, opens a possibility of nitrogen-based life at high\npressure. The predicted phase diagram of the N-H system also provides a\nreference for synthesis of high-energy-density materials.",
    "authors": [
      "Guang-Rui Qian",
      "Haiyang Niu",
      "Chao-Hao Hu",
      "Artem R. Oganov",
      "Qingfeng Zeng",
      "Huai-Ying Zhou"
    ],
    "publication_date": "2014-11-17T15:39:37Z",
    "arxiv_id": "http://arxiv.org/abs/1411.4513v3",
    "download_url": "http://arxiv.org/abs/1411.4513v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-fidelity reaction kinetic modeling of hot-Jupiter atmospheres\n  incorporating thermal and UV photochemistry enhanced by metastable CO(a3Pi)",
    "abstract": "A detailed modeling of simultaneous UV-photochemical and thermochemical\nprocesses in exoplanet atmosphere-like conditions is essential for the analysis\nand interpretation of a vast amount of current and future spectral data from\nexoplanets. However, a detailed reaction kinetic model that incorporates both\nUV photochemistry and thermal chemistry is challenging due to the massive size\nof the chemical system as well as to the lack of understanding of\nphotochemistry compared to thermal-only chemistry. Here, we utilize an\nautomatic chemical reaction mechanism generator to build a high-fidelity\nthermochemical reaction kinetic model later then incorporated with\nUV-photochemistry enhanced by metastable triplet-state carbon monoxide (a3Pi).\nOur model results show that two different photochemical reactions driven by\nLyman-a photons (i.e. H2 + CO(a3Pi) -> H + HCO and CO(X1Sig+) + CO(a3Pi) ->\nC(3P) + CO2) can enhance thermal chemistry resulting in significant increases\nin the formation of CH4, H2O, and CO2 in H2-dominated systems with trace\namounts of CO, which qualitatively matches with the observations from previous\nexperimental studies. Our model also suggests that at temperatures above 2000\nK, thermal chemistry becomes the dominant process. Finally, the chemistry\nsimulated up to 2500 K does not produce any larger species such as C3 species,\nbenzene or larger (i.e. PAHs). This might indicate that the photochemistry of\nC2 species such as C2H2 might play a key role in the formation of organic\naerosols observed in the previous experimental study.",
    "authors": [
      "Jeehyun Yang",
      "Murthy S. Gudipati",
      "Bryana L Henderson",
      "Benjamin Fleury"
    ],
    "publication_date": "2023-02-16T21:47:14Z",
    "arxiv_id": "http://arxiv.org/abs/2302.08596v2",
    "download_url": "http://arxiv.org/abs/2302.08596v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Theoretical study on charge transfer properties of\n  triphenylamino-ethynyl Polycyclic Aromatic Hydrocarbon derivatives",
    "abstract": "This study systematically investigates the regulation mechanisms of backbone\ntopology (tri-/tetracyclic arenes), substitution positions, and functional\ngroups on charge transport properties through molecular design of\ntriphenylamine-ethynylene fused acene derivatives. By integrating Marcus charge\ntransfer theory with kinetic Monte Carlo simulations, we demonstrate that\nsulfur-doped tricyclic arene backbones (benzodithiophene and anthracene)\neffectively suppress high-frequency vibrational modes reducing reorganization\nenergy to 146.1 meV. Concurrent optimization of intermolecular $\\pi$-$\\pi$\nslippage enhances 2D hole mobility. Notably, asymmetric charge transport\npathways in 2,7-disubstituted pyrene(27DTEP) decrease transfer integrals by\n34%, while 1,6-substitution (16DTEP)reconstructs HOMO orbital distribution and\ninduces rotational stacking, boosting transfer integrals by 28% and improving\nmobility isotropy. We further propose a \"backbone-functional group synergy\"\nstrategy, revealing that concentrated orbital localization on the backbone\namplifies transfer integral gains, outweighing the 38% increase in\nreorganization energy and significantly enhancing mobility. These findings\nestablish a theoretical framework and quantitative model for the rational\ndesign of high-mobility organic ultraviolet photodetectors.",
    "authors": [
      "Zhipeng Tong",
      "Xiaoqi Sun",
      "Guiya Qin",
      "Jinpu Bai",
      "Qi Zhao",
      "Aimin Ren",
      "Jingfu Guo"
    ],
    "publication_date": "2025-05-26T13:15:18Z",
    "arxiv_id": "http://arxiv.org/abs/2505.20371v1",
    "download_url": "http://arxiv.org/abs/2505.20371v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Charge Transport in Organic Molecular Semiconductors from First\n  Principles: The Band-Like Hole Mobility in Naphthalene Crystal",
    "abstract": "Predicting charge transport in organic molecular crystals is notoriously\nchallenging. Carrier mobility calculations in organic semiconductors are\ndominated by quantum chemistry methods based on charge hopping, which are\nlaborious and only moderately accurate. We compute from first principles the\nelectron-phonon scattering and the phonon-limited hole mobility of naphthalene\ncrystal in the framework of ab initio band theory. Our calculations combine GW\nelectronic bandstructures, ab initio electron-phonon scattering, and the\nBoltzmann transport equation. The calculated hole mobility is in very good\nagreement with experiment between 100$-$300 K, and we can predict its\ntemperature dependence with high accuracy. We show that scattering between\ninter-molecular phonons and holes regulates the mobility, though\nintra-molecular phonons possess the strongest coupling with holes. We revisit\nthe common belief that only rigid molecular motions affect carrier dynamics in\norganic molecular crystals. Our work provides a quantitative and rigorous\nframework to compute charge transport in organic crystals, and is a first step\ntoward reconciling band theory and carrier hopping computational methods.",
    "authors": [
      "Nien-En Lee",
      "Jin-Jian Zhou",
      "Luis A. Agapito",
      "Marco Bernardi"
    ],
    "publication_date": "2017-12-01T20:59:28Z",
    "arxiv_id": "http://arxiv.org/abs/1712.00490v2",
    "download_url": "http://arxiv.org/abs/1712.00490v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Enhancement of photovoltaic efficiency by insertion of a polyoxometalate\n  layer at the anode of an organic solar cell",
    "abstract": "In this article the Wells-Dawson polyoxometalate K6[P2W18O62] is grown as an\ninterfacial layer between indium tin oxide and bulk heterojunction of\npoly(3-hexylthiophene) (P3HT) and [6,6]-phenyl-C61-butyric acid methyl ester\n(PCBM). The structure of the POM layers depends on the thickness and shows a\nhighly anisotropic surface organization. The films have been characterized by\natomic force microscopy and X-ray photoelectron spectroscopy (XPS) to gain\ninsight into their macroscopic organization and better understand their\nelectronic properties. Then, they were put at the anodic interface of a\nP3HT:PCBM organic solar cell and characterized on an optical bench. The\nphotovoltaic efficiency is discussed in terms of the benefit of the\npolyoxometalate at the anodic interface of an organic photovoltaic cell.",
    "authors": [
      "M. Alaaeddine",
      "Q. Zhu",
      "D. Fichou",
      "G. Izzet",
      "J. E. Rault",
      "N. Barrett",
      "A. Proust",
      "L. Tortech"
    ],
    "publication_date": "2018-06-07T13:04:40Z",
    "arxiv_id": "http://arxiv.org/abs/1806.02650v1",
    "download_url": "http://arxiv.org/abs/1806.02650v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Photophysics of Two-Dimensional Semiconducting Organic-Inorganic\n  Metal-Halide Perovskites",
    "abstract": "2D organic-inorganic hybrid perovskites (2DHPs) consist of alternating\nanionic metal-halide and cationic organic layers. They have widely tunable\nstructural and optical properties. We review the role of the organic cation in\ndefining the structural and optical properties of 2DHPs through example lead\niodide 2DHPs. Even though excitons reside in the metal halide layers, the\norganic and inorganic frameworks cannot be separated-they must be considered as\na single unit to fully understand the photophysics of 2DHPs. We correlate\ncation-induced distortion and disorder in the inorganic lattice with the\nresulting optical properties. We also discuss the role of the cation in\ncreating and altering the discrete excitonic structure that appears at\ncryogenic temperatures in some 2DHPs, including the cation-dependent presence\nof hot exciton photoluminescence. We conclude our review with an outlook for\n2DHPs, highlighting existing gaps in fundamental knowledge as well as potential\nfuture applications.",
    "authors": [
      "Daniel B. Straus",
      "Cherie R. Kagan"
    ],
    "publication_date": "2021-08-30T19:48:26Z",
    "arxiv_id": "http://arxiv.org/abs/2108.13501v2",
    "download_url": "http://arxiv.org/abs/2108.13501v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Identifying the origin of delayed electroluminescence in a polariton\n  organic light-emitting diode",
    "abstract": "Modifying the energy landscape of existing molecular emitters is an\nattractive challenge with favourable outcomes in chemistry and organic\noptoelectronic research. It has recently been explored through strong\nlight-matter coupling studies where the organic emitters were placed in an\noptical cavity. Nonetheless, a debate revolves around whether the observed\nchange in the material properties represents novel coupled system dynamics or\nthe unmasking of pre-existing material properties induced by light-matter\ninteractions. Here, for the first time, we examined the effect of strong\ncoupling in polariton organic light-emitting diodes via time-resolved\nelectroluminescence studies. We accompanied our experimental analysis with\ntheoretical fits using a model of coupled rate equations accounting for all\nmajor mechanisms that can result in delayed electroluminescence in organic\nemitters. We found that in our devices the delayed electroluminescence was\ndominated by emission from trapped charges and this mechanism remained\nunmodified in the presence of strong coupling.",
    "authors": [
      "Ahmed Gaber Abdelmagid",
      "Hassan A. Qureshi",
      "Michael A. Papachatzakis",
      "Olli Siltanen",
      "Manish Kumar",
      "Ajith Ashokan",
      "Seyhan Salman",
      "Kimmo Luoma",
      "Konstantinos S. Daskalakis"
    ],
    "publication_date": "2023-09-22T09:35:42Z",
    "arxiv_id": "http://arxiv.org/abs/2309.12737v1",
    "download_url": "http://arxiv.org/abs/2309.12737v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Morphological Computing as Logic Underlying Cognition in Human, Animal,\n  and Intelligent Machine",
    "abstract": "This work examines the interconnections between logic, epistemology, and\nsciences within the Naturalist tradition. It presents a scheme that connects\nlogic, mathematics, physics, chemistry, biology, and cognition, emphasizing\nscale-invariant, self-organizing dynamics across organizational tiers of\nnature. The inherent logic of agency exists in natural processes at various\nlevels, under information exchanges. It applies to humans, animals, and\nartifactual agents. The common human-centric, natural language-based logic is\nan example of complex logic evolved by living organisms that already appears in\nthe simplest form at the level of basal cognition of unicellular organisms.\nThus, cognitive logic stems from the evolution of physical, chemical, and\nbiological logic. In a computing nature framework with a self-organizing\nagency, innovative computational frameworks grounded in\nmorphological/physical/natural computation can be used to explain the genesis\nof human-centered logic through the steps of naturalized logical processes at\nlower levels of organization. The Extended Evolutionary Synthesis of living\nagents is essential for understanding the emergence of human-level logic and\nthe relationship between logic and information processing/computational\nepistemology. We conclude that more research is needed to elucidate the details\nof the mechanisms linking natural phenomena with the logic of agency in nature.",
    "authors": [
      "Gordana Dodig-Crnkovic"
    ],
    "publication_date": "2023-09-25T09:31:25Z",
    "arxiv_id": "http://arxiv.org/abs/2309.13979v1",
    "download_url": "http://arxiv.org/abs/2309.13979v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Machine Learning, Quantum Mechanics, and Chemical Compound Space",
    "abstract": "We review recent studies dealing with the generation of machine learning\nmodels of molecular and solid properties. The models are trained and validated\nusing standard quantum chemistry results obtained for organic molecules and\nmaterials selected from chemical space at random.",
    "authors": [
      "Raghunathan Ramakrishnan",
      "O. Anatole von Lilienfeld"
    ],
    "publication_date": "2015-10-26T15:28:04Z",
    "arxiv_id": "http://arxiv.org/abs/1510.07512v3",
    "download_url": "http://arxiv.org/abs/1510.07512v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Back to the Origins. Using Matrix Functions of Hückel Hamiltonian for\n  Quantum Interference",
    "abstract": "A book chapter where a new matrix function of the HMO Hamiltonian is proposed\nto deal with the Quantum Interference phenomenon in conjugated organic\nmolecules.",
    "authors": [
      "Ernesto Estrada"
    ],
    "publication_date": "2016-10-18T16:47:06Z",
    "arxiv_id": "http://arxiv.org/abs/1610.06422v1",
    "download_url": "http://arxiv.org/abs/1610.06422v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]