[
  {
    "title": "The extent of formation of organic molecules in the comae of comets\n  showing relatively high activity",
    "abstract": "Comets are a rich reservoir of complex organic molecules. Ground and\nspace-based observatories have recently greatly enhanced the cometary molecular\ninventory. Although these molecules' origin is believed to be the cometary\nnucleus, they can be partially synthesised in the coma. We studied organic\nmolecules' nucleus versus coma origins for various initial conditions, using a\nmultifluid chemical-hydrodynamical model and an updated chemical network. For\nthe study, we considered four comets [C/1996 B2 (Hyakutake), C/2012 F6\n(Lemmon), C/2013 R1 (Lovejoy), and C/2014 Q2 (Lovejoy)] due to their relatively\nhigh activity and observation of large number organics species. We emphasised\non the C-H-O and N-bearing species, including the simplest amino acid, glycine.\nWe discuss the formation pathways of the organics and the conditions for their\nformation in the coma and find that the abundance varies from one comet to\nanother due to differences in the initial conditions, relative abundances of\nthe reactants and temperature. We compare the organic abundances when they are\npresent as parent volatiles to their formation solely due to gas-phase\nchemistry. Their abundance purely due to the coma chemistry is moderately to\nsignificantly lower compared to that when they are parent volatiles. However,\nwe find that the production rates of some of the coma-synthesised organic\nmolecules can reach peak values of ~ 1e22 - 1e26 molecules/s, which is in the\nrealm of detection by in situ/space-based observations, and can therefore be\nimportant considering future missions to comets. We also compare our modeled\nabundances with those observed in 67P/C-G by Rosetta, which detected several\norganics at a large heliocentric distance and low production rate.",
    "authors": [
      "Sana Ahmed",
      "Kinsuk Acharyya"
    ],
    "publication_date": "2022-07-27T04:29:27Z",
    "arxiv_id": "http://arxiv.org/abs/2207.13288v4",
    "download_url": "http://arxiv.org/abs/2207.13288v4",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemical differences among collapsing low-mass protostellar cores",
    "abstract": "Organic features lead to two distinct types of Class 0/I low-mass protostars:\nhot corino sources, and warm carbon-chain chemistry (WCCC) sources. Some\nobservations suggest that the chemical variations between WCCC sources and hot\ncorino sources are associated with local environments, as well as the\nluminosity of protostars. We conducted gas-grain chemical simulation in\ncollapsing protostellar cores, and found that the fiducial model predicts\nabundant carbon-chain molecules and COMs, and reproduces WCCC and hot corino\nchemistry in the hybrid source L483. By changing values of some physical\nparameters, including the visual extinction of ambient clouds ($A_{\\rm V}^{\\rm\namb}$), the cosmic-ray ionization rate ($\\zeta$), the maximum temperature\nduring the warm-up phase ($T_{\\rm max}$), and the contraction timescale of\nprotostars ($t_{\\rm cont}$), we found that UV photons and cosmic rays can boost\nWCCC features by accelerating the dissociation of CO and CH$_4$ molecules. On\nthe other hand, UV photons can weaken the hot corino chemistry by\nphotodissociation reactions, while the dependence of hot corino chemistry on\ncosmic rays is relatively complex. The $T_{\\rm max}$ does not affect WCCC\nfeatures, while it can influence hot corino chemistry by changing the effective\nduration of two-body surface reactions for most COMs. The long $t_{\\rm cont}$\ncan boost WCCC and hot corino chemistry, by prolonging the effective duration\nof WCCC reactions in the gas phase and surface formation reactions for COMs,\nrespectively. Subsequently, we ran a model with different physical parameters\nto reproduce scarce COMs in prototypical WCCC sources. The scarcity of COMs in\nprototypical WCCC sources can be explained by insufficient dust temperature in\nthe inner envelopes to activate hot corino chemistry. Meanwhile, the High\n$\\zeta$ and the long $t_{\\rm cont}$ favors the explanation for scarce COMs in\nthese sources.",
    "authors": [
      "Jingfei Sun",
      "Xiaohu Li",
      "Fujun Du",
      "Yao Wang",
      "Juan Tuo",
      "Yanan Feng"
    ],
    "publication_date": "2023-12-12T03:37:58Z",
    "arxiv_id": "http://arxiv.org/abs/2312.06959v1",
    "download_url": "http://arxiv.org/abs/2312.06959v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Importance of Aqueous Metabolites in the Martian Subsurface for\n  Understanding Habitability, Organic Chemical Evolution, and Potential Biology",
    "abstract": "Aqueous metabolites in terrestrial subsurface environments provide critical\nanalog frameworks for assessing the habitability of Martian subsurface ice. On\nEarth, they play critical roles in sustaining microbial life within soils,\npermafrost, and groundwater environments and their availability shape microbial\ncommunity compositions, activity, and adaptability to changes in environmental\nconditions, enabling communities to persist over millennial timescales. The\ncounterpart to aqueous-soluble organics is the insoluble organic matter pool\nthat makes up the largest portion of organic matter in natural samples and\nincludes most types of organic signatures indicative of biological processes.\nEmploying a range of sample preparation, molecular separation, detection, and\nimaging techniques enables the characterization of both labile (i.e., soluble\nand reactive) and recalcitrant (i.e., insoluble, non-reactive; include\nmacromolecules) organic pools. Multiple orthogonal analytical modalities\nstrengthen interpretations of signatures that we associate with biology as we\nknow it and don't know it, by constraining possible abiotic sources, validating\nmeasurements across distinct techniques, and ensuring flexibility to\ninterrogate diverse organic chemistries encountered in Martian subsurface\nenvironments. This holistic triage approach aligns with the priorities\narticulated in the Mars Exploration Program Analysis Group's Search for Life\n-Science Analysis Group (SFL-SAG) Charter for a medium-class Mars mission\nfocused on extant life detection.",
    "authors": [
      "Jennifer L. Eigenbrode",
      "Luoth Chou"
    ],
    "publication_date": "2025-08-06T13:06:04Z",
    "arxiv_id": "http://arxiv.org/abs/2508.14050v1",
    "download_url": "http://arxiv.org/abs/2508.14050v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Turing structures in dc gas discharges",
    "abstract": "Self-organized spatial plasma structures exhibit many similarities with\nTuring structures obtained in biology and chemistry. Using an analytical\nmesoscopic approach it is shown that plasma balls of fire belong to the same\nclass of Turing structures like the Brusselator. It is also mathematically\nproved that the existence of these self-organized plasma structures is related\nwith a negative differential resistance. There are also established the\nmathematical conditions which the negative differential resistance must satisfy\nfor obtaining a stationary ball of fire at the anode of a plasma diode.",
    "authors": [
      "S. Popescu"
    ],
    "publication_date": "2007-09-11T09:06:22Z",
    "arxiv_id": "http://arxiv.org/abs/0709.1555v1",
    "download_url": "http://arxiv.org/abs/0709.1555v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electronic structure of porphyrin-based metal-organic frameworks and\n  their suitability for solar fuel production photocatalysis",
    "abstract": "Metal-organic frameworks (MOFs) can be exceptionally good catalytic materials\nthanks to the presence of active metal centres and a porous structure that is\nadvantageous for molecular adsorption and confinement. We present here a\nfirst-principles investigation of the electronic structure of a family of MOFs\nbased on porphyrins connected through phenyl-carboxyl ligands and AlOH species,\nin order to assess their suitability for the photocatalysis of fuel production\nreactions using sunlight.",
    "authors": [
      "Said Hamad",
      "Norge C. Hernandez",
      "Alex G. Aziz",
      "A. Rabdel Ruiz-Salvador",
      "Sofia Calero",
      "Ricardo Grau-Crespo"
    ],
    "publication_date": "2015-10-12T12:55:34Z",
    "arxiv_id": "http://arxiv.org/abs/1510.03260v1",
    "download_url": "http://arxiv.org/abs/1510.03260v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Molecules in the Hot Corinos and Circumstellar Disks of IRAS\n  16293-2422",
    "abstract": "Using the recently-commissioned Submillimeter Array (SMA), we have detected\nseveral complex organic molecules, including (CH3)2O, C2H5OH, C2H5CN, and\ntentatively CH2CDCN, toward the protostellar hot cores of IRAS 16293-2422 at\narcsecond-resolution (~< 400 AU in radius). Vibrationally excited transitions\nof SO, SO2 and HCN with energy levels up to 1800 K were also observed. In\naddition to the other organic molecules (HC3N, CH2CO, CH3OH, CH2CHCN and\nHCOOCH3) previously reported by us (Kuan et al. 2004), these results clearly\nindicate the existence of a rich organic chemistry in low-mass `hot corinos'.\n  From the observation of optically thin HC15N emission, we conclude I16293A is\na rotating circumstellar disk lying along the north-south direction ~10 deg to\nthe east and with an inclination ~30 deg to the sky. We suggest that the\nobserved vibrational SO and SO2 emission may originate from shock waves near or\nin the circumstellar disks. Between the two cores, we find a strong\nanticorrelation in emission from C2H5OH and C2H5CN. The relative contribution\nof gas phase and grain-surface chemistries to the production of the observed\ncomplex molecules is discussed. We point out the shortcomings underlying recent\nclaims that all the O-bearing organics are formed on grains.\n  The presence of so many well-known interstellar molecules in solar-type hot\ncorinos strengthens the link between molecular cloud chemistry, the starting\nmaterials of protoplanetary disks such as the protosolar nebula, and the\ncomposition of comets. Establishing the fine details of this connection is\ncrucial in answering fundamental questions concerning the importance of\ngalactic astrochemistry for astrobiology.",
    "authors": [
      "H. -C. Huang",
      "Y. -J. Kuan",
      "S. B. Charnley",
      "N. Hirano",
      "S. Takakuwa",
      "T. L. Bourke"
    ],
    "publication_date": "2005-04-12T14:06:20Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0504271v1",
    "download_url": "http://arxiv.org/abs/astro-ph/0504271v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Prebiotic Chemistry on Titan: Impact experiments on organic haze\n  particles",
    "abstract": "Impacts are critical to producing the aqueous environments necessary to\nstimulate prebiotic chemistry on Titan's surface. Furthermore, organic hazes\nresting on the surface are a likely feedstock of biomolecules. In this work, we\nconduct impact experiments on laboratory-produced organic haze particles and\nhaze/sand mixtures and analyze these samples for life's building blocks.\nSamples of unshocked haze and sand particles are also analyzed to determine the\nchange in biomolecule concentrations and distributions from shocking. Across\nall samples, we detect seven nucleobases, nine proteinogenic amino acids, and\nfive other biomolecules (e.g., urea) using a blank subtraction procedure to\neliminate signals due to contamination. We find that shock pressures of 13 GPa\nvariably degrade nucleobases, amino acids, and a few other organics in haze\nparticles and haze/sand mixtures; however, certain individual biomolecules\nbecome enriched or are even produced from these events. Xanthine, threonine,\nand aspartic acid are enriched or produced in impact experiments containing\nsand, suggesting these minerals may catalyze the production of these\nbiomolecules. On the other hand, thymine and isoleucine/norleucine are enriched\nor produced in haze samples containing no sand, suggesting catalytic grains are\nnot necessary for all impact shock syntheses. Uracil, glycine, proline,\ncysteine, and tyrosine are the most unstable to impact-related processing.\nThese experiments suggest that impacts alter biomolecule distributions on\nTitan's surface, and that organic hazes co-occurring with fine-grained material\non the surface may provide an initial source for further prebiotic chemistry on\nTitan.",
    "authors": [
      "Ben K. D. Pearce",
      "Sarah M. Hörst",
      "Christopher J. Cline",
      "Mark J. Cintala",
      "Chao He",
      "Joshua A. Sebree",
      "Shannon M. MacKenzie",
      "R. Terik Daly",
      "Alexandra J. Pontefract",
      "Cara Pesciotta"
    ],
    "publication_date": "2024-02-28T19:03:21Z",
    "arxiv_id": "http://arxiv.org/abs/2403.00029v1",
    "download_url": "http://arxiv.org/abs/2403.00029v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "DNA Nucleobase Synthesis at Titan Atmosphere Analog by Soft X-rays",
    "abstract": "Titan, the largest satellite of Saturn, has an atmosphere chiefly made up of\nN2 and CH4 and includes traces of many simple organic compounds. This\natmosphere also partly consists of haze and aerosol particles which during the\nlast 4.5 gigayears have been processed by electric discharges, ions, and\nionizing photons, being slowly deposited over the Titan surface. In this work,\nwe investigate the possible effects produced by soft X-rays (and secondary\nelectrons) on Titan aerosol analogs in an attempt to simulate some prebiotic\nphotochemistry. The experiments have been performed inside a high vacuum\nchamber coupled to the soft X-ray spectroscopy beamline at the Brazilian\nSynchrotron Light Source, Campinas, Brazil. In-situ sample analyses were\nperformed by a Fourier transform infrared spectrometer. The infrared spectra\nhave presented several organic molecules, including nitriles and aromatic CN\ncompounds. After the irradiation, the brownish-orange organic residue (tholin)\nwas analyzed ex-situ by gas chromatographic (GC/MS) and nuclear magnetic\nresonance (1H NMR) techniques, revealing the presence of adenine (C5H5N5), one\nof the constituents of the DNA molecule. This confirms previous results which\nshowed that the organic chemistry on the Titan surface can be very complex and\nextremely rich in prebiotic compounds. Molecules like these on the early Earth\nhave found a place to allow life (as we know) to flourish.",
    "authors": [
      "S. Pilling",
      "D. P. P. Andrade",
      "Alvaro C. Neto",
      "R. Rittner",
      "A. Naves de Brito"
    ],
    "publication_date": "2009-06-19T14:12:09Z",
    "arxiv_id": "http://arxiv.org/abs/0906.3675v1",
    "download_url": "http://arxiv.org/abs/0906.3675v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Laboratory Studies of Methane and Its Relationship to Prebiotic\n  Chemistry",
    "abstract": "In order to examine how the terrestrial life emerged, a number of laboratory\nexperiments have been conducted since the 1950s. Methane has been one of the\nkey molecules in these studies. In earlier studies, strongly reducing gas\nmixtures containing methane and ammonia were mainly used to simulate possible\nreactions in primitive Earth atmosphere, and amino acids and other organic\ncompounds were detected. Since the primitive Earth atmosphere was estimated to\nbe less reducing, contribution of extraterrestrial organics to the origin of\nlife is considered quite important. Extraterrestrial organic chemistry has been\nexperimentally and theoretically studied intensively, including laboratory\nexperiments simulating interstellar molecular reactions. Endogenous and\nexogenous organics should have been supplied to the primitive ocean. Now\nsubmarine hydrothermal systems are considered one of the plausible sites of\ngeneration of life. Experiments simulating submarine hydrothermal systems where\nmethane played an important role are now intensively being conducted. We have\nrecognized the importance of such studies on possible reactions in other solar\nsystem bodies to understand the origins of life. Titan and other icy bodies,\nwhere methane plays significant roles, are especially good targets to be\nstudied. In the case of Titan, not only methane-containing atmospheres but also\nliquidospheres composed of methane and other hydrocarbons have been used in\nsimulation experiments. This paper summarizes experiments simulating various\nterrestrial and extraterrestrial environments, and possible roles of methane in\nchemical evolution are discussed.",
    "authors": [
      "Kensei Kobayashi",
      "Wolf D. Geppert",
      "Nathalie Carrasco",
      "Nils G. Holm",
      "Olivier Mousis",
      "Maria Elisabetta Palumbo",
      "J. Hunter Waite",
      "Naoki Watanabe",
      "Lucy M. Ziurys"
    ],
    "publication_date": "2018-06-06T09:49:52Z",
    "arxiv_id": "http://arxiv.org/abs/1806.02093v1",
    "download_url": "http://arxiv.org/abs/1806.02093v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Strong Coupling of Light to Collective Terahertz Vibrations in Organic\n  Materials",
    "abstract": "Several years ago, it was shown that strong coupling between an electronic\ntransition in organic molecules and a resonant photonic structure can modify\nthe electronic landscape of the molecules and affect their chemical behavior.\nSince then, this new concept has evolved into a new field known as polaritonic\nchemistry, which employs strong coupling as a new tool for controlling material\nproperties and molecular chemistry. An important ingredient in the progress of\nthis field was the recent demonstration of strong coupling of molecular\nvibrations to mid-infrared resonators, which enabled the modification of\nchemical processes occurring at the electronic ground-state of materials. Here\nwe demonstrate for the first time strong coupling with collective,\nintermolecular vibrations occurring in organic materials in the Terahertz\nfrequency region. Using a tunable, open-cavity geometry, we measure the\ntemporal evolution and observe coherent Rabi oscillations, corresponding to a\nsplitting of 68 GHz and approaching the ultra-strong coupling regime. These\nresults take strong light-matter coupling into a new class of materials,\nincluding polymers, proteins and other organic materials, in which collective,\nspatially extended degrees of freedom participate in the dynamics.",
    "authors": [
      "Ran Damari",
      "Omri Weinberg",
      "Natalia Demina",
      "Daniel Krotkov",
      "Katherine Akulov",
      "Adina Golombek",
      "Tal Schwartz",
      "Sharly Fleischer"
    ],
    "publication_date": "2019-01-08T19:51:25Z",
    "arxiv_id": "http://arxiv.org/abs/1901.02487v2",
    "download_url": "http://arxiv.org/abs/1901.02487v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic chemistry in the first phases of Solar-type protostars",
    "abstract": "Planetary systems such as our own are formed after a long process where\nmatter condenses from diffuse clouds to stars, planets, asteroids, comets and\nresidual dust, undergoing dramatic changes in physical and chemical state in\nless than a few million years. Several studies have shown that the chemical\ncomposition during the early formation of a Solar-type planetary system is a\npowerful diagnostic to track the history of the system itself. Among the\napproximately 270 molecules so far detected in the ISM, the so-called\ninterstellar complex organic molecules (iCOMs) are of particular interest both\nbecause of their evolutionary diagnostic power and because they might be\npotential precursors of biomolecules, which are at the basis of terrestrial\nlife. This Chapter focuses on the evolution of organic molecules during the\nearly stages of a Solar-type planetary system, represented by the prestellar,\nClass 0/I and protoplanetary disk phases, and compares them with what is\nobserved presently in Solar System comets. Our twofold goal is to review the\nprocesses at the base of organic chemistry during Solar-type star formation\nand, in addition, to possibly provide constraints on the early history of our\nown planetary system.",
    "authors": [
      "C. Ceccarelli",
      "C. Codella",
      "N. Balucani",
      "D. Bockelée-Morvan",
      "E. Herbst",
      "C. Vastel",
      "P. Caselli",
      "C. Favre",
      "B. Lefloch",
      "K. Öberg"
    ],
    "publication_date": "2022-06-27T13:04:47Z",
    "arxiv_id": "http://arxiv.org/abs/2206.13270v2",
    "download_url": "http://arxiv.org/abs/2206.13270v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Shock Synthesis of Organic Molecules by Meteoroids in the Atmosphere of\n  Titan",
    "abstract": "Thermochemical modeling and shock-tube experiments show that shocks applied\nto N$_2$/CH$_4$ gas mixtures can synthesize organic molecules. Sufficiently\nlarge, hypersonic meteoroids entering the atmosphere of Saturn's moon Titan\nshould therefore drive organic chemistry. To do so meteoroids must be\nsufficiently large compared to the atmospheric mean free path at a given\naltitude to generate shocks, and deposit enough energy per path length to\nproduce temperatures high enough to excite and dissociate the relevant\nmolecules. The Cassini spacecraft imaged multiple meteoroid impacts on Saturn's\nrings, allowing for the first time an empirical estimate to be made of the flux\nand size-frequency distributions of meteoroids in the millimeter-to-meter size\nrange. We combine these results with an atmospheric entry model and\nthermochemical and experimental shock production efficiencies for N$_2$/CH$_4$\natmospheres and calculate the shock production rates for HCN, C$_2$H$_2$, and\nC$_2$H$_4$ as well as the resulting H$_2$ generation. We find that meteoroids\nmay be producing these molecules at as much as $\\sim$1% the production rate of\nphotochemistry driven by UV photons, and may be depositing more energy than\nmagnetospheric ions and 90-100 nm UV photons. Moreover, these meteoroids\nproduce these organic molecules hundreds of kilometers lower in Titan's\natmosphere than the relevant UV photons and magnetospheric ions penetrate, with\npeak production occurring between 200 and 500 km altitudes, i.e., at the\nobserved haze layer. Meteoroid-driven shock generation of molecules may\ntherefore be crucial to understanding Titan's atmospheric chemistry.",
    "authors": [
      "Erin E. Flowers",
      "Christopher F. Chyba"
    ],
    "publication_date": "2023-07-18T14:43:39Z",
    "arxiv_id": "http://arxiv.org/abs/2307.10293v1",
    "download_url": "http://arxiv.org/abs/2307.10293v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemical modelling of dust-gas chemistry within AGB outflows III.\n  Photoprocessing of the ice and return to the ISM",
    "abstract": "To explain the properties of dust in the interstellar medium (ISM), the\npresence of a refractory organic mantle is necessary. The outflows of AGB stars\nare among the main contributors of stellar dust to the ISM. We present the\nfirst study of the refractory organic contribution of AGB stars to the ISM.\nBased on laboratory experiments, we included a new reaction in our extended\nchemical kinetics model: the photoprocessing of volatile complex ices into\ninert refractory organic material. The refractory organic feedback of AGB\noutflows to the ISM is estimated using observationally motivated parent species\nand grids of models of C-rich and O-rich outflows. Refractory organic material\nis mainly inherited from the gas phase through accretion onto the dust and\nsubsequent photoprocessing. Grain-surface chemistry, initiated by\nphotodissociation of ices, produces only a minor part and takes place in a\nsub-monolayer regime in almost all outflows. The formation of refractory\norganic material increases with outflow density and depends on the initial\ngas-phase composition. While O-rich dust is negligibly covered by refractory\norganics, C-rich dust has an average coverage of $3-9\\%$, but can be as high as\n$8-22\\%$. Although C-rich dust does not enter the ISM bare, its average\ncoverage is too low to influence its evolution in the ISM or significantly\ncontribute to the coverage of interstellar dust. This study opens up questions\non the coverage of other dust-producing environments. It highlights the need\nfor an improved understanding of dust formation and for models specific to\ndensity structures within the outflow.",
    "authors": [
      "M. Van de Sande",
      "C. Walsh",
      "T. J. Millar"
    ],
    "publication_date": "2020-11-23T17:17:49Z",
    "arxiv_id": "http://arxiv.org/abs/2011.11563v1",
    "download_url": "http://arxiv.org/abs/2011.11563v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular Line Observations of the SiO Maser Source IRAS 19312+1950",
    "abstract": "IRAS 19312+1950 is a unique SiO maser source, exhibiting a rich set of\nmolecular radio lines, although SiO maser sources are usually identified as\noxygen-rich evolved stars, in which chemistry is relatively simple comparing\nwith carbon-rich environments. The rich chemistry of IRAS 19312+1950 has raised\na problem in circumstellar chemistry if this object is really an oxygen-rich\nevolved star, but its evolutional status is still controversial. In this paper,\nwe briefly review the previous observations of IRAS 19312+1950, as well as\npresenting preliminary results of recent VLBI observations in maser lines.",
    "authors": [
      "Jun-ichi Nakashima",
      "Shuji Deguchi",
      "Hiroshi Imai",
      "Athol Kemball"
    ],
    "publication_date": "2008-02-28T06:49:13Z",
    "arxiv_id": "http://arxiv.org/abs/0802.4132v1",
    "download_url": "http://arxiv.org/abs/0802.4132v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry in protoplanetary disks (short review in Russian)",
    "abstract": "(English) In this lecture I discuss recent progress in the understanding of\nthe chemical evolution of protoplanetary disks that resemble our Solar system\nduring the first ten million years. At the verge of planet formation, strong\nvariations of temperature, density, and radiation intensities in these disks\nlead to a layered chemical structure. In hot, dilute and heavily irradiated\natmosphere only simple radicals, atoms, and atomic ions can survive, formed and\ndestroyed by gas-phase processes. Beneath the atmosphere a partly UV-shielded,\nwarm molecular layer is located, where high-energy radiation drives rich\nchemistry, both in the gas phase and on dust surfaces. In a cold, dense, dark\ndisk midplane many molecules are frozen out, forming thick icy mantles where\nsurface chemistry is active and where complex (organic) species are\nsynthesized.",
    "authors": [
      "Dmitry A. Semenov"
    ],
    "publication_date": "2012-02-24T17:20:10Z",
    "arxiv_id": "http://arxiv.org/abs/1202.5505v1",
    "download_url": "http://arxiv.org/abs/1202.5505v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Big Data meets Quantum Chemistry Approximations: The $Δ$-Machine\n  Learning Approach",
    "abstract": "Chemically accurate and comprehensive studies of the virtual space of all\npossible molecules are severely limited by the computational cost of quantum\nchemistry. We introduce a composite strategy that adds machine learning\ncorrections to computationally inexpensive approximate legacy quantum methods.\nAfter training, highly accurate predictions of enthalpies, free energies,\nentropies, and electron correlation energies are possible, for significantly\nlarger molecular sets than used for training. For thermochemical properties of\nup to 16k constitutional isomers of C$_7$H$_{10}$O$_2$ we present numerical\nevidence that chemical accuracy can be reached. We also predict electron\ncorrelation energy in post Hartree-Fock methods, at the computational cost of\nHartree-Fock, and we establish a qualitative relationship between molecular\nentropy and electron correlation. The transferability of our approach is\ndemonstrated, using semi-empirical quantum chemistry and machine learning\nmodels trained on 1 and 10\\% of 134k organic molecules, to reproduce enthalpies\nof all remaining molecules at density functional theory level of accuracy.",
    "authors": [
      "Raghunathan Ramakrishnan",
      "Pavlo O. Dral",
      "Matthias Rupp",
      "O. Anatole von Lilienfeld"
    ],
    "publication_date": "2015-03-17T10:46:08Z",
    "arxiv_id": "http://arxiv.org/abs/1503.04987v1",
    "download_url": "http://arxiv.org/abs/1503.04987v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Colorful Chemical Bottle Experiment Kit: From School Laboratory To\n  Public Demonstration",
    "abstract": "The blue bottle experiment was first introduced to the chemical education\nliterature as a simple demonstration on kinetics. Its original formulation\ncontains only glucose, NaOH and small amount of methylene blue. The solution\nturns blue when shaken and fades to colorless upon standing. This\nbluing/de-bluing cycle may be repeated and may be compared to blood colors in\nanimal's respiratory cycle. Inspired by the blue bottle experiment, the\ncolorful chemical bottle experiment kit was commercially developed in 2006. The\nkit is a versatile pedagogical tool, not only for physical chemistry but also\nfor analytical, biological and organic chemistry. It also helps teaching\nconcepts in scientific method and laboratory safety. This manuscript contains\nfour parts, brief review on literature relating to the blue bottle experiment,\ndescription of the colorful chemical bottle experiment kit, pedagogical\ndiscussion of the experiments and preliminary evaluation from students.",
    "authors": [
      "Taweetham Limpanuparb",
      "Suphattra Hsu"
    ],
    "publication_date": "2015-04-10T09:33:13Z",
    "arxiv_id": "http://arxiv.org/abs/1504.02604v1",
    "download_url": "http://arxiv.org/abs/1504.02604v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Modeling C-Shock Chemistry in Isolated Molecular Outflows",
    "abstract": "Shocks are a crucial probe for understanding the ongoing chemistry within\nices on interstellar dust grains where many complex organic molecules (COMs)\nare believed to be formed. However, previous work has been limited to the\ninitial liberation into the gas phase through non-thermal desorption processes\nsuch as sputtering. Here, we present results from the adapted three-phase\ngas-grain chemical network code NAUTILUS, with the inclusion of additional\nhigh-temperature reactions, non-thermal desorption, collisional dust heating,\nand shock-physics parameters. This enhanced model is capable of reproducing\nmany of the molecular distributions and abundance ratios seen in our prior\nobservations of the prototypical shocked-outflow L1157. In addition, we find\nthat, among others, NH$_2$CHO, HCOOCH$_3$, and CH$_3$CHO have significant\npost-shock chemistry formation routes that differ from those of many other COMs\nobserved in shocks. Finally, a number of selected species and phenomena are\nstudied here with respect to their usefulness as shock tracers in various\nastrophysical sources.",
    "authors": [
      "Andrew M. Burkhardt",
      "Christopher N. Shingledecker",
      "Romane Le Gal",
      "Brett A. McGuire",
      "Anthony J. Remijan",
      "Eric Herbst"
    ],
    "publication_date": "2019-06-20T17:58:56Z",
    "arxiv_id": "http://arxiv.org/abs/1906.08774v1",
    "download_url": "http://arxiv.org/abs/1906.08774v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Alchemy: A Quantum Chemistry Dataset for Benchmarking AI Models",
    "abstract": "We introduce a new molecular dataset, named Alchemy, for developing machine\nlearning models useful in chemistry and material science. As of June 20th 2019,\nthe dataset comprises of 12 quantum mechanical properties of 119,487 organic\nmolecules with up to 14 heavy atoms, sampled from the GDB MedChem database. The\nAlchemy dataset expands the volume and diversity of existing molecular\ndatasets. Our extensive benchmarks of the state-of-the-art graph neural network\nmodels on Alchemy clearly manifest the usefulness of new data in validating and\ndeveloping machine learning models for chemistry and material science. We\nfurther launch a contest to attract attentions from researchers in the related\nfields. More details can be found on the contest website\n\\footnote{https://alchemy.tencent.com}. At the time of benchamrking experiment,\nwe have generated 119,487 molecules in our Alchemy dataset. More molecular\nsamples are generated since then. Hence, we provide a list of molecules used in\nthe reported benchmarks.",
    "authors": [
      "Guangyong Chen",
      "Pengfei Chen",
      "Chang-Yu Hsieh",
      "Chee-Kong Lee",
      "Benben Liao",
      "Renjie Liao",
      "Weiwen Liu",
      "Jiezhong Qiu",
      "Qiming Sun",
      "Jie Tang",
      "Richard Zemel",
      "Shengyu Zhang"
    ],
    "publication_date": "2019-06-22T10:27:00Z",
    "arxiv_id": "http://arxiv.org/abs/1906.09427v1",
    "download_url": "http://arxiv.org/abs/1906.09427v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "BERT Learns (and Teaches) Chemistry",
    "abstract": "Modern computational organic chemistry is becoming increasingly data-driven.\nThere remain a large number of important unsolved problems in this area such as\nproduct prediction given reactants, drug discovery, and metric-optimized\nmolecule synthesis, but efforts to solve these problems using machine learning\nhave also increased in recent years. In this work, we propose the use of\nattention to study functional groups and other property-impacting molecular\nsubstructures from a data-driven perspective, using a transformer-based model\n(BERT) on datasets of string representations of molecules and analyzing the\nbehavior of its attention heads. We then apply the representations of\nfunctional groups and atoms learned by the model to tackle problems of\ntoxicity, solubility, drug-likeness, and synthesis accessibility on smaller\ndatasets using the learned representations as features for graph convolution\nand attention models on the graph structure of molecules, as well as\nfine-tuning of BERT. Finally, we propose the use of attention visualization as\na helpful tool for chemistry practitioners and students to quickly identify\nimportant substructures in various chemical properties.",
    "authors": [
      "Josh Payne",
      "Mario Srouji",
      "Dian Ang Yap",
      "Vineet Kosaraju"
    ],
    "publication_date": "2020-07-11T00:23:07Z",
    "arxiv_id": "http://arxiv.org/abs/2007.16012v1",
    "download_url": "http://arxiv.org/abs/2007.16012v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Influence of shear rate and surface chemistry on thrombus formation in\n  micro-crevice",
    "abstract": "Thromboembolic complications remain a central issue in management of patients\non mechanical circulatory support. Despite the best practices employed in\ndesign and manufacturing of modern ventricular assist devices, complexity and\nmodular nature of these systems often introduces internal steps and crevices in\nthe flow path which can serve as nidus for thrombus formation. Thrombotic\npotential is influenced by multiple factors including the characteristics of\nthe flow and surface chemistry of the biomaterial. This study explored these\nelements in the setting of blood flow over a micro-crevice using a\nmulti-constituent numerical model of thrombosis. The simulations reproduced the\nplatelet deposition patterns observed experimentally and elucidated the role of\nflow, shear rate, and surface chemistry in shaping the deposition. The results\noffer insights for design and operation of blood-contacting devices.",
    "authors": [
      "Mansur Zhussupbekov",
      "Wei-Tao Wu",
      "Megan A. Jamiolkowski",
      "Mehrdad Massoudi",
      "James F. Antaki"
    ],
    "publication_date": "2020-11-20T18:55:21Z",
    "arxiv_id": "http://arxiv.org/abs/2011.10560v3",
    "download_url": "http://arxiv.org/abs/2011.10560v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Role of Ultraviolet Photons in Circumstellar Astrochemistry",
    "abstract": "Stars with masses between 1 and 8 solar masses (M$_\\odot$) lose large amounts\nof material in the form of gas and dust in the late stages of stellar\nevolution, during their Asymptotic Giant Branch phase. Such stars supply up to\n35% of the dust in the interstellar medium and thus contribute to the material\nout of which our solar system formed. In addition, the circumstellar envelopes\nof these stars are sites of complex, organic chemistry with over 80 molecules\ndetected in them. We show that internal ultraviolet photons, either emitted by\nthe star itself or from a close-in, orbiting companion, can significantly alter\nthe chemistry that occurs in the envelopes particularly if the envelope is\nclumpy in nature. At least for the cases explored here, we find that the\npresence of a stellar companion, such as a white dwarf star, the high flux of\nUV photons destroys H$_2$O in the inner regions of carbon-rich AGB stars to\nlevels below those observed and produces species such as C$^+$ deep in the\nenvelope in contrast to the expectations of traditional descriptions of\ncircumstellar chemistry.",
    "authors": [
      "T. J. Millar"
    ],
    "publication_date": "2020-12-29T11:52:17Z",
    "arxiv_id": "http://arxiv.org/abs/2012.14715v1",
    "download_url": "http://arxiv.org/abs/2012.14715v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Improved decision making with similarity based machine learning:\n  Applications in chemistry",
    "abstract": "Despite the fundamental progress in autonomous molecular and materials\ndiscovery, data scarcity throughout chemical compound space still severely\nhampers the use of modern ready-made machine learning models as they rely\nheavily on the paradigm, 'the bigger the data the better'. Presenting\nsimilarity based machine learning (SML), we show an approach to select data and\ntrain a model on-the-fly for specific queries, enabling decision making in data\nscarce scenarios in chemistry. By solely relying on query and training data\nproximity to choose training points, only a fraction of data is necessary to\nconverge to competitive performance. After introducing SML for the harmonic\noscillator and the Rosenbrock function, we describe applications to scarce data\nscenarios in chemistry which include quantum mechanics based molecular design\nand organic synthesis planning. Finally, we derive a relationship between the\nintrinsic dimensionality and volume of feature space, governing the overall\nmodel accuracy.",
    "authors": [
      "Dominik Lemm",
      "Guido Falk von Rudorff",
      "O. Anatole von Lilienfeld"
    ],
    "publication_date": "2022-05-11T17:04:26Z",
    "arxiv_id": "http://arxiv.org/abs/2205.05633v6",
    "download_url": "http://arxiv.org/abs/2205.05633v6",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum machine learning using atom-in-molecule-based fragments selected\n  on-the-fly",
    "abstract": "First principles based exploration of chemical space deepens our\nunderstanding of chemistry, and might help with the design of new materials or\nexperiments. Due to the computational cost of quantum chemistry methods and the\nimmens number of theoretically possible stable compounds comprehensive\nin-silico screening remains prohibitive. To overcome this challenge, we combine\natoms-in-molecules based fragments, dubbed \"amons\" (A), with active learning in\ntransferable quantum machine learning (ML) models. The efficiency, accuracy,\nscalability, and transferability of resulting AML models is demonstrated for\nimportant molecular quantum properties, such as energies, forces, atomic\ncharges NMR shifts, polarizabilities, and for systems ranging from organic\nmolecules over 2D materials and water clusters to Watson-Crick DNA base-pairs\nand even ubiquitin. Conceptually, the AML approach extends Mendeleev's table to\neffectively account for chemical environments, which allows the systematic\nreconstruction of many chemistries from local building blocks.",
    "authors": [
      "Bing Huang",
      "O. Anatole von Lilienfeld"
    ],
    "publication_date": "2017-07-13T14:31:47Z",
    "arxiv_id": "http://arxiv.org/abs/1707.04146v5",
    "download_url": "http://arxiv.org/abs/1707.04146v5",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On-Surface Synthesis of Silole and Disilacyclooctaene Derivatives",
    "abstract": "Sila-cyclic rings are a class of organosilicon cyclic compounds and have\nabundant application in organic chemistry and materials science. However, it is\nstill challenging to synthesize compounds with sila-cyclic rings in solution\nchemistry due to their low solubility and high reactivity. Recently, on-surface\nsynthesis was introduced into organosilicon chemistry as 1,4- disilabenzene\nbridged nanostructures were obtained via coupling between bromo-substituted\nmolecules and silicon atoms on Au(111). Here, we extend this strategy for\nsyntheses of silole derivatives and graphene nanoribbons with eight-membered\nsila-cyclic rings from 2,2',6,6'- tetrabromobiphenyl and\n1,4,5,8-tetrabromonaphthalene on Au(111), respectively. Their structures and\nelectronic properties were investigated by a combination of scanning tunneling\nmicroscopy/spectroscopy and density functional theory calculations. This work\ndemonstrates a generality of this synthesis strategy to fabricate various\nsilicon incorporated nanostructures.",
    "authors": [
      "Kewei Sun",
      "Lauri Kurki",
      "Orlando J. Silveira",
      "Tomohiko Nishiuchi",
      "Takashi Kubo",
      "Ondřej Krejčí",
      "Adam S. Foster",
      "Shigeki Kawai"
    ],
    "publication_date": "2023-12-19T08:57:33Z",
    "arxiv_id": "http://arxiv.org/abs/2312.11959v1",
    "download_url": "http://arxiv.org/abs/2312.11959v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "First detection of gas-phase methanol in a protoplanetary disk",
    "abstract": "The first detection of gas-phase methanol in a protoplanetary disk (TW Hya)\nis presented. In addition to being one of the largest molecules detected in\ndisks to date, methanol is also the first disk organic molecule with an\nunambiguous ice chemistry origin. The stacked methanol emission, as observed\nwith ALMA, is spectrally resolved and detected across six velocity channels\n($>3 \\sigma$), reaching a peak signal-to-noise of $5.5\\sigma$, with the\nkinematic pattern expected for TW~Hya. Using an appropriate disk model, a\nfractional abundance of $3\\times 10^{-12} - 4 \\times 10^{-11}$ (with respect to\nH$_2$) reproduces the stacked line profile and channel maps, with the favoured\nabundance dependent upon the assumed vertical location (midplane versus\nmolecular layer). The peak emission is offset from the source position\nsuggesting that the methanol emission has a ring-like morphology: the analysis\nhere suggests it peaks at $\\approx 30$~AU reaching a column density $\\approx\n3-6\\times10^{12}$~cm$^{-2}$. In the case of TW Hya, the larger (up to mm-sized)\ngrains, residing in the inner 50~AU, may thus host the bulk of the disk ice\nreservoir. The successful detection of cold gas-phase methanol in a\nprotoplanetary disk implies that the products of ice chemistry can be explored\nin disks, opening a window to studying complex organic chemistry during\nplanetary system formation.",
    "authors": [
      "Catherine Walsh",
      "Ryan A. Loomis",
      "Karin I. Oberg",
      "Mihkel Kama",
      "Merel L. R. van 't Hoff",
      "Tom J. Millar",
      "Yuri Aikawa",
      "Eric Herbst",
      "Susanna L. Widicus Weaver",
      "Hideko Nomura"
    ],
    "publication_date": "2016-06-21T09:25:35Z",
    "arxiv_id": "http://arxiv.org/abs/1606.06492v1",
    "download_url": "http://arxiv.org/abs/1606.06492v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Aromatics and Cyclic Molecules in Molecular Clouds: A New Dimension of\n  Interstellar Organic Chemistry",
    "abstract": "Astrochemistry lies at the nexus of astronomy, chemistry, and molecular\nphysics. On the basis of precise laboratory data, a rich collection of more\nthan 200 familiar and exotic molecules have been identified in the interstellar\nmedium, the vast majority by their unique rotational fingerprint. Despite this\nlarge body of work, there is scant evidence in the radio band for the basic\nbuilding blocks of chemistry on earth -- five and six-membered rings -- despite\nlong standing and sustained efforts during the past 50 years. In contrast, a\npeculiar structural motif, highly unsaturated carbon in a chain-like\narrangement, is instead quite common in space. The recent astronomical\ndetection of cyanobenzene, the simplest aromatic nitrile, in the dark molecular\ncloud TMC-1, and soon afterwards in additional pre-stellar, and possibly\nprotostellar sources, establishes that aromatic chemistry is likely widespread\nin the earliest stages of star formation. The subsequent discovery of\ncyanocyclopentadienes and even cyanonapthlenes in TMC-1 provides further\nevidence that organic molecules of considerable complexity are readily\nsynthesized in regions with high visual extinction but where the low\ntemperature and pressure are remarkably low. This review focuses on laboratory\nefforts now underway to understand the rich transition region between linear\nand planar carbon structures using microwave spectroscopy. We present key\nfeatures, advantages, and disadvantages of current detection methods, a\ndiscussion of the types of molecules found in space and in the laboratory, and\napproaches under development to identify entirely new species in complex\nmixtures. Studies focusing on the cyanation of hydrocarbons and the formation\nof benzene from acyclic precursors are highlighted, as is the role that\nisotopic studies might play in elucidating the chemical pathways to ring\nformation.",
    "authors": [
      "Michael C. McCarthy",
      "Brett A. McGuire"
    ],
    "publication_date": "2021-03-17T12:53:21Z",
    "arxiv_id": "http://arxiv.org/abs/2103.09608v1",
    "download_url": "http://arxiv.org/abs/2103.09608v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formation of complex organic molecules in hot molecular cores through\n  nondiffusive grain-surface and ice-mantle chemistry",
    "abstract": "A new, more comprehensive model of gas-grain chemistry in hot molecular cores\nis presented, in which nondiffusive reaction processes on dust-grain surfaces\nand in ice mantles are implemented alongside traditional diffusive\nsurface/bulk-ice chemistry. We build on our nondiffusive treatments used for\nchemistry in cold sources, adopting a standard collapse/warm-up physical model\nfor hot cores. A number of other new chemical model inputs and treatments are\nalso explored in depth, culminating in a final model that demonstrates\nexcellent agreement with gas-phase observational abundances for many molecules,\nincluding some (e.g. methoxymethanol) that could not be reproduced by\nconventional diffusive mechanisms. Observed ratios of structural isomers methyl\nformate, glycolaldehyde and acetic acid are well reproduced by the models. The\nmain temperature regimes are identified in which various complex organic\nmolecules (COMs) are formed. Nondiffusive chemistry advances the production of\nmany COMs to much earlier times and lower temperatures than in previous model\nimplementations. Those species may form either as by-products of simple-ice\nproduction, or via early photochemistry within the ices while external UV\nphotons can still penetrate. Cosmic ray-induced photochemistry is less\nimportant than in past models, although it affects some species strongly over\nlong timescales. Another production regime occurs during the high-temperature\ndesorption of solid water, whereby radicals trapped in the ice are released\nonto the grain/ice surface, where they rapidly react. Several recently-proposed\ngas-phase COM-production mechanisms are also introduced, but they rarely\ndominate. New surface/ice reactions involving CH and CH$_2$ are found to\ncontribute substantially to the formation of certain COMs.",
    "authors": [
      "Robin T. Garrod",
      "Mihwa Jin",
      "Kayla A. Matis",
      "Dylan Jones",
      "Eric R. Willis",
      "Eric Herbst"
    ],
    "publication_date": "2021-10-19T05:23:59Z",
    "arxiv_id": "http://arxiv.org/abs/2110.09743v2",
    "download_url": "http://arxiv.org/abs/2110.09743v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Testing grain-surface chemistry in massive hot-core regions",
    "abstract": "A partial submillimeter line-survey was performed toward 7 high-mass young\nstellar objects (YSOs) aimed at detecting H2CO, CH3OH, CH2CO, CH3CHO, C2H5OH,\nHCOOH, HNCO and NH2CHO. In addition, other organic species such as CH3CN have\nbeen observed. The aim is to establish the chemical origin of a set of complex\norganic molecules thought to be produced by grain surface chemistry in high\nmass YSOs. Rotation temperatures and beam-averaged column densities are\ndetermined. Based on their rotation diagrams, molecules can be classified as\neither cold (<100 K) or hot (>100 K). This implies that complex organics are\npresent in at least two distinct regions. Furthermore, the abundances of the\nhot oxygen-bearing species are correlated, as are those of HNCO and NH2CHO.\nThis is suggestive of chemical relationships within, but not between, those two\ngroups of molecules. The most likely explanation for the observed correlations\nof the various hot molecules is that they are ``first generation'' species that\noriginate from solid-state chemistry. This includes H2CO, CH3OH, C2H5OH,\nHCOOCH3, CH3OCH3, HNCO, NH2CHO, and possibly CH3CN, and C2H5CN. The\ncorrelations between sources implies very similar conditions during their\nformation or very similar doses of energetic processing. Cold species such as\nCH2CO, CH3CHO, and HCOOH, some of which are seen as ices along the same lines\nof sight, are probably formed in the solid state as well, but appear to be\ndestroyed at higher temperatures. A low level of non-thermal desorption by\ncosmic rays can explain their low rotation temperatures and relatively low\nabundances in the gas phase compared to the solid state. The CH3CCH abundances\ncan be fully explained by low temperature gas phase chemistry. No cold\nN-containing molecules are found.",
    "authors": [
      "S. E. Bisschop",
      "J. K. Jorgensen",
      "E. F. van Dishoeck",
      "E. B. M. de Wachter"
    ],
    "publication_date": "2007-02-02T12:24:03Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0702066v2",
    "download_url": "http://arxiv.org/abs/astro-ph/0702066v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Parsec scales of carbon chain and complex organic molecules in AFGL 2591\n  and IRAS 20126",
    "abstract": "(Abridged) There is a diverse chemical inventory in protostellar regions\nleading to the classification of extreme types of systems. Warm carbon chain\nchemistry sources, for one, are the warm and dense regions near a protostar\ncontaining unsaturated carbon chain molecules. Since the presentation of this\ndefinition in 2008, there is a growing field to detect and characterise these\nsources. The details are lesser known in relation to hot cores and in high-mass\nstar-forming regions -- regions of great importance in galactic evolution. To\ninvestigate the prevalence of carbon chain species and their environment in\nhigh-mass star-forming regions, we have conducted targeted spectral surveys of\ntwo sources in the direction of Cygnus X -- AFGL 2591 and IRAS 20126+4104 --\nwith the Green Bank Telescope and the IRAM 30m Telescope. We have constructed a\nLocal Thermodynamic Equilibrium (LTE) model using the observed molecular\nspectra to determine the physical environment in which these molecules\noriginate. We map both the observed spatial distribution and the physical\nparameters found from the LTE model. We also determine the formation routes of\nthese molecules in each source using the three-phase NAUTILUS chemical\nevolution code. We detect several lines of propyne, CH$_3$CCH, and\ncyclopropenylidene, $c$-C$_3$H$_2$ as tracers of carbon chain chemistry, as\nwell as several lines of formaldehyde, H$_2$CO, and methanol, CH$_3$OH, as a\nprecursor and a tracer of complex organic molecule chemistry, respectively. We\nfind excitation temperatures of 20-30 K for the carbon chains and 8-85 K for\nthe complex organics. The CH$_3$CCH abundances are reproduced by a warm-up\nmodel, consistent with warm carbon chain chemistry, while the observed CH$_3$OH\nabundances require a shock mechanism sputtering the molecules into the gas\nphase.",
    "authors": [
      "P. Freeman",
      "S. Bottinelli",
      "R. Plume",
      "E. Caux",
      "C. Monaghan",
      "B. Mookerjea"
    ],
    "publication_date": "2023-08-18T14:23:44Z",
    "arxiv_id": "http://arxiv.org/abs/2308.09584v1",
    "download_url": "http://arxiv.org/abs/2308.09584v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Near-perfect conduction through a ferrocene-based molecular wire",
    "abstract": "Here we describe the design, single-molecule transport measurements, and\ntheoretical modeling of a ferrocene-based organometallic molecular wire, whose\nbias-dependent conductance shows a clear Lorentzian form with magnitude\nexceeding 70% of the conductance quantum G_0. We attribute this unprecedented\nlevel of single-molecule conductance to a manifestation of the low-lying\nmolecular resonance and extended orbital network long-predicted for a\nconjugated organic system. A similar-in-length, all-organic conjugated\nphenylethynyl oligomer molecular framework shows much lower conductance.",
    "authors": [
      "Stephanie A. Getty",
      "Chaiwat Engtrakul",
      "Lixin Wang",
      "Rui Liu",
      "San-Huang Ke",
      "Harold U. Baranger",
      "Weitao Yang",
      "Michael. S. Fuhrer",
      "Lawrence R. Sita"
    ],
    "publication_date": "2004-09-16T19:14:31Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0409433v3",
    "download_url": "http://arxiv.org/abs/cond-mat/0409433v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Molecular processes from the AGB to the PN stage",
    "abstract": "Many complex organic molecules and inorganic solid-state compounds have been\nobserved in the circumstellar shell of stars (both C-rich and O-rich) in the\ntransition phase between Asymptotic Giant Branch (AGB) stars and Planetary\nNebulae (PNe). This short (~100-10.000 years) phase of stellar evolution\nrepresents a wonderful laboratory for astrochemistry and provides severe\nconstraints on any model of gas-phase and solid-state chemistry. One of the\nmajor challenges of present day astrophysics and astrochemistry is to\nunderstand the formation pathways of these complex organic molecules and\ninorganic solid-state compounds (e.g., polycyclic aromatic hydrocarbons,\nfullerenes, and graphene in the case of a C-rich chemistry and oxides and\ncrystalline silicates in O-rich environments) in space. In this review, I\npresent an observational review of the molecular processes in the late stages\nof stellar evolution with a special emphasis on the first detections of\nfullerenes and graphene in PNe.",
    "authors": [
      "D. A. Garcia-Hernandez"
    ],
    "publication_date": "2011-11-08T12:56:14Z",
    "arxiv_id": "http://arxiv.org/abs/1111.1890v1",
    "download_url": "http://arxiv.org/abs/1111.1890v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A radical route to interstellar propylene formation",
    "abstract": "Complex organic molecules, such as propylene (CH3CHCH2), are detected in\nmolecular clouds (such as TMC1) with high fractional abundances (~2.10^{-9},\nrelative to hydrogen) that cannot be explained by gas-phase chemical reactions\nunder normal dark cloud conditions. To obtain such high abundances requires an\nefficient grain-driven chemistry to be operating, coupled with effective\ndesorption of the complex organics back into the gas-phase. We propose that the\nmechanism that we have previously described; rapid high density gas-phase\nchemistry in the gas released following sudden, total, ice mantle sublimation -\ncan explain the high abundances, without recourse to ill-defined surface\nchemical pathways. Our model provides a natural explanation for why it is that\nsome sources harbour high abundances of propylene, whilst others do not; based\non the age and level of dynamical activity within the source (which affects the\nice composition) and the chemical composition of the ambient gas.",
    "authors": [
      "J. M. C. Rawlings",
      "D. A. Williams",
      "S. Viti",
      "C. Cecchi-Pestellini"
    ],
    "publication_date": "2013-08-12T13:51:56Z",
    "arxiv_id": "http://arxiv.org/abs/1308.2559v1",
    "download_url": "http://arxiv.org/abs/1308.2559v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Impact of Organic Friction Modifiers on Engine Oil Tribofilms",
    "abstract": "Organic friction modifiers (OFMs) are important additives in the lubrication\nof machines and especially of car engines where performance improvements are\nconstantly sought-after. Together with zinc dialkyldithiophosphates (ZDDPs)\nantiwear additives, OFMs have a predominant impact on the tribological\nbehaviour of the lubricant. In the current study, the influence of OFMs on the\ngeneration, tribological properties and chemistry of ZDDP tribofilms has been\ninvestigated by combining tribological experiments (MTM) with in-situ film\nthickness measurements through optical interference imaging (SLIM), Alicona\nprofilometry and X-ray photoelectron spectroscopy. OFMs and antiwear additives\nhave been found to competitively react/adsorb on the rubbing ferrous substrates\nin a tribological contact. The formation and removal (through wear) of\ntribofilms are dynamic processes which result from the simultaneous interaction\nof these two additives with the surface of the wear track. By carefully\nselecting the chemistry of OFMs, the formulator can achieve lubricants that\ngenerate ZDDP antiwear films of optimum thickness, morphology and friction\naccording to the application-specific requirements.",
    "authors": [
      "Monica Ratoi",
      "Vlad Bogdan Niste",
      "Husam Alghawel",
      "Yat Fan Suen",
      "Kenneth Nelson"
    ],
    "publication_date": "2013-10-28T17:49:38Z",
    "arxiv_id": "http://arxiv.org/abs/1310.7510v1",
    "download_url": "http://arxiv.org/abs/1310.7510v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Redox chemistry and metal-insulator transitions intertwined in a\n  nano-porous material",
    "abstract": "Metal organic frameworks are nano porous adsorbents of relevance to gas\nseparation and catalysis, and O2 separation from air is essential to diverse\nindustrial applications. A metal organic framework Fe2(DOBDC), also known as a\nMOF74, can selectively adsorb O2 in a manner that defies the classical picture:\nAdsorption sites either do or do not share electrons over a long range. This\nreport proposes, and then justifies phenomenologically and computationally, a\nmechanism. Charge transfer mediated adsorption of an electron acceptor O2 in a\nquasi one dimensional (1D) electron donor semiconductor Fe2(DOBDC) drives and\nis driven by 1D metal insulator transitions that localize or delocalize the 1D\nelectrons. This mechanism agrees with the empirical evidence, and predicts a\nclass of nano porous semiconductors or metals and potential adsorbents and\ncatalysts in which chemistry and metal insulator transitions intertwine.",
    "authors": [
      "Sergey N. Maximoff",
      "Berend Smit"
    ],
    "publication_date": "2013-11-13T07:27:58Z",
    "arxiv_id": "http://arxiv.org/abs/1311.3035v2",
    "download_url": "http://arxiv.org/abs/1311.3035v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ANI-1: A data set of 20M off-equilibrium DFT calculations for organic\n  molecules",
    "abstract": "One of the grand challenges in modern theoretical chemistry is designing and\nimplementing approximations that expedite ab initio methods without loss of\naccuracy. Machine learning (ML), in particular neural networks, are emerging as\na powerful approach to constructing various forms of transferable atomistic\npotentials. They have been successfully applied in a variety of applications in\nchemistry, biology, catalysis, and solid-state physics. However, these models\nare heavily dependent on the quality and quantity of data used in their\nfitting. Fitting highly flexible ML potentials comes at a cost: a vast amount\nof reference data is required to properly train these models. We address this\nneed by providing access to a large computational DFT database, which consists\nof 20M conformations for 57,454 small organic molecules. We believe it will\nbecome a new standard benchmark for comparison of current and future methods in\nthe ML potential community.",
    "authors": [
      "Justin S. Smith",
      "Olexandr Isayev",
      "Adrian E. Roitberg"
    ],
    "publication_date": "2017-08-16T17:26:49Z",
    "arxiv_id": "http://arxiv.org/abs/1708.04987v4",
    "download_url": "http://arxiv.org/abs/1708.04987v4",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The complexity of Orion: an ALMA view III. The explosion impact",
    "abstract": "The chemistry of complex organic molecules in interstellar dark clouds is\nstill highly uncertain in part because of the lack of constraining\nobservations. Orion is the closest massive star-forming region, and\nobservations making use of ALMA allow us to separate the emission regions of\nvarious complex organic molecules (COMs) in both velocity and space. Orion also\nbenefits from an exceptional situation, in that it is the site of a powerful\nexplosive event that occurred 550 years ago. We show that the closely\nsurrounding Kleinmann-Low region has clearly been influenced by this explosion;\nsome molecular species have been pushed away from the densest parts while\nothers have remained in close proximity. This dynamical segregation reveals the\ntime dependence of the chemistry and, therefore allows us to better constrain\nthe formation sequence of COMs and other species, including deuterated\nmolecules.",
    "authors": [
      "L. Pagani",
      "E. Bergin",
      "P. F. Goldsmith",
      "G. Melnick",
      "R. Snell",
      "C. Favre"
    ],
    "publication_date": "2019-04-01T15:50:55Z",
    "arxiv_id": "http://arxiv.org/abs/1904.00921v1",
    "download_url": "http://arxiv.org/abs/1904.00921v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Investigating the Efficiency of Explosion Chemistry as a Source of\n  Complex Organic Molecules in TMC-1",
    "abstract": "Many species of complex organic molecules (COMs) have been observed in\nseveral astrophysical environments but it is not clear how they are produced,\nparticularly in cold, quiescent regions. One process that has been proposed as\na means to enhance the chemical complexity of the gas phase in such regions is\nthe explosion of the ice mantles of dust grains. In this process, a build up of\nchemical energy in the ice is released, sublimating the ices and producing a\nshort lived phase of high density, high temperature gas. The gas-grain chemical\ncode UCLCHEM has been modified to treat these explosions in order to model the\nobserved abundances of COMs towards the TMC-1 region. It is found that, based\non our current understanding of the explosion mechanism and chemical pathways,\nthe inclusion of explosions in chemical models is not warranted at this time.\nExplosions are not shown to improve the model's match to the observed\nabundances of simple species in TMC-1. Further, neither the inclusion of\nsurface diffusion chemistry, nor explosions, results in the production of COMs\nwith observationally inferred abundances.",
    "authors": [
      "Jonathan Holdship",
      "Jonathan Rawlings",
      "Serena Viti",
      "Nadia Balucani",
      "Dimitrios Skouteris",
      "David Williams"
    ],
    "publication_date": "2019-05-06T09:47:56Z",
    "arxiv_id": "http://arxiv.org/abs/1905.01901v1",
    "download_url": "http://arxiv.org/abs/1905.01901v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predator-Prey Interactions between Droplets Driven by Nonreciprocal Oil\n  Exchange",
    "abstract": "Chemotactic interactions are ubiquitous in nature and can lead to\nnonreciprocal and complex emergent behavior in multibody systems. Here we show\nhow chemotactic signaling between microscale oil droplets of different\nchemistries in micellar surfactant solutions can result in predator-prey-like\nchasing interactions. The interactions and dynamic self-organization result\nfrom the net directional, micelle-mediated transport of oil between emulsion\ndroplets of differing composition and are powered by the free energy of mixing.\nThe nonreciprocal behavior occurs in a wide variety of oil and surfactant\nconditions, and we systematically elucidate chemical design rules for tuning\nthe interactions between droplets by varying oil and surfactant chemical\nstructure and concentration. Through integration of experiment and simulation,\nwe also investigate the active behavior and dynamic reorganization of\nmulti-droplet clusters. Our findings demonstrate how chemically-minimal systems\ncan be designed with controllable, non-reciprocal chemotactic interactions to\ngenerate emergent self-organization and collective behaviors reminiscent of\nbiological systems.",
    "authors": [
      "Caleb H. Meredith",
      "Pepijn G. Moerman",
      "Jan Groenewold",
      "Yu-Jen Chiu",
      "Willem K. Kegel",
      "Alfons van Blaaderen",
      "Lauren D. Zarzar"
    ],
    "publication_date": "2019-12-20T21:15:22Z",
    "arxiv_id": "http://arxiv.org/abs/1912.10102v1",
    "download_url": "http://arxiv.org/abs/1912.10102v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cold CH radicals for laser cooling and trapping",
    "abstract": "Ultracold CH radicals promise a fruitful testbed for probing quantum-state\ncontrollable organic chemistry. In this work, we calculate CH vibrational\nbranching ratios (VBRs) and rotational branching ratios (RBRs) with ground\nstate mixing. We subsequently use these values to inform optical cycling\nproposals and consider two possible radiative cooling schemes using the\n$X^{2}\\Pi \\leftarrow A^{2}\\Delta$ and $X^{2}\\Pi \\leftarrow B^{2}\\Sigma^{-}$\ntransitions. As a first step towards laser cooled CH, we characterize the\neffective buffer gas cooling of this species and produce $\\sim5\\times10^{10}$\nCH molecules per pulse with a rotational temperature of 2(1) K and a\ntranslational temperature of 7(2) K. We also determine the CH-helium\ncollisional cross section to be $2.4(8)\\times10^{-14}$ cm$^{2}$. This value is\ncrucial to correctly account for collisional broadening and accurately extract\nthe in-cell CH density. These cold CH molecules mark an ideal starting point\nfor future laser cooling and trapping experiments and tests of cold organic\nchemistry.",
    "authors": [
      "J. C. Schnaubelt",
      "J. C. Shaw",
      "D. J. McCarron"
    ],
    "publication_date": "2021-09-08T22:32:38Z",
    "arxiv_id": "http://arxiv.org/abs/2109.03953v1",
    "download_url": "http://arxiv.org/abs/2109.03953v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Low-cost prediction of molecular and transition state partition\n  functions via machine learning",
    "abstract": "We have generated an open-source dataset of over 30000 organic chemistry gas\nphase partition functions. With this data, a machine learning deep neural\nnetwork estimator was trained to predict partition functions of unknown organic\nchemistry gas phase transition states. This estimator only relies on reactant\nand product geometries and partition functions. A second machine learning deep\nneural network was trained to predict partition functions of chemical species\nfrom their geometry. Our models accurately predict the logarithm of test set\npartition functions with a maximum mean absolute error of 2.7%. Thus, this\napproach provides a means to reduce the cost of computing reaction rate\nconstants ab initio. The models were also used to compute transition state\ntheory reaction rate constants prefactors and the results were in quantitative\nagreement with the corresponding ab initio calculations with an accuracy of\n98.3% on the log scale.",
    "authors": [
      "Evan Komp",
      "Stéphanie Valleau"
    ],
    "publication_date": "2022-03-05T00:28:26Z",
    "arxiv_id": "http://arxiv.org/abs/2203.02621v1",
    "download_url": "http://arxiv.org/abs/2203.02621v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A decatungstate-based Ionic liquid exhibiting very low dielectric\n  constant suitable for acting as solvent and catalyst for oxidation of organic\n  substrates",
    "abstract": "In this contribution, a new POM-based ionic liquid, namely\n(P6,6,6,14)4[W10O32], was fully characterized. Its viscosity and its very low\ndielectric constant make this hybrid ionic liquid suitable to be used as\nsolvent for organic transformations. As proof of concept, this unique ionic\nliquid combining solvant and catalyst properties was tested for catalytic\noxidation of various alcohols and alkenes in presence of H2O2",
    "authors": [
      "Yohan Martinetto",
      "Bruce Pégot",
      "Catherine Roch",
      "Mohamed Haouas",
      "Betty Cottyn",
      "Franck Camerel",
      "Jelena Jeftic",
      "Denis Morineau",
      "Emmanuel Magnier",
      "Sébastien Floquet"
    ],
    "publication_date": "2021-05-25T07:39:07Z",
    "arxiv_id": "http://arxiv.org/abs/2105.11714v1",
    "download_url": "http://arxiv.org/abs/2105.11714v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Acid Base Chemistry of Short Hydrogen Bonds: A Tale of Schrödinger's\n  Cat in Glutamine-Derived Crystals",
    "abstract": "Short hydrogen bonds (SHBs), defined by donor-acceptor distances below 2.5\nAngstrom, represent a distinct regime in acid-base chemistry where conventional\nmodels of hydrogen bonding break down. In an organic crystal formed via a\ntemperature-induced chemical transformation of L-glutamine, we previously\nidentified an SHB that is permissive to proton transfer, leading to a\ncharacteristic double-well potential implying an activated process. Herein,\nusing path-integral ab initio molecular dynamics (PI-AIMD), we show that\nnuclear quantum effects (NQEs) completely eliminate the classical barrier,\nleading to a symmetrization of the proton along the hydrogen bond. While in the\nclassical case the proton transfer is strongly coupled to the rocking modes of\nthe ammonium ion in the crystal, NQEs significantly reduce these correlations.\nExamining the electronic structure through Wannier centers (WCs) further\nreveals a quantum-driven redistribution of bonding electrons, blurring the\ndistinction between hydrogen bonding and covalency. Taken together, our\nfindings indicate that NQEs in this organic crystal lead to a situation where\nboth the donor and acceptor can simultaneously act as both an acid and a base.",
    "authors": [
      "Muhammad Nawaz Qaisrani",
      "Nandha Kumar",
      "Christian Dreßler",
      "Ralph Gebauer",
      "Ali Hassanali"
    ],
    "publication_date": "2025-05-13T18:35:33Z",
    "arxiv_id": "http://arxiv.org/abs/2505.08893v2",
    "download_url": "http://arxiv.org/abs/2505.08893v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cosmic dust as a prerequisite for the formation of complex organic\n  molecules in space?",
    "abstract": "In cold, dense astrophysical environments dust grains are mixed with\nmolecular ices. Chemistry in those dust/ice mixtures is determined by diffusion\nand reaction of molecules and radicals. However, investigations of diffusion of\nastrophysically relevant radicals and molecules across the surface and through\nthe pores of cosmic dust grains and of surface reactions consequent to such\ndiffusion is largely uncharted territory. This paper presents results of a\nstudy of a solid-state reaction of two molecular species, CO2 and NH3,\nseparated by a layer of porous silicate grain aggregates, analogues of cosmic\ndust. The experiments demonstrate that the presence of the dust layer was\nnecessary for a pure thermal CO2 + 2NH3 reaction to proceed, leading to the\nformation of ammonium carbamate (NH4+NH2COO-), an ionic solid containing a\ncomplex organic moiety of prebiotic interest recently detected in a\nprotoplanetary disk. This result speaks for: (i) efficient diffusion of\nmolecules on/within cosmic dust, (ii) an underestimated role for surface\ncatalysis in the astrochemistry of cosmic dust, and (iii) potentially efficient\ndust-promoted chemistry in warm cosmic environments, such as protostellar\nenvelopes and protoplanetary disks.",
    "authors": [
      "Alexey Potapov",
      "Kilian Pollok",
      "Falko Langenhorst",
      "Martin McCoustra",
      "Robin T. Garrod"
    ],
    "publication_date": "2025-09-16T11:20:51Z",
    "arxiv_id": "http://arxiv.org/abs/2509.12967v1",
    "download_url": "http://arxiv.org/abs/2509.12967v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Global impacts of organic aerosol acidity on sulfate and cloud formation",
    "abstract": "Organic aerosols (OA) comprise a major fraction of atmospheric particulate\nmatter and frequently contain acidic species, yet their contribution to overall\naerosol acidity has not been explicitly considered in global climate models. We\nimplement concentration-dependent OA acid dissociation, including recently\ndemonstrated surface-specific effects, into the ECHAM-HAMMOZ global climate\nmodel and assess the impacts on aqueous aerosol sulfate chemistry and\naerosol--cloud--climate interactions. We show that enhanced aerosol acidity\nfrom OA acid dissociation drives increased sulfate formation from aqueous-phase\noxidation of $\\mathrm{SO_2}$. The microphysics of additional secondary sulfate\naerosol changes global cloud droplet number concentrations (CDNC), with\nenhancements up to $13.9\\%$. Increased cloud formation leads to a significant\nglobal mean cooling effect with a shortwave cloud radiative forcing (SWCRF) up\nto $-0.97~\\mathrm{W\\,m^{-2}}$. We also find that surface-specific acid\ndissociation effects can further modify both aerosol chemistry and resulting\naerosol--cloud--climate responses, in some cases with even stronger impact than\nbulk acidity conditions. Our results demonstrate significant effects of\nconsidering OA acidity, as well as surface-specific phenomena, in global\nclimate models.",
    "authors": [
      "Gargi Sengupta",
      "Kunal Ghosh",
      "Prithvi R. Jallu",
      "Nønne L. Prisle"
    ],
    "publication_date": "2025-10-03T14:10:12Z",
    "arxiv_id": "http://arxiv.org/abs/2510.03030v1",
    "download_url": "http://arxiv.org/abs/2510.03030v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Experimental study of heterogeneous organic chemistry induced by far\n  ultraviolet light: Implications for growth of organic aerosols by CH3\n  addition in the atmospheres of Titan and early Earth",
    "abstract": "Formation of organic aerosols driven by photochemical reactions has been\nobserved and suggested in CH4-containing atmospheres, including Titan and early\nEarth. However the detailed production and growth mechanisms of organic\naerosols driven by solar far ultraviolet (FUV) light remain poorly constrained.\nWe conducted laboratory experiments simulating photochemical reactions in a\nCH4-CO2 atmosphere driven by the FUV radiations dominated by the Lyman-{\\alpha}\nline. In the experiments, we analyzed time variations in thickness and infrared\nspectra of solid organic film formed on an optical window in a reaction cell.\nGas species formed by FUV irradiation were also analyzed and compared with\nphotochemical model calculations. Our experimental results show that the growth\nrate of the organic film decreases as the CH4/CO2 ratio of reactant gas mixture\ndecreases, and that the decrease becomes very steep for CH4/CO2 < 1. Comparison\nwith photochemical model calculations suggests that polymerizations of\ngas-phase hydrocarbons, such as polyynes and aromatics, cannot account for the\ngrowth rate of the organic film but that the addition reaction of CH3 radicals\nonto the organic film with the reaction probability around 10-2 can explain the\ngrowth rate. At CH4/CO2 < 1, etching by O atom formed by CO2 photolysis would\nreduce or inhibit the growth of the organic film. Our results suggest that\norganic aerosols would grow through CH3 addition onto the surface during the\nprecipitation of aerosol particles in the middle atmosphere of Titan and early\nEarth. On Titan, effective CH3 addition would reduce C2H6 production in the\natmosphere. On early Earth, growth of aerosol particles would be less efficient\nthan those on Titan, possibly resulting in small-sized monomers and influencing\nUV shielding.",
    "authors": [
      "Peng K. Hong",
      "Yasuhito Sekine",
      "Tsutoni Sasamori",
      "Seiji Sugita"
    ],
    "publication_date": "2018-02-23T09:44:51Z",
    "arxiv_id": "http://arxiv.org/abs/1802.08458v1",
    "download_url": "http://arxiv.org/abs/1802.08458v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The large-scale organization of chemical reaction networks in\n  astrophysics",
    "abstract": "The large-scale organization of complex networks, both natural and\nartificial, has shown the existence of highly heterogeneous patterns of\norganization. Such patterns typically involve scale-free degree distributions\nand small world, modular architectures. One example is provided by chemical\nreaction networks, such as the metabolic pathways. The chemical reactions of\nthe Earth's atmosphere have also been shown to give rise to a scale-free\nnetwork. Here we present novel data analysis on the structure of several\nastrophysical networks including the chemistry of the planetary atmospheres and\nthe interstellar medium. Our work reveals that Earth's atmosphere displays a\nhierarchical organization, close to the one observed in cellular webs. Instead,\nthe other astrophysical reaction networks reveal a much simpler pattern\nconsistent with an equilibrium state. The implications for large-scale\nregulation of the planetary dynamics are outlined.",
    "authors": [
      "Ricard V. Sole",
      "Andreea Munteanu"
    ],
    "publication_date": "2004-06-05T15:52:40Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0406137v1",
    "download_url": "http://arxiv.org/abs/cond-mat/0406137v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Surface state engineering of molecule-molecule interactions",
    "abstract": "Engineering the electronic structure of organics through interface\nmanipulation, particularly the interface dipole and the barriers to charge\ncarrier injection, is of essential importance to improved organic devices. This\nrequires the meticulous fabrication of desired organic structures by precisely\ncontrolling the interactions between molecules. The well-known principles of\norganic coordination chemistry cannot be applied without proper consideration\nof extra molecular hybridization, charge transer and dipole formation at the\ninterfaces. Here we identify the interplay between energy level alignment,\ncharge transfer, surface dipole and charge pillow effect and show how these\neffects collectively determine the net force between adsorbed porphyrin 2H-TPP\non Cu(111). We show that the forces between supported porphyrins can be altered\nby controlling the amount of charge transferred across the interface accurately\nthrough the relative alignment of molecular electronic levels with respect to\nthe Shockley surface state of the metal substrate, and hence govern the\nself-assembly of the molecules.",
    "authors": [
      "Geoffrey Rojas",
      "Xumin Chen",
      "Donna Kunkel",
      "Justin Nitz",
      "Jie Xiao",
      "Peter A. Dowben",
      "Scott Simpson",
      "Eva Zurek",
      "Axel Enders"
    ],
    "publication_date": "2011-07-01T19:15:13Z",
    "arxiv_id": "http://arxiv.org/abs/1107.0306v1",
    "download_url": "http://arxiv.org/abs/1107.0306v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Light-driven C-H bond activation mediated by 2D transition metal\n  dichalcogenides",
    "abstract": "C-H bond activation enables the facile synthesis of new chemicals. While C-H\nactivation in short-chain alkanes has been widely investigated, it remains\nlargely unexplored for long-chain organic molecules. Here, we report\nlight-driven C-H activation in complex organic materials mediated by 2D\ntransition metal dichalcogenides (TMDCs) and the resultant solid-state\nsynthesis of luminescent carbon dots in a spatially-resolved fashion. We\nunravel the efficient H adsorption and a lowered energy barrier of C-C coupling\nmediated by 2D TMDCs to promote C-H activation. Our results shed light on 2D\nmaterials for C-H activation in organic compounds for applications in organic\nchemistry, environmental remediation, and photonic materials.",
    "authors": [
      "Jingang Li",
      "Di Zhang",
      "Zhongyuan Guo",
      "Xi Jiang",
      "Jonathan M. Larson",
      "Haoyue Zhu",
      "Tianyi Zhang",
      "Yuqian Gu",
      "Brian Blankenship",
      "Min Chen",
      "Zilong Wu",
      "Suichu Huang",
      "Robert Kostecki",
      "Andrew M. Minor",
      "Costas P. Grigoropoulos",
      "Deji Akinwande",
      "Mauricio Terrones",
      "Joan M. Redwing",
      "Hao Li",
      "Yuebing Zheng"
    ],
    "publication_date": "2022-08-16T18:44:09Z",
    "arxiv_id": "http://arxiv.org/abs/2208.07902v2",
    "download_url": "http://arxiv.org/abs/2208.07902v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Formation of methyl formate and other organic species in the warm-up\n  phase of hot molecular cores",
    "abstract": "Aims: The production of saturated organic molecules in hot cores and corinos\nis not well understood. The standard approach is to assume that, as\ntemperatures heat up during star formation, methanol and other species\nevaporate from grain surfaces and undergo a warm gas-phase chemistry at 100 K\nor greater to produce species such as methyl formate, dimethyl ether, and\nothers. But a series of laboratory results shows that protonated ions, typical\nprecursors to final products in ion-molecule schemes, tend to fragment upon\ndissociative recombination with electrons rather than just ejecting a hydrogen\natom. Moreover, the specific proposed reaction to produce protonated methyl\nformate is now known not to occur at all. Methods: We utilize a gas-grain\nchemical network to probe the chemistry of the relatively ignored stage of hot\ncore evolution during which the protostar switches on and the temperature of\nthe surrounding gas and dust rises from 10 K to over 100 K. During this stage,\nsurface chemistry involving heavy radicals becomes more important as surface\nhydrogen atoms tend to evaporate rather than react. Results: Our results show\nthat complex species such as methyl formate, formic acid, and dimethyl ether\ncan be produced in large abundance during the protostellar switch-on phase, but\nthat both grain-surface and gas-phase processes help to produce most species.\nThe longer the timescale for protostellar switch-on, the more important the\nsurface processes.",
    "authors": [
      "R. T. Garrod",
      "E. Herbst"
    ],
    "publication_date": "2006-07-25T13:29:53Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0607560v1",
    "download_url": "http://arxiv.org/abs/astro-ph/0607560v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]