[
  {
    "title": "Low Frequency Dielectric Loss of Metal/Insulator/Organic Semiconductor Junctions in Ambient Conditions",
    "abstract": "The complex admittance of metal/oxide/pentacene thin film junctions is investigated under ambient conditions. At low frequencies, a contribution attributed to proton diffusion through the oxide is seen. This diffusion is shown to be anomalous and is believed to be also at the origin of the bias stress effect observed in organic field effect transistors. At higher frequencies, two dipolar contributions are evidenced, attributed to defects located one at the organic/oxide interface or within the organic, and the other in the bulk of the oxide. These two dipolar responses show different dynamic properties that manifest themselves in the admittance in the form of a Debye contribution for the defects located in the oxide, and of a Cole-Cole contribution for the defects related to the organic.",
    "authors": [
      "R. Ledru",
      "S. Pleutin",
      "B. Grouiez",
      "D. Zander",
      "H. Bejbouji",
      "K. Lmimouni",
      "D. Vuillaume"
    ],
    "publication_date": "2012-04-28T13:15:08Z",
    "arxiv_id": "http://arxiv.org/abs/1204.6406v1",
    "download_url": "https://arxiv.org/abs/1204.6406v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Development of organic passive devices for RF applications",
    "abstract": "A huge interesting progress in the field of organic electronic materials and devices has been observed in the last decade. However, the understanding of these materials is still a challenge to overcome. Most studies in literature focus on active devices such as OTFTs, OLEDs and OPVs. Nevertheless, a complete technology has to have also passive devices in order to allow the design of interesting applications and complex circuits. This paper deals with the development of a complete set of passive devices allowing the fabrication of simple applications such as filters or sensors. The process flow is a fully screen printed technology that uses exclusively organic materials on gold laser ablated flexible substrate. Discrete passive (R, L, C) devices have been processed and characterized. This has permitted the fabrication of RLC low-band pass filters that are dedicated to RF applications, typically around 1GHz. Furthermore, based on these discrete passive components, we have developed a sensitive sensor on flexible substrate for RFID applications. We present the state of the art of our process development for RF applications using organic materials.",
    "authors": [
      "A. Aliane",
      "A. Daami",
      "T. Card",
      "R. Gwoziecki",
      "I. Chartier",
      "R. Coppard",
      "E. Bergeret",
      "E. Bènevent",
      "P. Pannier"
    ],
    "publication_date": "2025-10-31T12:59:49Z",
    "arxiv_id": "http://arxiv.org/abs/2510.27449v1",
    "download_url": "https://arxiv.org/abs/2510.27449v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evaluating Large Language Models on Multimodal Chemistry Olympiad Exams",
    "abstract": "Multimodal scientific reasoning remains a significant challenge for large language models (LLMs), particularly in chemistry, where problem-solving relies on symbolic diagrams, molecular structures, and structured visual data. Here, we systematically evaluate 40 proprietary and open-source multimodal LLMs, including GPT-5, o3, Gemini-2.5-Pro, and Qwen2.5-VL, on a curated benchmark of Olympiad-style chemistry questions drawn from over two decades of U.S. National Chemistry Olympiad (USNCO) exams. These questions require integrated visual and textual reasoning across diverse modalities. We find that many models struggle with modality fusion, where in some cases, removing the image even improves accuracy, indicating misalignment in vision-language integration. Chain-of-Thought prompting consistently enhances both accuracy and visual grounding, as demonstrated through ablation studies and occlusion-based interpretability. Our results reveal critical limitations in the scientific reasoning abilities of current MLLMs, providing actionable strategies for developing more robust and interpretable multimodal systems in chemistry. This work provides a timely benchmark for measuring progress in domain-specific multimodal AI and underscores the need for further advances at the intersection of artificial intelligence and scientific reasoning.",
    "authors": [
      "Yiming Cui",
      "Xin Yao",
      "Yuxuan Qin",
      "Xin Li",
      "Shijin Wang",
      "Guoping Hu"
    ],
    "publication_date": "2025-12-17T00:49:00Z",
    "arxiv_id": "http://arxiv.org/abs/2512.14989v1",
    "download_url": "https://arxiv.org/abs/2512.14989v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Coherent view of crystal chemistry and ab initio analyses of Pb(II) and Bi(III) Lone Pair in square planar coordination",
    "abstract": "The stereochemistry of 6s2 (E) lone pair of divalent Pb and trivalent Bi (PbII and BiIII designated by M*) in structurally related PbO, PbFX (X= Cl, Br, I), BiOX (X= F, Cl, Br, I) and Bi2NbO5F is rationalized. The lone pair LP presence determined by its sphere of influence E, equal to those of oxygen or fluorine anions, was settled by its center then giving M*-E directions and distances. Detailed description of structural features of both elements in the title compounds characterized by [PbEO]n and [BiEO]n layers allowed to show the evolution of M*-E distance versus the changes with the square pyramidal SP coordination polyhedra. All are different, in red PbO one finds {PbEO4E4} square antiprism, a {[Bi.E]O4X4Xapical} monocapped square antiprism in PbFX and BiOX and {BiEO4F4}square antiprism in Bi2NbO5F. To analyze the crystal chemistry results, the electronic structures of these compounds were calculated within density functional theory DFT. Real space analyses of electron localization illustrate a full volume development of the lone pair on PbII within {PbEO4E4} in PbOE, {PbEF4X4} in PbFXE and Bi(III) within {BiEO4X4} square antiprisms, contrary to Bi(III) within {[Bi.E]O4F4Fapical} monocapped square antiprism. Larger hardness (larger bulk modules B0) and band gap characterize BiOF versus PbO due to the presence of F which brings antibonding Bi-F interactions oppositely to mainly bonding Bi-O. In PbFX and BiOX series there is a systematic decrease of B0 with the increasing volume following the nature and size of X which is decreasingly electronegative and increasingly large. The electronic densities of states mirror these effects through the relative energy position and relative electronegativities of F/X and O/X leading to decrease the band gap.",
    "authors": [
      "Samir F. Matar",
      "Jean Galy"
    ],
    "publication_date": "2014-12-20T09:38:22Z",
    "arxiv_id": "http://arxiv.org/abs/1412.6636v2",
    "download_url": "https://arxiv.org/abs/1412.6636v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-field magnetoresistive effects in reduced-dimensionality organic metals and superconductors",
    "abstract": "The large charge-transfer anisotropy of quasi-one- and quasi-two-dimensional crystalline organic metals means that magnetoresistance is one of the most powerful tools for probing their bandstructure and interesting phase diagrams. Here we review various magnetoresistance phenomena that are of interest in the investigation of metallic, superconducting and charge-density-wave organic systems.",
    "authors": [
      "J. Singleton",
      "R. D. McDonald",
      "N. Harrison"
    ],
    "publication_date": "2006-06-19T16:50:34Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0606492v3",
    "download_url": "https://arxiv.org/abs/cond-mat/0606492v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Crystal Structure and Chemistry of Topological Insulators",
    "abstract": "Topological surface states, a new kind of electronic state of matter, have recently been observed on the cleaved surfaces of crystals of a handful of small band gap semiconductors. The underlying chemical factors that enable these states are crystal symmetry, the presence of strong spin orbit coupling, and an inversion of the energies of the bulk electronic states that normally contribute to the valence and conduction bands. The goals of this review are to briefly introduce the physics of topological insulators to a chemical audience and to describe the chemistry, defect chemistry, and crystal structures of the compounds in this emergent field.",
    "authors": [
      "R. J. Cava",
      "Huiwen Ji",
      "M. K. Fuccillo",
      "Q. D. Gibson",
      "Y. S. Hor"
    ],
    "publication_date": "2013-02-05T15:11:04Z",
    "arxiv_id": "http://arxiv.org/abs/1302.1059v1",
    "download_url": "https://arxiv.org/abs/1302.1059v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Influence of Pore Surface Chemistry on the Rotational Dynamics of Nanoconfined Water",
    "abstract": "We have investigated the dynamics of water confined in mesostructured porous silicas (SBA-15, MCM-41) and four periodic mesoporous organosilicas (PMOs) by dielectric relaxation spectroscopy. The influence of water-surface interaction has been controlled by the carefully designed surface chemistry of PMOs that involved organic bridges connecting silica moieties with different repetition lengths, hydrophilicity and H-bonding capability. Relaxation processes attributed to the rotational motions of non-freezable water located in the vicinity of the pore surface were studied in the temperature range from 140 K to 225 K. Two distinct situations were achieved depending on the hydration level: at low relative humidity (33% RH), water formed a non-freezable layer adsorbed on the pore surface. At 75% RH, water formed an interfacial liquid layer sandwiched between the pore surface and the ice crystallized in the pore center. In the two cases, the study revealed different water dynamics and different dependence on the surface chemistry. We infer that these findings illustrate the respective importance of water-water and water-surface interactions in determining the dynamics of the interfacial liquid-like water and the adsorbed water molecules, as well as the nature of the different H-bonding sites present on the pore surface.",
    "authors": [
      "Benjamin Malfait",
      "Aicha Jani",
      "Jakob Benedikt Mietner",
      "Ronan Lefort",
      "Patrick Huber",
      "Michael Fröba",
      "Denis Morineau"
    ],
    "publication_date": "2021-07-27T13:12:50Z",
    "arxiv_id": "http://arxiv.org/abs/2107.12798v1",
    "download_url": "https://arxiv.org/abs/2107.12798v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ChemToolAgent: The Impact of Tools on Language Agents for Chemistry Problem Solving",
    "abstract": "To enhance large language models (LLMs) for chemistry problem solving, several LLM-based agents augmented with tools have been proposed, such as ChemCrow and Coscientist. However, their evaluations are narrow in scope, leaving a large gap in understanding the benefits of tools across diverse chemistry tasks. To bridge this gap, we develop ChemToolAgent, an enhanced chemistry agent over ChemCrow, and conduct a comprehensive evaluation of its performance on both specialized chemistry tasks and general chemistry questions. Surprisingly, ChemToolAgent does not consistently outperform its base LLMs without tools. Our error analysis with a chemistry expert suggests that: For specialized chemistry tasks, such as synthesis prediction, we should augment agents with specialized tools; however, for general chemistry questions like those in exams, agents' ability to reason correctly with chemistry knowledge matters more, and tool augmentation does not always help.",
    "authors": [
      "Botao Yu",
      "Frazier N. Baker",
      "Ziru Chen",
      "Garrett Herb",
      "Boyu Gou",
      "Daniel Adu-Ampratwum",
      "Xia Ning",
      "Huan Sun"
    ],
    "publication_date": "2024-11-11T18:46:37Z",
    "arxiv_id": "http://arxiv.org/abs/2411.07228v3",
    "download_url": "https://arxiv.org/abs/2411.07228v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Single-Crystal Field-Effect Transistors",
    "abstract": "We present an overview of recent studies of the charge transport in the field effect transistors on the surface of single crystals of organic low-molecular-weight materials. We first discuss in detail the technological progress that has made these investigations possible. Particular attention is devoted to the growth and characterization of single crystals of organic materials and to different techniques that have been developed for device fabrication. We then concentrate on the measurements of the electrical characteristics. In most cases, these characteristics are highly reproducible and demonstrate the quality of the single crystal transistors. Particularly noticeable are the small sub-threshold slope, the non-monotonic temperature dependence of the mobility, and its weak dependence on the gate voltage. In the best rubrene transistors, room-temperature values of $μ$ as high as 15 cm$^2$/Vs have been observed. This represents an order-of-magnitude increase with respect to the highest mobility previously reported for organic thin film transistors. In addition, the highest-quality single-crystal devices exhibit a significant anisotropy of the conduction properties with respect to the crystallographic direction. These observations indicate that the field effect transistors fabricated on single crystals are suitable for the study of the \\textit{intrinsic} electronic properties of organic molecular semiconductors. We conclude by indicating some directions in which near-future work should focus to progress further in this rapidly evolving area of research.",
    "authors": [
      "R. W. I. de Boer",
      "M. E. Gershenson",
      "A. F. Morpurgo",
      "V. Podzorov"
    ],
    "publication_date": "2004-04-05T14:25:16Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0404100v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0404100v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Carbon Chemistry in interstellar clouds",
    "abstract": "We discuss new developments of interstellar chemistry, with particular emphasis on the carbon chemistry. We confirm that carbon chains and cycles are ubiquitous in the ISM and closely chemically related to ea ch other, and to carbon. Investigation of the carbon budget in shielded and UV illuminated gas shows that the inventory of interstellar molecules is not complete and more complex molecules with 4 or more carbon atoms must be present. Finally we discuss the consequences for the evolution of clouds and conclude that the ubiquitous presence of carbon chains and cycles is not a necessary consequence of a very young age for interstellar clouds.",
    "authors": [
      "Maryvonne Gerin",
      "David Fosse",
      "Evelyne Roueff"
    ],
    "publication_date": "2002-12-03T10:09:53Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0212058v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0212058v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Is thermal annealing a viable alternative for crystallization in triethylsilylethynyl anthradithiophene organic transistors?",
    "abstract": "Triethylsilylethynyl anthradithiophene (TESADT) holds considerable promise for organic transistor applications due to the high electrical mobilities attained by post-deposition crystallization using solvent vapour annealing. We have studied thermal annealing as an alternative route to post-deposition crystallization of TESADT films. Thermal annealing initially appears promising, producing mm-sized crystal domains, but poor electrical performance is obtained, which we attribute to a combination of crack formation and potentially also structural transition during the anneal process. We also find that illumination has a significant positive effect on crystallization, possibly due to an optically-induced enhancement in molecular mobility during annealing. This suggests further studies of how solvent exposure, heat, substrate surface properties and particularly light exposure influence the ordering kinetics of TESADT are warranted.",
    "authors": [
      "K. Muhieddine",
      "R. W. Lyttleton",
      "J. Badcock",
      "M. A. Loth",
      "J. Stride",
      "J. E. Anthony",
      "A. P. Micolich"
    ],
    "publication_date": "2014-04-06T23:15:26Z",
    "arxiv_id": "http://arxiv.org/abs/1404.1632v1",
    "download_url": "https://arxiv.org/abs/1404.1632v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Carrier Accumulation in Organic Heterojunctions Controlled by Polarization",
    "abstract": "We present a heterojunction theory of ultrathin organic multi-layered devices, which is the revision of our previous work. Their characteristic feature is the generation of conductive space charge region in the insulating neutral dielectric region under the bias voltage application, while the insulating space charge region is generated in the conductive neutral region in the case of semiconductors. We propose the concept of quasiconductor to describe these features. From the theory, the capacitor equation of mobile carriers is given, which is an equivalent equation of the Mott-Schottky equation in semiconductor physics. Because the organics are dielectrics, the dynamics are controlled cleverly by polarization. The theory gives a relation among the applied voltage, carrier accumulation, mobility, and carrier density, which enables the in-situ simultaneous evaluation of mobility and the carrier density of ultrathin organic multi-layered devices. The concept of quiasiconductor is a missing link between organic electronics and the semiconductor physics.",
    "authors": [
      "Jun-ichi Takahashi"
    ],
    "publication_date": "2020-11-02T00:49:58Z",
    "arxiv_id": "http://arxiv.org/abs/2011.00660v3",
    "download_url": "https://arxiv.org/abs/2011.00660v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Empirical LCAO parameters for $π$ molecular orbitals in planar organic molecules",
    "abstract": "We present a parametrization within a simplified LCAO model (a type of Hueckel model) for the description of $π$ molecular orbitals in organic molecules containing $π$-bonds between carbon, nitrogen, or oxygen atoms with $sp^2$ hybridization, which we show to be quite accurate in predicting the energy of the highest occupied $π$ orbital and the first $π$-$π*$ transition energy for a large set of organic compounds. We provide four empirical parameter values for the diagonal matrix elements of the LCAO description, corresponding to atoms of carbon, nitrogen with one $p_z$ electron, nitrogen with two $p_z$ electrons, and oxygen. The bond-length dependent formula (proportional to $1/d^2$) of Harrison is used for the non-diagonal matrix elements between neighboring atoms. The predictions of our calculations have been tested against available experimental results in more than sixty organic molecules, including benzene and its derivatives, polyacenes, aromatic hydrocarbons of various geometries, polyenes, ketones, aldehydes, azabenzenes, nucleic acid bases and others. The comparison is rather successful, taking into account the small number of parameters and the simplicity of the LCAO method, involving only $p_z$ atomic orbitals, which leads even to analytical calculations in some cases.",
    "authors": [
      "Laurence Hawke",
      "George Kalosakas",
      "Constantinos Simserides"
    ],
    "publication_date": "2008-08-28T20:01:21Z",
    "arxiv_id": "http://arxiv.org/abs/0808.3984v2",
    "download_url": "https://arxiv.org/abs/0808.3984v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A robust, open-source implementation of the locally optimal block preconditioned conjugate gradient for large eigenvalue problems in quantum chemistry",
    "abstract": "We present two open-source implementations of the Locally Optimal Block Preconditioned Conjugate Gradient (LOBPCG) algorithm to find a few eigenvalues and eigenvectors of large, possibly sparse matrices. We then test LOBPCG for various quantum chemistry problems, encompassing medium to large, dense to sparse, wellbehaved to ill-conditioned ones, where the standard method typically used is Davidson's diagonalization. Numerical tests show that, while Davidson's method remains the best choice for most applications in quantum chemistry, LOBPCG represents a competitive alternative, especially when memory is an issue, and can even outperform Davidson for ill-conditioned, non diagonally dominant problems.",
    "authors": [
      "Tommaso Nottoli",
      "Ivan Giannì",
      "Antoine Levitt",
      "Filippo Lipparini"
    ],
    "publication_date": "2023-05-11T09:09:09Z",
    "arxiv_id": "http://arxiv.org/abs/2305.06668v1",
    "download_url": "https://arxiv.org/abs/2305.06668v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Impact of Unintentional Oxygen Doping on Organic Photodetectors",
    "abstract": "Oxygen plasma is a widely used treatment to change the surface properties of organic layers. This treatment is particularly interesting to enable the deposition from solution of poly(3,4-ethylenedioxythiophene)-poly(styrenesulfonate) (PEDOT:PSS) on top of the active layer of organic solar cells or photodetectors. However, oxygen is known to be detrimental to organic devices, as the active layer is very sensitive to oxygen and photo-oxidation. In this study, we aim to determine the impact of oxygen plasma surface treatment on the performance of organic photodetectors (OPD). We show a significant reduction of the sensitivity as well as a change in the shape of the external quantum efficiency (EQE) of the device. Using hole density and conductivity measurements, we demonstrate the p-doping of the active layer induced by oxygen plasma. Admittance spectroscopy shows the formation of trap states approximately 350 meV above the highest occupied molecular orbital of the active organic semiconductor layer. Numerical simulations are carried out to understand the impact of p-doping and traps on the electrical characteristics and performance of the OPDs.",
    "authors": [
      "Julie Euvrard",
      "Amelie Revaux",
      "Alexandra Cantarano",
      "Stephanie Jacob",
      "Antoine Kahn",
      "Dominique Vuillaume"
    ],
    "publication_date": "2017-12-25T21:57:15Z",
    "arxiv_id": "http://arxiv.org/abs/1712.09134v1",
    "download_url": "https://arxiv.org/abs/1712.09134v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Physics and Chemistry on the Surface of Cosmic Dust Grains: A Laboratory View",
    "abstract": "Dust grains play a central role in the physics and chemistry of cosmic environments. They influence the optical and thermal properties of the medium due to their interaction with stellar radiation; provide surfaces for the chemical reactions that are responsible for the synthesis of a significant fraction of key astronomical molecules; and they are building blocks of pebbles, comets, asteroids, planetesimals, and planets. In this paper, we review experimental studies of physical and chemical processes, such as adsorption, desorption, diffusion, and reactions forming molecules, on the surface of reliable cosmic dust grain analogues as related to processes in diffuse, translucent, and dense interstellar clouds, protostellar envelopes, planet-forming disks, and planetary atmospheres. The information that such experiments reveal should be flexible enough to be used in many different environments. In addition, we provide a forward look discussing new ideas, experimental approaches, and research directions.",
    "authors": [
      "Alexey Potapov",
      "Martin McCoustra"
    ],
    "publication_date": "2021-05-04T09:44:44Z",
    "arxiv_id": "http://arxiv.org/abs/2105.01387v1",
    "download_url": "https://arxiv.org/abs/2105.01387v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemception: A Deep Neural Network with Minimal Chemistry Knowledge Matches the Performance of Expert-developed QSAR/QSPR Models",
    "abstract": "In the last few years, we have seen the transformative impact of deep learning in many applications, particularly in speech recognition and computer vision. Inspired by Google's Inception-ResNet deep convolutional neural network (CNN) for image classification, we have developed \"Chemception\", a deep CNN for the prediction of chemical properties, using just the images of 2D drawings of molecules. We develop Chemception without providing any additional explicit chemistry knowledge, such as basic concepts like periodicity, or advanced features like molecular descriptors and fingerprints. We then show how Chemception can serve as a general-purpose neural network architecture for predicting toxicity, activity, and solvation properties when trained on a modest database of 600 to 40,000 compounds. When compared to multi-layer perceptron (MLP) deep neural networks trained with ECFP fingerprints, Chemception slightly outperforms in activity and solvation prediction and slightly underperforms in toxicity prediction. Having matched the performance of expert-developed QSAR/QSPR deep learning models, our work demonstrates the plausibility of using deep neural networks to assist in computational chemistry research, where the feature engineering process is performed primarily by a deep learning algorithm.",
    "authors": [
      "Garrett B. Goh",
      "Charles Siegel",
      "Abhinav Vishnu",
      "Nathan O. Hodas",
      "Nathan Baker"
    ],
    "publication_date": "2017-06-20T22:25:57Z",
    "arxiv_id": "http://arxiv.org/abs/1706.06689v1",
    "download_url": "https://arxiv.org/abs/1706.06689v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pairing Symmetry Competition in Organic Superconductors",
    "abstract": "A review is given on theoretical studies concerning the pairing symmetry in organic superconductors. In particular, we focus on (TMTSF)$_2$X and $κ$-(BEDT-TTF)$_2$X, in which the pairing symmetry has been extensively studied both experimentally and theoretically. Possibilities of various pairing symmetry candidates and their possible microscopic origin are discussed. Also some tests for determining the actual pairing symmtery are surveyed.",
    "authors": [
      "Kazuhiko Kuroki"
    ],
    "publication_date": "2006-01-04T03:32:08Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0601060v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0601060v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Extragalactic chemistry of molecular gas: lessons from the local universe",
    "abstract": "Observational constraints provided by high resolution and high sensitivity observations of external galaxies made in the millimeter and submillimeter range have started to put on a firm ground the study of extragalactic chemistry of molecular gas. In particular, the availability of multi-species and multi-line surveys of nearby galaxies is central to the interpretation of existent and forthcoming millimeter observations of the high redshift universe. Probing the physical and chemical status of molecular gas in starbursts and active galaxies (AGN) requires the use of specific tracers of the relevant energetic phenomena that are known to be at play in these galaxies: large-scale shocks, strong UV fields, cosmic rays and X-rays. We present below the first results of an ongoing survey, allying the IRAM 30m telescope with the Plateau de Bure interferometer(PdBI), devoted to study the chemistry of molecular gas in a sample of starbursts and AGN of the local universe. These observations highlight the existence of a strong chemical differentiation in the molecular disks of starbursts and AGN.",
    "authors": [
      "S. Garcia-Burillo",
      "A. Fuente",
      "J. Martin-Pintado",
      "A. Usero",
      "J. Gracia-Carpio",
      "P. Planesas"
    ],
    "publication_date": "2006-05-24T11:41:23Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0605623v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0605623v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Tracing the Physical Conditions in Active Galactic Nuclei with Time-Dependent Chemistry",
    "abstract": "We present an extension of the code ProDiMo that allows for a modeling of processes pertinent to active galactic nuclei and to an ambient chemistry that is time dependent. We present a proof-of-concept and focus on a few astrophysically relevant species, e.g., H+, H2+ and H3+; C+ and N+; C and O; CO and H2O; OH+, H2O+ and H3O+; HCN and HCO+. We find that the freeze-out of water is strongly suppressed and that this affects the bulk of the oxygen and carbon chemistry occurring in AGN. The commonly used AGN tracer HCN/HCO+ is strongly time-dependent, with ratios that vary over orders of magnitude for times longer than 10^4 years. Through ALMA observations this ratio can be used to probe how the narrow-line region evolves under large fluctuations in the SMBH accretion rate. Strong evolutionary trends, on time scales of 10^4-10^8 years, are also found in species such as H3O+, CO, and H2O. These reflect, respectively, time dependent effects in the ionization balance, the transient nature of the production of molecular gas, and the freeze-out/sublimation of water.",
    "authors": [
      "Rowin Meijerink",
      "Marco Spaans",
      "Inga Kamp",
      "Giambattista Aresu",
      "Wing-Fai Thi",
      "Peter Woitke"
    ],
    "publication_date": "2013-06-11T11:12:36Z",
    "arxiv_id": "http://arxiv.org/abs/1306.2488v1",
    "download_url": "https://arxiv.org/abs/1306.2488v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Low voltage and time constant organic synapse-transistor",
    "abstract": "We report on an artificial synapse, an organic synapse-transistor (synapstor) working at 1 volt and with a typical response time in the range 100-200 ms. This device (also called NOMFET, Nanoparticle Organic Memory Field Effect Transistor) combines a memory and a transistor effect in a single device. We demonstrate that short-term plasticity (STP), a typical synaptic behavior, is observed when stimulating the device with input spikes of 1 volt. Both significant facilitating and depressing behaviors of this artificial synapse are observed with a relative amplitude of about 50% and a dynamic response < 200 ms. From a series of in-situ experiments, i.e. measuring the current-voltage characteristic curves in-situ and in real time, during the growth of the pentacene over a network of gold nanoparticles, we elucidate these results by analyzing the relationship between the organic film morphology and the transport properties. This synapstor works at a low energy of about 2 nJ/spike. We discuss the implications of these results for the development of neuro-inspired computing architectures and interfacing with biological neurons.",
    "authors": [
      "Simon Desbief",
      "Adrica Kyndiah",
      "David Guerin",
      "Denis Gentili",
      "Mauro Murgia",
      "Stéphane Lenfant",
      "Fabien Alibart",
      "Tobias Cramer",
      "Fabio Biscarini",
      "Dominique Vuillaume"
    ],
    "publication_date": "2015-05-16T15:28:25Z",
    "arxiv_id": "http://arxiv.org/abs/1505.04282v1",
    "download_url": "https://arxiv.org/abs/1505.04282v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Transfer Learning and Organic Computing for Autonomous Vehicles",
    "abstract": "Autonomous Vehicles(AV) are one of the brightest promises of the future which would help cut down fatalities and improve travel time while working in harmony. Autonomous vehicles will face with challenging situations and experiences not seen before. These experiences should be converted to knowledge and help the vehicle prepare better in the future. Online Transfer Learning will help transferring prior knowledge to a new task and also keep the knowledge updated as the task evolves. This paper presents the different methods of transfer learning, online transfer learning and organic computing that could be adapted to the domain of autonomous vehicles.",
    "authors": [
      "Christofer Fellicious"
    ],
    "publication_date": "2018-08-16T12:28:11Z",
    "arxiv_id": "http://arxiv.org/abs/1808.05443v1",
    "download_url": "https://arxiv.org/abs/1808.05443v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unveiling the impact of organic cation passivation on structural and optoelectronic properties of two-dimensional perovskites thin films",
    "abstract": "Several organic cations have been used to passivate perovskite films; however, selecting the optimal cation remains challenging. In this work, we carried out density functional theory calculations to understand the effects induced by 17 different organic cations on the passivation (P-cations) of thin two-dimensional P2MAn-1PbnI3n+1 perovskites films, where n = 1 and 2. We found that the interactions between different types of P-cations and the inorganic slab affect the length and angles of the bonds within the inorganic framework (PbI6-octahedra). In general, the binding mechanism includes the interactions of organic cations with the inorganic framework, which leads to the accumulation of electron density within the halides, indicative of Bronsted--Lowry acid-base interactions. Oxygenated groups facilitate additional H-bond formation through -OH and -COOH groups, promoting the localization of the electron density between layers and improving the energetic stability of the system. Based on the results and analysis, we found that three P-cations might have higher potential for real-life applications, namely 4-fluorophenylethylammonium (FPEA), phenylethylammonium (PEA) and butylammonium (BtA).",
    "authors": [
      "Israel C. Ribeiro",
      "Pedro Ivo R. Moraes",
      "Albert F. B. Bittencourt",
      "Juarez L. F. Da Silva"
    ],
    "publication_date": "2024-09-02T20:11:40Z",
    "arxiv_id": "http://arxiv.org/abs/2409.01450v1",
    "download_url": "https://arxiv.org/abs/2409.01450v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Thermodynamics and Chemistry of the Early Universe",
    "abstract": "The interplay between chemistry and thermodynamics determines the final outcome of the process of gravitational collapse and sets the conditions for the formation of the first cosmological objects, including primordial supermassive black holes. In this chapter, we will review the main chemical reactions and the most important heating/cooling processes taking place in a gas of primordial composition, including the effects of local and cosmological radiation backgrounds.",
    "authors": [
      "Stefano Bovino",
      "Daniele Galli"
    ],
    "publication_date": "2018-07-16T16:01:56Z",
    "arxiv_id": "http://arxiv.org/abs/1807.05939v2",
    "download_url": "https://arxiv.org/abs/1807.05939v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Drastic Minimization in the van der Waals Interaction with the Bottom Epitaxial Graphene Layer by the Diels-Alder Surface Chemistry of the Top Graphene Layer",
    "abstract": "The Diels-Alder surface modified top epitaxial graphene layer, with newly created pair of sp3 carbon centres, results in abrupt minimization of interlayer van der Waals interactions between two stacked graphene planes, and escapes the wafer during post-reaction manipulation stage, leaving the layer under it almost pristine-like. Above picture shows Diels-Alder functionalized sp2/sp3 graphene adduct leaves the parent wafer. In this communication we systematically address several fundamental questions in graphene surface chemistry, which are of extreme importance for device fabrication, and in successful implementation of covalently modified graphene in electronics industry.",
    "authors": [
      "Santanu Sarkar"
    ],
    "publication_date": "2014-09-29T04:07:49Z",
    "arxiv_id": "http://arxiv.org/abs/1409.7992v1",
    "download_url": "https://arxiv.org/abs/1409.7992v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magnetoresistance from quenching of spin quantum correlation in organic semiconductors",
    "abstract": "We present a theory of organic magnetoresistance (OMR) based on the quenching of the quantum correlation between the carrier's spin and its local environment when the incoherent hopping takes place. We prove that this process contributes a spin-dependent prefactor to the attempt-to-escape frequency in the hopping rate, with its value modulated by the magnetic field. The resulting OMR exhibits a positive Lorentzian saturation component and a negative small-field component, which are independent of model parameters. These behaviors, with their isotope effects, are in good agreement with experimental results.",
    "authors": [
      "Wei Si",
      "Yao Yao",
      "Xiaoyuan Hou",
      "Chang-Qin Wu"
    ],
    "publication_date": "2012-07-05T02:04:04Z",
    "arxiv_id": "http://arxiv.org/abs/1207.1152v2",
    "download_url": "https://arxiv.org/abs/1207.1152v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "ChemKANs for Combustion Chemistry Modeling and Acceleration",
    "abstract": "Efficient chemical kinetic model inference and application in combustion are challenging due to large ODE systems and widely separated time scales. Machine learning techniques have been proposed to streamline these models, though strong nonlinearity and numerical stiffness combined with noisy data sources make their application challenging. Here, we introduce ChemKANs, a novel neural network framework with applications both in model inference and simulation acceleration for combustion chemistry. ChemKAN's novel structure augments the generic Kolmogorov Arnold Network Ordinary Differential Equations (KAN-ODEs) with knowledge of the information flow through the relevant kinetic and thermodynamic laws. This chemistry-specific structure combined with the expressivity and rapid neural scaling of the underlying KAN-ODE algorithm instills in ChemKANs a strong inductive bias, streamlined training, and higher accuracy predictions compared to standard benchmarks, while facilitating parameter sparsity through shared information across all inputs and outputs. In a model inference investigation, we benchmark the robustness of ChemKANs to sparse data containing up to 15% added noise, and superfluously large network parameterizations. We find that ChemKANs exhibit no overfitting or model degradation in any of these training cases, demonstrating significant resilience to common deep learning failure modes. Next, we find that a remarkably parameter-lean ChemKAN (344 parameters) can accurately represent hydrogen combustion chemistry, providing a 2x acceleration over the detailed chemistry in a solver that is generalizable to larger-scale turbulent flow simulations. These demonstrations indicate the potential for ChemKANs as robust, expressive, and efficient tools for model inference and simulation acceleration for combustion physics and chemical kinetics.",
    "authors": [
      "Benjamin C. Koenig",
      "Suyong Kim",
      "Sili Deng"
    ],
    "publication_date": "2025-04-17T01:53:28Z",
    "arxiv_id": "http://arxiv.org/abs/2504.12580v2",
    "download_url": "https://arxiv.org/abs/2504.12580v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The transient localization scenario for charge transport in crystalline organic materials",
    "abstract": "Charge transport in crystalline organic semiconductors is intrinsically limited by the presence of large thermal molecular motions, which are a direct consequence of the weak van der Waals inter-molecular interactions. These lead to an original regime of transport called \\textit{transient localization}, sharing features of both localized and itinerant electron systems. After a brief review of experimental observations that pose a challenge to the theory, we concentrate on a commonly studied model which describes the interaction of the charge carriers with inter-molecular vibrations. We present different theoretical approaches that have been applied to the problem in the past, and then turn to more modern approaches that are able to capture the key microscopic phenomenon at the origin of the puzzling experimental observations, i.e. the quantum localization of the electronic wavefuntion at timescales shorter than the typical molecular motions. We describe in particular a relaxation time approximation which clarifies how the transient localization due to dynamical molecular motions relates to the Anderson localization realized for static disorder, and allows us to devise strategies to improve the mobility of actual compounds. The relevance of the transient localization scenario to other classes of systems is briefly discussed.",
    "authors": [
      "S. Fratini",
      "D. Mayou",
      "S. Ciuchi"
    ],
    "publication_date": "2015-05-11T16:09:30Z",
    "arxiv_id": "http://arxiv.org/abs/1505.02686v2",
    "download_url": "https://arxiv.org/abs/1505.02686v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Matter in Space - an Overview",
    "abstract": "Organic compounds are ubiquitous in space: they are found in diffuse clouds, in the envelopes of evolved stars, in dense star-forming regions, in protoplanetary disks, in comets, on the surfaces of minor planets, and in meteorites and interplanetary dust particles. This brief overview summarizes the observational evidence for the types of organics found in these regions, with emphasis on recent developments. The Stardust sample-return mission provides the first opportunity to study primitive cometary material with sophisticated equipment on Earth. Similarities and differences between the types of compounds in different regions are discussed in the context of the processes that can modify them. The importance of laboratory astrophysics is emphasized.",
    "authors": [
      "E. F. van Dishoeck"
    ],
    "publication_date": "2008-07-05T12:59:39Z",
    "arxiv_id": "http://arxiv.org/abs/0807.0857v1",
    "download_url": "https://arxiv.org/abs/0807.0857v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interacting electrons in quasi-one-dimensional organic superconductors",
    "abstract": "This review covers the study of some basic properties of the phase diagram of quasi-one-dimensional organic superconductors from both experimental and theoretical viewpoints.",
    "authors": [
      "C. Bourbonnais",
      "D. Jerome"
    ],
    "publication_date": "2009-04-03T17:02:23Z",
    "arxiv_id": "http://arxiv.org/abs/0904.0617v1",
    "download_url": "https://arxiv.org/abs/0904.0617v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Charge separation in organic photovoltaic cells",
    "abstract": "We consider a simple model for the geminate electron-hole separation process in organic photovoltaic cells, in order to illustrate the influence of dimensionality of conducting channels on the efficiency of the process. The Miller-Abrahams expression for the transition rates between nearest neighbor sites was used for simulating random walks of the electron in the Coulomb field of the hole. The non-equilibrium kinetic Monte Carlo simulation results qualitatively confirm the equilibrium estimations, although quantitatively the efficiency of the higher dimensional systems is less pronounced. The lifetime of the electron prior to recombination is approximately equal to the lifetime prior to dissociation. Their values indicate that electrons perform long stochastic walks before they are captured by the collector or recombined. The non-equilibrium free energy considerably differs from the equilibrium one. The efficiency of the separation process decreases with increasing the distance to the collector, and this decrease is considerably less pronounced for the three dimensional system. The simulation results are in good agreement with the extension of the continuum Onsager theory that accounts for the finite recombination rate at nonzero reaction radius and non-exponential kinetics of the charge separation process.",
    "authors": [
      "Paraskevas Giazitzidis",
      "Panos Argyrakis",
      "Juan Bisquert",
      "Vyacheslav S. Vikhrenko"
    ],
    "publication_date": "2014-03-26T14:16:06Z",
    "arxiv_id": "http://arxiv.org/abs/1403.6683v1",
    "download_url": "https://arxiv.org/abs/1403.6683v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Non-Ideal Organic Electrochemical Transistors Impedance",
    "abstract": "Organic electrochemical transistors offer powerful functionalities for biosensors and neuroinspired electronics, with still much to understand on the time dependent behavior of this electrochemical device. Here, we report on distributed element modeling of the impedance of such microfabricated device, systematically performed under a large concentration variation for KCl(aq) and CaCl2(aq). We propose a new model which takes into account three main deviations to ideality, that were systematically observed, caused by both the materials and the device complexity, over large frequency range (1 Hz to 1 MHz). More than introducing more freedom degree, the introduction of these non redundant parameters and the study of their behaviors as function of the electrolyte concentration and applied voltage give a more detailed picture of the OECT working principles. This optimized model can be further useful for improving OECT performances in many applications (e.g. biosensors, neuroinspired devices) and circuit simulations.",
    "authors": [
      "Sébastien Pecqueur",
      "Ivor Lončaric",
      "Vinko Zlatić",
      "Dominique Vuillaume",
      "Željko Crljen"
    ],
    "publication_date": "2019-05-04T14:14:11Z",
    "arxiv_id": "http://arxiv.org/abs/1905.01497v1",
    "download_url": "https://arxiv.org/abs/1905.01497v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electrolyte-gated organic synapse transistor interfaced with neurons",
    "abstract": "We demonstrate an electrolyte-gated hybrid nanoparticle/organic synapstor (synapse-transistor, termed EGOS) that exhibits short-term plasticity as biological synapses. The response of EGOS makes it suitable to be interfaced with neurons: short-term plasticity is observed at spike voltage as low as 50 mV (in a par with the amplitude of action potential in neurons) and with a typical response time in the range of tens milliseconds. Human neuroblastoma stem cells are adhered and differentiated into neurons on top of EGOS. We observe that the presence of the cells does not alter short-term plasticity of the device.",
    "authors": [
      "Simon Desbief",
      "Michele di Lauro",
      "Stefano Casalini",
      "David Guerin",
      "Silvia Tortorella",
      "Marianna Barbalinardo",
      "Adrica Kyndiah",
      "Mauro Murgia",
      "Tobias Cramer",
      "Fabio Biscarini",
      "Dominique Vuillaume"
    ],
    "publication_date": "2016-08-03T13:42:16Z",
    "arxiv_id": "http://arxiv.org/abs/1608.01191v1",
    "download_url": "https://arxiv.org/abs/1608.01191v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interface Dipole : Effects on Threshold Voltage and Mobility for both Amorphous and Poly-crystalline Organic Field Effect Transistors",
    "abstract": "We report a detailed comparison on the role of a self-assembled monolayer (SAM) of dipolar molecules on the threshold voltage and charge carrier mobility of organic field-effect transistor (OFET) made of both amorphous and polycrystalline organic semiconductors. We show that the same relationship between the threshold voltage and the dipole-induced charges in the SAM holds when both types of devices are fabricated on strictly identical base substrates. Charge carrier mobilities, almost constant for amorphous OFET, are not affected by the dipole in the SAMs, while for polycrystalline OFET (pentacene) the large variation of charge carrier mobilities is related to change in the organic film structure (mostly grain size).",
    "authors": [
      "C. Celle",
      "C. Suspene",
      "M. Ternisien",
      "S. Lenfant",
      "D. Guerin",
      "K. Smaali",
      "K. Lmimouni",
      "J. P. Simonato",
      "D. Vuillaume"
    ],
    "publication_date": "2014-02-04T10:01:30Z",
    "arxiv_id": "http://arxiv.org/abs/1402.0676v1",
    "download_url": "https://arxiv.org/abs/1402.0676v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Towards Quantum Chemistry on a Quantum Computer",
    "abstract": "The fundamental problem faced in quantum chemistry is the calculation of molecular properties, which are of practical importance in fields ranging from materials science to biochemistry. Within chemical precision, the total energy of a molecule as well as most other properties, can be calculated by solving the Schrodinger equation. However, the computational resources required to obtain exact solutions on a conventional computer generally increase exponentially with the number of atoms involved. This renders such calculations intractable for all but the smallest of systems. Recently, an efficient algorithm has been proposed enabling a quantum computer to overcome this problem by achieving only a polynomial resource scaling with system size. Such a tool would therefore provide an extremely powerful tool for new science and technology. Here we present a photonic implementation for the smallest problem: obtaining the energies of H2, the hydrogen molecule in a minimal basis. We perform a key algorithmic step - the iterative phase estimation algorithm - in full, achieving a high level of precision and robustness to error. We implement other algorithmic steps with assistance from a classical computer and explain how this non-scalable approach could be avoided. Finally, we provide new theoretical results which lay the foundations for the next generation of simulation experiments using quantum computers. We have made early experimental progress towards the long-term goal of exploiting quantum information to speed up quantum chemistry calculations.",
    "authors": [
      "Benjamin P. Lanyon",
      "James D. Whitfield",
      "Geoff G. Gillet",
      "Michael E. Goggin",
      "Marcelo P. Almeida",
      "Ivan Kassal",
      "Jacob D. Biamonte",
      "Masoud Mohseni",
      "Ben J. Powell",
      "Marco Barbieri",
      "Alán Aspuru-Guzik",
      "Andrew G. White"
    ],
    "publication_date": "2009-05-06T19:00:54Z",
    "arxiv_id": "http://arxiv.org/abs/0905.0887v3",
    "download_url": "https://arxiv.org/abs/0905.0887v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hall effect in quasi one-dimensional organic conductors",
    "abstract": "We study the Hall effect in a system of weakly coupled Luttinger Liquid chains, using a Memory function approach to compute the Hall constant in the presence of umklapp scattering along the chains. In this approximation, the Hall constant decomposes into two terms: a high-frequency term and a Memory function term. For the case of zero umklapp scattering, where the Memory function vanishes, the Hall constant is simply the band value, in agreement with former results in a similar model with no dissipation along the chains. With umklapp scattering along the chains, we find a power-law temperature dependance of the Hall constant. We discuss the applications to quasi 1D organic conductors at high temperatures.",
    "authors": [
      "Gladys León",
      "Thierry Giamarchi"
    ],
    "publication_date": "2005-09-30T10:12:11Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0509792v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0509792v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic chemistry in the protosolar analogue HOPS-108: Environment matters",
    "abstract": "Hot corinos are compact regions around solar-mass protostellar objects that are very rich in interstellar complex organic molecules (iCOMs). They are believed to represent the very early phases of our Solar System's birth, which was very likely also characterized by rich organic chemistry. While most of the studied hot corinos are either isolated or born in a loose protocluster, our Sun was born in a densely packed star cluster, near massive stars whose ultraviolet radiation must have contributed to shaping the evolution of the surrounding environment. In addition, internal irradiation from energetic particles ($>$10 Mev), whose imprint is seen today in the products of short-lived radionuclides in meteoritic material, is also known to have occurred during the Solar System formation. How did all these conditions affect the chemistry of the proto-Sun and its surroundings is still an open question. To answer this question, we studied HOPS-108, the hot corino located in the protosolar analogue OMC-2 FIR4. The study was carried out with ALMA at 1.3mm with an angular resolution of $\\sim$100 AU. We detected 11 iCOMs such as CH$_{3}$OH HCOOCH$_{3}$ and CH$_{3}$OCH$_{3}$. Our results can be summarized as follows: (1) an enhancement of HCOOCH3 with respect to other hot corinos, (2) a [CH$_{3}$OCH$_{3}$]/[HCOOCH$_{3}$] abundance ratio of $\\sim$0.2 marginally deviating from the usual trend seen in other sources ([CH$_{3}$OCH$_{3}$]/[HCOOCH$_{3}$] $\\sim$1), (3) a [CH$_{2}$DOH]/[CH$_{3}$OH] ratio of 2.5\\% which is lower than what is seen in Perseus and Ophiuchus hot corinos ($\\sim$7\\%-9\\%) and similar to that seen in HH212 another source located in Orion. This might result from different physical conditions in the Orion molecular complex compared to other regions.",
    "authors": [
      "L. Chahine",
      "A. López-Sepulcre",
      "R. Neri",
      "C. Ceccarelli",
      "S. Mercimek",
      "C. Codella",
      "M. Bouvier",
      "E. Bianchi",
      "C. Favre",
      "L. Podio",
      "F. O. Alves",
      "N. Sakai",
      "S. Yamamoto"
    ],
    "publication_date": "2021-12-15T12:32:51Z",
    "arxiv_id": "http://arxiv.org/abs/2112.08077v1",
    "download_url": "https://arxiv.org/abs/2112.08077v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "NEATH IV: an early onset of complex organic chemistry in molecular clouds",
    "abstract": "Complex organic molecules (COMs) are widely detected in protostellar and protoplanetary systems, where they are thought to have been inherited in large part from earlier evolutionary phases. The chemistry of COMs in these earlier phases, namely starless and prestellar cores, remains poorly understood, as models often struggle to reproduce the observed gas-phase abundances of these species. We simulate the formation of a molecular cloud, and the cores within it, out of the diffuse interstellar medium, and follow the chemical evolution of the cloud material starting from purely-atomic initial conditions. We find that the formation of both gas- and ice-phase COMs precedes the formation of cores as distinct objects, beginning at gas densities of a few $10^3 \\,{\\rm cm}^{-3}$. Much of this COM-enriched material remains at these relatively modest densities for several Myr, which may provide a reservoir for accretion onto planet-forming discs in later evolutionary stages. We suggest that models of core and disc chemistry should not ignore the complex dynamical evolution which precedes these structures, even when studying supposedly late-forming molecules such as CH$_3$OH and CH$_3$CN.",
    "authors": [
      "F. D. Priestley",
      "P. C. Clark",
      "S. E. Ragan",
      "S. Scibelli",
      "M. T. Cusack",
      "S. C. O. Glover",
      "O. Fehér",
      "L. R. Prole",
      "R. S. Klessen"
    ],
    "publication_date": "2025-01-29T19:30:10Z",
    "arxiv_id": "http://arxiv.org/abs/2501.17955v1",
    "download_url": "https://arxiv.org/abs/2501.17955v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic complexity in protostellar disk candidates",
    "abstract": "We present ALMA observations of organic molecules towards five low-mass Class 0/I protostellar disk candidates in the Serpens cluster. Three sources (Ser-emb 1, Ser-emb 8, and Ser-emb 17) present emission of CH3OH as well as CH3OCH3, CH3OCHO, and CH2CO, while NH2CHO is detected in just Ser-emb 8 and Ser-emb 17. Detecting hot corino-type chemistry in three of five sources represents a high occurrence rate given the relative sparsity of these sources in the literature, and this suggests a possible link between protostellar disk formation and hot corino formation. For sources with CH3OH detections, we derive column densities of 10^{17}-10^{18} cm^{-2} and rotational temperatures of ~200-250 K. The CH3OH-normalized column density ratios of large, oxygen-bearing COMs in the Serpens sources and other hot corinos span two orders of magnitude, demonstrating a high degree of chemical diversity at the hot corino stage. Resolved observations of a larger sample of objects are needed to understand the origins of chemical diversity in hot corinos, and the relationship between different protostellar structural elements on disk-forming scales.",
    "authors": [
      "Jennifer B. Bergner",
      "Rafael Martin-Domenech",
      "Karin I. Oberg",
      "Jes K. Jorgensen",
      "Elizabeth Artur de la Villarmois",
      "Christian Brinch"
    ],
    "publication_date": "2019-07-17T22:05:16Z",
    "arxiv_id": "http://arxiv.org/abs/1907.07791v1",
    "download_url": "https://arxiv.org/abs/1907.07791v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cation Discrimination in Organic Electrochemical Transistors by Dual Frequency Sensing",
    "abstract": "In this work, we propose a strategy to sense quantitatively and specifically cations, out of a single organic electrochemical transistor (OECT) device exposed to an electrolyte. From the systematic study of six different chloride salts over 12 different concentrations, we demonstrate that the impedance of the OECT device is governed by either the channel dedoping at low frequency and the electrolyte gate capacitive coupling at high frequency. Specific cationic signatures, which originates from the different impact of the cations behavior on the poly(3,4-ethylenedioxythiophene):poly(styrenesulfonate) (PEDOT:PSS) polymer and their conductivity in water, allow their discrimination at the same molar concentrations. Dynamic analysis of the device impedance at different frequencies could allow the identification of specific ionic flows which could be of a great use in bioelectronics to further interpret complex mechanisms in biological media such as in the brain.",
    "authors": [
      "Sebastien Pecqueur",
      "David Guerin",
      "Dominique Vuillaume",
      "Fabien Alibart"
    ],
    "publication_date": "2018-03-27T18:04:44Z",
    "arxiv_id": "http://arxiv.org/abs/1803.10255v1",
    "download_url": "https://arxiv.org/abs/1803.10255v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Exploring organic chemistry in planet-forming zones",
    "abstract": "Over the last few years, the chemistry of molecules other than CO in the planet-forming zones of disks is starting to be explored with Spitzer and high-resolution ground-based data. However, these studies have focused only on a few simple molecules. The aim of this study is to put observational constraints on the presence of more complex organic and sulfur-bearing molecules predicted to be abundant in chemical models of disks and to simulate high resolution spectra in view of future missions. High S/N Spitzer spectra at 10-30 micron of the near edge-on disks IRS46 and GVTau are used to search for mid-infrared absorption bands of various molecules. These disks are good laboratories because absorption studies do not suffer from low line/continuum ratios that plague emission data. Simple LTE slab models are used to infer column densities (or upper limits) and excitation temperatures. Bands of HCN, C2H2 and CO2 are clearly detected toward both sources. The HCN and C2H2 absorption arises in warm gas with Tex of 400-700 K, whereas the CO2 absorption originates in cooler gas of app. 250 K (as in Lahuis 2006). No other absorption features are detected. Limits of those molecules are determined and compared with disk models. The inferred ratios wrt. C2H2 and HCN are roughly consistent with models of the chemistry in high-T gas. Models of UV irradiated disk surfaces generally agree better than pure X-ray models. The limit on NH3/HCN implies that evaporation of NH3 containing ices is only a minor contributor. The inferred ratios also compare well with those found in comets, suggesting that part of the cometary material may derive from warm inner disk gas. High resolution simulations show that future instruments on JWST, ELTs, SOFIA and SPICA can probe up to an order of magnitude lower ratios and put important new constraints on the models, especially if pushed to high S/N ratios.",
    "authors": [
      "Jeanette E. Bast",
      "Fred Lahuis",
      "Ewine F. van Dishoeck",
      "Alexander G. G. M. Tielens"
    ],
    "publication_date": "2012-12-13T20:03:42Z",
    "arxiv_id": "http://arxiv.org/abs/1212.3297v2",
    "download_url": "https://arxiv.org/abs/1212.3297v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The quest for a universal density functional: The accuracy of density functionals across a broad spectrum of databases in chemistry and physics",
    "abstract": "Kohn-Sham density functional theory is in principle an exact formulation of quantum mechanical electronic structure theory, but in practice we have to rely on approximate exchange-correlation (xc) functionals. The objective of our work has been to design an xc functional with broad accuracy across as wide an expanse of chemistry and physics as possible, leading-as a long-range goal-to a functional with good accuracy for all problems, i.e., a universal functional. To guide our path toward that goal and to measure our progress, we have developed-building on earlier work in our group-a set of databases of reference data for a variety of energetic and structural properties in chemistry and physics. These databases include energies of molecular processes such as atomization, complexation, proton addition, and ionization; they also include molecular geometries and solid-state lattice constants, chemical reaction barrier heights, and cohesive energies and band gaps of solids. For the present paper we gather many of these databases into four comprehensive databases, two with 384 energetic data for chemistry and solid-state physics and another two with 68 structural data for chemistry and solid-state physics, and we test 2 wave function methods and 77 density functionals (12 Minnesota meta functionals and 65 others) in a consistent way across this same broad set of data. We especially highlight the Minnesota density functionals, but the results have broader implications in that one may see the successes and failures of many kinds of density functionals when they are all applied to the same data. Therefore the results provide a status report on the quest for a universal functional.",
    "authors": [
      "Roberto Peverati",
      "Donald G. Truhlar"
    ],
    "publication_date": "2012-12-05T07:07:24Z",
    "arxiv_id": "http://arxiv.org/abs/1212.0944v4",
    "download_url": "https://arxiv.org/abs/1212.0944v4",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Chemical Route to Graphene for Electronics and Spintronics Device Applications",
    "abstract": "The development of selective high precision chemical functionalization strategies for device fabrication, in conjunction with associated techniques for patterning graphene wafers with atomic accuracy would provide the necessary basis for a post-CMOS manufacturing technology. This requires a thorough understanding of the principles governing the reactivity and patterning of graphene at the sub-nanometer length scale. This article reviews our quest to delineate the principles of graphene chemistry - that is, the chemistry at the Dirac point and beyond, and the effect of covalent chemistry on the electronic structure, electrical transport and magnetic properties of this low-dimensional material in order to enable the scalable production of graphene-based devices for low- and high-end technology applications.",
    "authors": [
      "Santanu Sarkar"
    ],
    "publication_date": "2014-09-20T03:04:29Z",
    "arxiv_id": "http://arxiv.org/abs/1409.5849v1",
    "download_url": "https://arxiv.org/abs/1409.5849v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Toward Unraveling Cyanopolyyne Surface Chemistry: A Preview on Isolated Systems From HC_{3}N to Ethyl Cyanide and Propylamine",
    "abstract": "Cyanopolyynes, a family of nitrogen containing carbon chains, are common in the interstellar medium and possibly form the backbone of species relevant to prebiotic chemistry. Following their gas phase formation, they are expected to freeze out on ice grains in cold interstellar regions. In this work we present the hydrogenation reaction network of isolated HC_{3}N, the smallest cyanopolyyne, that consists over-a-barrier radical-neutral reactions and barrierless radical-radical reactions. We employ density functional theory, coupled cluster and multiconfigurational methods to obtain activation and reaction energies for the hydrogenation network of HC_{3}N. This work explores the reaction network of the isolated molecule and constitutes a preview on the reactions occurring on the ice grain surface. We find that the reactions where the hydrogen atom adds to the carbon chain at carbon atom opposite of the cyano-group give the lowest and most narrow barriers. Subsequent hydrogenation leads to the astrochemically relevant vinyl cyanide and ethyl cyanide. Alternatively, the cyano-group can hydrogenate via radical-radical reactions, leading to the fully saturated propylamine. These results can be extrapolated to give insight into the general reactivity of carbon chains on interstellar ices.",
    "authors": [
      "Marten T. Raaphorst",
      "Joan Enrique-Romero",
      "Thanja Lamberts"
    ],
    "publication_date": "2025-05-26T12:38:27Z",
    "arxiv_id": "http://arxiv.org/abs/2505.19908v1",
    "download_url": "https://arxiv.org/abs/2505.19908v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Role of Electron--Electron Interactions on Spin Effects in Electron--Hole Recombination in Organic Light Emitting Diodes",
    "abstract": "We extend our theory of electron--hole recombination in organic light emitting diodes to investigate the possibility that high energy singlet and triplet excited states with large electron--hole separations are generated in such processes, over and above the lowest singlet and triplet excitons. Our approach involves a time-dependent calculation of the interchain / intermolecular charge--transfer within model Hamiltonians that explicitly include electron-electron interactions between the $π$-electrons. We show that the electron--hole recombination reaction can be viewed as a tunneling process whose cross section depends on both the matrix element of the interchain part of Hamiltonian and the energy difference between the initial polaron--pair state and the final neutral states. There occurs a bifurcation of the electron--hole recombination path in each of the two spin channels that leads to the generation of both the lowest energy exciton and a specific high energy charge-transfer state, with the matrix elements favoring the lowest energy exciton and the energy difference factor favoring the higher energy state. The overall effect of the electron--electron interactions is to enhance the singlet:triplet yield ratio over the value of 0.25 predicted from statistical considerations that are valid only within noninteracting models.",
    "authors": [
      "Mousumi Das",
      "S. Mazumdar",
      "S. Ramasesha"
    ],
    "publication_date": "2004-11-18T06:51:40Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0411466v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0411466v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ultra-hard rhombohedral carbon from crystal chemistry rationale and first principles",
    "abstract": "A new ultra-hard rhombohedral carbon rh-C4 (or hexagonal h-C12) is reported as derived from 3R graphite through crystal chemistry construction and ground state energy within the density functional theory. An extended hexagonal three-dimensional network of h-C12 is formed of C4 tetrahedra alike in h-C4 lonsdaleite (hexagonal diamond). The electronic band structure of rh-C4 is characteristic of insulator with Egap = 4 eV similarly to diamond. From the set of elastic constants a larger value of bulk modulus versus lonsdaleite, and the largest Vickers hardness (HV) versus both forms of diamond were derived.",
    "authors": [
      "Samir F. Matar",
      "Vladimir L. Solozhenko"
    ],
    "publication_date": "2021-04-02T14:52:36Z",
    "arxiv_id": "http://arxiv.org/abs/2104.01076v1",
    "download_url": "https://arxiv.org/abs/2104.01076v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Temporal dynamics in acoustic emission of the organic self-propagating high-temperature synthesis",
    "abstract": "Nonlinear dynamics procedures as well as spectral-correlation analysis are used for the acoustical response of consecutive physical-chemical stages of the organic self-propagating high-temperature synthesis. The transient nature of processes in the system studied is revealed. The study of changes in temporal and spatial dynamics of such systems allows driving the wave of the chemical reaction to make the solid phase \"combustion\" more efficient and produce condensed products with desired properties.",
    "authors": [
      "A. L. Parakhonsky",
      "E. G. Klimchuk"
    ],
    "publication_date": "2017-11-03T11:41:04Z",
    "arxiv_id": "http://arxiv.org/abs/1711.02507v1",
    "download_url": "https://arxiv.org/abs/1711.02507v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Influence of surface stoichiometry and quantum confinement on the electronic structure of small diameter InxGa1-xAs nanowires",
    "abstract": "Electronic structures for InxGa1-xAs nanowires with [100], [110], and [111] orientations and critical dimensions of approximately 2 nm are treated within the framework of density functional theory. Explicit band structures are calculated and properties relevant to nanoelectronic design are extracted including band gaps, effective masses, and density of states. The properties of these III-V nanowires are compared to silicon nanowires of comparable dimensions as a reference system. In nonpolar semiconductors, quantum confinement and surface chemistry are known to play a key role in the determination of nanowire electronic structure. InxGa1-xAs nanowires have in addition effects due to alloy stoichiometry on the cation sublattice and due to the polar nature of the cleaved nanowire surfaces. The impact of these additional factors on the electronic structure for these polar semiconductor nanowires is shown to be significant and necessary for accurate treatment of electronic structure properties.",
    "authors": [
      "Pedram Razavi",
      "James C. Greer"
    ],
    "publication_date": "2018-02-21T23:31:10Z",
    "arxiv_id": "http://arxiv.org/abs/1802.07848v1",
    "download_url": "https://arxiv.org/abs/1802.07848v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sub-arcsecond Imaging of the Complex Organic Chemistry in Massive Star-forming Region G10.6-0.4",
    "abstract": "Massive star-forming regions exhibit an extremely rich and diverse chemistry, which in principle provides a wealth of molecular probes, as well as laboratories for interstellar prebiotic chemistry. Since the chemical structure of these sources displays substantial spatial variation among species on small scales (${\\lesssim}10^4$ au), high angular resolution observations are needed to connect chemical structures to local environments and inform astrochemical models of massive star formation. To address this, we present ALMA 1.3 mm observations toward OB cluster-forming region G10.6-0.4 (hereafter \"G10.6\") at a resolution of 0.14$^{\\prime\\prime}$ (700 au). We find highly-structured emission from complex organic molecules (COMs) throughout the central 20,000 au, including two hot molecular cores and several shells or filaments. We present spatially-resolved rotational temperature and column density maps for a large sample of COMs and warm gas tracers. These maps reveal a range of gas substructure in both O- and N-bearing species. We identify several spatial correlations that can be explained by existing models of COM formation, including NH$_2$CHO/HNCO and CH$_3$OCHO/CH$_3$OCH$_3$, but also observe unexpected distributions and correlations which suggest that our current understanding of COM formation is far from complete. Importantly, complex chemistry is observed throughout G10.6, rather than being confined to hot cores. The COM composition appears to be different in the cores compared to the more extended structures, which illustrates the importance of high spatial resolution observations of molecular gas in elucidating the physical and chemical processes associated with massive star formation.",
    "authors": [
      "Charles J. Law",
      "Qizhou Zhang",
      "Karin I. Öberg",
      "Roberto Galván-Madrid",
      "Eric Keto",
      "Hauyu Baobab Liu",
      "Paul T. P. Ho"
    ],
    "publication_date": "2021-01-19T19:00:01Z",
    "arxiv_id": "http://arxiv.org/abs/2101.07801v1",
    "download_url": "https://arxiv.org/abs/2101.07801v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Metrics for Benchmarking and Uncertainty Quantification: Quality, Applicability, and a Path to Best Practices for Machine Learning in Chemistry",
    "abstract": "This review aims to draw attention to two issues of concern when we set out to make machine learning work in the chemical and materials domain, i.e., statistical loss function metrics for the validation and benchmarking of data-derived models, and the uncertainty quantification of predictions made by them. They are often overlooked or underappreciated topics as chemists typically only have limited training in statistics. Aside from helping to assess the quality, reliability, and applicability of a given model, these metrics are also key to comparing the performance of different models and thus for developing guidelines and best practices for the successful application of machine learning in chemistry.",
    "authors": [
      "Gaurav Vishwakarma",
      "Aditya Sonpal",
      "Johannes Hachmann"
    ],
    "publication_date": "2020-09-30T21:19:17Z",
    "arxiv_id": "http://arxiv.org/abs/2010.00110v2",
    "download_url": "https://arxiv.org/abs/2010.00110v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Basic considerations on broken-symmetry states of organic superconductors",
    "abstract": "In this brief account, we shall review the different mechanisms giving rise to itinerant and localized antiferromagnetism in quasi-one-dimensional organic conductors: the Bechgaard salts and their sulfur analogs. We will then focus on the problem of spin correlations and their impact on the pairing mechanism for organic superconductivity.",
    "authors": [
      "C. Bourbonnais"
    ],
    "publication_date": "2000-04-27T13:17:48Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0004470v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0004470v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Perseus ALMA Chemistry Survey (PEACHES). I. The Complex Organic Molecules in Perseus Embedded Protostars",
    "abstract": "To date, about two dozen low-mass embedded protostars exhibit rich spectra with lines of complex organic molecule (COM). These protostars seem to possess different enrichment in COMs. However, the statistics of COM abundance in low-mass protostars are limited by the scarcity of observations. This study introduces the Perseus ALMA Chemistry Survey (PEACHES), which aims at unbiasedly characterizing the chemistry of COMs toward the embedded (Class 0/I) protostars in the Perseus molecular cloud. Of 50 embedded protostars surveyed, 58% of them have emission from COMs. A 56%, 32%, and 40% of the protostars have CH$_3$OH, CH$_3$OCHO, and N-bearing COMs, respectively. The detectability of COMs depends neither on the averaged continuum brightness temperature, a proxy of the H$_2$ column density, nor on the bolometric luminosity and the bolometric temperature. For the protostars with detected COMs, CH$_3$OH has a tight correlation with CH$_3$CN, spanning more than two orders of magnitude in column densities normalized by the continuum brightness temperature, suggesting a chemical relation between CH$_3$OH and CH$_3$CN and a large chemical diversity in the PEACHES samples at the same time. A similar trend with more scatter is also found between all identified COMs, hinting at a common chemistry for the sources with COMs. The correlation between COMs is insensitive to the protostellar properties, such as the bolometric luminosity and the bolometric temperature. The abundance of larger COMs (CH$_3$OCHO and CH$_3$OCH$_3$) relative to that of smaller COMs (CH$_3$OH and CH$_3$CN) increases with the inferred gas column density, hinting at an efficient production of complex species in denser envelopes.",
    "authors": [
      "Yao-Lun Yang",
      "Nami Sakai",
      "Yichen Zhang",
      "Nadia M. Murillo",
      "Ziwei E. Zhang",
      "Aya E. Higuchi",
      "Shaoshan Zeng",
      "Ana López-Sepulcre",
      "Satoshi Yamamoto",
      "Bertrand Lefloch",
      "Mathilde Bouvier",
      "Cecilia Ceccarelli",
      "Tomoya Hirota",
      "Muneaki Imai",
      "Yoko Oya",
      "Takeshi Sakai",
      "Yoshimasa Watanabe"
    ],
    "publication_date": "2021-01-26T19:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/2101.11009v2",
    "download_url": "https://arxiv.org/abs/2101.11009v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Fine-tuning the complex organic molecule formation: sulfur and CO ice as regulators of surface chemistry",
    "abstract": "Grain-surface chemistry plays a crucial role in the formation of molecules of astrobiological interest, including H$_{2}$S and complex organic molecules (COMs). They are commonly observed in the gas phase toward star-forming regions, but their detection in ices remains limited. Combining gas-phase observations with chemical modeling is therefore essential for advancing our understanding of their chemistry. In this paper we investigate the factors that promote or hinder molecular complexity combining gas-phase observations of CH$_{3}$OH, H$_{2}$S, OCS, N$_{2}$H$^{+}$, and C$^{18}$O with chemical modeling in two dense cores: Barnard-1b and IC348. We observed millimeter emission lines of CH$_{3}$OH, H$_{2}$S, OCS, N$_{2}$H$^{+}$, and C$^{18}$O along strips using the IRAM 30m and Yebes 40m telescopes. We used the gas-grain chemical model \\texttt{Nautilus} to reproduce the observed abundance profiles adjusting parameters such as initial sulfur abundances and binding energies. H$_{2}$S, N$_{2}$H$^{+}$ and C$^{18}$O gas-phase abundances vary up to one order of magnitude towards the extinction peak. CH$_{3}$OH abundance remains quite uniform. These abundances can only be reproduced assuming a decreasing sulfur budget, which lowers H$_{2}$S and enhances CH$_{3}$OH abundances. Decreasing binding energies, which are expected in CO-rich apolar ices, are also required. The sulfur depletion required by H$_2$S is generally higher than that required by CH$_3$OH, suggesting unknown sulfur sinks. These findings highlight the intricate relationship between sulfur chemistry and COM formation, driven by the competition between sulfur and CO for hydrogen atoms. Our study emphasizes that the growth of CO ice and the progressive sequestration of hydrogen atoms by sulfur are critical in determining whether chemical complexity can develop, providing key insights into the early stages of star and planet formation.",
    "authors": [
      "D. Navarro-Almaida",
      "A. Taillard",
      "A. Fuente",
      "P. Caselli",
      "R. Martín-Doménech",
      "J. J. Miranzo-Pastor"
    ],
    "publication_date": "2025-07-23T15:27:16Z",
    "arxiv_id": "http://arxiv.org/abs/2507.17595v1",
    "download_url": "https://arxiv.org/abs/2507.17595v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry of Complex Organic Molecules in the V883 Ori Disk Revealed by ALMA Band 3 Observations",
    "abstract": "Complex organic molecules (COMs) in protoplanetary disks are key to understanding the origin of volatiles in comets in our solar system, yet the chemistry of COMs in protoplanetary disks remains poorly understood. Here we present Atacama Large Millimeter/submillimeter Array (ALMA) Band 3 observations of the disk around the young outbursting star V883 Ori, where the COMs sublimate from ices and are thus observable thanks to the warm condition of the disk. We have robustly identified ten oxygen-bearing COMs including $^{13}$C-isotopologues in the disk-integrated spectra. The radial distributions of the COM emission, revealed by the detailed analyses of the line profiles, show the inner emission cavity, similar to the previous observations in Band 6 and Band 7. We found that the COMs abundance ratios with respect to methanol are significantly higher than those in the warm protostellar envelopes of IRAS 16293-2422 and similar to the ratios in the solar system comet 67P/Churyumov-Gerasimenko, suggesting the efficient (re-)formation of COMs in protoplanetary disks. We also constrained the $^{12}$C/$^{13}$C and D/H ratios of COMs in protoplanetary disks for the first time. The $^{12}$C/$^{13}$C ratios of acetaldehyde, methyl formate, and dimethyl ether are consistently lower ($\\sim$ 20-30) than the canonical ratio in the interstellar medium ($\\sim$ 69), indicating the efficient $^{13}$C-fractionation of CO. The D/H ratios of methyl formate are slightly lower than the values in IRAS 16293-2422, possibly pointing to the destruction and reformation of COMs in disks. We also discuss the implications for nitrogen and sulfur chemistry in protoplanetary disks.",
    "authors": [
      "Yoshihide Yamato",
      "Shota Notsu",
      "Yuri Aikawa",
      "Yuki Okoda",
      "Hideko Nomura",
      "Nami Sakai"
    ],
    "publication_date": "2023-12-03T06:22:40Z",
    "arxiv_id": "http://arxiv.org/abs/2312.01300v1",
    "download_url": "https://arxiv.org/abs/2312.01300v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "On Lunn-Senior's Mathematical Model of Isomerism in Organic Chemistry. Part I",
    "abstract": "The aim of this paper is to present a generalization of Lunn-Senior's mathematical model of isomerism in organic chemistry. The main idea of Lunn and Senior is that if the type of isomerism is fixed, a molecule with a fixed skeleton and d univalent substituents has a symmetry group $W\\leq S_d$ which is generally not the molecule's 3-dimensional symmetry group. The unit character of W induces a representation of the symmetric group $S_d$ which governs the combinatorics of the isomers of the given molecule. Lunn-Senior's thesis is that certain non-negative integers established by this representation are upper boundaries of the corresponding numbers, yielded by the experiment (and often coincide with them). Moreover, the authors define (in a particular case) a partial order among the objects of the model, such that some simple substitution reactions correspond to inequalities. These two groups of data determine the group W, and produce so called \"type properties\" of the molecule (properties which do not depend on the nature of the univalent substituents). Our hypothesis is that if we replace the unit character of $W$ by any one-dimensional character of $W$ (thus we count only a part of the isomers - those having a maximum property), we also get a type property of the molecule. An instance of that is the inventory of the stereoisomers called chiral pairs. The formalism can be generalized naturally and produces some preliminary chemical results. Especially the partial order is defined and studied in the general case and indicates the possible genetic relations among the corresponding molecules. An important result of E. Ruch which connects the dominance order among partitions and the existence of chiral pairs is obtained as a consequence of a more general statement.",
    "authors": [
      "Valentin Vankov Iliev"
    ],
    "publication_date": "1999-03-26T16:25:05Z",
    "arxiv_id": "http://arxiv.org/abs/math/9903155v2",
    "download_url": "https://arxiv.org/abs/math/9903155v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The relationship between the number of editorial board members and the scientific output of universities in the chemistry field",
    "abstract": "Editorial board members, who are considered the gatekeepers of scientific journals, play an important role in academia, and may directly or indirectly affect the scientific output of a university. In this article, we used the quantile regression method among a sample of 1,387 university in chemistry to characterize the correlation between the number of editorial board members and the scientific output of their universities. Furthermore, we used time-series data and the Granger causality test to explore the causal relationship between the number of editorial board members and the number of articles of some top universities. Our results suggest that the number of editorial board members is positively and significantly related to the scientific output (as measured by the number of articles, total number of citations, citations per paper, and h index) of their universities. However, the Granger causality test results suggest that the causal relationship between the number of editorial board members and the number of articles of some top universities is not obvious. Combining these findings with the results of qualitative interviews with editorial board members, we discuss the causal relationship between the number of editorial board members and the scientific output of their universities.",
    "authors": [
      "Xing Wang"
    ],
    "publication_date": "2017-10-25T08:53:19Z",
    "arxiv_id": "http://arxiv.org/abs/1710.09713v1",
    "download_url": "https://arxiv.org/abs/1710.09713v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hot Organic Molecules Toward a Young Low-Mass Star: A Look at Inner Disk Chemistry",
    "abstract": "Spitzer Space Telescope spectra of the low mass young stellar object (YSO) IRS 46 (L_bol ~ 0.6 L_sun) in Ophiuchus reveal strong vibration-rotation absorption bands of gaseous C2H2, HCN, and CO2. This is the only source out of a sample of ~100 YSO's that shows these features and the first time they are seen in the spectrum of a solar-mass YSO. Analysis of the Spitzer data combined with Keck L- and M-band spectra gives excitation temperatures of > 350 K and abundances of 10(-6)-10(-5) with respect to H2, orders of magnitude higher than those found in cold clouds. In spite of this high abundance, the HCN J=4-3 line is barely detected with the James Clerk Maxwell Telescope, indicating a source diameter less than 13 AU. The (sub)millimeter continuum emission and the absence of scattered light in near-infrared images limits the mass and temperature of any remnant collapse envelope to less than 0.01 M_sun and 100 K, respectively. This excludes a hot-core type region as found in high-mass YSO's. The most plausible origin of this hot gas rich in organic molecules is in the inner (<6 AU radius) region of the disk around IRS 46, either the disk itself or a disk wind. A nearly edge-on 2-D disk model fits the spectral energy distribution (SED) and gives a column of dense warm gas along the line of sight that is consistent with the absorption data. These data illustrate the unique potential of high-resolution infrared spectroscopy to probe organic chemistry, gas temperatures and kinematics in the planet-forming zones close to a young star.",
    "authors": [
      "F. Lahuis",
      "E. F. van Dishoeck",
      "A. C. A. Boogert",
      "K. M. Pontoppidan",
      "G. A. Blake",
      "C. P. Dullemond",
      "N. J. Evans",
      "M. R. Hogerheijde",
      "J. K. Joergensen",
      "J. E. Kessler-Silacci",
      "C. Knez"
    ],
    "publication_date": "2005-11-29T09:05:33Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0511786v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0511786v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Why does hydronium diffuse faster than hydroxide in liquid water?",
    "abstract": "Proton transfer via hydronium and hydroxide ions in water is ubiquitous. It underlies acid-base chemistry, certain enzyme reactions, and even infection by the flu. Despite two-centuries of investigation, the mechanism underlying why hydronium diffuses faster than hydroxide in water is still not well understood. Herein, we employ state of the art Density Functional Theory based molecular dynamics, with corrections for nonlocal van der Waals interactions, and self-interaction in the electronic ground state, to model water and the hydrated water ions. At this level of theory, structural diffusion of hydronium preserves the previously recognized concerted behavior. However, by contrast, proton transfer via hydroxide is dominated by stepwise events, arising from a stabilized hyper-coordination solvation structure that discourages proton transfer. Specifically, the latter exhibits non-planar geometry, which agrees with neutron scattering results. Asymmetry in the temporal correlation of proton transfer enables hydronium to diffuse faster than hydroxide.",
    "authors": [
      "Mohan Chen",
      "Lixin Zheng",
      "Biswajit Santra",
      "Hsin-Yu Ko",
      "Robert A. DiStasio",
      "Michael L. Klein",
      "Roberto Car",
      "Xifan Wu"
    ],
    "publication_date": "2018-01-24T02:30:26Z",
    "arxiv_id": "http://arxiv.org/abs/1801.07841v1",
    "download_url": "https://arxiv.org/abs/1801.07841v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Complex Organic Molecules in Star-Forming Regions of the Magellanic Clouds",
    "abstract": "The Large and Small Magellanic Clouds (LMC and SMC), gas-rich dwarf companions of the Milky Way, are the nearest laboratories for detailed studies on the formation and survival of complex organic molecules (COMs) under metal poor conditions. To date, only methanol, methyl formate, and dimethyl ether have been detected in these galaxies - all three toward two hot cores in the N113 star-forming region in the LMC, the only extragalactic sources exhibiting complex hot core chemistry. We describe a small and diverse sample of the LMC and SMC sources associated with COMs or hot core chemistry, and compare the observations to theoretical model predictions. Theoretical models accounting for the physical conditions and metallicity of hot molecular cores in the Magellanic Clouds have been able to broadly account for the existing observations, but fail to reproduce the dimethyl ether abundance by more than an order of magnitude. We discuss future prospects for research in the field of complex chemistry in the low-metallicity environment. The detection of COMs in the Magellanic Clouds has important implications for astrobiology. The metallicity of the Magellanic Clouds is similar to galaxies in the earlier epochs of the Universe, thus the presence of COMs in the LMC and SMC indicates that a similar prebiotic chemistry leading to the emergence of life, as it happened on Earth, is possible in low-metallicity systems in the earlier Universe.",
    "authors": [
      "Marta Sewiło",
      "Steven B. Charnley",
      "Peter Schilke",
      "Vianney Taquet",
      "Joana M. Oliveira",
      "Takashi Shimonishi",
      "Eva Wirstrom",
      "Remy Indebetouw",
      "Jacob L. Ward",
      "Jacco Th. van Loon",
      "Jennifer Wiseman",
      "Sarolta Zahorecz",
      "Toshikazu Onishi",
      "Akiko Kawamura",
      "C. -H. Rosie Chen",
      "Yasuo Fukui",
      "Roya Hamedani Golshan"
    ],
    "publication_date": "2019-09-15T17:31:31Z",
    "arxiv_id": "http://arxiv.org/abs/1909.06843v1",
    "download_url": "https://arxiv.org/abs/1909.06843v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Before We Inject: Assessing the Impact of Silica-Based Aerosols on Stratospheric Chemistry via a Kinetic Model Informed by Molecular Dynamics",
    "abstract": "Stratospheric aerosol injection (SAI) has been proposed as a geoengineering strategy to mitigate global warming by increasing Earth's albedo. Silica-based materials, such as diamond-doped silica aerogels, have shown promising optical properties, but their impact on stratospheric chemistry, ozone one in particular, remains largely unknown. Here, we present first-principles molecular dynamics (MD) simulations of the heterogeneous reaction between hydrogen chloride ($\\mathrm{HCl}$) and chlorine nitrate ($\\mathrm{ClONO_2}$), two main reservoirs of stratospheric chlorine and nitrogen species, on a dry, hydroxylated $α$-quartz silica interface. Our results reveal a barrierless reaction pathway toward the formation of chlorine gas ($\\mathrm{Cl}_2$), a major contributor to stratospheric ozone loss. We design a heterogeneous kinetic model informed by our MD simulation and available experimental data: despite the barrierless formation of $\\mathrm{Cl_2}$, the higher surface affinities and partial pressures of $\\mathrm{HNO_3}$ and $\\mathrm{HCl}$ compared to those of $\\mathrm{ClONO_2}$ result in a negligible reaction probability, $γ_\\mathrm{ClONO_2}$, upon chlorine nitrate collision with the silica surface. Since $γ_\\mathrm{ClONO_2}$ enters as a proportionality constant in the definition of the heterogeneous reaction rate, our kinetic model indicates that the injection of silica-based aerosols may have only a limited impact on stratospheric ozone depletion driven by $\\mathrm{HCl}$ and $\\mathrm{ClONO_2}$ chemistry. At the same time, our findings also underscore the scarcity of experimental data, the need of better theoretical frameworks for the inclusion of MD results into kinetic models, and the urgency for further experimental validations of silica-based SAI technologies before their deployment in climate intervention strategies.",
    "authors": [
      "Dennis Lima",
      "Saif Al-Kuwari",
      "Ivan Gladich"
    ],
    "publication_date": "2025-12-23T13:50:25Z",
    "arxiv_id": "http://arxiv.org/abs/2512.20365v1",
    "download_url": "https://arxiv.org/abs/2512.20365v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]