[
  {
    "title": "Investigation of Organic Nanocrystallic Films by the Method of Raman Spectroscopy",
    "abstract": "Investigation of organic molecular films by a method Raman of a spectroscopy is carried out. It is shown, that values of frequencies of lines in a spectrum of the lattice oscillations of the molecular films are depressed in comparison with values of frequencies of similar lines in a monocrystal. Intensity of padding lines will increase in a spectrum of films. Allocation of an impurity in a film of an organic mixed crystal nonuniform. Examinations are lead by the example of a p-dibromobenzene and the mixed crystal a p-dichlorobenzene / p-dibromobenzene.",
    "authors": [
      "M. A. Korshunov"
    ],
    "publication_date": "2004-11-02T06:53:32Z",
    "arxiv_id": "http://arxiv.org/abs/physics/0411018v1",
    "download_url": "https://arxiv.org/abs/physics/0411018v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Cavity-controlled ultracold chemistry",
    "abstract": "Ultracold ground-state molecules can be formed from ultracold atoms via photoassociation followed by a spontaneous emission process. Typically, the molecular products are distributed over a range of final states. Here, we propose to use an optical cavity with high cooperativity to selectively enhance the population of a pre-determined final state by controlling the spontaneous emission. During this process, a photon will be emitted into the cavity mode. Detection of this photon heralds a single reaction. We discuss the efficiency and the dynamics of cavity-assisted molecule formation in the frame of realistic parameters that can be achieved in current ultracold-atom setups. In particular, we consider the production of Rb$_2$ molecules in the $a^3Σ_u$ triplet ground state. Moreover, when working with more than two atoms in the cavity, collective enhancement effects in chemistry should be observable.",
    "authors": [
      "Tobias Kampschulte",
      "Johannes Hecker Denschlag"
    ],
    "publication_date": "2018-03-27T10:41:41Z",
    "arxiv_id": "http://arxiv.org/abs/1803.10004v2",
    "download_url": "https://arxiv.org/abs/1803.10004v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "High-Order Harmonic Generation in Organic Molecular Crystals",
    "abstract": "High-order harmonic generation (HHG) is a powerful tool for probing electronic structure and ultrafast dynamics in matter. Traditionally studied in atomic and molecular gases, HHG has recently been extended to condensed matter, enabling all-optical investigations of electronic and crystal structures. Here, we experimentally demonstrate HHG in a new class of materials: thin organic molecular crystals with perfectly aligned molecules, using pentacene as a model system. Organic molecular crystals, characterized by weak intermolecular coupling, flat electronic bands, and large unit cells, differ fundamentally from conventional covalent or ionic crystals and have attracted significant interest as promising candidates for organic electronics. We show that pentacene crystals endure laser intensities sufficient for efficient HHG up to the 17th order. The harmonic yield as a function of laser polarization reveals a strong dependence on intermolecular interactions, with higher harmonic orders particularly sensitive to both nearest- and next-nearest-neighbor couplings. Model calculations indicate that weaker intermolecular interactions necessitate probing with higher harmonic orders to resolve the crystal structure. These findings suggest that HHG may serve as a powerful tool for probing the electronic structure of organic molecular crystals, enhancing all-optical techniques for studying electronic properties and ultrafast dynamics in complex organic materials.",
    "authors": [
      "Falk-Erik Wiechmann",
      "Samuel Schöpa",
      "Lina Bielke",
      "Svenja Rindelhardt",
      "Serguei Patchkovskii",
      "Felipe Morales",
      "Maria Richter",
      "Dieter Bauer",
      "Franziska Fennel"
    ],
    "publication_date": "2025-05-05T07:58:52Z",
    "arxiv_id": "http://arxiv.org/abs/2505.02432v1",
    "download_url": "https://arxiv.org/abs/2505.02432v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Giant Magnetoresistance Effect in Organic Material and Its Potential for Magnetic Sensor",
    "abstract": "Giant magnetoresistance (GMR) material has great potential as next generation magnetic field sensing devices, have magnetic properties and high electrical potential to be developed into various applications such as: magnetic field sensor measurements, current measurements, linear and rotational position sensor, data storage, head recording, and non-volatile magnetic random access memory (MRAM). Today, the new GMR materials based on organic material obtained after allowing for Organic Magnetoresistance (OMAR) was found in OLEDs (organic light-emitting diodes). This organic material is used as a spacer layer in GMR devices with spin-valve structures. Traditionally, metals and semiconductors are used as a spacer layer in spin-valve. However, several factors such as spin scattering caused by large atoms of the spacer material and the interface scattering of ferromagnetic with a spacer, will limit the efficiency of spin-valve. In this paper, we describe a new GMR materials based on organic material that we have developed.",
    "authors": [
      "Mitra Djamal",
      "Ramli",
      "Sparisoma Viridi",
      "Khairurrijal"
    ],
    "publication_date": "2011-10-06T00:31:58Z",
    "arxiv_id": "http://arxiv.org/abs/1110.1123v1",
    "download_url": "https://arxiv.org/abs/1110.1123v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Ultrathin Organic Transistors on Oxide Surfaces",
    "abstract": "In recent years, thin-film organic field-effect transistors (OFETs) have begun to be considered as a possible alternative to the hydrogenated amorphous silicon thin-film transistors (a-Si:H TFT's) used in active matrix flat panel displays and other large-area electronics applications. Low-temperature processability, low-cost fabrication and compatibility with arbitrary substrates are some of the promising advantages of OFETs, among others. Of the many organic materials available, pentacene, in particular, is one of the leading candidates for use in current thin-film OFET architectures - this because of its excellent electrical characteristics and its resistance to atmospheric oxygen. In the recent literature, pentacene's transport properties, as well as transistor performance, have already been analyzed from the point of view of substrate treatments, pentacene evaporation rate and substrate temperature, electrode chemical nature and channel geometry. The results show that the morphology, crystal structure and molecular ordering of the first organic monolayer(s) at the pentacene/dielectric interface are essential determinants of carrier transport phenomena. To further investigate these interface effects, we have built a model organic field-effect transistor which consists essentially of a single layer of pentacene on an oxide substrate. Four-probe and two-probe transport measurements as a function of temperature and fields will be presented in relation with structural near-field observations. The experimental results suggest a simple two-dimensional model where the equilibrium between free and trapped carriers at the oxide interface determines the OFET characteristics and performance.",
    "authors": [
      "Maren Daraktchiev",
      "Adrian von Muehlenen",
      "Frank Nuesch",
      "Michel Schaer",
      "Martin Brinkmann",
      "Marie-Noelle Bussac",
      "Libero Zuppiroli"
    ],
    "publication_date": "2004-08-26T08:49:21Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0408562v2",
    "download_url": "https://arxiv.org/abs/cond-mat/0408562v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A new class of organic molecular magnets",
    "abstract": "Using detailed first principles calculations, we have found a new class of stable organic molecular magnets based on zwitterionic molecules possessing donor, $π$ bridge, and acceptor groups. These molecules are organic molecules containing only C, H and N. The quantum mechanical nature of the magnetic properties originates from the conjugated $π$ bridge (involving only p electrons) where the exchange interactions between electron spin are relatively strong and local and are independent of the length of the $π$ bridge, enabling the easy construction of a molecular magnetic device with specified length.",
    "authors": [
      "William A. Shelton",
      "Edoardo Apra",
      "Bobby G. Sumpter",
      "Aldilene Saraiva-Souza",
      "Antonio G. Souza Filho",
      "Jordan Del Nero",
      "Vincent Meunier"
    ],
    "publication_date": "2008-12-03T20:25:09Z",
    "arxiv_id": "http://arxiv.org/abs/0812.0798v1",
    "download_url": "https://arxiv.org/abs/0812.0798v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "PAH chemistry at eV internal energies. 2. Ring alteration and dissociation",
    "abstract": "Recognized as important interstellar constituents, polycyclic aromatic hydrocarbons (PAHs) have been intensively studied in astrochemistry and their spectroscopy, thermodynamics, dynamics, and fragmentations are now amply documented. There exists typical alternatives to the ground-state regular planar structures of PAHs, as long as they bear internal energies in the range 1-10 eV. Resulting from intramolecular rearrangements, such high-lying minima on the potential- energy surfaces should be taken into consideration in the studies of PAH processing in astrophysical conditions. Resting upon DFT calculations mainly performed on two emblematic PAH representatives, coronene and pyrene, in their neutral and mono and multi-cationic states, this second survey addresses the following alternatives: (1) opened forms containing ethynyl or 2- butynyl groups, (2) vinylidene isomers, in which phenanthrene patterns are reorganized into dibenzofulvene ones, (3) twisted forms, where external CH=CH bonds can be partly twisted, and (4) bicyclobutane forms, in which the latter are integrated in saturated bicyclic forms. A few scenarios for elimination of fragments H, H2, C2H2 and C2H4 are explored. As far as possible, familiar concepts of organic chemistry, such as aromaticity or Clar's rules, are invoked for interpretations.",
    "authors": [
      "Georges Trinquier",
      "Aude Simon",
      "Mathias Rapacioli",
      "Florent Xavier Gadéa"
    ],
    "publication_date": "2017-02-13T15:39:17Z",
    "arxiv_id": "http://arxiv.org/abs/1702.03826v2",
    "download_url": "https://arxiv.org/abs/1702.03826v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Predicting Organic Reaction Outcomes with Weisfeiler-Lehman Network",
    "abstract": "The prediction of organic reaction outcomes is a fundamental problem in computational chemistry. Since a reaction may involve hundreds of atoms, fully exploring the space of possible transformations is intractable. The current solution utilizes reaction templates to limit the space, but it suffers from coverage and efficiency issues. In this paper, we propose a template-free approach to efficiently explore the space of product molecules by first pinpointing the reaction center -- the set of nodes and edges where graph edits occur. Since only a small number of atoms contribute to reaction center, we can directly enumerate candidate products. The generated candidates are scored by a Weisfeiler-Lehman Difference Network that models high-order interactions between changes occurring at nodes across the molecule. Our framework outperforms the top-performing template-based approach with a 10\\% margin, while running orders of magnitude faster. Finally, we demonstrate that the model accuracy rivals the performance of domain experts.",
    "authors": [
      "Wengong Jin",
      "Connor W. Coley",
      "Regina Barzilay",
      "Tommi Jaakkola"
    ],
    "publication_date": "2017-09-13T22:28:46Z",
    "arxiv_id": "http://arxiv.org/abs/1709.04555v3",
    "download_url": "https://arxiv.org/abs/1709.04555v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Recyclable Organic Bilayer Piezoresistive Cantilever for Torque Magnetometry at Cryogenic Temperatures",
    "abstract": "Flexible sensors made from organic bilayer films of molecular conductor on polymeric matrix have attracted many interest due to their simple fabrication with high potential for being scaled up, and for their high-performing multi-functionality at room temperatures. In particular, the piezoresistive property of the organic bilayer film is among one of the highest ever reported, allowing its utilization in various sensing applications. In this work, we present the study of the flexural piezoresistivity of an organic bilayer film based on $β-\\rm (BEDT-TTF)_2I_3$ on polycarbonate matrix from room temperatures down to cryogenics temperatures. Non-trivial temperature dependent profile of the gauge factor is revealed, including enhancement of the gauge factor from $\\sim 18$ at room temperatures to $\\sim 48$ at 4.3 K. An organic bilayer cantilever magnetometer is developed and demonstrated to measure magnetic properties of a single crystalline organic superconductor $κ-\\rm (BEDT-TTF)_2Cu(N(CN)_2)Br$ at temperatures down to $\\sim 2.75$ K and magnetic fields up to 5 T. The high-performing bilayer devices can be fabricated in a very simple manner, and they are robust and recyclable.",
    "authors": [
      "Eden Steven",
      "Danica Krstovska",
      "Daniel Suarez",
      "Tasya Berliana",
      "Eric Jobiliong",
      "Eun Sang Choi"
    ],
    "publication_date": "2023-07-28T14:15:54Z",
    "arxiv_id": "http://arxiv.org/abs/2307.15575v1",
    "download_url": "https://arxiv.org/abs/2307.15575v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Atoms and Molecules in Cavities: From Weak to Strong Coupling in QED Chemistry",
    "abstract": "In this work, we provide an overview of how well-established concepts in the fields of quantum chemistry and material sciences have to be adapted when the quantum nature of light becomes important in correlated matter-photon problems. Therefore, we analyze model systems in optical cavities, where the matter-photon interaction is considered from the weak- to the strong coupling limit and for individual photon modes as well as for the multi-mode case. We identify fundamental changes in Born-Oppenheimer surfaces, spectroscopic quantities, conical intersections and efficiency for quantum control. We conclude by applying our novel recently developed quantum-electrodynamical density-functional theory to single-photon emission and show how a straightforward approximation accurately describes the correlated electron-photon dynamics. This paves the road to describe matter-photon interactions from first-principles and addresses the emergence of new states of matter in chemistry and material science.",
    "authors": [
      "Johannes Flick",
      "Michael Ruggenthaler",
      "Heiko Appel",
      "Angel Rubio"
    ],
    "publication_date": "2016-09-13T15:42:09Z",
    "arxiv_id": "http://arxiv.org/abs/1609.03901v1",
    "download_url": "https://arxiv.org/abs/1609.03901v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sense and Sensitivity - I. Uncertainty analysis of the gas-phase chemistry in AGB outflows",
    "abstract": "Chemical reaction networks are central to all chemical models. Each rate coefficient has an associated uncertainty, which is generally not taken into account when calculating the chemistry. We performed the first uncertainty analysis of a chemical model of C-rich and O-rich AGB outflows using the Rate22 reaction network. Quantifying the error on the model predictions enables us to determine the need for adding complexity to the model. Using a Monte Carlo sampling method, we quantified the impact of the uncertainties on the chemical kinetic data on the predicted fractional abundances and column densities. The errors are caused by a complex interplay of reactions forming and destroying each species. Parent species show an error on their envelope sizes, which is not caused by the uncertainty on their photodissociation rate, but rather the chemistry reforming the parent after its photodissociation. Using photodissociation models to estimate the envelope size might be an oversimplification. The error on the CO envelope impacts retrieved mass-loss rates by up to a factor of two. For daughter species, the error on the peak fractional abundance ranges from a factor of a few to three orders of magnitude, and is on average about 10\\% of its value. This error is positively correlated with the error on the column density. The standard model suffices for many species, e.g., the radial distribution of cyanopolyynes and hydrocarbon radicals around IRC +10216. However, including spherical asymmetries, dust-gas chemistry, and photochemistry induced by a close-by stellar companion are still necessary to explain certain observations.",
    "authors": [
      "M. Van de Sande",
      "M. Gueguen",
      "T. Danilovich",
      "T. J. Millar"
    ],
    "publication_date": "2025-11-17T17:51:33Z",
    "arxiv_id": "http://arxiv.org/abs/2511.13638v1",
    "download_url": "https://arxiv.org/abs/2511.13638v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Multiorbital exciton formation in an organic semiconductor",
    "abstract": "Harnessing the optoelectronic response of organic semiconductors requires a thorough understanding of the fundamental light-matter interaction that is dominated by the excitation of correlated electron-hole pairs, i.e. excitons. The nature of these excitons would be fully captured by knowing the quantum-mechanical wavefunction, which, however, is difficult to access both theoretically and experimentally. Here, we use femtosecond photoemission orbital tomography in combination with many-body perturbation theory to gain access to exciton wavefunctions in organic semiconductors. We find that the coherent sum of multiple electron-hole pair contributions that typically make up a single exciton can be experimentally evidenced by photoelectron spectroscopy. For the prototypical organic semiconductor buckminsterfullerene (C$_{60}$), we show how to disentangle such multiorbital contributions and thereby access key properties of the exciton wavefunctions including localization, charge-transfer character, and ultrafast exciton formation and relaxation dynamics.",
    "authors": [
      "Wiebke Bennecke",
      "Andreas Windischbacher",
      "David Schmitt",
      "Jan Philipp Bange",
      "Ralf Hemm",
      "Christian S. Kern",
      "Gabriele D`Avino",
      "Xavier Blase",
      "Daniel Steil",
      "Sabine Steil",
      "Martin Aeschlimann",
      "Benjamin Stadtmueller",
      "Marcel Reutzel",
      "Peter Puschnig",
      "G. S. Matthijs Jansen",
      "Stefan Mathias"
    ],
    "publication_date": "2023-03-24T10:34:30Z",
    "arxiv_id": "http://arxiv.org/abs/2303.13904v1",
    "download_url": "https://arxiv.org/abs/2303.13904v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry in AGB stars: successes and challenges",
    "abstract": "Emission and absorption line observations of molecules in late-type stars are a vital component in our understanding of stellar evolution, dust formation and mass loss in these objects. The molecular composition of the gas in the circumstellar envelopes of AGB stars reflects chemical processes in gas whose properties are strong functions of radius with density and temperature varying by more than ten and two orders of magnitude, respectively. In addition, the interstellar UV field plays a critical role in determining not only molecular abundances but also their radial distributions. In this article, I shall briefly review some recent successful approaches to describing chemistry in both the inner and outer envelopes and outline areas of challenge for the future.",
    "authors": [
      "T. J. Millar"
    ],
    "publication_date": "2016-05-11T10:28:29Z",
    "arxiv_id": "http://arxiv.org/abs/1605.03365v1",
    "download_url": "https://arxiv.org/abs/1605.03365v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Subsurface chemistry of mantles of interstellar dust grains in dark molecular cores",
    "abstract": "Context. The abundances of many observed compounds in interstellar molecular clouds still lack an explanation, despite extensive research that includes both gas and solid (dust-grain surface) phase reactions. Aims. We aim to qualitatively prove the idea that a hydrogen-poor subsurface chemistry on interstellar grains is responsible for at least some of these chemical \"anomalies\". This chemistry develops in the icy mantles when photodissociation reactions in the mantle release free hydrogen, which escapes the mantle via diffusion. This results in serious alterations of the chemical composition of the mantle because pores in the mantle provide surfaces for reactions in the new, hydrogen-poor environment. Methods. We present a simple kinetic model, using existing astrochemical reaction databases. Gas phase, surface and subsurface pore reactions are included, as are physical transformations of molecules. Results. Our model produces significantly higher abundances for various oxidized species than most other models. We also obtain quite good results for some individual species that have adequate reaction network. Thus, we consider that the hydrogen-poor mantle chemistry may indeed play a role in the chemical evolution of molecular clouds. Conclusions. The significance of outward hydrogen diffusion has to be proved by further research. A huge number of solid phase reactions between many oxidized species is essential to obtain good, quantitative modeling results for a comparison with observations. We speculate that a variety of unobservable hydrogen-poor sulfur oxoacid derivatives may be responsible for the \"disappearance\" of sulfur in dark cloud cores.",
    "authors": [
      "Juris Kalvans",
      "Ivar Shmeld"
    ],
    "publication_date": "2012-07-11T16:06:19Z",
    "arxiv_id": "http://arxiv.org/abs/1207.2689v1",
    "download_url": "https://arxiv.org/abs/1207.2689v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Accelerating Stochastic Quantum Chemistry",
    "abstract": "The convergence of full configuration interaction quantum Monte Carlo (FCIQMC) is accelerated using a quasi-Newton propagation (QN) which can also be applied to coupled cluster Monte Carlo (CCMC). The computational scaling of this optimised propagation is O(1), keeping the additional computational cost to a bare minimum. Its effects are investigated deterministically and stochastically on a model system, the uniform electron gas, with Hilbert space size up to $10^{40}$ and shown to accelerate convergence of the instantaneous projected energy by over an order of magnitude in the FCIQMC test case. Its capabilities are then demonstrated with FCIQMC on an archetypical quantum chemistry problem, the chromium dimer, in an all-electron basis set with Hilbert space size of about $10^{22}$ yielding highly accurate FCI energies.",
    "authors": [
      "Verena A. Neufeld",
      "Alex J. W. Thom"
    ],
    "publication_date": "2019-10-11T14:22:00Z",
    "arxiv_id": "http://arxiv.org/abs/1910.05210v1",
    "download_url": "https://arxiv.org/abs/1910.05210v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-thermal desorption of complex organic molecules",
    "abstract": "The occurrence of complex organic molecules (COMs) in the gas phase at low temperature in the dense phases of the ISM suggests that a non-thermal desorption mechanism is at work because otherwise, COMs should condense within a short timescale onto dust grains. Vacuum ultraviolet photodesorption has been shown to be much less efficient for complex organic molecules, such as methanol, because mostly photoproducts are ejected. The induced photolysis competes with photodesorption for large COMs, considerably lowering the efficiency to desorb intact molecules. We investigate the sputtering efficiency of complex organic molecules that are observed either in the ice mantles of interstellar dense clouds directly by infrared spectroscopy (CH3OH), or that are observed in the gas phase by millimeter telescopes (CH3COOCH3) and that could be released from interstellar grain surfaces. We irradiated ice films containing complex organic molecules (methanol and methyl acetate) and water with swift heavy ions in the electronic sputtering regime. We monitored the infrared spectra of the film as well as the species released to the gas phase with a mass spectrometer. We demonstrate that when methanol or methyl acetate is embedded in a water-ice mantle exposed to cosmic rays, a large portion is sputtered as an intact molecule, with a sputtering yield close to that of the main water-ice matrix. This must be even more true for more volatile ice matrices, such as those that are embedded in carbon monoxide. Cosmic rays penetrating deep into dense clouds provide an efficient mechanism to desorb complex organic molecules. Compared to VUV photons induced by the interaction of cosmic rays, a large portion desorb as intact molecules with a proportion corresponding to the time-dependent bulk composition of the ice mantle, the latter evolving with time as a function of fluence due to the radiolysis of the bulk.",
    "authors": [
      "E. Dartois",
      "M. Chabot",
      "T. Id Barkach",
      "H. Rothard",
      "B. Augé",
      "A. N. Agnihotri",
      "A. Domaracka",
      "P. Boduch"
    ],
    "publication_date": "2019-06-07T13:25:32Z",
    "arxiv_id": "http://arxiv.org/abs/1906.03084v2",
    "download_url": "https://arxiv.org/abs/1906.03084v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic electronic-based neutron detectors",
    "abstract": "In recent decades organic electronics has entered the mainstream of consumer electronics, driven by innovations in scalability and low power applications, and low-cost fabrication methods. The potential for using organic semiconductor electronic devices as radiation detectors, and in particular for neutron detection is reported. We report results of laboratory tests using alpha particles as well as the response to thermal and fast neutrons covering the energy range 0.025 eV to 16.5 MeV. GEANT4 simulations are used to provide a detailed understanding of the performance and potential of this emerging technology for radiation detection.",
    "authors": [
      "Adrian J. Bevan",
      "Fani E. Taifakou",
      "Choudhry Z. Amjad",
      "Aled Horner",
      "C. Allwork",
      "A. J. Drew"
    ],
    "publication_date": "2024-12-02T14:01:11Z",
    "arxiv_id": "http://arxiv.org/abs/2412.04501v1",
    "download_url": "https://arxiv.org/abs/2412.04501v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Design of Massively Distributed Systems: A Complex Networks Perspective",
    "abstract": "The vision of Organic Computing addresses challenges that arise in the design of future information systems that are comprised of numerous, heterogeneous, resource-constrained and error-prone components or devices. Here, the notion organic particularly highlights the idea that, in order to be manageable, such systems should exhibit self-organization, self-adaptation and self-healing characteristics similar to those of biological systems. In recent years, the principles underlying many of the interesting characteristics of natural systems have been investigated from the perspective of complex systems science, particularly using the conceptual framework of statistical physics and statistical mechanics. In this article, we review some of the interesting relations between statistical physics and networked systems and discuss applications in the engineering of organic networked computing systems with predictable, quantifiable and controllable self-* properties.",
    "authors": [
      "Ingo Scholtes",
      "Claudio Juan Tessone"
    ],
    "publication_date": "2012-01-17T10:57:31Z",
    "arxiv_id": "http://arxiv.org/abs/1201.3480v1",
    "download_url": "https://arxiv.org/abs/1201.3480v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hybrid quantum-classical machine learning for generative chemistry and drug design",
    "abstract": "Deep generative chemistry models emerge as powerful tools to expedite drug discovery. However, the immense size and complexity of the structural space of all possible drug-like molecules pose significant obstacles, which could be overcome with hybrid architectures combining quantum computers with deep classical networks. As the first step toward this goal, we built a compact discrete variational autoencoder (DVAE) with a Restricted Boltzmann Machine (RBM) of reduced size in its latent layer. The size of the proposed model was small enough to fit on a state-of-the-art D-Wave quantum annealer and allowed training on a subset of the ChEMBL dataset of biologically active compounds. Finally, we generated 2331 novel chemical structures with medicinal chemistry and synthetic accessibility properties in the ranges typical for molecules from ChEMBL. The presented results demonstrate the feasibility of using already existing or soon-to-be-available quantum computing devices as testbeds for future drug discovery applications.",
    "authors": [
      "A. I. Gircha",
      "A. S. Boev",
      "K. Avchaciov",
      "P. O. Fedichev",
      "A. K. Fedorov"
    ],
    "publication_date": "2021-08-26T08:23:32Z",
    "arxiv_id": "http://arxiv.org/abs/2108.11644v3",
    "download_url": "https://arxiv.org/abs/2108.11644v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A three-phase approach to grain surface chemistry in protoplanetary disks: Gas, ice surfaces and ice mantles of dust grains",
    "abstract": "We study the effects of grain surface reactions on the chemistry of protoplanetary disks where gas, ice surface layers and icy mantles of dust grains are considered as three distinct phases. Gas phase and grain surface chemistry is found to be mainly driven by photo-reactions and dust temperature gradients. The icy disk interior has three distinct chemical regions: (i) the inner midplane with low FUV fluxes and warm dust ($\\gtrsim 15$K) that lead to the formation of complex organic molecules, (ii) the outer midplane with higher FUV from the ISM and cold dust where hydrogenation reactions dominate and, (iii) a molecular layer above the midplane but below the water condensation front where photodissociation of ices affects gas phase compositions. Some common radicals, e.g., CN and C$_2$H, exhibit a two-layered vertical structure and are abundant near the CO photodissociation front and near the water condensation front. The 3-phase approximation in general leads to lower vertical column densities than 2-phase models for many gas-phase molecules due to reduced desorption, e.g., H$_2$O, CO$_2$, HCN and HCOOH decrease by $\\sim$ two orders of magnitude. Finally, we find that many observed gas phase species originate near the water condensation front; photo-processes determine their column densities which do not vary significantly with key disk properties such as mass and dust/gas ratio.",
    "authors": [
      "Maxime Ruaud",
      "Uma Gorti"
    ],
    "publication_date": "2019-10-02T17:29:17Z",
    "arxiv_id": "http://arxiv.org/abs/1910.01097v1",
    "download_url": "https://arxiv.org/abs/1910.01097v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Deuterium Chemistry in the Young Massive Protostellar Core NGC 2264 CMM3",
    "abstract": "In this work we present the first attempt of modelling the deuterium chemistry in the massive young protostellar core NGC 2264 CMM3. We investigated the sensitivity of this chemistry to the physical conditions in its surrounding environment. The results showed that deuteration, in the protostellar gas, is affected by variations in the core density, the amount of gas depletion onto grain surfaces, the CR ionisation rate, but it is insensitive to variations in the H$_2$ ortho-to-para ratio.\n  Our results, also, showed that deuteration is often enhanced in less-dense, partially depleted ($<$ 85\\%), or cores that are exerted to high CR ionisation rates ($\\ge$ 6.5 $\\times$ 10$^{-17}$ s$^{-1}$ ). However, in NGC 2264 CMM3, decreasing the amount of gas depleted onto grains and enhancing the CR ionisation rate are often overestimating the observed values in the core. The best fit time to observations occurs around (1 - 5) $\\times$ 10$^4$ yrs for core densities in the range (1 - 5) $\\times$ 10$^6$ cm$^{-3}$ with CR ionisation rate between (1.7 - 6.5)$\\times$ 10$^{-17}$ s$^{-1}$. These values are in agreement with the results of the most recent theoretical chemical model of CMM3, and the time range of best fit is, also, in-line with the estimated age of young protostellar objects.\n  We conclude that deuterium chemistry in protostellar cores is: (i) sensitive to variations in the physical conditions in its environment, %(ii) deuteration in the protostellar gas is (ii) insensitive to changes in the H$_2$ ortho-to-para ratio. %, but is sensitive to these variations in the dark cloud phase. We also conclude that the core NGC 2264 CMM3 is in its early stages of chemical evolution with an estimated age of (1 - 5) $\\times$ 10$^4$ yrs.",
    "authors": [
      "Z. Awad",
      "O. M. Shalabiea"
    ],
    "publication_date": "2017-12-12T02:04:44Z",
    "arxiv_id": "http://arxiv.org/abs/1712.04096v1",
    "download_url": "https://arxiv.org/abs/1712.04096v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Superconducting Two-Dimensional Metal-Organic Framework",
    "abstract": "Superconductivity is a fascinating quantum phenomenon characterized by zero electrical resistance and the Meissner effect. To date, several distinct families of superconductors (SCs) have been discovered. These include three-dimensional (3D) bulk SCs in both inorganic and organic materials as well as two-dimensional (2D) thin film SCs but only in $inorganic$ materials. Here we predict superconductivity in 2D and 3D $organic$ metal-organic frameworks by using first-principles calculations. We show that the highly conductive and recently synthesized Cu-benzenehexathial (BHT) is a Bardeen-Cooper-Schrieffer SC. Remarkably, the monolayer Cu-BHT has a critical temperature ($T_{c}$) of 4.43 K while $T_{c}$ of bulk Cu-BHT is 1.58 K. Different from the enhanced $T_{c}$ in 2D inorganic SCs which is induced by interfacial effects, the $T_{c}$ enhancement in this 2D organic SC is revealed to be the out-of-plane soft-mode vibrations, analogous to surface mode enhancement originally proposed by $Ginzburg$. Our findings not only shed new light on better understanding 2D superconductivity, but also open a new direction to search for SCs by interface engineering with organic materials.",
    "authors": [
      "Xiaoming Zhang",
      "Yinong Zhou",
      "Bin Cui",
      "Mingwen Zhao",
      "Feng Liu"
    ],
    "publication_date": "2017-04-03T09:22:47Z",
    "arxiv_id": "http://arxiv.org/abs/1704.00490v1",
    "download_url": "https://arxiv.org/abs/1704.00490v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mineralogy, chemistry and composition of organic compounds in the fresh carbonaceous chondrite Mukundpura: CM1 or CM2?",
    "abstract": "We present here several laboratory analyses performed on the freshly fallen Mukundpura CM chondrite. Results of infrared transmission spectroscopy, thermogravimetry analysis and reflectance spectroscopy show that Mukundpura is mainly composed of phyllosilicates. The rare earth trace elements composition and ultrahigh resolution mass spectrometry of the soluble organic matter (SOM) give results consistent with CM chondrites. Finally, Raman spectroscopy shows no signs of thermal alteration of the meteorite. All the results agree that Mukundpura has been strongly altered by water on its parent body. Comparison of the results obtained on the meteorite with those of other chondrites of known petrologic types lead to the conclusion that Mukundpura is similar to CM1 chondrites, which differs from its original classification as a CM2.",
    "authors": [
      "S. Potin",
      "P. Beck",
      "L. Bonal",
      "B. Schmitt",
      "A. Garenne",
      "F. Moynier",
      "A. Agranier",
      "P. Schmitt-Kopplin",
      "A. K. Malik",
      "E. Quirico"
    ],
    "publication_date": "2020-09-29T14:00:27Z",
    "arxiv_id": "http://arxiv.org/abs/2009.14029v1",
    "download_url": "https://arxiv.org/abs/2009.14029v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Anytime Learning - The next Step in Organic Computing?",
    "abstract": "Anytime learning describes a relatively novel concept by which systems are able to acquire knowledge about a changing environment and adapt and behave accordingly to this. \"Anytime\" refers to the fact that the system is capable of returning imperfect results at any point in time, which allows it to remain functional even if a perfect solution could not be found within the necessary time frame. This paper focuses on illustrating the concept of anytime learning and examining how it relates to organic computing as a whole. Could anytime learning be the next step in organic computing?",
    "authors": [
      "Lucas Breitsameter"
    ],
    "publication_date": "2018-08-22T23:39:46Z",
    "arxiv_id": "http://arxiv.org/abs/1808.07590v1",
    "download_url": "https://arxiv.org/abs/1808.07590v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Transboundary secondary organic aerosol in western Japan indicated by stable carbon isotope ratio of low volatile water-soluble organic carbon and signal at m/z 44 in organic aerosol mass spectra",
    "abstract": "Field studies were conducted in the winter of 2010 at two rural sites and an urban site in western Japan, and filter samples of total suspended particulate matter were collected every 24-h and analyzed for concentration and stable carbon isotope ratio (delta13C) of low volatile water-soluble organic carbon (LV-WSOC). Concentration of major chemical species in fine aerosol (<1.0 micron) was also measured in real time by Aerodyne aerosol mass spectrometers. Oxidation state of organic aerosol was evaluated using the proportion of signal at m/z 44 (fragment ions of carboxyl group) to the sum of all m/z signals of organic mass spectra (f44). Analyses show a high correlation between LV-WSOC and m/z 44 concentrations, suggesting that the LV-WSOC is likely associated with water soluble carboxylic acids in the fine aerosol. Plots of delta13C of LV-WSOC versus f44 exhibit systematic trends at the rural sites and random variation at the urban site. The systematic trends qualitatively agree with a simple binary mixture model of secondary organic aerosol and background LV-WSOC that has delta13C of -17 permil or higher and f44 of approximately 0.06, respectively. Comparison with references suggests that the source of background LV-WSOC is likely biomass burning of C4 plants.",
    "authors": [
      "Satoshi Irei",
      "Akinori Takami",
      "Masahiko Hayashi",
      "Yasuhiro Sadanaga",
      "Keiichiro Hara",
      "Naoki Kaneyasu",
      "Kei Sato",
      "Takemitsu Arakaki",
      "Shiro Hatakeyama",
      "Hiroshi Bandow",
      "Toshihide Hikida",
      "Akio Shimono"
    ],
    "publication_date": "2013-09-07T08:15:55Z",
    "arxiv_id": "http://arxiv.org/abs/1309.1836v4",
    "download_url": "https://arxiv.org/abs/1309.1836v4",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Seeds Of Life In Space (SOLIS): The organic composition diversity at 300--1000 au scale in Solar-type star forming regions",
    "abstract": "Complex organic molecules have been observed for decades in the interstellar medium. Some of them might be considered as small bricks of the macromolecules at the base of terrestrial life. It is hence particularly important to understand organic chemistry in Solar-like star forming regions. In this article, we present a new observational project: SOLIS (Seeds Of Life In Space). This is a Large Project at the IRAM-NOEMA interferometer, and its scope is to image the emission of several crucial organic molecules in a sample of Solar-like star forming regions in different evolutionary stage and environments. Here, we report the first SOLIS results, obtained from analysing the spectra of different regions of the Class 0 source NGC1333-IRAS4A, the protocluster OMC-2 FIR4, and the shock site L1157-B1. The different regions were identified based on the images of formamide (NH2CHO) and cyanodiacetylene (HC5N) lines. We discuss the observed large diversity in the molecular and organic content, both on large (3000-10000 au) and relatively small (300-1000 au) scales. Finally, we derive upper limits to the methoxy fractional abundance in the three observed regions of the same order of magnitude of that measured in few cold prestellar objects, namely ~10^-12-10^-11 with respect to H2 molecules.",
    "authors": [
      "C. Ceccarelli",
      "P. Caselli",
      "F. Fontani",
      "R. Neri",
      "A. Lopez-Sepulcre",
      "C. Codella",
      "S. Feng",
      "I. Jimenez-Serra",
      "B. Lefloch",
      "J. E. Pineda",
      "C. Vastel",
      "F. Alves",
      "R. Bachiller",
      "N. Balucani",
      "E. Bianchi",
      "L. Bizzocchi",
      "S. Bottinelli",
      "E. Caux",
      "A. Chacon-Tanarro",
      "R. Choudhury",
      "A. Coutens",
      "F. Dulieu",
      "C. Favre",
      "P. Hily-Blant",
      "J. Holdship",
      "C. Kahane",
      "A. Jaber Al-Edhari",
      "J. Laas",
      "J. Ospina",
      "Y. Oya",
      "L. Podio",
      "A. Pon",
      "A. Punanova",
      "D. Quenard",
      "A. Rimola",
      "N. Sakai",
      "I. R. Sim",
      "S. Spezzano",
      "V. Taquet",
      "L. Testi",
      "P. Theule",
      "P. Ugliengo",
      "A. I. Vasyunin",
      "S. Viti",
      "L. Wiesenfeld",
      "S. Yamamoto"
    ],
    "publication_date": "2017-10-28T09:51:12Z",
    "arxiv_id": "http://arxiv.org/abs/1710.10437v1",
    "download_url": "https://arxiv.org/abs/1710.10437v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Efficient charge separation in organic photovoltaics through incoherent hopping",
    "abstract": "We demonstrate that efficient and nearly field-independent charge separation in organic planar heterojunction solar cells can be described by an incoherent hopping mechanism. We model the separation efficiency of electron-hole pairs created at donor-acceptor organic interfaces. By using kinetic Monte Carlo simulations that include the effect of on-chain delocalization we show that efficient charge extraction to the electrodes requires bipolar transport and increased dimensionality. This model explains experimental results of almost field independent charge separation in some molecular systems and provides important guidelines at the molecular level for maximizing the efficiencies of organic solar cells.",
    "authors": [
      "Stavros Athanasopoulos",
      "Steffen Tscheuschner",
      "Heinz Bässler",
      "Anna Köhler"
    ],
    "publication_date": "2016-11-02T00:01:10Z",
    "arxiv_id": "http://arxiv.org/abs/1611.00427v1",
    "download_url": "https://arxiv.org/abs/1611.00427v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Why do surface tensions of most of organic liquids demonstrate close values?",
    "abstract": "Values of surface tension of most of organic liquids are of the same order of magnitude. The natural explanation for this lies in the fact that surface tension is governed by London dispersion forces, which are independent of the permanent dipole moment of molecules. The surface tension of organic liquids (with the exception of polymers and polymer solutions) depends on the ionization potential and the diameter of the molecule only. These parameters vary slightly for organic liquids.",
    "authors": [
      "Edward Bormashenko"
    ],
    "publication_date": "2010-06-02T12:17:31Z",
    "arxiv_id": "http://arxiv.org/abs/1006.0356v1",
    "download_url": "https://arxiv.org/abs/1006.0356v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin transport and bipolaron density in organic polymers",
    "abstract": "We present a theory for spin-polarized transport through a generic organic polymer connected to ferromagnetic leads with arbitrary angle theta between their magnetization directions, taking into account the polaron and bipolaron states as effective charge and spin carriers. Within a diffusive description of polaron-bipolaron transport including polaron-bipolaron conversion, we find that the bipolaron density depends on the angle theta. This is remarkable, given the fact that bipolarons are spinless quasiparticles, and opens a new way to probe spin accumulation in organic polymers.",
    "authors": [
      "P. Ingenhoven",
      "R. Egger",
      "U. Zülicke"
    ],
    "publication_date": "2009-03-10T08:14:42Z",
    "arxiv_id": "http://arxiv.org/abs/0903.1707v2",
    "download_url": "https://arxiv.org/abs/0903.1707v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Identifying the Bottleneck for Heat Transport in Metal-Organic Frameworks",
    "abstract": "Controlling the transport of thermal energy is key to most applications of metal-organic frameworks. Analyzing the evolution of the effective local temperature, the interfaces between the metal nodes and the organic linkers are identified as the primary bottlenecks for heat conduction. Consequently, changing the bonding strength at that node-linker interface and the mass of the metal atoms can be exploited to tune the thermal conductivity. This insight is generated employing molecular dynamics simulations in conjunction with advanced, ab initio parametrized force fields. The focus of the present study is on MOF-5 as a prototypical example of an isoreticular MOF. Still, the key findings prevail for different node structures and node-linker bonding chemistries. The presented results lay the foundation for developing detailed structure-to-property relationships for thermal transport in MOFs with the goal of devising strategies for the application-specific optimization of heat conduction.",
    "authors": [
      "Sandro Wieser",
      "Tomas Kamencek",
      "Johannes P. Dürholt",
      "Rochus Schmid",
      "NataliaBedoya-Martínez",
      "Egbert Zojer"
    ],
    "publication_date": "2020-08-24T12:32:52Z",
    "arxiv_id": "http://arxiv.org/abs/2008.10372v1",
    "download_url": "https://arxiv.org/abs/2008.10372v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Theory of Nanoscale Organic Cavities: The Essential Role of Vibration-Photon Dressed States",
    "abstract": "The interaction of organic molecules and molecular aggregates with electromagnetic fields that are strongly confined inside optical cavities within nanoscale volumes, has allowed the observation of exotic quantum regimes of light-matter interaction at room temperature, for a wide variety of cavity materials and geometries. Understanding the universal features of such organic cavities represents a significant challenge for theoretical modelling, as experiments show that these systems are characterized by an intricate competition between coherent and dissipative processes involving entangled nuclear, electronic and photonic degrees of freedom. In this review, we discuss a new theoretical framework that can successfully describe organic cavities under strong light-matter coupling. The theory combines standard concepts in chemical physics and quantum optics to provide a microscopic description of vibronic organic polaritons that is fully consistent with available experiments, and yet is profoundly different from the common view of organic polaritons. We show that by introducing a new class of vibronic polariton wave functions with a photonic component that is dressed by intramolecular vibrations, the new theory can offer a consistent solution to some of the long-standing puzzles in the interpretation of organic cavity photoluminescence. Throughout this review, we confront the predictions of the model with spectroscopic observations, and describe the conditions under which the theory reduces to previous approaches. We finally discuss possible extensions of the theory to account for realistic complexities of organic cavities such spatial inhomogeneities and the multi-mode nature of confined electromagnetic fields.",
    "authors": [
      "Felipe Herrera",
      "Frank C. Spano"
    ],
    "publication_date": "2017-07-10T18:00:09Z",
    "arxiv_id": "http://arxiv.org/abs/1707.02992v1",
    "download_url": "https://arxiv.org/abs/1707.02992v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quasi-two-dimensional organic superconductors: a review",
    "abstract": "We present a review of quasi-two-dimensional organic superconductors. These systems exhibit many interesting phenomena, including reduced dimensionality, strong electron-electron and electron-phonon interactions and the proximity of antiferromagnetism, insulator states and superconductivity. Moreover, it has been possible to measure the electronic bands of many of the organics in great detail, in contrast to the situation in other well-known systems in which similar phenomena occur. We describe the crystal structure and normal-state properties of the organics, before presenting the experimental evidence for and against exotic superconductivity mediated by antiferromagnetic fluctuations. Finally, three instances of field-induced unconventional superconductivity will be described.",
    "authors": [
      "John Singleton",
      "Charles Mielke"
    ],
    "publication_date": "2002-02-25T12:00:05Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0202442v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0202442v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Game Theory Analysis of Third-Party Regulation in Organic Supply Chains",
    "abstract": "As people become more conscious of their health and the environment, the demand for organic food is expected to increase. However, distinguishing organic products from conventionally produced ones can be hard, creating a problem where producers may have the incentive to label their conventional products as organic to sell them at a higher price. Game theory can help to analyze the strategic interactions between producers and consumers in order to help consumers verifying these claims. Through a game theory analysis approach, this paper provides evidence of the need for a third party to equalize markets and foster trust in organic supply chains. Therefore, government regulation, including regular and random monitoring and certification requirements, plays a crucial role in achieving the desired level of trust and information exchange among supply chain agents, which ultimately determines the growth trajectory of the sector.",
    "authors": [
      "Joao Zambujal-Oliveira",
      "Andre Silva",
      "Rui Vasconcelos"
    ],
    "publication_date": "2025-10-14T11:58:01Z",
    "arxiv_id": "http://arxiv.org/abs/2510.12420v3",
    "download_url": "https://arxiv.org/abs/2510.12420v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic direct and indirect effects with post-treatment common causes of mediator and outcome",
    "abstract": "Most of the literature on direct and indirect effects assumes that there are no post-treatment common causes of the mediator and the outcome. In contrast to natural direct and indirect effects, organic direct and indirect effects, which were introduced in Lok (2016, 2020), can be extended to provide an identification result for settings with post-treatment common causes of the mediator and the outcome. This article provides a definition and an identification result for organic direct and indirect effects in the presence of post-treatment common causes of mediator and outcome. These new organic indirect and direct effects have interpretations in terms of intervention effects. Organic indirect effects in the presence of post-treatment common causes are an addition to indirect effects through multivariate mediators. Organic indirect effects in the presence of post-treatment common causes can be used e.g. 1. to predict the effect of the initial treatment if its side affects are suppressed through additional interventions or 2. to predict the effect of a treatment that does not affect the post-treatment common cause and affects the mediator the same way as the initial treatment.",
    "authors": [
      "Judith J Lok"
    ],
    "publication_date": "2015-10-09T18:12:48Z",
    "arxiv_id": "http://arxiv.org/abs/1510.02753v2",
    "download_url": "https://arxiv.org/abs/1510.02753v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Generative chemistry: drug discovery with deep learning generative models",
    "abstract": "The de novo design of molecular structures using deep learning generative models introduces an encouraging solution to drug discovery in the face of the continuously increased cost of new drug development. From the generation of original texts, images, and videos, to the scratching of novel molecular structures, the incredible creativity of deep learning generative models surprised us about the height machine intelligence can achieve. The purpose of this paper is to review the latest advances in generative chemistry which relies on generative modeling to expedite the drug discovery process. This review starts with a brief history of artificial intelligence in drug discovery to outline this emerging paradigm. Commonly used chemical databases, molecular representations, and tools in cheminformatics and machine learning are covered as the infrastructure for the generative chemistry. The detailed discussions on utilizing cutting-edge generative architectures, including recurrent neural network, variational autoencoder, adversarial autoencoder, and generative adversarial network for compound generation are focused. Challenges and future perspectives follow.",
    "authors": [
      "Yuemin Bian",
      "Xiang-Qun Xie"
    ],
    "publication_date": "2020-08-20T14:38:21Z",
    "arxiv_id": "http://arxiv.org/abs/2008.09000v1",
    "download_url": "https://arxiv.org/abs/2008.09000v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Sulfur chemistry and isotopic ratios in the starburst galaxy NGC 253",
    "abstract": "Based on observations of the most abundant sulfur-bearing molecules (H2S, CS, NS, SO, H2CS, OCS, and SO2) carried out with the IRAM 30m telescope and SEST, we present the first analysis of the sulfur chemistry of an extragalactic source, the nuclear region of the starburst galaxy NGC 253. This is the first time that H2S and, tentatively, H2CS are detected towards the nucleus of a starburst galaxy. Source averaged fractional abundances of these molecules are a few 10^-9, except for CS and OCS which are more abundant (10^-8). Sulfur isotopic ratios, 32S/34S~8+-2 and 34S/33S>9, are measured through observations of 13CS, C34S, and C33S. A comparison with the observed relative abundances towards different prototypical Galactic sources suggests that the chemical composition of NGC 253 is similar to that found towards the molecular clouds complexes like Sgr B2 in the nuclear region of the Milky Way. The large overabundance of OCS compared to the predictions of time-dependent sulfur chemistry models supports the idea that OCS is likely injected into the gas phase from the grain mantles by low velocity shocks.",
    "authors": [
      "S. Martín",
      "J. Martín-Pintado",
      "R. Mauersberger",
      "C. Henkel",
      "S. García-Burillo"
    ],
    "publication_date": "2004-10-19T15:51:33Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0410446v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0410446v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Investigation on organic magnetoconductance based on polaron-bipolaron transition",
    "abstract": "We explore the magnetoresistance (MC) effect in an organic semiconductor device based on the magnetic field related bipolaron formation. By establishing a group of dynamic equations, we present the transition among spin-parallel, spin-antiparallel polaron pairs and bipolarons. The transition rates are adjusted by the external magnetic field as well as the hyperfine interaction of the hydrogen nuclei. The hyperfine interaction is addressed and treated in the frame work of quantum mechanics. By supposing the different mobility of polarons from that of bipolarons, we obtain the MC in an organic semiconductor device. The theoretical calculation is well consistent to the experimental data. It is predicated that a maximum MC appears at a suitable branching ratio of bipolarons. Our investigation reveals the important role of hyperfine interaction in organic magnetic effect.",
    "authors": [
      "W. Qin",
      "S. Yin",
      "K. Gao",
      "S. J. Xie"
    ],
    "publication_date": "2012-03-02T03:38:12Z",
    "arxiv_id": "http://arxiv.org/abs/1203.0362v2",
    "download_url": "https://arxiv.org/abs/1203.0362v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Research progress of rubrene as an excellent multifunctional organic semiconductor",
    "abstract": "Rubrene, a superstar in organic semiconductors, has achieved unprecedented achievements in the application of electronic devices, and research based on its various photoelectric properties is still in progress. In this review, we introduced the preparation of rubrene crystal, summarized the applications in organic optoelectronic devices with the latest research achievements based on rubrene semiconductors. An outlook of future research directions and challenges of rubrene semiconductor for applications is also provided.",
    "authors": [
      "Si Liu",
      "Hongnan Wu",
      "Xiaotao Zhang",
      "Wenping Hu"
    ],
    "publication_date": "2020-09-24T09:28:21Z",
    "arxiv_id": "http://arxiv.org/abs/2009.11565v1",
    "download_url": "https://arxiv.org/abs/2009.11565v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The Non-Organic Theory of the Genesis of Petroleum",
    "abstract": "Recent advances in interdisciplinary fields as diverse as astrophysics, cosmogeophysics, nuclear geology, etc. have led to interesting developments in the non-organic theory of the genesis of petroleum. This theory, which holds that petroleum is of an abiogenic primordial origin, provides an explanation for certain features of petroleum geology that are hard to explain within the standard organic framework. If the non-organic theory is correct, then hydrocarbon reserves would be enormous and almost inexhaustable.",
    "authors": [
      "Samar Abbas"
    ],
    "publication_date": "1996-10-15T10:03:12Z",
    "arxiv_id": "http://arxiv.org/abs/physics/9610011v1",
    "download_url": "https://arxiv.org/abs/physics/9610011v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Toward a Theoretical Roadmap for Organic Memristive Materials",
    "abstract": "Neuromorphic computing aspires to overcome the intrinsic inefficiencies of von Neumann architectures by co-locating memory and computation in physical devices that emulate biological neurons and synapses. Memristive materials stand at the core of this paradigm, enabling non-volatile, history-dependent electronic responses. While inorganic oxides currently dominate the field, molecular and polymeric systems can offer untapped advantages in terms of chemical tunability, structural flexibility, low-cost processing, and biocompatibility. However, progress has been hindered by the absence of a theoretical framework able to rationalize how molecular structure translates into memristive function. Here, a multiscale computational perspective is presented, outlining how quantum chemistry and molecular dynamics, among other approaches, can be integrated into a coherent methodology to design next-generation organic memristors. Three mechanisms, ionic migration, redox-driven switching, and conduction interplay in chiral molecules are examined as representative routes toward molecular neuromorphic hardware. The opportunities and challenges associated with each mechanism are discussed, together with a view on how a theoretically guided roadmap can accelerate the emergence of chemically engineered synaptic materials.",
    "authors": [
      "Salvador Cardona-Serra"
    ],
    "publication_date": "2025-12-05T11:01:14Z",
    "arxiv_id": "http://arxiv.org/abs/2512.05617v1",
    "download_url": "https://arxiv.org/abs/2512.05617v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The influence of impurities on the charge carrier mobility of small molecule organic semiconductors",
    "abstract": "Amorphous organic semiconductors based on small molecules and polymers are used in many applications, most prominently organic light emitting diodes (OLEDs) and organic solar cells. Impurities and charge traps are omnipresent in most currently available organic semiconductors and limit charge transport and thus device efficiency. The microscopic cause as well as the chemical nature of these traps are presently not well understood. Using a multiscale model we characterize the influence of impurities on the density of states and charge transport in small-molecule amorphous organic semiconductors. We use the model to quantitatively describe the influence of water molecules and water-oxygen complexes on the electron and hole mobilities. These species are seen to impact the shape of the density of states and to act as explicit charge traps within the energy gap. Our results show that trap states introduced by molecular oxygen can be deep enough to limit the electron mobility in widely used materials.",
    "authors": [
      "Pascal Friederich",
      "Artem Fediai",
      "Jing Li",
      "Anirban Mondal",
      "Naresh B. Kotadiya",
      "Franz Symalla",
      "Gert-Jan A. H. Wetzelaer",
      "Denis Andrienko",
      "Xavier Blase",
      "David Beljonne",
      "Paul W. M. Blom",
      "Jean-Luc Brédas",
      "Wolfgang Wenzel"
    ],
    "publication_date": "2019-08-30T17:30:40Z",
    "arxiv_id": "http://arxiv.org/abs/1908.11854v2",
    "download_url": "https://arxiv.org/abs/1908.11854v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Hardness of classically sampling quantum chemistry circuits",
    "abstract": "Significant advances have been made in the study of quantum advantage both in theory and experiment, although these have mostly been limited to artificial setups. In this work, we extend the scope to address quantum advantage in tasks relevant to chemistry and physics. Specifically, we consider the unitary cluster Jastrow (UCJ) ansatz-a variant of the unitary coupled cluster ansatz, which is widely used to solve the electronic structure problem on quantum computers-to show that sampling from the output distributions of quantum circuits implementing the UCJ ansatz is likely to be classically hard. More specifically, we show that there exist UCJ circuits for which classical simulation of sampling cannot be performed in polynomial time, under a reasonable complexity-theoretical assumption that the polynomial hierarchy does not collapse. Our main contribution is to show that a class of UCJ circuits can be used to perform arbitrary instantaneous quantum polynomial-time (IQP) computations, which are already known to be classically hard to simulate under the same complexity assumption. As a side result, we also show that UCJ equipped with post-selection can generate the class post-BQP. Our demonstration, worst-case nonsimulatability of UCJ, would potentially imply quantum advantage in quantum algorithms for chemistry and physics using unitary coupled cluster type ansatzes, such as the variational quantum eigensolver and quantum-selected configuration interaction.",
    "authors": [
      "Ayoub Hafid",
      "Hokuto Iwakiri",
      "Kento Tsubouchi",
      "Nobuyuki Yoshioka",
      "Masaya Kohda"
    ],
    "publication_date": "2025-04-17T12:34:33Z",
    "arxiv_id": "http://arxiv.org/abs/2504.12893v1",
    "download_url": "https://arxiv.org/abs/2504.12893v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Bayesian Committee Machine Potential for Oxygen-containing Organic Compounds",
    "abstract": "Understanding the pivotal role of oxygen-containing organic compounds in serving as an energy source for living organisms and contributing to protein formation is crucial in the field of biochemistry. This study addresses the challenge of comprehending protein-protein interactions (PPI) and developing predicitive models for proteins and organic compounds, with a specific focus on quantifying their binding affinity. Here, we introduce the active Bayesian Committee Machine (BCM) potential, specifically designed to predict oxygen-containing organic compounds within eight groups of CHO. The BCM potential adopts a committee-based approach to tackle scalability issues associated with kernel regressors, particularly when dealing with large datasets. Its adaptable structure allows for efficient and cost-effective expansion, maintaing both transferability and scalability. Through systematic benchmarking, we position the sparse BCM potential as a promising contender in the pursuit of a universal machine learning potential.",
    "authors": [
      "Seungwon Kim",
      "D. ChangMo Yang",
      "Soohaeng Yoo Willow",
      "Chang Woo Myung"
    ],
    "publication_date": "2024-03-02T10:18:37Z",
    "arxiv_id": "http://arxiv.org/abs/2403.01158v1",
    "download_url": "https://arxiv.org/abs/2403.01158v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Nano antennas array for improving the light emission rate of organic phosphorescence",
    "abstract": "In this paper we present how nano antennas arrays based on Al and Au were successfully increased the phosphorescence emission rate of Iridium-polypyrrole (Irppy3) and Platinum-octaethyl-porphyrin (PtOEP) solutions - which are commonly used as the active layer in organic light emitting diode (OLED) devices. Using electron beam lithography, the nano antennas were embedded inside those organic solutions and lab measurements were conducted. The lifetime of the organic solutions excitons', was decreased by 15%, while the photoluminescence was improved by 10% due to the improvement of the OLED internal and extraction efficiency.",
    "authors": [
      "Zahi Laty",
      "Ofir Sorias",
      "Meir Orenstain"
    ],
    "publication_date": "2019-10-25T04:15:32Z",
    "arxiv_id": "http://arxiv.org/abs/1910.11517v1",
    "download_url": "https://arxiv.org/abs/1910.11517v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mean-field and cumulant approaches to modelling organic polariton physics",
    "abstract": "In this thesis we develop methods for many-body open quantum systems and apply them to systems of organic polaritons. The methods employ a mean-field approach to reduce the dimensionality of large-scale problems. Initially assuming the absence of correlations in the many-body state, this approach is built upon in two ways.\n  First, we show how the mean-field approximation can be combined with matrix product operator methods to efficiently simulate the non-Markovian dynamics of a many-body system with strong coupling to multiple environments. We apply this method to calculate the threshold and photoluminescence for a realistic model of an organic laser.\n  Second, we extend the mean-field description by systematically including higher-order correlations via cumulant expansions of the Heisenberg equations of motion. We investigate the validity and convergence properties of these expansions, both with respect to expansion order and system size, for many-body systems with many-to-one network structures. We then show how the cumulant expansions may be used to calculate spatially resolved dynamics of organic polaritons. This enables a study of organic polariton transport in which we observe reversible conversion to dark exciton states and sub-group-velocity propagation.\n  The methods established in this work offer versatile tools for analysing large, many-body open quantum systems and investigating finite-size effects. Their application reveals the intricate dynamics of organic polaritons resulting from the interplay of strong light-matter coupling and vibrational effects.",
    "authors": [
      "Piper Fowler-Wright"
    ],
    "publication_date": "2024-05-16T04:54:41Z",
    "arxiv_id": "http://arxiv.org/abs/2405.09812v1",
    "download_url": "https://arxiv.org/abs/2405.09812v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Interplay between Structure and Electronic Properties in Organic Conductors",
    "abstract": "It is known that the ground states of organic conductors have a diversity reflecting the spatial arrangement of the constituent molecules within the unit cell. A systematic theoretical search for the unifying view behind such possible ground states has been made based on the Hartree-Fock mean field approximation not only to the on-site but also to intersite Coulomb interactions with special emphasis on the families of typical organic conductors (TMTCF)$_2X$ and (ET)$_2X$.",
    "authors": [
      "Hidetoshi Fukuyama",
      "Hitoshi Seo",
      "Hiori Kino"
    ],
    "publication_date": "1999-09-23T07:59:26Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9909333v1",
    "download_url": "https://arxiv.org/abs/cond-mat/9909333v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Proposed energy-metabolisms cannot explain the atmospheric chemistry of Venus",
    "abstract": "Life in the clouds of Venus, if present in sufficiently high abundance, must be affecting the atmospheric chemistry. It has been proposed that abundant Venusian life could obtain energy from its environment using three possible sulfur energy-metabolisms. These metabolisms raise the possibility of Venus's enigmatic cloud-layer SO$_2$-depletion being caused by life. We here couple each proposed energy-metabolism to a photochemical-kinetics code and self-consistently predict the composition of Venus's atmosphere under the scenario that life produces the observed SO$_2$-depletion. Using this photo-bio-chemical kinetics code, we show that all three metabolisms can produce SO$_2$-depletions, but do so by violating other observational constraints on Venus's atmospheric chemistry. We calculate the maximum possible biomass density of sulfur-metabolising life in the clouds, before violating observational constraints, to be $\\sim10^{-5}\\,-\\,10^{-3}\\,{\\rm mg\\,m^{-3}}$. The methods employed are equally applicable to aerial biospheres on Venus-like exoplanets, planets that are optimally poised for atmospheric characterisation in the near future.",
    "authors": [
      "Sean Jordan",
      "Oliver Shorttle",
      "Paul B. Rimmer"
    ],
    "publication_date": "2022-06-13T18:47:46Z",
    "arxiv_id": "http://arxiv.org/abs/2206.06414v1",
    "download_url": "https://arxiv.org/abs/2206.06414v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Pulsed Electron Spin Resonance of an Organic Microcrystal by Dispersive Readout",
    "abstract": "We establish a testbed system for the development of high-sensitivity Electron Spin Resonance (ESR) techniques for small samples at cryogenic temperatures. Our system consists of a Niobium Nitride thin-film planar superconducting microresonator designed to have a concentrated mode volume to couple to a small amount of paramagnetic material, and to be resilient to magnetic fields of up to 400 mT. At 65 mK we measure high-cooperativity coupling ($C \\approx 19$) to an organic radical microcrystal containing $10^{12}$ spins in a pico-litre volume. We detect the spin-lattice decoherence rate via the dispersive frequency shift of the resonator. Techniques such as these could be suitable for applications in quantum information as well as for pulsed ESR interrogation of very few spins and could provide insights into the surface chemistry of, for example, the material defects in superconducting quantum processors.",
    "authors": [
      "Ailsa Keyser",
      "Jonathan Burnett",
      "Sergey Kubatkin",
      "Andrey Danilov",
      "Mark Oxborrow",
      "Sebastian de Graaf",
      "Tobias Lindström"
    ],
    "publication_date": "2020-09-15T09:03:12Z",
    "arxiv_id": "http://arxiv.org/abs/2009.06933v2",
    "download_url": "https://arxiv.org/abs/2009.06933v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Comparison of Simulated JWST Observations Derived from Equilibrium and Non-Equilibrium Chemistry Models of Giant Exoplanets",
    "abstract": "We aim to see if the difference between equilibrium and disequilibrium chemistry is observable in the atmospheres of transiting planets by the James Webb Space Telescope (JWST). We perform a case study comparing the dayside emission spectra of three planets like HD 189733b, WASP-80b, and GJ436b, in and out of chemical equilibrium at two metallicities each. These three planets were chosen because they span a large range of planetary masses and equilibrium temperatures, from hot and Jupiter-sized to warm and Neptune-sized. We link the one-dimensional disequilibrium chemistry model from Venot et al. (2012) in which thermochemical kinetics, vertical transport, and photochemistry are taken into account, to the one-dimensional, pseudo line-by-line radiative transfer model, Pyrat Bay, developed especially for hot Jupiters, and then simulate JWST spectra using PandExo for comparing the effects of temperature, metallicity, and radius. We find the most significant differences from 4 to 5 $μ$m due to disequilibrium from CO and CO$_{2}$ abundances, and also H$_{2}$O for select cases. Our case study shows a certain \"sweet spot\" of planetary mass, temperature, and metallicity where the difference between equilibrium and disequilibrium is observable. For a planet similar to WASP-80b, JWST's NIRSpec G395M can detect differences due to disequilibrium chemistry with one eclipse event. For a planet similar to GJ 436b, the observability of differences due to disequilibrium chemistry is possible at low metallicity given five eclipse events, but not possible at the higher metallicity.",
    "authors": [
      "Sarah D. Blumenthal",
      "Avi M. Mandell",
      "Eric Hébrard",
      "Natasha E. Batalha",
      "Patricio E. Cubillos",
      "Sarah Rugheimer",
      "Hannah R. Wakeford"
    ],
    "publication_date": "2017-12-04T14:55:12Z",
    "arxiv_id": "http://arxiv.org/abs/1712.01121v1",
    "download_url": "https://arxiv.org/abs/1712.01121v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum Information Driven Ansatz (QIDA): shallow-depth empirical quantum circuits from Quantum Chemistry",
    "abstract": "Hardware-efficient empirical variational ansätze for Variational Quantum Eigensolver simulations of Quantum Chemistry suffer from the lack of a direct connection to classical Quantum Chemistry methods. In the present work, we propose a method to fill this gap by introducing a new approach for constructing variational quantum circuits, leveraging quantum mutual information associated with classical Quantum Chemistry states to design simple yet effective heuristic ansätze with a topology that reflects the correlations of the molecular system. As first step, Quantum Chemistry calculations, such as Møller-Plesset (MP2) perturbation theory, firstly provide an approximate Natural Orbitals basis, which has been recently shown to be the best candidate one-electron basis for developing compact empirical wavefunctions (Ratini, et al 2023). Secondly, throughout the evaluation of quantum mutual information matrices, they provide information about the main correlations between qubits of the quantum circuit, enabling the development of a direct design of entangling blocks for the circuit. The resulting ansatz is then utilized with a Variational Quantum Eigensolver (VQE) to obtain a short depth variational groundstate of the electronic Hamiltonian. To validate our approach, we perform a comprehensive statistical analysis by simulations over various molecular systems ($H_2, LiH, H_2O$) and apply it to the more complex $NH_3$ molecule. The reported results demonstrate that the proposed methodology gives rise to highly effective ansätze, surpassing the standard empirical ladder-entangler ansatz in performance. Overall, our approach can be used as effective state preparation providing a promising route for designing efficient variational quantum circuits for large molecular systems.",
    "authors": [
      "Davide Materia",
      "Leonardo Ratini",
      "Celestino Angeli",
      "Leonardo Guidoni"
    ],
    "publication_date": "2023-09-26T21:50:02Z",
    "arxiv_id": "http://arxiv.org/abs/2309.15287v1",
    "download_url": "https://arxiv.org/abs/2309.15287v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Chemistry and dynamics of the prestellar core L1544",
    "abstract": "We aim to quantify the effect of chemistry on the infall velocity in the prestellar core L1544. Previous observational studies have found evidence for double-peaked line profiles for the rotational transitions of several molecules, which cannot be accounted for with the models presently available for the physical structure of the source, without ad hoc up-scaling of the infall velocity. We ran one-dimensional hydrodynamical simulations of the collapse of a core with L1544-like properties (in terms of mass and outer radius), using a state-of-the-art chemical model with a very large chemical network combined with an extensive description of molecular line cooling, determined via radiative transfer simulations, with the aim of determining whether these expansions of the simulation setup (as compared to previous models) can lead to a higher infall velocity. After running a series of simulations where the simulation was sequentially simplified, we found that the infall velocity is almost independent of the size of the chemical network or the approach to line cooling. We conclude that chemical evolution does not have a large impact on the infall velocity, and that the higher infall velocities that are implied by observations may be the result of the core being more dynamically evolved than what is now thought, or alternatively the average density in the simulated core is too low. However, chemistry does have a large influence on the lifetime of the core, which varies by about a factor of two across the simulations and grows longer when the chemical network is simplified. Therefore, although the model is subject to several sources of uncertainties, the present results clearly indicate that the use of a small chemical network leads to an incorrect estimate of the core lifetime, which is naturally a critical parameter for the development of chemical complexity in the precollapse phase.",
    "authors": [
      "O. Sipilä",
      "P. Caselli",
      "E. Redaelli",
      "S. Spezzano"
    ],
    "publication_date": "2022-09-28T12:15:15Z",
    "arxiv_id": "http://arxiv.org/abs/2209.14025v2",
    "download_url": "https://arxiv.org/abs/2209.14025v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The dominant spin relaxation mechanism in compound organic semiconductors",
    "abstract": "Despite the recent interest in \"organic spintronics\", the dominant spin relaxation mechanism of electrons or holes in an organic compound semiconductor has not been conclusively identified. There have been sporadic suggestions that it might be hyperfine interaction caused by background nuclear spins, but no confirmatory evidence to support this has ever been presented. Here, we  report the electric-field dependence of the spin diffusion length in an organic spin-valve structure consisting of an Alq3 spacer layer, and argue that this data, as well as available data on the temperature dependence of this length, contradict the notion that hyperfine interactions relax spin. Instead, they suggest  that the Elliott-Yafet mechanism, arising from spin-orbit interaction, is more likely the dominant spin relaxing mechanism.",
    "authors": [
      "Supriyo Bandyopadhyay"
    ],
    "publication_date": "2010-03-14T20:52:30Z",
    "arxiv_id": "http://arxiv.org/abs/1003.2814v1",
    "download_url": "https://arxiv.org/abs/1003.2814v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A simple strategy to measure the contact resistance between metals and doped organic films",
    "abstract": "Charge injection from electrodes into doped organic films is a widespread technology used in the majority of state-of-the-art organic semiconductor devices. Although such interfaces are commonly considered to form Ohmic contacts via strong band bending, an experiment that directly measures the contact resistance has not yet been demonstrated. In this study, we use a simple metal/doped organic semiconductor/metal stack and study its voltage-dependent resistance. A transport layer thickness variation proves that the presented experiment gains direct access to the contact resistance of the device. We can quantify that for an operating current density of 10mA/cm2 the investigated material system exhibits a voltage drop over the metal/organic interface of about 200mV, which can be reduced by more than one order of magnitude when employing an additional injection layer. The presented experiment proposes a simple strategy to measure the contact resistance between any metal and doped organic film without applying numerical tools or elaborate techniques. Furthermore, the simplistic device architecture allows for very high, homogeneous, and tunable electric fields within the organic layer, which enables a clear investigation of the Poole-Frenkel effect.",
    "authors": [
      "Anton Kirch",
      "Axel Fischer",
      "Robert Werberger",
      "Shayan Miri Aabi Soflaa",
      "Karolina Maleckaite",
      "Paulius Imbrasas",
      "Johannes Benduhn",
      "Sebastian Reineke"
    ],
    "publication_date": "2022-04-30T13:10:26Z",
    "arxiv_id": "http://arxiv.org/abs/2205.00261v1",
    "download_url": "https://arxiv.org/abs/2205.00261v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Non-Energetic Formation of Ethanol via CCH Reaction with Interstellar H2O Ices. A Computational Chemistry Study",
    "abstract": "Ethanol (CH$_3$CH$_2$OH) is a relatively common molecule, often found in star forming regions. Recent studies suggest that it could be a parent molecule of several so-called interstellar complex organic molecules (iCOMs). Yet, the formation route of this species remains debated. In the present work, we study the formation of ethanol through the reaction of CCH with one H$_2$O molecule belonging to the ice, as a test case to investigate the viability of chemical reactions based on a \"radical + ice component\" scheme as an alternative mechanism for the synthesis of iCOMs, beyond the usual radical-radical coupling. This has been done by means of DFT calculations adopting two clusters of 18 and 33 water molecules as ice models. Results indicate that CH$_3$CH$_2$OH can potentially be formed by this proposed reaction mechanism. The reaction of CCH with H$_2$O on the water ice clusters can be barrierless (thanks to the help of boundary icy water molecules acting as proton transfer assistants) leading to the formation of vinyl alcohol precursors (H$_2$CCOH and CHCHOH). Subsequent hydrogenation of vinyl alcohol yielding ethanol is the only step presenting a low activation energy barrier. We finally discuss the astrophysical implications of these findings.",
    "authors": [
      "Jessica Perrero",
      "Juan Enrique-Romero",
      "Berta Martínez Bachs",
      "Cecilia Ceccarelli",
      "Nadia Balucani",
      "Piero Ugliengo",
      "Albert Rimola"
    ],
    "publication_date": "2022-02-23T10:41:04Z",
    "arxiv_id": "http://arxiv.org/abs/2202.11406v1",
    "download_url": "https://arxiv.org/abs/2202.11406v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Analysis of The Tailored Coupled-Cluster Method in Quantum Chemistry",
    "abstract": "In quantum chemistry, one of the most important challenges is the static correlation problem when solving the electronic Schrödinger equation for molecules in the Born--Oppenheimer approximation. In this article, we analyze the tailored coupled-cluster method (TCC), one particular and promising method for treating molecular electronic-structure problems with static correlation. The TCC method combines the single-reference coupled-cluster (CC) approach with an approximate reference calculation in a subspace [complete active space (CAS)] of the considered Hilbert space that covers the static correlation. A one-particle spectral gap assumption is introduced, separating the CAS from the remaining Hilbert space. This replaces the nonexisting or nearly nonexisting gap between the highest occupied molecular orbital and the lowest unoccupied molecular orbital usually encountered in standard single-reference quantum chemistry. The analysis covers, in particular, CC methods tailored by tensor-network states (TNS-TCC methods). The problem is formulated in a nonlinear functional analysis framework, and, under certain conditions such as the aforementioned gap, local uniqueness and existence are proved using Zarantonello's lemma. From the Aubin--Nitsche-duality method, a quadratic error bound valid for TNS-TCC methods is derived, e.g., for linear-tensor-network TCC schemes using the density matrix renormalization group method.",
    "authors": [
      "Fabian M. Faulstich",
      "Andre Laestadius",
      "Örs Legeza",
      "Reinhold Schneider",
      "Simen Kvaal"
    ],
    "publication_date": "2018-02-15T18:45:53Z",
    "arxiv_id": "http://arxiv.org/abs/1802.05699v2",
    "download_url": "https://arxiv.org/abs/1802.05699v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Evidence for auroral influence on Jupiter's nitrogen and oxygen chemistry revealed by ALMA",
    "abstract": "The localized delivery of new long-lived species to Jupiter's stratosphere by comet Shoemaker-Levy 9 in 1994 opened a window to constrain Jovian chemistry and dynamics by monitoring the evolution of their vertical and horizontal distributions. However, the spatial distributions of CO and HCN, two of these long-lived species, had never been jointly observed at high latitudinal resolution. Atacama large millimeter/submillimeter array observations of HCN and CO in March 2017 show that CO was meridionally uniform and restricted to pressures lower than 3 $\\pm$ 1 mbar. HCN shared a similar vertical distribution in the low- to mid-latitudes, but was depleted at pressures between 2$^{+2}_ {-1}$ and 0.04$^{+0.07}_{-0.03}$ mbar in the aurora and surrounding regions, resulting in a drop by two orders of magnitude in column density. We propose that heterogeneous chemistry bonds HCN on large aurora-produced aerosols at these pressures in the Jovian auroral regions causing the observed depletion.",
    "authors": [
      "Thibault Cavalié",
      "Ladislav Rezac",
      "Raphael Moreno",
      "Emmanuel Lellouch",
      "Thierry Fouchet",
      "Bilal Benmahi",
      "Thomas K. Greathouse",
      "James A. Sinclair",
      "Vincent Hue",
      "Paul Hartogh",
      "Michel Dobrijevic",
      "Nathalie Carrasco",
      "Zoé Perrin"
    ],
    "publication_date": "2024-07-10T06:04:39Z",
    "arxiv_id": "http://arxiv.org/abs/2407.07385v1",
    "download_url": "https://arxiv.org/abs/2407.07385v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Mechanism of delocalisation-enhanced exciton transport in disordered organic semiconductors",
    "abstract": "Large exciton diffusion lengths generally improve the performance of organic semiconductor devices, since they enable energy to be transported farther during the exciton lifetime. However, the physics of exciton motion in disordered organic materials is not fully understood, and modelling the transport of quantum-mechanically delocalised excitons in disordered organic semiconductors is a computational challenge. Here, we describe delocalised kinetic Monte Carlo (dKMC), the first model of three-dimensional exciton transport in organic semiconductors that includes delocalisation, disorder, and polaron formation. We find that delocalisation can dramatically increase exciton transport; for example, delocalisation across less than two molecules in each direction can increase the exciton diffusion coefficient by over an order of magnitude. The mechanism for the enhancement is twofold: delocalisation enables excitons both to hop more frequently and further in each hop. We also quantify the effect of transient delocalisation (short-lived periods where excitons become highly delocalised), and show it depends strongly on the disorder and the transition dipole moments.",
    "authors": [
      "Daniel Balzer",
      "Ivan Kassal"
    ],
    "publication_date": "2022-12-16T12:05:20Z",
    "arxiv_id": "http://arxiv.org/abs/2212.08429v1",
    "download_url": "https://arxiv.org/abs/2212.08429v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A Paradigm Shift: The Implications of Working Memory Limits for Physics and Chemistry Instruction",
    "abstract": "Scientists who study how the brain solves problems have recently verified that, because of stringent limitations in working memory, where the brain solves problems, students must apply facts and algorithms that have previously been well memorized to reliably solve problems of any complexity. This is a paradigm shift: A change in the fundamental understanding of how the brain solves problems and how we can best guide students to learn to solve problems in the physical sciences. One implication is that for students, knowledge of concepts and big ideas is not sufficient to solve most problems assigned in physics and chemistry courses for STEM majors. To develop an intuitive sense of which fundamentals to recall when, first students must make the fundamental relationships of a topic recallable with automaticity then apply those fundamentals to solving problems in a variety of distinctive contexts. Based on these findings, cognitive science has identified strategies that speed learning and assist in retention of physics and chemistry. Experiments will be suggested by which instructors can test science-informed methodologies.",
    "authors": [
      "JudithAnn R. Hartman",
      "Eric A. Nelson"
    ],
    "publication_date": "2021-01-31T13:54:12Z",
    "arxiv_id": "http://arxiv.org/abs/2102.00454v2",
    "download_url": "https://arxiv.org/abs/2102.00454v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Two-dimensional hole gas in organic semiconductors",
    "abstract": "A highly conductive metallic gas that is quantum mechanically confined at a solid-state interface is an ideal platform to explore nontrivial electronic states that are otherwise inaccessible in bulk materials. Although two-dimensional electron gas (2DEG) has been realized in conventional semiconductor interfaces, examples of two-dimensional hole gas (2DHG), which is the counter analogue of 2DEG, are still limited. Here, we report the observation of a 2DHG in solution-processed organic semiconductors in conjunction with an electric double-layer using ionic liquids. A molecularly flat single crystal of high mobility organic semiconductors serves as a defect-free interface that facilitates two-dimensional confinement of high-density holes. Remarkably low sheet resistance of 6 k$Ω$ and high hole gas density of 10$^{14}$ cm$^{-2}$ result in a metal-insulator transition at ambient pressure. The measured degenerated holes in the organic semiconductors provide a broad opportunity to tailor low-dimensional electronic states using molecularly engineered heterointerfaces.",
    "authors": [
      "Naotaka Kasuya",
      "Junto Tsurumi",
      "Toshihiro Okamoto",
      "Shun Watanabe",
      "Jun Takeya"
    ],
    "publication_date": "2020-10-29T18:46:45Z",
    "arxiv_id": "http://arxiv.org/abs/2010.15883v1",
    "download_url": "https://arxiv.org/abs/2010.15883v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Resonant Lifetime of Core-Excited Organic Adsorbates from First Principles",
    "abstract": "We investigate by first-principles simulations the resonant electron-transfer lifetime from the excited state of an organic adsorbate to a semiconductor surface, namely isonicotinic acid on rutile TiO$_2$(110). The molecule-substrate interaction is described using density functional theory, while the effect of a truly semi-infinite substrate is taken into account by Green's function techniques. Excitonic effects due to the presence of core-excited atoms in the molecule are shown to be instrumental to understand the electron-transfer times measured using the so-called core-hole-clock technique. In particular, for the isonicotinic acid on TiO$_2$(110), we find that the charge injection from the LUMO is quenched since this state lies within the substrate band gap. We compute the resonant charge-transfer times from LUMO+1 and LUMO+2, and systematically investigate the dependence of the elastic lifetimes of these states on the alignment among adsorbate and substrate states.",
    "authors": [
      "Guido Fratesi",
      "Carlo Motta",
      "Maria Italo Trioni",
      "Gian Paolo Brivio",
      "Daniel Sanchez-Portal"
    ],
    "publication_date": "2014-04-22T19:12:21Z",
    "arxiv_id": "http://arxiv.org/abs/1404.5595v1",
    "download_url": "https://arxiv.org/abs/1404.5595v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Organic Electronics Picks Up the Pace: Mask-Less, Solution Processed Organic Transistors Operating at 160 MHz",
    "abstract": "Organic printed electronics has proven its potential as an essential enabler for applications related to healthcare, entertainment, energy and distributed intelligent objects. The possibility of exploiting solution-based and direct-writing production schemes further boosts the benefits offered by such technology, facilitating the implementation of cheap, conformable, bio-compatible electronic applications. The result shown in this work challenges the widespread assumption that such class of electronic devices is relegated to low-frequency operation, owing to the limited charge mobility of the materials and to the low spatial resolution achievable with conventional printing techniques. Here, it is shown that solution-processed and direct-written organic field-effect transistors can be carefully designed and fabricated so to achieve a maximum transition frequency of 160 MHz, unlocking an operational range that was not available before for organics. Such range was believed to be only accessible with more performing classes of semiconductor materials and/or more expensive fabrication schemes. The present achievement opens a route for cost- and energy-efficient manufacturability of flexible and conformable electronics with wireless-communication capabilities.",
    "authors": [
      "Andrea Perinot",
      "Michele Giorgio",
      "Virgilio Mattoli",
      "Dario Natali",
      "Mario Caironi"
    ],
    "publication_date": "2020-09-14T18:47:50Z",
    "arxiv_id": "http://arxiv.org/abs/2009.06685v1",
    "download_url": "https://arxiv.org/abs/2009.06685v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Two-dimensional bimolecular recombination in amorphous organic semiconductors",
    "abstract": "We consider the two-dimensional bimolecular recombination of charge carriers in amorphous organic semiconductors having the lamellar structure. We calculate the dependence of the effective recombination rate constant on the carrier density taking into account the correlated nature of the energetic disorder typical for organic semiconductors. Resulting recombination kinetics demonstrates a very rich variety of behaviors depending on the correlation properties of the particular semiconductor and relevant charge density range.",
    "authors": [
      "S. V. Novikov"
    ],
    "publication_date": "2020-02-20T18:26:19Z",
    "arxiv_id": "http://arxiv.org/abs/2002.08931v1",
    "download_url": "https://arxiv.org/abs/2002.08931v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Learning Hidden Chemistry with Deep Neural Networks",
    "abstract": "We demonstrate a machine learning approach designed to extract hidden chemistry/physics to facilitate new materials discovery. In particular, we propose a novel method for learning latent knowledge from material structure data in which machine learning models are developed to present the possibility that an atom can be paired with a chemical environment in an observed materials. For this purpose, we trained deep neural networks acquiring information from the atom of interest and its environment to estimate the possibility. The models were then used to establish recommendation systems, which can suggest a list of atoms for an environment within a structure. The center atom of that environment was then replaced with the various recommended atoms to generate new structures. Based on these recommendations, we also propose a method of dissimilarity measurement between the atoms and, through hierarchical cluster analysis and visualization using the multidimensional scaling algorithm, illustrate that this dissimilarity can reflect the chemistry of the elements. Finally, our models were applied to the discovery of new structures in the well-known magnetic material Nd$_2$Fe$_{14}$B. Our models propose 108 new structures, 71 of which are confirmed to converge to local-minimum-energy structures with formation energy less than 0.1 eV by first-principles calculations.",
    "authors": [
      "Tien-Cuong Nguyen",
      "Van-Quyen Nguyen",
      "Van-Linh Ngo",
      "Quang-Khoat Than",
      "Tien-Lam Pham"
    ],
    "publication_date": "2021-01-28T10:03:15Z",
    "arxiv_id": "http://arxiv.org/abs/2101.11902v3",
    "download_url": "https://arxiv.org/abs/2101.11902v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Petroleum, coal and other organics in space",
    "abstract": "The petroleum and coal models of the unidentified infrared emissions (UIE), sometimes referred also as unidentified infrared bands (UIBs) has been reviewed mainly based on the work of the authors with the inclusion of unpublished results. It is shown that the petroleum and coal model of the UIE converges and merges quite well with the MAON (Mixed Aromatic Aliphatic Organic Nanoparticles) model of the UIE. It is shown that the thermal treatment of various substrates like PAHs, alkylated PAHs but also mixed aliphatic/olefinic substrates leads invariable to carbonaceous materials matching the infrared spectrum of anthracite coal or certain petroleum fractions. Thus, the experimental thermal processing (which under space conditions could be equivalent to the expected processing by shock waves or high energy radiation) of mixed aromatic/aliphatic organic matter can be used to match also the UIE evolution. Another way to simulate the thermal/radiation processing of organic matter in space, can be achieved through the carbon arc. Simple substrates processed in this way produce carbon soot and a plethora of organic molecules. Fullerenes are found in space both through mid-infrared and optical spectroscopy and it is very likely that other complex related species such as endohedral fullerenes (i.e. fullerenes with a metal, heteroatom or molecules inside the cage) may be formed in space. After all, their formation requires the same conditions as those needed for fullerene formation provided that also a metal vapour (e.g. interstellar/circumstellar gas) is available. The last part of this review is thus dedicated to the recent results on the study and characterization of an endohedral C60 derivative containing lithium inside the cage.",
    "authors": [
      "F. Cataldo",
      "D. A. Garcia-Hernandez",
      "A. Manchado"
    ],
    "publication_date": "2020-05-03T18:45:18Z",
    "arxiv_id": "http://arxiv.org/abs/2005.01162v1",
    "download_url": "https://arxiv.org/abs/2005.01162v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Influence of the organic cation disorder on photoconductivity in ethylenediammonium lead iodide, NH3CH2CH2NH3PbI4",
    "abstract": "We report the synthesis and crystal structure of an organic inorganic compound, ethylenediammonium lead iodide, NH3CH2CH2NH3PbI4. Synchrotron based single crystal X-ray diffraction experiments revealed that the pristine and thermally treated crystals differ in the organic cation behaviour, which is characterized by a partial disorder in the thermally treated crystal. Based on current voltage measurements, increased disorder of the organic cation is associated with enhanced photoconductivity. This compound could be a potential candidate for interface engineering in lead halide perovskite-based optoelectronic devices.",
    "authors": [
      "Anastasiia Glushkova",
      "Alla Arakcheeva",
      "Philip Pattison",
      "Márton Kollár",
      "Pavao Andričević",
      "Bálint Náfrádi",
      "László Forró",
      "Endre Horváth"
    ],
    "publication_date": "2021-04-29T07:58:46Z",
    "arxiv_id": "http://arxiv.org/abs/2104.14178v1",
    "download_url": "https://arxiv.org/abs/2104.14178v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Magnetoelectrically driven catalytic degradation of organics",
    "abstract": "Here, we report the catalytic degradation of organic compounds by exploiting the magnetoelectric (ME) nature of cobalt ferrite-bismuth ferrite (CFO-BFO) core-shell nanoparticles. The combination of magnetostrictive CFO with the multiferroic BFO gives rise to a magnetoelectric engine that purifies water under wireless magnetic fields via advanced oxidation processes, without involvement of any sacrificial molecules or co-catalysts. Magnetostrictive CoFe2O4 nanoparticles are fabricated using hydrothermal synthesis, followed by sol-gel synthesis to create the multiferroic BiFeO3 shell. We perform theoretical modeling to study the magnetic field induced polarization on the surface of magnetoelectric nanoparticles. The results obtained from these simulations are consistent with the experimental findings of the piezo-force microscopy analysis, where we observe changes in the piezoresponse of the nanoparticles under magnetic fields. Next, we investigate the magnetoelectric effect induced catalytic degradation of organic pollutants under AC magnetic fields and obtained 97% removal efficiency for synthetic dyes and over 85% removal efficiency for routinely used pharmaceuticals. Additionally, we perform trapping experiments to elucidate the mechanism behind the magnetic field induced catalytic degradation of organic pollutants by using scavengers for each of the reactive species. Our results indicate that hydroxyl and superoxide radicals are the main reactive species in the magnetoelectrically induced catalytic degradation of organic compounds.",
    "authors": [
      "Fajer Mushtaq",
      "Xiang-Zhong Chen",
      "Harun Torlakcik",
      "Christian Steuer",
      "Marcus Hoop",
      "Erdem Can Siringil",
      "Xavi Marti",
      "Gregory Limburg",
      "Patrick Stipp",
      "Bradley J. Nelson",
      "Salvador Pané"
    ],
    "publication_date": "2019-04-02T08:09:04Z",
    "arxiv_id": "http://arxiv.org/abs/1904.01271v1",
    "download_url": "https://arxiv.org/abs/1904.01271v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantifying the Excitonic Static Disorder in Organic Semiconductors",
    "abstract": "Organic semiconductors are disordered molecular solids and as a result, their internal charge dynamics and ultimately, the performance of the optoelectronic devices they constitute, are governed by energetic disorder. To ascertain how energetic disorder impacts charge generation, exciton transport, charge transport, and the performance of organic semiconductor devices, an accurate approach is first required to measure this critical parameter. In this work, we show that the static disorder has no relation with the so-called Urbach energy in organic semiconductors. Instead, it can be obtained from photovoltaic external quantum efficiency spectra at wavelengths near the absorption onset. We then present a detailed methodology, alongside a computational framework, for quantifying the static energetic disorder associated with singlet excitons. Moreover, the role of optical interference in this analysis is considered to achieve a high-accuracy quantification. Finally, the excitonic static disorder was quantified in several technologically-relevant donor-acceptor blends, including high-efficiency PM6:Y6.",
    "authors": [
      "Austin M. Kay",
      "Oskar J. Sandberg",
      "Nasim Zarrabi",
      "Wei Li",
      "Stefan Zeiske",
      "Christina Kaiser",
      "Paul Meredith",
      "Ardalan Armin"
    ],
    "publication_date": "2021-12-14T19:09:59Z",
    "arxiv_id": "http://arxiv.org/abs/2112.07702v1",
    "download_url": "https://arxiv.org/abs/2112.07702v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Data-Driven Design of a New Organic Semiconductor via an Electronic Structure Chart",
    "abstract": "Data-driven methodologies for designing new materials are developing apace, yet advances for organic crystals have been infrequent. For organic crystals, the need to predict solid-state electronic properties from molecular structure alone is an exceedingly difficult task for typical, regression-based design strategies. In this paper, we present a new strategy for designing organic crystals which circumvents the need to regress solid-state physical properties directly. At the core of this strategy is an electronic structure chart, a two-dimensional projection of an organic crystal database in which each material is positioned according to its solid-state electronic properties. We illustrate this strategy by identifying a new molecule which is predicted to show a targeted band gap and better-than-average band curvatures in the crystalline state. This strategy is the first data-driven method which can design new molecules on the basis of genuine solid-state electronic properties, and has potential to accelerate breakthroughs in the field of organic electronics and beyond.",
    "authors": [
      "Daniel M. Packwood",
      "Yu Kaneko",
      "Daiji Ikeda",
      "Mitsuru Ohno"
    ],
    "publication_date": "2022-04-21T00:22:31Z",
    "arxiv_id": "http://arxiv.org/abs/2204.09827v1",
    "download_url": "https://arxiv.org/abs/2204.09827v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "White organic light-emitting diodes: Status and perspective",
    "abstract": "White organic light-emitting diodes (OLEDs) are ultra-thin, large-area light sources made from organic semiconductor materials. Over the last decades, much research has been spent on finding the suitable materials to realize highly efficient monochrome and white OLEDs. With their high efficiency, color-tunability, and color-quality, white OLEDs are emerging to become one of the next generation light sources. In this review, we discuss the physics of a variety of device concepts that are introduced to realize white OLEDs based on both polymer and small molecule organic materi als. Owing to the fact that about 80 % of the internally generated photons are trapped within the thin-film layer structure, we put a second focus on reviewing promising concepts for improved light outcoupling.",
    "authors": [
      "Sebastian Reineke",
      "Michael Thomschke",
      "Björn Lüssem",
      "Karl Leo"
    ],
    "publication_date": "2013-02-14T15:38:24Z",
    "arxiv_id": "http://arxiv.org/abs/1302.3435v1",
    "download_url": "https://arxiv.org/abs/1302.3435v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Water Buckyball Terahertz Vibrations in Physics, Chemistry, Biology, and Cosmology",
    "abstract": "Pentagonal dodecahedral buckyball-like water clusters and arrays thereof are shown from first-principles electronic-structure calculations to possess unique terahertz vibrational modes in the 1-6 THz range, corresponding to oxygen-oxygen-oxygen bending and twisting surface distortions of the clusters. In their excited electronic states these water clusters constitute a form of Rydberg matter. Applications to Physics, Chemistry, Biology, and Cosmology are described.",
    "authors": [
      "Keith Johnson"
    ],
    "publication_date": "2009-02-12T05:37:02Z",
    "arxiv_id": "http://arxiv.org/abs/0902.2035v1",
    "download_url": "https://arxiv.org/abs/0902.2035v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Lithium Ion Solvation and Diffusion in Bulk Organic Electrolytes from First Principles and Classical Reactive Molecular Dynamics",
    "abstract": "Lithium-ion battery performance is strongly influenced by the ionic conductivity of the electrolyte, which depends on the speed at which Li ions migrate across the cell and relates to their solvation structure. The choice of solvent can greatly impact both solvation and diffusivity of Li ions. We use first principles molecular dynamics to examine the solvation and diffusion of Li ions in the bulk organic solvents ethylene carbonate (EC), ethyl methyl carbonate (EMC), and a mixture of EC/EMC. We find that Li ions are solvated by either carbonyl or ether oxygen atoms of the solvents and sometimes by the PF$_6^-$ anion. Li$^+$ prefers a tetrahedrally-coordinated first solvation shell regardless of which species are involved, with the specific preferred solvation structure dependent on the organic solvent. In addition, we calculate Li diffusion coefficients in each electrolyte, finding slightly larger diffusivities in the linear carbonate EMC compared to the cyclic carbonate EC. The magnitude of the diffusion coefficient correlates with the strength of Li$^+$ solvation. Corresponding analysis for the PF$_6^-$ anion shows greater diffusivity associated with a weakly-bound, poorly defined first solvation shell. These results may be used to aid in the design of new electrolytes to improve Li-ion battery performance.",
    "authors": [
      "Mitchell T. Ong",
      "Osvalds Verners",
      "Erik W. Draeger",
      "Adri C. T. van Duin",
      "Vincenzo Lordi",
      "John E. Pask"
    ],
    "publication_date": "2015-02-26T20:07:34Z",
    "arxiv_id": "http://arxiv.org/abs/1502.07708v1",
    "download_url": "https://arxiv.org/abs/1502.07708v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "More quantum chemistry with fewer qubits",
    "abstract": "Quantum computation is one of the most promising new paradigms for the simulation of physical systems composed of electrons and atomic nuclei, with applications in chemistry, solid-state physics, materials science, and molecular biology. This requires a truncated representation of the electronic structure Hamiltonian using a finite number of orbitals. While it is, in principle, obvious how to improve on the representation by including more orbitals, this is usually unfeasible in practice (e.g., because of the limited number of qubits available) and severely compromises the accuracy of the obtained results. Here, we propose a quantum algorithm that improves on the representation of the physical problem by virtue of second-order perturbation theory. In particular, our quantum algorithm evaluates the second-order energy correction through a series of time-evolution steps under the unperturbed Hamiltonian. An important application is to go beyond the active-space approximation, allowing to include corrections of virtual orbitals, known as multireference perturbation theory. Here, we exploit that the unperturbed Hamiltonian is diagonal for virtual orbitals and show that the number of qubits is independent of the number of virtual orbitals. This gives rise to more accurate energy estimates without increasing the number of qubits. Moreover, we demonstrate numerically for realistic chemical systems that the total runtime has highly favorable scaling in the number of virtual orbitals compared to previous work. Numerical calculations confirm the necessity of the multireference perturbation theory energy corrections to reach accurate ground state energy estimates. Our perturbation theory quantum algorithm can also be applied to symmetry-adapted perturbation theory. As such, we demonstrate that perturbation theory can help to reduce the quantum hardware requirements for quantum chemistry.",
    "authors": [
      "Jakob Günther",
      "Alberto Baiardi",
      "Markus Reiher",
      "Matthias Christandl"
    ],
    "publication_date": "2023-08-31T17:21:17Z",
    "arxiv_id": "http://arxiv.org/abs/2308.16873v4",
    "download_url": "https://arxiv.org/abs/2308.16873v4",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Full-CI Quantum Chemistry using the Density-Matrix Renormalization Group",
    "abstract": "We describe how density-matrix renormalization group (DMRG) can be used to solve the full-CI problem in quantum chemistry. As an illustration of the potential of this method, we apply it to a paramagnetic molecule. In particular, we show the effect of various basis set, the scaling as the fourth power of the size of the problem, and compare the DMRG with other methods.",
    "authors": [
      "S. Daul",
      "I. Ciofini",
      "C. Daul",
      "Steven R. White"
    ],
    "publication_date": "1999-12-20T10:20:46Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/9912348v1",
    "download_url": "https://arxiv.org/abs/cond-mat/9912348v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Perspective: Organic electronic materials and devices for neuromorphic engineering",
    "abstract": "Neuromorphic computing and engineering has been the focus of intense research efforts that have been intensified recently by the mutation of Information and Communication Technologies (ICT). In fact, new computing solutions and new hardware platforms are expected to emerge to answer to the new needs and challenges of our societies. In this revolution, lots of candidates technologies are explored and will require leveraging of the pro and cons. In this perspective paper belonging to the special issue on neuromorphic engineering of Journal of Applied Physics, we focus on the current achievements in the field of organic electronics and the potentialities and specificities of this research field. We highlight how unique material features available through organic materials can be used to engineer useful and promising bioinspired devices and circuits. We also discuss about the opportunities that organic electronic are offering for future research directions in the neuromorphic engineering field.",
    "authors": [
      "Sebastien Pecqueur",
      "Dominique Vuillaume",
      "Fabien Alibart"
    ],
    "publication_date": "2018-10-05T20:13:55Z",
    "arxiv_id": "http://arxiv.org/abs/1810.02873v1",
    "download_url": "https://arxiv.org/abs/1810.02873v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Effects of turbulent diffusion on the chemistry of diffuse clouds",
    "abstract": "Aims. We probe the effect of turbulent diffusion on the chemistry at the interface between a cold neutral medium (CNM) cloudlet and the warm neutral medium (WNM). Methods. We perform moving grid, multifluid, 1D, hydrodynamical simulations with chemistry including thermal and chemical diffusion. The diffusion coefficients are enhanced to account for turbulent diffusion. We post-process the steady-states of our simulations with a crude model of radiative transfer to compute line profiles. Results. Turbulent diffusion spreads out the transition region between the CNM and the WNM. We find that the CNM slightly expands and heats up: its CH and H$_2$ content decreases due to the lower density. The change of physical conditions and diffusive transport increase the H$^+$ content in the CNM which results in increased OH and H$_2$O. Diffusion transports some CO out of the CNM. It also brings H$_2$ into contact with the warm gas with enhanced production of CH$^+$, H$_3^+$, OH and H$_2$O at the interface. O lines are sensitive to the spread of the thermal profile in the intermediate region between the CNM and the WNM. Enhanced molecular content at the interface of the cloud broadens the molecular line profiles and helps exciting transitions of intermediate energy. The relative molecular yield are found higher for bigger clouds. Conclusions. Turbulent diffusion can be the source of additional molecular production and should be included in chemical models of the interstellar medium (ISM). It also is a good candidate for the interpretation of observational problems such as warm H$_2$, CH$^+$ formation and presence of H$_3^+$.",
    "authors": [
      "P. Lesaffre",
      "M. Gerin",
      "P. Hennebelle"
    ],
    "publication_date": "2007-04-24T09:53:59Z",
    "arxiv_id": "http://arxiv.org/abs/0704.3149v1",
    "download_url": "https://arxiv.org/abs/0704.3149v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Unraveling Energetic Disorder in Organic Bulk Heterojunction Photovoltaics by Capacitance-Voltage Spectroscopy",
    "abstract": "Organic semiconductors possess an intrinsic energetic disorder characteristic, which holds an exceptionally important role for understanding organic photovoltaic (OPV) operation and future optimization. We performed illumination intensity dependence of capacitance-voltage (C-V) measurements in PIDTDTQx:PC70BM based organic bulk heterojunction (BHJ) photovoltaics in working conditions. Energetic disorder profiles for the photo-active layer, PIDTDTQx:PC70BM, changed significantly when different interfaces were involved. The effects of energetic disorder that could be reflected from C-V profiles are incorporated through an exponential or Gaussian model of density of states (DOS), or a combination of these two. Results underlie that an identical organic blend in BHJ solar cells exhibits different energetic disorder when it interacts with various interfaces. It may, thus, has a certain impact on OPV performances, such as open-circuit voltage (V_oc ). Our study provides device physicists a different perspective view for tailoring the organic energetic disorder parameter via interfaces in order to enhance photo-electron conversion efficiencies (PCE).",
    "authors": [
      "Xixiang Zhu",
      "Kai Wang",
      "Changfeng Han",
      "Qin Yang",
      "Xiaojuan Sun",
      "Haomiao Yu",
      "Ming Shao",
      "Fujun Zhang",
      "Bin Hu"
    ],
    "publication_date": "2017-02-15T07:19:18Z",
    "arxiv_id": "http://arxiv.org/abs/1702.04484v2",
    "download_url": "https://arxiv.org/abs/1702.04484v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "The ALMA-PILS survey: Isotopic composition of oxygen-containing complex organic molecules toward IRAS 16293-2422B",
    "abstract": "This paper presents a systematic survey of the deuterated and 13C isotopologues of a variety of oxygen-bearing complex organic molecules on Solar System scales toward the protostar IRAS 16293-2422B. We use the data from an unbiased molecular line survey between 329 and 363 GHz from the Atacama Large Millimeter/submillimeter Array (ALMA). The observations probe scales of 60 AU where most of the organic molecules have sublimated off dust grains and are present in the gas-phase. The complex organic molecules can be divided into two groups with one group, the simpler species, showing a D/H ratio of approximately 2% and the other, the more complex species, D/H ratios of 4-8%. This division may reflect the formation time of each species in the ices before or during warm-up/infall of material through the protostellar envelope. No significant differences are seen in the deuteration of different functional groups for individual species, possibly a result of the short time-scale for infall through the innermost warm regions where exchange reactions between different species may be taking place. The species show differences in excitation temperatures between 125 K and 300 K. This likely reflects the binding energies/sublimation temperatures of the individual species, in good agreement to what has previously been found for high-mass sources. For dimethyl ether, the 12C/13C ratio is found to be lower by up to a factor of 2 compared to typical ISM values similar to what has previously been inferred for glycolaldehyde. The results point to the importance of ice surface chemistry for the formation of these complex organic molecules at different stages in the evolution of embedded protostars and demonstrate the use of accurate isotope measurements for understanding the history of individual species.",
    "authors": [
      "J. K. Jørgensen",
      "H. S. P. Müller",
      "H. Calcutt",
      "A. Coutens",
      "M. N. Drozdovskaya",
      "K. I. Öberg",
      "M. V. Persson",
      "V. Taquet",
      "E. F. van Dishoeck",
      "S. F. Wampfler"
    ],
    "publication_date": "2018-08-27T09:34:58Z",
    "arxiv_id": "http://arxiv.org/abs/1808.08753v1",
    "download_url": "https://arxiv.org/abs/1808.08753v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A quasi steady-state measurement of exciton diffusion lengths in organic semiconductors",
    "abstract": "Understanding the role that exciton diffusion plays in organic solar cells is a crucial to understanding the recent rise in power conversion effciencies brought about by non-fullerene acceptors (NFA). Established methods for measuring exciton diffusion lengths in organic solar cells require specialized equipment designed for measuring high-resolution time-resolved photoluminescence (TRPL). Here we introduce a technique, coined pulsed-PLQY, to measure the diffusion length of organic solar cells without any temporal measurements. Using a Monte-Carlo model we simulate the dynamics within a thin film semiconductor and analyse the results using both pulsed-PLQY and TRPL methods. We find that pulsed-PLQY has a larger operational region and depends less on the excitation fuence than the TRPL approach. We validate these simulated results by preforming both measurements on organic thin films and reproduce the predicted trends. Pulsed-PLQY is then used to evaluate the diffusion length in a variety of technologically relevant organic semiconductors. It is found that the diffusion lengths in NFA's are much larger than in the benchmark fullerene and that this increase is driven by an increase in diffusivity.",
    "authors": [
      "Drew B. Riley",
      "Oskar J. Sandberg",
      "Wei Li",
      "Paul Meredith",
      "Ardalan Armin"
    ],
    "publication_date": "2021-09-02T10:53:57Z",
    "arxiv_id": "http://arxiv.org/abs/2109.00839v3",
    "download_url": "https://arxiv.org/abs/2109.00839v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Novel polymer nanocomposite composed of organic nanoparticles via self-assembly",
    "abstract": "We report a novel class of polymer nanocomposite composed of organic nanoparticles dispersed in polymer matrix, with the particle sizes of 30-120 nm in radius. The organic nanoparticles were formed by the self-assembly of protonated poly(4-vinyl-pyridine)-r-poly(acrylonitrile) and amphiphilic metanil yellow dye molecules through electrostatic interactions in aqueous solution. A strongly broadened Raman shift band was probed, suggesting the presence of enhanced optoelectronic property from the polymer nanocomposite. Here, using random-copolymer polyelectrolytes and mesogenic amphiphiles as the designed building blocks for self-assembly, a new approach is acutally provided to fabricate organic nanoparticles.",
    "authors": [
      "Dequan Xiao",
      "Kunhua Lin",
      "Qiang Fu",
      "Qinjian Yin"
    ],
    "publication_date": "2009-03-20T19:15:40Z",
    "arxiv_id": "http://arxiv.org/abs/0903.3592v1",
    "download_url": "https://arxiv.org/abs/0903.3592v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Classification of electronic structures and state preparation for quantum computation of reaction chemistry",
    "abstract": "Quantum computation for chemical problems will require the construction of guiding states with sufficient overlap with a target state. Since easily available and initializable mean-field states are characterized by an overlap that is reduced for multi-configurational electronic structures and even vanishes with growing system size, we here investigate the severity of state preparation for reaction chemistry. We emphasize weaknesses in current traditional approaches (even for weakly correlated molecules) and highlight the advantage of quantum phase estimation algorithms. An important result is the introduction of a new classification scheme for electronic structures based on orbital entanglement information. We identify two categories of multi-configurational molecules. Whereas class-1 molecules are dominated by very few determinants and often found in reaction chemistry, class-2 molecules do not allow one to single out a reasonably sized number of important determinants. The latter are particularly hard for traditional approaches and an ultimate target for quantum computation. Some open-shell iron-sulfur clusters belong to class 2. We discuss the role of the molecular orbital basis set and show that true class-2 molecules remain in this class independent of the choice of the orbital basis, with the iron-molybdenum cofactor of nitrogenase being a prototypical example. We stress that class-2 molecules can be build in a systematic fashion from open-shell centers or unsaturated carbon atoms. Our key result is that it will always be possible to initialize a guiding state for chemical reaction chemistry in the ground state based on initial low-cost approximate electronic structure information, which is facilitated by the finite size of the atomistic structures to be considered.",
    "authors": [
      "Maximilian Mörchen",
      "Guang Hao Low",
      "Thomas Weymuth",
      "Hongbin Liu",
      "Matthias Troyer",
      "Markus Reiher"
    ],
    "publication_date": "2024-09-13T15:27:35Z",
    "arxiv_id": "http://arxiv.org/abs/2409.08910v1",
    "download_url": "https://arxiv.org/abs/2409.08910v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "A temperature-controlled stage for laser scanning confocal microscopy and case studies in chemistry of materials",
    "abstract": "If confocal microscopy is an ubiquitous tool in life science, its applications in chemistry and materials science are still, in comparison, very limited. Of particular interest in these domains is the use of confocal microscopy to investigate temperature-dependent phenomena such as self-assembly, diffusio- or thermophoresis, or crystal growth. Several hurdles must be solved to develop a temperature-controlled stage for laser scanning confocal microscopy, in particular regarding the influence of an elevated temperature gradient close to the microscope objective, which most people try very hard to avoid. Here we report the design of a temperature-controlled stage able to generate stable temperature gradients in both positive and negative temperature range and does not require use of liquid nitrogen. Our setup provides an excellent control of the temperature gradient, which can be coupled with a controlled displacement of the sample, making it useful in particular for a variety of solidification, chemistry, and interfacial problems. We illustrate the benefits of our setup with several case studies of interest in chemistry and materials science: the 3D real-time imaging of ice growth, the segregation of hard particles by growing crystals, the freezing behaviour of single emulsions, the self-shaping of oil droplets upon cooling, and the self-assembly of amphiphile molecules into helical structures. These results show how confocal microscopy coupled with a temperature-controlled stage is a welcome addition to the toolkit of chemists and materials scientists.",
    "authors": [
      "Dmytro Dedovets",
      "Cécile Monteux",
      "Sylvain Deville"
    ],
    "publication_date": "2017-12-22T15:26:07Z",
    "arxiv_id": "http://arxiv.org/abs/1712.08510v1",
    "download_url": "https://arxiv.org/abs/1712.08510v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Clifford augmented density matrix renormalization group for \\textit{ab initio} quantum chemistry",
    "abstract": "The recently proposed Clifford augmented density matrix renormalization group (CA-DMRG) method seamlessly integrates Clifford circuits with matrix product states, and takes advantage of the expression power from both. CA-DMRG has been shown to be able to achieve higher accuracy than standard DMRG on commonly used lattice models, with only moderate computational overhead compared to the latter. In this work, we propose an efficient scheme in CA-DMRG to deal with \\textit{ab initio} quantum chemistry Hamiltonians, and apply it to study several molecular systems. Our numerical results show that CA-DMRG can reach higher accuracy than DMRG using the same bond dimension, pointing out a promising route to push the boundary of solving \\textit{ab initio} quantum chemistry with strong static correlations.",
    "authors": [
      "Lizhong Fu",
      "Honghui Shang",
      "Jinlong Yang",
      "Chu Guo"
    ],
    "publication_date": "2025-06-19T04:48:52Z",
    "arxiv_id": "http://arxiv.org/abs/2506.16026v2",
    "download_url": "https://arxiv.org/abs/2506.16026v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Investigating the hot molecular core, G10.47+0.03: A pit of nitrogen-bearing complex organic molecules",
    "abstract": "Recent observations have shown that Nitrogen-bearing complex organic species are present in large quantities in star-forming regions. Thus, investigating the N-bearing species in a hot molecular core, such as G10.47+0.03, is crucial to understanding the molecular complexity in star-forming regions. They also allow us to investigate the chemical and physical processes that determine the many phases during the structural and chemical evolution of the source in star-forming regions. The aim of this study is to investigate the spatial distribution and the chemical evolution states of N-bearing complex organic molecules in the hot core G10.47+0.03. We used the ALMA archival data of the hot molecular core G10.47+0.03. The extracted spectra were analyzed assuming LTE. Furthermore, robust methods such as MCMC and rotational diagram methods are implemented for molecules for which multiple transitions were identified to constrain the temperature and column density. Finally, we used the Nautilus gas-grain code to simulate the nitrogen chemistry in the hot molecular core. We carried out both 0D and 1D simulations of the source and compared with observational results. We report various transitions of nitrogen-bearing species (NH2CN, HC3N, HC5N, C2H3CN, C2H5CN, and H2NCH2CN) together with some of their isotopologues and isomers. Besides this, we also report the identification of CH3CCH and one of its isotopologues. The emissions originating from vinyl cyanide, ethyl cyanide, cyanoacetylene, and cyanamide are compact, which could be explained by our astrochemical modeling. Our 0D model shows that the chemistry of certain N-bearing molecules can be very sensitive to initial local conditions such as density or dust temperature. In our 1D model, simulated higher abundances of species such as HCN, HC3N, and HC5N toward the inner shells of the source confirm the observational findings.",
    "authors": [
      "Suman Kumar Mondal",
      "Wasim Iqbal",
      "Prasanta Gorai",
      "Bratati Bhat",
      "Valentine Wakelam",
      "Ankan Das"
    ],
    "publication_date": "2022-11-06T09:24:17Z",
    "arxiv_id": "http://arxiv.org/abs/2211.03066v1",
    "download_url": "https://arxiv.org/abs/2211.03066v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Quantum algorithms for quantum chemistry and quantum materials science",
    "abstract": "As we begin to reach the limits of classical computing, quantum computing has emerged as a technology that has captured the imagination of the scientific world. While for many years, the ability to execute quantum algorithms was only a theoretical possibility, recent advances in hardware mean that quantum computing devices now exist that can carry out quantum computation on a limited scale. Thus it is now a real possibility, and of central importance at this time, to assess the potential impact of quantum computers on real problems of interest. One of the earliest and most compelling applications for quantum computers is Feynman's idea of simulating quantum systems with many degrees of freedom. Such systems are found across chemistry, physics, and materials science. The particular way in which quantum computing extends classical computing means that one cannot expect arbitrary simulations to be sped up by a quantum computer, thus one must carefully identify areas where quantum advantage may be achieved. In this review, we briefly describe central problems in chemistry and materials science, in areas of electronic structure, quantum statistical mechanics, and quantum dynamics, that are of potential interest for solution on a quantum computer. We then take a detailed snapshot of current progress in quantum algorithms for ground-state, dynamics, and thermal state simulation, and analyze their strengths and weaknesses for future developments.",
    "authors": [
      "Bela Bauer",
      "Sergey Bravyi",
      "Mario Motta",
      "Garnet Kin-Lic Chan"
    ],
    "publication_date": "2020-01-10T22:49:56Z",
    "arxiv_id": "http://arxiv.org/abs/2001.03685v2",
    "download_url": "https://arxiv.org/abs/2001.03685v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Electric current noise in mesoscopic organic semiconductors",
    "abstract": "We demonstrate that nuclear spin fluctuations lead to the electric current noise in the mesoscopic samples of organic semiconductors showing the pronounced magnetoresistance in weak fields. For the bipolaron and electron-hole mechanisms of organic magnetoresistance, the current noise spectrum consists of the high frequency peak related to the nuclear spin precession in the Knight field of the charge carriers and the low frequency peak related to the nuclear spin relaxation. The shape of the spectrum depends on the external magnetic and radiofrequency fields, which allows one to prove the role of nuclei in magnetoresistance experimentally.",
    "authors": [
      "D. S. Smirnov",
      "A. V. Shumilin"
    ],
    "publication_date": "2020-12-07T17:34:14Z",
    "arxiv_id": "http://arxiv.org/abs/2012.03870v1",
    "download_url": "https://arxiv.org/abs/2012.03870v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Excitonic topology and quantum geometry in organic semiconductors",
    "abstract": "Excitons drive the optoelectronic properties of organic semiconductors which underpin devices including solar cells and light-emitting diodes. Here we show that excitons can exhibit topologically non-trivial states protected by inversion symmetry and identify a family of organic semiconductors realising the predicted excitonic topological phases. We also demonstrate that the topological phase can be controlled through experimentally realisable strains and chemical functionalisation of the material. Appealing to quantum Riemannian geometry, we predict that topologically non-trivial excitons have a lower bound on their centre-of-mass spatial spread, which can significantly exceed the size of a unit cell. Furthermore, we show that the dielectric environment allows control over the excitonic quantum geometry. The discovery of excitonic topology and excitonic Riemannian geometry in organic materials brings together two mature fields and suggests many new possibilities for a range of future optoelectronic applications.",
    "authors": [
      "Wojciech J. Jankowski",
      "Joshua J. P. Thompson",
      "Bartomeu Monserrat",
      "Robert-Jan Slager"
    ],
    "publication_date": "2024-06-17T18:00:00Z",
    "arxiv_id": "http://arxiv.org/abs/2406.11951v3",
    "download_url": "https://arxiv.org/abs/2406.11951v3",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spin dependent transport in organic light-emitting diodes",
    "abstract": "Electrically Detected Magnetic Resonance (EDMR) was used to study a series of multilayer organic devices based on aluminum (III) 8-hydroxyquinoline. These devices were designed to identify the micoscopic origin of different spin dependent process, i.e. hopping and exciton formation. EDMR is demonstrated to probe molecular orbitals of charge, and thus indirectly explore interfaces, exciton formation, charge accumalation and electric fields in operating organic based devices.",
    "authors": [
      "G. B. Silva",
      "C. F. O. Graeff",
      "F. Nuesch",
      "L. Zuppiroli"
    ],
    "publication_date": "2005-01-06T20:35:17Z",
    "arxiv_id": "http://arxiv.org/abs/cond-mat/0501122v1",
    "download_url": "https://arxiv.org/abs/cond-mat/0501122v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Membrane fouling: microscopic insights into the effects of surface chemistry and roughness",
    "abstract": "Fouling is a major obstacle and challenge in membrane-based separation processes. Caused by the sophisticated interactions between foulant and membrane surface, fouling strongly depends on membrane surface chemistry and morphology. Current studies in the field have been largely focused on polymer membranes. Herein, we report a molecular simulation study for fouling on alumina and graphene membrane surfaces during water treatment. For two foulants (sucralose and bisphenol A), the fouling on alumina surfaces is reduced with increasing surface roughness; however, the fouling on graphene surfaces is enhanced by roughness. It is unravelled that the foulant-surface interaction becomes weaker in the ridge region of a rough alumina surface, thus allowing foulant to leave the surface and reducing fouling. Such behavior is not observed on a rough graphene surface because of the strong foulant-graphene interaction. Moreover, with increasing roughness, the hydrogen bonds formed between water and alumina surfaces are found to increase in number as well as stability. By scaling the atomic charges of alumina, fouling behavior on alumina surfaces is shifted to the one on graphene surfaces. This simulation study reveals that surface chemistry and roughness play a crucial role in membrane fouling, and the microscopic insights are useful for the design of new membranes towards high-performance water treatment.",
    "authors": [
      "Mao Wang",
      "John Wang",
      "Jianwen Jiang"
    ],
    "publication_date": "2021-08-25T06:32:24Z",
    "arxiv_id": "http://arxiv.org/abs/2108.11070v2",
    "download_url": "https://arxiv.org/abs/2108.11070v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Vertical organic spin valves in perpendicular magnetic fields",
    "abstract": "We report the results of magnetoresistance measurements in vertical organic spin valves with the magnetic field oriented perpendicular to the layer stack. The magnetoresistance measurements were performed after carefully preparing either parallel or antiparallel in-plane magnetization states of the magnetic electrodes in order to observe traces of Hanle precession. Due to the low mobility in organic semiconductors the transit time of spin polarized carriers should allow for precession of the spins in perpendicular fields which in statistical average would quench the magnetoresistance. However, in none of the experiments we do observe any change in resistance while sweeping the perpendicular field, up to the point where the electrode's magnetization starts to reorient. This absence of Hanle type effects indicates that the magnetoresistance is not based on the injection of spin polarized electrons into the organic semiconductor but rather on tunneling through pinholes superimposed with tunneling anisotropic magnetoresistance.",
    "authors": [
      "M. Grünewald",
      "R. Göckeritz",
      "N. Homonnay",
      "F. Würthner",
      "L. W. Molenkamp",
      "G. Schmidt"
    ],
    "publication_date": "2013-04-24T13:38:55Z",
    "arxiv_id": "http://arxiv.org/abs/1304.6583v1",
    "download_url": "https://arxiv.org/abs/1304.6583v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Dynamically coupled kinetic chemistry in brown dwarf atmospheres -- II. Cloud and chemistry connections in directly imaged sub-Jupiter exoplanets",
    "abstract": "With JWST slated to gain high fidelity time dependent data on brown dwarf atmospheres, it is highly anticipated to do the same for directly imaged, sub-Jupiter exoplanets. With this new capability, the need for a full 3D understanding to explain spectral features and their time dependence is becoming a vital aspect for consideration. To examine the atmospheric properties of directly imaged sub-Jupiter exoplanets, we use the three dimensional Exo-FMS general circulation model (GCM) to simulate a metal enhanced generic young sub-Jupiter object. We couple Exo-FMS to a kinetic chemistry scheme, a tracer based cloud formation scheme and a spectral radiative-transfer model to take into account the chemical and cloud feedback on the atmospheric thermochemical and dynamical properties. Our results show a highly complex feedback between clouds and chemistry onto the 3D temperature structure of the atmosphere, bringing about latitudinal differences and inducing time-dependent stormy features at photospheric pressures. This suggests a strong connection and feedback between the spatial cloud coverage and chemical composition of the atmosphere, with the temperature changes and dynamical motions induced by cloud opacity and triggered convection feedback driving chemical species behaviour. In addition, we also produce synthetic latitude dependent and time dependent spectra of our model to investigate atmospheric variability and periodicity in commonly used photometric bands. Overall, our efforts put the included physics in 3D simulations of exoplanets on par with contemporary 1D radiative-convective equilibrium modelling.",
    "authors": [
      "Elspeth K. H. Lee",
      "Xianyu Tan",
      "Shang-Min Tsai"
    ],
    "publication_date": "2023-11-28T12:07:33Z",
    "arxiv_id": "http://arxiv.org/abs/2311.16722v2",
    "download_url": "https://arxiv.org/abs/2311.16722v2",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Polarization dependent chemistry of ferroelectric BaTiO3 (001) domains",
    "abstract": "Recent works suggest that the surface chemistry, in particular, the presence of oxygen vacancies can affect the polarization in a ferroelectric material. This should, in turn, influence the domain ordering driven by the need to screen the depolarizing field. Here we show using density functional theory that the presence of oxygen vacancies at the surface of BaTiO3 (001) preferentially stabilizes an inward pointing, P-, polarization. Mirror electron microscopy measurements of the domain ordering confirm the theoretical results.",
    "authors": [
      "Yanyu Mi",
      "Gregory Geneste",
      "Julien Rault",
      "Claire Mathieu",
      "Alexandre Pancotti",
      "Nicholas Barrett"
    ],
    "publication_date": "2018-06-07T12:27:36Z",
    "arxiv_id": "http://arxiv.org/abs/1806.02640v1",
    "download_url": "https://arxiv.org/abs/1806.02640v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Optical read and write of spin states in organic diradicals",
    "abstract": "Optical control and read-out of the ground state spin structure has been demonstrated for defect states in crystalline semiconductors, including the diamond NV- center, and these are promising systems for quantum technologies. Molecular organic semiconductors offer synthetic control of spin placement, in contrast to current limitations in these crystalline systems. Here we report the discovery of spin-optical addressability in a diradical molecule that comprises two trityl radical groups coupled via a fluorene bridge. We demonstrate the three important properties that enable operation as a spin-photon interface: (i) triplet and singlet spin states show photoluminescence peaked at 640 and 700 nm respectively; this allows easy optical measurement of ground state spin. (ii) the ground state spin exchange is small (~60 μeV) that allows preparation of ground state spin population. This can be achieved by spin-selective excited state intersystem crossing, and we report up to 8% microwave-driven contrast in photoluminescence. (iii) both singlet and triplet manifolds have near-unity photoluminescence quantum yield, which is in contrast to the near-zero quantum yields in prior reports of molecular diradicals. Our results establish these tuneable open-shell organic molecules as a platform to engineer tailor-made spin-optical interfaces.",
    "authors": [
      "Rituparno Chowdhury",
      "Petri Murto",
      "Naitik A. Panjwani",
      "Yan Sun",
      "Pratyush Ghosh",
      "Yorrick Boeije",
      "Vadim Derkach",
      "Seung-Je Woo",
      "Oliver Millington",
      "Daniel G. Congrave",
      "Yao Fu",
      "Tarig B. E. Mustafa",
      "Miguel Monteverde",
      "Jesús Cerdá",
      "Jan Behrends",
      "Akshay Rao",
      "David Beljonne",
      "Alexei Chepelianskii",
      "Hugo Bronstein",
      "Richard H. Friend"
    ],
    "publication_date": "2024-06-05T15:18:24Z",
    "arxiv_id": "http://arxiv.org/abs/2406.03365v1",
    "download_url": "https://arxiv.org/abs/2406.03365v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Observable signatures of wind--driven chemistry with a fully consistent three dimensional radiative hydrodynamics model of HD 209458b",
    "abstract": "We present a study of the effect of wind-driven advection on the chemical composition of hot Jupiter atmospheres using a fully-consistent 3D hydrodynamics, chemistry and radiative transfer code, the Met Office Unified Model (UM). Chemical modelling of exoplanet atmospheres has primarily been restricted to 1D models that cannot account for 3D dynamical processes. In this work we couple a chemical relaxation scheme to the UM to account for the chemical interconversion of methane and carbon monoxide. This is done consistently with the radiative transfer meaning that departures from chemical equilibrium are included in the heating rates (and emission) and hence complete the feedback between the dynamics, thermal structure and chemical composition. In this letter we simulate the well studied atmosphere of HD~209458b. We find that the combined effect of horizontal and vertical advection leads to an increase in the methane abundance by several orders of magnitude; directly opposite to the trend found in previous works. Our results demonstrate the need to include 3D effects when considering the chemistry of hot Jupiter atmospheres. We calculate transmission and emission spectra, as well as the emission phase curve, from our simulations. We conclude that gas-phase non-equilibrium chemistry is unlikely to explain the model-observation discrepancy in the 4.5\\,{\\textmu m} {\\it Spitzer}/IRAC channel. However, we highlight other spectral regions, observable with the James Webb Space Telescope, where signatures of wind-driven chemistry are more prominant.",
    "authors": [
      "Benjamin Drummond",
      "N. J. Mayne",
      "James Manners",
      "Aarynn L. Carter",
      "Ian A. Boutle",
      "Isabelle Baraffe",
      "Eric Hebrard",
      "Pascal Tremblin",
      "David K. Sing",
      "David S. Amundsen",
      "Dave Acreman"
    ],
    "publication_date": "2018-02-26T09:52:36Z",
    "arxiv_id": "http://arxiv.org/abs/1802.09222v1",
    "download_url": "https://arxiv.org/abs/1802.09222v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Spatially Resolved Chemistry in Nearby Galaxies I. The Center of IC 342",
    "abstract": "We have imaged emission from the millimeter lines of eight molecules--C2H, C34S, N2H+, CH3OH, HNCO, HNC, HC3N, and SO--in the central half kpc of the nearby spiral galaxy IC 342. The 5\" (~50 pc) resolution images were made with OVRO. Using these maps we obtain a picture of the chemistry within the nuclear region on the sizescales of individual GMCs. Bright emission is detected from all but SO. There are marked differences in morphology for the different molecules. A principal component analysis is performed to quantify similarities and differences among the images. This analysis reveals that while all molecules are to zeroth order correlated, that is, they are all found in dense molecular clouds, there are three distinct groups of molecules distinguished by the location of their emission within the nuclear region. N2H+, C18O, HNC and HCN are widespread and bright, good overall tracers of dense molecular gas. C2H and C34S, tracers of PDR chemistry, originate exclusively from the central 50-100 pc region, where radiation fields are high. The third group of molecules, CH3OH and HNCO, correlates well with the expected locations of bar-induced orbital shocks. The good correlation of HNCO with the established shock tracer molecule CH3OH is evidence that this molecule, whose chemistry has been uncertain, is indeed produced by processing of grains. HC3N is observed to correlate tightly with 3mm continuum emission, demonstrating that the young starbursts are the sites of the warmest and densest molecular gas. We compare our HNC images with the HCN images of Downes et al. (1992) to produce the first high resolution, extragalactic HCN/HNC map: the HNC/HCN ratio is near unity across the nucleus and the correlation of both of these gas tracers with the star formation is excellent. (Abridged).",
    "authors": [
      "David S. Meier",
      "Jean L. Turner"
    ],
    "publication_date": "2004-10-02T00:49:47Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0410039v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0410039v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "Methanol formation via oxygen insertion chemistry in ice",
    "abstract": "We present experimental constraints on the insertion of oxygen atoms into methane to form methanol in astrophysical ice analogs. In gas-phase and theoretical studies this process has previously been demonstrated to have a very low or non-existent energy barrier, but the energetics and mechanisms have not yet been characterized in the solid state. We use a deuterium UV lamp filtered by a sapphire window to selectively dissociate O2 within a mixture of O2:CH4 and observe efficient production of CH3OH via O(1D) insertion. CH3OH growth curves are fit with a kinetic model, and we observe no temperature dependence of the reaction rate constant at temperatures below the oxygen desorption temperature of 25K. Through an analysis of side products we determine the branching ratio of ice-phase oxygen insertion into CH4: ~65% of insertions lead to CH3OH with the remainder leading instead to H2CO formation. There is no evidence for CH3 or OH radical formation, indicating that the fragmentation is not an important channel and that insertions typically lead to increased chemical complexity. CH3OH formation from O2 and CH4 diluted in a CO-dominated ice similarly shows no temperature dependence, consistent with expectations that insertion proceeds with a small or non-existent barrier. Oxygen insertion chemistry in ices should therefore be efficient under low-temperature ISM-like conditions, and could provide an important channel to complex organic molecule formation on grain surfaces in cold interstellar regions such as cloud cores and protoplanetary disk midplanes.",
    "authors": [
      "Jennifer B. Bergner",
      "Karin I. Oberg",
      "Mahesh Rajappan"
    ],
    "publication_date": "2017-06-29T21:15:06Z",
    "arxiv_id": "http://arxiv.org/abs/1707.01120v1",
    "download_url": "https://arxiv.org/abs/1707.01120v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  },
  {
    "title": "SiO in C-rich circumstellar envelopes of AGB stars: effects of non-LTE chemistry and grain adsorption",
    "abstract": "New SiO multi-transition millimetre line observations of a sample of carbon stars, including J=8-7 observations with the APEX telescope, are used to probe the role of non-equilibrium chemistry and the influence of grains in circumstellar envelopes of carbon stars. A detailed radiative transfer modelling, including the effect of dust emission in the excitation analysis, of the observed SiO line emission is performed. A combination of low- and high-energy lines are important in constraining the abundance distribution. It is found that the fractional abundance of SiO in these C-rich environments can be several orders of magnitude higher than predicted by equilibrium stellar atmosphere chemistry. In fact, the SiO abundance distribution of carbon stars closely mimic that of M-type (O-rich) AGB stars. A possible explanation for this behaviour is a shock-induced chemistry, but also the influence of dust grains, both as a source for depletion as well as production of SiO, needs to be further investigated. As observed for M-type AGB stars, a clear trend that the SiO fractional abundance decreases as the mass-loss rate of the star increases is found for the carbon stars. This indicates that SiO is accreted onto dust grains in the circumstellar envelopes.",
    "authors": [
      "F. L. Schoeier",
      "H. Olofsson",
      "A. A. Lundgren"
    ],
    "publication_date": "2006-04-10T19:27:25Z",
    "arxiv_id": "http://arxiv.org/abs/astro-ph/0604213v1",
    "download_url": "https://arxiv.org/abs/astro-ph/0604213v1",
    "field_of_study": "chemistry",
    "document_type": "preprint",
    "citation_count": null,
    "source_repository": "arXiv"
  }
]